{
    "prof_info": [
        {
            "prof_name": "Donna Kornhaber",
            "prof_id": 3008,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2006",
            "review_content": "\nI have mixed feelings about Donna.\nOn the exterior she is great. Very approachable, seemingly interested in what you're writing about and she's a good listener. \nThe things I didn't like about her though is that she can be really rude sometimes. Someone can walk into class a minute late and she chews them out like they're five when she rarely starts on time as it is. She also gives slightly misleading advice on her drafts. My first draft I followed her advice as precisely as possible and she still gave a rather bad grade and contradicted her own advice from before. She can be kind of snippy and comes off as being kind of pretentious too sometimes.\nShe also likes to workshop one on one in class which is absoultely useless to those who aren't being workshopped and really a waste of time for 11 of 12 people at a time. \nShe is good about letting you write about whatever you want so long as you follow the structure of each progression, which is great. Her husband also subs now and then for her and he's great, lots of fun. \nOverall she's good, I'd take her any day to most other UW professors, she just needs to bring the pretention level down a bit.\nWorkload:\n4 progressions (essays). The longest is ~3500 words/\n8-10 pages. Also there are essays which you have to read and outside research, plus writing time. Overall not too bad and with moderate effor an A is totally doable. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2006",
            "review_content": "\nShe has a very flexible teaching style which is reflected in how she tries to work with the material and ideas that each student brings to class. The exercises were dropped in the beginning of the term so the main focus was on the papers. She is very committed to office hours and will make outside appointments to go over your paper and offer helpful hints for revisions. \nThe topics for the papers were entirely up to the student's decision, which was great because the you can either be consistent in your topic choices (such as religion, music, pop culture, business) or jump to totally different areas for your own personal curiosity.\nOverall, an enjoyable class for those of us in it, which is something you won't hear from a lot of people who took University Writing. \nWorkload:\nFour essays total. Essays/Pieces of literature which must be analyzed thoroughly for class discussions. Possible minor assignments, none this year.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 18, 2006",
            "review_content": "\nShe's a helpful teacher, and from what I've heard about the teachers in the other University Writing sections, one of the best and most flexible out there. She'll try to help you out as much as possible, and she makes herself available outside of class, too.\nWorkload:\nOn the first day of class, she said that she doesn't believe in busywork. Total workload includes 3 drafts, 3 essays, and a few exercises.\n"
        }
    ]
}