{
    "prof_info": [
        {
            "prof_name": "Johan Tallgren",
            "prof_id": 1830,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Ear Training IV",
            "review_date": "May 20, 2008",
            "review_content": "\nIf you're looking useful tricks to help you with pitch recognition, sight-singing, and dication, look elsewhere. If you're looking for two hours a week of dedicated practice time for sight singing and dictation, this is your class. Johan is funny and usually cheerful, chock full of endearing idiosyncrasies. He certainly made us laugh a lot. He is also a generous grader.\nWorkload:\nHe gives you things to look over and once asked us to compose an 8-bar piece. Otherwise, none.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 04, 2007",
            "review_content": "\nJohan confused me. I hated the class, completely ruined any interest I had in music. It was stressful and his lectures were unorganized and incomprehensible. He spent way too much time on the modern stuff, refused to even talk about jazz, and tended to love talking while the music was playing so that you couldn't hear anything he said. No one showed up on time, so he always started class late and so let you out late. Also, for the first month, every class about half the people would be new, for so many people dropped it. His tests were ridiculous but heavily curved, I left so many answers blank on the midterm, yet somehow ended up with an A. The papers stressed me out with their obscene lenghth, 1.5 sized font, and his refusal to allow you to have a thesis and tie the whole thing together. Although he did not give the busy work homework that so many other music hum teachers assign so that the weekly workload was not bad, when there was something due, it took me forever. Despite all this, if you go talk to him, you'll find that he is a very nice approachable understanding guy. I thought I was going to fail and regretted having not dropped the class, yet I, to my great surprise, ended up getting an A. In sum, if you're put some effort into it, you can get an A, but if you want an enjoyable non-stressful music hum, don't take Johan's.\nWorkload:\n1 opera report (4-6 pages 1.5 sized font), 1 concert report (2-3 pages 1.5 sized font), ridiculous yet heavily curved midterm, 1 final paper on american music due the day before the final (6-8 pages 1.5 sized font), 1 final exam, although he is nice and gives you the essay topics for both the final and the midterm.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 04, 2007",
            "review_content": "\nWhile the other reviews are not spectacular I don't think they fully grasp the experience of Johan's class.  It's not fun.  \"Lectures\" basically consist of him rambling on about pieces with little to no direction or coherence.  This would be tolerable if on the exams he didn't expect more than extensive knowledge of the material he oh so poorly covers.  The one bright spot would be the essays which aren't too difficult and he grades very generously.  He is a pretty nice guy outside of class but just one of the worst teachers at Columbia.  If you just want to get the core out of the way and you get stuck with Johan, I guess it's tolerable but don't look to get anything out of the class.  Otherwise stay away from Johan Tallgren. \nWorkload:\nWeekly readings, Two Conert Reports and a Research paper, midterm and final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2007",
            "review_content": "\nI don't really get Johan. He's incredibly dry and sometimes incomprehensible as a lecturer, yet he can be very clear and engaging if you meet with him one on one. He also claims to be a hard grader, but if you can write intelligently and concept-drop then you'll be fine. Personally, I did very little work for this class; I just crammed before the exams and wrote the papers very quickly, and everything was fine. (However, I'd previously taken some music theory and history, so I had that to go off.) I think Johan views this class as an inconvenience, and he didn't really inspire me (or anyone else, as far as I could tell) to put in any real effort. Still, he's a pretty nice guy... he is really awkward, though. Oh well.   \nWorkload:\nMidterm, final, concert report (2-3 pp.), opera review (4-6 pp.), research paper (6-8 pp.). (Side note: he had us do everything in 1.5-size font.) Like I said earlier, he claims to be a hard grader (he even seemed proud of it), but I didn't think he was that bad. If you can memorize concepts and names at all, you'll be fine. Attending class will become a chore in itself, though. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 11, 2005",
            "review_content": "\nThe essential problem with music hum is usually the range of musical background amongst the students in the class.  Johann does generally level the playing field by asking extraordinarily difficult questions on the exams.  Not difficult \"I should have studied harder\" but difficult \"what?! I should have studied THAT??\"  Things mentioned in passing during one lesson that ordinarily you wouldn't even jot in your notebook are planted in questions throughout the exams.  Many are only very indirectly music related. You could know the year, theme, style, composer and every instrument present in the Rite of Spring, but do you know who coreographed its first production? That said, Johann is always willing to meet with students who need help or to read your papers before the due date.  If you learn how to study for the exams, you'll do well -- he generally curves the results a bit.  Get into his humor and you might even have a good time and learn something, as I certainly did.  The discrepancy between learning and doing well on the tests is rather startling, however.\nWorkload:\n2 papers - one opera review, one research/listening - not too hard. Fun more than anything.  1 short quiz, midterm and exam - difficult!  3 reading assignments with comprehension questions.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "October 24, 2004",
            "review_content": "\nThe fact of the matter is..........you will not be able to understand him. He is an open and friendly teacher who tries to encourage class participation, but he makes the lectures so boring. He is not a hard grader, but the material that he chooses to set his midterm and finals on is so insignificant (not to say that any of the material in music hum is significant) that you will most likely over look it. The point is, I worked hard in the class, got A's on the two incredibly long papers that he assigned, but still ended up with a B in the class because of the midterm and final. One plus was that the TA (Paul) was cool.\nWorkload:\nTwo or three long papers (graded easily). Hard Midterm and Final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 09, 2004",
            "review_content": "\nI admit that Johan's tests were difficult, however, his eccentric style and comments made classes more than entertaining!  He encouraged discussion, even when when the students were reluctant to participate.  His paper topics were by no means standard; they were innovative, which made the writing experience much more valuable as a student, even for those of us who lacked an extensive musical background.  Johan's focus on sociological issues allowed us to explore music in a more relevant context.  Perhaps the best quality of Johan as an instructor was his availability outside of class.  He would never turn away a question, and was extremely helpful during the paper-writing process.  If you want an instructor who is not only extremely passionate about the subject, but is also truly invested in his students - and offers the most amusing additions to his lectures - then hope for Johan as your music hum instructor!!!  Cheers!\nWorkload:\nChill.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 13, 2004",
            "review_content": "\nMaybe if you were able to understand what he was saying more than 10 percent of the time his class would be alright. As it was those 3 hours were a waste of time and simply reading the book would be just fine. Luckily our class had a good TA but other than that what a joke!\nWorkload:\n2 papers --2nd one was an awful awful research one. midterm and final impossible\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 25, 2004",
            "review_content": "\nNot to sound to much like i am in kindergarden but to sum it up, he stunk.  This was probably one of the worst classes i have taken in columbia. We did not learn a thing about music, and the only people in the class who had a clue what was going on were people who had extensive muscial backgrounds (prob someone like the person who wrote the above review).\nFurthermore, his tests were utter nightmares--for the midterm he literaly copied paragraphs out of the textbook, took out words, and asked us to fill in the blanks.  The finals was a series of questions on completely unimportant subjects that were minimaly covered in class or in the textbook.\nThe papers were also quite difficult.  The first paper required us to anaylze an opera, of the teachers choosing and the second paper required us to have a far deeper understanding of music and the technicalities of music than the class afforded us.\nBasically, I absolutely warn you away from any class with this guy.\nWorkload:\nMidterm, Final Concert report, and a report on a piece of music that the professor chose\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 04, 2003",
            "review_content": "\nIn the words of a great swedish composer \"Bingo!\" - you've lucked out if your in Johan's Music Hum class.  He is just an all around nice guy, is very easy to talk to, and really cares about his students.  Whats more important, though, is that he really does know a great deal about the subject - you will come out of the class with a much greater appreciation and understanding of music.  Although it is sometimes difficult to understand his accent, Johan's cheerful demeanor, generous nature, and odd, yet funny habits make his class really great.  Take it!   \nWorkload:\nStandard: Midterm and final.  One concert report (app. 6 pages) and one research paper (app. 10 pages).  Very occassional short answer assignments.\n"
        }
    ]
}