{
    "prof_info": [
        {
            "prof_name": "Matt Deland",
            "prof_id": 2587,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "February 28, 2009",
            "review_content": "\nI highly disagree with the previous comment.  Matt was a dedicated teacher, put into a difficult situation because of the range of student-ability in the class and the fast paced summer schedule.  Nevertheless, he had office hours every day and was always willing to meet at other times and discuss problems.  The tests were fair in the sense that many of the problems were similar to the homeworks assigned with one or so problem more challenging.  All in all I felt I walked away appreciating linear algebra and would recommend taking a course from Matt.\nWorkload:\nHomework every week, one midterm, one final, weekly quizzes (lowest dropped).\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "August 11, 2007",
            "review_content": "\nTruly horrendous experience. He is not interested at all in teaching. He copies his own notes on the board quickly, mostly in theorem-proof-theorem-proof-theorem-proof mode (obscurely, and he often screws up on the board too), and then gives you quizzes and exams that have nothing to do with what he talked about, or even with the contents of the textbook!!!. He marks no transitions, and he makes no emphasis on important points or essential contents. And he doesn't allow formula sheets on exams either.\nAs a result, the grading of homework, quizzes and exams is absolutely unfair, so not only will you learn nothing from his class, but your GPA will suffer unduly.\nAny resemblance between teaching (even bad teaching) and what he does in a classroom is entirely coincidental. I am truly amazed that he is allowed to teach independently at Columbia.\nThe worst is I actually was very interested and excited to learn linear algebra. I guess I'll have to buy the Schaum's Outline... \nWorkload:\nTwo problem sets a week, including theory and applications, a quiz every week, a midterm and a final. It would have been doable if he had actually taught the material. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "July 04, 2005",
            "review_content": "\nOh Matt, what can I say about Matt?  Matt is really smart and really sweet.  His lectures are really easy to understand and he's always available for office hours if you need help. \nWorkload:\nproblem sets twice a week, but it was a summer course so we had to get through a lot of material quickly.\n"
        }
    ]
}