{
    "prof_info": [
        {
            "prof_name": "James Colgrove",
            "prof_id": 6321,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Social History of American Public Health",
            "review_date": "January 20, 2017",
            "review_content": "\nI took this course as a first-year in the fall. Since it was an upper-level course, I was nervous about the workload. Professor Colgrove and the TAs, however, were approachable both in person and responded to emails to help answer any questions I had about the readings and/or the 2 papers (mid-term and final). The class itself did not fall short of my expectations whatsoever because of my deep interest in public health, but more importantly, the social determinants of health. Although it was an 8:40 class, Colgrove masters the art of PowerPoints and organizes his lectures with interactive videos and role-plays about public health practices during the 19th Century helped me interact and engage so early in the morning. With all that being said, TAKE HIS CLASS. YOU WILL NOT REGRET IT. He's a great person to talk to as well if you intend to pursue a career in public health bc he works at the Mailman School.\nWorkload:\nDepending on the week, but can be tops 50-100 pages of reading a week (really interesting and you can skim a lot of it bc his lectures really cover a lot of the arguments of those readings), discussion post (depending on the TA, but I just asked a lot of questions about the readings and you can kinda bs it), weekly discussion section to discuss the readings and then one week you'll have to do a short presentation about a couple readings (you work with a partner or at least that's how my TA assigned it), and two manageable papers (mid-term and final) if you start early and gather the resources (just use the readings provided in the syllabus)\n\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "December 08, 2016",
            "review_content": "\nColgrove himself is a wonderful lecturer. Whether you complete all the reading or not, his lectures give a comprehensive view of the points made throughout the reading. Not only does he teach us the history of public health, but he also keeps the class interactive and relatable by interspersing it with videos and images and tying it back to how these public health policies relate to or affect us now. We've done class debates and a simulation of what immigrants would go through at Ellis Island, all of which were very fun!\nThe time of the class may or may not work for most, as it's 8:40 in the morning (or at least when I took it). However, I still strongly recommend this class nonetheless.\nThe workload is managebale, although some of the readings were 40-100 pages total; however, the papers are skimmable and you learn to find what main points to look for in terms of looking at the development of certain public health issues.\nThere are two papers (a midterm paper and final paper), both of which are manageable. The TAs are very helpful in writing these, though I would suggest going beforehand rather than starting it the day before the due date. Their office hours really helped save my grade for one of the papers. There is a discussion session for this class.\nWorkload:\nTwo papers (final worth a bit more than midterm) and a discussion session\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "April 07, 2014",
            "review_content": "\nThis class is hands down the best class I have ever taken at Columbia. I agree 100% with the review below and am mostly writing this so that Colgrove will get a gold nugget. \nSocial History of American Public Health is the perfect amount of work, and the perfect amount of material. At Columbia it's always hard to find classes where you will actually be able to enjoy the class because we usually get so trodden down by the insane workload and difficult exams. That is NOT the case with this class- you can easily keep up while still enjoying going to class. Colgrove does not assign any irrelevant assignments or busy work. \nColgrove is the best lecturer I have witnessed yet: he is a great speaker which always makes his lectures fascinating. Even though he mostly just talks, he never reads off notes and he uses a lot of video clips and other visual aids to break up his talking. The class covers major events in the history of public health and each week is devoted to a different topic. \nThe readings are quite heavy but you can skim most of them and still understand what is going on in the class. \nYou have three grades in the class:\nparticipation - mostly just how much you participate in discussion (And your weekly post)\n1st paper- a 5 page historiography on the topic of your choice (isn't as nearly as bad as it sounds and the TAs are more than willing to help)\n2nd paper- around 15 pages on the same topic but with primary sources to back up historical arguments (also not as bad as it sounds) \nThere is a mandatory discussion section which I hated at first but if you really like public health and you don't mind participating for 50 minutes a week in small groups then it's actually really enjoyable. I had George as a TA and he was brilliant, if a little cocky, at leading discussion. \nTake this class if you are at all interested in history, medicine, health or sociology. It's great! \n \nWorkload:\ndepends on what grade you want in the class: \n to get an A i  put in a good amount of effort, but I also really enjoyed it.\nanything between a B- and a B+ seems ridiculously easy to get\ni recommend taking the class even if you just go to experience the lectures and take it pass/fail \n\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "January 21, 2014",
            "review_content": "\nGIVE THE MAN A GOLD NUGGET. One of the most engaging speakers I have ever encountered, at Columbia or otherwise. Colgrove is at once insightful, brilliant, wonderfully articulate, and an expert deadpanner. He is a maestro of the powerpoint, filling it with media from videos, 19th century magazines, newspapers, and other documents to illustrate the colorful history of public health in America. \nThe class material is well chosen, and the readings are substantial but on the slightly shorter side for a history class and could be skimmed because Colgrove is so crystal clear about the important takeaways in his lecture that you hardly have to take notes. If you do, a quick glance at them a week later would re-tell the narrative of that class. You'd be missing out to skip the readings, though, nearly all of which were worthwhile. \nShout-out to TA Ian Shin, an exceptional discussion section leader. He brought further insight into the texts, compared them well, and helped us synthesize and consider the broader narratives of the course. He was accessible for help week to week, and literally cleared his schedule to support us come midterm and final papers. \nDo yourself a favor and take anything Colgrove teaches. \n\nWorkload:\nreading for each class (~125-175 pages/week)\nMidterm 5 page secondary source historiographical review on a topic of your choice in the history of public health\nFinal 12pg primary source paper plugging in a gap in the historical understanding of your midterm paper topic\n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "November 06, 2013",
            "review_content": "\nProfessor Colgrove is an amazing teacher. I genuinely enjoy going to class everyday. The class isn't just interesting - but interactive is well. He is constantly engaging us in debates and or giving us worksheets to fill out with partners. Even though there are close to 60 people in the class, it still feels small and Professor Colgrove seems to know everyones name. The material is fascinating as well and the readings are never too long. He also explains the readings in class and shows movies or commercials or newspaper articles that make add to the readings. He's great and if you have any interest in medicine or public health this is definitely a class for you. \nWorkload:\nreadings for class that you don't actually have to do but will still be able to completely understand material discussed in class, a 5-page midterm paper and a 10 page final paper. Super manageable - and the TA's are generally very helpful. \n"
        },
        {
            "course_name": "Social History of American Public Health",
            "review_date": "December 13, 2012",
            "review_content": "\nIf you have an interest in public health, you must take this class. Professor Colgrove is, hands down, the most engaging lecturer I have ever encountered at Columbia. From his use of video clips and pictures to give us a visual perspective on the historical era and subject matter to his surprise use of small group discussion on certain days, he always kept class interesting. I also appreciated his wit and the occasional vehement disdain for certain politicians past. Overall, you will learn a ton about how disease and public health interventions came to shape America--highly recommended for anyone at all interested in health or medicine. \nWorkload:\nReadings for each day of lecture--not gonna front, some were really dense and boring, but you learn quickly which to focus on; weekly postings and a discussion section (hint: read one of the pieces really well and make your post about that); midterm paper that is a literature review of a public health topic (6ish pages) and final paper that is a primary source research paper on the same topic (14ish pages). TAs are very helpful and walk you through making research plans for the papers, so they are totally manageable and actually give you a nice opportunity to learn more about an area you are particularly interested in. \n"
        }
    ]
}