{
    "prof_info": [
        {
            "prof_name": "Ellen Morris",
            "prof_id": 5079,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "On Dreams and Nightmares",
            "review_date": "January 11, 2017",
            "review_content": "\nI  found this course pretty manageable even though I did have two stem classes: calc III and physics I at the same time. It is probably recommended that you have some interest in psychology focusing on dreams of course, to get you through the class as some of the readings are very very long and dry. I will say though, that there are a few hidden gems in the assigned readings that really inspired me and had me researching topics we discussed in class on my own time. My impression of the class's general attitude by the end was that there were a few people who thought the professor had favorites and felt they were being viewed negatively, while another few kids got positive attention in class and were encouraged to speak up more. That was one thing that seemed odd to me. Anyways, I got a lot out of this course and it truly built up my confidence in sharing my own ideas, as there are few wrong \"ideas\" you can share in this class. It rarely felt like just a writing class. It felt like an exploration of one's own philosophy and the \"what is life\" question was brought up many times. \nWorkload:\n If you do the entire reading for a class, it will probably take around five hours. There were few people who did the entire readings for each class, of course.\n"
        },
        {
            "course_name": "On Dreams and Nightmares",
            "review_date": "September 30, 2016",
            "review_content": "\nI took Professor Morris' Dreams and Nightmares class and while Professor Morris is very sweet and her class is filled with discussion, it is still really difficult to stay engaged in the topic. The readings are very boring and long and her nightly blog posts are the death of me. I recommend you only take this course if you are planning on majoring in something neurologically related such as psych or are pre-med.\nWorkload:\nVery decent amount of work. Roughly 2-4 hours a night. \n"
        },
        {
            "course_name": "Archaeology of Egypt and Nubia",
            "review_date": "April 14, 2016",
            "review_content": "\nProfessor Morris is pretty down to earth, very approachable and welcoming when you visit her in office hours. She brought chocolate which she passed around during the midterm and final. The readings were light and consistent for this course, not too bad. I have to admit though that this was one of the driest courses I have ever taken. The lectures consist of you going from site to site, talking about what has been unearthed there and a few ideas concerning its use at the time. I had a friend who was going to visit Egypt so he was doing research of his own on places to visit and he would ask me about them to see what I had learned from class and almost always they were places we had not discussed in lecture. This is not a course for the academic tourist, rather its seems to be geared towards those students who are really very interested in archaeology and getting into the details of the lives of the people instead of large impressive monuments. I really wanted to learn more about the pyramids which are so unbelievable in the manner in which they were constructed that I was hoping to spend quite a bit of time on that but, alas, we breezed through them in half a class during the first few weeks. At the end of the day I don't really feel like I learned much from this course which will be useful going forward, I do feel like I learned a lot of things that would be useful if I were going into the field of Egyptian Archeology, however. I recommend going to the first two weeks of this class, if you like the pace and material of those first two weeks, the rest of the semester stays pretty much the same.\nWorkload:\nMidterm\nFinal\nFinal Paper that included a trip to the Met in which each student gave an informal talk on the object they wrote on\n(She is a very lenient grader!! Pretty easy to get an A in her class)\n"
        },
        {
            "course_name": "Archaeology of Egypt and Nubia",
            "review_date": "April 14, 2016",
            "review_content": "\nProfessor Morris is pretty down to earth, very approachable and welcoming when you visit her in office hours. She brought chocolate which she passed around during the midterm and final. The readings were light and consistent for this course, not too bad. I have to admit though that this was one of the driest courses I have ever taken. The lectures consist of you going from site to site, talking about what has been unearthed there and a few ideas concerning its use at the time. I had a friend who was going to visit Egypt so he was doing research of his own on places to visit and he would ask me about them to see what I had learned from class and almost always they were places we had not discussed in lecture. This is not a course for the academic tourist, rather its seems to be geared towards those students who are really very interested in archaeology and getting into the details of the lives of the people instead of large impressive monuments. I really wanted to learn more about the pyramids which are so unbelievable in the manner in which they were constructed that I was hoping to spend quite a bit of time on that but, alas, we breezed through them in half a class during the first few weeks. At the end of the day I don't really feel like I learned much from this course which will be useful going forward, I do feel like I learned a lot of things that would be useful if I were going into the field of Egyptian Archeology, however. I recommend going to the first two weeks of this class, if you like the pace and material of those first two weeks, the rest of the semester stays pretty much the same.\nWorkload:\nMidterm\nFinal\nFinal Paper that included a trip to the Met in which each student gave an informal talk on the object they wrote on\n(She is a very lenient grader!! Pretty easy to get an A in her class)\n"
        },
        {
            "course_name": "Identity and Society in Ancient Egypt",
            "review_date": "June 27, 2013",
            "review_content": "\nI took Professor Morris's Identity and Society in Ancient Egypt class and it was a wonderful experience!  I highly recommend the class based not only on the material (which was fascinating), but also because Professor Morris is one of those terrific teachers who truly love teaching their subject.  She is an absolute delight to learn from and presents the material is a very organized and thorough manner.  I had never taken an Egyptology course before this class, but it didn't negatively affect me because Professor Morris presents a well-rounded history of ancient Egypt that explained both basic historical events and wider reaching societal customs including important cultural moments and ideas.   I would absolutely recommend this class to anyone, whether interested specifically in Egyptian history or not, as it is a well taught class about an incredibly interesting subject.  \nWorkload:\nReadings to do before each class that will make the midterm and final easier.  You won't be tested otherwise on them, but most were a manageable length and interesting enough to make you want to read them.\nOne 3,000 word paper due towards the end of the semester.  \nMidterm - 3 essays in class with 5 prompts given beforehand.  (If you prepare all the prompts then you'll be fine)\nFinal - Same thing as midterm, but with 5 essays to be written in class.\nOverall workload is completely manageable and most of the work was enjoyable.  \n"
        }
    ]
}