{
    "prof_info": [
        {
            "prof_name": "Rahul Mazumder",
            "prof_id": 12822,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Statistical Inference",
            "review_date": "January 22, 2014",
            "review_content": "\nMazumder is a new professor, Fall 2013 was his first semester at Columbia and it showed. In a number of ways it felt like he was trying to figure out how Columbia worked, and how he wanted to structure the class, as we went along. The good news is that it was generally improving, the bad news is that it started pretty poorly.\nHe used Casella and Berger, a great and very standard book. I think it's slightly more advanced than many 4107 classes, but it's really the book they all should be using. The descriptions can be terse, and it lacks examples at times, but it's generally well written and rigorous.\nLectures were largely LaTeX slides based on the Casella and Berger examples, and posted online (usually after class). He used the blackboard frequently, and I generally found that more useful than the slides. I found the lectures mixed in terms of learning. Sometimes they were really helpful, often I felt like I didn't understand the point. Frequently his examples would be all very similar, and I wouldn't understand the limits of a theorem. He would often use very similar examples (ie only use the normal for a certain theorem), and it wasn't clear what was specific to the normal, and what wasn't.\nThe January 15 review describes the midterms reasonably well. The first one was punishingly difficult and graded leniently. The second was much easier, it felt like it was from an entirely different section, but graded much more strictly. The final was in between, and didn't focus on the stuff I expected (e.g., no regression).\nI found the homeworks hard, very time consuming, and felt unprepared for them. Office hours, when I could make them, were generally too crowded for me to get meaningful help. I ended up using the Casella and Berger solutions for hints when I got stuck frequently. Toward the second half of the class he started writing his own questions, which were similar to the C&B; questions, maybe a touch easier.\nIn general he seemed fairly motivated to teach, and I think he improved during the semester. I would guess in another few semester he would be perfectly fine, at least compared to other stats professors here.\nWorkload:\n10% weekly homeworks, time consuming and difficult, but graded generously. \n2 midterms, one was very hard, one was fairly easy. Final.\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "January 15, 2014",
            "review_content": "\nHe teaches this class at a pretty theoretical level. I'm not sure how to feel about that... In any case, his lecture notes come from the textbook for the most part--he posts his powerpoints online. HW comes right out of the textbook and was graded pretty leniently.\nHis first midterm was pretty brutal. Average was like a 30%. It had a lot of tricks and stuff that was not explicitly taught in class--you moreso had to apply the basic concepts in class in a way that you might not have expected. Second midterm was a lot easier--questions were pretty similar to examples done in class/basic concepts. Overall, second midterm was more straightforward--average was around a 50, I think. \nFinal was also pretty straightforward, I thought. It had a few parts of questions similar to midterm 1, but for the most part I felt like it was similar to midterm 2. \nWorkload:\nweekly hw, 2 midterms, and final\n"
        }
    ]
}