{
    "prof_info": [
        {
            "prof_name": "John Huber",
            "prof_id": 952,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Data Analysis and Statistics",
            "review_date": "May 06, 2015",
            "review_content": "\nProfessor Huber is a kind man.  Friendly and approachable.  His TAs are a bit arrogant but helpful.  HOWEVER, the disorganization and inability to maintain consistency cripple his effectiveness. This crippling was noted by Professor Huber a few times, stating that the results of quizzes and assignments are how he knows he has failed as an instructor.  We started with being told we would have up to 12, two of which would drop(15%).  We had 7.  We were told we would have 6 assignments, we had 5, last one due the final day of class and an optional 6th due during reading week(40%).  The first 4 favored heavily the knowledge of Stata, not statistics. A midterm(20%) and a final (25%).  The final was held the last day of class, regardless of heavy end of semester work loads.  The final was extremely complex and like the quizzes was loaded with trick questions.  That would not be an issue if early in the semester Huber and TAs had not explicitly and repeatedly expressed their intention not to trick students and to be looking for what you know, not what you don't.  During the quizzes it was common place for the professor to admit multiple answers were correct, or that the question itself was poorly written or wrong all together.  During the second to last week of class we were informed that that structure of the grading was going to change, still unclear of exactly how that went.  The professor explicitly said, in the beginning of the semester, that there is no required reading, but if for some reason you do not understand the lecture the readings were supplemental.  He did so in a way that implied that if you needed the readings, you were not paying attention.  NONE of that is true.  Many students resorted to purchasing textbooks as an attempt to understand what he was teaching.  If you find yourself in this class, form a group IMMEDIATELY, do ALL the readings, seek out a tutor or additional resources and keep personal record of quiz answers, returned assignments and midterms.  Compare all answers and grading with others in your group to ensure fair and accurate grading.  This class required heavy student monitoring of all aspects of grading.  If you are not working in a group, or posses a strong statistics background, it will be extremely difficult to succeed in this course.  That being said, for my class, a 75% on assignments and quizzes was great (At one point the professor stated that when 42% of the class got a question right, the class was doing \"Great\").  \nWorkload:\n6~ assignments that require 4-7 hours of work.\n7~12 quizzes require PRECISE knowledge of course material regardless if it was taught in class\nMidterm was Stata heavy\nFinal was nearly all concept and interpretation (taught rushed in final week)\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 19, 2011",
            "review_content": "\nNow, I took Huber's class because I had to. Culpa really scared me, because it paints a picture of a man who is boring, uninterested in students, and unfair in grading. I was terrified that his class would suck. As a student who made a C+ in his class, I could badmouth him like the rest of you who have never gotten a bad grade in your life and are taking it out in the form of an anonymous professor rant. Instead I will be honest in my critique for you.\nHuber is NOT boring. He has passion for the subject. He works off powerpoint, but he does engage the class, and has fun classroom votes and experiments throughout the semester. Video clips are spiced in as well. Please note - many subjects that Huber will include on the midterm and final are only briefly touched upon on the powerpoint, but explained in class for 30min...so try to at least attend one class of his a week.\nHuber is NOT uninterested in students. Huber is just a very busy individual. He is the department chair. Instead of being scared of him like I was at first, go and talk to him. He always stays after class to answer questions. He holds office hours and keeps to them religiously. He is a nice man with a bad rep. He has the appeal process and diverts to TA's because his classes are so large and he has a life, believe it or not, out of the classroom.\nHuber IS unfair in grading. This is because the grading is done at random, and not by him at all  but by his TA's. Again, he has large classes, so this seems unavoidable. There was only one good TA - Ali. The other two - Tabinda and Brett - mean well but are disorganized and have no passion for the subject. I disputed both my midterm and my second 3 page paper and after the long process, my appeals were rejected. I made an A on my first paper which was the same outline/method, then received a C on my second. The same paper essentially, just different graders. It's luck of the draw, really. Appeal to Ali. Had I to take this course again, I would have appealed over and over until I got my A. So try that method if your grades don't go as you wish.\nGood luck. And don't be scared of Huber. He's above average, at least! :)   \nWorkload:\n2 three-page papers, midterm and final (quasi-comprehensive). \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 08, 2011",
            "review_content": "\nThe other reviewers generally have it right when it comes to Professor Huber's abilities as a lecturer - he is on the whole painfully dry, uninteresting, disorganized and unable to engage students, and reads off his own notes for most of the lectures (with the exception of a couple when we learned about the median voter theorem/party politics that were actually interesting). It was so easy to just fall asleep during lecture, especially as the lecture slides by Professor Huber were just as disorganized as his teaching, with numerous spelling errors and no real attempt at clarity of explanation, which made them very difficult to revise from and review concepts unless you paid extremely close attention in class. There is no denying, however, that the material covered in class was very interesting and compelling - I very much liked the first half of the semester's work on concepts of democracy, though it is also true that many of the readings were way too long, and seemed unnecessarily so, especially as some of them weren't even discussed. It was virtually impossible to have done all of the weekly readings by the midterm/final (at least if you really wanted to have a thorough understanding of content). My other gripe, which may seem strange, is that I felt that the final did not adequately cover all the material we learnt, perhaps because the breadth of the course material was just so wide. \nThis class's ONLY saving grace is Ali (the TA), who is absolutely FANTASTIC. She is the complete opposite of Huber - lively, engaging, energetic, able to stimulate discussion and keep them interesting, and organized. She was competent, responsible and knowledgeable, and always comes to section prepared with her own summaries of all the week's readings (pretty remarkable when you consider how many there were). Most importantly, she clearly cared very much about students, and was always willing to help us out outside of class (whether it was with papers, reviewing them after we got them back, or revising for the exams). I honestly think this class was only made bearable by her and her hard work, especially as she made a lot of the concepts we learnt a lot easier to understand (a far cry from the other TAs, whose sections I also went for).\nOn the whole, an interesting class that is worth taking (based on the material), but I'd stay clear from Huber's class; you'd be better off with another professor. Take his class only if you have Ali as a TA. \nWorkload:\n2 three-page papers (one before and one after the midterm, both worth 20%), one midterm (worth 25%, with IDs, short answers based on readings and one long essay), one final (worth 35%, with IDs, calculations, and two short essays).\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 24, 2010",
            "review_content": "\nWhat a horrible class.\nAlthough I'm certain that Professor Huber had the best of intentions, his lecturing was disorganized and lackluster on a good day, the readings were tedious and unnecessary, and the TAs tended to grade as if it was a real (not intro) course.  Even though we were discussing interesting material, everything seemed boring coming out of Huber's mouth.\nDon't get me started on Brett's inadequacy both in stimulating interesting discussion and clarifying readings or topics discussed in lecture.  (I went to the optional discussion section all of two times.)\nI'm the type of student who tries to go to all his classes, but this was so painful that I stopped around three weeks in.  The only thing that got me through were the relatively well-organized lecture notes that are put up on courseworks weekly.  They cover almost everything that you'll need to know for the tests.\nIf you're a PoliSci major and need to fill intro course requirements, please take IR and American.  Even if you're going into comparative.  \nWorkload:\nLong readings.  I got an A- doing absolutely none of them.\nTwo three-page pagers that are a joke.\nMidterm and final:  mostly IDs and two short essay questions that will have been emphasized in class... so maybe it's a good idea to at least get notes.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 15, 2010",
            "review_content": "\nI really liked this class. I thought it was interesting, and relatively well-presented. Professor Huber reads directly off his notes during some of the lectures, which are painfully boring, but at other times does a really good job presenting the material and making sure the class is engaged. He responds to questions and always stays after class if anyone has outstanding questions. The reading is fairly unnecessary, I didn't do much of it throughout the semester; I don't think anyone did. The two papers that we had were both on interesting topics, and were fairly graded, but by the TAs. The midterm was doable, if a little crunched for time, and the final was along the same lines. Overall, I thought it was an interesting class for someone who is looking at a political science major or concentration.\nWorkload:\nTwo three-page papers with really broad topics, a fairly doable midterm and a final. Discussion section, which is almost completely useless.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "August 05, 2009",
            "review_content": "\nThis course should not have been as boring as it was. The course material covered was very broad and there was little structure, which made it hard when it came to exam time and we were told that anything and everything said in the course so far would be fair game for IDs and short answers. The grading was overall very harsh and based upon a rubric that was released after the assignments were due. I think that I learned a lot and am glad I took a course in comparative politics, but wish it had been with a different professor. If you can avoid this course, do! The professor lacked passion and clarity--especially with the numerous mathematical models he employed, which just mystified everyone. The readings were ridiculously long and numerous. I can't emphasize enough how impossible it was to be prepared for discussion section. \nWorkload:\nTwo papers, midterm, final, discussion section. See above for details on the readings. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 12, 2009",
            "review_content": "\nClearly uninterested in undergraduate students. All graded assignments were randomly distributed as if to undo any possible help the feedback had provided. Any appeals for grades had to be done through an official and time-consuming process which could allow for a TA to even lower the grade of a student -- Professor Huber refused to regrade anything himself. Huber has a lot of jaw about 'fairness' but in practice seems to believe in quite the opposite.\nShockingly (but not if one has taken this class), Prof. Huber specifically states in his syllabus his disinterest in any communication with students. Seems to have planned his office hours in the morning and only one day each week in order to avoid being bothered by those pesky undergrads.\nIf Prof. Huber had bothered to stop singing the praises of laissez-faire capitalism or braying about how the government was \"stealing\" money from the AIG executives, he might have noticed a not-terribly-frequent student trying to ask a question every once in a while. Instead, he seems more interested in reading directly from his lecture notes or powerpoint slides.\nAssignments were vague and seemingly graded in an arbitrary manner. All assignments were randomly distributed so there was no point in reading any feedback, as the person grading your next assignment might be expecting something entirely different from the last. There was essentially no way to appeal a grade. Possibly the grossest injustice was the fact that all assignments and exams were graded by a rubric whose guidelines would only be provided after the assignment or exam had been graded. Readings were seemingly chosen for their length rather than substance, including one assignment of nearly a hundred pages which was no longer even relevant. So-called \"essay\" assignments were expected to be merely a regurgitation of subject-matter rather than to provide any substantive or unique analysis of a given situation. Confined to three pages, frequently any attempt to be anything less than deadeningly boring would result in the drastic . Ability to use the English language and such basic tools as \"transitions,\" \"introductions,\" and \"conclusions\" were apparently punished, not rewarded. Daring to include a thesis frequently seemed to be grounds for receiving nothing higher than a B.\nProfessor Huber seemed to be more interested in keeping assignments as short as possible (any deviation from the strict page-limit or other formatting guidelines would result in a disproportionate loss of points) than fostering, amongst his students, any ability to analyze anything other than how to get Microsoft Word to provide the 1\" margins he fetishized so much. In both exams and assignments, insight was punished or ignored rather than rewarded -- theses on in-class exams or out of class \"essays\" were optional and frequently resulted only in going over the ridiculous page limit. Instead, TAs were instructed (one can only assume -- because, were Transparency International to examine the workings of this class, Prof. Huber's 'administration' would rank worse than many of the most brutal dictatorships) to look for keywords. In this class, mentioning the material related to a 'keyword' but not the word itself can result in a 1/3 letter-grade punishment. \nAs for cultivating interest in comparative government or political science generally, the consensus seems to be that Prof. Huber made many, many political science majors seriously rethink their major. One suspects that many now-history majors were formerly political science majors who made the awful mistake of taking this class. \nWorkload:\nTwo essays which you are conveniently not informed of in the syllabus, or even informed of more than two weeks beforehand, so it's impossible to plan work for other courses around it; approximately 100-200 pages of 8.5\" x 11\" readings every week (count on using up your printing quota on this class alone for most weeks of the semester) of dense and thoroughly interestingly material; a midterm and a final. \nDon't expect guidelines or, indeed, any sort of help whatsoever for any of these assignments.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "March 09, 2009",
            "review_content": "\nThis class made me seriously reconsider whether I want to actually major in political science. While Professor Huber is a nice guy as a person, as a professor, he seems somewhat lacking in areas.\nSeemingly every reading spends a significant amount of time discussing just exactly how awesome free-market capitalism is. Professor Huber basically taught this as fact and expected us to regurgitate this on exams and papers. Taxes are explained as \"anti-growth\" and defined as \"confiscatory\" rather than people actually contributing to the public good. While we do briefly cover public goods theory, it is cursory and Huber seems to believe that government should provide public goods and nothing more.\nTo be fair, rubrics for papers are posted on CourseWorks, but, conveniently, only after we get our papers back. Don't count on using the same rubric twice, since they're specific to each assignment. Also, since the papers aren't graded by your TA but instead all papers are randomly distributed amongst the TAs, don't count on having same-quality papers getting the same grade.\nIf you feel that your grade isn't fair, you can write up an appeal to your own TA, which takes almost as much work as writing the essay itself. But, and here's the truly awesome part, the TA has the option of lowering your grade if you appeal. You can't appeal to Huber himself. He also explicitly states that he doesn't want e-mails from anyone in the class unless you are specifically directed to do so by your TA.\n\nWorkload:\nThere is no textbook. Instead, there are an almost-ridiculous number of readings which are seemingly picked by virtue of being thoroughly uninteresting. While Huber makes an attempt at uploading most of the readings to courseworks, some of them are nearly impossible to find since the links he provides to the articles on JSTOR and similar websites are sometimes broken.\nThere are a few short papers (you're limited to three pages), a midterm (worth 1/3 of your grade), and a final (worth 1/3 of your grade).\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 22, 2008",
            "review_content": "\nWhat a horrible class. He obviously did not care one bit about the students and was just there because he had to be. An uninspired set of readings, totally uninteresting lectures, and no contact with actual students. The TAs essentially led the class, and the only interesting parts of the class were when students would raise their hands and take over. I looked forward to when he would play news clips because those were the only fresh parts of the class. It seriously made me question Political Science as a major. Don't take his class if you can help it.\nWorkload:\nReading that is easy but mostly boring, attendance at TA section mandatory, midterm/final graded by TAs. He basically does nothing.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "August 31, 2008",
            "review_content": "\nProf. Huber is a nice man and it is obvious he knows the material but the class itself was slow. Discussion sections focused heavily on reviewing ideas from the lectures however the tests were based more on the readings. A major curve was used otherwise most of the class would have failed easily. \nWorkload:\nDecent amount of reading each week which can be confusing at times especially when not strongly reviewed in discussion. A 5 page research design paper was assigned with little guidance making it extremely difficult. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "July 22, 2008",
            "review_content": "\nMediocre class. Material wasn't very interesting. A lot of memorization. Best part of the class - tying what he taught us to events happening around the world. He's a nice guy but it just wasn't an amazing class. How you do in this class all depends on your TA - they do all the grading. You could get lucky or end up with self-important, harsh, unfair TA that expects way too much out of you, like this class is the only one you're taking. (Oh and the discussion section is torture - no one ever had anything good to say.)\nWorkload:\nMidterm and Final that were both intensely curved. Reasonable reading load for a Poli Sci Class. Paper at the end that is manageable as long as you consult your TA in advance.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 21, 2008",
            "review_content": "\nAlthough this was a huge class, Huber was a great lecturer.  He helped to make a relatively boring subject fairly interesting, and I feel like I learned a lot from the course.  \n\nWorkload:\nEven though he was a really great lecturer, this class was a lot of work.  It has a midterm and final, in addition to a research design (an insanely difficult, ambiguous paper, on which you have basically no guidance).  The professors and TAs are tough graders, but there is a generous curve, so I think most people end up doing fine in the class.  However, you definitely have to work for it.  I studied a solid three days for the midterm, and about four days for the final, and ended up with a high B.\n"
        },
        {
            "course_name": "Politics of Western Europe",
            "review_date": "January 28, 2002",
            "review_content": "\nProfessor Huber presents an institutional approach to understanding European politics. He is an engaging professor who really seems to care about the material. You get the sense that he has you read articles written exclusively either by himself, or by his friends. Huber's research is elegant and his teaching style is great. I would recommend the class\nWorkload:\nTwo six-page-maximum research papers, Midterm, Final, moderate reading.\n"
        }
    ]
}