{
    "prof_info": [
        {
            "prof_name": "Benjamin Johnson",
            "prof_id": 6342,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II",
            "review_date": "May 19, 2012",
            "review_content": "\nBen is a fantastic teacher, and like other reviews I highly recommend him.  Spanish 3350 (Hispanic Cultures II) rushes through a ton of material- over 500 years of the history of Spain and Latin America are covered in 1 semeter.  However, rather than focusing on memorizing dates, Ben emphasizes the readings, the social movements, and how either will relate.  He is incredibly knowledable.\nIt is worth noting that classes with Ben are never boring as he has a good sense of humor, and loves allowing students to do group work.  Additionally, while he is not ethnically hispanic, he speaks amazingly fluent spanish, and I feel like I have learned a lot from him.\nAt the beginning of the course, he seems a little intimidating (the course itself is a lot of work, and Ben always expects a full effort), but it is definitely very doable.  I feel like I am a stronger reader, writer, and speaker after taking this class with Ben.\n\nWorkload:\nPretty heavy, but the course website designed by the department proves that it was not Ben's choice to make it that way: 7 compositions (1 per chapter covered) of 500 words each (3 with rewrites) which take some time but are useful for the exams, and 3 exams with no final.  We also each had to do a 5-10 minute lecture of a reading which was not a big deal at all (most people typed up what they were going to say before class verbatim and did fine).\n"
        },
        {
            "course_name": "Spanish 3332 (Now 3330)",
            "review_date": "January 04, 2011",
            "review_content": "\nI have had Ben for two semesters now and I cannot recommend him enough. He is a really great professor, who seems to genuinely enjoy teaching.  He brings a lot of enthusiasm and joking to what could otherwise be a boring subject. Moreover, he is a pretty relaxed grader and he is very sympathetic to the fact that students have a lot of other classes on their plate. He is also very patient with students still learning Spanish, and makes sure to talk slowly and clearly. As long as you do the reading (but you can skip a few), you will do fine. I found both his classes to be just enough work to teach me a lot about a new subject - but still so enjoyable as to be my favorite classes of the semester. \nWorkload:\n4 essays (graded twice, with the grades averaged), and a short reading for each class\n"
        }
    ]
}