{
    "prof_info": [
        {
            "prof_name": "Matthew Putman",
            "prof_id": 10657,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Particles and Polymers",
            "review_date": "May 29, 2011",
            "review_content": "\nThis is a special topics in Material Science course offered in Spring Semesters and as online CVN course during the summer. Prof. Putman is excellent in his delivery of the course content and is very approachable.\nThe best thing about this course is that a lot of it is based on Prof. Putman's extensive experience in the industry. A lot of Mat Science courses tend to be theoretical and lacking in direct applications. However, Prof. Putman with his experience in the polymer manufacturing industry - addresses real world problems like improving production and quality control, scaling up of lab processes, cost, etc.\nThe course lacks a rigid well defined structure - which is good or bad, according to individual tastes. Prof. Putman encourages constant feedback on the course content and changes it based on feedback. He encourages a discussion in class and continuously revises concepts, which ensures that 90% of your exam preparation is done by just attending the classes.\nThere are 2 exams, a midsem and an endsem with equal weightage. The questions are case studies and logic based questions, which donot require too much of information and are strictly based on the class work. The grading is liberal - if u take part in the class discussions - you will be well prepared for the exams and you can get an A with minimal revision.\nAs for pre-requisites: Its good to have Material Science courses under your belt, but really - any engineering or science major student can easily grasp this course - you just need the basic (freshman level) concepts of physics.\nLast but not the least, Prof Putman is one of the nicest guys you will ever come across. I would strongly recommend this course - and indeed any course offered by Prof Putman.\nWorkload:\nNo Assignments.\nOne Midsem (50%) and one endsem (50%)\n"
        }
    ]
}