{
    "prof_info": [
        {
            "prof_name": "Alison Krueger",
            "prof_id": 2259,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 01, 2010",
            "review_content": "\nGreat teacher, and an enormous irritation to deal with in your life. Just get out of her section as soon as possible. She will annoy you, I can guarantee it. She does not know how to deal with people. She is socially incapable. She knows how to talk in literary dialect, but not American dialect. She lives inside the world of books, not of people, which is why probably 80 percent of around 30 person class left at midsemester. I stayed because unfortunately my schedule didn't permit another section, but try to leave if you can. Literary smarts combined with social ignorance is not the right place to go.\nWorkload:\nShe varies it. But it's basically the same for any section- she'll assign small assignments apart from reading some times, but basically all lit hum sections should have around equal workloads.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 04, 2009",
            "review_content": "\nI have to say that I am fairly disappointed with Krueger as a Lit Hum teacher. Her classes are incredibly didactic; rather than open up a text for debate, she gives an opinion which students are not really allowed to contradict successfully in discussion, as they will always have a snappy refutation of their argument. Consequently lessons are very dry, and seem to last far longer than the time they actually take up. Her teaching makes me feel very uninspired by the texts studied, as the opinions I develop are rarely in exact line with what she believes about the text in question. The problems I have with her on this level are not specific to me only. Often people come out of class and say \"Wow, we actually had a small moment of real discussion between the students today.\"\nHer marking is also somewhat absurd. The large majority of her time seems to be spent on pointing out debatable grammar errors, for which she uses abbreviations like \"awk\". I would not have such a big problem with this were she not to fall victim to errors such as misspelling \"slaughter\" as \"slauter\", confusing \"too\" and \"to\" and giving us handouts about \"the cods\" and \"tree will\". Also, the single-minded teaching approach bleeds into her marking, as you will rarely receive credit for any idea that she does not agree with, seemingly regardless of the justification provided in the paper.\nWorkload:\nA fair amount more than other lit hum classes, but not ridiculous.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 27, 2008",
            "review_content": "\nKrueger was a very adequate teacher, she clearly enjoys teaching the material (especially the Quixote), and was generally a pretty fair grader. She was, however, incredibly boring. Her lectures were usually very dry and unhelpful. I felt I rarely got any substanitive insight into a work in class. She also had a habit of starting really dry discussions about works, which were about as unhelpful and uninteresting as her lectures. She is a huge fan of close reading and the best (and only) way to do well on papers and midterms is to be a good close reader. \nWorkload:\ntypical for lit hum, altough perhaps an extra paper or two.\n"
        },
        {
            "course_name": "Spanish I",
            "review_date": "December 09, 2004",
            "review_content": "\nAlison is the best Spanish teacher that I have ever had.  She is very approachable and clearly explains every concept.  She is available both inside and outside of the classroom and is extremelly knowledgable.  \nWorkload:\na quiz for every chapter, a few short compositions, and daily workbook pages that are extremelly easy\n"
        }
    ]
}