{
    "prof_info": [
        {
            "prof_name": "Guobin Yang",
            "prof_id": 2676,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Contemporary Chinese Culture and Society",
            "review_date": "December 08, 2006",
            "review_content": "\n\nProfessor Yang is great! He presents the material clearly and did an excellent job of facilitating class discussions, even in a class of about forty students. The readings are also very thoughtfully chosen, and they're totally manageable - two or three 20-page journal articles per class. He also has a very warm personality and is approachable. He made a point of remembering everyone's name, so that even normally shy students felt comfortable speaking up. \nThe course itself is designed to teach students about the economic and socio-political changes happening in China in the past thirty years. Professor Yang teaches the class by theme rather than chronology. Students should definitely have taken an intro class on China before signing up, since a lot of the discussions rely on a pretty good foundation of knowledge of modern China.\n\n\nWorkload:\nNot bad - two analytical papers, take home final, and one class presentation. Usually three articles assigned for reading per class period.\n\n"
        },
        {
            "course_name": "Civil Society, Public Sphere, and Public Protest in Contemporary China",
            "review_date": "December 02, 2005",
            "review_content": "\n\nProfessor Yang is amazing!!! He cares so much about his students and provides an amazing curriculum. He organizes the syllabus into clear thematic zones and timely sticks to the schedule. Professor Yang provides plenty of feedback regarding student performance and ideas. He also allows the student to explore any personal interests in the class in depth. He was able to foster discussion in a classroom full of more shy students. He is extremely knowledgeable regarding the development of civil society in China, particuarly on the internet and environmental NGOS. He was also involved in Tianamen 1989. IF you are interested in this subject matter, he will make the class extraordinarily fulfilling. I think he will be a future gem to the Columbia family!!!\n\n\nWorkload:\nThere's admittedly quite a bit. You have response essays every week, a presentation, a final project, and a presentation of said project. The readings average between 60-90 pages, so very manageable.\n\n"
        }
    ]
}