{
    "prof_info": [
        {
            "prof_name": "Katherine Biers",
            "prof_id": 4613,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 03, 2017",
            "review_content": "\nProfessor Biers was absolutely amazing. She is well versed in her material, and even reads the books at the same time as we are. She makes good use of the board, which helps the visual learners in the room, through the use of diagrams. She's flexible and understanding and really tries to help you if you are struggling, so long as you are open with her. Discussion allows for students to speak their thoughts but if there's ever a dull moment, she will chime in. She expands others ideas to help the class progress. Grading is fair but if you feel the need to redo an assignment, just ask.\nWorkload:\nFair. Reading is heavy but that is to be expected. Midterm of all passage ID's. Essays on the Final. 2 essays for the semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 08, 2011",
            "review_content": "\nKatherine Biers was an absolutely fantastic Literature Humanities professor.  She has great insight and leads a discussion better than any professor I've encountered at Columbia.  Instead of coming into class with some message she wants to convey, Professor Biers brings in something she herself wants to work out.  This may seem not as informative at first, but it means that she is so much more genuinely interested in what everyone has to say, as everyone's contribution can count towards a greater picture we are all trying to see.  \nProfessor Biers paper topics can seem intimidating at first, but she gives a lot of guidance at the beginning of the year for how she likes her papers written (begin with a quote, put your argument in contrast or in support of what could be said about the subject you're arguing).  I found her grading very appropriate to how I felt about the quality of each paper, and also found her feedback very insightful and helpful.  Unfortunately, she is not teaching the course next year, but I would highly recommend anything she teaches.  She is AMAZING.\nWorkload:\nFor Lit Hum, 3 papers/semester (average 5-6 pages each), midterm, final, weekly discussion post.  Very manageable.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2010",
            "review_content": "\nProfessor Bier's second semester Lit Hum class is just as triumphant as the first, although student energy and participation is more flagging. To reiterate what's been said about this brilliant woman, I'll quote another student verbatim: \"Lit Hum is boring, but she's fucking smart.\" Using the Socratic method to its fullest possibilities, Biers drives at the heart of the text, giving the class complete expositions of whatever themes she wants to explore for that two hours. In addition to delivering absolutely rivetting seminars, outside of the classroom Prof. Biers is very kind to provide us with helpful background information (but not always free from errors) and thought-provoking questions.\nIn summary, most excellent professor. Be happy if you're assigned to her section (you've deserved it), but don't try to transfer in. You'll most likely never make friends there, hardly anyone will like you, and you won't benefit as much as students who have her both years.\nGood professor, good selection of books to read, good classroom location and times...but \\horrible classmates in the 09-10 school year. A most untrustworthy bunch: they promised to throw a lit hum party, but that never came to be.\nWorkload:\nSame Lit Hum books as are required, although Prof. Biers has been very lenient this semester in excerpting from the excerpted texts (e.g. Augustine, Dante, Don Quixote). Three papers, which seem like a lot when compared to sections that only assign two. At least they are all minimum 1200 words only. Midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 03, 2010",
            "review_content": "\nProfessor Biers is a LitHum goddess sent down from Zeus to nurture the minds of uncultured freshmen. Unbelievably intelligent, patient, thoughtful, and caring, Professor Biers is everything you could possibly hope for in a LitHum seminar discussion leader. She is always concerned about the mental health of the class, constantly engaging us in playful banter before class to lighten up the mood, especially on days with dreary weather. The discussions flow extremely smoothly, as she always knows what we are trying to say and then repeats it in an even more intelligent form to help everyone else understand. Her thoughts are pointed, developed, and really just plain old brilliant. She is supremely friendly and is more than willing to meet with you before every single paper to discuss your ideas with you (believe me, I've done it) and help you process and develop them into a cogent and though-provoking essay that you never considered yourself capable of composing. Though her midterms were rather difficult and it's not easy to get above a B+/A- on any of the essays, I never considered switching out of her class for second semester because I knew there was no way I could get a better quality discussion anywhere else. If you are a freshman and reading this, you are probably already stuck in a LitHum section you can't get out of for first semester, but if you can, PLEASE switch to Professor Biers for the spring. I promise you will never regret that decision.\nWorkload:\nClassic LitHum: three papers, some random (really short) ungraded assignments, a midterm that will likely destroy you but it's only 10% of your grade (watch out for the IDs), and the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 29, 2009",
            "review_content": "\nProfessor Biers is great at leading seminar discussions. She is very knowledgeable on the Ancient Greek and biblical texts. Her classes are always well-planned, yet never stiff. She'd start off by posing some profound question that stimulates our discussion. Her true skill lies in her letting the students answer what she want's them to say. You never feel her Lit Hum degenerating into a lecture (as I know can happen to some other sections), but her invisible hand is always present to guide the discussion along. Her picking of students to speak is very strategic.\nBeing a 19th-20th century drama specialist, she loves modern works about the classical texts we read. This is evident in her choice of additional readings: mostly recent literary criticism essays of the ancient epics and plays. Her paper topics are especially geared to prepare us for college level writing. She would often ask us to compare and analyze two different works and see what conclusions we'd come to. Clarity of voice, originality of ideas, and scholarly penetration are especially important to her. Overall I feel like I learned a lot from her first semester of lit hum.\nWorkload:\nStandard lit hum course. All readings, plus two additional essays, covered. 3 papers, each approx. 6 pages long. 1 midterm (written by her) and department wide final. Both exams are very easy. Be prepared to spend lots of time on the reading and papers.\n"
        },
        {
            "course_name": "20th Century American Drama",
            "review_date": "March 02, 2009",
            "review_content": "\nThis woman is excellent.  At first she is very intimidating, but that's just because she's crazy smart.  Her classes are very interesting and the reading she gives you is extremely relevant to the course.  I never felt that one assignment was irrelevant or just \"busy work.\"  The course was comprehensive but it also incorporated some criticism.  A lot of times she paired a play with an article critiquing it.  It forced me to look at the plays and just drama differently, which I really liked.  It was nice to not just have a survey of 20th Century American Drama.  Plus, Professor Biers is extremely approachable.  Go to her office hours and talk in class.  Even though she may seem intimidating, she is extremely open to her students' comments and thoughts.  I would definitely take another one of her classes.\nWorkload:\nA play a week plus an article or two.  It was extremely manageable, though there were time where it felt a lot.  The midterm was ridiculous - lots of IDs that were impossible and very tightly timed short answers/essays.  The final was much more manageable (24-hour take home) because you could choose which plays you wanted to write on.  She also gives you prompts.  There also is a presentation component to the course that isn't as scary as it sounds.  Also, a paper or the option of a research paper to take place of the final.\nBeware, this woman is extremely strict on due dates and the TIME of when things are due.  She's willing to discuss extensions, but just know that if she wants something at 5 p.m., she means 5 p.m.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 2008",
            "review_content": "\nKatherine is AMAZING.  I cannot recommend her highly enough.  If you can get into this section, do so immediately.  She's brilliant, great at directing discussions but not dominating them, and incredible interesting.  She also is relatively laid back, which is a nice balance to the intense syllabus.\nWorkload:\nAll the Lit Hum readings, well distributed.  (The Iliad is by far the longest / hardest reading--don't worry).\nFour papers, which is a lot, but your grades on them tend to improve gradually, partially from your actual writing improvement and partially from her easing up.\nMidterm is IMPOSSIBLE.  The IDs will destroy you.  They sure make the ones on the final look easy though.\nAnd department-wide final.\n"
        }
    ]
}