{
    "prof_info": [
        {
            "prof_name": "Patricia Stokes",
            "prof_id": 634,
            "total_reviews": 38
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Psychology",
            "review_date": "December 23, 2016",
            "review_content": "\nAt first I was puzzled why professor Stokes was highly rated. She talked so quietly she was barely audible, and her notes on the board were (in the words of a classmate) \"a disaster.\" I considered bailing, but after a whole semester I'm glad I stayed. While her lectures stayed a bit difficult to follow, it wasn't hard to make sense of them by looking over my notes after the fact. She was actually a deceptively good teacher, and very fair. She only tested on material presented in class (didn't need to buy the textbook), and didn't ask trick questions. The material was fascinating, and more neuroscience-oriented than I'd expected for an Intro to Psych class. We learned a lot about learning (which is her specialty) and stress, which were both very practical for students. I'd definitely recommend this class to anyone (well, maybe not to the hearing impaired!) even if you think you're not interested in psychology.\nWorkload:\nNot bad. Three exam: two midterms and a final. Each midterm includes a take-home essay, plus an extra credit take-home essay. With the extra credit it isn't hard to get a 100 on the exams. For the final she gave us three essays through the last weeks of class, basically summing up the lectures about a particular subject and applying it to a specific case. The final exam was brief. The essays weren't hard, and forced us to learn the material well, which made the exams easier.\n"
        },
        {
            "course_name": "Reacting to the Past - First Year Seminar",
            "review_date": "December 14, 2016",
            "review_content": "\nShe was the absolute best Reacting professor! Very easy going class, but she knew how to facilitate discussion. \nWorkload:\nVery modest, a few readings (1-3), an op-ed, and a 1-2 speeches per game\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 29, 2016",
            "review_content": "\nProfessor Stokes is a great professor.  I thought she was a little harsh for the first few weeks, but she warmed up to us by the end of September.  She is a really smart woman and is understanding about different learning styles.  Professor Stokes uses a lot of diagrams, and they are really helpful.  As for the exams, she assigns 2 take home essays per midterm, one of them being extra credit.  It is foolish to not do the second essay, because it helps you get a handle on some of the topics, and it can boost your grade if you're not a great test-taker.  The class itself is not easy, especially at the beginning of the semester when it is neuroscience heavy, but as long as you pay attention in every class and study a few hours per week, you should be able to do well.\nWorkload:\n-2 midterms, 2 take-home essays per midterm (one required, one extra credit)\n-Final and take-home essays\n"
        },
        {
            "course_name": "Introduction to Psychology",
            "review_date": "May 03, 2015",
            "review_content": "\nI valued Stokes' accessibility as a professor. It is easy to ask questions in class or approach her after lecture. After hearing anecdotes about her husband Ronny, suburban upbringing, adverting career, and vacations to exotic locales, I feel that I know her as a person. I do wish that she would eliminate irrelevant anecdotes, and just tell ones that pertain to psychology. \nThroughout the course, I craved more information. I know that this is an introductory class, but I felt that we barely skimmed over the brain and other critical topics. As Columbia students, we are intelligent enough to handle a more rigorous and in-depth curriculum. \nWhenever Stokes was asked about the neurochemistry that drives behavior, she would stumble and have to look at her notes. She is most knowledgable about problem-solving and presented a fascinating powerpoint about the psychology of Monet's creativity. The math program that she created for elementary-school students is also impressive. \nStokes is clearly a visual learner, and often would present information in schematic diagrams. It was difficult for me to digest concepts in this way, since the connections between ideas (drawn with arrows, lines etc.) were vague and confusing. \n\nWorkload:\n3 tests and essays. Very light. \n"
        },
        {
            "course_name": "Reacting to the Past - First Year Seminar",
            "review_date": "January 17, 2015",
            "review_content": "\nProfessor Stokes is a GREAT teacher! The class is never boring.  Her Reacting to the Past class is not quite as intense as the other sections seemed to be but it was still enjoyable and informative.  She gives a few assignments but is a lenient grader.  She gives almost everyone an A unless they \"lose\" that privilege.  She is very understanding and wants her students to succeed and learn as much as possible in their college years.  Take ANYTHING she offers - she is th best :D \nWorkload:\na few homework assignments, public speeches, final assignment \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 01, 2013",
            "review_content": "\nProfessor Stokes is a near-perfect professor for Intro Psych. She presents the material clearly, assigns very little, and writes fair exams. There are assigned textbook chapters but it's not remotely necessary to read them because the only things on the exams are things she covers during class (class attendance is more significant than the reading). Most of the material is legitimately interesting and she tells great relevant anecdotes and takes students' stories and questions. She's super approachable and very reasonable about grading and help. In the beginning of the course she admitted that she was aiming for everyone to get an A and teaches the course that way (judging from the grade postings, not everyone got an A, but about 2/3 of the class received final grades in the A range).\nWorkload:\n3 exams, non-cumulative, including hand-in essays on the days of the tests. Really fairly graded, and always with extra credit opportunities. The test with the lowest grade is weighted least.\n"
        },
        {
            "course_name": "First-Year Seminar / Reacting to the Past",
            "review_date": "December 16, 2012",
            "review_content": "\nReacting to the Past with Professor Stokes was incredible!\nI was very apprehensive about taking Reacting at the beginning of the year. It was not my first choice seminar and I'm very knowledgable about history, so the lack of emphasis on historical accuracy really bothered me at first.\nHowever, as the term went on, I grew to love the class. Professor Stokes is very good at moderating the intense discussions/arguments that take place in Reacting to the Past. The nature of the curriculum makes it so you want to put everything into the class. \nYou also really get to know your fellow classmates because of the nature of this class. By the end of the term, my Reacting to the Past classmates and PStokes felt like family. Professor Stokes even invited us over to dinner at the end of the term.\nI can't wait to take Professor Stokes's psych class next term!\nWorkload:\nProfessor Stokes maintains the philosophy that you will get an A unless you prove to her that you don't deserve it. So you're pretty much guaranteed an A, unless you don't show up to class or don't do the work.\nHaving said that, the approximate workload is: a moderate amount of reading at the beginning of each game--responses to readings to be graded. 3-10 speeches, depending on which roles you get in each game. 3 op-ed pieces.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "February 22, 2012",
            "review_content": "\nPatricia Stokes is by far the most humane professor I have EVER had. It is rare to find a professor who will personally reach out to you if you have any difficulties in the class. I am a complete screw up when it comes to handing in assignments and she always sets up meetings with me to make sure my academic and personal life isn't crashing. You could go up to her an say that you suffer from the oedipus complex and she will be nonjudgmental, talk to you about it, and serve as your advisor when it comes to finding help. Not only is she a great teacher, she provides to be outstanding when it comes to supporting and caring for her students. I think this woman is amazing, and it only takes one individual meeting with her to have your eyes opened to the heart she has. I was lucky enough to have her as my professor twice so from experience I advise you to   ***take her Reacting to the Past class ANDDDD her intro to Psych course***!!!! She focuses on keeping students engaged in material instead of dumping loads of irrelevant work on our plates. \nP Stokes u da best \nWorkload:\nFair amount of work\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 23, 2010",
            "review_content": "\nProfessor Stokes is a fantastic Intro to Psych professor. Not only does she make the class extremely interesting and hilarious by adding her own personal anecdotes to almost every lecture, but she tries to make the class even more interesting and relevant by not following the text book and focusing on what she thinks is important. Her teaching methods make it so that no class is ever boring. However, you have to attend every class because her tests focus almost 90% on her lectures. Though there are sections on the text, you really only need to annotate your lecture notes with the text book and read the sections she tells you to read right before the exams. GREAT intro class.\nWorkload:\n3 non cumulative tests, 2 essays to hand-in the day of the exams. Very fair.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 07, 2010",
            "review_content": "\nI recommend this course whether you are majoring in Psych, fulfilling your science requirement, or are just interested in Psych.\nStokes does a great job of presenting and explaining the material.  There are 3 non-cumulative tests.  You have to write an essay for each test which can be a pain but is actually very helpful for studying.  There is also an optional 2nd essay for each test - DO IT!  You can get up to 20 extra credit points! \nThe only annoying thing about this course is that she doesn't give A+s.  She says that people get 100 on the tests with the help of extra credit and therefore, does not believe in giving anyone an A+.  \nAlso, her handwriting is very hard to read.  Students are continuously squinting to try and understand what she wrote but you can usually decipher it.  She also says what she is writing out loud which makes it easier\nOverall, I am very happy that I took this course with Stokes.  I really feel like I am coming out of the class with a clear understanding of psychology and I even decided to minor in the subject.\nWorkload:\n3 non-cumulative tests. 1 essay due the day of each test which an optional 2nd essay for each test to count as extra credit.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "June 29, 2010",
            "review_content": "\nStokes can be entertaining, and lectures are almost always interesting. The class is what it is- intro to psych, nothing particularly deep but a fairly interesting overview. She adds in her own anecdotes to make it less dry.\nSo many people sign up that she has to do a lottery on the first day, so entrance is not guaranteed. \nDefinitely go to lectures and take notes, as tests are based on the lectures. The reading is essentially optional. It's best not to do it at all until before the test, when you might want to go back to read about something she mentioned but wasn't clear about. \n\nWorkload:\nTwo midterms and one final, all weighed evenly. Some questions are confusing, but extra credit essays on the first two make it almost impossible to do poorly if you're actually trying even a little bit. Studying for these exams is the only work involved, other than showing up. The final is also shorter and easier. Note: She does not give A+s because of all the extra credit opportunities. (Some people complained.) \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 04, 2009",
            "review_content": "\nWhile this class was super easy and I made a 100 on every test, this professor is the most inappropriate professor when it comes to imposing her views onto her students. I am probably one of the most moderate people at Barnard when it comes to politics, religious views, etc., but this teacher managed to rub so many people the wrong way not only during lecture but outside of class. She brags about how affluent she and her husband are (spending time at their \"country house\" which is actually a 2x4 shack in Jersey) all semester. If anyone believes in anything outside of her democratic, left wing views, she does not respect you. If you want an easy A, take the class with this professor. But if you are a republican, an orthodox Jewish person, or believe fundamentally in Islam, just prepared to be offended at some point during the semester.\nWorkload:\n2 midterms and a noncumulative final. take-home essays for extra credit.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 12, 2009",
            "review_content": "\nDefinitely not worth the hype. Stokes is a fine lecturer but nothing spectacular so don't try too hard to get in your class. Her tests ask random questions sometimes, but you have a take home essay with an extra credit essay as well (always do the extra credit) so it's not that hard to do well in her class. I recommend glancing over the reading at some point before each exam, especially to write the essays. \nWorkload:\n2 midterms and a final (non-cumulative) with a take home essay and an extra credit essay for every test. 10 credits in a lab (same for every psyc class) which is just annoying.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 11, 2009",
            "review_content": "\nAfter all the hype about Stokes I was really disappointed. She definitely wasn't bad, but there wasn't really anything that special about her and I wouldn't really put her among my favorite professors I've had. To her credit she was extremely approachable and always answered questions raised in class, no matter how off-topic. She also shared a lot of cute/interesting anecdotes about her family and friends and own experiences in advertising and art. Aside from that, however, her lecturing style wasn't particularly stimulating, her writing on the board was difficult to read, and the workload and grading was extraordinarily easy. Overall not a bad class but not anything to write home about. \nWorkload:\nA chapter or so a week in the textbook, 2 midterms and final. (With optional extra credit essays for each exam to be written in advance.) Exams and essays were very easy. Majority of the class got A's and 5-10 even got A+'s on pretty much every exam. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 11, 2009",
            "review_content": "\nAs most of the reviews say, Professor Stokes is a wonderful woman and teacher. She makes every class exciting and interesting, and adds stories about her experience in the psychology field. She explains everything in its easiest form -- it is very important to take notes every class. Although the book that goes along with the course is helpful, her exams are based on the notes she gives you, so don't rely too much on the book to prepare yourself for the 2 midterms and the final. She will tell you exactly what will be on the exams so it is very fair. Although it is very easy to get behind on the weekly reading, it is very helpful to read the chapters along with her lessons. This will make studying easier so there won't be so much to cram when the exams come around.\nWorkload:\nReading every week (Recommended but not required), 2 midterms (with 2 essays assigned with each), and one final with 2 essays. \n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "January 27, 2008",
            "review_content": "\nProfessor Stokes is a great teacher and a great person. If you take a class with her, you will hopefully come to understand both of these facts, because she does not, under any circumstances, leave her personality out of the classroom--and that's what makes her classes so engaging! She brings 100% of her intelligence and energy to class, and expects her students to do the same. As a Reacting professor, she emphasizes student creativity within the games, encouraging students to come up with new solutions to historical problems. Also, her method of grading papers and class participation allows students to stop worrying about getting an A and really focus on learning the material and enjoying themselves, resulting in the achievement of an A anyway. I would recommend any class with  Stokes, no exceptions. \nWorkload:\n2-3 papers per game (a total of 6-9 for the semester), average amount of reading, and a very straightforward final paper. Lots of class participation necessary.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 28, 2007",
            "review_content": "\nProfessor Stokes is an amazing professor. Her lectures are packed with information, and interspersed with really interesting anecdotes. She often talks about the (really fascinating) results of particular studies to illustrate some of the more difficult concepts. She's a very engaging lecturer -- you definitely won't be looking at the clock. Her class is difficult to get into, because everyone wants it -- but it's totally worth it.\nWorkload:\nTwo exams and a final. The final is the same length as the other exams, one class period. Two short take-home essays for each exam, plus an in-class portion -- multiple-choice and fill-in-the-blank. Very light in between tests. Participate in 5 hours of research -- basically, you show up to be the guinea pig in certain painless on-campus studies. No reading. Very manageable.\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "March 07, 2007",
            "review_content": "\nProfessor Stokes is AMAZING. I wasn't too keen at first, but now I'm crazy about her! She is a really great teacher, very flexible, and so incredibly smart. \nReacting is also a great class; I highly recommend it as a first-year seminar. \nWorkload:\nSeveral speeches, 3-one page op-ed pieces, a final 2-page paper.\nNot bad at all.\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "March 07, 2007",
            "review_content": "\nProfessor Stokes is AMAZING. I wasn't too keen at first, but now I'm crazy about her! She is a really great teacher, very flexible, and so incredibly smart. \nReacting is also a great class; I highly recommend it as a first-year seminar. \nWorkload:\nSeveral speeches, 3-one page op-ed pieces, a final 2-page paper.\nNot bad at all.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 03, 2006",
            "review_content": "\nA lovely person, an excellent teacher overall.  Could assign reading with more specificity, rather than waiting right before the test to tell us what we didn't have to read.  Otherwise, I learned volumes.  She even teared up during one of her more passionate lectures.  How teaching and learning should occur everywhere.\nWorkload:\nCompletely reasonable, absolutley fair grader\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "May 03, 2006",
            "review_content": "\nThis is a fun course, even if you're not into history. The speeches are fun and you really get into the characters and the game. Participate and make some effort on your speeches and you'll be fine.\nWorkload:\n(confusing) reading assignments, at least 2 speeches per game = 6 speeches, 3 op-ed pieces\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 20, 2006",
            "review_content": "\nProf. Stokes is very nice, and the class is very easy. Not particularly stimulating, but not boring either. \nWorkload:\nLight. 3 easy tests. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "August 29, 2005",
            "review_content": "\nProfessor Stokes' Introduction to Psychology was extremely encouraging and insightful.  I feel so enthusiastic about presuing Psychology as a major for my undergraduate studies.\nWorkload:\nRegular readings, 3 take-home essays to turn on each of the test days (including the Final).\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 06, 2005",
            "review_content": "\nMy only recommendation is to not count on getting into this class due to the lottery process. If you do get it, lucky you. Professor Stokes is fantastic. She makes the most mundane material interesting and is a very engaging lecturer. She was always willing to talk about a topic or answer a question after class as well. Even more amazing is that she learns people's names in a 50 person class (as long as you talk to her either during or after class). The class material itself is mostly interesting, although some portions are boring. Go to all the lectures as that is the basis of most of the exams and all the essays. Don't read until before the exam as that is when she tells you what's necessary. \nWorkload:\n3 exams, not cumulative. 1 paper with each exam as well as one easy extra credit that I would recommend doing. None of the papers have a space minimum or maximum.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 06, 2005",
            "review_content": "\nProfessor Stokes is great.  Her lectures are clear and her tests are fair.  The class is interesting and she always gives unique examples.  I would definately take this class again. \nWorkload:\n3 tests: all multiple choice with take home essays.  not difficult if you study and go to class!!\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 17, 2004",
            "review_content": "\nI cannot begin to express my disappointment with this professor.  She was anything but amazing, like many of the other CULPA reviews said, and I am very sorry I allowed these reviews to determine me taking Stokes' class.  Her lectures were confusing, disorganized, and not that easy.  The textbook itself is good, and very clear.  I learned more in my high school introductory psych class than I did in this course.  Additionally, the professor is not the nicest woman, and as a learning psychologist, you would imagine she should be understanding and kind, and not insenstive and assuming.\nWorkload:\n3 tests (no midterm or final)- the multiple choice questions were confusing and at times, not straightforward\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 16, 2004",
            "review_content": "\nI, like every other sheep in the herd, did all I could to get into Professor Stokes' Intro. to Psych class. In retrospect though I should have just taken the class with another professor and not spent a whole semester waiting to get into Stokes' class. Yes, Professor Stokes is quite a nice woman and the class workload was quite light, but I would have gladly taken a harder course if I could have had a better professor. Professor Stokes seems to take pleasure in her somewhat celebrity status, but didn't fulfill my expectations. In my opinion, she favors those students whom she has had in previous courses and frequently admits them over other students into the class, despite her \"lottery\" policy. Also, her weekend trips to the lake seem to take precedent over her students, so if you have a problem you had better have it addressed by her before Friday afternoon as she does not return to NYC until Monday morning. In addition, Professor Stokes enjoys regaling us with tales of her grand piano and the wealth that she acquired in the advertising business, etc which might offend anyone whose parents make under 100,000 a year. Lastly, the workload is fairly easy but the test and essay questions are at times quite absurd and cause more heaadache than necessary. Professor Stokes is by no means straightforward in her testing. Who wants to spend and entire essay analyzing the personality traits of President Bush or John Kerry, considering that we don't know them personally!? My advice is avoid the wait for this overrated class and go with someone who knows a bit more about the field and isn't so concerned with their country house.\nWorkload:\n3 tests with essays. Extra-credit essays as well. Text readings as supplements to the lectures.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 15, 2004",
            "review_content": "\nA lot of people think that she is absolutely amazing, but I did not find her that great!   I think she is a very organized professor however.   She is responsilbe though.   She does not curve and there's always a lot of people in the class who do soooooooooo good on exams (like 100 on the first two exams).   Her exams are mostly MCs, definitions with some fill-ins and diagrams.\nWorkload:\n3 take-home essays for your 3 in-class exams!   No HWs, just go to class.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 11, 2004",
            "review_content": "\nProfessor Stokes is amazing on so many levels. The ease with which she teaches reflects her mastery of the material and perhaps more fundamentally her understanding of the art of teaching.  Plus she's extremely personable, totally approachable and available (inside and outside the classroom) if you have questions.\nIf you can get into her class, do it. It's guaranteed to be one of the highlights of your experience at Columbia.\nWorkload:\nTo do well on tests your class notes are essential. Yes, you need to go to class and take good notes as the readings serve to compliment lectures. Though I can't imagine why anyone would want to miss class since her lectures *rock*.\n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "May 04, 2003",
            "review_content": "\nI got shafted into this class, it was my absolute last choice, but it actually was a lot of fun. Professor Stokes wasn't bound by the rules of the game or the class when she thought that they got in the way of the learning process. She was very approachable and understanding, also she was very receptive to comments and criticism about the format of the class itself. She is tech-savvy and sent very amusing emails containing hints, and strategies for the games themselves. I completely recommend taking reacting with her if you can at all, it was great fun, and not very difficult.\nWorkload:\n30 pages total, split up among three games. Seems stiff, but very doable, and the writing can easily be done the night before.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "March 25, 2003",
            "review_content": "\nProf. Stokes had been talked up by a lot of people so she had a lot to live up to. And she really did! She's such an intelligent woman (and yes, opinionated, but better that than a softy in my opinon).  I thought at first she was biased towards the guys in our class (and I have to admit, I was a little irritated that Barnard girls weren't speaking their minds more and asking questions! but they came around) but once the class started to settle in, the girls have started to do more of the talking.  I absolutely don't think that she doesn't or won't expect much from girls (as a previous reviewer unfairly said) and I don't think she caters to them either.  She's a go-getter teacher: if you don't try, she won't get to know you, regardless of your sex! And Intro to Psych is such a piece of cake with her.  She's clear and descriptive - ok I will give the other reviewer that she seems scatterbrained at times, but that hardly takes away from the informativeness of her lectures.  I have a lot of respect for this woman, and hope to keep her as a resource for the rest of my time here at Barnard. You won't lose if you have her for a teacher.\nWorkload:\nReading is fine, book is pretty comprehensive and self-explanatory.  3 exams, non-cumulative, some detailed questions from the book, but not too bad.  Do both essays! They help you study, the answers are all right there in her notes and in thebook, and they boost your grade. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 23, 2002",
            "review_content": "\nShe is absolutely amazing. Her lectures were engaging, informative, and interspersed with lots of personal anecdotes, her tests were unbelievably fair, and even the textbook was good. I learned an incredible amount, which applied to almost everything else I was learning, not to mention life in general. Take her course! \nWorkload:\nPretty fair, you need to go to the lectures though, and do the reading, nothing excessive or unexpected\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 09, 2002",
            "review_content": "\nEveryone says she's really great but be careful because she's EXTREMELY unlenient when it comes to missing classes. So watch out... although everyone still says she's really great, so maybe she's your style.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 31, 2002",
            "review_content": "\nProf. Stokes is an approachable, easygoing, and kind person. She really enjoys listening to students in and out of class. She is a great lecturer as well-she does a good job of giving interesting stories to make concepts clearer. Also, she is a professor that wants her students to do well. Before each test, she goes through each chapter, highlighting important terms/concepts that will be on the test. Take advantage of the extra credit essays on the second and third tests-they will really help your grade if your struggling with multiple choice/fill-in-the-blank. Enjoy her class-she is a fantastic prof. and an interesting person.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 27, 2002",
            "review_content": "\nShe was nice, and the questions brought up in class were enough to keep the class interesting. She was free to speak with her when you needed, and always let you know ahead of time what was going to be on the tests. However, the vocabulary used on the tests was new and difficult to understand unless you had vigorously read. Other than that she wasn't that bad. The final exam was super easy and non-cumulative.\nWorkload:\n3 tests, none cumulative, take home essays for tests and opportuinity for extra credit.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 18, 2002",
            "review_content": "\nI love this woman! The class is interesting, if a not bit science heavy, but she is wonderful!\nWorkload:\nThree tests, not cummulative, and she tells you what you need to know and what you don't.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "July 07, 2001",
            "review_content": "\nFor the guys out there from Columbia -- if you are looking for an intro. psych course to take and you want some attention from the professor, this is the one. Because this is a Barnard course, guys stick out like sort thumbs and Professor Stokes eats it up! She loves to know you by name and if you are a Michigan State University basketball fan, she'll love you even more. As for the ladies out there, she'll get to know some of your names but otherwise don't expect her to expect much of you. Also, if you want a unbias professor - well don't choose any of her courses. She is outspoken and uninhibited about sharing her political opinion. While I am as much of a Bush opponent as the next liberal out there, she takes it to an extreme that is obnoxious and irritating. As for the material, the psychology focuses on the biological sciences. Stokes does not hide her opinion about the other covered therapies such as psychoanalysis. Be prepared to stay on top of the material - while she presents it in a semi-organized style and the book is pretty handy to supplement whatever she doesn't cover very well, the exams cover A LOT. All of the multiple choice questions are detailed and many force you to apply concepts to material not discussed in class. The saving graces are the essays that she allows you to take home and write before the actual exam. One must be written and the other is optional - although you would be a downright, egotistical bastard to believe you don't need to do the extra credit essay. Her questions are tough and weed out the students who do the reading and those who don't. You'll need those extra points - that being said though, don't spend an incredulous amount of time on them because she only skims them over for general concepts and facts. While the word is that she is the prof. to get if you are taking intro. to psych, I'd be mortified to know how bad the other professors are. Stokes is completely disorganized - often losing her lecture notes and having no clue where to start from until she checks with her students. Furthermore, she is habitually late to class. To her credit, she is easily accessible by email and after 4pm.\nWorkload:\nthree exams - the final is an exam that is not cumulative and only covers the last third of the material.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 06, 2001",
            "review_content": "\nStokes is tremendous lecturer; she uses fascinating and often funny anecdotes to provide real-life examples for some pretty abstract psychological theories and models. Her lectures make it easy not only to take notes, but also to stay awake. It's a great class for non-science majors, especially since each exam has an essay section and an optional bonus essay. Prof. Stokes even has a lecture on the psychology of art, which is her speciality.\nWorkload:\nNot too bad. Stokes tells you page-by-page what parts of the textbook are on the exams. There are three tests, multiple choice with an essay.\n"
        }
    ]
}