{
    "prof_info": [
        {
            "prof_name": "Attila Pok",
            "prof_id": 2932,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "History of East Central Europe 1878-1956",
            "review_date": "May 19, 2011",
            "review_content": "\nThe class has title has been changed to 1919-1990 but I'm pretty sure it's the same material. \n Professor Pok possibly might be the nicest and most easily approachable professor I've had so far at Columbia.  He'll always set up time to see you in his office and talk to you before and after class.  He even came to class 40 minutes early every class to help people with their final papers.  \nHe loves the subject matter, which makes sense since he's from the area (Hungary), and his lectures are useful and the readings are extremely useful.  The main subject matter is hatred and fears in the region.  If you do the readings and gain a good understanding of the region you'll do great in the class.\nYou also don't have to buy a book for the class since he uploads a reader on courseworks!  Big plus.\nWorkload:\nA midterm 15% of grade, a final 35% of grade, and a final paper 40% of grade.  Your grade is also impacted by your attendance 10%, he doesn't actually take attendance but make sure he knows who you are.  If you do better on the final than the midterm, the midterm doesn't count, but if you do better on the midterm than the final, the midterm does count.  Readings are sometimes really short and sometimes really long but they aren't hard, make sure you do them.  \n"
        },
        {
            "course_name": "History of East Central Europe 1878-1956",
            "review_date": "April 18, 2009",
            "review_content": "\nPros: Professor Pok is one of the nicest professors that you will ever come across at Columbia. It's clear that he is incredibly knowledgeable about East Central Europe (if a little biased towards his native country of Hungary) and is very accessible during office hours. Also, a relatively easy A. \nCons: The lectures are a bit dry, a little all over the place, and hard to follow. \"Hatreds and fears\" were the class mantra, and TAs were the saving grace. If you can pick, go for Aimee, who often brought in supplementary readings to help out those of us who were completely lost. The midterm didn't count, for as Pok said, \"it can only help you!\" which seemed great, until it got to the end of the semester and you panicked and realized that your grade basically was being determined by the term paper and the final. We would often talk about the effects of events, like the Bolshevik Revolution, not actually talk about the event itself. \nOn the whole, I think that I would have gotten more out of this class if I had previously taken Euro, but even for those who did, it was generally frustrating. \nWorkload:\nEasy-medium. Midterm (that doesn't count), weekly discussion section, 8-10 page term paper, final. \n"
        },
        {
            "course_name": "Majorities and Minorities in Eastern Europe",
            "review_date": "May 13, 2006",
            "review_content": "\nYou'll never guess what they did to Poland...\nActually if you have any Euro History background at all you are aware that they partitioned Poland....5 times.  But Professor Pok never tires of reminding his class of this fascinating topic.\nThis class is easy.  I mean really really ridiculously easy.  If you've taken Euro, that is.  You don't have to read at all. You go through one or two of the readings right before the midterm and outline an essay on a topic he's given you in advance, and you get a perfect score if you can formulate passable english sentences.  Same with the final.  Memorizing dates and geography will be a bitch, but only for the night before the test.\nPok is also one of the nicest men I've met.  Genuine, understanding, accomodating.  All of this makes me feel bad for thinking that the class kinda sucks.  If you've taken Euro, you won't learn anything new, and if you haven't you'll probably be lost.  If you need some \"freshman foregiveness\" because you've been doing copious amounts of drinking or drugs, or you've been just plain wasting time, then this class is about as close to a guaranteed A as there is here.  Otherwise, don't waste the $40,000 you've sunk into Columbia on this course.\nWorkload:\nUnnecessary readings, midterm, final, research paper that is so easy and lax it's a joke.\n"
        }
    ]
}