{
    "prof_info": [
        {
            "prof_name": "William Fifer",
            "prof_id": 1981,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Infant Development",
            "review_date": "January 05, 2011",
            "review_content": "\nSee the review right under this one? Totally accurate. Super nice and friendly professor, fairly interesting readings, but information in class is not presented in the best or most interesting way. But like, there's no test so you don't need to really commit any of the information to memory. In my experience the professor did not make himself readily available through email, but this may not have been the case for everyone. Overall you'll get out of the class as much as you put into it.\nWorkload:\nWeekly readings and questions on those readings, final paper (research grant proposal, 15ish pages)\n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "December 14, 2005",
            "review_content": "\nI would say this class is one of those that you come away from not knowing exactly what you thought of it. For a seminar, the work was very minimal. We only had to come up with a few questions on the weekly readings which meant that you barely even had to do the readings at all. \nThen, there was just one paper but it was a grant proposal and so it is relatively easy to write. But, for a seminar, the actually class was terrible. There was about 10 seconds of class discussion and 2 hours of lecture from this guy. Worse, the lecture was not even informative since he just went through our questions and tried to answer them but since most of them were tottally arbitary they usually did not even have an answer. So basically, we learnt almost nothing. But, the professor himself is awesome. He has a great personality and is really really nice. Its just that he cant really teach. So if you want an easy seminar in which you wont really learn all that much, take this class. Otherwise, take something else.\nWorkload:\nweekly readings with response questions. One 12-15 page final paper....Easy!\n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "April 14, 2005",
            "review_content": "\nFifer is awesome. Lectures are fun, personal, and laidback. For those who have an interest in human development- take this class. \nThis guy will make laugh!\nWorkload:\nvery light\n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "January 02, 2005",
            "review_content": "\nThis class was fantastic and Professor Fifer's great sense of humor and upbeat attitutde certainly made it that way.  He is an extremely endearing guy who manages to work witty remarks into his informative answers to questions.  The seminar has a great, casual feel, and though the readings assigned weekly may not always be exciting, they're not too long, you don't have to actually buy any books, and all that you do is write 10 or so questions each week in reponse to them.  The questions are the basis for the entire seminar, and they don't even have to be on-topic - Fifer uses them to give students info about absolutely anything they could ever want to know about infants and their development.  The man is like a walking encyclopedia of information, and his easygoing attitude makes everyone feel comfortable asking whatever is on their mind - I've never been in a class that felt so relaxed and free-form, and everyone almost ubiquitously agreed that Fifer is great and the class was never too boring.  Can't beat it!  But be warned - he limits the class to less than 20 students and it often gets overbooked, so e-mail him personally if you want to be sure to get in!  It's worth it.\nWorkload:\nweekly readings - the only way that you are responsible for them is by writing 10 or so questions about what you read to stimulate class discussion.  the only other assignment is an approx. 15 page \"grant proposal\" - a surprisingly fun and free form assignment in which Fifer let's you choose any infant-dev-related topic, research some background info, and write a proposal of what kind of study you'd design to augment existing research.  overall, light but meaningful workload\n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "August 29, 2004",
            "review_content": "\nWow. what a boring class. Don't let the word \"seminar\" fool you, this is a two hour lecture. Really easy, but boring as anyt  thing.  I\\ve to do anything, though. Submit questions about the readings before class, and he just goes through all of them and answers them. He didn't give us any feedback as to how we were doing in the class, so your final grade is a real surprise. \nWorkload:\nSubmit questions on the reading before seminar, easy paper at the end. \n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "February 21, 2004",
            "review_content": "\nI totally disagree.  This professor has a wonderful sense of humor and is really cool!  He is very intelligent and has done some very interesting research.  This readings are very informative and I am learning more than I've ever learned in any other Barnard class. This could be the best class I have ever taken, in my four years at BC. \n   Fifer goes on tangets often, but they're great ones!  He uses the term \"parentheses\", and sometimes \"parentheses within a parentheses\".  He answers all of our questions no matter how dumb they may seem.  He takes them seriously and even gives us extra information outside of class to answer them further.  I love this class and I am by FAR not a BC lover.   \n"
        },
        {
            "course_name": "Infant Development",
            "review_date": "January 25, 2004",
            "review_content": "\n4 credit seminar, once a week.  about 60 pages of very dry readings per week.  easy workload.  one end of semester paper.  more like a question answer session than a seminar, not very informative. if you can handle sitting through the worthless 2 hours, do it.  \nWorkload:\neasy\n"
        }
    ]
}