{
    "prof_info": [
        {
            "prof_name": "Kent Minturn",
            "prof_id": 353,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 06, 2013",
            "review_content": "\nProfessor Minturn is AMAZING, if you have him for Art Hum you are INCREDIBLY lucky. He's brilliant, he's funny, he's filled with interesting stories, he's passionate, he wants you to do well. If you have no previous art experience, he works with you to help you learn and do well. He's the best professor i've had at columbia so far, and he made me fall in love with art history (which I would have never expected in a million years). Take Art Hum with him, you won't regret it. He assigns the best reading, and he knows so much about everything especially Jackson Pollack... you'll learn so much... he's the best. \nWorkload:\nNormal, medium reading (which you should do because they are really interesting), two papers, midterm, final (and a trip to the Met!) \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 20, 2009",
            "review_content": "\nI think Professor/Dr. Minturn is everything that you can hope for in a humanities professor. He is incredibly knowledgeable about each era that is covered, and is able to namedrop with the best of them (in a good way! He can quote many many art critics about any piece/artist etc...). I didn't have a particular interest in art entering the class, but I left appreciating it more than I could imagine. He's a pretty young guy, is extremely friendly/approachable, and is a very good lecturer.\nClass structure: Minturn lectures for basically the entire class (which was always cut short 5/10 minutes), allowing for small pockets of discussion that weren't usually used very extensively. I don't know if it was my class in particular, but no one save 2 or 3 people really participated regularly. This isn't good news for those who love to hear themselves speak... BUT, when Dr. Minturn speaks (and again, it's for 95% of the class), it's always interesting. It's not a class where you necessarily WANT to speak out and disrupt the flow, because I really think he is that good at describing the topics/pieces/era/artist/etc. at hand, and it's far more helpful to just let the man do his thing.\nLike I'm sure most Art Hum classes are, he comes in w/ a flash drive prepared with a powerpoint filled with the art that we're going to discuss for the day. Slide by slide he narrates. Easy as that.\nIf you end up with this guy, you are very very lucky. I don't think Art Hum. could be that difficult no matter who teaches it, but Minturn definitely makes it the most interesting and painless (and actually enjoyable).\nWorkload:\n2 papers, 2 tests. 1 each @ midterm and final. Midterm/Final were same format: 10 slide ID's, 1 Short Answer, 1 Longer Essay (BOTH WERE OPEN BOOK/NOTES). 1st paper was ~5 pages, final paper (research based) was 8-10. Were given 3 topics to choose from for the 1st paper. 2nd was open to ANYTHING art related... just had to do the research. \nReadings for each class/week that usually took no more than 25-30 minutes, with a few taking more around an hour. \nVery light, but you feel like what you do pays off... so for that, it's great.\n"
        }
    ]
}