{
    "prof_info": [
        {
            "prof_name": "Sunyoung Park",
            "prof_id": 599,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "November 17, 2003",
            "review_content": "\nIt's clear to me that the earlier raving reviews of \"Miss Park\" were written by her; it's entirely impossible that someone would a) find this class interesting and b) understand her very own patented type of English. The way she speaks, the new rules she imposes, her cold demeanor -- you sit through these classes thinking that someone has to be playing a cruel joke on you. The first paper was based on a subjective topic (the most impressive person in your life) that she expected us to answer as objectively as possible; everyone ended up getting low Cs and Ds. Your grade only improves over the course of the semester because she knows it would reflect badly upon her to have these low marks; she's afraid someone will catch on to her tyranny, so she's a bit merciful with Bs. She is wholly unapproachable because while she pretends to care about your grade and progress, when you go to see her during office hours she basically laughs at you if you don't get it. And why would you get it? This class taught me nothing about logic, nothing about rhetoric, nothing about anything particularly pertinent, just about how Sunyoung understands English, her second language, and how you should, too. There's something to be said about an English class taught by someone who struggles with basic pronunciation, yet knows the ins and outs of grammar in the outdated and irrelevant Holy Bedford Manual; it also speaks volumes about how much the Core department cares about poor first years who are forced to take this class. So if you find yourself in Sunyoung's class, either run for the hills and beg the Core people for forgiveness or sit back, survive and be ready to laugh at yourself, her, and the ridiculous situation in which you've been placed. Afterwards, remember to remind the Core dept that they owe you BIG.\nWorkload:\n10 papers on ludicrous topics, 2 rewrites, the usual L&R; load. Hopefully the recent changes in the course have made the topics a lot more generalized, and the class more open to discussion and analysis, which is what us Columbians really need.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 17, 2001",
            "review_content": "\nSunyoung or \"Ms. Park\" as she insists on being called, despite the fact that she's a twentysomething grad student is an unbearable sadist with little grasp of the english language and ever less control over the pronunciation of that language. Her assignments are amazingly bizarre and inane (19th century Japanese political cartoons may and have appeared). While she has an excellent grasp of english for someone learning it as their second or third language, she's not a native speaker and it shows, particularly in the area of idioms. She'll rework entire sentences and essays in order to make them conform to rules of grammar only she has heard of and will gleefully insult anyone who doesn't understand her twisted methodology. She never utters a kind word about anyone's writing, and insists of repeating her mantra \"It's ok to critique each others writing because you all make way too many mistakes.\" Don't even fathom the prospect of \"A\", the only person she'd consider giving one to is herself. Embarassing moments in dealing with Ms. Park often occur when discussing one of the silly points of punctuation, like how to quote properly. Find yourself a friend who can explain that to you; she certainly can't. Also, she'll refer to the muddled Bedford as a Bible, but then will contradict it, leaving you to wonder which one exactly is a rambling mess, her or the book.\nWorkload:\nThe workload is standard L & R nonsense, but if you want to get a good grade, spend as little time as possible writing the essays. If you think too much you're likely to write a coherent sentence that doesn't match Korean speech patterns well, thereby confusing Ms. Park and landing you a lousy grade. Also, pay no attention to the grading system. The grade depends not on the essay handed in, but on the week of the semester in which you handed it in. The longer you've had her the higher a grade you will get. Presumably, this is because she's such an intellectual marvel that some of that inspiration must have sunk into your inane little mind. The one HW assignment she never mentions is the most pressing requirement. Buy cigarettes and alchohol the night before each class. Down the booze on the way to class so that what she says makes sense and smoke afterwards to dispel the frustration you feel at being absolutely stewed and still exponentially more intelligent than your professor.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 28, 2001",
            "review_content": "\nI heartily agree. Nearly all students dread L&R;, but I thoroughly enjoyed it. Yes, Ms. Park is quite young, so her teaching isn't as smooth as you'd expect from a seasoned veteran. BUT, she is an excellent writer, an honest grader, a candid-but-fair critic, and above all, a good person. I admit that her grammar lessons are boring (but I dare any L&R; prof to make split infinitives interesting), but if nothing else, you finish the semester as a better writer than when you began. That is the main goal of L&R; and Ms. Park does a great job of helping the students along. Her grading is hard, but fair. I got an A as well, so it's not impossible. As an added bonus, she picks great essays and short stories for the class to read, including my favorite -- The Elephant by George Orwell.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 16, 2001",
            "review_content": "\nThe above reviewer is obviously not only out of his/her mind, but reacist, too. Ms. Park was an excellent teacher, with a commanding grasp of English. She spoke better than I do, and I got an A in her course, so I don't know what the other person is talking about. She is very demanding, and expects the best of her students, but rewards that effort with candid critcism and advice. She is young, and her teaching style obviously has room to improve, but she did definitely know what she was talking about, and the only accent I heard was something called \"enounciation.\" Two thumbs up, way up, for Ms. Park.\nWorkload:\nLong, hard essays. But, if you care about communicating, and learning to communicate well, you'll appreciate the work you put in and the feedback you get back.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 11, 2001",
            "review_content": "\nAs a teacher of L&R;, Ms. Park's grasp of the English language seems dubious. Her accent makes it incredibly hard to understand what is going on in class, and as a non-Native speaker she writes \"word-choice\" all over the place. Her grading borders on fascism--getting an A- is impossible so dont even try. If you try to correct choppiness she tells you you are wordy and vice versa. Class is boring and unproductive, especially because she NEVER shows you a good essay. If you can switch out, please please do yourself a favor.\n"
        }
    ]
}