{
    "prof_info": [
        {
            "prof_name": "Alban Forcione",
            "prof_id": 1676,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2004",
            "review_content": "\nI enjoyed this class very much.  Professor Forcione is always endearingly befuddled when it comes to concrete, organizational issues like how much we should read for the next class, or whether or not we'd be going on a lit hum outing.  He is incredibly knowledgeable, especially on Don Quixote, on which he's written books.   In spite of his expertise, he still encouraged us to engage in discussion and offer our own interpretations.  Feel lucky if you are assigned his lit hum.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2004",
            "review_content": "\nProfessor Forcione is a really good guy.  He also really knows his stuff about everything that we read.  The only problem is that his teaching style requires that you have a good attention span.  He says a lot of stuff about every book, and sometimes its pretty hard to pay attention for someone with an attention span like mine.  He's not that engaging in general with the class, but you can get a lot out of it if you pay attention.\nWorkload:\nWorkload kind of sucks, but that's for all of lit hum.  He doesn't assign the extra readings, so comparitively it is better.  About 100-150 pages per class in general.  The Don quixote is good, but there's a lot of it in a little time.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2004",
            "review_content": "\nIf you got Dr. Forcione for Lit Hum this year, thank your lucky stars.  This man is not just a Lit Hum instructor - he's a full professor and the Director of Undergraduate Studies for Spanish at Columbia.  If you Google him, you'll see that he's a Cervantes scholar who's written several books on Don Quixote, a fact that made our spring-semester discussion of that book particularly interesting.  He's absolutely brilliant, but more important, he cares about Lit Hum - I found myself interested in the class discussion even on days when I hadn't done the reading (and those days were numerous).\nDr. Forcione is just about the nicest guy ever, too.  He's the sort of archetypal college professor you see in books and movies...he might seem a little scatterbrained when you first meet him, but he's 100% focused during discussions.  He always had a student or two trailing after him to talk some more at the end of class.  All that and he's a very clement grader!\nI suppose my only criticism of Dr. F is that his handwriting is sometimes kind of illegible.  The essay I got back today has a comment on it that looks like it says \"the amity is dar frog to the part.\"  I have no clue what it's supposed to say, but nonetheless, I give this guy an A+...+!\nWorkload:\nVery nice.  Just two 4-6 page papers a semester, plus the midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 16, 2003",
            "review_content": "\nWe only had Professor Forcione for half a semester, due to the fact that he broke his hip half-way through and our teachers were switched between semesters, but I have to say that he was one of my favorite teachers this year. He is adorable and having spent numerous years as a teacher, he certainly knows what he's talking about. If you would rather have a class that is mainly lecture-\nbased, but with really interesting facts and info that no other teachers would have thought of, then he is the teacher for you. He dosen't exactly encourage class discussion, but he is so smart that I think none of us wanted to speak anyway. \nAll in all, I learned far more from him in a few weeks than from our first semesters teacher.\nWorkload:\ntwo papers and an exam, at least thats what he said before he broke his hip - the one paper he did grade was very fair and the topic was completely up to us\n"
        }
    ]
}