{
    "prof_info": [
        {
            "prof_name": "Harry Rosenblum",
            "prof_id": 1942,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Lighting Design",
            "review_date": "May 24, 2004",
            "review_content": "\nBasically what the other reviews said: totally laid back and easy-going, very encouraging but critical, and obviously knows his shit. My only complaint? He went to one of those hippie colleges (Hampshire) that don't give grades, so don't expect any actual grades. It can be difficult to figure out where you stand as far as that is concerned because he doesn't believe in grades, but rather criticism. \nIf you're good, he'll hook you up with jobs and make connections for you. So if you're serious about it, definately take this class and get to know him.\nWorkload:\nHeavier than I expected--a lot of reading which you can skip if you have a basic understanding of lighting, but several large projects that take up a lot of time. The final project was WAY more of an ordeal than I thought it would be so look out!\n"
        },
        {
            "course_name": "THTR BC2120*01   Technical Production ",
            "review_date": "January 21, 2004",
            "review_content": "\nHalf of the class didn't even know his last name, because he's on a first name basis with everyone. Harry is great. His teaching style is very casual, and he approaches everything with friendliness and understanding. If you don't have a clue about theater, he'll help you learn without making you feel like an ant, and if you're very experienced in theater, he'll help you find good jobs and hone your abilities. His availability outside of class is almost insane (I know someone who once called him at midnight with an emergency), and he is a remarkably good instructor for someone who has only been here a few years. It is obvious he knows what it's like to be a crawling undergrad, and obvious he's done theater for a very long time. I highly recommend him to ANYONE. Absolutely take this class. He's the kind of professor that you're dying to have. \nWorkload:\nNo exams, papers, finals, tests. Your grade is based on your participation, your willingness to learn, and your progress. He is very generous in his grading but if you don't do your best he'll tell you so.\n"
        },
        {
            "course_name": "THTR BC2120*01   Technical Production ",
            "review_date": "January 15, 2004",
            "review_content": "\nHe is GREAT!    He is such a wonderful professor.  He has only been here for several years, but it seems like he's so experienced with teachings.  He knows his stuffs really well and is very very responsible.    He responded to my email very soon and you could ask him any questions through there or see him in person.   You can find him either in MLP or the workshop.   He is very young and friendly.   Everybody just called him Harry and seems like he is our friends, not professor.  But he knows when to stop being soooo friendly, so that the class will run smoothly.  I love this professor!  He is really the ONE that you should take if you are experienced with theater OR even if you have not much experiences with theater, like me.  He makes me want to continue with theater and I feel like I really got a lot out of this class.  Oh, just FYI, it is very hard to buy the textbook for this class since none of the bookstores around campus has it.    If you are interested in this class and would like to get the textbook, feel free to email me at cyhk723@yahoo.com.    I will sell it to you for cheap coz I really want you to take this class with Harry!!!!!!!  =)\nWorkload:\nNo exam at all, so the class is largely based on the work you do in class and for the show.   Very good class to satisfy your ART requirement!\n"
        }
    ]
}