{
    "prof_info": [
        {
            "prof_name": "Chris Wiggins",
            "prof_id": 2236,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Seminar: Problems in Applied Mathematics",
            "review_date": "June 16, 2016",
            "review_content": "\nOriginally posted in December 2015:\nFor juniors and seniors studying applied math, the seminar provides an opportunity to learn directly from both outside speakers and peers on various topics in applied math. Seniors have to prepare a 75 minute presentation on a topic to share with the rest of the class. Professor Wiggins is very helpful in assisting with the presentation, and he provides guidance on how to best approach your topic (both qualitatively and quantitatively, as he will assist with both outlining your talk and also will help you better research your topic). The key is to pick a topic that you are passionate about and would like to spend time researching and learning about on your own. I found that I not only enjoyed researching my topic, but also that it bridged connections between various applied math courses (whereas courses may not directly build on each other, it was interesting to see the connections between them in a single application). Many presentations also draw on results from the last hundred years (if not more recently) and this is also an exciting complement to other courses. Reflecting on the seminar, I can say it has been a great experience in terms of being able to connect with applied math students and also learning about the numerous ways applied math affects daily life (in many cases, in ways you wouldn’t have known existed before taking the seminar).\nWorkload:\nSeniors: One class-long presentation. Juniors: 5 responses during the semester and one 500-word response at the end of the semester.\n"
        },
        {
            "course_name": "Seminar: Problems in Applied Mathematics",
            "review_date": "June 13, 2015",
            "review_content": "\nThe review from January 27, 2012 is spot on about Wiggins as a person.  I would even go a step further and say that his behavior around students is completely unprofessional and often insulting.   Furthermore, I found his seminar to be a pathetic excuse for a course and I think requiring it is a complete waste.  \nThe entire “course” is centered around presentations, most of which are given by the seniors in the course.  Each senior is responsible for one 75-minute presentation of a topic of their choice, and that’s basically the entire course.  When you are not presenting you are expected to show up and watch the other presentations (or play around on Facebook) and perhaps ask a few brown-nosing questions to the presenter if you are in that kind of mood.  \nHe also invites in several of his own presenters, and this seems like mostly self-promotion on his part.  They all seem to go out of their way to mention what a mentor Wiggins was to them when they were students at Columbia, or something absurd along those lines.  Most of the presentations were very boring, and I can honestly say I have never been in a classroom with so many students on Facebook during class.\nWiggins spends the entirety of most lectures sitting in the back of the room and typing emails on his phone.  He will often look up and attack the presenter with questions in a rather adversarial manner.  He seems to go out of his way to nitpick and tear you apart for not following his (often unwritten) rules, and he does not do this in a constructive way at all.  \nI really don’t know how I was supposed to benefit from this class in any way.  It honesty seems like this is Wiggins’ way of dealing with his teaching requirement without having to prepare any lesson plans.\n\nWorkload:\nAs a senior you’re expected to show up twice a week and give one 75-minute presentation.  As a junior you are expected to show up once a week, write 5 short feedback tweets for presenters (140 characters each), and one 500 word essay on what you learned from the class.\n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "January 27, 2012",
            "review_content": "\nWiggins is a man of two faces. In class he had a dry humor, could put together a lecture at the last minute (if a presenter, say, didn't show), and was often helpful in guiding senior presentations in class-- either by correcting a student's incorrect equation or keeping a student focused on the subject matter. But behind the scenes he was often condescending, unprofessional, and unhelpful. He would forget your name within minutes of meeting you (in seminars, you expect a little personal attention), would respond to emails sarcastically, and generally just wouldn't give you the time of day. Brilliant guy, for sure, but not nugget-worthy. \nWorkload:\nOne 50-min presentation\n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "January 27, 2012",
            "review_content": "\nWiggins is a man of two faces. In class he had a dry humor, could put together a lecture at the last minute (if a presenter, say, didn't show), and was often helpful in guiding senior presentations in class-- either by correcting a student's incorrect equation or keeping a student focused on the subject matter. But behind the scenes he was often condescending, unprofessional, and unhelpful. He would forget your name within minutes of meeting you (in seminars, you expect a little personal attention), would respond to emails sarcastically, and generally just wouldn't give you the time of day. Brilliant guy, for sure, but not nugget-worthy. \nWorkload:\nOne 50-min presentation\n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "January 27, 2012",
            "review_content": "\nWiggins is a man of two faces. In class he had a dry humor, could put together a lecture at the last minute (if a presenter, say, didn't show), and was often helpful in guiding senior presentations in class-- either by correcting a student's incorrect equation or keeping a student focused on the subject matter. But behind the scenes he was often condescending, unprofessional, and unhelpful. He would forget your name within minutes of meeting you (in seminars, you expect a little personal attention), would respond to emails sarcastically, and generally just wouldn't give you the time of day. Brilliant guy, for sure, but not nugget-worthy. \nWorkload:\nOne 50-min presentation\n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "January 27, 2012",
            "review_content": "\nWiggins is a man of two faces. In class he had a dry humor, could put together a lecture at the last minute (if a presenter, say, didn't show), and was often helpful in guiding senior presentations in class-- either by correcting a student's incorrect equation or keeping a student focused on the subject matter. But behind the scenes he was often condescending, unprofessional, and unhelpful. He would forget your name within minutes of meeting you (in seminars, you expect a little personal attention), would respond to emails sarcastically, and generally just wouldn't give you the time of day. Brilliant guy, for sure, but not nugget-worthy. \nWorkload:\nOne 50-min presentation\n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "May 30, 2005",
            "review_content": "\n   Chris is a great professor for this seminar. He clearly knows almost every topic inside and out, and he can produce on-the-spot and in-depth examples to illustrate points. He gets a bit technical sometimes, but if you're majoring or minoring in Applied Math, you should be used to it.\n    The presenters and topics vary greatly in interest and public speaking ability, but most are worth hearing, and Chris does a really good job of tying everything together. He's extremely friendly and approachable, and won't hesitate to give you extended feedback, extra explanation, or any other kind of pointers if you ask him for them. You get out of the class what you put into it; everything won't appeal to you, but the broad exposure to careers and research is invaluable.\nWorkload:\nJunior Seminar: response paper at the end of the semester\nSenior Seminar: presentation, research proposal. Work varies by semester.\n"
        },
        {
            "course_name": "Seminar",
            "review_date": "April 25, 2005",
            "review_content": "\nI'm currently a junior majoring in applied math. Although I don't think that I am interested in research or really math intensive work, i have certainly gained a lot from the seminar - mainly job connections and direction for the future. The work load is light so you do not dread coming to class. The professor also does a good job of having the students participate in class discussions which make the class more fun and allow you to meet one's fellow majors.\n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "April 15, 2005",
            "review_content": "\nI am graduating this year and have had Prof. Wiggins for multiple semesters of seminar and have found him to be extremely intelligent, helpful, and approachable individual - he gives great advice not only for math, but also for advice on research, classes, and jobs. \nThe class is an opportunity to learn a great deal about a variety of mathematical techniques as well as to be exposed to a multitude of career options with a background in applied mathematics e.g. ibanking, consulting, trading, grad school, research. \nProf. Wiggins makes sure that everyone is involved in the lectures and presentations and does not leave anyone behind. He's on a first name basis with all students - and is always polite, friendly, and super respectful with everybody.\nI learned a lot math in the class, but more importantly, seminar was a terrific opportunity for me to decide on my next step with an education in applied mathematics. \n"
        },
        {
            "course_name": "Junior/Senior Seminar",
            "review_date": "November 28, 2004",
            "review_content": "\n\nAs a junior, nothing is required of you. It is a one-point pass/fail class. Attendance is not taken regularly, maybe Chris recognizes some people, but I don't think he knows every junior's name.\nSometimes the class has an interesting speaker, but the student speakers are often uninteresting or poorly prepared.\nWorkload:\nShow up for an hour a week.\n"
        }
    ]
}