{
    "prof_info": [
        {
            "prof_name": "Stephanie Ramsey",
            "prof_id": 12839,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 04, 2016",
            "review_content": "\nI really liked Dr. Ramsey for a few reasons: first, her class is very clearly structured: she posts discussions questions for each reading to respond to on Courseworks, and that's what you spend a good portion of the class talking about the next day. She also comes up with pretty cool activities to go with each reading. She definitely helped me understand the books a lot better. Also, she is definitely one of the nicest teachers I've had at Columbia: she's really funny, cares about her students, and actually spends the money that the Core office earmarks for us on a game night, outings, and museum trips.  \nThe grading as far as I know, isn't too bad. It's more than possible to get A's on the papers. She also gave us a curve on our midterm  which isn't too bad. Also, if you don't do well on your papers then she actually provides a lot of feedback that can help you improve. Her feedback is actually really helpful and will help you get a better grade if you follow it. \nWorkload:\n3 Essays, 80-word response per book (not per night), 2 midterms, 1 final. Midterms have simple passage ids and a simple essay, the final is a collaborative project. Sounds like a lot but really isn't too bad. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 04, 2016",
            "review_content": "\nI really liked Dr. Ramsey for a few reasons: first, her class is very clearly structured: she posts discussions questions for each reading to respond to on Courseworks, and that's what you spend a good portion of the class talking about the next day. She also comes up with pretty cool activities to go with each reading. She definitely helped me understand the books a lot better. Also, she is definitely one of the nicest teachers I've had at Columbia: she's really funny, cares about her students, and actually spends the money that the Core office earmarks for us on a game night, outings, and museum trips.  \nThe grading as far as I know, isn't too bad. It's more than possible to get A's on the papers. She also gave us a curve on our midterm  which isn't too bad. Also, if you don't do well on your papers then she actually provides a lot of feedback that can help you improve. Her feedback is actually really helpful and will help you get a better grade if you follow it. \nWorkload:\n3 Essays, 80-word response per book (not per night), 2 midterms, 1 final. Midterms have simple passage ids and a simple essay, the final is a collaborative project. Sounds like a lot but really isn't too bad. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 29, 2014",
            "review_content": "\nShe was assigned to teach the CC section I was in last semester. Her class was a very average experience, if not a sort of bizarre one too. Even though she was perfectly normal when people talked to her individually, the class-teacher relationship was very odd (silent, awkward, not knowing when to laugh). Like one time she told us she was going to play a song that related to the text, which everyone got really excited about. But then she just played it for the whole class on her iPhone, which made it pretty difficult to hear, and we all just sat there silently listening. Then we moved on to the next topic. It felt like a weird tribal ritual. Some of her other \"activities\" were just as questionable, including randomly having us write a tweet by one of the philosophers (the connection to twitter was not explained), or use markers and posterboard to summarize the reading. It felt like fifth grade.\nI think \"Ms. Ramsey\" (she asks you to call her that) means very well and genuinely cares about the students in her class...sometimes a little too much. Two times during the course, she related a philosopher's ideas to the perils of drunk driving, and urged us not to do it. No one really knew how to respond to it. Then again, the part about Epicureanism she related to drunk driving is one of the things I remember most from the course, so maybe it's just her method.\nThe biggest flaw in the class is that 40% of your grade is based on in-class participation, which at first stimulated a lot of good discussion about the material, but then seemed to only incite banal, pointless comments for the sake of commenting. She would agree with everything everyone said, even if it was flat out 100% wrong. \nThe final and the midterm were the easiest two tests I've taken at Columbia. You had to identify and write about quotes like \"I think, therefore I am\" and \"Life is nasty, brutish and short.\" There was also a \"human interest\" question along the lines of \"Which of the philosophers do you most identify with?\" I might have been able to pass the test without knowing anything except the most quoted lines from the books. \nI think it's great that she repeatedly told us she wanted to take her time grading our essays because she wanted to give us helpful comments. Strangely enough, however, I would usually only receive two or three comments in the whole paper and then perhaps a one sentence recap about one thing she didn't like. I got the same grade on every paper even though I gradually spent less and less effort on each one. \nWorkload:\nWe had a lot more reading than the majority of the other sections, but our tests were super easy. She has you write three papers, each 5-7 pages - keep in mind there are some sections that don't have to write a single paper at all. The overall workload is on the high end relative to other CC classes.\n"
        }
    ]
}