{
    "prof_info": [
        {
            "prof_name": "Ryan Harty",
            "prof_id": 9517,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "May 11, 2011",
            "review_content": "\nRyan is a great teacher. He's a little on the easy side and would improve if he toughened up a bit, but overall he's terrific. He's very kind and patient, and will spend as much time with students as he needs to in order to make sure they're happy with their progress. I also thought he came up with some great writing exercises. The only issue is that he gives his students a lot of wiggle room--as in you can do a lot of work and really challenge yourself, or you could probably get by with less effort/skill and still do okay. I decided to challenge myself as much as possible in this class and Ryan encouraged me the whole way. I would strongly recommend his class, but only if you're fairly self-motivated. If you're more into coasting, you will still enjoy the class, but you probably won't get as much out of it. Ryan will not push you beyond your comfort zone, but if you resolve to go there on your own, you'll have a very patient and knowledgeable teacher there to guide you.\nWorkload:\nPretty light: short weekly writing exercises (nearly half are optional), weekly peer critiques, weekly reading assignment (usually 20-30 pages), two stories for workshop (7-25 pages), one revision at the end of the semester, attendance and class participation are essential.\n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "January 17, 2010",
            "review_content": "\nDecent. His reading selections were predictable, his comments logical and thoughtful, but overall I found him to be rather plain and uninspiring. There was no spark to him; I don't think I learned very much. In an Intermediate class you expect something...more. The exercises were interesting, but nothing overly stimulating. The reading of weekly stories, in addition to the three short stories written by our peers became difficult to fit into a meaningful discussion. He did attempt to focus on a 'craft' element each week (plot, character, dialogue, etc.) but this was just a vague point of introduction at the start of class-- he did not really add anything to a beginning student's knowledge. It's possible he'll improve over time, and I think he has potential. Something he should definitely consider changing is the manner in which the stories are workshopped. HE chooses the order, and if it were an unbiased order I'd have no problem with it, however it was blatantly obvious that he had the worst story of the week go first, and saved the best for last. That seemed unfair to me, even though my stories were read last.  The students themselves should decide who goes first/last so that there's no awkwardness between the students; no sense of inferiority. In fact I think class cohesiveness suffered due to this tactic, and I sincerely hopes he changes it in the future. He also needs to work on his moderator skills, blind pilots fly with a greater sense of direction and purpose than did our class. He's a nice guy, no doubts there, but a mediocre creative writing professor at best. He was going to grade the stories on a numerical scale before realizing it was an absolutely impossible system. In the end I think he just based the grade off a personal vibe, or a random system we were not privy to.  \nWorkload:\n2 stories/semester, 2-3 peer reviews/week, 1-2 short stories by established author/week, 1 (optional) creative writing exercise/week\n"
        }
    ]
}