{
    "prof_info": [
        {
            "prof_name": "William Fisher",
            "prof_id": 2275,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 04, 2006",
            "review_content": "\nWilliam V. Fisher is undeniably, the man. With much needed sarcastic wit to break up the dryness of thousand-\nyear old texts, he unified a diverse class and created a comfortable environment for discussion. While some might say his classes lack direction, this is simply a sign of his willingness to allow students to take control of their own lit hum experience, redirecting discussion based on the enthusiasm of the class on different subjects. While at times it was aggravating that his caustic humor wasn't applied to curb the spewing idiocy of students who continually made shallow comments, he can hardly be blamed for being too nice. Will sat down with me on multiple occasions at his office hours to discuss my essays until i was completely satisfied. His philosophical teaching mixes well with his frequent references to pop culture. You won't be let down by enrolling in this section.\nWorkload:\nnumber of essays and length of each to be voted on by class each semester, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 15, 2005",
            "review_content": "\nI am forced to review this solely to refute the last one. His classes do have direction, even if they do not always seem like it. This man is amazing at interjecting every once in awhile solely to gear the class toward some point about the text that he wants us all to see. Each class ends up being a journey, like that, and every step of that journey is filled with insightful discourse. He makes Lit.Hum bearable, which is more than most people can say about their Lit.Hum professors.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 18, 2005",
            "review_content": "\nWilliam Fisher is a pretty funny guy but ultimately his class was unsatisfying. He never really gave the class discussions any direction and his questions usually seemed geared more toward getting the better of his students than stimulating productive discourse. He uses turns of phrase incessantly - \"I would challenge you to think,\" \"by way of\" \"in potentia,\" Â– with only minimal regard for their meaning. This course's most satisfying moments were departures from the texts Â–Â when he shamelessly made fun of his students in charmingly juvenile ways. \nOther than that, though, I don't recommend taking his course if you can avoid it.\nWorkload:\nI think this is the average lit hum load. He grades vaguely; gives out grades between grades (A-/B+) readily and is very sparing when commenting on papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2004",
            "review_content": "\nIf you are lucky enough to have this guy as a teacher, just sit back and enjoy the ride.  Will is, without a doubt, the best teacher I've ever had.  He made lit hum a truly gratifying experience for me and my classmates.  Every lesson was interesting, the class was encouraged to participate, and he was very approachable as a teacher and as a peer.  He also, for the record, has the absolute most awesome apartment I've ever seen.  At the end of the semester he has us over for brunch: don't miss it, it was the best afternoon I've had here.\nWorkload:\nstandard Lit Hum for the first term, 3 papers, lotsa reading.  the last paper was pretty long in comparison to other classes (8 pages), but it was fun to write.\n"
        }
    ]
}