{
    "prof_info": [
        {
            "prof_name": "Yannis Tsividis",
            "prof_id": 4505,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Circuit Analysis",
            "review_date": "March 21, 2014",
            "review_content": "\nProfessor Tsividis is probably the best professor I've had at Columbia, including outside of the EE department (which is pretty exciting, considering that Electrical Engineering is generally not a field known for professor teaching ability). Apparently Tsividis has enough seniority in the EE department at Columbia (fun fact: he's the author of the lab manual for Intro to EE) to pretty much teach whatever he wants, whenever he wants, which is why our class ended up with him instead of Zukowski for Circuit Analysis (Fall 2013).\nTsividis is an excellent lecturer, and going to class was incredibly useful (which, sadly, can't really be said of the other EE classes I've taken at Columbia). He explained new concepts multiple times and in several different ways to really consummate the class's understanding of the course material. His lessons were succinct, straight-forward, and taught through a combination of theory and examples. The concepts that I had failed to fully grasp in Intro to EE (op amp circuits, mutual inductance, etc.) became extremely clear through his explanations. Although perhaps not as personable as Vallancourt or Zukowski, Tsividis really cared about whether or not we were truly learning the material, and showed it by often asking in lecture if we had any questions and emphasizing coming in to office hours for additional help if necessary. \nOverall, this course was crucial in building the foundation for my understanding of circuits, and I don't think there's a single student that took Circuit Analysis with Professor Tsividis that didn't come out of the class 1) thinking that Tsividis is a circuits god, and 2) as a much stronger electrical/computer engineer. Although Circuit Analysis was by no means an easy class, Tsividis provided us with every tool we needed to succeed. This may be gushing, but I'm not exaggerating when I say that taking this class with Tsividis really changed my appreciation of EE and cemented my decision in becoming an EE major. Perhaps this has to do with learning style, but I'm taking another class with Vallancourt now and often find myself wishing Tsividis could present the material instead, as Vallancourt tends to convolute concepts. \nLast note: The TA for this course, Sharvil Patil, was phenomenal as well. Basically the younger, Ph.D candidate-version of Tsividis in terms of versatility when teaching concepts; he was also great with making himself available to the class with office hours and review sessions before midterms. \nWorkload:\nNot sure if this is particularly useful, because Tsividis might not teach this class again, but:\n20%: weekly psets - challenging and pretty time-consuming, but very comprehensive/useful\n40%: 2 fair midterms (20% each)\n40%: final (difficult, but also fair)\n"
        },
        {
            "course_name": "Analog Electronic Circuits",
            "review_date": "January 17, 2011",
            "review_content": "\nThe class was NOT impossible. It was challenging, and I probably would not have done well if I didn't have a study group, but it was certainly doable, especially if you did the homework. Though the professor can be intimidating at times (he responds to questions with \"what?\"), he is very helpful if you talk to him and go to his office hours.\nAdditionally, he provided the notes for the entire class on the first day, so you didn't have to worry about constantly taking notes and could focus on the lecture itself. He also made videos of the lectures available to members of the class. Despite this, I would strongly recommend you attend class - it really does help.\nAlso, I was in the class that had the 42 average midterm. The professor offered to use your final grade in place of your midterm grade if you did better on the final, so he's not out to get you.\nThe simulations on the homework can be painful if you don't understand how to do them. Take the time to read though the documentation on the simulator early on - it will save you time in the long run.\n\nWorkload:\n1 Problem Set / Week, late homeworks not accepted as solutions were posted immediately.\n1 Midterm\n1 Design Project\n1 Final\n"
        },
        {
            "course_name": "Analog Electronic Circuits",
            "review_date": "December 28, 2010",
            "review_content": "\nTwo words to describe this class: mission impossible. Surprised there are not already reviews of this class from the previous \"victims\" who took the course. Even the syllabus states: \"this is not a class you can do last minute studying to pass a test.\" Key word \"pass.\" This is an exaggeration, but it's easy to worry when you don't understand any of the material going into any test. The average on the midterm was 42, definitely not a confidence booster going into a final with potentially harder material.  Not to take anything away from the actual material, which I'm sure is extremely important, don't take it unless you're a grad student and you know what you are doing. Even if you satisfy both of those requirements, tread lightly.\nWorkload:\nThere are 12 problem sets, one of which 3/4 of our class copied solutions directly and was discovered by the TA. A time consuming but doable project, midterm, and final.\n"
        }
    ]
}