{
    "prof_info": [
        {
            "prof_name": "Emilie Littlehales",
            "prof_id": 3348,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French II",
            "review_date": "January 27, 2010",
            "review_content": "\nEmilie is a delightful professor with a really great personality and loads of patience. She gets back to your e-mails, makes cute jokes in class, and is generally very fun and approachable. With that said, I would proceed with caution into her class. She breaks into English a lot, and will usually field questions that you ask in English. This might be okay for some people--often, it was okay for me--but the culmination of these interludes made me feel a bit less able to handle immersion-style when I went into 1201. So for those who actually really need the immersion, it might be better to go with another professor. She also relied heavily on the book, which might just be the course-wide status quo, but I honestly wish we could have broken away from it more.\nOn the other hand, Emilie was always willing to meet and help students, and she was always really helpful for grammar explanations. If you're a motivated student outside of class and can resist the urge to break into English, Emilie's fine. Her French is clear and easy to understand, so honestly you shouldn't need to break out of it.\nWorkload:\nStandard: compositions and revisions, occasional short reading, and workbook assignments she only looked at on test days.\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "December 14, 2008",
            "review_content": "\nHonestly, not my favorite professor, though I get the impression this semester just wasn't a good one for her personally.\nStudents who do well enough on their own and want a laid-back language class will find her pleasing.  Easy grader, patient, and decent at explaining grammar, she'll break into English no problem.\nNot recommended if you need an enthusiastic, immersion-style prof to keep you on task.\nWorkload:\nRegular - doesn't assign lengthy writing exercises in workbook\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 28, 2007",
            "review_content": "\nEmilie is quite possibly one of the most amazing professors I've had thus far at Columbia. She made learning French a ton of fun, yet maintained a great deal of professionalism. \nShe was very approachable in and out of class and responded to emails promptly. She gave great comments on compositions and was a fair grader on tests.\nI would HIGHLY HIGHLY HIGHLY recommend taking Emilie. \nWorkload:\nStandard across the entire French dept. She does make you do the workbook exercises but you only turn them in on test days. \n"
        }
    ]
}