{
    "prof_info": [
        {
            "prof_name": "Elizabeth Povinelli",
            "prof_id": 2542,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 28, 2016",
            "review_content": "\nIt is hard to overstate how awful this class is. Povinelli is a terrible lecturer who while known as being incredibly intelligent, cannot put together a coherent sentence to save her life. This class in general is supposed to be \"easy\" however she makes it impossible. The readings have no connection to the lectures. The TAs were frustrated with both the students' lack of understanding and the professor's lack of communication. The \"mini-terms\" were graded completely subjectively and put together specifically to trick the students. The questions on exams often included information that was not discussed, or certainly not in the detail asked for. The identification section on the mini-terms was even more of a joke. Most of the time google had to be consulted to be able to properly study. However, in the last lecture, she bribed us with pizza. If that seems worth enduring soul-crushing lectures, then go ahead and take this class.  \nWorkload:\nThree \"mini-terms\" (to insure you never have a break), weekly reading summaries (1 pg each and the bane of every students existence), about 50 pgs of reading a week (the readings are never enjoyable) and a final that may or may not change at the last minute!\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 05, 2011",
            "review_content": "\nBasically, this course is the LitHum version of anthropology. It's a survey course and introduces you to some broad themes that really help you understand anthropology and modern debates in context, but you never get the chance to \"do\" anthropology or discuss specific texts in any depth. It's a great course if you're thinking about majoring or concentrating in anthro because it shows you how anthropology has developed as a discipline (it's less than 100 years old) and what that means for anthropology today. You get to read seminal texts and learn a little background on the different \"schools\" of anthropology, but that's it. If you don't plan to take advanced classes, this is probably not a great course for you to take, because you won't learn much that will matter; you'd be better off in an anthro class with a narrower focus.\nPovinelli is pretty fun, and she tries not to bore the class with her lectures. Unfortunately, some of her material (especially that relating to early 20th century British social anthropology) is really dry. She'll give you vocabulary during the lectures (sometimes on Powerpoint slides, sometimes on the board) and you better memorize these words' exact definitions, since spitting back exact definitions will be half your grade on the midterm and final. The lectures deal with the ideas that influenced the readings, but they steer clear of actually addressing the readings. You have to do the readings on your own and hope you get a good discussion group.\nThe discussion groups are hit or miss. My TA was great, but our group sucked. We were supposed to discuss the week's reading on our own while Mythri facilitated, but it was clear that hardly anyone did the readings and those who did had no interest in discussing them. So instead, Mythri asked us questions and we BSed or just waited in silence. I've heard other discussion groups went better.\nAll in all, this is a great introduction to anthropology as a discipline and a great course to take as a freshman or sophomore considering an anthro major. But if you want to take a \"typical\" anthro class, or get a feel for the department, don't (only) take this course. It's unlike any other anthro class, just as LitHum is not like any real English course.\nWorkload:\nTwo papers (one due before midterm, one before final), midterm, and final\nThe papers are like 3-5 pages and graded very generously, but they are only worth 20% of your total grade; give priority to studying for the midterm (30%) and final (40%)!\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 08, 2010",
            "review_content": "\nThis class is a great overview of the history of anthropology as a discipline.  After you take it you'll understand why it's required for all anthro majors, but it could also be a good class for non-majors looking to learn a little about anthro, or prospective majors looking to see if this is really what they want to study for four years (I can't think of a better class in the department to take as your first anthro class).  \nPovinelli gives extremely clear, organized lectures, and she makes sure to highlight the concepts that you really need to know (like by repeating the important definitions several times so everyone can get them down in their notes).  Plus, she's a funny, energetic lecturer who likes to throw in lots of multimedia stuff...you won't get bored.  \nThe texts are interesting.  The amount of assigned reading becomes unreasonably heavy after the midterm, but you can still do well even if you fall behind on it because you're allowed to choose which books you write on for the final.  Povinelli wants everyone to do well and she gives a study guide listing all the terms and concepts you need to know before each exam, so all you have to do is look them up in your class notes.  That being said: this is a class where you really need to go to lecture because if you don't you will be screwed on the papers and final.  But Povinelli's lectures are fun, so you won't mind.\nWorkload:\nMandatory discussion section and lecture attendance (but with a generous absence policy: you could miss 3 sections AND 3 lectures).  2 in class exams and 2 papers (3-5 pages each).  Study guides are provided for both exams.  The reading was fine before the midterm but became unmanageable afterward, no one I knew in the class kept up.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 04, 2010",
            "review_content": "\nI have mixed feelings about this class. Povinelli is hilarious, and such a character. I enjoyed the lectures most of the time, and they definitely kept me awake. I went to every one, because I actually had fun. However, I also did not miss a class because there was SO much information in each lecture.\nAs previous reviewers have mentioned, the exams are entirely memorization except for one short essay on each. Combined, the midterm and final are worth 70% of the grade for the class, so it is essential to have an excellent memory or insane study skills. \nThe readings got pretty intense sometimes, too. One of the assignments was to read a 498-page book in a week and a half. While a fast reader might be able to handle this with only a little strain, those who need a little more time to read cannot. I ended up only skimming a bunch of the books. A few of the ethnographies assigned seemed unsuitable for the class.\nI guess this class is a requirement for Anthro majors, so if you have to take it and you are interested in the subject it might not be so bad. I took this just to see if I could be interested in Anthro, and now that I have completed it, I know that I am not. If you are like me, just testing the waters, I would advise taking a different anthro intro course, not this one. But if you have to take Interpretation of Culture, take it with Povinelli. She makes it pretty fun.\nWorkload:\nlots of reading, two 3-5 page papers, midterm, final (on the last day of class)\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 24, 2009",
            "review_content": "\nProf. Povinelli is an amazing lecturer. Her lectures are clear, engaging, entertaining, and highly informative. She presents the information in a way that makes it easy to follow along and take notes but without being boring or dry. She ties her research on aboriginal Australians into the material and has some really fascinating stories. She has a great sense of humor and gets the class laughing a couple of times each class at least. The material of the lectures is interesting. You need to know the material very well for the midterm (I haven't taken the final yet so I cannot comment). The books span the development of anthropology. Some are interesting, and some are not. I would definitely recommend taking a course with her.\nWorkload:\nManageable. About a book a week of reading (sometimes not the whole book), midterm, two short, easy papers, in-class final. Need to prepare well and learn details for midterm. Required discussion sections.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "May 04, 2007",
            "review_content": "\nBeth is the undergrad coordinator for women and gender studies, and she is phenomenal. Though somewhat inconsistent in her availability, she made sure everyone in our seminar came out with a well-focused, well-researched paper, and ran the seminar like a serious workshop. She really goes to bat for her students, and was both go-with-\nthe-flow and on the ball. She miraculously made writing a thesis an enjoyable experience. \nWorkload:\nIt's a thesis seminar, so a lot (duh). First semester is creating and researching your topic, second semester all the writing happens pretty quicky (ie before spring break). \nBe ready to writewritewrite! \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 30, 2006",
            "review_content": "\nunder no circumstances should you take an intro class with this prof.  not because of any fault of hers, but because some students will hold the class back, you will learn nothing.  take her seminars or something, but poor povinelli doesn't know what to do with low caliber students, and as a result she was totally inconsistent.  she changed assignments after they were completed, graded the midterm 3 times, and cancelled papers so we actually did no work in the class at all.  if you actually want to learn some anthropology, then don't take this intro class.\nWorkload:\nmidterm/final, 1 pitiful 3 page paper.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 22, 2006",
            "review_content": "\nI also have mixed feelings about Professor Povinelli. She as a person is extremely funny and charismatic; she always had us laughing and was especially good at lecturing to large groups (our class was 120+ people). She also has really interesting stories about her field work in Australia and relates these to a lot of the ideas she teaches in class. \nThe readings, however, were often incredibly long and convoluted and nearly impossible to get through. She did do a decent good job breaking them down in class, and the discussion sections made them even more understandable... After long, I learned that there was really no reason to read at all, because she does not expect you to know any more than she goes through in class or than you will go into in your discussion section. \nApparently our class did horrendously on the midterm and so she gave us a huge curve and then gave us study guides almost every week with definitions and key points for the final, which made studying much easier. However, I thought the final was incredibly easy and basic and the midterm too wasn't bad at all, even though the class as a whole did pretty poorly. She basically just wants you to memorize definitions, which is pretty straightforward. The essays are graded really easily too, so do well on those, and she even made one of our essays into extra credit points so I would say the class was a very easy A. \nI probably wouldn't recommend the course; it was at times very hard to get through, but I guess the A is nice. \nWorkload:\n2-3 readings per class, varied (30-100 pages), 2 essays, midterm and final\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 22, 2006",
            "review_content": "\nI also have mixed feelings about Professor Povinelli. She as a person is extremely funny and charismatic; she always had us laughing and was especially good at lecturing to large groups (our class was 120+ people). She also has really interesting stories about her field work in Australia and relates these to a lot of the ideas she teaches in class. \nThe readings, however, were often incredibly long and convoluted and nearly impossible to get through. She did do a decent good job breaking them down in class, and the discussion sections made them even more understandable... After long, I learned that there was really no reason to read at all, because she does not expect you to know any more than she goes through in class or than you will go into in your discussion section. \nApparently our class did horrendously on the midterm and so she gave us a huge curve and then gave us study guides almost every week with definitions and key points for the final, which made studying much easier. However, I thought the final was incredibly easy and basic and the midterm too wasn't bad at all, even though the class as a whole did pretty poorly. She basically just wants you to memorize definitions, which is pretty straightforward. The essays are graded really easily too, so do well on those, and she even made one of our essays into extra credit points so I would say the class was a very easy A. \nI probably wouldn't recommend the course; it was at times very hard to get through, but I guess the A is nice. \nWorkload:\n2-3 readings per class, varied (30-100 pages), 2 essays, midterm and final\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 06, 2006",
            "review_content": "\nProfessor Povinelli is a brilliant person. Perhaps the best way of getting my feelings across is through an email I sent her on the last day of class: \"I didn't get a chance to talk with you today (the last day of class), so I am writing to thank you for the material you introduced to me and guided me through. This was without doubt my favorite class at this point in my life: I loved the readings, how the lectures connected and questioned the content of those readings, and how you colored these two aspects of the class with personality. In other words, don't change anything.\" \nThis is not a rhetorical, ass-kissing move but a sincere expression of thanks. Honestly, take this class.\n\nWorkload:\nA reasonable amount of reading. 1-2 short essays, mid-\nterm, final. Don't worry.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "June 13, 2006",
            "review_content": "\nI have mixed feelings on Professor Povinelli. On the one hand, her stories about working in Australia and hanging out with Radical Faeries are awesome and she seems like a genuinely cool person. On the other hand, I greatly disliked her class. The books we read were great... for curing my insomnia. Class lectures went off on random (though often entertaining) tangents, and by the time the midterm and final rolled around, my notes were full of random facts that were only slightly related to the class material. We had little to no review for either exam, though students did ask for a study guide. Some topics that appeared on the midterm and final had only been briefly brought up in class. Discussion sections were painful due to inexperienced TAs and several students who dominated the class trying to out-pretentious one another; we rarely, if ever, got anything relevant accomplished there. I don't know if Professor Povinelli's teaching is at fault or if she chose books that would be better for other classes, but this was the first intro course she'd taught in a while so I do give her credit for not going over our heads completely. If you have a strong interest in sociology and anthropology, take this course; I would not recommend it to someone just trying to fulfill a requirement.\nWorkload:\nTons of reading - sometimes two books per week. One-hour of discussion once a week, plus weekly Courseworks postings of two or three sentences. Midterm and final with IDs, short answers, and essays; both are fairly short exams.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 28, 2006",
            "review_content": "\nPovinelli is nice and undoubtedly smart. She is a good lecturer and makes lectures interesting. Her TA's are a bit incompetent and sometimes the class is sometimes a bit annoying due to the presence of uptight and condescending students who think they know everything. The class itself is fun and I highly recommend it. Ignore the idiots and listen to Povinelli.\nWorkload:\nNot too bad at all. Lots of assigned reading but you only need to do about 15% of it. Cram for the midterm and final and you'll be fine.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 07, 2005",
            "review_content": "\nI only had Professor Povinelli for the second semester of CC, but she turned my most-dreaded class into one of my favorites. What can I say, she's a genius and Columbia is lucky to have her. Most people will never come close to having the exciting and accomplished life she's had. Engaging speaker, funny, puts up with very little BS. Oh, and you'll actually LEARN SOMETHING, not just stare out the window waiting for the clock to tick. I thought she did an excellent job of making sure every text was thoroughly dissected. Got rid of a lot of the confusion in these very dense texts. Consider it a blessing to have her as your professor.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 16, 2005",
            "review_content": "\nProf. Povinelli is excellent. She has a razor-sharp knowledge of the works on the CC syllabus and also brings in her extensive outside knowledge to introduce different facets of the works (she is at the top of her field in anthropology). I left every class with a clear understanding of the writer's argument and its significance in its historical context as well as its relation to the arguments in other texts. In spite of her depth of knowledge, Prof. Povinelli does not merely lecture the class. She facilitates discussion and encourages every student to participate by requiring a weekly reading response (One question about the text and one contemporary example). She has a great sense of humor and is very laid-back and friendly; however, she is really tough about deadlines - she will not grant an extension under ANY circumstances so be sure to hand your work in on time (she takes a 1/3 of a letter grade off for late assignments). Her grading is very fair and usually reflects the amount of time and energy you put into the assignment. If you get a chance, ask her to share some personal anecdotes - she has a really interesting life (among other things, she's lived with Aborigines in Australia and appeared in a Bright Eyes music video).\nWorkload:\nSomewhat heavy - Standard CC reading load, with a few extra texts, weekly discussion questions that aren't graded but are recorded to affect \"grades at the margins\" (One question about the text and one contemporary example; this is a very easy way to give your grade a little boost) 2 papers\nMidterm and final (with fairly direct questions; if you read the books, you should have no problem)\n"
        }
    ]
}