{
    "prof_info": [
        {
            "prof_name": "Seymour Spilerman",
            "prof_id": 258,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Societal Adaptations to Terrorism",
            "review_date": "April 08, 2012",
            "review_content": "\nExtremely boring. He is very smart and nice, but not at all engaging. He also does not seem to care if his students are paying the least bit of attention in class. The class is essentially a lecture instead of a seminar.\nSome of the readings seem dated, especially those written before 9/11 (for a class on terrorism, this is very pertinent).\nThis class will suit those students looking for extra time to be on Facebook, are interested in the subject enough that they would read the texts of their own volition, and/or want a very non-eventful seminar to complete their degree requirements.\nWorkload:\nEasy presentation of a few articles; no midterm or final; presentation of draft of final paper; final paper of 12-15 pages.\n"
        },
        {
            "course_name": "Seminar of Inequality ",
            "review_date": "December 26, 2010",
            "review_content": "\nI enjoyed Seminar in Inequality because Spilerman was straight forward.  The course capsulizes how and why the rich get richer, while the rest of us accumulate less wealth and have a smaller income flow.  The readings can be extensive, but are interesting if not somewhat dated.  Statistics come from the Census Bureau and are therefore difficult to dispute, but not terribly hard to interpret.  Salient points are discussed in class, and this is what you should focus on for tests.  The mid term was not terribly difficult, as long as you showed up to class and took notes from the lecture.  The other major portion of the class consisted on a term paper determined by students, and an oral presentation. \nIt's best to start the paper right after the midterm, because it will creep up on you.  If you do your paper regarding inequality in foreign country, Spilerman will be especially appreciative.   Once you start digging for statistics and facts, you can correlate them with class readings and discussion.  It is actually very interesting.  \nProfessor Spilerman is extremely knowledgeable, matter of fact, and to the point.  Although he willingly takes questions, he leaves little room for interpretation.  His style is dry, and can be off putting to some.   He keeps regular office hours, and is pleased that some students showed up.   Of note, there is hardly any math in this class.  Do not be scared on the first day when Spilerman says you should have a statistical back ground.    It's simple stats and curves,  where you merely compare and contrast rather than formulate.  \nI would recommend this class simply because it is very informative and practical.  It's not that easy for some, but if you put in the effort you can get an A/B+.\n\nWorkload:\nLots and lots of readings, most of which is very interesting but somewhat dated.  One midterm exam, not that bad, a term paper, and an oral presentation.  You do need to go to lectures to get the salient points.  \n"
        },
        {
            "course_name": "Seminar on Inequality and Public Policy",
            "review_date": "November 19, 2010",
            "review_content": "\ni think the other review posted is very unfair. i think the  many disapprove \"ticks\" of the review prove that. he was a really great guy and professor. i really learned a lot from him. he is always encouraging of your ideas and willing to help! he is really old and completely adorable. meeting with him outside class is never the awkward experience it can be with other profs. He is happy to take the time to engage with you.\nhe taught me a lot of things that I use in other classes now and the profs think im a genius. lool. The books we used in his class are so essential to understanding sociology and class issues in the US and abroad. I have used/mentioned the works from his books many times in papers for other classes. I am dead serious when I say that he saved my grades more than once in other classes. This class is very straight forward I will admit. But sometimes lets be real you need that. the simplest explanation is really the best. if you want a long convoluted lecture but a tenure-seeking newbie good for you. go elsewhere. If you want a more sedate discussion oriented forum (although he does talk for most of the time) take this class. Its very chill and I think a majority of the people taking it really had a good time. he doesnt really try and trick/test you at every turn because thats stupid in an institution of learning. he just wants you to learn and honestly i and everyone else did the readings because of it. the one person who stopped showing up for the class was an extremely self-involved chatterbox graduate student who WAS advised by him multiple times at the start of the semester to take his graduate course when \"they\" kept prodding him for more indepth discussions. However,  \"they\" obviously wanted an easier A with less required work. Why is this a negative for him???! Should he have kicked you out? I can't sometimes...oh columbians. \n\nWorkload:\nlots of very interesting reading. a bit dated sometimes but the information is very relevant even if the statistics are back from 'his day\" lol.  a reading presentation, a midterm that can count if you want it to, a final paper 20-25 pages of your own design, and a presentation of your paper. take this class. if just to prove that not all profs are douchebags. \n"
        },
        {
            "course_name": "Societal Adaptations to Terrorism",
            "review_date": "January 20, 2009",
            "review_content": "\nI really enjoyed this course.  Like in a lot of seminars, he would contextualize the readings in broader theory and then students were asked to present the readings.  When he spoke, he was clear, well-organized, and informative.  Though listening to the presentations after having done the reading made the reading itself a bit redundant, there was a lot of interesting material.  Professor Spilerman is not the type of man to care deeply if students choose not to engage with the reading or the course, so it is easy to get by without doing it.  But if you do keep up with the coursework and pay attention in class, it becomes clear that Professor Spilerman is a very smart man who cares about his students very much.\nWorkload:\nA few articles to read per week, a term paper at the end, an article presentation or two\n"
        },
        {
            "course_name": "Seminar on Inequality and Public Policy",
            "review_date": "January 11, 2005",
            "review_content": "\nThis is by far the worst professor and pseudo-seminar in the sociology department. The man can't tell time, so I wonder how he's teaching a class that thankfully is no longer required for certain sociology majors. He is fairly abrasive, makes many factual errors and always explains skims through seemingly important details by saying they are discussed in the graduate version of the seminar. I stopped going after the middle of the semester because I felt it was a waste of my time. If you want a four point A, then take the class and don't bother showing up except for the midterm and final and you'll be the wiser. The rich are getting richer and the poor are getting poorer, but this is still the worst class at our overpriced ivory tower.\nWorkload:\nMidterm and final, don't bother reading the assigned reading unless you want to learn something that should be instinctive anyways.\n"
        },
        {
            "course_name": "Seminar of Inequality ",
            "review_date": "May 25, 2004",
            "review_content": "\nNowhere near as bad as anyone says.  Take notes and you'll get an A.  Scanning the reading is enough though it is good reading.\n"
        },
        {
            "course_name": "Seminar on Inequality and Public Policy",
            "review_date": "December 27, 2003",
            "review_content": "\nDon't let the \"seminar\" title of the class fool you -- this class really isn't too serious.  Once a week, Spilerman breezes into class, lectures you for an hour or two (depending on whether or not he's made other plans for the second hour of class), throws some handouts at you that you can't keep, and tells you to do the reading because you'll be tested on it (even though he never discusses it in class). I was pretty frustrated with this class at first because his approach eluded me, but I found that if you go to every lecture and you do in fact complete all the readings, there's no way that you can do badly in this class. Spilerman is not the most wonderful lecturer in the world, and he repeats himself a lot, but he's a nice guy that doesn't care for term papers or class participation or anything else that cramps his very direct approach to this course. He comes in and tells you what you need to know -- and as long as you understand that the rich are getting richer and the poor poorer, as well as a few basic trends, then you'll do fine. At the first lecture, I felt that he tried to initimidate kids out of the class with his staunch emphasis on statistical knowledge as a course requirement -- all you really need to know is how to read a graph and do some simple arithmetic. As the core class for the Urban/Stratification path, this course is ideal if you're looking to do well with minimal effort relative  to other courses. All in all, not such a bad experience.\nWorkload:\nYou're handed a syllabus on the first day of class that doesn't have any specific date attached to the readings -- that's because Spilerman takes his time with these topics and let's you know where you should be as you go along. Buy all of the books on the list if you don't want to be hunting down reserve copies that are never there. DO THE READINGS, they are a great supplement to the lectures and will better prepare you for the tests; pay attention to more general concepts, as he will never ask anything too specific. There is a midterm and a final in this class; the midterm worth a third of your grade and the final two-thirds. It may seem pretty rough but he appears to curve quite generously and your grade will properly reflect whether or not you've been paying attention. You'll get an A if you go to every lecture and do the readings.\n"
        },
        {
            "course_name": "W3945 Seminar on Inequality and Public Policy",
            "review_date": "December 24, 2002",
            "review_content": "\nI must admit, I walked away from this class feeling very disappointed and frustrated.   The class is titled \"Inequality and Public Policy\" but we touched on neither topic.  Instead, class time was spent looking at charts and graphs that all basically said the same thing: the rich are getting richer and the poor are getting poorer.  Spilerman did not analyze why the graphs were the way they were, did not give any specific policy measures, and did not ground anything in a historical framework.   What's more, Spilerman is a really smart guy--too bad he isn't a more dynamic professor.\nWorkload:\nReally interesting readings (mainly for background info); one 20-25 page term paper on any topic\n"
        },
        {
            "course_name": "W3945 Seminar on Inequality and Public Policy",
            "review_date": "January 12, 2002",
            "review_content": "\nAs the previous review says, many have taken this class based on the name and a semi-promising syllabus. DON'T DO IT. this is one of those courses where the professor is obviously bored out of his mind and would rather be teaching graduate students. He didn't seem to know any of the students in the (small) class, never once discussed the books and articles he assigned, and once even seemed confused as to what was on the syllabus. I think we got through about 1/4 of the discussion topics, and what went on in class was less discussion and more him going through chart after chart of numbers without offering concrete analysis or interpretation. A waste and a disappointment.\nWorkload:\nwell, there's no point in doing the reading, but watch out - he'll get you with the final paper. the assignment is extremely vague and, therefore, there's lots of room to write a paper that he doesn't agree with.\n"
        },
        {
            "course_name": "W3945 Seminar on Inequality and Public Policy",
            "review_date": "December 31, 1999",
            "review_content": "\nSounds like a cool class and many have been duped into taking it on this account... but brace yourselves, there is no moving and shaking here. Public policy is hardly mentioned, let alone examined, in the course; rather, it is an analysis of the struggle undergone by upper-middle/somewhat upper-middle/relatively upper-middle/and purely middle classes in doing their taxes.\n"
        }
    ]
}