{
    "prof_info": [
        {
            "prof_name": "Justin Phillips",
            "prof_id": 2692,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Gays & Lesbians in American Politics",
            "review_date": "December 31, 2013",
            "review_content": "\nThis is the best seminar I've taken at Columbia, and the best class I've taken in the political science department here.  I almost didn't take the class because I was skeptical about the limited scope of the syllabus (Gays and Lesbians instead of a broader intersectional LGBTQ analysis).  However, the readings in the class were one the highlights of my semester, and Professor Phillips is amazing at leading discussions.  He's very open to critiques of the class and the readings, and it led to many interesting classes.  \nYou can do fine in discussion without doing all of the reading, but I found myself doing all the reading thoroughly each week because I was learning so much that I had never come across before.  \nWorkload:\nReading: Typically a book+ per week (~400 pages).  Towards the end of the semester, the class switches towards talking about current legal stuff, and you read cases that are much shorter than earlier weeks' readings.  \nResponse Papers: There are 4 3-4 page response papers on the week's readings due for the semester, but he grades these on the easier side.  \nTerm Paper: 15-20 pages and presentation- You have a huge amount of freedom about what you want to write on, so this can be enjoyable/not difficult.\n\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 21, 2013",
            "review_content": "\nThis is one of the best classes I have ever taken. It was at 10:10 AM but Professor Phillips managed to always keep my attention. Just by going to the lectures and taking notes you basically can know most of the things needed for the course as long as you skim the reading and primary sources. He is a really engaged professor and definitely is willing to meet with you during office hours. A lot of people didn't do well on the first midterm but people did really well on the other two and most people did well in the course. i definitely recommend the course and Professor Phillips (I also really loved my TA, Albert Fang, and recommend him as well if you can ever get him in a course). \nWorkload:\nReally manageable- readings for each class around 100 pages worth and 3 midterms. Some people freaked out after not doing as well on the first test but most people ended up doing really well.\n"
        },
        {
            "course_name": "State Politics",
            "review_date": "June 15, 2012",
            "review_content": "\nI took this class to complete the secondary sub genre part of the poll sci major, and it turned out to be my favorite class in college so far! Prof. Phillips is a really nice and easy to talk to guy and knows a lot about the subject material. He is easy to get a hold of when you need help or questions and I preferred reaching out to him instead of the TAs. I was considering switching majors, but because of Phillips I'm going to stay a Poli Sci major.\nI didn't spend much time on the class overall throughout the semester (while after the midterm I basically stopped reading and went to only have the lectures). Still passed the classes with my highest grade this semester and when it came to the exams, I felt very relaxed about the questions and essays.\nOverall, Loved the class and loved the professor!!!!\nWorkload:\nReading: Not a terrible amount, but don't let it pile up. \nExams: One midterm and the final (each had short answers questions and an essay or two). \nTerm Paper: 10 -15 pages (not hard if you know what you are trying to get across)\n"
        },
        {
            "course_name": "State Politics",
            "review_date": "May 04, 2012",
            "review_content": "\nThis a solid PoliSci class to take, as Phillips had exceptionally well-organized lectures and takes his exams basically straight from them. He doesn't post the slides so you have to go to class to copy the notes down or have a very generous friend who goes for you. Being there doesn't really do much for your understanding of the material unless you don't trust anyone else to take notes for you. Just make sure you can type or write quickly. The paper wasn't bad, standard 10-15 pager on basically anything in the course, though the TAs seemed kind of oblivious, but Phillips was helpful. Overall, great class, not stressful or overly difficult at all, definitely take it.\nWorkload:\nmidterm, final (non-cumulative. Woohoo!), 10-15 page term paper. Readings each class that are not too long but you're best off splitting those before the exams.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 27, 2011",
            "review_content": "\nPhillips is a good lecturer and he pretty much takes his slides directly from the readings. Most people didn't ever show up for lecture and if you have time to do the readings on your own during the week then you probably don't need to go. Prof. Phillips isn't the most interesting and entertaining lecturer (I've fallen asleep a few times and the 9 AM class time doesn't help much), but he's a nice guy and the tests were always fair. The content of the class consisted of very straight-forward introductory concepts of American government, political systems, institutions, parties, etc. I'm thinking of being a political science major so it was a good fundamental class to get started in the subject.\nWhat made this class the most worthwhile for me was my TA--David O'Connell! If you take this class, do everything in your power to get into his section! He is amazing. \nOverall, good intro class with an easy workload.\nWorkload:\nVery manageable. About 50 pages of textbook reading a week, plus 3-4 articles from supplementary textbooks. 3 midterms, very straight-forward and concept-based short and long answer questions. No final exam!! If you study, it's definitely an easy A.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 22, 2011",
            "review_content": "\nIntro to American Politics is an ideal introductory course. Professor Phillips uses PowerPoint to lecture, which ensures that he is always easy to follow and that his lectures are perfectly structured and clear. Professor Phillips understands that not all of the material in the course is super-interesting, and so he makes sure to incorporate various thought-provoking studies and graphs into his lecture to help jazz things up. \nOne of the best parts of this class is that you will never be confused about what's going to be on your midterm/final. If you listen and take notes during lecture, and skim all of the necessary readings, you should have no problem on any of his exams. \nEven if you aren't a Political Science major, you should still take this class! A lot of what Professor Phillips teaches about Political Behavior is very interesting and applicable to other areas of study, so this course will probably help you sometime down the line. \nWord of advice: pay attention during the first two lectures! These are the most important lectures of the course, since the terms you learn then will be brought up again and again throughout the semester. \nWorkload:\nVery manageable. A couple of readings a week (most less than 10 pages), 3 midterms (all aren't cumulative). Discussion participation is worth 10% of your grade and each midterm is worth 30%. \n"
        },
        {
            "course_name": "State Politics",
            "review_date": "April 19, 2011",
            "review_content": "\nI took State Politics with Phillips. Genuine nice guy.... always willing to talk to you. gives very straight forward exams and is a kind grader. His lectures are very dry but only because they are nothing but power points.  he knows his stuff. You won't look forward to going to class but I would still say take a class with him. If you pay close attention you will learn. reading is heavy but really not required for exams but can help. \nWorkload:\nlots of reading but you can just skim. exams are pick any 3 questions you want out of these five. each worth 20 points each. and a longer essay worth 40 points pick one of these 2 questions. \n"
        },
        {
            "course_name": "Seminar: American Politics",
            "review_date": "November 16, 2009",
            "review_content": "\nI took Direct Democracy, one of the American Politics seminars in the Political Science department with Professor Phillips, and it was an amazing class. \nProfessor Phillips really rocks in a seminar setting. He's good at leading the discussion. By that, I mean he gets the discussion going by posing some questions about the reading and building up the discussion based on what the class has gleaned from the reading. However, he's also good at letting the students go back and forth on a point if the discussion gets really interesting. Which it did, since some of the topics we covered included Gay marriage/ Prop 8, The referendum on Gov. Grey Davis and subsequently Arnold. \n\nWorkload:\nWorkload: Reading - ranges from 100+ pages to a book a week; Four 5 page response papers on the readings (spread over the semester); One final 20 page paper\nThe workload was kind of heavy, but manageable. I thought the class was worth the reading and all the papers. \n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 13, 2009",
            "review_content": "\nProf. Phillips was pretty good for this broad but necessary introductory course. If you need to take this class, he's your man -- the lectures are clear and very organized, the exams straightforward and pretty easy (getting an A is not too hard). Not everything in the class is thrilling, but Phillips tries to make it more interesting with case studies and contemporary examples. \nReading is not too bad, and some of the articles are interesting. You can get away with not doing the textbook reading and skipping lectures every once in a while. All in all, Phillips teaches well and if you do the work/attend class you'll end up with the knowledge you need in order to know what you're talking about in American politics. \nWorkload:\n1-2 long chapters from textbook each week, plus a number of theoretical articles; discussion section. \n"
        },
        {
            "course_name": "State Politics",
            "review_date": "May 21, 2008",
            "review_content": "\nI'm a huge Phillips fan.  The guy knows that some of the subjects he teaches are painstakingly boring--but he truly does make an effort to present entertaining information.  State Politics was quite enjoyable, though filled with the run of the mill political science slackers who sit on g-chat the whole class period who will probably go on and on about how boring the class was in future reviews.  So, there's a disclaimer: the study of state politics means that you will have to go over federalism extensively.  Break out those Federalist Papers and prepare yourself for lots of theoretical readings during the first half of the class.\nAfter the midterm, the class really does pick up and becomes quite enjoyable.  Phillips puts a lot of thought into the subjects covered: gay marriage, disaster relief, health and welfare, elections, etc.  It was a great class in that it helped everybody gain understanding of many contemporary issues--and with all of the federalist theory we'd already covered, everybody could understand the issues on a deeper level.  In addition, Phillips really does care about his students.  Many would talk with him before and after class, and he is very friendly during his office hours and will offer to help you on anything you can think of.  He really is a gem--take advantage of him before he gets famous and doesn't have time. \nThis class is very helpful to understanding American Politics--if you're interested in the interactions between states, definitely take this class! \nWorkload:\nMidterm and final (both reasonable if you do the readings), 10-12 page research paper\n"
        },
        {
            "course_name": "Seminar: American Politics",
            "review_date": "April 20, 2008",
            "review_content": "\nI love Professor Phillips! Sure, this class will seem much like your high school civics class, but he really is a nice guy who cares about the material.  I think he actually recognizes that the department is sticking him with the Intro class since he's a younger professor, but he always tries to make jokes and keep people awake as we go over the three kinds of grants-in-aid. \nProfessor Phillips is also a real gem when you go to his office hours.  He's always willing to help you with the material and even help you with questions from other political science classes.  \nThe class is pretty simple, just make sure you cite the heck out of readings in your exams if you want to really do well\nWorkload:\nThree midterms lasting an hour and a half each. \n"
        },
        {
            "course_name": "Seminar: American Politics",
            "review_date": "January 22, 2008",
            "review_content": "\nThis class was a joke. The tests are not cumulative. You do not have to go to lecture or buy the books. Just get the notes from someone who goes to class and read them the night before the test. Try not to get a TA who is picky and you will surely get an A. Phillips is a genuinely nice guy.\nWorkload:\nNone\n"
        },
        {
            "course_name": "State Politics",
            "review_date": "November 12, 2006",
            "review_content": "\nGreat teacher, really clear lectures, nice guy all that. But like the reviewer below said, a gpa killer.\nWorkload:\nMedium. Just graded a little harshly\n"
        },
        {
            "course_name": "State Politics",
            "review_date": "October 21, 2006",
            "review_content": "\nWatch out.  He definitely is a nice and seemingly unassuming guy, but he is a tough grader and so-so teacher.  This class was not all it could have been, and from talking to classmates, was a real gpa buster (tons of b-'s).  Overall, would not recommend.\nWorkload:\nSlightly above average for a 3000 level poli-sci class, but not excruciating.\n"
        },
        {
            "course_name": "State Politics",
            "review_date": "July 04, 2006",
            "review_content": "\nwow, this guy rocks. \ngreat lectures, that are beyond cohesive, and a  passion for what he teaches that any student interested in politics would be willing to pick up. \na true gem when it comes to office hours, and grading. you can't possibly go wrong. I highly recommend. \nWorkload:\nreadings for each class, midterm, 1 paper, final\n"
        },
        {
            "course_name": "State Politics",
            "review_date": "May 14, 2006",
            "review_content": "\nI really enjoyed this class.  Professor Phillips' lectures were easy to follow without becoming boring.  The material was generally interesting, and the workload wasn't too bad.  Take this class if you want a solid overview of state issues, but be willing to focus primarily on New York and California (the home state of the professor).\nWorkload:\nThe workload wasn't too bad... a midterm, a final, and a standard research paper.  The midterm had a HUGE curve. \n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 17, 2006",
            "review_content": "\nAlthough Professor Phillips is new to Columbia (recently did his dissertation in California) he is very well organized, although sometimes Columbia's computer system breaks down and interrupts his system of power-point teaching. He's very friendly and responds quickly to e-mails, I suspect this is one of the good characteristics he has for just arriving and I hope it's a trait a keeps after long being here. Although some students see the class as a bit dry and over-methodical, he sticks closely to adhering theories to the literature. This class is definitaly taught by the numbers which makes it easy to follow. Professor Phillips is a friendly grader, and really, all you need to do is absorb the main trends in the readings. Actually, a lot of the peripheral readings (literature on cases) didn't seem too pertinent to the exams. All around he's a very fair guy, and is willing to answer questions and doesn't bog you down with tangential information. His professorial freshness makes him attentive if you make yourself known to him, and he lacks the ego and self-righteousness many professors at Columbia have developed after having their asses kissed by students, academia and general society for way too long. The class is a well-balanced. It definitaly treats American politics as a science, and you can learn a lot if you learn to speedread through the readings.\nWorkload:\nMedium. Two exams, one midterm and a final. Discussion sections. The exams aren't meticulous about specific information, but you have to attend classes to know how to tie the readings together. Concentrate on chapter 1 in the main textbook.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 14, 2005",
            "review_content": "\nThis class was a bit mind-numbing, and not just because the material was elementary; Prof Phillips read directly from his powerpoint presentation, and his powerpoints often parroted our textbook. It's unclear whether professor phillips would have made a better showing if he had been given the opportunity to teach a class with more substance. All in all, he wasn't a very imaginative lecturer, but he did a good job of managing and organizing the course material.\nConceptually and work-wise, this class was a breeze. If you attended  lecture, the textbook was obsolete (don't buy it). The weekly readings were interesting but pretty basic, so you'll already know about them if you took AP Gov't in high school or if you consider yourself any sort of good citizen.\n\nWorkload:\nWeekly readings (about 50-100pgs if you do them all), mid-term (1 in-class essay, 1 take-home essay), and a final (3 in-class essays)\n"
        }
    ]
}