{
    "prof_info": [
        {
            "prof_name": "Clare Bassile",
            "prof_id": 5998,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Physical Therapy Management of Neurological Conditions",
            "review_date": "September 02, 2013",
            "review_content": "\nDr. Bassile has won numerous awards from the American Physical Therapy Association, most of them emphasizing her expertise in clinical research. She teaches three of the Neurological clinical courses in the curriculum. She also teaches Advanced Topics in Neurorehabilitation and anyone who decides to take the Neurological rehab track (other choices for advanced tracks are Pediatrics and Orthopedics) will study closely with her and Dr. Ashwini Rao. \nDr. Bassile has accumulated a vast amount of knowledge about Adult Neurorehab and she only has three to four classes to teach as much of it as possible to her students. Because we have such a vast amount of knowledge to learn in such a short amount of time it can seem that she is literally trying to drown us in journal articles and textbook readings. In Neuro I, we had 53 reading assignments to read in 5 weeks; including readings in 4 textbooks and 42 articles. All reading was included in our exams (including authors names, etc).\nDr. Bassile can seem kooky and scatterbrained and she has trouble focusing sometimes when she needs to multitask. Sometimes she feels the need to defend herself and let students know how they are acting and this can put some students off. In reality, students are always going to be snooty to professors if they don't respect them and she isn't respected by some of my class (although she should be) because of her eccentric qualities. I have seen that Dr. Bassile is very perceptive and can tell when there is something wrong with a student without them having to tell her. She is kind and caring but also aloof. She is willing to mentor any student and will give them the same amount of energy they give her. \n19 of the 51 students in the physical therapy class of 2014 have elected to take Advanced Neurorehabilitation with Dr. Bassile and Dr. Rao. I think this is a testament to her ability to spark interest in people who may not have thought they wanted to work in Neurorehab.\n\nWorkload:\nProbably more than any of the other classes in the PT program (except Peds??). She expects the students to be adult learners, therefore she assigns readings from many chapters in Shumway-Cook and Woolcott's \"Motor Control - Translating Research into Clinical Practice\", Kandel, Schwartz, Jessel, et al \"Principles of Neural Science\", and more articles than you think is feasible... (she expects that you read them all and they will be on the exams). \nMidterm, final, individual small clinical papers, group projects, practical exam.\n\n"
        }
    ]
}