{
    "prof_info": [
        {
            "prof_name": "Meredith  Linn",
            "prof_id": 9347,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Junior Colloquium",
            "review_date": "December 16, 2014",
            "review_content": "\nEveryone takes this class because its required, therefore Urban Studies Majors obviously HAVE to take it. I can honestly say I got very little or not nothing out of it. An insane amount of reading gets assigned weekly and as the weeks go on it becomes more and more obvious that NO ONE is doing the reading. Class assignments have basically nothing to do with the reading, which doesn't really make sense. Each week a \"new\" historical urban issue is studied, but they all seem to basically be a review of concepts of many of the Urban Studies \"A\" requirements. Prof. Linn might be better suited to teach high school because the way she structures the class has ZERO intellectual \"discovery\". She focuses on simply \"recalling\" the main points from the readings....asking what they said about x,y,z, which usually creates dead silence in the classsroom. She is also very opinionated and kinda rejects any challenges to her ideas. Oftentimes, a super politically charged statement slips from her mouth that doesn't really seem all that appropriate. Good-luck disagreeing with her, she will politely dismiss you and hold it against you. She does provide a lot of feedback on assignments, especially the final paper. But, I would suggest staying \"in the middle of the road\" on assignments. Don't try to be critical or challenge anything ever, because it seems like she just wants people to simply read the material and recite it back, just like a 9th grade Social Studies class. Her grading is very subjective and seems to have a wide range, favoring people that simply \"recite\" back on their assignments. She values \"looking at where research came, primary or secondary sources, etc and not any intellectual application of research. I'd probably suggest taking the class with a different professor if you're looking to get something out of the class. However, Prof.Linn's class is good if you want to stay in the \"middle of the road\" and never do the readings. \nWorkload:\nan \"academic\" book-review... reminds me of elementary school. Her favorites were people that talked about how great their books were and reported back the main arguments. A \"empirical data interpretation\" assignment... she gives you historical public crude death rates for various cities and asks you to create graphs and theorize the differences between cities... she asks you to do no research at all and use class assignments and readings to guide your theories, but people that were graded well CLEARLY did research.... people were upset because she was very critical of some people's ideas, suggesting their dates were off or ideas weren't historically correct, but they did exactly what she instructed us to do... and a final paper (15 to 20 pages). The final paper was the biggest assignment and you could pick your own topic in consultation with her. Again, I'd recommend doing something very \"middle of the road\" for the best grade.... just read a few books and report back exactly what you read lol\n"
        },
        {
            "course_name": "Junior Colloquium - Urban Studies",
            "review_date": "December 05, 2013",
            "review_content": "\nProfessor Linn is a great seminar leader. She really made me appreciate the history we were studying, and helped me learn a lot about how to analyze historical sources, use data, and write strong historical papers. I came into Junior Colloquium expecting to be bored, but it was consistently one of my favorite classes of the week. Professor Linn mixes her own insightful comments with student participation, and at connects peoples' thoughts to the broader discussion.\nYou basically read a book a week, or several readings. These range from more academic history books to more popular books. Some of the readings were better than others, and most people don't do all (or most?) of the reading. But Professor Linn did a great job of emphasizing the most important material in class discussions.\nYou'll write one book review on an urban book, do a \"mortality analysis\" using historical data, and write a term paper on a historical urban topic of your choice. It's pretty light, and if you choose an interesting topic for your paper, that's fun. Professor Linn also gives really thorough comments on your written assignments. And she's really nice and warm in person.\nIs this the most exciting urban studies class you'll take? No. But Linn does a great job of making it engaging and worthwhile.\nWorkload:\nOne book review, one mortality analysis, one term paper. Informal presentation for book review, slightly more formal presentation for term paper. A lot of reading that you don't really have to do all of. No midterm/final.\n"
        },
        {
            "course_name": "Intro to Urban Ethnographies",
            "review_date": "May 28, 2013",
            "review_content": "\nMeredith Linn's lectures were as bland as pasta from Ferris. Impossible to rescue. Drenched in monosaturated oil and ah--bland, bland sauce! Won't even sit on my darn fork for two seconds before it miserably slips away and plops back in my plate. Plop. Sound of my brian trickling asleep while she pops out another PPT after another. It is puzzling how a lecturer can be so plain and unattractive as this one I have encountered this spring. I would have rather been taught by a martian and still would have spent my time in class on the same level of excitement and vigour. Wait, hold that thought---call back the martian.\nWho did the readings? Barely anyone. Very few did and would perk up in class to talk their mouths off. Ridiculous. She assigns too much and covers only an outline perspective. Without any previous knowledge, we could've talked about most of the things we were assigned to read. If that isn't bland for you, I suggest you make yourself a drink out of sriracha, horchata and matcha and drink it and run before I come fix you a second. \nTalking to Meredith Linn? No way, Jose! She will nod her head a billion times while you spurt one sentence but not give a single meaningful feedback and move onto the next speaker or whatever subject matter she wishes to move onto. Which is okay but not really when it goes on for the entire entire semester. You can tell she doesn't like what is coming out of your mouth. So after awhile, you kind of forget that you have a mouth. She cannot teach, let alone articulate classroom discussions in such a way that many diverse opinions can eagerly take on participation.\nTalib Kweli. Meredith Linn, please listen to him for a day and learn how many other ways you can say \"bad\" or \"evil.\" Freestyle that mind! Such bland vocab. And don't teach us what is \"bad\" or \"evil\"---we're not living under communism. And as a matter of fact, I don't care what you think \"bad\" or \"evil\" is when you don't even give much thought to the discussions taking place inside the classroom and further delineating those terms to envelop these different statements. \nLet me wrap up my review. I never want to be in her classroom again. \n\n\nWorkload:\nLots of (bland) reading 2-3 articles/ essays a week, 1 final ethnography project (25-30 pages), group perspective project (couple of updates along the semester) piece of cake. \n"
        },
        {
            "course_name": "Junior Colloquium - Urban Studies",
            "review_date": "January 05, 2012",
            "review_content": "\nMeredith Linn is an awesome seminar leader.\nEvery class she came prepared with some background information, larger context, and some of her own thoughts on the topic of the book we were discussing that week.\nThen we went on to have a larger class discussion, or split into groups, offering our viewpoints. Here Ms. Linn did an excellent job of keeping the class from veering off on tangents while still being respectful of student opinions. You could tell she occasionally found some comments stupid and/or mildly offensive but she managed to keep a straight face. Plus, she wasn't inclined to act like she knew everything about everything, which is refreshing from Columbia/Barnard faculty.\nWith our book review and term paper, she was super approachable and helpful in terms of guiding you in the right direction. She's really just a genuinely nice, happy person. \nRegarding the books--it was a mixed bag. Some were super detailed, well researched, and applicable.  Others were collections of obvious truisms illuminating little. Eh, what can you do. \n\n\nWorkload:\nEvery week, you're assigned the entirety or majority of prominent books in urban studies. You can mostly get away with not reading, but I always tried to get at least the jist for my own sake, if not much more. \nYou then have to read on your own and review another book you choose from a list. 6-8 pages I think. Not too challenging.\nThe term paper was 15-20 pages. Since she basically lets you write about anything (really, some of these projects seemed to have nothing to do with cities) it was really not too painful at all.  I actually enjoyed doing mine. (weird right?)  You also have to present your paper to the class.\n\n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 14, 2009",
            "review_content": "\nI didn't find the course that bad at all. Meredith was a very kind and approachable professor. She was always open to talk after class and during office hours, and I found her to be very friendly. I do agree, however, that she was very nervous as a lecturer in the first few weeks of the class, but as the course went along, I could tell she was becoming much more comfortable.\nThere definitely was a lot of information given, but I think one of the most important parts of the course was finding what was significant and then comparing it to what happened with other civilizations. I did find, however, that the lectures were with information that was interesting, but not necessarily important for the exams or papers. There were a few times where I found my mind wandering off  (or checking CULPA and Facebook on my laptop), but I did enjoy looking at pictures of excavations sites and learning about the different civilizations of the past. It reminded me of the time when I wanted to become an archaeologist after my 6th grade history unit on Egypt. \nThe reading was totally unnecessary. I didn't look at the textbook once (what a waste of money).\nI found that the tests were inappropriately graded because of TAs. The instructions on exams of what they were looking for was a bit ambiguous so I recommend spilling out as much information as you know - better be safe than sorry. \nI exercised the option of writing a paper to lower the weight of the exams. She was a fair grader in terms of the paper.\nWorkload:\nReadings assigned for each class, but was pretty much the same material that was reviewed in lecture. Midterm and a final. Paper options are available to lower the weight of exam grades. \n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 11, 2009",
            "review_content": "\nComplete joke. It's more shockingly elementary than 5th grade social studies. Atrocious class, maybe because Sev Fowles teaches the preceding course. Linn just finished the grad program and was clearly petrified the first couple of class, I don't think she made eye contact with the room until about three weeks into the course. I went to, oh, maybe 4 or 5 classes total for the first half of the course and got an A on the midterm. 'Nuff said. Easy A, but for those actually interested in anthro/archeology it's complete fluff\nWorkload:\njust cram the night before the exam. all the information you need is on the slides on courseworks. \n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 09, 2009",
            "review_content": "\nI don't know why the other review is so negative.\n I had minimal interest in anthroplogy but found the class relatively interesting. Who doesn't like Ancient Egypt? Yes, ceramics are horribly boring, but I have a notoriously poor attention span and could stilI could keep awake and taking notes. At first it might seem like information overload, but the exams are more conceptual based anyway. You'll never need to look at pictures of bowls and match them to civilizations, don't fret. Don't expect to spend hours memorizing dates, the class is more focused on overall trends of civilization (the interplay of religion and society, how people viewed their leaders, daily life, causes for rise and fall of cultures etc). She gives you a study guide term list for exams, which is uber-helpful. And she, while maybe not the most comfortable yet in front of a class, is cute and likable. Cracks jokes, albeit somewhat awkwardly. But it is her first year I think, so that is to be expected. She's actually relatively organized for a first-time lecturer. Notes/power points posted online, but you'll get into a mess if you don't keep up somewhat since the class goes through a lot of civilizations. \nGreat choice for major cultures, honestly. No paper, optional attendance, relatively not-dull subject matter. Would you really rather sit in a small seminar, doing weekly papers while some old man drones about medieval China?\nWorkload:\nCompletely unecessary reading, don't buy the text. Or at least only buy \"Ancient Civilizations.\" The \"Images from the Past\" was seemingly written for 7th graders. Recitations unecessary, just go twice, once before each exam. If you like your grade on the midterm, you can opt not to do any writing assignments, but if you bomb it you can write a couple doable essays to boost your grade.\n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "April 22, 2009",
            "review_content": "\nATTENTION: FOR THE LOVE OF GOD DO NOT TAKE THIS CLASS! IT IS SOOOOOO BAD!!! IF YOU TAKE IT YOU WILL WANT TO GO BACK IN TIME AND CHANGE THE COURSE OF HISTORY JUST TO MAKE IT LESS BORING! THIS IS NOT, I REPEAT, THIS IS NOT EVEN A SERVICEABLE CLASS BY ANY STRETCH OF THE IMAGINATION!!!\nphew. i've been waiting all semester to write that. \nfor real though, c'mon, I thought I went to columbia. this class made me feel like i was in 7th grade. for one thing, professor Linn seems like a nice lady and all, but she needs to not be teaching this class. she was a TA in the class last year, and this was so obviously her first time teaching i almost felt bad for her. the first couple of lectures i see her shaking.\nthen once she got more comfortable, she would consistently trudge through unbelievably excruciatingly dry (like seriously, I couldn't stay awake, and the class was at 4 pm) and usually irrelevant material for the first hour of the class. i was looking at my phone to check the time every 30 seconds. then she would often rush through things that seemed at least mildly important (all though still torturously boring) and relevant to know for say, a test, in the last 15 minutes. oh, and she would ALWAYS go at least 5 minutes overtime, which doesn't sound that bad, but when all of the testable information about \"the fall of such and such civilization\" is packed into the 5 minutes when you're supposed to be walking to another class, it sucks. \noh and the classroom was always really dark and hot. AHH I HATED THIS CLASS\nTHERE ARE SO MANY INTERESTING GLOBAL CORE CLASSES.... DON'T TAKE THIS ONE!!!\nWorkload:\nmidterm and final. or midterm paper and final. TAs grade really hard on the I.D. part of the tests, so BE AS DETAILED AS POSSIBLE! You'd think getting an A on both test essays would be enough to get a good grade on a test.. but its not! I learned this the hard way. STUDY THE TERMS EVEN THOUGH THEY ARE EXTREMELY BRUTAL.\nLITERALLY NO READING. (ok, theres reading. but I would honestly be blown away if 90% of the class opened either of the 2 books more than once or twice)\n"
        }
    ]
}