{
    "prof_info": [
        {
            "prof_name": "Deborah Lawrence",
            "prof_id": 2360,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 23, 2008",
            "review_content": "\nOverall I enjoyed this course and would highly recommend it as the perfect introductory course. Yes the lectures are sometimes boring and you can get away with not attending but if you attend the tests are much easier because you can tell what she is going to focus on.\nThe tests are four or five chapters each with about 30 multiple choice questions and then you choose to do four out of 8 short answers and then there is one long essay. The easiest way to study is to outline the chapters and then combine the outline with class notes to see what is most important. I believe if you do badly and talk to her you can figure out a way to do extra credit.\nThe paper is 6 -8 pages. You pick a question which you submit to her and then you research literature to try and answer it. It is really more of a literature review and is not very strenuous at all, just make sure to follow the APA (American Psychological Association) format which she gives you a link to.\nOverall, if you want a stress free introduction to psychology definitely take this class. Professor Lawrence, while boring at times, is a very fair grader and is willing to help anyone who asks.\nWorkload:\n3 Tests (4 or 5 Chapters each) - 23% each\n1 paper - 23%\nClass attendance and participation - 8%\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 19, 2005",
            "review_content": "\nI think this professor gets a bad rap.  Just because she doesn't try to trick you on exams, and doesn't test on things only appearing in the lecture doesn't mean that going to her class is a bad idea.  She only tests on material that's contained in the textbook, I know its almost a novelty at Columbia/Barnard, but that's what she does.  You can get by with just reading the textbook, but she explains everything in more detail, and I found her entertaining.  If you like psychology, I don't think you'll find her boring, and she is always open to other points of view, that's why she's considered an 'easy' grader.  She's not rigid and egoistic, again a novelty at our respective institutions.  She really cares about her students and their understanding of psychology.  Take the class, thats my advice, your transcript and your stress level will thank you.\nWorkload:\nWeekly readings, interesting textbook, midterm, final and 6-8 page paper, subject pool participation.  \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "February 19, 2005",
            "review_content": "\nI went to two classes, couldn't stand it anymore, and switched professors. She was a sweet woman, that came through clearly. But with that sweetness came a certain airheaded-ness that seemed toxic -- and I think that ditziness did turn out to be a serious downside, judging by the friends who stayed in her class and came to hate it because it was so mind-numbingly boring.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor Lawrence is an incredibly nice, incredibly boring instructor. Though many think psychology is interesting regardless of the teacher, she definetely doesn't help. Her class is incredibly easy and most people only go to take the tests. She is a sweet person though and has a good deal of knowledge about psychology. The lectures are boring, but tests count for the bulk of the grade and everything is in the book. She is a really easy grader.\nWorkload:\n2 tests, midterm, noncumulative final, research paper\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 05, 2005",
            "review_content": "\nDeborah Lawrence is an incredibly sweet, nice woman who really cares about her students.  I don't really feel like that point can be emphasized enough.  I remember one time she disagreed with this girl during class about something totally trivial and afterward she approached the girl and apologized.  That is just so nice.  ANYWAY.\nThat being said, you can imagine my guilt everytime I did not go to class (which was very often).  It' s just that the lectures were often (or always) kind of (or verrrrry) boring, and since the tests were so fair and only required textbook regurgitation it was hard to make myself go to class.  I think the rest of the class felt similarly since on the rare days I would come to class there would be like 10- 15 students there out of, I think, 40 or so.  I just feel bad since she is such a fair, kind teacher.  Oh, well.\nWorkload:\n3 non-cumulative tests of roughly five chapters each, one of which is the final.  one research paper with topic of your choice.  easy.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 03, 2005",
            "review_content": "\nProfessor Lawrence is a really, really sweet person. She's very soft-spoken, so that makes it a bit difficult to get through lecture, especially when students ask millions of questions and she politely discusses with them, but half the class didn't go anyway. It's not necessary to go to class, but I think she's nice, so I went for the most part, and it didn't hurt. She changed around exam/due dates to make them more convenient for us, and she emailed back quickly on questions pertaining to the paper. She's fairly laid-back from my experience, and the class is extremely manageable.\nWorkload:\n2 exams and a non-cumulative final, plus a research paper. all VERY fair. tests are pretty much by-the-book, and the paper's a topic of your choice.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 30, 2004",
            "review_content": "\nThis class is extremely boring. Lawrence takes interesting material and regurgitates the book into mindless lectures that seem to never end. Try and get a different teacher for this class. \nWorkload:\nMinimal\n"
        }
    ]
}