{
    "prof_info": [
        {
            "prof_name": "Angela Aidala",
            "prof_id": 3982,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "V3264 The Changing American Family",
            "review_date": "December 29, 2011",
            "review_content": "\nI disagree with the review below. I took the class because it looked interesting, and it very rapidly became my least favorite class of the semester. Professor Aidala was completely unorganized, and it was difficult to follow her thought processes- more often than not, she would go on tangents and rants about very small facts or concepts. The reading was kinda ridiculous, and we rarely (if ever) addressed them in class- in fact, often we would never talk about the readings at all, but then facts from them would show up on a quiz or the midterm. The number of students attending class dropped with every class there was (which is saying a lot, because there was an attendance sheet), and everyone who had a computer was either on facebook or doing online shopping. If you don't mind doing a huge amount of reading (much of which is repetitive, and obvious knowledge), and you don't mind sitting through hour and a half long tangents about how how the woman's role in the home hasn't changed, take the class. If you're looking at it because it looks mildly interesting, STAY AWAY!\nWorkload:\nheavy reading every week, 2 quizzes, a midterm and a final, plus participation grade. \n"
        },
        {
            "course_name": "Changing American Family",
            "review_date": "December 15, 2011",
            "review_content": "\nHave you ever taken a class that has made all your other classes look dim by comparison? That was totally what this class was like for me. Prof. Aidala is an amazing professor and the course material was fascinating. I'm not a sociology major, even though I've taken a few sociology courses, but I found this class totally related to both my major and other aspects of my life. This is definitely a class just to take to make your life better. It was refreshing to go to a class where the professor knows a ridiculous amount on the subject and yet still wants to know your opinion.\nThe TA, Melissa, was amazing as well. She made our discussion section engaging even though Prof. Aidala often didn't leave her with much left to discuss after lecture.\nA few caveats to the glowing review. 1) The course was SO disorganized. More often than not, the readings weren't where they were supposed to be and we were unsure of when quizzes would be given until a week before. Also, the readings got pretty repetitive after a while. 2) There was only one discussion section and it was right after lecture. Even though I loved discussion section, it was definitely a chore to sit in the same room for 2 and a half hours. 3) The tests/quizzes are pretty difficult and they're graded pretty harshly. You basically had to memorize definitions verbatim and then regurgitate them or you'd get points taken off for forgetting minor parts.\nI still highly suggest this class. It may make you never want to raise your children in the United States, but that's not the class's fault. Seriously, it's a great class.\nWorkload:\nModerate. Reading every week, 2 quizzes, 1 midterm, and a choice between a final or a research paper (12-15 pages)\n"
        }
    ]
}