{
    "prof_info": [
        {
            "prof_name": "Rui Yu",
            "prof_id": 12658,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "September 16, 2013",
            "review_content": "\nRui is a bro. He once swiped me into a subway when I was late for work. Similarly, he will help you learn stuff when you are confused. Best TA ever. I learned so much from this dude. \nHe really made me love maths and everything about it.  I used to like shapes and geometry in general when i was younger, but Rui really let me see the mathematical meaning behind their forms. There's a subtle beauty to them.  Now when I sleep, I dream about precalc, specifically, analytic geometry.Also knows his shit really well, like a boss. They want more text so here.\nWorkload:\nNot bad. Pretty good.\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "May 27, 2013",
            "review_content": "\nProf. Wang was a great instructor for this rather introductory mathematics class. He approached the subject at the appropriate level and presented the material in a very organized manner. Language difficulties, perhaps, made him difficult to follow and his decision to closely track the textbook (even in the examples given) during lecture made some us to \"miss\" a lot of sessions. If you read the book and did the practice problems, as well as the homework problem sets, there was no need to attend lecture. Going to class, however, helped you keep the material fresh on your mind before quizzes. A fair grader, he provided a small curve when giving out the final grades. The TA did an excellent job with the homework assignments, which were almost his exclusive domain (pun intended), but I did not take the opportunity to visit him during office hours.\nI got a B and, quite literally, I slacked during the entire semester, missing classes, missing two quizzes and bombing other two, and not studying well enough for exams. A 100 on a midterm was not an uncommon occurrence, in my opinion. Overall, Zhuhai gets an A-.\nWorkload:\nSeven quizzes (30 pts each) at the end of each chapter (20%); weekly HW assignments of easy to moderate difficulty (20%); midterm (20%); cumulative final exam (40%). \n"
        }
    ]
}