{
    "prof_info": [
        {
            "prof_name": "Marcus Folch",
            "prof_id": 9502,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Plato and Confucius: Comparative Ancient Philosophies",
            "review_date": "September 09, 2015",
            "review_content": "\nI came into this class with a moderate interest and no idea of what to expect. I left it overawed, and no one but Marcus Folch could have made that happen.\nHe intended for the class to consist of 20-30 students so it could be somewhat discussion-based, but someone forgot to set the limit on SSOL. There were almost a hundred for whole course. I don't know how he and the TAs felt about that, but they took it in stride. They got more TAs (obviously) and somehow kept on top of all of the papers and tests in a timely fashion.\nFolch was a patient, clearly spoken, insightful, and unbelievably witty. Somehow he was able to give his lectures some elements of discussion in spite of the class' size. We also held informal and guided discussion sessions outside of class. In all cases, I would leave those things feeling like I had gotten my money's worth. What higher praise can you offer than that when you go here? \nHe assigned mini essay questions for each week, of which you had to do at least 3. \nThe reading varied week to week between moderate (excerpts from Plato's work and some academic essays) to extensive (all of the Analects of Confucius). It's surprisingly doable, but you have to plan ahead so that you can take advantage of the lighter weeks. \nThere was one big paper due by the end of the semester, and that was challenging (but fun!) because we could customize our topic with TAs. \nThe midterm and the final: essays and terms (both fine), but super-extensive passage identification. You get all possible material on review sheets. If you haven't thought up and written out your answers in review then you are not \ngoing to like these tests. \nIn summary: Tough. Worth it. Easily my favourite experience at Columbia. I look forward to his next class. \nWorkload:\nThree 800 word papers, at least one of which was due before spring break. \nBig paper. 8-10 pages\nMidterm\nFinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 29, 2015",
            "review_content": "\nProfessor Folch's class was one of the most challenging I'd ever taken at Columbia. It also had the strongest impact on my academic skills and career. He was knowledgeable and generous with helping students after class and over email. I generally found him to be respectful and kind (though he had a few colorful moments, to be sure). And hilarious, which is why I think most people in my class loved him (that, and the fact that his charm and beauty are pretty much unparalleled). His essay feedback was sometimes brutal, but always useful. And, as I suppose one might expect from a Classic professor, he harbored an intense loathing for split infinitives.\nProfessor, thanks for a life-changing academic experience that was, for the most, part a great one. \nWorkload:\nStandard: critical responses, midterm and final, and two essays.\n"
        },
        {
            "course_name": "Plato and Confucius: Comparative Ancient Philosophies",
            "review_date": "April 16, 2015",
            "review_content": "\nAmazing intellectual. Incredibly knowledge and inspiring. Easily my second favorite professor at Columbia.\nWorkload:\nSubstantial, but reasonable, and you'll be challenged like never before.\n"
        },
        {
            "course_name": "Intermediate Greek: Prose",
            "review_date": "May 28, 2010",
            "review_content": "\nFolch is good, but demanding.  Very demanding.  One may even say that he is good because he is demanding, or that he is demanding because he is good. Either way do not expect an easy ride.  I took Greek 1201 with Folch and 1202 with Foley simultaneously (which I do not recommend for the sane) and found 1201 harder.  Significantly harder!\nExpect quizzes on grammar, vocabulary, and translation.  Be prepared to draw your vocab words!  They were irregularly scheduled but he gave fair warning, all three of ours were on Fridays and he let us know in class on Tuesday.\nHe assigned long secondary readings in English and short response papers.  His syllabus originally called for five of these but in the end we only did two with a third optional for extra credit.  I don't think he really cared about them and don't imagine him assigning as many of these in the future.  Strangely enough we never got them back!  Any of them!  He probably had enough papers to grade from the CC section he was teaching simultaneously.\nMidterm like the quizzes but longer.  Don't expect a choice on the passage to translate!  He allowed each of us to ask him two questions (vocab, grammar, whatever) during the course of the exam.  \nFinal was a longer midterm, although he allowed us to select two passages, one each from Plato and Hesiod, of four to translate.  Be careful the final is cumulative as far as the translation goes, though he restricted the vocab to the words he'd assigned from the midterm on.  In addition he assigned us 20 lines of Hesiod (your choice) to be memorized for the final.  They could be recited aloud in his office or written in the blue book.  I recommend going for the recitation.  It's faster than writing them out and he was forgiving of nervous stuttering, occasional stumbling, and even provided a word or two when I hit a mental wall.\nThe largest single portion of our grade was based on class participation and preparation.  Participation, in this class, means translating, translating, translating!  He demands that you translate from clean texts (no student written notes in them) and that you prepare written translations to be turned in.  He gave us all one \"pass\" day if we came in unprepared but after that he was not fooling around.  Do not try to come in and sight read the Greek, the Plato is too difficult, Hesiod's vocabulary is too large, and he can tell.  DO NOT COME TO CLASS UNPREPARED!  Why all caps?  To utter those words was the one time he raised his voice beyond a clam, professional, murmur.\nAll an all a good experience.  He gave a diagnostic quiz the first day of class (the first few lines of a Platonic dialogue) which utterly baffled me, but I can now read with ease.  Overall I'd give Folch the same grade he gave me, A-.  \n \nWorkload:\nDaily translations, (Plato's Ion and 500ish lines of Hesiod's Theogony), 2 short (2-3 page) response papers, midterm, final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2010",
            "review_content": "\nThis section was a pleasure!\nThis guy made me fall in love with CC and Philosophy. He is extremely knowledgeable about the texts that we read and likes to have students engage in the discussion. He wrote his dissertation about Plato so expect to get a bit of lecturing during the texts that are closer to the Plato readings. Also, the end of second semester had quite a bit of lecturing as well.\nBE WARNED THOUGH, he is extremely serious about his work and makes that very clear. The first few classes he may seem a little bit rough and tough but as the semester goes on and you  get to know him, you find out that he's a really cool guy. There are 6 pop quizzes throughout the semester (it usually happens after a class when people don't participate a lot). If you get a harsh sounding email from him, don't take it personally he is just really intense when it comes to his work and wants to make that show. \nOverall, a really great class. Oh and btw girls (and gay guys) you are in for a TREAT (wink wink).\nWorkload:\n2 papers per semester (6-8 pages double spaced), 6 pop quizzes, participation is 30% of your grade, 8 responses throughout the semester ( you get to choose which ones you want to do), midterm- Explications(10%), final- explications + essays (15%)\n"
        },
        {
            "course_name": "Augustan Poetry",
            "review_date": "May 11, 2010",
            "review_content": "\nProf. Folch's Augustan Poetry class was a joy. Prof. Folch knows his Latin extremely well and was very friendly during office hours and willing to help his students out. He has a wealth of experience in the Classics which made me appreciate the Vergil and Horace we read much more than I had before. Prof. Folch also has a good sense of humor and is not adverse to telling a funny anecdote during class.The class itself was organized a little haphazardly. We supposedly had scansion and vocab quizzes but they kept getting pushed back and moved around so no one was ever really sure when they were. A lot of our grade was based on participation, so raising your hand to translate is a good idea, but it was impossible for everyone to do so given the time-constraints of the course and the number of people in it (everyone from freshmen to postbacs and beyond). As a result, I'm not sure how grades were calculated but I ended up doing fine. Long story short, take a Classics course with this guy (can't speak to his CC skill). Your Latin will improve and you won't regret it.\nWorkload:\nNot bad at all. Felt like most of the work for this class involved getting up for its 9AM start time (participation was like 40%). We ended up doing about 60 lines a class, a little more was due on Tuesday and a little less on Thursday. I rarely had any trouble getting through it. Infrequent vocab/scansion quizzes which were pretty easy and graded fairly. Midterm was translation as well as identifying grammatical forms, pretty easy. Final ended up just being straight translation and was also pretty easy.\n"
        }
    ]
}