{
    "prof_info": [
        {
            "prof_name": "Tauqir Fillebeen",
            "prof_id": 2171,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Orgo Lab",
            "review_date": "January 04, 2005",
            "review_content": "\nThis class has very knowledgeable and friendly TAÂ’s, but they are no substitutes for Tauqir. So pre-meds, after serving your sentence in G-chem lab, welcome to a fulfilling learning experience in chemistry (a paradox, no doubt). She makes herself available during the classÂ…so any lapse in the knowledge of your TA will be filled in right on the spot. The course grading is very lenient all in allÂ…although while you are in the class, you may be judged fairly harshly on your lab and written work, so donÂ’t fret if you botch the journal report or the quizzes remind you of your grades from Professor Cornish. You will not curse the Columbia chemistry department every night after you leave this class, because it is very fair and is a good MCAT refresher.\n\nWorkload:\nEven without weekly reports, itÂ’s a bit of work. Weekly quizzes, weekly question sets, one formal journal report on a given experiment, identification of an unknown substance, certain in-class evaluations of lab skills.\n"
        },
        {
            "course_name": "Orgo Lab",
            "review_date": "October 31, 2004",
            "review_content": "\nShe is really the best Chemistry professor out there.  Not only does she know her stuff really well, you end up knowing the stuff yourself pretty well after you talk to her.  Do not miss out on her!\nWorkload:\npre-lab write up, weekly pre-lab quiz, unknown sample report\n"
        },
        {
            "course_name": "Advanced Organic Chemistry Lab",
            "review_date": "September 11, 2004",
            "review_content": "\nTauqir is amazing.  Though she mainly oversees the regular orgo labs, Tauqir basically teaches this one herself.  If you've managed to get to know her at all in orgo lab, you've come to realize she is by far the funniest, nicest and smartest instructor this department has to offer.  In a roster dominated by \"serious\" (aka ones who take themselves too seriously) research professors, Tauqir is like a breath of fresh air.  More often than not she is more knowledgeable than the lecture professors, but most importantly she can explain things without condescending.\nBy all means, take Advanced Orgo Lab if you're interested in the subject.  The class itself is taught with less structure than Orgo lab, which thankfully means more individual initiative along with more interesting/challenging lab work.  It is by no means disorganized though, for Tauqir's been at this for quite a bit.\nWorkload:\nA few longer labs that generally run over the time allotted, but what is due and when is flexible because this class isn't about premed grade-grubbing so much as it is about developing your own lab skills and interests.  One final synthesis/investigation that is quite difficult, but plenty of help is provided.\n"
        }
    ]
}