{
    "prof_info": [
        {
            "prof_name": "Marc Derose",
            "prof_id": 2720,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Floor Hockey",
            "review_date": "August 20, 2006",
            "review_content": "\nThis class is Awesome (notice capital A). Remember high school gym classes where you had to learn stupid crap and you sit around anxiously to start playing a fun sport? Yea, me too. Well, that's all over now. We started playing almost immediately. There were no long speeches or stupid crap hindering the fun in any way. The coach and his assistant were great because they love the sport and sometimes join in on the games. It was a dog eat dog world in the blue gym and I would do it again. It's not so competitive that a newbie would get cut, but put your game face on, be ready to sweat and have fun, and be aggressive. It's a 50 minute adrenaline rush that no soccer or volleyball game can get you at Columbia. Overall, I'd say this class is the best class Phys Ed has to offer. God Bless Marc Derose and his carefree attitude about allowing the youth of America to have unadulterated fun. Awesome. Awesome. Awesome.\nWorkload:\nIt's a pass/fail class. If you miss more than 6 classes you fail. Being late is mostly excusable. If you like to play hockey as much as the coaches do, you're in.\n"
        },
        {
            "course_name": "Floor Hockey",
            "review_date": "December 16, 2005",
            "review_content": "\nThis is the best class at Columbia.  No joke.  You just play floor hockey.  Show up.  Get sticks from the closet.  Screw around for five minutes (he's really nice about people being late).  Then split up into two teams and play floor hockey.  It's that simple.  No drills, no training, and no warmups, except whatever you do during the screw around time.  We got to play hockey on the first day of class.\nIt's competitive and pretty intense though.  Don't come unless you want to play floor hockey.\nThis class is way better than any other PEs I've heard about, too, in terms of just overall fun value.\nThe only downside?  You're going to sweat.\n"
        }
    ]
}