{
    "prof_info": [
        {
            "prof_name": "Hilary Hallett",
            "prof_id": 3573,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "listening to american popular culture",
            "review_date": "April 23, 2012",
            "review_content": "\nEvery day Professor Hallett just stood in front of the class reading from her notes aloud. It was almost impossible to keep up with what she was talking about because whatever she was reading was so dense and disorganized and she didn't seem to have any interest in engaging the class AT ALL. What little discussion there was usually only involved a single student. There were only about two or three times all semester when she asked any questions to the class. On those rare occasions no one seemed interested in answering the questions, and it didn't seem like she cared either. She just wanted to get back to reading her notes. \nIt's possible there was some important and interesting material in the readings, but Professor Hallet's bland-to-death style pretty much ruined any chance of us maintaining interest in anything. Instead, the readings were just chores to complete so that when her directionless chatter switched off your brain in class the next day, you could at least pretend that you had some idea of what she thought she was talking about. In reality, the readings, like the class, were a waste of time. \nIt's a real shame because Professor Hallett seems like she is genuinely a nice person and this class could have been fun and interesting. She just seems completely uninterested in making any attempt at creating an engaging environment for her students.\nThe regular classroom was in Fayerweather, but every week we had to trudge up to Knox hall for discussion section and that, frankly, was a pain in the ass. I know there are available rooms on the main campus, but I guess they needed to stay empty for some unknowable reason.\nWorkload:\nAbout 5 articles or book chapters a week and the willpower to stay awake for 75 minutes of the most boring lecture you'll ever encounter.\nTwo 5 page papers (20% each), a midterm (25%) and a final (25%), plus 10% for attendance (this means you have to be there for her mind-numbing lectures). \nThe papers and tests aren't difficult, but like the rest of the class, it's pretty much impossible for them to be interesting.\n\n"
        },
        {
            "course_name": "Gender History and American Film",
            "review_date": "December 21, 2008",
            "review_content": "\nGender History and American Film looked at film history through multiple lenses--pun intended--which is not an easy task for the professor nor students. Professor Hallett, however, excelled, illustrating her expertise in film studies, American history, and gender studies simultaneously. The class focused more on contextualizing blockbuster films within their time period, from the silent era into the 1960s, rather than analyzing stylistic elements of cinema, but incorporated discussions of technique when relevant. The readings were varied and interesting, and Professor Hallett encouraged students to be critical of them as one must be critical of how films do and do not reflect real life. She led focused dicussions with an excellent balance of student comments and her lecture, which was unfailingly entertaining. She is also very reponsive and helpful when approached. The movies were nearly all enjoyable, if not at face value than for their deeper significance, and the assignments likewise interesting. I highly recommend Professor Hallett and this class in particular for providing an alternative way to view American history through film and culture.\nWorkload:\nNeither easy nor unreasonable set of weekly readings; three five-page papers (2 film analyses and 1 film media analysis); one film viewing per week; one final 12-15 page paper on film/star of your choice. At least one visit to the Library of Performing Arts is engaging and of necessity for assignments.\n"
        }
    ]
}