{
    "prof_info": [
        {
            "prof_name": "Albert Fung",
            "prof_id": 2746,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Lithography",
            "review_date": "January 11, 2006",
            "review_content": "\nFrom the first day I came to Al's litho class, I knew that it was going to be good because after having a hard time getting into a visual arts class, he said \"fuck it\" and let me into his class even though it was full.  Al really cares about his students, taking the time to help you out with the technique while allowing you to come up with your own ideas for projects. He gave us projects that gave us enough artistic freedom and allowed us to build on our previous prints by reworking our stones.  The class was very laid back- you could come in a little late in the morning and he wouldn't care, and the TA's were fun and helpful.  Also, the fieldtrip to MOMA was great because we got to see famous artists' prints in a private display in the printmaking office of the museum.  The only complaint that I have about the class is that the critiques are unbearably long because we did one critique per project, which meant that we talked about four prints per person.  The critique of the final project was over four hours long, which most of us found to be excessive.  Regardless, I definitely recommend this class- I knew nothing about lithography when I started and now I love it.  \nWorkload:\nTwo projects, each consisting of four sets of prints. One project is on self-portraits and one is on interpretations of landscapes described in pieces of writings or songs of your choice. To get this all done on time, you will probably have to work extra hours during the week, especially close to the deadlines.  Overall, the workload isn't terrible if you try to get as much work done in class as possible.\n"
        },
        {
            "course_name": "Lithography",
            "review_date": "January 08, 2006",
            "review_content": "\nalbert is an awesome professor and his class was extremely fun and interesting. al knows everything about basically anything; his knowledge of lithography and other random things is incredible. although there are assignments, the class is very open-ended. al basically wants you to learn as much about lithography as possible and to become comfortable with the entire process. he encourages you to experiment with various techniques; my favorite suggestion was whipping the stone with a chain off of the street. take this class if you want to spend a lot of time with your stone and learn tons about lithography and anything else from al.\nWorkload:\n2-3 large projects. lots of time spent in the studio outside of class hours.\n"
        },
        {
            "course_name": "Lithography",
            "review_date": "December 22, 2005",
            "review_content": "\nAl \"know what I mean?\" Fung is amazing.  The class starts off on the first day with you learning basic technique.  And you perfect (or experiment with) that technique for the whole semester, because litho, as you will learn, takes a TON of time.  If you don't want to spend an hour rubbing and learning to love a stone, don't take this class.  \nBut Al is a master printer, very skilled and hilarious, he'll teach you about love, about hate, about picking glass up off the street and just whipping that stone (till it bled), but most of all he'll teach you about Respect (Aretha style).  He's very personally oriented, always curious about your individual projects, how he can help, different techniques to use, and he never judges your art.  That said, crits are AWFUL.  They last 5 hours, are completely unhelpful, they go so slowly they are pained, know what I mean?\nWorkload:\nAssignments are open-ended and well designed.  Good subject material, like songs and books.  But beware, if you don't plan on spending lots of extra time in the studio for monitor hours, you probably wont be able to finish the required number of prints.  Also, litho is very time intensive... you can slack off, but it shows. \n"
        }
    ]
}