{
    "prof_info": [
        {
            "prof_name": "Carol Schulz",
            "prof_id": 1936,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Korean I",
            "review_date": "May 17, 2016",
            "review_content": "\nSchulz is clearly passionate about teaching Korean, and I think she truly cares about her students' well-being. There are certainly improvements she could make to the way she teaches; the main one is that she has a tendency to make her students keep guessing until they get the right answer if they have the wrong answer the first time, which I don't think is a very effective method - if I get it wrong the first time, and don't have the correct answer within the next two tries or so, it's clear that I don't remember the grammar rule that you want me to remember. She's not particularly good at explaining grammar rules either, if you don't already have an understanding of Korean that goes beyond class-time, but she's certainly willing to go over them again and again with you after class. Overall, it was a bit of a struggle to adapt to her teaching style in the first semester, but I think by the second semester, everyone started to understand how she worked, and things got better. Like the previous review said, she's a very sweet old lady for the most part, so just don't get on her bad side, and show her that you're really dedicated to learning Korean.\nWorkload:\nA few workbook pages each night, daily vocabulary quiz (not too bad, just practice for about twenty minutes a night), test every two weeks. \n"
        },
        {
            "course_name": "Intermediate Korean I",
            "review_date": "January 17, 2015",
            "review_content": "\nProfessor Schulz is a really adorable old lady but after one semester with her, i have absolutely no patience for her. Her classes are extremely boring and she doesn't really have a method of teaching. She really just reads from the textbook (which she wrote) and makes you memorize stuff. We had vocal quizzes almost every day which ended up not counting for much but were just a pain to constantly have to study for. I previously had Professor Song as a teacher before the intermediate class and comparing the two, its obvious that Song is more prepared and helps her students learn more effectively. Its almost the end of break and I can't remember a single thing I've learned in Schulz's class. She's a nice lady but not a good language teacher. \nWorkload:\nmany vocab quizzes, a chapter test/quiz every two chapters or every chapter and a half, midterm, final, skit projects that you work on with one other classmate, daily workbook exercises for homework, memorizing conversations\n"
        },
        {
            "course_name": "Elementary Korean",
            "review_date": "December 21, 2008",
            "review_content": "\nCarol Schulz is an effective teacher. By the end of the semester, you will feel like your Korean speaking and writing ability has improved significantly.\nHowever, she is not the easiest grader. A strict 94% A rule is followed, and your final grade is based on a number of factors--attendance, quiz grades, participation, midterm/final, etc.\nIt is hard to track how well you are doing in class unless you go into her office hours and speak with her in person. This is actually key, since you will be able to set a good impression with her and also make adjustments to your studying habit.\nWorkload:\nNearly daily vocab/grammar quizzes, toward the end, we didn't really have any\n6 or 7 chapter quizzes based on the material covered in the book\n1 midterm half way through, 1 final at the end\nno surprises on any of these quizzes or tests--if you know the grammar/vocabulary, and how to spell, you will do fine.\n"
        },
        {
            "course_name": "Elementary Korean",
            "review_date": "December 29, 2004",
            "review_content": "\nShe goes fast. It doesn't matter if you're not Korean. It doesn't matter if you are Korean and Korean hurts your brain. But she really cares. And you can make appointments that fit both you and her for as many times a week as you need. Though they are largely not of much use, they can help when you really don't understand certain things like, oh, particles. Korean language as a whole is hard. Spelling is hard. Pronounciation is hard, and I worked pretty hard hoping that a first year course in language would offer an A, but only reached B+.\nWorkload:\nWorkbook stuff, skits with a partner, essays once a month. About the same for any Asian language class.\n"
        },
        {
            "course_name": "Advanced Korean",
            "review_date": "January 14, 2004",
            "review_content": "\nProfessor Schulz knows her stuff.  I have never encountered a more detailed instructor of the Korean language.  She WILL improve your Korean.  And although there were times when the class moved rather slowly as she made sure that EVERYONE thoroughly understood the grammar points, my experience in this class was overall quite pleasant.  \nWorkload:\nPretty high.  You are constantly either working on your Hanjah packet, grammar homework, listening/speaking exercises, and compositions.  There are periodic quizzes (like Intermediate/Elementary), midterm, final, and an oral presentation.\n"
        }
    ]
}