{
    "prof_info": [
        {
            "prof_name": "Steven Kou",
            "prof_id": 1176,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Simulation",
            "review_date": "January 29, 2013",
            "review_content": "\nProfessor Kou was a very clear and easy to understand professor. Simulation was a hard class, but he had an incredibly lenient curve - if you were half a standard deviation above or below the average you got an A-. SERIOUSLY WHO DOES THAT IN SEAS???!?\nHe posts lecture notes and basically just goes through them word for word in class on the blackboard. This makes it easy to follow along and to study later on.\nWorkload:\nWeekly problem sets, and roughly-weekly (sometimes twice a week) in-class homeworks (these are not announced, so you have to actually attend, or at least make it to class 15 mins before the end), 2 midterms, a final\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "January 29, 2013",
            "review_content": "\nProfessor Kou was a very clear and easy to understand professor. Simulation was a hard class, but he had an incredibly lenient curve - if you were half a standard deviation above or below the average you got an A-. SERIOUSLY WHO DOES THAT IN SEAS???!?\nHe posts lecture notes and basically just goes through them word for word in class on the blackboard. This makes it easy to follow along and to study later on.\nWorkload:\nWeekly problem sets, and roughly-weekly (sometimes twice a week) in-class homeworks (these are not announced, so you have to actually attend, or at least make it to class 15 mins before the end), 2 midterms, a final\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "January 29, 2013",
            "review_content": "\nProfessor Kou was a very clear and easy to understand professor. Simulation was a hard class, but he had an incredibly lenient curve - if you were half a standard deviation above or below the average you got an A-. SERIOUSLY WHO DOES THAT IN SEAS???!?\nHe posts lecture notes and basically just goes through them word for word in class on the blackboard. This makes it easy to follow along and to study later on.\nWorkload:\nWeekly problem sets, and roughly-weekly (sometimes twice a week) in-class homeworks (these are not announced, so you have to actually attend, or at least make it to class 15 mins before the end), 2 midterms, a final\n"
        },
        {
            "course_name": "IEOR E3106 Stochastic Models",
            "review_date": "March 03, 2006",
            "review_content": "\nThe Good:\n-Gives out copies of lecture notes before class\n-Lets you hand in HW AFTER he goes over half of the problems\n-Tests based entirely on problems from HW, class, and sample tests\n-Very approachable for questions after class\n-Extra long office hours before tests\n-Curves to an A-\n-Lectures flow well; he is well prepared\n-Takes some lectures to teach application of Stoch (ie. stock pricing, options pricing)\nThe Bad:\n-Accent sometimes hard to follow; sometimes stutters\n-The subject material is hard--you won't understand it even after the final\n-No lecture notes if you don't show up to class\n-In class quizzes can be difficult if you didn't pay attention\nOverall: probably the best teacher you could have for Stoch in the IEOR department.  I've had Sigman for ProbStat before, and I consider Kou an easier A and an equally well organized teacher.  The paper lecture notes he hands out are a huge help, though he doesn't lecture as well as Sigman.\nWorkload:\n1 midterm (3 problems), 1 final (~8 problems), weekly HW (half of answers from recitation, half given in class by Kou the day they're due)\n"
        },
        {
            "course_name": "Stochastic Modeling",
            "review_date": "January 01, 2006",
            "review_content": "\nNot a very good instructor, but the advantage is that you don't have to pay any attention in class and its the same as if you sit in the front row center.  You have to go to class though because there are about 10 pop quizzes over the course of the semester. Kou is a very nice guy, but he moves quickly and doesn't really relate the material well. The Stochastic Models topic itself is very difficult and not very interesting.  The way Kou conducts the class though makes it much easier than it could be. \nWorkload:\n10-11 Quizzes. 1 Midterm. 1 Final.  HW about every week.  Curves to a B+. \n"
        },
        {
            "course_name": "Stochastic Modeling",
            "review_date": "December 24, 2005",
            "review_content": "\nGood guy, but can be hard to understand.  He's young, eager, and can be strict.  The class sucks and Kou doesn't make it any easier to understand.  Of course, the book is even worse. But if you get the material, or get half of it, everything will be fine.  Go to class, study the homeworks & practice test, and don't worry if you get a 40% on a test because it's probably still an A.\nWorkload:\nPop quizzes almost every class, impossible problem sets that he gives answers in class too, and a hard but generously curved midterm & final.\n"
        },
        {
            "course_name": "Introduction to Stochastic Modeling",
            "review_date": "December 27, 2004",
            "review_content": "\nI disagree with most of the reviews of Professor Kou.  Sure, English is not his first language, but it is very comprehensible.  Professor Kou shows his enthusiasm for the material during his lectures, which are quite organized and comprehensive.  In addition, he is very nice guy, helpful during office hours and often asks for feedback on how the class is going.\nProf. Kou's grading curve is almost too good to be true; with a little effort, it's quite easy to get an A-range grade.  Be sure to study in-class examples, case studies, \"in-class homeworks,\" and problem sets before each exam as almost all exam problems are verbatim from these sources.\nWorkload:\nWeekly problem set, which are very difficult...be sure to attend all recitations, as the TA does out all HW problems.  One midterm, which is pretty easy, and one difficult final.  Of course there are the in-class homeworks (ie: quizzes) which aren't too bad if you pay attention during lecture.\n"
        },
        {
            "course_name": "Financial Data Analysis",
            "review_date": "October 09, 2004",
            "review_content": "\nSimply the worst, most frustrating course that I have ever taken. Only 1/10 of the notes relate to the homework. He goes over so little of the topics for the homework that the only people in the class able to finish it have degrees in statistics. I would say avoid Kou like the plague, but if you are in the MSFE program, you won't be able to help it!\nWorkload:\nHomeworks that will take you 15 hours because he simply doesn't cover the material and it is NOT in the text either. You will be left searching the internet and searching out other people for help. But collaboration is NOT allowed!\n"
        },
        {
            "course_name": "Probability and Stats W3600",
            "review_date": "December 23, 2003",
            "review_content": "\nI agree that Prof Kou doesn't care much whether he is teaching 100 or 2 people. But actually, if you went to class and made some effort to listen to him and copy his slides, things aren't that bad. Exams are based strictly on homeworks, case studies and recitation problems. So if you took some effort in reviewing those before the exam, you will do great. He won't ask anything he hasn't mentioned in class. I agree, he can be boring and hard to understand but he is quite a nice guy in general, his curve is so good that you will be in the A range quite easily. If you have a choice, you should probably take someone else's class, but if you are stuck with Kou (as most of us are) then make sure you go to class and it's really not that bad.\nWorkload:\nProblem sets that can be ridiculously long and time-consuming, but you can learn a lot from doing them. 2 midterms, and a non-cumulative final, not bad at all.\n"
        },
        {
            "course_name": "W3600 Introduction to Probability and Statistics",
            "review_date": "December 19, 2003",
            "review_content": "\nDO NOT TAKE THIS CLASS!!! I do not know how to say this more clearly. The reason is that you will learn nothing although you may get a \"not too bad\" grade on the class. This guy cannot teach. If he did not take attendance not even one student would go to a single lecture throughout the semester since the lectures are so pointless. His exams are not that hard; because everything is from problems that were solved before. You will never be able to understand the material completely. So, sometimes (or all the time) you will need memorize how problems are solved. Furthermore, his homeworks are tedious and long since you do not know how to approach the problems. Therefore, you have to read everything on your own and teach the material to yourself. In other words, there is no point in having Kou as a teacher. Exams are not that hard but towards the end of the semester you will reach a point where you will ask yourself \"Do I really have to do this?\" or \"Is it Kou's job to teach at least one thing?\". If you have the chance take this with someone else since the material is in fact interesting and a good teacher may make you like it which would help you a lot in the future in courses like Stochastic Models or Econometrics...\nWorkload:\nHomeworks take a long time since you do not learn anything in class. There are two midterms - not too hard since they are from previously solved problems. The final is OK but not easy.\n"
        },
        {
            "course_name": "Probability and Statistics 3600",
            "review_date": "December 07, 2003",
            "review_content": "\nDO NOT TAKE THIS TEACHER.  he is the worst teacher i've ever had.  period.  i've never heard so many complaints about a teacher.  Because he's such a horrible teacher and nobody went to his class last year, he forced attendance this year and started doing daily quizzes.   On the last exam, he tested us on this trivial, obscure formula that was briefly mentioned in 1 of the homework questions.  Not only that, but if you did not know it, you lost 25% of the exam.  If you have photographic memory or are not afraid of unfair grading and horrible teaching....go for it.  otherwise, tell everybody you know to steer away from this teacher.  \nWorkload:\nhomework, recitations, and case studies....all of which you have to memorize for the test (extremely hard to do).  unfair grading and unfair tests.  if you're a masochist, take his class.  otherwise save yourself the pain.  \n"
        },
        {
            "course_name": "Probability",
            "review_date": "May 28, 2003",
            "review_content": "\nKou is a little tough to understand at first, but is very helpful through office hours.  Attending classes is key, as he gives some problems and case studies that will be on exams.  But, he does cover all the stuff you'll need to know for future classes.  A little extra effort in this class will make junior/senior year much easier.\nWorkload:\nLong weekly problem sets, midterm, final.  Not over excessive though\n"
        },
        {
            "course_name": "Intro to Prob/Stat, Intro to Operations Research",
            "review_date": "July 08, 2002",
            "review_content": "\nThis guy simply does not know how to teach. He could be lecturing to an empty room and it wouldn't make a difference to him. He's a great guy and enthusiastic about the subject, but his lecture style is extremely boring and he doesn't take the time to explain concepts fully. He goes into complex derivations that no one can follow and usually includes something about Option Pricing (his personal specialty) that does not belong in the course. Students end up skipping class and relying on the book to understand the material. His tests are based directly on homework problems and case studies presented in each class, but this sounds deceptively simple. The case studies are impossible and people usually memorize them word for word. Try memorizing 20 case studies and reviewing 100 homework problems based on material that was never explained to you correctly. Not fun. \nWorkload:\nWeekly problem set (collected), midterm, final\n"
        }
    ]
}