{
    "prof_info": [
        {
            "prof_name": "Lorenzo Polvani",
            "prof_id": 1993,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "January 13, 2011",
            "review_content": "\nPolvani is a great teacher who made complex variables relatively interesting and bearable during the 2.5 hours of weekly lecture, considering that it's late afternoon, when everybody is mentally and physically drained already. He goes through most of the material very thoroughly, minimizing students' pain, by presenting a healthy mix of derivations and applications (+ occasional tangents). He has a cute, but comprehensible, accent and is generally very receptive to questions/comments/corrections to mistakes. He will actually slow down his pace and reiterate certain things depending on people's requests.\nMake sure to come to class when he covers CHAPTER 6; otherwise, be prepared to spend a billion hours deciphering the hieroglyphics in the book and still getting confused while doing the long, torturous homework assignment over Thanksgiving break \n(i went to lecture, but still spent most of the holiday doing the HW and suffering from the messy algebra). \nBe warned that the exams are not simple at all - you need to really know the stuff cold so that time wouldn't be an issue. STUDY, STUDY, and STUDY hard - practice problems, but keep in mind though that understanding of concepts, rather than the ability to perform robotic-like, mindless calculations, is key (think critically!!!).\nAlso, be heedful of the questions on branch cuts and Mobius transformations -> Lorenzo loves these subjects, but did not provide enough examples, and to make it worse, the text we used, Saff Snider Fundamentals of Complex Analysis, was useless for these topics. \nEnjoyable experience overall, to say the least. Very polite, humble, but funny man who respects each student. Only complaint is that we did not get our final course grade until January.\n\nWorkload:\nWell-Chosen Weekly Problem Sets (10 in total, count for 25% of final grade): Supposedly, the worst one is dropped, but do them all carefully to prep for the tests. These are the \"easy\" points - show lots of work to prevent loads of pts from being arbitrarily deducted by the picky TAs, who are hard to find outside of office hours. Is responding expediently to emails that hard??? \nMidterm (25%) - straightforward, except for the last killer question\nExtremely Challenging Final (50%) - difficult, but partial credit awarded accordingly and fairly  \nBoth of these contain a healthy mix of computations and \"pseudo\"proofs. \nHe also had several other schemes, but WONDERFULLY generous curve in the end!!! Amount of effort put in will actually translate over to a good grade, unlike some other courses.\n\n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "April 11, 2010",
            "review_content": "\ncool guy, cool ish class.\npolvani is really, REALLY exuberant about complex variables. he definitely makes the 2.5 hour long class less painful to sit through, and it usually pays off to go to class. the material is a little daunting at first, but the calculations are always simple and solutions are very straight forward. (and there's a solutions manual always floating around that i'm sure you can find.)\nthis class is required for applied math majors, but i think that other majors could definitely enjoy it as well. you really don't need to know any super advanced math for it anyway.\nWorkload:\nweekly psets, 1 midterm (fair-the average was like a 78), 1 difficult final\n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "January 18, 2010",
            "review_content": "\nThis past semester, I only went to two classes regularly.  One was a lab class so it was mandatory, and the other was this.  Professor Polvani makes his weekly 2-hour lectures a breeze; he is so enthusiastic about the subject, it makes you get involved too.  He is very thorough in his proofs and examples, pausing often to ask for questions or add quirky remarks.  In short, Polvani is awesome.\nThe homework generally took about 4 hours each for me although there was one that took more than 10 hours, so just look out when he covers chapter six.  Otherwise, I found doing the homework really helpful since the exams covered the same material.\nThe midterm itself was not too difficult since the material covered to that point is largely basic.  The final was harder, but not too much so.  The curve is not bad, though there were only two A+'s.\nWorkload:\n10 homeworks (25%), 1 midterm (25%), 1 final (50%)\n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "January 13, 2008",
            "review_content": "\nBy far one of my favorite professors at Columbia. He is completely approachable and very helpful. Also he might be one of the nicest people I have ever met, always encouraging questions during class even though some were really stupid. He is a little scattered and tends to make errors with his calculations on the board but always encourages students to correct him. He makes a difficult subject easy to understand and fun. The only problem I had with the course was that it was a 3 hour lecture on Monday nights. Since I came straight from another class it made for a long day, but he gave the class a break. The lectures aren't mandatory but you should stay. They are usually helpful for an understanding of the subject before attempting the homework and because he is awesome. \nWorkload:\nweekly problem set, can get difficult. TA sessions extremely helpful (may depend on the TA though...). easy midterm, very difficult final\n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "January 08, 2006",
            "review_content": "\nI never thought I'd look forward to my last class of the week -- a TWO AND A HALF HOUR long class on Thursday evenings from 4.10-6.40pm.  But Prof. Polvani (he insisted we call him Lorenzo) made complex variable come alive for those 2 hours!  Lorenzo is a fantastic professor; it was his first time teaching complex variables but he was absolutely fluent and competent.  He answered each and every question the students posed to him -- and by Thursday evenings brains are pretty fried -- and never revealed a sense of impatience or annoyance.  He took us through various theories, stopping for a moment after a parcitularly important one to tell us to \"admire the beauty of this tango of equalities!\" and often his notes superceded any use of the textbook.  He has fantastic board management, and gives a generous 15 minute break in the middle of the 2.5 hours.  He is always available to answer questions, and treats the students as they should be treated -- with respect, enthusiasm, attention.  He's one of the most amazing professors I've had thus far at Columbia; I strongly recommend a class with him!\nWorkload:\n5-8 problems per week, depending on the length of the problems (towards the end of the semester, one takes about 40 minutes!).  A midterm (this is negotiable) graded generously (our mean was a 90!) and a final that is considerably harder, but not impossible.\n"
        },
        {
            "course_name": "Partial Differential Equations I",
            "review_date": "February 12, 2004",
            "review_content": "\nLorenzo Polvani was a great teacher. He made a subject that students probably usually hate painless. I hated Ordinary Differential Equations (taught by Krichever) and was dreading taking PDE, but it turned out to be one of the better classes I've had. This is probably the only painfree PDE experience at Columbia: everyone hates the pure math one and I think Bal, APMA 3102 is worse than Lorenzo. Polvani's lectures broke down lengthy problems into very straight forward techniques. He's not a native English speaker, but it's good enough that I shouldn't have even mentioned it. \nThis class is identical to APMA 3102: Applied Mathematics II, but has a graduate course number for first year grad students (mostly Biomedical Engineers and some Applied Phyics/Math). The midterm had its share of tricky questions but was not too hard. I thought the class was really straight forward until the last 3 weeks (the worst time for a class to get hard) when we started doing non-homogeneous problems and Green functions. Of course they were the focus of the final and I thought it was impossible. It's one of those courses where the final includes what's on the midterm indirectly, but all of the questions are from the last half of the semester, so I felt totally incompetent even though I was really comfortable with at least 75% of the material.\nWorkload:\nWeekly homeworks (3-5 problems- usually a whole side of paper for each), (relatively easy) midterm and (more difficult) final. \n"
        }
    ]
}