{
    "prof_info": [
        {
            "prof_name": "Jameel Khaja",
            "prof_id": 2016,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Film",
            "review_date": "August 16, 2007",
            "review_content": "\nA really great professor. He managed to hold some engaging discussions at 10:00 in the morning in a dark viewing room with over 100 students. Not bad. \nHis syllabus offers such a range of films, from short experimentals to documentaries to classics to Top Gun. So chances are, you'll dislike some and like a lot of them. His rants- free associative reviews of the films in class- are a pretty cool idea, not nearly as tedious as they sound. I liked the photo assignment a lot. The papers are great because he gives you complete freedom in choosing the film AND the methods on which you are analyzing the film. \nTake this class if you have a basic interest in film or if you want a fun elective that will expand your movie vocabularly. But as other reviews have mentioned, it is NOT an easy A. Your writing in particular has to be strong; writing for film classes is quite different then writing for other courses. \nWorkload:\nA quick and painless rant every few weeks (1-2 pages, typed double-spaced), a fun photo project, midterm, and final papers. The readings can be heavy, but you can pace yourself as they're not really critical until you start writing the papers.\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "May 26, 2006",
            "review_content": "\nI recommend this class without hesitation.  Having little knowledge of the history of cinema, I took this class purely for fun, and it was a great decision. Jameel has the ability to make an otherwise dry lecture about the business structure of movie studios into something fascinating.  He always opens up the class to discussion, and he doesn't care if your favorite movie is an obscure French film from the 1960s or \"Wedding Crashers.\"  I never felt like I wasn't sophisticated enough for this class, and I picked up some new favorite movies along the way.  I learned so much in this class, and it has completely changed the way I watch movies.  The films he selects for viewing in class are, for the most part, really entertaining and/or interesting, and they get better as the semester goes on.  My one caution: this class is NOT an easy A.  I think it is a pretty easy B+ though.  Regardless of your final grade, this class is definitely worth it.  \nWorkload:\nA midterm paper (on a movie we've watched in class) and final paper on any movie from the last five years. A photo project (basically a movie storyboard). Four \"rants,\" which are basically a two-page journal describing youor first impression of any movie we've watched in class--really easy to do.  Also, class attendance and attendance at discussion section are mandatory.  It looks like more work than it is--take this class. \n"
        },
        {
            "course_name": "Intro to Feminist Theory",
            "review_date": "August 31, 2005",
            "review_content": "\nJameel is a gem.  A really fine teacher.  I highly recommend him....But...Beware the discussion sections! They are a huge weakness of this course.  Two of the Three TA's in my class were not very knowledgeable but very opinionated and hard graders.  This was occasionaly a difficult mix to stomach.  A wonderful discussion led by Khaja was followed by an hour of everyone in my section looking like the life was being slowly bled from them.  (no joke.  we grew pale. listless.  and angry.) I hated my section so much it felt too mean to review the TA individually.  She never should have been placed in that position.  Unfortunately, the TA's do a sizable amount of the grading....Anyway, Great class overall.  But consider yourself forewarned.  Don't let your discussion section ruin it for you (if you can help it)\n"
        },
        {
            "course_name": "Film Theory I",
            "review_date": "March 30, 2004",
            "review_content": "\nI signed up for this expecting Schamus, but as it turned out, Jameel made the class more engaging, informative, and fun than I expected. Jameel is very well-versed in film theory, and does a terrific job of making even the driest of theorists (Kracauer) relevant to contemporary popular and avant garde film. He is extremely enthusiastic, and pushes his students with questions and analogies until the theory readings come alive for them. His lectures never failed to clear up ambiguities in the readings, although the films screened were not always as obviously relatable to the readings. If you take this class as a junior or senior, there will be a few films you've seen before, but movies like \"Potemkin\" and \"Rules of the Game\" deserve another look. Jameel is a great teacher, not at all like some of the prima donnas in the film department. Take this class.\nWorkload:\nAmple readings for each week. 3 in-class quizzes with short take-home essays, 5 \"journals\" (2-3 pgs. each) on readings, final paper (~5 pgs.).\n"
        }
    ]
}