{
    "prof_info": [
        {
            "prof_name": "Anne Prescott",
            "prof_id": 622,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year Seminar: Legacy of the Mediterranean II",
            "review_date": "June 09, 2010",
            "review_content": "\nI LOVED this class. Professor Prescott was a very knowledgeable teacher. As a non-English major, I liked that she did not just analyze the text. For every work that we read, she gave us lots of background information and historical context, which I enjoyed. She liked to throw in little anecdotes that were usually applicable to the conversation but were sometimes a bit off-topic. Nonetheless, the stories were usually quite interesting. \nAs for the papers, she gave us numerous topic choices for each paper and then told us that we could always run other ideas by her. There were usually a few analytical choices and a few creative choices, so you could pick your strength (or weakness, if you wanted to improve your writing) for each essay. She gave ample feedback on each paper, and she was more than willing to clarify and help during her office hours. Like other reviewers have said, she is pretty loose with deadlines (and understanding if something major comes up), but she is usually pretty prompt about returning papers. \nIf you're interested in continuing Legacy into your second semester (or if you want to pick it up!), then I would highly recommend taking Prescott's class. You will enjoy it, and your writing will improve!\nWorkload:\nfour essays (no research-that's for FYE), doable reading. \n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "February 24, 2010",
            "review_content": "\nI know that everyone loves Professor Prescott, but I'm taking her class this semester and am having an entirely different sort of experience.  Professor Prescott clearly knows a lot, but unless you want to spend class hearing about all of the obscure poetry that she's memorized, and all of the background information that she's accumulated, then you'll find her class terribly boring.  We  have hardly talked about the text at all--but I do know something about Galileo now.  Completely irrelevant.  Also, if you're under the impression that this class is a seminar, you're incorrect.  She talks at you all class without asking for your opinions or input.\nAs far as papers go, she assigns a lot of them, and she gives you bad grades if she doesn't agree with your thesis.  Also, don't try to write a paper that analyzes the conflicts/tensions in a book that aren't explicitly mentioned in the text.  You're much better off writing a traditional \"content versus form\" paper, since it's the only thing she seems to appreciate.  \nI don't deny that she knows a great deal, but I find it very difficult to deal with her arrogant name-dropping, sweeping generalizations, and condescending attitude.  I just wanted to make sure that people on this site saw that some people have a different opinion, since I chose this seminar based on CULPA reviews and was sorely disappointed in the result.\nWorkload:\nPapers on every work we read.  Length varies, and deadlines tend to be loose.  \n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "May 07, 2007",
            "review_content": "\nProfessor Prescott is a brilliant woman. She is funny, personable and down-to-earth. She knows everything there is to know about the author and history behind each piece, adding extra depth and little anecdotes that can be entertaining. She critiqued my writing all semester, and as much as it was frustrating that my grades weren't stellar, her comments and suggestions have much improved my work. She's also really lenient about handing in papers on time. If you're a first-year, she's teaching Legacy, and you genuinely want to improve your writing, take her class, but don't expect A's. \nWorkload:\nOne book every two weeks or so. Moderate. Three analytical essays, one creative piece. \n"
        },
        {
            "course_name": "Renaissance Literature in Europe: Humor and Wit  Spring 2007",
            "review_date": "April 16, 2007",
            "review_content": "\nFirst the good things about this course: (1)The core readings of the course, including major writers like Rabelais, Donne and Shakespeare and going back to their sources in Ancient Rome, are fascinating and well selected. (2) Professor Prescott is very knowledgeable about everything to do with the Renaissance; she is also a very nice person who seems to genuinely care about her students. She also has a good sense of humor.\nNow the other side of the equation: (1) The class started out with about 40 students, most of whom attended for the first few weeks. However, gradually no more than 50% attended, and it was never the same 50%.Why? Probably because she turned out to be extremely boring. Her method of teaching: talk endlessly for the entire period, whether people were paying attention or not. Each session was a monologue (hers)about everything under the sun. (2)If you actually did all the readings, the amount of work became overbearing. Her lectures were tangential and only dealt with the major texts in a cursory way. You usually did not know ahead of time, what she was going to focus on. For example, we had a five hundred page anthology of the works of John Donne. What were we supposed to read for the next class? \"All of it,\" she said. She actually end up discussing about a half dozen of his poems, fifteen pages at best. I suspect that most students eventually gave up on the readings. (3) She was extremely disorganized and her schedule was constantly subject to change. It might have helped if she came to class with some notes to organize her thoughts. (4)Although she has a good sense of humor, her constant jokes eventually flat and became grating. (5) She assigned specific editions of books for us to purchase, but when she quoted from the texts, it was usually from some other edition she owned. That made it difficult to follow her. (6)She was absent about four times during the semester, usually to attend to other business. She never suggested she would make the classes up.\nI really hate to be negative about Professor Prescott because she is nice and caring. However, if she continues teaching at Barnard (she's about seventy and has been there forever), she needs to take stock of what she's doing and revamp her teaching.\nWorkload:\nThe books assigned were reasonable to read. However, she was forever adding material on Courseworks and that tipped the balance to excessive.\n"
        },
        {
            "course_name": "Renaissance Women Writers",
            "review_date": "April 11, 2006",
            "review_content": "\nI adore this women, she is so smart and interesting. I found her far more dynamic than the Prof who taught the other half of this class , even though I found that reading material more interesting. Her  lecturing style is very exciting, and desperately made me want to say the \"right\" thing. I am in love with her and given the chance I will take another class with her. The material is a little boring in my opinion, there are a few choice entertaining readings overall I found them to be dry. Oh, She is really a stickler for good grammar.\nWorkload:\nNot \"light\" but certainly not \"heavy\" is the best way I can describe it \n"
        },
        {
            "course_name": "Colloquium: Renassaince",
            "review_date": "October 31, 2005",
            "review_content": "\nProfessor Prescott has a great sense of humor, is friendly and knows what she's talking about when it comes to this time period. She's an expert! She's lenient about late papers, it seems. Still, make sure you read in this class. If you don't, you'll be kinda screwed for the papers and the major, super-hard final exam. She's yet another Barnard English department professor that doesn't facilitate discussion very well and her lectures tend to be a bit dry (so many people doodled in their notebooks in class). Still, again, she's intelligent in this area of study and is accessible.\nWorkload:\ntwo papers and a final exam .... STUDY!\n"
        },
        {
            "course_name": "The English Renaissance",
            "review_date": "June 04, 2005",
            "review_content": "\nPrescott is a funny professor. She may be the only person who can actually extract humor from Renaissance literature material. But I did fall asleep a lot of times in her class, and her final is hard and will take a full 3 hours (not exaggerating). She has quote identifications (identify author and text), one large essay, 2 mini essays, and 3 quote analyses on her final. She is a fair grader and helpful in her office hours. She also missed a lot of our classes due to illnesses or lectures she has to attend. Some say she's a true \"Barnard woman.\" She definitely knows her stuff and can lecture and quote from texts without them in front of her. Overall, an ok class, but I really felt that I didn't enjoy the class because it required a good understanding of renaissance history to better understand the texts. \nWorkload:\n2 papers and a final, no midterm. Reading to do each week. There were many people that didn't read, but beware of the final that will bite you in the ass if you don't read.\n"
        },
        {
            "course_name": "Fable and Fantasy",
            "review_date": "January 07, 2005",
            "review_content": "\nAlways interesting, often brilliant, sometime hilarious (\"pot has changed since when I was a kid...\" \"it's like Viagra, you know, you have to take the age of the subject into comparison\"). You should take any class you can with her, just because she makes everything interesting. She's actually TOO lenient about due dates, paper, subjects, students going off on tangents, etc., but she really cares about her classes, and it shows.\nWorkload:\nLots of reading, but only 2 papers, a midterm, and a \"final.\" Very, very light.\n"
        },
        {
            "course_name": "Fable and Fantasy",
            "review_date": "December 30, 2004",
            "review_content": "\nIf you can handle a flakey professor, Professor Prescott is great. Not especially organized, but almost always interesting. She doesn't take attendance, and you won't be missing anything vital if you skip class - but class is worth going to if you think the texts are interesting and if you want to talk about them. Go every once in awhile if only to find out when papers and \"exams\" are due (Prof. Prescott's syllabus can be excrutiatingly frustrating to follow). \nWorkload:\nTwo 5-page papers (one of which can be a work of fiction), one take-home midterm (written on three of the texts), one in-class final (written on three of the texts)\n"
        },
        {
            "course_name": "Fable and Fantasy",
            "review_date": "December 27, 2004",
            "review_content": "\nWhat praise can you say about this woman that hasn't already been said? She is like the totally awesome aunt you never had. She's older than she seems, but  is blessed with an unbridled spirit, wit, and intelligence.  Her tone is often sarcastic but never bitter, and she is quite possibly the smartest lady you'll ever meet. \nAnne Prescott: adore her!\nWorkload:\nMost amazing syllabus ever. Workload gets to be heavy around papers, but mostly manageable. Two 5pp papers (that's ALL, folks), and a short one-hour take-home midterm (she gives you the topic a week in advance), and a short, in-class, one-hour final (she also gives you the topic a week in advance). Easy-peasy.\n"
        },
        {
            "course_name": "Junior Colloquium (Renaissance) and 17th-Century Poetry",
            "review_date": "May 07, 2004",
            "review_content": "\n     I agree with the observations of the other student who reviewed Prof. Prescott's teaching of the Colloquium, but heartily disagree with her response to this brilliant woman's teaching.  Yes, she often forgets to bring things with her to class, but just as often she remembers to provide the class with extra tidbit materials and books from her own personal library. She is a veritable library of information not only about her specialties (16th century: incl. Spenser) but about the whole Renaissance, including historical information and great references. I liked Professor Prescott so much for her scholarship, genuine compassion for students, zeal for teaching, and wit, that I took her 17th-Century poetry class as well.\n     As for Prof. Prescott's bawdy comments and sexual innudendo, they are nothing but appropriate to the subject of Renaissance literature (if you are going to read Rabelais and Donne, you should be prepared for bawdiness and the subject of sex). I say \"right on\" to this professor of grandmotherly age's honesty about the content of Renaissance literature\n    The last thing I must say is that Prof. Prescott is one of the most caring teachers I have encountered at Barnard or Columbia. She cares genuinely about her students, is enthusiastic about their work (but knows how to criticize and ask provocative questions when marking your assignments), and despite anything going on in her personal life puts her teaching and her students first.       If you are ready and willing not to flaunt your ivy-league laurels but to lose yourself in the beautiful confusion of metaphysical poetry, Cavalier poetry, Rabelais, Spenser, Montaigne, Bacon, Milton, and countless others, take a class with Professor Prescott.  Yes, the lectures sometimes get boring, and yes she is not the most organized person; she is, however, a gem among teachers and is not to be missed for those with a love of literature.\nWorkload:\nA lot of reading, but relatively few written assignments: one timed takehome midterm, 2 papers, a very thorough final exam, but if you do all the reading and study hard you can do well on it.\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "January 06, 2004",
            "review_content": "\ni agree that prescott is extremely knowledgeable- she is certainly a scholar in the field of renaissance lit, but that does not mean that she is always able to organize herself-  prescott came to class each week having forgotten at least one thing- sometimes that was which book we were supposed to be covering.  i was also put off somewhat by prescott's CONSTANT sexual inneundo and bawdy jokes , especially coming from someone grandmother-age.  lastly, beware: although she gives few assignments, she can be a picky grader. \nWorkload:\ndefinitely pretty light: weekly readings, two essays about 5 pages each, one take home midterm, one final\n"
        },
        {
            "course_name": "Shakespeare I",
            "review_date": "March 28, 2003",
            "review_content": "\nProfessor Prescott is nice and this is a good class to take.  I'm not an english major and just wanted to learn a little shakespeare.  Her lectures are pretty relaxed and she can be quite funny.  You read about 1 play for every 2 classes.  I recommend keeping up with the reading(although I don't think most people did) and also reading a summary of each play, to make sure you pick up on everything.  The first lecture each week was background info, the second was talking about the play.\nWorkload:\nThere's a take-home midterm, which she's very strict about you adhereing to a time limit, however i don't think most students followed it.  A paper (8-10 pages, no research required). A final.Not an incredibly tough grader, but also no easy A.  The final is open book, but if you haven't read the plays you have no chance.  Also, she didn't turn in her grades until mid-January.\n"
        },
        {
            "course_name": "Renaissance--Figuring the Erotic",
            "review_date": "September 03, 2002",
            "review_content": "\nI feel a clarification is in order to the previous review. I found her brilliance inspiring and her leniency refreshing - term paper topic choices were vast. Her office hours were of tremendous help in developing my own term paper topic - on a text we didn't even read in class. Basically rattled off the best list of resources I've ever encountered, and offered to call a colleague who specialized in the topic I chose. Additionally, She offered students an option to do projects over papers - a great option if you feel more confident in a medium other than the written word. Further, she provided a list of suggested topics (but such a list comes with high expectations attatched), because it relates in depth to the courses reading material - BE CREATIVE ... it's worthwhile.\nWorkload:\nGrad students: Just a final paper. Undergrad: As above, but it is possible to do well with the \"timed\" take home exams, as long as you mentally prepare your approach to the questions in advance of sitting down to write your responses. Afterall, a TA's doing the grading (though mine was sent on for Professor to review)\n"
        },
        {
            "course_name": "Renaissance--Figuring the Erotic",
            "review_date": "May 12, 2002",
            "review_content": "\nI would really like to say that i enjoyed professor prescott's class. certainly, i enjoyed the lectures themselves. in the end, however, i found her to be that most insidious variety of professor. throughout the term she is very loose with lectures, due dates, and paper topics, teaches virtually nothing, then at the end of the year she slams you with a paper and exam that expect you to know VAST amounts about stuff she barely even mentioned EXISTED. i found that she offered no direction whatsoever when tackling extremely long and dense texts. Note to Prof: nobody knows what to do with the ENTIRETY of the Faerie Queene when you just drop it in their laps. all in all, do not study with her unless you already have a fair grounding in her area (british renaissance, and by that i mean Spenser--she even glosses over the Bard somewhat), or plan on doing all reading, attending all lectures, and filling in all background by yourself. \nWorkload:\n5-6 pg midterm, 10 pg term paper, 3 hour take-home exam (and we all know they expect much more than three hours out of those)\n"
        },
        {
            "course_name": "Renaissance--Figuring the Erotic",
            "review_date": "May 12, 2002",
            "review_content": "\nI would really like to say that i enjoyed professor prescott's class. certainly, i enjoyed the lectures themselves. in the end, however, i found her to be that most insidious variety of professor. throughout the term she is very loose with lectures, due dates, and paper topics, teaches virtually nothing, then at the end of the year she slams you with a paper and exam that expect you to know VAST amounts about stuff she barely even mentioned EXISTED. i found that she offered no direction whatsoever when tackling extremely long and dense texts. Note to Prof: nobody knows what to do with the ENTIRETY of the Faerie Queene when you just drop it in their laps. all in all, do not study with her unless you already have a fair grounding in her area (british renaissance, and by that i mean Spenser--she even glosses over the Bard somewhat), or plan on doing all reading, attending all lectures, and filling in all background by yourself. \nWorkload:\n5-6 pg midterm, 10 pg term paper, 3 hour take-home exam (and we all know they expect much more than three hours out of those)\n"
        }
    ]
}