{
    "prof_info": [
        {
            "prof_name": "Wadda Rios-Font",
            "prof_id": 2972,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Seminar",
            "review_date": "November 05, 2011",
            "review_content": "\nWadda is an amazing professor, and a departmental gem. Even though she does not usually teach many courses (or lower-level courses since she is co-chair with Prof. Mac Adam), she is a world-famous scholar in literature of crime fiction and has written extensively on the topic. And she is a big fan of Foucault of Bourdieu, for those out there who love the French contemporary sociologists.\nThe class is pretty intense, as we usually have to read a book/novel for each week (the class meets once a week), and we have to write a 20 page research article by the end of the class, but is very available and knowledgeable IF you seek out her assistance. Responsibilities are pretty standard for a senior research seminar -- presentation one day on a novel/reading that week, participation, the first draft of your article (7-9 pages long), and the final draft (20 page minimum, without bibliography). She clearly puts a lot of effort into developing her discussions, as she prepares key information about the works and critical questions to think about in relation to other texts read in the course, and by the end of seminar for the day is very explicit in her critique/understanding of the text.\nRecommended for current seniors/majors within the department. Keep up with your assignments, and learn a lot in return. \nWorkload:\nAs mentioned, standard for a senior seminar. \n1) Participation\n2) Class discussion\n3) Draft 1 of article\n4) Final draft\nJust do your work consistently!\n"
        },
        {
            "course_name": "Cultural Construction of Women in 19th Century Spain",
            "review_date": "May 16, 2010",
            "review_content": "\nProfessor Rios-Font knows how to create a laid-back classroom environment in which she doesn't pressure you to speak and she encourages questions. She has a lot of insight into the history of Spain and about each of the readings that you do. This class covers a lot of readings and novels and sometimes the amount of reading can be overwhelming. However, Wadda is very willing to go over things that were confusing in the reading. Because there were only 6 people in my class, it was important to do most if not all of the reading so that the class discussions could progress. It was very nice that we didn't have to write any papers throughout the semester. She is a very fair grader and is very approachable if you have a question about your grade. I recommend taking any class with her, as she is very nice, intelligent, and relaxed. \nWorkload:\nA lot of reading each night, 2 take-home exams (midterm & final)\n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "December 18, 2008",
            "review_content": "\nThis class was terrible. Professor Rios-Font was a very smart woman with a lot of interesting ideas but the class was dreadful. Our section's topic was \"Reading and Interpreting Narrative.\" This could have been an interesting class but we spent far more time reading literary theory texts, none of which were originally written in Spanish, than actual literature. The theoretical texts were exceptionally dense and dull, and no one really understood them. I really enjoyed the short stories, although many of them were difficult. We spent the whole semester reading different versions of little red riding hood, analyzing each author's portrayal of the text. My main problem with this class, though, is that conversational time and abilities were low. Our Spanish-speaking abilities were not good enough to discuss everything and so we didn't really talk. As a result, my spoken skills have depreciated a lot. Overall, I was really disappointed by this course and will not be taking Spanish anymore. \nWorkload:\nDifficult readings (theory and literature, about 30-50 pgs/week), 3 analytical papers (2-3 pgs each, with 2 graded drafts ea), final paper (8-10 pgs, one draft) \n"
        },
        {
            "course_name": "Cultural Construction of Women in 19th Century Spain",
            "review_date": "July 15, 2006",
            "review_content": "\nProfessor Rios-Font is a great addition to the Barnard Spanish department. I went into the class a little worried--it was the only literature class that fit into my schedule, and it didn't sound all that relevant to other things I was studying. It turned out to be a ton of fun, especially the first part of the semester, which involved reading historical documents (medical texts, legal texts, etc.)--it sounds dry, but it was really interesting and often hilarious, especially the medical commentary on women. \nThere ended up being only 5 people in the class, which also made me nervous at the beginning but was nice because everyone really had a voice in the class by the end. One problem with such a small course is that everyone had to do the reading, or else we ran into problems during the discussion. But Rios-Font never forced anyone to speak or anything like that, and it ended up being a great dynamic. I would certainly take another class with this professor.\nWorkload:\nA lot of reading for non-native speakers, but manageable, especially the first half. Lots of historical documents and 5 novels. A presentation on one of the novels. A take-home midterm and final (essay-format).\n"
        }
    ]
}