{
    "prof_info": [
        {
            "prof_name": "Farzaneh Hemmasi",
            "prof_id": 1889,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 05, 2009",
            "review_content": "\nUnlike many of the professors that are here simply to do research, Farzi is a naturally talented and fantastic teacher.  She was very articulate and enthusiastic, and watching her dance to the music each day made me chuckle. She's obviously a little constricted by the Music Hum curriculum, but is really good at teaching the later periods of western art music. I learned a lot and would highly recommend finding a way to have her as your music hum prof!\nWorkload:\nShort weekly assignments,  concert reports, midterm and final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 19, 2009",
            "review_content": "\nMany of my friends told me horror stories about Music Hum.  Awful professors, heavy workloads, bad grades, you get the picture.  That being said, I feel incredibly lucky to have had Farzi as a professor.  Thanks to her, Music Hum was one of the most enjoyable classes I have taken in my three years at Columbia.  She's interesting, knowledgeable, funny, and incredibly fair.  She spices things up with in-class performances and relevant videos, and she really wants everyone to learn and succeed.  Her passion for music is truly infectious.  Thank your lucky stars if you find yourself in her class!\nWorkload:\nVery, very fair.  Four or five one-page writing assignments about short pieces of music.  For the most parts, the assignments were interesting and help your understanding of the music/material.  Never felt like busy work.  Two 4-5 page concert reports.  Write clearly and address all questions asked and you'll be fine.  Midterm and final - if you don't do well on the midterm, she lets you count the final twice.  She also gives an ungraded diagnostic quiz before the midterm.  If you go to class and don't wait until the last minute to start studying, you will do well and really learn to appreciate music in the process.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 10, 2008",
            "review_content": "\nFarzi was an amazing Music Humanities professor.  She explained everything clearly and basically stuck to our textbook, which made it easy to understand what was going on for somebody who didn't know much about music history.  Class was rarely boring.  Mostly lecturing, but she gave us the opportunity to discuss the more exciting/controversial issues in music history.\nShe brought in live performers for three classes and played a lot of music in class, which made it easy to keep up (especially if you hadn't done the listening homework). It also made it easier to pay attention because there were frequent musical interludes.\nShe also gave us the opportunity to drop our midterm grade and count our (noncumulative) final twice.  Grading on the papers was fair.\nWorkload:\nWeekly reading and listening (but you go over it all in class anyway)\n2 concert reports - 1 classical, 1 not classical (3-5 pages)\n1 music analysis assignment - you are assigned a piece of music, you write about it in a very basic way (3-5 pages)\nMidterm, noncumulative final (listening exercises, short answer, essay)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 24, 2005",
            "review_content": "\nI thought that Farzi was a great music hum instructor. She was not boring, but very straight forward, which is a huge help when trying to descibe complicated terms. She is fair in her grading, and sends lots of tips and study sheets for the midterm and exam. There are no nasty surprises. She also brings in contemp music to compare to the composors we must listen to. This breaks up the bordum of Gregorian Chant or Wagner very well. \nThe class was as enjoyable as any class at 9am can be, and I actually walked away learning something, even if I am still tone deaf. \nWorkload:\none midterm, one exam, one concert report, one paper and the occasional listening/ reading responses.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 31, 2005",
            "review_content": "\nFarzi isn't a very good music hum teacher.  She always seems bored, she stands in front of the class and throws out random facts, and she's just generally uninspiring.  It seems obvious that she is forced to teach this class and resents it.  I believe she had a personal vendetta against me, so this may be why I had a negative experience, but she is just generally unpleasant.  I  don't recommend her.\nWorkload:\nbasic music hum workload.  She is VERY unflexible...don't ask for extensions or have any kind of schedule conflict with an exam.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 31, 2005",
            "review_content": "\nFarzi isn't a very good music hum teacher.  She always seems bored, she stands in front of the class and throws out random facts, and she's just generally uninspiring.  It seems obvious that she is forced to teach this class and resents it.  I believe she had a personal vendetta against me, so this may be why I had a negative experience, but she is just generally unpleasant.  I  don't recommend her.\nWorkload:\nbasic music hum workload.  She is VERY unflexible...don't ask for extensions or have any kind of schedule conflict with an exam.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 03, 2004",
            "review_content": "\nFarzi's class has definitely been my favorite thus far at Columbia.  I can't imagine a music hum professor who loves music more.  She played plenty of contemporary music and videos to keep things interesting.  We even had an electronic music day.  I don't have much of a musical background but I loved her class so much I've continued to take music classes as electives.  She makes it clear what you need to know for the test and offers plenty of help for paper writing.  Hers is definitely the class to take: she interesting, fun, and you can get away with doing minimal work.\nWorkload:\nReading are helpful but also skimmable.  I got the most out of actually going to class, even if I just sat there and listened.  Do the listenings at some point so you'll know them for the tests.  A concert report (5 pages, easy), a few reading responses (ungraded), a final paper (longer but also interesting b/c you get to choose the piece it's on), and a few midterms (predictable but some studying still necessary), and a final (easier than the midterms).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 23, 2003",
            "review_content": "\nMs. Hemmasi (or Farzi as she prefers to be called) is a phenomenal music hum instructor. She makes the class engaging and interesting (even at 9:00 in the morning!), and does not intend to trick you on her tests. If know the music she wants you to know even remotely, and you understand the basic concepts, this class should be a breeze. That is not to say you should not take it seriously. But if you do take it seriously, you will do well. And considering I believe I am tone-deaf, that is no small thing. Definitely the Music Hum you want to be in to fulfill the core. :)\nWorkload:\nReadings and listening exercises for each class (although she cancels the listening exercises for the second half of the course), 1 concert report (2-3 pages), 1 opera report (3-4 pages), and personal music paper (5-7pages) on any topic in music of your choice. While that may sound like a lot, it is very doable in this class.\n"
        }
    ]
}