{
    "prof_info": [
        {
            "prof_name": "Jaleh Mansoor",
            "prof_id": 1644,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Body and Abstraction",
            "review_date": "September 01, 2008",
            "review_content": "\nThis is an amazing class, the highlight of my semester. Very interesting, but some of the reading was extremely difficult and dense. Focuses mainly on the troupe of the female nude.\nWorkload:\nweekly postings on readings. one in class presentation on the weeks readings. term paper (12-15 pages)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2004",
            "review_content": "\nI took jaleh's class fall 2003, and it was remarkable and the highlight of my core experience thus far.  Jaleh is an amazing teacher, who runs the class in a socratic style, which is wonderful for keeping you awake in the dark classroom.  Work is really light, and the classes are always interesting.  Jaleh knows her s**t, and if you care to participate you will too.  \nWorkload:\n3 1-2 pg papers, mostly responses.  Light reading, she throws in one quiz just to make sure you're honest.  Midterm, and final.  Our final was take-home, which was awesome.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 20, 2003",
            "review_content": "\nThe \"character assassination\" that one reviewer attempted is totally wrong-headed and mean-spirited.  Jaleh is one of the most interesting graduate students I've had at Columbia; the fact that her method of teaching Art Hum involves a lot of contemporary criticism (and some resulting jargon, like \"desublimate,\" \"problematize\") simply makes the class better and more interesting to a contemporary audience.  Other teachers are likely to rehash old, dead arguments, and make the works seem, consequently, old and dead.  Though I'm not an art history major, the stuff I learned from her class gave me material for a senior thesis.  If I had time, I would gladly take another art history class.  The fact that the class completely expanded my understanding of the visual arts is enough for now.\nWorkload:\nLight.  Three 2-pg papers, midterm, final.  The midterm and final are really straightforward.  Almost no reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 14, 2003",
            "review_content": "\nI had Jaleh last spring, and I don't know who wandered into her class this year, but they've got everything ALL WRONG. Jaleh is superb. She wants you to understand the works inductively. Her Socratic method is the best way to come to raise important questions about the works because if people's points don't hold up, then the class cannot stack a discussion on top of them. She forces you to abondon preconceived notions and easy answers. While there may be the occasional lapse into \"bulls****\", this is not Jaleh's fault. People should not speak if they know they aren't making sense. Yes, there's a little jargon, but new-fangled verbs are in every humanities class at Columbia. In Jaleh's case, they don't detract from her points. She is extremely encouraging, and anyone who doesn't realize how perceptive she is or how much she cares about the material should trying staying awake when the lights go off.  Also \"synecdoche\" is a Greek word, and as is the case with many, everyone pronounces them differently. That is not indicative of her intelligence or ability to make the course great.\nWorkload:\nVery fair: 3 papers, midterm, and final. Her grading is also fair, as long as you follow her paradigm: don't make any sweeping conclusions about  \"meaning\" and \"society\" unless you can VISUALLY support them.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 20, 2003",
            "review_content": "\nI agree with both reviews. I went into this class full of enthusiasm and interest but she definitely put me off from taking any further art history class. \nWorkload:\nDecent\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 02, 2003",
            "review_content": "\nTerrible.  She's a moderator of random class discussion, not a teacher.  She shares absolutely nothing with the class.  She puts slides up on the projector screen and asks the class \"what do you make of this?\".  The rest of the class consists of your classmates talking out of their rectums, and Jaleh either responding \"that's great\" or shooting disdainful, condescending glares in the direction of the speaking student. She routinely uses big words that she doesn't know how to pronounce (synecdoche).  When my classmate called her on it, she said she must have pronounced it right because she looked it up in the dictionary before class.  One, that is a telling and pathetic response.  Second, I went back after class and looked it up, and indeed she mispronounced it. She also likes to transform adjectives into nouns to make herself sound sophisticated (verticality).  So pathetic.  I got so frustrated that I decided I would say something that made absolutely no sense and see how she would respond.  It didn't matter.   Tell her that the Parthenon's columns encourages your eyes to move vertically up the structure and she'll compliment your artistic intuition.  Try to come up with something intelligent to say and she'll  give you the \"you must be some kind of idiot\" look.  I remember this one long-winded kid who would always start  to make a point, change his mind in the middle and then say he wasn't sure what he was trying to say.   This was the most refreshing part of the course.  i was relieved that at least one kid owned up to not knowing what the hell he was talking about.  The rest of the class was spewing as much bulls**t as possible, in the hopes that Jaleh would like something they said.  AWFUL. \nWorkload:\nTwo papers, midterm and final.\ngrading of the papers reflects the worst kind of subjectivity.  There is no standard for grading as their is no corpus of knowledge gained from class.  Jaleh writes illegible comments and then gives you a grade based on how artfully you bulls**ted in the alloted space.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 20, 2003",
            "review_content": "\nI couldn't stand her at first.  She seemed like a snobby, overbearing instructor with a desire to destroy GPAs with a wink of the eye.  She teaches with a Socratic style that makes you want to scream \"Can we get to the point!\" But I realized your classmates contribute more to the overall learning exprience than she does.  That said, if your fellow students are asses, get ready to be annoyed.  \nIn the end, she is a very knowledgable instructor who really wants to get people away from the stereotypes of art history.  Though you will subjected to rather haphazard unstructured discussions at times, she teaches the class the way it was meant to be taught.\nWorkload:\n3 2-3pg. review papers, midterm, museum trip, final.\n"
        }
    ]
}