{
    "prof_info": [
        {
            "prof_name": "Aaron Ritzenberg",
            "prof_id": 11661,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "American Literature and Corporate Culture",
            "review_date": "January 16, 2015",
            "review_content": "\nI am in love with Professor Ritzenberg. It's really hard to pick favorite courses within the English department (for obvious reasons, to anyone who knows anything about the department), but this class is definitely one memory I will treasure and one of the better seminars I've taken. \n-- More about Prof. Ritzenberg: \nIn his emails before the course began he sounded very serious so I wasn't sure what the class would be like, but he is one of the most approachable profs I have ever had. He is easy to talk to in office hours, both about the coursework and other topics (eg career, etc.). To go along with this, class discussion is one of the most painless I've ever experienced -- we've all been there... Lit Hum classes where no one talks, English seminars where only one god-awful obnoxious kid talks... In our class, I think everyone felt that the environment was one in which it was easy to contribute, and I definitely heard every person in my class speak up at least a few times over the course of the semester, even the quietest (and I've definitely been in classes where I forgot certain people were even present because they literally never spoke.. I have also been this person before). \nHe is also super funny and quirky. He has a cute/awkward sense of humor that lightens the mood in class and contributes to the previously discussed open environment. Our class had lots of laughs. I never felt bored or sleepy in this course, and I feel sleepy in lots of classes I take, even ones I really love. \nProf. R is also great in office hours -- he was always willing to meet us outside of his regularly scheduled office hours, and he really helped me develop my ideas on the texts and think about what I was writing and how I was writing it. There aren't that many courses that really help one develop one's writing style (makes sense, as most lectures/seminars involve a series of 2-3 papers without revisions, some seminars just involve a final paper, etc.) but I really felt like Prof. R pushed us to be the best writers we could be. \n-- More on the course/grading:\nThe syllabus was pretty great. There were some texts I had never heard of and there were some I had read previously. Similarly, there were some texts I LOVED and some that I could barely get through. What was different about this course's syllabus (in my opinion) is that in a lot of other courses you can take in the English dept., especially those that are focused on older time periods (Renaissance, Victorian, etc.) or those that are not focused on a very specific topic (e.g. 19th Century European Literature) the entire syllabus can easily be stuff you've read before or at the very least heard of. This syllabus, I think in part b/c of the focused topic and spread out time period, had stuff that was completely unexpected. Just to give some examples, we read stuff like Bartleby, White Noise, Death of a Salesman, Glengarry Glen Ross, etc. Some weirder shit: Reminiscences of a Stock Operator, Day of the Locust. Like I said, I didn't love all of it, but I definitely learned a lot about -- you guessed it -- American Literature and Corporate Culture through all of the texts.\nProf. R did a great job of pairing the texts with secondary readings (theory, criticism, etc.). We spent quite a bit of time talking about some big topics like commodity fetishism which I am sure will come in handy later. Be warned, there is a ton of reading for the course and it gets overwhelming toward midterm & final seasons, but Prof. R was cognizant of that and cut the last book off our syllabus which definitely saved my ass. \nGrading was tough, but again, I think I really became a better writer and was thinking more about everything I was writing and whether or not my sentences and paragraphs made sense. Prof. R gave out a bunch of handouts for writing techniques before each paper just to get us thinking about different ways we could approach not only each paper topic but each sentence and paragraph within our papers. Super, super helpful. I also personally thought he was generous in final grades -- it's not often in English classes that the prof will round up. \n-- Things that would have made the class EVEN BETTER!: \nWe were almost always behind, which was a function of not enough class time (2h/wk, standard), a lot of reading we had due for each week's class, and going off topic. More focused discussion would have been helpful, but the flexibility of the discussion I think is partially what encouraged people to speak (-- even those who were behind on reading could contribute). Nearly every week there was a class presentation on the reading. These could often take a while and they weren't always super helpful, so I think to counter the running-out-of-class-time these presentations could be shorter and more focused. Additionally, we got better with it as the semester went on, I think, but not spending too much time getting sidetracked on other interesting but less relevant discussions.\nThe only other thing is that for the texts I didn't really understand, class discussion didn't always help me understand. Prof. R is great at helping clarify the secondary material, and we also had some fascinating discussions on the themes of each text. I understand many of the themes in the different texts and themes of corporate culture in American literature very well, so I would say the course fulfilled its goals 110% here. But, there were texts I still didn't completely understand, like Bartleby and Day of the Locust, so even just spending time discussing the actual point of these texts would have been helpful for me. Prof was good at addressing this in office hours, though.\n****************************************************************************************************\nTL DR: Take a class with Prof. Ritzenberg. He's fucking AWESOME.\n****************************************************************************************************\nAlso, a note to the ladies: he's very easy on the eyes. \nWorkload:\noral presentation, 10%\nweekly blog posts, 20% (annoying but actually kept me prepared for class each week, which I guess is the point)\nclose reading essay, 4-5p, 20%\nfinal essay due reading week, 50%\nlot of reading but fairly standard for seminar. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 27, 2012",
            "review_content": "\nI had Professor Ritzenberg in one of the new \"themed\" University Writing sections, and he is absolutely amazing. Our theme was \"Readings in American Studies\" and although we did stick to readings concerning American Studies, assignments were so broad-based that you could write about anything. Professor Ritzenberg was phenomenal, though. His lectures were always really interesting and the class, at times, felt like a philosophy lecture more than a writing seminar (but in the best way possible). He has a great way of making you think about the way your writing changes the world and really holds power. He meticulously read all drafts and papers and his notes/criticisms always seemed helpful. In his syllabus he explicitly states that \"the grade of A is reserved for papers he would nominate for departmental honors and writing prizes,\" so if an A was what you were hoping for you may be disappointed. He is a very tough grader, but your writing will only benefit from it. When possible takes this class seriously and do as much reading as you can. You can get by with doing barely any reading, but try to get through as much as possible. The max grade you can realistically get in his class is an A-, but it's definitely worth it. \nWorkload:\nLots of reading (more so than most U Writing sections I believe) and a lot of it is very dense, academic writing. You can get by with only reading what you plan to use in papers, but if you read it all carefully you'll find it's all gold for writing papers. \n4 papers (he makes you do all 4) graded fairly but an A is very difficult to obtain: \n15%, 20%, 35%, 20% (5% added to best paper)\n\nHe is also very meticulous with attendance and will mark you late if you are even a minute late. Make sure you keep track of your latenesses/absences!\n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 31, 2012",
            "review_content": "\nAMAZING teacher. He changed my writing completely. Probably the best UWriting Columbia has hired. Every seminar was worth going to, the readings were interesting, and he was very personal. You would come out of class with a deep train of thought -- his teaching can be philosophical and applicable to every day life. \nIf you put the work and energy in, you will see a pay off with your writing and with your grade. \nParticipation is also valued. \nWorkload:\n4 papers, each are a little longer than the last. 1 of them is a research paper (8-10 pages). Readings, little writing exercises,  weekly discussion. Sometimes you have to do peer editing. \n"
        }
    ]
}