{
    "prof_info": [
        {
            "prof_name": "Tonya Putnam",
            "prof_id": 3203,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "International Law",
            "review_date": "May 12, 2016",
            "review_content": "\nWorse than anything I have experienced in my four years at Columbia. \nStudents to Putnam are like taxes to ordinary people: highly annoying but must be dealt with. She is utterly incapable of delivering a coherent, let alone interesting lecture, and is downright rude in her comments. To this day I don't know if she is just socially awkward or nasty, but whatever it is, her approach to other human beings is unacceptable. \nI was coming into this thinking that while the reviews are negative, the subject matter is interesting enough to cover for it. Boy was I wrong. The material is only mildly interesting and her teaching methods are just painful. A typical class would be an unorganized Putnam delivering a messy lecture, followed by blank stares of those of us still awake. \nHer inability to publish anything useful on the matter should have perhaps informed the poli sci department to hire someone else, but unfortunately, they believed she is the best candidate. Go figure. \nAvoid Putnam at all costs.\nWorkload:\nNot that bad. But class is still horrible\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "March 10, 2014",
            "review_content": "\nI took this class, in my first semester and it was the first class I took in my major (political science). Overall, this is a very good class for an introduction to the discipline, especially as compared with other intro classes.\nProf. Putnam sets a theme for each class to cover (human rights, NGOs, etc...). You go to class, she puts up the slides, you listen and then she promptly puts the notes up on the course wiki (kind of a better version of Courseworks). The material is all very accessible and the textbook, that you must buy, is very clear, and efficiently didactic. There is an additional case studies textbook which offers applicable instances of the topic being studied for the week.\nProf. Putnam is very straightforward about her lectures. She goes through the concepts on the slides, adding additional information from her notes, and every here and there she calls on the class for answers. Though one may not think it important, I like that she has enthusiasm in her voice and changes her tone throughout the lecture; this kept me awake and into the class. I loved it when she talked about international institutions and governing bodies (such as the UN), I could tell her expertise is unmatched and that she enjoys teaching the subject. I also really liked that she wasn't snobbish or intimidating towards us newbies (as I'm sure she could have been as a Harvard law graduate and Ph.D. recipient in political science from Stanford). Prof. Putnam is easy to talk to and easy to approach, which was a nice contrast from my other poli sci course that semester.\nWhat prospective students need to know is that this is an intro class, not field work. I think Putnam understands that and keeps the set up of the class simple for that reason. We studied broad topics in IR and learned the basic theories that govern them. She did however have us play an IR game the second class which really was a terrific deviation from typical Columbia fare. The game built relationships between students in the class and set a tone of collective action for us students which manifested in multiple study groups and reviews.\nPutnam was also very kind about her office hours; she was willing to sit with me for the entire time (as long as no one else showed up) and work with me through the questions I had. \nThe sections were a necessary compliment to the lectures. Putnam had the TAs cover the case studies more deeply and additionally, each section was a review of the current week's lectures. My TA Kunaal was exceptionally attentive to our needs and would adapt the class to meet our biggest concerns. I had the feeling that Kunaal was working closely with Prof. Putnam to balance the class most effectively and he was dedicated to getting all of his students to grasp the concepts. He was easygoing but was skilled in managing the class and held our respect.\nOverall, this class is a great choice for Poli Sci beginners who are looking to get started in IR. It is a big class, that covers all of IR broadly and really gave me the feeling that I was learning something that I could apply. I found myself reciting the information and theories from the course throughout the semester outside of class. The reason I recommend this course so highly is that I came out of it with the confidence that political science is for me and that I can succeed in the pursuit of the subject.\n\nWorkload:\nThe work in the class is very fair but requires hard work. There is a midterm, a paper and a final. The two tests required an understanding of everything learned but did not require a micro attention to each topic. If you know the important points for each lecture, you will have no problem succeeding in the class. The grading was completely reasonable and Putnam curved the tests slightly, as needed.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "October 23, 2013",
            "review_content": "\nBad lecturer, boring class, she just reads her powerpoints that consist in the most basic international politics. You spend a lot of time talking about WW2, thanks but we all know Hitler and his buddies by now, isn't it enough already with this war...\nHad a good TA that would explain clearly what the professor was trying to explain. Hated going to the lectures. You could decide not to show up to any of the classes and do fine, provided you do the readings and go to the TA classes.\nNot recommended! \nWorkload:\nReading response essay, midterm, final + take home.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "March 05, 2011",
            "review_content": "\nTerrible class. Prof Putnam seems to know some of the facts, but she is very distracted and not very interesting. It is a boring lecture and she is constantly warning the students and has an assumption that everyone will or wants to cheat in some way! She does not present the facts or concepts in an interesting or inspiring manner and she simply conveys the feeling that she wants to get through it. The lecutures by the TA's were not very good, but they had her guidance, hence they could not be very good. Very disappointing and boring and I would never recommend this course with Prof Putnam to anyone.\n\nWorkload:\nworkload was fine.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 17, 2011",
            "review_content": "\nOverall this class was fine. Nothing great but also no horror stories. Lectures are accompanied by powerpoint slides that were easy to follow. Discussion sections were engaging and accompanied the work well. Her TA's all lectured once or twice, which was kind of annoying, but at the end of the day it was ok.\nOne issue I had was with the midterm. We had to complete 4 or 5 IDs and an essay. They didn't make it clear that the essay was worth as much as all the IDs combined, so if you spent a lot of time on the IDs you were screwed. Not a huge deal, just something to keep in mind.\nOh also, we were done with the final on December 14th and didn't get our grade until 3 weeks later, which I though took a little too long.\nWorkload:\nin class midterm, in class final (with a take home essay after), mandatory discussion sections, 2 3-4 page reading responses.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 18, 2010",
            "review_content": "\nI thought professor Putnam was fantastic. She could have been a little clearer about her expectations for the midterm, but her lectures were clear without being condescending. What I learned was great. She is brilliant and so can explain all the well established theories while maintaining a healthy level of skepticism and encouraging us to think hard. She taught from many different perspectives and did not limit the class to realism, liberalism, and constructivism. She hit all the big issues in an organized fashion starting with basic theory of war and deadly conflict, onto international political economy, and finished with some very thought provoking and well connected lectures on current issues in international politics such as terrorism and climate change. I can't imagine this class better taught, and her TA's are well guided and on top of what is going on. They lecture once each, and I didn't feel this took away from the experience. \nWorkload:\nNot too bad. Study hard for the midterm and final. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 14, 2010",
            "review_content": "\nNot as bad as people say she is. I came in expecting the worst due to other CULPA reviews, but either she's made improvements or the others just don't know what she's talking about. Her lectures are actually quite structured and follow concise Powerpoint slides; you can expect her to verbally elaborate on each point (so there is a point to taking notes). The lesson plan follows a clear and logical order. She even holds a class-wide 'coordination game' simulation at the beginning of the term which is fun and communicates the fundamental problem of international anarchy in an enjoyable way (plus you get to meet classmates! yay!). \nThe TAs seemed to be hit and miss. Mine was pretty terrible and didn't know anything - discussions were such a waste of time - but when my TA was absent one day another TA took over and that was much better. \nThe reading was definitely not overwhelming, and I thought the textbook and accompanying reader were quite nice. Again, everything followed a pretty logical structure and there was never a time I really felt 'lost'.\nOverall - not an amazing, life-changing course, but not a terrible one either. As far as intro courses go it's pretty benign and I would recommend Prof Putnam. \nThen again, my experiences may be different than most of my classmates'; I got a perfect score on the midterm and according to the distribution many people fared a lot worse. So I don't know. I didn't think it was that bad, but I can't speak for others.\nWorkload:\nNot too hard midterm (IDs, which are handed out beforehand, and an essay). Two 3-page response papers. Not-too-bad final (IDs, handed out beforehand, and a take-home final with a pretty straightforward topic asking you to summarize a concept in class).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 23, 2009",
            "review_content": "\nUGHHHH WHERE TO BEGIN?  Loathed the class, disliked her teaching style and dreaded lectures and discussion section.  I avoided lectures whenever possible and traded notes with others, which I would suggest.  She is not an engaging lecturer, and after taking several other poli sci courses with much more prominent professors this turned me off like none other.  Though she is nice if you go to her office hours and does explain things a little better, she didn't respond to any of my emails, which is a little irritating.  The assignments are very vague which makes them more difficult than necessary.  She's very into page restrictions so be careful of your paper lengths.  Overall not a Putnam fan, though I think few are... \nWorkload:\nTwo short response papers (<5 pages), attendance in discussion section, a midterm and a final.  The final sucks only because it is part in class IDs and part take home essay.  The take home essay is annoying because after the IDs you just want to be done but Tonya pulls you back in for one last battering.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 18, 2009",
            "review_content": "\nI came into the class (fall 09) hesitant because of her unflattering CULPA reviews, but I ended up decently satisfied. \nIt is certainly true that she squashes a lot into her powerpoints (an improvement since last time she didn't use them) which leads to a fast pace and a feeling of disorganization (though she presents a roadmap in the beginning) you have to keep up (bring a laptop; i stopped trying to hand-write my notes). Nevertheless, just type and think fast; there were multiple times in which she didn't elaborate on something because she was flying through points, so I just went to her after class to talk to her about it and she explained it well. My TA at least was as clueless as I was on what she is referring to in her lectures, so I'd recommend going straight to her.\nShe didn't address the readings too much (I guess b/c we're supposed to read them), but she did sometimes summariz them. She also analyzed and critiqued them at times and brought in more new material. She also still does have a flighty, disconnected way of speaking that can lead to a bit of frustration and multiple space-outs. Maybe it's nervousness... who knows. This just requires more concentration in note-taking. \nThe amount of readings was fair and they were all very interesting for me; that said, I'm most likely a political science major (currently a soph), but this class did confirm it for me. She adapted the class to current topics; this fall she replaced terrorism with climate change. I think if you like the topics, you'll like the topics, irregardless of the professor - and she really isn't too bad.\nI like her emphasis on current events in her midterm and final; we had to analyze and make policy recommendations on certain current events. The previous reviewer said the grading, especially on the midterm, was harsh. I can see why. To get an A, you had to go a little bit above and beyond in answering the questions; BS-ing will not get you far. To go a little bit above and beyond really just requires a very solid, conceptual understanding of the big picture (IR theory, etc) and how each ID term or topic fits into the different theories floating around and what those theories are. Once that clicks, the midterm and final is pretty easy (I received an A on the midterm). The grading criteria, though, could've been more clearly communicated.\nWorkload:\n40 pages a week. Two 4 page response papers that were only factored in if you were borderline. Midterm (half IDs, one essay). Take home final (4 days to work on it). \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 28, 2009",
            "review_content": "\nOkay. This was a terrible class. Putnam is a rambling and confusing lecturer, who works with an incredible amount of powerpoint slides. Readings and their corresponding lectures don't always work well together, and the class moves at an incredible pace. The overall grading is very hard. Shop around for TAs, because they're going to have to answer a LOT of your questions and some of them are just as clueless as you are.\nHomework: hefty reading every week, two reading response papers per semester, which you sign up for in advance.\nMidterm: Putnam distributed a list of 20 or so ID terms, which you could memorize and define prior to the exam. From that list, four were included on the test, and you had to define three. Harshly graded. The midterm also included an essay which centered around a topic you had not studied, but had to apply concepts you'd learned to. Very difficult.\nFinal: WE WILL SEE!!! Will include an ID portion administered in class and a take-home essay.\nWorkload:\nSee above.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 29, 2008",
            "review_content": "\nPlease do not take this class if 1) you don't already have a good background in political science and 2) you don't want to be subjected to rambling lectures, awkward moments of silence, and arbitrary grading. This is not an intro-level course in any aspect, from the excruciating amounts of reading assigned to the lecture itself, which basically just consists of Putnam regurgitating everything that the passages that she had us read contained. There's barely any explication of the terms or concepts, making it extremely difficult to apply them in any way whatsoever to major world events. The grading was confusing as well: one TA would be especially generous with the points, while the other would find things wrong in every other sentence. I don't know about Jervis or any of the other Intro to IR classes but if you want to actually learn something instead of going on Facebook every five minutes, do not take this class. \nWorkload:\nTwo take home midterms (both 6-7 pages, which she strictly adheres to and takes off points for going over), one in-class final (IDs and essay)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 02, 2007",
            "review_content": "\nI wish I had enough time to write a very clear and informative review, but here's what I can say: Prof. Putnam is the classic example of Columbia hiring fantastic scholars with no teaching experience and having them teach large intro classes in which they speak in such high-level terms and engage only with the students who shouldn't be in an intro course. By the end of the course, I had gone to the TA several times with questions and problems, and simply found that I didn't know how to approach the questions the class was asking because I hadn't grasped the concepts well enough in lecture, as the readings overflowed with heavy terminology and facts that she just reiterated and didn't know how to help us dig into on a basic level. I got a B- after working my butt off because I never got the basics or how to integrate them into the history we discussed. the TA attempted to help but i never really got the essentials to work with from lecture, and the one time i visited Putnam, she was so frazzled and busy that she had no time to talk.\n\nWorkload:\ntake-home midterm, in-class final on basic ideas. lots of reading. i did badly on both the assignments and never grasped what i wanted to from the highly complex readings.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "July 11, 2007",
            "review_content": "\nIn Spring 07, Professor Putnam and Professor Jack Snyder co-taught Intro to Human Rights.  Snyder generally provided the \"Realist\" persepctive on the material we covered; Putnam generally provided the \"Constructivist\" or \"Liberal\" perspective.  The material was, for the most part (i.e. 80% or more), very interesting to me as a Human Rights concentrator, but others (Human Rights concentrators and those for whom Intro to HR was their first course that dealt extensively with HR alike) might disagree.  \nIn any case, Professor Putnam was a delight to speak after class and during office hours; she is very intelligent, approachable, and friendly.  With respect to her past publications, intellectual capability, and educational experience (JD and PhD from some pretty stellar institutions), she is a gold-nugget pick for the Political Science Department.  \nThat being said, her lectures were on one hand interesting but on the other extraordinarily disappointing.  The material was fascinating; the questions she raised and attempted to answer were cogent and her answers thereto were well-reasoned and often attempted to cover diverse persepctives on/apply contrasting theories to each issue; in other words, her treatment of the material was thorough, thoughtful, and often enlightening.  \nHowever, her presentation of the material was not so hot.  Professor Putnam was always inclined, with the best of  intentions, to stuff as much material as possible into one lecture. To cover the material as thoroughly and fairly as possible, Professor Putnam raced through the lectures as if each one was a standardized test.  The results: she rarely presented very interesting and sometimes complex material as clearly as necessary (especially for an Intro class), and she sometimes got lost amid her overstuffed-like-your-milano salad lectures \nIt would be unfair to attribute this entirely to Professor Putnam - Intro to Human Rights, like all Intros, seek to cover a vast amount of information in a short period of time.  My tendency in the situation would be to cover all that I could cover, i.e. to do what Professor Putnam did.  But she and her future students in Intro to HR would benefit from scaling back the amount of material covered in each lecture or in the course as a whole.  Additionally, Professor Putnam would benefit from slowing down her lecturing speed and making more eye contact with the students (i.e. less reading from her lecture notes).  \nThis should stand as a disclaimer, not a scare tactic to frighten you away from taking classes with Professor Putnam.  For those interested in International Law, Human Rights, International Institutions, and Rule of Law, Professor Putnam is a critical addition to the Poli Sci faculty.  If she is given permission to/decides to hang around these parts, Professor Putnam will certainly be offering some very fascinating classes in the future.  \nAs of now, her lecturing abilities could use a lot of work, but I am confident that over time, if she wants to, Professor Putnam can become a much better and more appealing lecturer.  With lecuturing experience (and the learning and confidence (a boost of which is super necessary in Professor Putnam case) that comes along with it), Professor Putnam has the potential to inspire many to study and get involved in Human Rights.   \nWorkload:\nTake Home Midterm: 2 questions (one of which everyone was required to answer; for the second, three choices), respond with 2 five page (max) essays\n12-15 page Research Paper: Poli-Sci type; open-ended.  Pick a question/puzzle and answer it.  Tip: don't wait till the last minute if you pick a topic that seems to have very little prior scholarship.  Meet with your T.A. (or any of them; all three I met with were helpful, especially those who were knowledgeable on the subject of my paper) to discuss how to refine your research proposal, if desired.\nIn-class Final: 2 essays (you have some choice), very broad.  Emphasis on the second half of the semester.  \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "July 01, 2007",
            "review_content": "\nI thought she was a brilliant woman who was completely incapable of expressing herself coherently.  The class jumps around and moves much faster than other intro classes.  If you have had a lot of poli. sci. in the past then you should be fine, otherwise I would suggest going another route.\nWorkload:\nA lot of reading. Unbearable amounts in fact. \n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "June 25, 2007",
            "review_content": "\nvery smart but exceedingly boring lecturer\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "May 27, 2007",
            "review_content": "\nThe lectures in this class were split by Tonya and Jack Snyder.  Tonya clearly had trouble lecturing which made for terrible lectures and made you enjoy the days when she wouldnt lead the class.  Although she seemed uncomfortable away from her notes, studders, and sometimes slipped up and gave wrong information, she's a nice and smart woman.   \nWorkload:\npartic. in disc. sessions, a bunch of reading, 15 page research assignment due at end of year, take-home midterm (two 5 page essays), and a final (broad).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 11, 2007",
            "review_content": "\nBrilliant woman, aweful lecturer.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 10, 2007",
            "review_content": "\nI thought, before I took Putnam's class, I would really enjoy International Relations. Unfortunately, she was a complete let-down. She lacked a concise format and she rarely had a good answer to any of her students questions. The class seemed like it thrown together hastily and her rambling became rather annoying. If you are going to take I.R., definitely avoid Putnam.\nWorkload:\n2 take-home midterms, in-class final. The first midterm is two (separate) essays each about 6 pages in length. The second midterm is one essay about 10 pages in length. \nComprehensive Final (8 I.D. questions and 1 essay).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 30, 2007",
            "review_content": "\nTonya Putnam is amazing as a person, but her teaching could use some help. Her resume could choke a horse and she obviously has a lot of knowledge and experience in the area of international politics, but she doesn't have much of a presence in front of the class. She responds really well to questions but has a tendency to seem scatter-brained while lecturing. However, if you talk to her outside of class, you will learn tons. \nReadings for the class were reasonable and interesting, grading was on par with most other political science courses, and discussion sections were not required. \nWorkload:\nTwo take-home midterms and a final.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 28, 2007",
            "review_content": "\nIn a word: frustrating. She's obviously very smart ? she has a JD from Harvard and a PhD from Stanford and has done a bunch of interesting research. But this does not make her a good lecturer. I found her to be very unorganized, and her lectures scattered. She talked quickly, and it was hard to take down what she was saying and know what the important points of her lecture were (there were no powerpoints). Many times I felt like it was pointless to go to class because I knew I wouldn't take many notes since she was hard to follow, and the time would probably be better spent reading the zillions of articles. \nIf she had given us some sort of outline before her lectures, or highlighted the important points, I probably would have gotten more out of what she was saying. \nFortunately, she co-taught this class with Jack Snyder, who was much easier to follow and seemed to know his stuff a bit more (understandably so, because he's been in the polysci world much longer). But if she had been the only professor, I don't think I would have made it through the semester. Good class material-wise, but I would definitely not take another one with her.\nWorkload:\nHeavy. I'm taking this course as a freshman, so maybe I'm just not used to the volume of the readings, but there are many many pages per night. On a whole, the material is interesting (especially in the second half of the semester when the focus is more on specific aspects of human rights as opposed to theory) but be prepared to read a lot. \nIt's also helpful to go to class having done the readings, which is ideal but often unrealistic, depending on your other courses. Take-home midterm, 15 page research paper with a prospectus (requires some research) due about 2 months before the paper is due. Final, which I haven't taken yet, so we'll see...\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 28, 2007",
            "review_content": "\nIn a word: frustrating. She's obviously very smart ? she has a JD from Harvard and a PhD from Stanford and has done a bunch of interesting research. But this does not make her a good lecturer. I found her to be very unorganized, and her lectures scattered. She talked quickly, and it was hard to take down what she was saying and know what the important points of her lecture were (there were no powerpoints). Many times I felt like it was pointless to go to class because I knew I wouldn't take many notes since she was hard to follow, and the time would probably be better spent reading the zillions of articles. \nIf she had given us some sort of outline before her lectures, or highlighted the important points, I probably would have gotten more out of what she was saying. \nFortunately, she co-taught this class with Jack Snyder, who was much easier to follow and seemed to know his stuff a bit more (understandably so, because he's been in the polysci world much longer). But if she had been the only professor, I don't think I would have made it through the semester. Good class material-wise, but I would definitely not take another one with her.\nWorkload:\nHeavy. I'm taking this course as a freshman, so maybe I'm just not used to the volume of the readings, but there are many many pages per night. On a whole, the material is interesting (especially in the second half of the semester when the focus is more on specific aspects of human rights as opposed to theory) but be prepared to read a lot. \nIt's also helpful to go to class having done the readings, which is ideal but often unrealistic, depending on your other courses. Take-home midterm, 15 page research paper with a prospectus (requires some research) due about 2 months before the paper is due. Final, which I haven't taken yet, so we'll see...\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 18, 2007",
            "review_content": "\nUgh. I genuinely feel bad for writing a bad review, because Professor Putnam seems to be a smart, well-educated and nice person. However, she is the worst lecturer I have ever encountered. Her lectures are totally unorganized and she cannot even get coherent thoughts across most of the time. \nShe often loses her place and every other word is \"ummm...\" or \"ok....\". This class had such potential, but it was often painful to come to class and the workload was INSANE for an intro class. If you want your life to be ruined by the crazy expectations and amounts of reading, by all means take this class.\nWorkload:\nTotally unreasonable. Tons of readings for every class (all of which you are responsible for printing), crazy 10 take home midterm (graded harshly), 15 page research paper, 3 hour midterm.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 16, 2007",
            "review_content": "\nShe has amazing credentials, and the syllabus is amazing, but I think she'll be good in a couple years.  She's a new professor hasn't quite perfected the art of lecturing yet.  She often speeds through difficult concepts in a way that students don't even know enough in order to ask questions.\nWorkload:\nTons of reading, but you don't have to do all of it.  Two take home exams (basically a 10 page paper that you only have a week to do and can't discuss with others).  In class final.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 08, 2007",
            "review_content": "\nLet me begin by saying Professor Putnam is very smart and clearly knows her field.  She has experience as well as the academics and she speaks a bunch of languages.  From the lectures, you can tell that she has a vast knowledge of IR and Human Rights because she can always respond to the question and cite sources for further information.  The reading material is varied and interesting.  The only downfall is that Professor Putnam's lecture style is really difficult to follow.  She jumbles points and it can be difficult to tell what the main points actually are.  This is her first semester as a professor so maybe she'll adapt her lectures after feedback and the class will be a lot better next semester?  If you're interested in this class, I'd recommend going in the first week and if you can follow what she says then take it.  \nWorkload:\nInteresting, thought-provoking readings and a lot is them.  Discussion sections were dull and didn't help clarify the lectures which is a shame cos the lectures definitely need clarifying.  Hard midterm that the TAs and professor admit to grading harshly...only one A out of a 200+ class.  15 page research paper and final.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 03, 2007",
            "review_content": "\nProfessor Putnam's lectures are so unorganized that her information does not bridge the spatial gap between her lips and the students' ears. Please do not judge Poli-Sci based on this class. A fundamental characteristic of Political Science is that it is an organized and structured method of making sense of world events, and Professor Putnam's ramblings do not do the field justice. Her heart is good but for God's Sake please learn how to write an outline! How can one justify demanding organized and well-written essays from her students' when the very lectures that she provides fail in this very task? \n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 03, 2007",
            "review_content": "\nAt the beginning of the semester Intro to Human Rights was THE class I was looking forward to...It promised so much and, so far, delivered so very little.  Professor Putnam is an extremely intelligent woman (check her resume) and comes across as a nice person in lectures and during office hours BUT her teaching style is impossible to follow.  The lectures don't seem to have any structure, she uses a lot of unnecessary vocabulary so it can be difficult to deduce what her main points are amongst all the fluff.  The readings are really interesting but there are a lot of them and the lectures do not complement the huge amount of reading material. The discussion sections are led by nice TAs who seem to care but discussion is stunted by the fact that nobody fully understands the lecture and what the class is meant to learn from the course.  There aren't any inspiring, fiery debates which I would expect from a human rights class.  the midterm was tough and Putman said they graded it harshly so that we would work harder.  In reality, the lousey marks that most people got, just demoralized the class and the lecture hall is now emptier than ever.  Overall, this class has been my biggest disappointment at Columbia and I wouldn't recommend taking it for another couple of semesters as Professor Putnam refines her teaching style and develops the course.  This class and the professor have the potential to be amazing and informative but that hasn't happened yet.\nWorkload:\nLots of readings that are varied, contemporary and interesting BUT its difficult to know what the main points we are meant to get from them.  Same for the lectures.  Midterm which most people got B- or B.  My TA said of all the papers she marked nobody got an A.  Research paper that, again has the potential to be interesting but  people are finding it tricky to select a narrow enough topic, and the material that would've helped the class do this is being covered now, way after our research proposals were due.  Dread to think what the final has in store for us.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "March 29, 2007",
            "review_content": "\nTonya is a first year professor and it definately showed in some of her first lectures. She basically summarized all the readings and then presented them in a nervous, not all too organized fashion. Taking advantage of her inexperience and \"niceness\", a lot of  overly opinionated, self important people in the class felt it necessary to interrrupt her at every turn and interject some useless, and most of the time irrelevant comment. That definately took a lot away from the class. However, she did improved during the second half of the semester. Prof. Putnam gained more control of the class and her lectures were much more organized. Overall she's a very intelligent, energetic, and caring person, with a lot of interesting experiences in the field. I haven't stopped by her office hours yet, but I definately plan to during the semester to pick the mind of one of Columbia's most promising, young political professors. \nWorkload:\nTwo take home midterms and one in class final. The midterms were pretty reasonable compared to  CU's poli sci class standards (do the readings and put a good effort and you'll get an A). Haven't taken the final yet, so I can't comment on it. Our class was suppose to have a mandatory discussion section but it was changed to optional bc the time slots ended up being inflexible for some students. \n"
        }
    ]
}