{
    "prof_info": [
        {
            "prof_name": "James Basker",
            "prof_id": 2000,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "The Age of Johnson",
            "review_date": "April 18, 2013",
            "review_content": "\nAbsolutely brilliant man.  So intelligent and his assignments are designed to test creative boundaries; he does not assign yet more dry, expository essays. He is incredibly enthusiastic, invested in his students, and kindhearted.  Should unquestionably have a gold nugget.  He facilitates discussion well, is a dynamic lecturer, and gets so excited about everything that has to do with Samuel Johnson and the men and women who surround him.  I learned more from this class and remember more than any other simply because of Basker's attention to important, relevant material and engaging class discussion.  TAKE HIM, you won't be sorry!!\nWorkload:\n You do not need to read everything to do well in his course, technically one novel a week (sparknotes/plot summaries are adequate substitutes),  2 creative assignments, 2 quiz IDs, medium difficulty, and one take home final (so easy)\n"
        },
        {
            "course_name": "The Age of Johnson",
            "review_date": "November 28, 2012",
            "review_content": "\nThis truly is a great course. Upon first look, it may seem that 18th century literature would be a dry subject and perhaps it would be with a different professor, but with Professor Basker, who is impassioned and excited about this subject, the class is anything but dry. He is obviously very well-learned on this subject and it is obvious that he loves what he is teaching. He is very approachable and even requires that you meet with him at least once during the semester. I would definitely recommend this course, and probably any other course taught by him. \nWorkload:\nA lot of reading but there are only two quizzes (ID) and a few short writing assignments. The \"final\" are a few short take home essays that are due during the reading period so the stress during finals week is put to a minimum and he circulates the questions beforehand so you can prepare yourself readily. \n"
        },
        {
            "course_name": "The Age of Johnson",
            "review_date": "January 21, 2009",
            "review_content": "\nProfessor Basker is one of the nicest professors I have encountered. Like other reviewers have mentioned, his passion for and knowledge of the Age of Johnson are obvious, and he wants every student to share his enthusiasm. In terms of the readings, I thought Basker did a nice job dividing the syllabus between Johnson/Boswell and other writings of the time.\nBut, because they're from the 18th century, the readings could be convoluted and boring--I rarely felt like I understood them much on my own, which is why I was glad that Basker was there to illuminate the important and interesting ideas within. If anything, I wish he had framed the class as more of a lecture rather than trying to get the class to interact. Even if people did the reading, it seemed I was not alone in my troubles with interpretation. All in all, though, a pretty painless way to fulfill the English major pre-1900 requirement. \nWorkload:\nNot bad. Tons of reading most weeks, but it does not have to be done fully, if at all. Four short assignments graded on a check, check plus/minus scale, midterm of IDs only, optional paper that can only help your grade, take home final of short essays.\n"
        },
        {
            "course_name": "18th Century Literature",
            "review_date": "November 10, 2006",
            "review_content": "\nJames Basker obviously loves 18th century literature. His sincere excitement is addictive. He's brilliant, but also very approachable. He was a Rhodes scholar back in the day, and is still working in some capacity for Oxford, I think. Be ready to speak up in class-- discussion isn't always a big part of the lesson, but he'll be disappointed and you'll feel guilty if he does ask for impressions or questions and everyone stares at their desks. This is a teacher you'll want to make happy. \nWorkload:\nFor undergrads, one optional paper and ID and essay midterm and final, plus little assignments like finding a poem by a woman author that you enjoy. \n"
        },
        {
            "course_name": "Junior Colloquium: The Enlightenment",
            "review_date": "March 02, 2004",
            "review_content": "\nWhat I really enjoyed about Professor Basker's class was that he was genuinely enthusiastic about everything he taught. Though I must admit, 17th and 18th century literature is not quite my choice area of study (frankly, I find it rather dull), just listening to him lecture about it made me want to enjoy what I'd read, or maybe wish I could've enjoyed reading it more (since usually about 90% of the reading went over my head). Professor Basker really succeeded in exposing why these works are so great and why they should be and have continued to be read -- and I guess I can't ask for much more than that from a compulsory major requirement I really wasn't that keen on taking to begin with.\nWorkload:\nNot your typical English class -- NO PAPERS. (He reasons they're just a distraction and take away from the time you could be spending reading.) Two short midterms -- all ID's. A final, all essays (which seems more daunting than it is, only because you haven't written anything for him all semester). And weekly (very short) homework assignments (\"write a parody of such and such poem\" or \"find five examples of [certain literary device] in this work\") to go along with some 200-400 pages of (dense difficult) reading per week -- that sometimes seems so unwieldy I get the sense he doesn't generally expect most of the class to finish all the way through.\n"
        }
    ]
}