{
    "prof_info": [
        {
            "prof_name": "Ezer Kang",
            "prof_id": 5968,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 16, 2010",
            "review_content": "\nWhere do i begin? Professor Kang was my absolute favorite teacher this semester. He is an absolutely wonderful person. His class is very engaging, the material is fascinating, everything is just really enjoyable. A previous review mentioned that he did not have control over the class, and i did not see how this was applicable at all. Professor Kang knows exactly how to deal with his intro to psych class-- a group of mostly Barnard Freshmen all waiting to start their weekend in the last class (5:40-6:50pm TR) of the day... And not a single student was ever antsy or wanted to bust out early. \nThis is a lecture class with about 30-38 people. Professor Kang uses slides that discuss what the text book covers. Technically, i suppose you could just read the textbook and never attend class, but i can't see why you would want to. The slides are pretty entertaining. He puts in videos of his daughters (one was born the first week of class, the other is about 3 years old) as examples at times, and he covers case studies never mentioned in the textbook. He engages the class with his examples and keeps inside jokes running throughout the semester. \nWe used Psychology by Schacter the 2009 edition, and I know we'll be the last class to do so because today he mentioned that the newest edition was just released. He is still debating if he will continue with Schacter, but let me just say that if he does, use the included website!! I didn't think about this until just before the final exam, but the book includes a website with practice quizzes, chapter outlines, flash cards. i'm pretty upset that i never realized it before. \nAs for Intro to Psych, it's a great class. It's just nice enough to pique your interests in psychology without overwhelming you. i would really love to take another psych course but, as i told Professor Kang numerous times, i'd probably only sign up for one if he teaches it (and he only teaches intro to psych). \nWorkload:\nOne chapter a week, each chapter about 40 pages. 2 midterms and the final, each worth 20%. One final research paper worth 30%. The research paper is very intense, and i would most definitely submit it early when he offers to critique and edit it. at the very least, this discourages procrastination :) \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 23, 2009",
            "review_content": "\nProfessor Kang is a great guy, but his class was a bit of a bore. Lots of time is wasted with pointless discussion, and many people ramble on. Nevertheless, the material is easy and all the tests are non-cumulative, including the final, so it's very doable. In addition, there is one final paper where you basically make up a psychological study and present it--not a hard assignment. If you want a psych primer, an easy A, or just need to fill up some credits, go for it! BE WARNED, however: all intro to psych students are required to participate in 5 hours of psychological studies conducted by other students; this is MANDATORY. You pick the time, but you need to get those hours in. Other than the hours, I don't regret taking this class.\nWorkload:\nTwo tests and one final, all non-cumulative, and one final paper. One or two chapters to read per week, about 4 chapters per test. The text we used (Schacter) is mildly entertaining and pretty self-explanatory.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 08, 2009",
            "review_content": "\nProfessor Kang is a new, eager professor that graced my presence after I got rejected from Stokes class...he isn't full time but he sure does put a lot of effort into his lectures. The intro class was relatively small (28?), as our class time was at 5:40. He took advantage of our size and encouraged us to engage in discussions every day -- which has its goods and bads. For one thing, he rarely finishes his lectures because of his inability to shut the mindless students who ramble nonsense words for 5 minutes..but that cannot be entirely based on him. All in all, I rarely found myself bored in his class. He is clearly very interested in the material he's discussing, and always tries to incorporate recent events into the material we were learning (elections, etc). Kudos to him for packing so much info into a psych 101 course on his first try.\nAnother thing, unless he changes the textbook (and I hope for your sake he changes it)...the textbook talks to you like a 15 year old. It has pictures of random girls looking at pamphlets about anorexia or pictures of oranges on every page....a survey you can take about \"how you handle stress\"..i mean come on. Something a bit more academic. But most of the tests were based on lectures, with some denser subjects (Neuroscience/Brain structure) that you have to take from the text. The text itself is not all too boring and not at all dense (repeat: hs textbook), not painful.\nWorkload:\nDecent- 3-4 chapters (~40 pages each) for each test. 3 tests all noncumulative, 1 final paper. Part of your grade is based on participation (aka attending class...being awake). \n"
        }
    ]
}