{
    "prof_info": [
        {
            "prof_name": "Alexander Drewitz",
            "prof_id": 11931,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Discrete Time Models in Finance",
            "review_date": "May 16, 2014",
            "review_content": "\nI have a lot of mixed reviews for this course.  I also happened to take the class the first semester that Drewitz taught it.  Also I'm a math-stats major if that matters - no econ background.\nPro:  I really like the book that we used.  It wasn't a hardcover textbook, it was like a small, 6 chapter book.  I thought that the chapters were really well organized, introduced topics clearly, and the author put in some really great examples.  The author proved all of the theorems and numbered them.  [If you're interested: Shreve: Stochastic Calculus for Finance I].  Lecture was pretty much going over the concepts in class and going through examples. \nCon: Coming from a math-stats background, I was expecting more equations/less words in the class.  There were a lot of words and concepts to understand - we even had definition regurgitation on the exams.  During like the first month of class, I had trouble getting a grasp of everything, but reading through the book really helps.  I also absolutely hated his exams - there were a lot of things we haven't seen before and a lot of proofs.\nWorkload:\n2 midterms, 1 final.  10 psets (1 per week, from the book, many answers can be found online).  \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 14, 2013",
            "review_content": "\nProfessor Drewitz is a visiting professor from Germany.  His teaching two introductory Calculus Classes is simply part of the requirement for his fellowship.   Despite this, he speaks impeccable English and actually tries to be a good teacher.  That said, he does not necessarily succeed at the latter.  He refuses to spoon feed and prefers proofs, but in doing so the content of the course is obscured.  That said, if you take good lecture notes and study them for two hours or so after each lecture, you should understand things.   \nThis class and its curve are messed up by the large number of students who took BC calculus in High School and know everything already, and the fact that it is required for all SEAS students.  If you're in CC, you probably just need to take Calc III.\nWorkload:\nHis exams (2 midterms, one final) are extremely fair, just like the homework.  You simply need to know the concepts cold.  There's a lot of overlap with BC calculus, so you might find helpful buying a prep book.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "April 05, 2013",
            "review_content": "\nI can't say I recommend Professor Drewitz for people who are coming straight in from AP Calculus AB or equivalent. His lectures feel like they are verbatim from the book. He uses the same examples so there was almost no reason to go to lecture. As expected, attendance dwindled towards the end of the semester. If you have some background in Calculus or you took Calc BC in high school that may help. I didn't and I did suffer quite a bit. I had to do all of the optional problem set questions and review review review. His problem set questions are hard and often the TA's at the Barnard Help room are too busy and too confused to answer the questions. If you are willing to learn calculus for the calculus i guess it's worth a shot but if you are an Engineer like I was and you are looking to fill a requirement and move on... look for a different professor. \nWorkload:\nHeavy-ish. \n10 problems for the required problem set, a multitude for the \"optional exercises.\" \n10 sets total, 2 dropped. \n2 midterms\n1 final (significantly harder than midterms i found)\n\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 05, 2013",
            "review_content": "\nI would certainly not recommend this professor. His lectures covered the same exact problems that were in the textbook. He focused a lot on the proofs for different theorems, which he did not test on. The problem sets he assigned were much more difficult than the examples in the book, which made them extremely time-consuming, if not nearly impossible. Only if you have a good amount of time to spend on learning the specificities of calculus and doing extra practice problems (which he provides as Optional Exercises) would this class be alright. \nWorkload:\nPrepare to spend about 10-15 hours a week studying for this class unless you have an uncanny ability in calculus. 10 problem sets of which the lowest two are dropped, due every week except those with the midterms or final (20%), 2 midterms that are similar to the difficulty of the problem sets - aka difficult to complete without aids (each 20%), final similar to the midterms and only slightly more problems (40%). The class is curved, but he only curves the entire class at the end rather than curving each midterm/final, so you don't really know where you stand throughout the semester. \n"
        }
    ]
}