{
    "prof_info": [
        {
            "prof_name": "Jennifer Rosenthal",
            "prof_id": 4526,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First Year English: The Americas",
            "review_date": "February 02, 2014",
            "review_content": "\nI have nothing but positive things to say about FYE and FYS with Professor Rosenthal after taking both semesters. Her class was engaging, always interesting, and I couldn't have asked for a more caring, invested professor. \nClass discussion was usually pretty invested and I thought Prof. Rosenthal gave solid feedback. Her assignments required running around New York, which looking back was a really great experience, though perhaps occasionally tedious. I also got a lot out of her requirement that we engage with archival/manuscript materials--this was the first (and last, to date) time I've done so. I'm glad to have had the excuse. Both of these assignments now stand out to me as important experiences of my first year at school, getting to know the college and the city. \nOverall the Americas were a great choice for me as far as a required course goes...much more interesting reading list than other FYE offerings and you can't go wrong with a professor so invested in your success. \nWorkload:\nOverall both courses were low-pressure, with a relatively light workload, but for me as an introduction to college writing this wasn't a problem. My backbreaking research came in other classes and I don't regret not having it as a freshman.\n"
        },
        {
            "course_name": "Americas First Year Seminar",
            "review_date": "December 09, 2013",
            "review_content": "\nI had Professor Rosenthal for my First-Year Seminar. I found the course to be great. The texts that we read were really good and I found her overall enthusiasm over what we were learning to be contagious. This seminar was not an easy course but that did not mean I did not enjoy the class.\nProfessor Rosenthal works hard to get everyone into the topics we're learning about and she encourages us to stretch our learning by helping us look deeper into the texts we're reading and expanding our learning beyond the classroom. She shows a genuine interest in helping her students improve their writing which can be seen in how she is eager to meet with you even outside of her office hours and helps set up meetings with the Writing Fellows. \nMany times I would visit Professor Rosenthal's office and as we would go over my paper she would not only advise but also show me how I could make my writing better. \nThe First-Year Seminar course \"The Americas\" is a great course to take with Professor Rosenthal. From her class, not only do you get to read great material and grow to appreciate it but you also get to work on your writing skills. I found that my semester in her class was a great learning experience. \nWorkload:\n~3 big writing assignments, a wide variety of texts, and several reflections throughout the the semester\n"
        },
        {
            "course_name": "Americas First Year Seminar",
            "review_date": "December 03, 2013",
            "review_content": "\nI had Professor Rosenthal for two terms of \"the Americas\", both for FYE and FYS, and had an amazing experience both semesters. After the first semester, so many people enjoyed her class and teaching that 90% of the students chose to sign up and take a second semester with her.\nI really appreciated her effort to get us out into the city and explore what the city has to offer. I ended up at the New York Public Library in one of their special collections looking through Nathaniel Hawthorne's personal diaries and  sketches, which was super cool and exciting. And then I got to write a paper about it!\nProfessor Rosenthal really cares about her students and really takes the time to read through papers, often more than once. She takes your writing very seriously and writes incredibly detailed notes when grading- it would be a missed learning opportunity to not carefully go through her comments, and discuss them with her if you are confused. She really pushed us to come up with our own original ideas when writing papers- which was really empowering and a skill that I have come to appreciate throughout my time at Barnard.\nYou really have to put the work in to get the grade that you want, but if you put the effort in, in the end you will learn a lot about structuring your arguments and writing a good, cohesive paper. \nI recommend going to the writing center as much as possible! They will help you immensely and improve your writing.\nWorkload:\nReading books and writing papers.\n"
        },
        {
            "course_name": "Americas First Year Seminar",
            "review_date": "January 24, 2013",
            "review_content": "\nJennifer Rosenthal is a nice lady, for the most part. She can turn bitchy in about two seconds but still uses a really annoyingly sweet voice- sounds like poisoned honey.\nI was in her seminar class as a first semester freshman and it was a horrible introduction to Barnard. Rosenthal was always disorganized and babyish.\nAs far as writing goes I did not learn a single thing. I met with her for conferences, worked hard to meet her requirements, and edited my papers non stop and I never once got a different grade. Same grade all the way through. When I met with her to go over my final paper Rosenthal said to me, \"I'm sorry I just cant seem to stay awake while reading your paper!\" That was when I knew I hated her.\nOur first assignment was to write an alternate ending to our play and then write a review on it, but after the final draft Rosenthal decided that she wanted the review to be more of any essay- but she failed to tell us that!!! So we were marked down if we didn't read her mind. \n\nWe wasted insane amounts of time in class because Jennifer refused to participate in discussions, so a lot of time was spent in silence when everyone ran out of things to say. When she finally did participate it was to give us a boring summary on what she thought of whatever we were reading, which honestly just sounded like the analysis section of Sparknotes. This confirms my suspicions that she is not very smart. \nThe most unbelievable part of the class was how much time Rosenthal spent accusing us of plagiarizing. She would conference with us and then ask us if what we had really written was our own work- every. single. time. It was extremely rude and also a little unnecessary how much she went into it. We were forced to do a plagiarism test online, so we wouldn't be confused on what is and what is not plagiarizing. Also, we had to cite in class discussions, FROM THE CLASS, and other ridiculous things like our old high school english classes. Totally unnecessary and also offensive because she obviously didn't believe that anyone was smart enough to write what we had. \nDo not take this class if you have another option. The material is interesting enough, but Rosenthal makes it absolutely boring. On top of that she is an idiot, and a real bitch. \nOh- I got a b+ in the class without doing too much, so this is not a vengeful review- she is just awful. \nWorkload:\neasy:\nnightly readings that you don't need to do throughly to participate.\na few pointless assignments such as syntheses and reflections. \na scavenger hunt that is mandatory in the syllabus but which Rosenthal makes a pain in the ass. \ntwo 5-6 page papers, and a final paper. \n"
        }
    ]
}