{
    "prof_info": [
        {
            "prof_name": "Patrick Zimerli",
            "prof_id": 2646,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 06, 2010",
            "review_content": "\nProfessor Zimmerli is one of the best teachers I have had at Columbia. It's not every semester that you get to sing, listen to, and conduct music as part of your academic day. Having played an instrument before, I came into the class with a good understanding of music, however I believe that my classmates with less musical experience handled the workload just fine. He makes a point of calling on EVERYONE in the class to answer questions, write on the board, and count rhythms aloud, which generally kept everyone engaged and attentive, if nervous. That being said, in order to call on everyone, Zimmerli needed to learn everyone's name, which is pretty exceptional for an instructor in an introductory class. I've seen Prof. Zimmerli a couple of times outside class (once in Riverside Park decked out in his tennis gear) and he always stops to talk and see how everything is going...he is truly the nicest professor I've had at this school. His tests were not terribly challenging and covered exactly what he talked about in class. \nIn addition to being a great teacher, he is also an amazing composer and musician. You should definitely check out some of his original works at http://www.myspace.com/patrickzimmerli\nWorkload:\nTwo tests, final. Lots of extra credit. Very liberal with time limits on tests. You won't regret taking his class.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "April 15, 2008",
            "review_content": "\nI can't say enough good things about Zimerli. He is by far the funniest, most down to Earth and flat out coolest guy who teaches at Columbia. Even if you don't know a thing about music he will make this Fundamentals the bright part of your schedule. I ran into outside of class a couple of times and every time he stopped and seemed genuinely interested in how my day was going and what I thought of the class. Beware though -- you will be ruthlessly made fun of in his class, if you know it all or know nothing. But he's not mean or intimidating as he might appear to be on the first day. He is, in fact, far from it -- he helped teach me a few things about music and has been the best teacher I've had at Columbia University.\nWorkload:\nNot too heavy. Even though he says you don't have to go to class, you should. A couple of quizzes, midterm, final, and some extra credit homework.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "October 07, 2007",
            "review_content": "\nHilarious professor - even if a bit politically incorrect and crass at times. Professor Zimmerli has unlimited energy and is very understanding and good at talking individually with students. His ability to bring humor into all situations is outstanding, and he's a fountain of knowledge.\nWorkload:\nAlmost no homework (when there is homework, it's extra credit usually), he'll even say you don't need to come to class, but it is helpful to go to class. Midterm and final.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "October 07, 2007",
            "review_content": "\nHilarious professor - even if a bit politically incorrect and crass at times. Professor Zimmerli has unlimited energy and is very understanding and good at talking individually with students. His ability to bring humor into all situations is outstanding, and he's a fountain of knowledge.\nWorkload:\nAlmost no homework (when there is homework, it's extra credit usually), he'll even say you don't need to come to class, but it is helpful to go to class. Midterm and final.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 09, 2007",
            "review_content": "\nThis man annoyed me no end! But I was forced to raise my opinion of him by the end of the class. He started the class off with an extremely superior air, and a habit of purposely picking on students that he thinks know too much about the subject. Argh. He also does this strange thing of talking about music theory as if it were pretentious and below him. Which is ridiculous since we all were in that class because we were interested in music theory! That said, he is an extremely talented composer, and everyone should take the chance to listen to some of his stuff on itunes. Also, it became clear that many of his most offensive teaching practices were just the result of being nervous. He did have very good intentions for the class and went out of his way to make sure that we understood what at times could be relatively challenging material--especially if you didn't have a strong previous background in music. \nSo, if you're taking this class to learn the material...go for it.\nIf not, there are many less painful ways to get exposure to the world of music.\nWorkload:\nVery light - a couple of quizzes and midterm/final. So many extra-credit options that really everyone should get an A+. READ THE TEXT BOOK!\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 08, 2007",
            "review_content": "\nZimmerli is a great teacher! He is so smart and funny. His humor will come off as very satiric and sometimes offensive but if you talk to him one on one he is the most caring man in the world. The material was tough for me but he spent ALOT of time going over material, sometimes dedicating whole classes to answering questions. His tests are fair and HW is totally optional but very useful. his goal is to give you a very practical knowledge of music. He is very down to earth and not afraid to tell you what is what. Very good class if you love music enough to learn more about its nature.\nWorkload:\nmidterm and final and many extra credit opportunities.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 01, 2007",
            "review_content": "\nto put it midly, Zimerli is the shit. He was the sort of teacher who got mad AT HIMSELF because he didn't think we did well enough on the mid term. I supposed I'm slightly biased because I had a (very very baisic) musical background (i.e. i could read notes) but even when we got into more complicated concepts that I had never heard of, he explained them well enough that most of the class caught on quickly. He is sarcastic and classes are a lot of fun. He is also very practical, another plus for potential music majorts. Enjoy!\nWorkload:\nTechnically none, but you should read the textbook and do the exercises. He gave us a baby quiz and very managable midterm and final. Plus, many extra-credits.\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "December 28, 2006",
            "review_content": "\nSo far, this course has been by far the most chill course I have taken at Columbia.  There is literally no collected homework and the class only covers about 100 something pages in the music textbook.  Plus, many of these pages cover very basic music concepts that many people already know or will easily be able to learn.  Some of the later concepts are tricky but if you just memorize the short lists of rules and think carefully on the exams, you will do more than fine.\nWorkload:\nThere were only two midterms and a final (the final was as short as the midterms and was given before finals week to reduce stress).  These exams can be difficult but if you work through the problems in the textbook there will be no surprises.  Also, the exams are graded quite generously - one of our exams was curved in a way that you could get 120 points out of 100!\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "December 27, 2005",
            "review_content": "\nZimmerli is obviously intelligent and it's cool that he is a composer as well as a teacher. But he is definitely not as organized as he should be. He knows his stuff, but it is often difficult to follow him--I left class every day with a massive headache from confusion. To his credit, he WILL try to explain himself in multiple ways when the class didn't seem to be understanding, but often times it would take a week before the material would actually sink into my brain (you know, those eureka moments when it finally clicks). I was glad that I already had a background in music (playing piano for 10 years and voice lessons for 4), because otherwise I think this class would have been even more ridiculously difficult than it already was. Zimmerli is fast-paced and some of his tests were long and grueling. (Although he did apologize to the class after one particular \"epic midterm\" that took two hours and gave me such a headache that I went home and cried after it). I think that he will make the tests more reasonable in the future (the final wasn't nearly as bad as I thought it would be) as he gains more experience--this was his first time teaching this class. Also to his credit, he has a great sense of humor and he is enthusiastic. But don't be fooled--there may never be any homework assigned in this class but it is NOT easy and you would be wise to do the exercises in the textbook even if he doesn't assign them. And beg him for answer keys to check your work (he sometimes obliges) or else it's practically pointless. \nWorkload:\nno homework, about three tests and a final... the tests were brutal but the final was a gift... the grades are objective and he grades very fairly. \n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "December 18, 2005",
            "review_content": "\nI agree with the last reviewer. Zimmerli lovvveeesss music and emphasizes the application of these theories in the real world. While he often jokes around in class, don't let his calm demeanor fool you! This stuff is NOT easy! The tests cover a lot of material and if you don't have the concepts internalized, you will find yourself fighting the clock during exams. A lot of the rules in music theory are contradictory, so the more you study, the more you will come to understand when to apply which rule. However, if you have any questions, Zimmerli will answer in depth (I preferred his explanations over those offered in the textbook.) Overall, he is a great teacher and person--funny, fun, and approachable.\nWorkload:\n2+ exams, no homework\n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "November 10, 2005",
            "review_content": "\n Cool Professor!! Very hip and \"with it.\" He's mostly concerned with real-world applications of music (being that he is a jazz composer). Always open and friendly to any questions students have and has some ambiguous office hours (which are usually not in his office). You'll definitely have fun with him, but be prepared for him to call on you at any moment. If you don't know the answer, he MIGHT dish out a sly joke which will either embarrass or motivate you to study harder.\nWorkload:\nNot heavy at all. However, don't let this fool you into procrastination. You should definitely practice often with material in the text (\"The Elements of Music\"). 2+ Midterms [depends on the occasion], and 1 final.\n"
        }
    ]
}