{
    "prof_info": [
        {
            "prof_name": "Robert Harrist",
            "prof_id": 481,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "The Arts of China",
            "review_date": "January 12, 2015",
            "review_content": "\nProfessor Harrist is an old fashioned professor.  He expects you to come to class and takes attendance because he wants to learn the names of all his students. If you have no interest in Art History or China, this class will bore you.  If you can pretend to be interested for 2 hours a week, you will learn a lot from a professor who obviously knows what he is talking about.  Yes, he is a tough grader and yes he expects you to memorize a huge amount of dates and Chinese names.  You will be much better off if you are familiar with Chinese language.  I found the readings were very unnecessary and stopped doing most of them after the first month.  On the comments that he is a jerk: he's pretty arrogant and an elitist and don't ask him for anything additional.  Answer his questions correctly and show interest in the topics and he will take notice.  \nWorkload:\nMidterm, Final, two short papers.  Easy B/B+ if you study.\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "December 17, 2014",
            "review_content": "\nHe's a jerk and a racist. Listen to previous reviews.\nWorkload:\na lot\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "June 30, 2014",
            "review_content": "\nI disagree with the negative comments below about professor Harrist. Firstly, he is a very passionate art historian and he knows well what he talks about. I don't like any of the core classes but I can say that I really learn a lot from him after this course. Secondly, it is right that he grades work heavily on grammar and writing skills. This bothers me a lot and it's difficult for an international student like me to catch up. So what? Hard work pays off. He does appreciate your improvement and he tries to urge students to improve. That's the point. I have met easy instructors before, I'd rather stay in a class that has a lot to learn with a tough grading professor than in one that's way too boring with nothing left in my brain after the final but I still manage to get good grade. And what else can you ask for? He's an art expert, and he's stubborn about his art concepts. But he puts that aside and just grades papers on the writing skills that he has continuously given instructions in class. I think at the end of the day you'll get what you work for. I got him for art hum in the summer so maybe it's different(?) but overall, if you like a challenging class with a passionate professor who cares about what to teach his students, he's the right guy! If you don't want to risk your gpa even just a little, don't get his classes.\nSummer Work Load: Class participation 30%; 2 papers 15% each; some papers he requires but would not be graded; and in-class final 40% \nWorkload:\nSummer Work Load: Class participation 30%; 2 papers 15% each; some papers he requires but would not be graded; and in-class final 40% \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 02, 2014",
            "review_content": "\nProfessor Harrist is the absolute WORST professor I have encountered during my time at Columbia. I have had an incredibly positive experience with every other core class I have taken, but my Art Humanities experience has proven unproductive and superficial. Professor Harrist does not grade work based on the validity art historical concepts, rather he chooses to focus on the grammar and syntactical structure of the work. While this, in theory, is productive, he does not offer constructive criticism to improve your writing, rather just tears apart your work and expects you to accommodate to his stylistic preferences. When it comes to exams, he apparently prefers quantity over quality writing, which contradicts his obsession with concision in essay writing. I do not mind receiving a bad grade in a class if it means I am actually learning from the mistakes, but that is not the case in this class. If possible, avoid this professor at all costs. \nWorkload:\n3 essays, midterm, and final \n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "February 09, 2014",
            "review_content": "\nIf you are looking at this to fulfill your core, consider your options carefully before you take this class. You may regret it, or maybe not.\nThe drawback: \nThe previous reviewer had it right. Harrist is great for lectures but absolutely awful for anything (and that means ANYTHING!) else. The course demands a huge amount in terms of sheer amount of memorizing. While this isn't the drawback per se, you should be forewarned that there's we cover quite a big chunk of art and then he asks for dates, period, name of work, name of artist and context in his exams. The issue is this: that besides his beautifully presented albeit slightly pretentious lectures plus the necessary office hours, do not expect any other kind of help from Harrist. \nHe is the only Columbia professor I have met who genuinely races out of the door when lectures are over, leaving the TA's to collect his things, pretty much to avoid student questions (if you try to intercept him as he's just about to slip by, he has an undisguised look of impatience). From talking to other students, he doesn't seem to schedule extra office hours even prior to papers and exams, gives no extensions and does not overlook typos or spelling errors. Your only chance is to try to catch him at office hours, but he switches these all of a sudden often only emailing the day of. On the one hand, we need to take into account that from he is certainly not obliged to do any of the above things. But it grates when you find a Professor who makes it a point to mark out the boundary of his duties so carefully.\nThe upside:\nI do feel that I learned a very far amount during this course. Harrist managed to fulfill the core's aim of a class that will teach college kids to appreciate something that, left to themselves, they would probably never know much about. The material was fun and the art that we looked at, especially toward the later part of the course, was stunning. Harrist has well-prepared and well-timed lectures, and he has an interesting, rather eccentric lecturing style which meant that waking up early to attend Arts of China wasn't always a complete trial. \nOverall assessment: \nSo, did I regret taking this course? My feelings are mixed.  He grades very harshly -- decent grades only if you work for it (and by decent, I do not mean \"A\"). So I was relieved when my final grade was still pretty good, but I felt that I worked far harder for this course than I should have. The problem here is not the work per se -- I have worked harder than this and had harder material from other Professors. It's just that it felt a demotivating working so hard in class where I felt the Professor was not really interested in reaching out beyond that material and encouraging his student -- whether it was to spend some time going through weaknesses or just to keep up the good work.\n\nWorkload:\nTwo papers (short but take time); a midterm and a final requiring thorough revision\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "January 12, 2007",
            "review_content": "\nProfessor Harrist is an excellent, extremely knowledgable man, over-educated, at the top of his field, arrogantly witty, clever, etc. His lectures are outstanding; he fits in more material than one could imagine, yet in a manner meant for comprehension and cohesiveness.  He makes the often dull material interesting and all is quite aethetically pleasing.  However, if you begin this class, as I did, with little to no knowledge of the geography and language of China, be prepared for extra studying and difficulty.  He emphasizes throughout the course the necessity of memorizing the changing map of the provinces and cities of China, an absolute painstaking must.  Also, you have to do a lot of cross-referencing of your notes with (few and far between) slidelists, the text, and miscellaneous readings.  Also, when approached outside of class, Harrist is curt, annoyed, and often seemingly offended and the idiocy of his students.  Delightful lectures, dreadful for anything else.  \nWorkload:\ntwo papers, 3 pages each, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "October 24, 2006",
            "review_content": "\nI actually still couldn't believe that art hum couldn be such a totally HORRIBLE experience. I have done music hum, lit hum and cc all pretty well, learnt a lot about humanities and the core in general, and really wouldn't expect art hum can be so bad with Harrist. This man, like what reviews below said, is totally stubborn, and will only listen to answers that he's looking for. He calls people during classes, and you almost can't express your own opinions because if it's different from his, he will just shake his head with a nasty face, mumbling \"hmmm, no, not quite.\" I so regret that I haven't dropped this class - CC drop date has passed and I was too busy applying for jobs earlier in the semester that, very unfortunately, I have to stick with this stubborn old man for the rest of the semester.\nWhat makes him even worse is, he's is really a harsh grader. I did pretty well in other humanities classes, getting almost all As and A-'s, but from the first paper I got a C+ from him. Totally speechless.\nWorkload:\nA ton of boring readings. You should be prepared for answering his questions anytime in class.\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "October 11, 2006",
            "review_content": "\nOk, let me just say that I'm in the middle of this class and I despise it already. The man seems like a nice guy during lectures and maybe in person...very comical (depends on your sense of humor). But he's very nitpicky. I mean, he'll call on you during class to answer a question...if you do not say it exactly the way he has the answer pictured out in his head, he'll embarass you in front of everybody. And his papers...again, if you leave out the word \"the\" by accident, you automatically get a B- on your paper. The readings are long and dry...and everything he says comes straight from the textbook. Again, he's too nitpicky for this very simple class. I recommend instead Arts of China, Japan, and Korea with Delbanco.\nWorkload:\nDry, long readings. So far, 3 page paper. Exam should be killer. DON'T TAKE THIS CLASS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "May 17, 2006",
            "review_content": "\nHarrist is a very talented lecturer and is extremely well versed in the Arts of China, as the graduate studies head, I sure hope that he would be.  He is a generally nice man in and out of class, but can be inapproachable.  His lectures were generally bearable and kept my interest, though others may disagree.  I believe that he graded the papers and exams, not his TA, like was said in an earlier review.  He was rude to the TAs and had favorites in class.  The mid-term and final did not seem to quite test the bulk of what we learned.  The final exam had I believe 5 known IDs, one of which was a ceramic and another was architecture (we mainly focused on paintings).  It had I think 3 unknown slides that we had to ID according to what we knew about specific styles and techniques.  It has two essays, one short and one long based on the homework readings.  I would recommend him.\nWorkload:\nModerate and do-able.  Readings for each class, two papers: 3 pages and then 3-4 pages (10 percent each);  Mid-term (35 percent) and Final (45 percent)\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "May 10, 2006",
            "review_content": "\nOnce again, stay away from this class!!! Prof. Harrist might know his stuff (and Chinese) but his lectures, which consisted of never-ending slides were extremely dry, long and borring. There was no interaction in his class; questions and opinions were never encouraged. There were no reviews and do not expect any help from the TAs who barely speak English. You are expected to memorize a whole bunch of Chinese names and terms that sometimes are inscripted in the paintings (in Chinese!!!)\nWorkload:\nHeavy readings, two papers(only 20%), a midterm (35%) and a killing final (45).\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "April 23, 2006",
            "review_content": "\nI'll admit Harrist probably isn't everyone's cup of tea (see earlier reviews), but I thought he was great: wonderfully articulate and sharp as a tack, with a rather dry sense of humour that's just the thing to combat the asphyxiating stuffiness of 612 Schermerhorn. (If anyone from the Art History dept. or the administration is reading this, do something about that before you have a corpse and a massive lawsuit on your penny-pinching hands.) I attended the first day of class not quite expecting to stay - I already had a survey course of Asian art under my belt - but needless to say I did, and didn't regret it. At a school like Columbia where the general pattern with the faculty seems to be an inversely proportional relationship between intelligence and pedagogic ability, its always nice to run into someone who isn't short on one or the other. The assigned readings were well worth the time, mostly selections from venerable old names in the field as well as contemporary scholars actively thinking and writing about Chinese art; I ended learning not just about the latter but also the former, which will probably come in handy if ever I decide to join their illustrious ranks (and I just might). \nOn the downside, however, Harrist is one of those slightly flighty, slightly haughty, to-the-manner-born types who can make you want to grind the enamel right off your teeth. The midterm was absolutely horrendous (apparently the median was a B or thereabouts), mostly due to the lack of a slide list and a couple of curveballs with the IDs, as well as an (that's right, ONE) essay question the adequate answering of which required the regurgitation of 6 weeks' worth of information, and to which he very cavalierly remarked \"I should be ashamed of setting such easy exams\". Well. \nBut don't let that scare you away. Take a class with him, he's well worth the hassle and the tuition dollars - you'll probably end up learning more than you bargained for. I did. \nWorkload:\nWeekly readings averaging about two mid-length articles per class, 2 3-4 pp papers, a midterm, and a final (which is still two weeks away at the time of this review - I wonder what fresh horrors are in store?)\n"
        },
        {
            "course_name": "Landscape and Visual Arts of China",
            "review_date": "May 10, 2005",
            "review_content": "\nA previous review proclaims, \"STAY AWAY FROM THIS MAN!...intolerable!\" I do not see why--that review is utterly inaccurate. Robert Harrist is the kindest man this side of Hoboken, New Jersey, and his knowledge of art history is simple, deep, and true. I guess his impeccable style might make you feel inferior, but if you counter his Versace with a little Giorgio of your own, you can't go wrong. \nWorkload:\nNot bad. Some papers, a year-end presentation. Don't forget your cuff links.\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "July 07, 2004",
            "review_content": "\nProf. Harrist is a very thorough and clear lecturer who obviously knows everything about what he teaches and more. He doesn't joke or interact with students much, but he's receptive to questions. Outside of class, he's neither unfriendly nor particularly outgoing. He's just a jaded senior professor who's here to do his job, not to be your best friend. You'll learn a lot from him if you try, but it's hard to make a personal impression on him as an undergraduate. Prof. Harrist is pretty lenient grader though--the kind who settles for the ambivalent A- all the time, and regurgitation alone will get you there.\nWorkload:\nCoursepack fairly dry and full of vague academic writing. The textbook--alternately a listing of historical events and a listing of art objects--is *very* dry. But if you're used to art history or if you have good concentration, the distilled content is often interesting. Midterm, final, two papers graded by TA. Landscapes and ritual vessels get especially confusing. The Chinese language is an additional hurdle. \n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "May 06, 2004",
            "review_content": "\nProfessor Harrist knows his shit. That being said, his personality leaves something to be desired. Despite introducing myself and telling him my name about once a week, he didnt master it by the end of the class. He treated the TA like total crap. And she didnt even strike- go figure. He's pompous and a little bored i think- grading was...weird, but the TA graded everything, so cant really judge what HE thinks of my work.\nWorkload:\n2 very short papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 06, 2002",
            "review_content": "\nProfessor Harrist knows his material and is passionate about it which is great. He is VERY smart. VERY! The problem is that he is pompous, he is stubborn, and grades possibly by tossing darts at a board. His exam questions are totally subjective which makes grading a mystery. Also, he covers no female artists and seems to think that CC is the only College at the University. I watched GS and ESC students grow more frustrated with him as the semester went on.\nWorkload:\nA few papers (3), a midterm, and a final. The workload was manageable and fair.\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "December 21, 2001",
            "review_content": "\nI took this course to fulfill my Major Cultures requirement. The class size is huge and it gets really stuffy in the Schermerhorn room, which doesn't help because the class lectures can get really boring. It's a total combination of Art Hum and Intro to East Asian Civ. Lots of memorization for dates and artists and you have to know a bit of Chinese History for some of the essays. It's definitely manageable, but not an easy A if that's what you're looking for. If you like art and are a good note taker, and can stay awake through Art Hum and Chinese Civ, then you can get through this class.\nWorkload:\n2 five page papers (not bad at all b/c he's really specific and you can get a lot of your materials from lecture notes and the books), midterm, final (ids and essay).\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 19, 2001",
            "review_content": "\nI loved this class, but I'm partial to art history. Prof Harrist really annoyed me at first because he's very pretentious and also can't admit when he makes a mistake. eventually, however, i realized he really knows his stuff and likes teaching the class. He still says hi to me; i recommend him.\nWorkload:\nmidterm, final, about 7 or so papers, most 2-3 pages, some 4-5. many many museum trips\n"
        },
        {
            "course_name": "The Arts of China",
            "review_date": "December 31, 1999",
            "review_content": "\nRobert Harrist is very knowledgable about the subject and definately enjoys teaching. He can sound pretentious especially pronouncing \"Beijing\" with an over exaggerated Chinese tones. It may be due to the fact he went to grad school at Princeton. I learned a lot from the class and found it interesting. First half of the semester focuses on bronzes and general art while the second half is harder focusing on styles of certain Chinese artists and their paintings. He is a fair grader but is lectures can sometimes bore.\nWorkload:\nTwo art critiques involving the Met and a gallery. Midterm is okay with easy slides and essay. The final is five given essays and one is on the exam and six slides with unknowns.\n"
        }
    ]
}