{
    "prof_info": [
        {
            "prof_name": "Irene Alonso Aparicio",
            "prof_id": 12934,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 13, 2014",
            "review_content": "\nOk, if you're like me and want to complete the language requirement but still have an amazing learning experience I'd HIGHLY recommend you take her class. She has incredible energy and amazing teaching style. She is super encouraging and makes learning Spanish incredibly fun. Some professors are not understanding when students are having a hard time learning the material, but she actually facilitates learning where you never run into a roadblock.\nI wish the department picked out more professors like her because she has been one of my favorite at Columbia so far!\nWorkload:\nTotally bearable if you put even an ounce of effort into the class.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 25, 2014",
            "review_content": "\nIrene has such a positive energy and knowledge, of the subject and how to convey it to her students. She is a joy! The class really starts to roll after mid-term and can get difficult, only because all the information that needs to covered and the limited time remaining, however...she makes it effortless, partly due to her encouraging manner and her passion for teaching.  Yes, I'm a fan. Would I take her class again? ABSOLUTELY!  (Over and over, if need be.)   *Also, her diction is perfect and clear...southern Spain.\nRecommend (on a 5 star gauge): *****\n\nWorkload:\nNormal departmental requirements, 3 essays that related to the required movies and a very \"time commitment\" departmental project which included shorter papers. Mid-term and Final Exams. Spanish Lab homework and grammar book exercises = very standard. \n*One more note:  Daily conjugation quiz...yes, I know = dreaded, yet short. (How else can you be encouraged to learn them...there's so many of them, but learning them is what it's about after all.)\n"
        }
    ]
}