{
    "prof_info": [
        {
            "prof_name": "William De Bary",
            "prof_id": 52,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 22, 2011",
            "review_content": "\nI really wanted and expected to love this class. Professor de Bary sounded like an incredible guy, and the opportunity to learn and discuss East Asian literature with one of the foremost scholars in the field in a small seminar seemed like an incredible opportunity. And, though I continued to love the class in theory, in practice it was quite disappointing.\nDe Bary does know a lot about that which he teaches, and his age rarely shows. He is sharp, lucid, and does a good job of explaining the literature. I enjoyed his insights for the first few classes. This is supposed to be a discussion class, however, and people rarely spoke. De Bary is intimidating to even the most fearless students and it often seems like he is not really listening to what you are saying. He never quite agrees with your comments of insights.\nThere are no grades given in the class until you receive your final grade at the end of the semester. The only indication of how you're doing in the class before you receive your final grade is the professor and TA's comments on the first of two papers, due halfway through the term. The final exam is a frightening experience, a twenty-minute interview with de Bary and the TA during which you're asked to discuss a theme in reference to the texts read throughout the semester.\nIt seems like most people end up doing pretty well in the class, but don't learn very much or appreciate the experience. As tempting as it is to take a class with a professor of this stature and experience, choose a different Global Core class or take the Colloquium with a different professor if you're an EALAC or MEALAC major.\nWorkload:\nTwo 5-10 page papers, 20-minutes interview-style final, oral presentation (usually 2) to introduce a text and start discussion at the beginning of class\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 14, 2009",
            "review_content": "\nProfessor de Bary is not as bad as these reviews make him out to be. He's actually pretty laid back (doesn't care if you skip class or want to turn in papers late). Having said that, he doesn't teach. He needs other professors to enter and teach for him, and he spends the majority of the class listening to his students' opinions. He doesn't lecture; he simply entertains everything and doesn't say anything during class. He's a nice guy actually, but this class is frustrating simply because you don't learn anything directly from him. Another reason it's frustrating is because he doesn't grade anything. While this is nice on one end, it's nervewracking because you have no idea what your grade is going into the final exam. You don't know if you're doing well or poorly, and he has no interest in letting you know. Having said that, he's not a bad guy, certainly not the way these reviews have made him out to be. \nWorkload:\n2 papers and a final exam if you're not taking it as a year-long course\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 20, 2005",
            "review_content": "\nThis term was actually smooth because we had no TA.  It was nice not going on courseworks every week or talking in discussion.  But he had some favorites who sat in the front and raised their hands all the time.  I guess it's not really important to read the assigned readings for the midterm because it's just IDs and one essay.  You can look them up on en.wikipedia.org instead of reading the text.  But for the final, you have to start reading because there are difficult ID passages.  He loves Mencius, Confucius, and Xunzi, so beware.  His final was hard because some of the material was from the midterm and he listed IDs that were about books.  As for his lectures, he is very dry and boring.  I suggest to still go to lectures to know what's going on.  He is very intimidating and arrogant, so don't bother going to his office hours unless if it's necessary.\nWorkload:\none paper (6-10 pages) in which he assigns you the topics, one midterm (10 IDs and one essay), and one final (5 ID passages, 10 IDs, and two essays)\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "January 25, 2005",
            "review_content": "\nHATED this class.  The books we read are great, but I think the Professor is boring, mean, and condescending.  The reading list long, which is expected, but the discussion (if you could call deBary going on and on while knowing exactly what he wants students to say discussion) was horrible.  Nothing in the class is graded - you have no idea how you are doing until after you've gotten your final grade online.  The best part of class was it ended after a long 2 hours.  Avoid if you can.  Or P/F it.\nWorkload:\n2 5-10 pg papers, a presentation on a book in front of the class (3-7 minutes), an oral final.  \n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "January 10, 2005",
            "review_content": "\nProfessor DeBary may be old and a little hard of hearing at times, but he knows the material forwards and backwards.  He begins each class with an introduction to the following week's reading and then has a couple of students present on the current week's reading before opening up the room to class discussion. Prof. DeBary does a good job trying to cover the major points from these huge and unfamiliar (to most of us) texts.\n However, the class discussions often lack direction. Professor DeBary may make the connection between one person's comment and the text, but that doesn't mean the class always gets it, and this is where the class begins to get frustrating.  Prof. DeBary can also be a little intimidating at first, but if you show a genuine interest in the material (i.e. you actually do the reading), the class can be very rewarding. \nOverall, though, this class is a very good introduction to these texts, and if Professor DeBary can be blamed for anything, it is for trying to cover too much in such a short time period. \nAs to DeBary's supposedly mysoginistic tendencies,  I think these allegations are totally unfounded.  The simple truth is that many of these ancient texts do not explicitly focus on women or discuss their subordinate status in society. This is essentially a literature course and thus, it seems unreasonable to expect Prof. DeBary to spend what little time we have in class discussing something not actually in the texts since there is so much other information to cover.  That said, Professor DeBary did bring the role of women up on several occassions when it was appropriate.  \nWorkload:\nLots and lots of reading. But hey, it's a four pt. class that meets once a week, so the reading isn't actually unreasonable.  Two papers (5-10 pages).  Oral Final. \n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "January 03, 2005",
            "review_content": "\nThe review made on the 22 December 2004 states, \"Nothing to worry about if you keep up with the readings\". Let me begin my review by saying the \"keeping up with the readings\" is like keeping up with an airplane. There is often, no joke, 300 - 400 pages of reading per week, which when combined with other reading intensive classes, gets very impossible very quickly. So, after giving up on the reading, I looked toward paying extra close attention in class. Professor deBary's dry lecture style didn't really help. His knowledge of East Asian culture and history is so vast that he lectures as if he's reading out of a textbook. I fully blame my coffee addiction on having to chug two large coffees before each class just to stay up for the first half of the class. Keep in mind that the TAs of the class will decide your grade and not Prof. deBary. This is VERY important because if you have a really tough TA, you're screwed for the class. What kills me is that Prof. deBary seems like such an interesting guy, but unless you have a good deal of time to go to office hours and really do the reading, you don't get a good picture of East Asia or deBary himself.\nWorkload:\nAn incalcuable amount of reading, 1 term paper, 1 recitation class/week, one midterm, and one final. We got study sheets for the midterm and nothing for the final. Needless to say, studying something like 3,000 years of Chinese, Japanese, and Korean history is one tough thing to do without a study sheet.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "December 21, 2004",
            "review_content": "\nDe Bary is not the most invigorating lecturer, but then again, he's probably reciting from heart the same lectures he's been giving for the past fifty years. His academic interest lies in Neo-Confucianism, which, along with other Asian philosophies like certain arcane strands of Buddhism, he will devote a lot of time and attention. Unless you spend years trying to understand these texts, you won't. Just accept it.\nWhat impressed me most about de Bary, however, is his depth of knowledge and his commitment to comprehending all that he can, even at the age of 85. And his many experiences and almost fanatical committment to Columbia College (he's missed 2 football games due to illness since he returned from World War II).\nGo to his office hours. Talk to him. His class is as much about him and his experiences as it is about the material.\nWorkload:\n1 term paper that will require significant work. 1 midtern and 1 final. Nothing to worry about if you've kept up with readings.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "November 20, 2004",
            "review_content": "\nTerrible,  just inexcusably terrible. Fellow classmates and I have all confessed to our fear that we might just drop dead from ennui one of these days. He is just so boring . He doesn't lecture, he just summarizes the text at a fifth grade level. After two hours, I can't actually say that we discussed anything. He cannot answer a questions, or simply doesn't care to. \nIt actually disgusts me that he has been around for so long and has gotten away with so much. He is a simpering, weak, pathetic misogynist, and if you attempt to discuss sexuality, sex, gender, or anything in any of the texts, he will misunderstand (probably intentionally) your question and avoid answering it or just tell you its irrelevant. \nI am not a violent person, but this man makes me so angry on so many levels, he might just change that. Please! Use your time to here to get an education --- you will not get one from him, so if his class works with your schedule, fills a requirement, or looks easy, find SOMETHING ELSE. Please.\nWorkload:\nReadings, two papers, oral final. Doesn't matter -- I'm a hard worker, but I can't do anything for this class because he makes it and all associations with it so miserable. Plus, since you don't actually discuss anything of any substance, you could read Cosmo and be equally prepared...\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "November 06, 2004",
            "review_content": "\nHow can anyone have anything good to say about this man? Believe all the terrible things you have heard. He is misogynistic: apparently the problem of women in the Koran is a \"side issue.\" I could list many another anecdote. I took the Colloquium on East Asian texts with another prof last spring and sitting through de Bary's class PAINS me when I remember how good last spring's class was. He is so boring and seems so bored; he will suck away like a leech any interest in the texts you may feel compelled to develope. The only  \"lecturing\" he does is summarizing the next week's homework assignment. I have bore witness to no font of wisdom, no knowledge greater than God's, as was claimed for him in other reviews. He is simply boring. Most of his speaking consists of asking students to repeat their questions in a most condescending manner. AVOID.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "June 27, 2004",
            "review_content": "\nDe Bary's legendary name, or so I thought, is what drew me to take his class. As knowledgeable as he is in his field, he does little to inspire student interest or engage his class. Only a few in the class will really get it, and he will stick to these, not the majority who seem not to have been able to follow up on readings or the discourse de Bary leads in class. \nWhen I had a personal problem that prevented me from attending class, he bluntly expressed his disinterest in my situation. This class was like being in an science class led by Albert Einstein, only this Einstein really has little ability to convey his wisdom to his students.\nWorkload:\nReading - about one book a week, Writing - two essays,\nOral Presentation in class, Oral Final.\n"
        },
        {
            "course_name": "multiple courses",
            "review_date": "April 15, 2003",
            "review_content": "\nThe key to enjoying one of deBary's classes is to understand what he is looking for. All he wants from his students is that they honestly try to engage the text and understand the cultures you study in a non-superficial way. If you do that, he is generally happy.  Assuming that he actually reads your work, generally a factor of the size of the class and the height of the course number, you should be fine. \nAs many others have said, never forget that he has an intense familiarity with both the texts and the cultures and times that they spring from. Ignoring this is an easy step towards saying dumb things. That said, if you are honestly confused by the texts or have a different way of looking at them that you can support, he tends to be receptive and sometimes he does agree with the student in the end. Simply avoid thinking that you have developed the correct dogmatic interpretation regardless of anything he brings up and you should be fine.\n\nWorkload:\nalways lots of reading and some papers. Part of honestly trying to understand what he is talking about is trying to become as familiar with all of the materials as you humanly  can. Beyond that, the papers should simply be able to focus that drive and the overall grade will be fine.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "March 07, 2003",
            "review_content": "\nAt first, I was really lulled into sleep by his lecturing style, thus affirming the truth of W.H. Auden's statement that a professor is someone who \"talks in other people's sleep.\" But when the TA took over the class for a day, I realized how much I appreciated the style of a lecturer supremely confident and entirely well-versed in his subject (as befits someone who wrote or co-edited nearly every textbook the class used). He has a fixed view of how each of these civilizations--Chinese mostly, Japanese, Korean to some extent, and Vietnam barely--functioned and progressed, both internally and relative to other countries and civilizations. However, he is entirely open to questions, and is warm and respectful when answering. It's sometime hard to stay awake, but it's definitely not difficult to feel a sense of awe that this lionized professor in his field is lecturing to a class of undergraduates.\nWorkload:\nAs another review said, hundreds of pages assigned each week, which aren't necessary to read. Mandatory discussion section where you discuss questions posted on Courseworks the week before (you also have to submit answers before the section). Just know the major identifications and write out some ideas for possible essays for the midterm and final, and you should do fine. Final paper, which can be easy or hard, depending on the topic you choose and the TA grading.\n"
        },
        {
            "course_name": "Major Works of Asian Tradition",
            "review_date": "January 17, 2003",
            "review_content": "\nThis class has the potential to be one of the most interesting classes you'll ever take.  All of the major middle-eastern religions are covered with one of the most learned professors in the world.\nBut, he's really boring.  He's over 80 years old and has been teaching this class for almost as long.  One advantage is he knows more than anybody else you could hope to teach you.  And even with all that experience, he's still willing to admit when he doesn't know something.\nOn the other hand, his classes have little variety.  He teaches them all the same way.  Some classes developed into some interesting discussions, but most of the time you got the feeling that only a few people did (or understood) the reading and could participate in discussions.\nIt wasn't till the end of the semester, when i went back and redid most of the readings, did I realize how great the class really was.  All you have to do is take a look at the reading list to get an idea of what will be covered.  And if you are willing to put in the work and keep up with the readings, you'll get a chance to discuss the texts with one of the most famous professors in the field.\nWorkload:\nLots and lots of assigned reading, but you don't have to do all of it.  Two 6-8 page papers and one 20 min oral exam.\n"
        },
        {
            "course_name": "Major Works of Asian Tradition",
            "review_date": "December 13, 2002",
            "review_content": "\nProf. de Bary is an old-school prof.- he knows what he's talking about and doesn't hesitate to cut off a student who doesn't really know what he/she is talking about. That is not a bad thing. Since most students in the class have very little prior knowledge or understanding of Asian cultural traditions, Prof. de Bary doesn't allow people to make rash assumptions or relations to the Western traditions. You can get a lot out of this course without doing a lot of work.\nWorkload:\nWeekly reading, which you can get away without doing if you take good notes in class. 2 papers, not graded. Oral final.\n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "November 01, 2002",
            "review_content": "\nProfessor Wm Theodore de Bary may be a throwback to yesteryear, but he is no fossil. His sharp eyes will spend the first two weeks of class picking out the intellectually inferior, and he won't hesitate to cut them off for the rest of the semester. Some professors tolerate self-important fools- de Bary is not one of those professors. His reading assignments rival those of Lit-hum, and the classes do tend to drag (especially in the second hour); however, it isn't necessary to read many of the books. Just listen to the person presenting in class (if they do a decent job), or to de Bary's response (if they don't), and you'll get the gist of the works. Having said that, there are quite a few books worth reading (\"al Hallaj\" and \"Monkey\" spring to mind). Grading is not tough; neither de Bary or the TA mark the papers, and the final exam is an oral discussion. I took the year-long sequence and enjoyed it immensely. I highly recommend it to anyone who can tolerate an hour of boredom per week. \nWorkload:\nRead what you want; two fluffy papers and one oral exam (per semester); if you take the sequence you only have to take the oral exam in the spring \n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "May 06, 2002",
            "review_content": "\nOne thing should be made clear about Professor de Bary: he's spent the last sixty years studying this stuff, so anything you say he's probably heard before and already formed an opinion about. This gets confused sometimes with academic arrogance; but face facts, you read the work rather quickly a week ago. He translated it. He probably knows more then you, and he's probably right. Deal with it. The class can be excrutiatingly boring, and it looks like he's going to die 4 times an hour. But the fact is, he's probably the first white guy to read any of this stuff, so just to learn in the same class should be viewed as an honor and exciting prospect. Just do as much of the reading as possible, and actually listen for a change in class: he has far more to contribute to your knowledge base then anyone else in that class.\nWorkload:\nTwo ungraded papers, tons of reading that's not quite required. Oral final.\n"
        },
        {
            "course_name": "Colloquium on Major Middle Eastern and East Asian Texts",
            "review_date": "January 30, 2002",
            "review_content": "\nWm. Theodore de Bary (or \"Warm Teddy\" to his friends) is an experience worth having. He's from the old Van Doren school of humanities education, and you know it the second you walk in the door. The goal of the course is to develop some sort of human connection with the texts that is not just a mapping of Western culture onto texts from the four traditions represented in the course, but some sort of meeting based on an understanding of cultural differences. De Bary, as has been noted time and time again, allows little dissent in his class. When he asks a question, he most certainly has an answer in mind. However, two things need to be added to the picture. First, if you stick to your guns and argue the point with him, he will not cut you off--he'll just demand that you have something intelligent to say. Because he knows more about the text than you do, it can be difficult to argue with him, but it's an educational experience. Second, even if you don't plan on arguing a lot in class, there is something to be said for learning, over the course of two semesters, how to read a text the way de Bary does. De Bary is a phenomenal reader, so if you come out of the class with the ability to get half of what he gets from the texts, then this will be already your best college course. His method may be a bit outdated, but its still worth learning.\nWorkload:\nSubstantial, but not backbreaking. Heavy reading, papers (ungraded), and an oral exam at the end. You are expected to participate in discussion, so read accordingly.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "January 30, 2002",
            "review_content": "\nNo the Heyman Center is not a part of the female anatomy. If you can figure out that the class takes place in East Campus??!!, then you've passed the first hurdle. The second hurdle is staying awake through DeBarry's so so so boring lectures. I guess the man is famous, a good writer, and a knowledgeable expert. However, he is just beyond boring. Ancient Chinese texts are boring too. Plus he's all into human rights violations - a big amnesty international advocate - i suppose. Confucious says: Man with no brain take class for self-pain.\nWorkload:\nSome weird oral exam and ungraded papers.\n"
        },
        {
            "course_name": "Colloquium on Major Middle Eastern and East Asian Texts",
            "review_date": "November 19, 2001",
            "review_content": "\nYou may want to sign up for a class with de Bary just because of the fact that he is nearing 90 and is still going strong. He teaches his classes for free, and loves his job. He is also an expert in the field, and his name is found in almost every book in the East Asian library. And of course, you can do NO work and easily come out with an A- in this 4 credit, once a week, class. de Bary is also fun to laugh at on occasion--he makes funny faces and is usually very abrasive towards the TA. (especially Landesman). Another nice perk is the banquet that is given at the end of the semester in which you get to meet his lovely secretary who is also about 95 years old. BUT, and this is a big but, his class was by far the most boring experience of my college career. His raspy voice puts you to sleep and makes you want to shoot yourself in the foot. Sometimes I wanted to jump out of the glass window in order break the lapse of boredom. Also, since I did none of the reading, there was some cramming during finals week.\nWorkload:\nabout 10,000 pages of (optional?) reading for the whole semester. Two 6-8 page papers(NOT GRADED)and an oral exam (ALSO NOT GRADED?) which is a joke.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "September 09, 2001",
            "review_content": "\nThis class is by far the most boring I have ever taken. Two hours per week feel a lot longer than they are, and by the end you'd rather rip off your own arm than put up with having to listen to him speaking. The readings are interesting however and you can get away without reading any of them. Somehow you learn nothing in that class but still end up with a decent grade.\nWorkload:\nAs you like it.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "July 07, 2001",
            "review_content": "\nTake this class if you want to witness someone who knows more than God about a certain subject. It is really incredible to realize this man's depth of knowledge about East Asian literature--and what's more is, his knowledge is extraordinarily subtle in the way that he understands the texts and their nuances. Of course, if you're not the type of person who would be in awe of deBary's as a person, don't take this class. Hell no, don't take this class. There is way too much reading, and about a fifth of it is actually interesting. Plus, deBary is not a good teacher. There, I said it (for all you deBary-worshipers, you know who you are). You aren't meant to interpret this literature or to make it your own in any way--deBary sees the authors as having a very specific purpose for the their time, place, and audience in history. How you, the modern reader, fits into, this deBary does not care, and, furthermore, you will be criticized by deBary for reading into the texts in that light. It is more of a history class really; interpretation outside of deBary's own is not permitted.\nWorkload:\nHundreds of pages of reading a week. You won't be given a grade on either paper you turn in, perhaps a few sentences of comments. For the oral, take very good class notes on a few of the texts, and recite exactly what deBary said or would say.\n"
        },
        {
            "course_name": "Colloquium on Major Middle Eastern and East Asian Texts",
            "review_date": "December 31, 1999",
            "review_content": "\nDe Bary's knowledge with Asian philosophy and literature is amazing -- most of the texts were translated or edited by him. He loves teaching -- though he's officially \"retired,\" he somwhow teaches more than double the normal courseload for a professor. Unfortunately, his voice drags on and the two hour seminars feel longer and longer. The reading are interesting and you don't have to do all of them, especially if you take the year long course (the exam is in the spring and doesn't include anything from the fall).\nWorkload:\n2 papers (5-10 pages); oral final for the full year courses. About 200-400 pages of reading per week.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 31, 1999",
            "review_content": "\nProf De Bary is a legend. No question about it, a giant in the department. Half the books you'll read were either written or edited by him. However, do be warned that as Prof De Bary has entered his golden age, lectures tend to drag on and boredom sets in quite often. A quality class.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 31, 1999",
            "review_content": "\nWorst class at Columbia. Professor De Bary runs a colloquium of fifty people at which he is the only loqucious person. If you think you'll get to discuss great works of Asian literature, think again. De Bary will most likely cut you off in the middle of your presentation and tell you that you are wrong. He's even been know to cut of the TA. It almost doesn't matter whether you read the books or not because either way you probably won't get to discuss the important issues. De Bary constatly rehashes his favorite themes even if they're secondary or terciary to your understanding of the text. Most important of all, he is boring, boring, boring. I went into this class with a desire to learn about East Asian literature; I left it not only without having learned anything but with a newfound aversion to anything East Asian which is only begining to subside.\nWorkload:\nRidiculous amount of reading which doesn't get covered anyway. You can't cover more than one text in a two hour class. Two papers (5-10 pages), on which he comments - but does not assign grades - making it impossible to know whether you're failing the class or aceing it; and one oral exam.\n"
        }
    ]
}