{
    "prof_info": [
        {
            "prof_name": "Ellen Gray",
            "prof_id": 2757,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music, Gender, Performance",
            "review_date": "May 24, 2012",
            "review_content": "\nWhen searching for reviews of Professor Gray as I was registering for Spring 2012, I came across this in a review of another class she taught: \"Just be warned, workload can go from \"0\" to \"Preposterous\" from one class to the next.\" Do keep this in mind, because it's absolutely true.\nWhile the class as a whole seemed a little uncentered, the things we discussed were fascinating: we began by reading papers from some of the professors that have shaped Gray's academic thought, from Roland Barthes to some linguistic anthropology to Simon Frith. Then we discussed/read about castrati, lament, tango and then various takes on celebrity. The readings were generally pretty theoretical (in a good way), but the class afterward was generally given over to discussion of the ideas presented. Since the class ends up drawing a varied mix of people, discussion could be uneven or fascinating, depending. Also, sometimes we'd listen to music or watch films, which is always fun.\nIf there's one thing that bothers me, it's how worked up Gray will get about assignments. Before passing back the midterm, she talked to us for a good fifteen minutes, urging us to visit the Writing Center and mentioning that there weren't many A's, or that they weren't truly solid. After all that, I was expecting a B-, but had in fact gotten a solid A... This is just the way she works. Don't let her stress stress YOU out too much, and you should be fine. She's also very big on clearly establishing claims and evidence. If you took University Writing with a good professor and did well, just bring that game here.\nAll in all, fantastic ideas presented, if you're willing to work for them.\nWorkload:\nVariable. Generally 20 or more pages of reading, occasionally some listening, and usually a response of some, pretty simple form, along with a midterm and a final project. The midterm is two essays, assigned toward the beginning of the weekend and due at the end. The workload really picked up toward the end of the semester, especially as we began working on our final project, a ten-page paper which needed to address readings from the class as well as others found in our research.\n"
        },
        {
            "course_name": " The Social Science of Music",
            "review_date": "January 13, 2009",
            "review_content": "\nEllen Gray seems to be a nice woman.  That being said, she is inextricably out of touch with the lives of her students.  It is not that the overall workload is so unmanageable, but that she give assignments with such late notice, or in such close proximity to each other, that one might perceive malicious intent.  Some examples: Our midterm, which was described as a \"low stress take home assignment\", turned out to be an eight-page research paper which we were given 24 hours to do, with no warning whatsoever.  The majority of students actually had to skip other classes to finish the assignment, and even students who had completely done all the readings found themselves sifting through hundreds of pages at 4am trying to find quotes.  In another incident, Prof. Gray assigned a paper the day before Thanksgiving Break and had it due the day of our return.  When students complained, she referred to us as \"babies\" and informed us that she while she would allow us to turn it in two days later she had been generous for not making the assignment longer... I'm not writing this as a bitter student, I got an \"A\".   Most of the assigned readings are interesting, and students get to lead class discussions which is fun.  Discussions are hit or miss, but that is pretty standard for discussion based classes at Columbia, and Prof. Gray did a competent job bringing up topics. Just be warned, workload can go from \"0\" to \"Preposterous\" from one class to the next. \nWorkload:\nAbout 50-100 pages per class, with a weekly posting.  Two 4-page papers.  An 8 page take-home midterm.  8-10 page final paper.  No final exam.  Grading is moderate.\n"
        },
        {
            "course_name": " The Social Science of Music",
            "review_date": "January 04, 2009",
            "review_content": "\nEllen Gray has been my favorite professor at Columbia. This class has endless possibilities for discussion, and Ellen does a great job of helping the students grapple with difficult and extensive readings. Discussion was usually constant and insightful and Ellen is happy to let the students talk for the entire class, but also jumps in to push ideas farther or clarify issues whenever it seems the conversation is heading towards an awkward silence. This class for me opened up a lot of issues regarding music and ethnomusicology; it was a lot of work but entirely worth it. Prior knowledge of music and/or anthropology is helpful but not necessary. \nWorkload:\nLOTS of reading, weekly postings on the readings, 2 brief presentations, 2 take-home midterms (1000 words), concert ethnography, and take-home final (2000 word)\n"
        },
        {
            "course_name": " The Social Science of Music",
            "review_date": "January 08, 2006",
            "review_content": "\nFor someone with no background in music theory or musicology, but a vested interest in music, I loved this class.  Ellen sets a lot of reading, and she makes us discuss it in depth during class time, but she makes it worth your while.  The readings, although abstract at times, all do come together during discussion, and she's generous in pointing out useful information and facts for upcoming papers, midterms etc.  She's extremely intelligent and this comes across during discussion, but she is hardly intimidating.  I highly recommend visiting her during office hours; she made me realize that I was in fact doing much better in the class than I thought.  Her midterm and final are fairly straightforward, and the nature of her class guarantees an interesting mix of music, history, literature, environmental studies and math majors.  We spent an entire hour discussing ipods one evening; another class was spent listening to the evolution of underground South Asian music.  \nWorkload:\nA 1-2 page summary of our weekly reading, which is about 150 pages per week (if its a book) and 50-80 pages (if its articles).  A take home midterm (2 essays, 5 pages in total) and a final project (~12 pages on a pretty open-ended topic).\n"
        },
        {
            "course_name": " The Social Science of Music",
            "review_date": "December 24, 2005",
            "review_content": "\nProfessor Gray is a nice lady and a good professor. The class sounded quite scary at the beginning, when she threw out all the freshmen and sophomores and stated explicitly that the class would be challenging. But it is nothing insurmountable. I would say it takes a full day of preparation for every Monday class...which, I might add, is long and at a difficult time of the day. There is a TON of reading, and the \"responses and questions\" she has you hand in at the end of class every week are supposed to prove that you read the stuff. The course material is fascinating - one can really expand his thinking about music...as well as the other disciplines involved in ethnomusicology. I definitely recommend this class, but be sure you can devote the time to it.\nWorkload:\nabout 3 articles per week (about 100 pages) or 1 book (easier reading but more like 150-200 pages) per week. Midterm take-home is two short essays. Final project is an analysis of a long ethnography or an essay on several articles of your choice (10-12 pages). Summaries of books and articles and questions on them due at each Monday class.\n"
        }
    ]
}