{
    "prof_info": [
        {
            "prof_name": "Ajay Chaudhary",
            "prof_id": 9506,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 26, 2014",
            "review_content": "\nIf you want a CC professor who makes his expectations for assessments and papers as clear as the stagnant murky ponds in Sub-Saharan Africa that serve as the breeding grounds of the female Anopheles Mosquito, look no further. This is the class to take if you want Sparknotes' perspective to offer a considerably more substantive addition to your understanding of the texts than the vague glimpses into the obvious the professor occasionally offers. This is the class to take if you want your two-hour bi-weekly discussions to feel like a particularly painful season 8 episode of The Office, sans the humor. Take this class if you want your papers back just as they came out of the printer save for a chicken-scratched grade at the end. Take this class if you like hearing the words \"epistemological, teleological, ontological, and solipsistic\" injected ad nauseam into parenthetical antics that serve as little purpose at elucidating the important elements of the texts as might the rug on the classroom floor. If this is not what you're looking for in your CC professor, consider looking a little further.\nWorkload:\nRegular workload -- midterm, final, two 6-8 page papers, and regular blog-posting.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2011",
            "review_content": "\nI think this is Ajay's last year teaching CC, at least for now, but I still wanted to write about his class.\nAjay was a great instructor. After giving a short background on the author of the day, he first asks the students what we thought about the text and then takes our queues to frame the class discussion.\nWhile this only happened a couple of times (because really who wants to be that guy that's always talking first in class...although we had a couple of those), he really let us lead the conversation and discuss what we found interesting or challenging in the text.\nAjay's ability to frame the discussion while allowing the students to lead the conversation is a difficult skill but he pulled it off brilliantly. \nAlthough I wish we could've goofed off a bit more, Ajay brought a serious yet not stodgy tone to the class that allowed us to constructively discuss the texts and philosophies.\nAlso he revealed to us during the winter final party that he's in a country-folk band and is obsessed with sci-fi. That's pretty cool.\nWorkload:\nRegular amount of reading for CC; 1 take-home midterm; 1 take-home final. First semester: 2 5-7 page papers. Second semester: 1 8-10 page paper.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 05, 2011",
            "review_content": "\nHe was great...extremely well read and had a breadth of knowledge in fields like pop culture, which was great when applying ancient ideas to modern times...so well prepared for class too (handed out an outline of the day's discussion that included relevant passages in the texts and the topics that they discussed, and there was also quotes sprinkled in from other thinkers that we would use as a lens to read specific passages)...and he would remember (no joke) everyone's posting and make it known in class (\"*** talked about this in his/her post which relates to ***'s idea in his/her post). \nnow if you actually do the work, which most did, it can be quite a bit of reading because he assigns about 10 or so additional readings throughout the semester, but he makes class participation 40% so it's worth it. these additional texts are usually pretty cryptic and more geared towards philosophy scholars (like himself) but whenever someone shows an understanding (on any level) of them, he gets excited to the point of laughter. we had one term paper (12 pages) that we were given the topic to on the first day of class and expected to meet throughout the semester to discuss our progress with him...this is great, but he does expect publishable-quality work at the end...learned so much tho...he was awesome\nWorkload:\n40% class participation, 30% take home exams, 30% final paper \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 11, 2011",
            "review_content": "\nOh Ajay, how everyone loved you. Ajay's a great professor, partly because he's really knowledgeable in all of the texts and partly because he hasn't lost his college student wit to him. \nAt first, he tries really hard to be as professional as possible, with not a lot of time spent on goofing around. Then you notice he wears cowboy boots all of the time, he plays trumpet and sings in a country band, and is obsessed with sci-fi and TV. We even watched \"Stark Trek: Wrath of Khan\" when covering utilitarianism.\nI enjoyed his class, but probably would've enjoyed it more if he loosened up a bit earlier in the year. One of the best, most dedicated teachers I've had at Columbia...that may also be because my Lit Hum professor SUCKED.\nWorkload:\nModerate to low CC workload. Take home midterm and final (Class Party during time when other sophomores are taking the final). 2 papers per semester (6-8 pages, not bad at all)\n"
        }
    ]
}