{
    "prof_info": [
        {
            "prof_name": "Shigeo Hirano",
            "prof_id": 5868,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Political Parties",
            "review_date": "January 09, 2017",
            "review_content": "\nThis seminar class was one of the first upper level classes I took in the Columbia political science department and really helped me develop my research skills. I initially felt overwhelmed since the weekly reading is a lot and often incorporates advanced statistics, but Professor Hirano was sooooo helpful. When I expressed my confusion about some material over email he created easy charts to present the information to me and the rest of the class the next day.  I had never done an original research project of my own and the object of the class was to create one. The class was small, only 12 people, and each week one of us was in charge of deciphering and presenting the readings. The main goal, however, was the end 25-30 page research paper. We'd each meet with him one-on-one to discuss our projects and the end product was something I was really proud of. Professor Hirano helped me at each part of the project from brainstorming what topic was feasible to research and incorporated my interests to editing my final draft. The class was awesome because I developed a greater understanding of how to do proper research, how to think critically about the research we read and evaluate problems within it, and how to develop a project that could be published and/or turned into a thesis. Professor Hirano can come across as a little awkward on first meeting, but he is so helpful and really wants his students to learn and succeed. He clearly enjoys teaching and it shows. \nWorkload:\nWeekly readings and online discussion, class participation, final paper 25-30 pages. no tests\n"
        },
        {
            "course_name": "Multivariate Political Analysis",
            "review_date": "May 03, 2012",
            "review_content": "\nIf you haven't taken and done well in Calculas I and taken Linear Algebra, simply do not take 4912 with Hirano. It it uses two text books: you cover ALL the material from the undergraduate probability course in the statistics department and use the textbook that the economics PhD students use in their three econometrics courses (Greene). So essentially two hardcore quantitative courses in one. It is simply too much material for one semester and it is taught by a real \"math\" guy: Hirano has real difficulty teaching this material in a way that most students easily get and he spends most of his time frantically scribbling equations at light-speed that very few of the students understand. Unless you have a very good foundation calculas, statistics, and linear algebra, don't take 4912.  \nI would suggest taking POLS 3704/4910 and POLS 4911 with Professor Robert Shapiro instead.\nThese course is designed to catch first semester political science PhD candidates up to speed on all the math and statistics they didn't do as undergrads. If you are an undergrad and are even considering doing a PhD in the social sciences DON'T TAKE THIS COURSE. Either (a) do the quantitative things whole hog and take Calc I, Calc III, Stats w/ Calc, Linear Algebra, (maybe) Statistical Inference, etc or (b) take POLS 3704/4910 and POLS 4911 and a few other non-brutal quantitative courses. 4912 isn't a fast-forward version of option (a). For those with no math/stats background, it is brutal, takes up your entire life, and you don't learn anything and for those who have already done (a), it is a tough refresher that brings all the pieces together. \nAs an undergrad, you don't want to take this course. For the graduate students, this is a make it or break it class: will they be a quantitative political scientist or not? Given the stakes, they work very, very hard and help each other all the time. You won't have the time to work that hard because you will be taking other classes you care about, looking for an internship, having a life, etc. Plus, you won't get the built in support network because you are a clear outsider, which really sucks and makes it tough to master the material. \nAvoid my mistakes! Don't take this course. It crushed my GPA and I didn't learn a damn thing. \nWorkload:\nIntense, very mathematical weekly problem sets. Tough midterm. Massacre of a take home final. I P/D/Fed this baby like there was no tomorrow! \n"
        }
    ]
}