{
    "prof_info": [
        {
            "prof_name": "Joseph Massad",
            "prof_id": 262,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "August 31, 2017",
            "review_content": "\nHe really blurs the line between facts and opinions, which gets on everyone’s nerves.\nMassad treats a lot of his course like a media appearance advocating for one side and berating the other. I can’t say he is as intense as some of his fans in the course who think everyone criticizing him is just trying to paint him as an anti-Semite, but Massad can be frustrating to work with.\nHe brings a lot of analysis to the course but much of that is skewed, something that wasn’t obvious to classmates of mine who were less familiar with the course material than I was.\n\nWorkload:\nLots of reading!\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "January 23, 2012",
            "review_content": "\nI had a much different experience than the previous reviewer.  I also had a different TA so that clearly had an impact.\nTo be fair, Professor Massad has many good qualities.  Whether you agree with him or not, he is a very engaging lecturer and he comes to class prepared to teach and answer questions.   I don't think that he is anti-Semitic, but he teaches the class thematically and skews his analysis disproportionately, in a way that leads me to believe, he is hoping that students will come away from the class agreeing with him.  I guess I don't really blame him, but it is important to point it out so people are aware.\nAll of that being said, he makes a lot of good points.  Unfortunately, he also says things that are incorrect (like factually incorrect) and leaves out certain details (for example, when discussing Operation Wrath of God, he told us that the Mossad was \"massacring the Palestinian intellectual class in the diaspora\".  What he left out, was that OWoG was in response to Black September's massacre of Israeli athletes at the Munich Olympics, and not just a random spree of assassinations.)  Although he later mentioned Black September and Munich, he never connected it with Israel's response.  He also enjoys espousing conspiracy theories (I mean I do too, but I'm not lecturing on behalf of a major University).  To be honest, some of the things he brought up are likely true, but he presents them as fact when they are not confirmed as such, and leaves out any sort of disclaimer.\nLastly, everything you read is analysis and not fact.  If this class were in the Anthropology department, I'd say it was excellent.  But, I think being under the MESAAS department, he should inject more historical facts, and not rely on the TAs to fill in the gaps.  \nI want to be fair.  I did end up learning a lot in this class, but I had to do a lot of work on my own simply to figure out the order in which things happened.  Also be on the lookout - you are occasionally expected to mention details on exams that were not mentioned in class.  I would recommend reading Benny Morris or another historian before taking this class just to get a handle on the history.\n\nWorkload:\nMurderous amounts of reading.  Two midterms and one final that are graded rather harshly but curved at the end.  It was incredibly unpleasant while I was doing it, but I think overall it was worth it to come away with the knowledge...\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "January 10, 2012",
            "review_content": "\nThis class was INCREDIBLE. If you only know a little about the Palestinian/Israeli  issue, you will leave this class knowing more than you could possibly imagine, as happened to me. If you know much about the issue, this class will provide you with incredible insight and resources to further cultivate your understanding and knowledge of the political and social background to the conflict. You will learn A LOT, regardless of how well versed you were in the issue before you took the class. \nProfessor Massad touches on all of the most important details of the conflict from its historical beginnings to our current day. He assigns readings that are super interesting and extremely informative. We were assigned readings written by Israeli, Arab, Jewish and Muslim scholars, and even read two novellas. Though Massad has come under scrutiny from Zionists for being biased in teaching this course, that is quite untrue. Just because he is a Palestinian professor does not mean he is incapable of teaching us material that puts the Palestinians in an unfavorable position when history points to that. We talked a lot about the incompetence of Palestinian leadership and a lot about Arab powers and their fluctuations in their attitudes towards the Palestinian question. Regardless of this, it is ignorant to call this class biased and illegitimate simply because Massad tells the truth about the atrocities committed on the Palestinian people. \nThough professor Massad is GENIUS and eloquent, he does tends to jump around during lectures in terms of dates, so try and keep a mental timeline of what events are taking place when. It might even be helpful to write one out. \nI highly recommend this class to anyone!! I took it to fulfill a gen.ed. but have become quite invested in the issue, and this class has also helped me shape my thesis for one of my majors. Though it was a lot of work it was really worth it. \n\nWorkload:\nThis class is INTENSE. We were assigned approximately 100 pages a week, but that easily increased throughout the semester. My TA (Cheryl Eve Leung who was amazing) assigned us 2 to 4 page essays due every week; she won't be TAing this course again, so workload in discussion section really depends on your TA. \nThere were 2 midterms and 1 final, which were pretty intense. They consisted of identifications and essays (for the midterms, about 7 IDs and 2 essays and for the final, about 15 IDs and 3 essays). In my experience, to do well in this class, you really have to keep up with readings and assignments. \n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "December 12, 2004",
            "review_content": "\nFrankly, I don't understand the hype. Issues of political bias aside, Massad simply wasn't a very good professor. His lecturing was scattershot and rambling, especially compared to Janaki Bakhle, who taught the first half of the class. For example, our lecture about (ostentiably) Saudi Arabia was around 20 minutes of discussion as to whether or not the author of our assigned reading was an Orientalist (a term you'll grow thoroughly sick of during the course)  and a good 45 minutes of ranting about Israel. He was perfectly courteous to me when I approached him after class with some questions that could be interpreted as an attack, which I appreciate greatly. However, that can't make up for the unfocused, rambling lectures and the bizarre nature of the readings. Can you imagine a class on abortion where the only assigned reading was Planned Parenthood pamphlets? Well, Professor Massad's only assigned reading on Zionism/Israel was the classic anti-Zionist work \"Israel: A Colonial Settler State?\" by Maxime Rodinson. The class started with the birth of Islam as if all of the important events that took place in the MIddle East--the rise and fall of the Persian Empire, the birth of Judaism, the birth of Christianity--hell, the birth of civilisation! paled in significance before Islam.  All in all, Professor Massad seems to be the darling of the Middle Eastern professors around the country, but I simply don't understand. Maybe if I take some of his other courses I'll see what the big deal is, but this intro course, in my opinion, was merely a disorganized, wavering series of rambles from a mediocre academic. \nWorkload:\nA decent amount of reading, one medium paper that you can expect a B or B+ on, assuming you've done at least half of the reading and have come to a couple of the lectures. Easy final.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "August 10, 2004",
            "review_content": "\nIn one word: wow. Like other reviewers, I came to this class thinking I would have to sort through extraordinary amounts of bias, but that was simply not the case. It's unfortunate that Massad has gotten a bad rep from a handful of students who don't like that he has an opinion different than theirs and can back it up with FACTS. I was constantly blown away by the way he could always, ALWAYS respond to an antagonistic question with facts. Yes, of course, he has his own opinions. I didn't always agree with him, but I always respected that he cared enough about the subject and was so knowledgeable. Massad cares deeply about what he's teaching, and you end up caring too. I can't say that for most of the classes I've taken at Columbia.\nBeyond his amazing lecturing abilities, Joseph Massad is incredibly nice. Everyone talks about his ego, but I was shocked when he stopped to talk to me in West Side early in the semester. He knows everyone and goes out of his way to have a chat with you, whether or not you actively participate in class. \nWorkload:\nThe usual amount of reading, but he covers main points quite well in his lectures. It helps to do them, though the midterm was fairly straightforward. One long paper which initially seems a lot more complicated than it actually is. Final was cancelled.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "June 19, 2004",
            "review_content": "\nWithout fear or favor (have graduated) and without any political axes to grind, I say without hesitation that Professor Massad was the best teacher I've had at Columbia or anywhere else.  I was lucky enough to have him for two classes (three semesters):  both CC and his Palestinian and Israeli Politics and Societies.  Perhaps more than anything, I admire and have been inspired intellectually by his unfailing, unflinching honesty about his own opinions and assumptions, and his equally unfailing and unflinching willingness to examine these opinions and assumptions with a critical eye. His lectures were uniformly fascinating, especially because it was obvious that he had complete control over the material -- he can field any question, and at a length that suggests that he's thought about it before. \nBut what made the lectures even more fascinating was his enormous interest in them -- both personal interest and intellectual interest (some digressions -- the result, it seemed, of his enthusiasm -- were often the most fascinating part of the lecture!)\nI know I will carry what I've learned from Professor Massad with me for the rest of my life -- both the content and the method.  -- And add to all this:  he's simply one of nicest people I know.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "June 11, 2004",
            "review_content": "\nProf. Massad is one of the best professors at Columbia. Always approachable and always kind to his students, Prof. Massad created an intellectually serious and open climate in the class. \nAt no point in the class did Prof. Massad ever compromise his unfailing opposition to racism, anti-Semitism and colonialism. It is unclear how this could not be entirely obvious to anyone who took Prof. Massad's class, unless they failed to complete the required readings or to attend the lectures and discussion sections.\nI strongly recommend taking any class that Prof. Massad is teaching, even (or particularly) if you are not majoring or concentrating in MEALAC (like myself) -- you will learn things in his classes that go far beyond their express subject matter. This is perhaps the most worthwhile class that I have taken at Columbia. \n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "June 07, 2004",
            "review_content": "\nMany students take offense at the very quality that makes Massad such a brillant academic and honest, effective teacher: he neither claims nor supports purported academic 'objectivity.'  He holds an intellectual conviction and offers rational, clear, and cogent arguments (supported with a wide-range of evidence including facts, figures, dates, and documentation) to support it.  One of the very first lessons learned is that it is impossible to show both sides of the picture.  Regardless of one's previous knowledge or bias on the topic, Massad forces the student to confront typical themes and at least question one's own beliefs by presenting the student with a broad base of pertinent and strong knowledge from his incredibly informative lectures, ranging from social, religious, and racial relationships and discrimination, to feminist issues, to historical development.  He doesn't  expect you to always agree with him and welcomes active debate in and outside of class.  Of course, the typical knock on Massad is that he often interrupts the questions asked by the students.  This critique is true, but is often engendered by students making arguments or asking questions that were clearly answered or addressed in the reading.  Massad expects the reading to be done and gets somewhat offended if it is not.  He is always available outside of class for his students; however, he changes his office hours quite frequently but always gives students ample notice and alternate times to meet, making him very accessible.  But most of all, he clearly cares about his students.  Outside of class, when bumping into students, he takes the time to see how they are doing, being truly inquisitive and caring.  He also knows each of his students; rather than just melting into the background as spoiled kids he must teach, he takes the students seriously and gives them the respect that many professors on this campus do not.        \nWorkload:\nThe reading is heavy: typically 150+ of academic reading/week (can get worse).  An easy mid-term with a few IDs and lengthier IDs (mini-essays?).  8-10pg paper and a final (which was cancelled).  Section attendance is mandatory and he and the TA's confer to make sure students are coming (they take attendance).  \n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "May 22, 2004",
            "review_content": "\nBased on previous reviews of professor and class, I think many students entered this course thinking that Massad would argue point by point why Palestinians are glorious and Israelis are monsters.   This wasn't the case at all - Massad took extraordinary care to critically examine each of the events that led to the current conflict and never offered a diatribe on how we should think.  Massad always presented facts, never opinion; those facts in turn were supported by the enormous amount of research assigned to us for our weekly readings.  Much of the research, which indeed is supported and accepted across much of academia, potentially contradicts positions that support much of Israeli government policy - this rankled quite a few auditors in the class - auditors who argued their opinions (unlike Massad) clearly without having completed the assigned reading, thus delaying, not enlightening, the class.  Prof. Massad never belittled any student for his/her opinions, nor did he ever silence a student in order to expound a view of his own: indeed, he never expressed an opinion of his own, instead trusting this class to judge actions based on fact.  Moreover, he demonstrated that criticism of Israeli government policy is not, and should not be equated with, anti-Semitism, which he, as any intelligent being, despises.  Massad's kindness and approachability allowed us to feel comfortable debating with him during class and office hours; his goal was for us to recognize fact, not to threaten our positions and opinions.  That this class was an eye-opener is, indeed, an understatement.\nWorkload:\nAbout 100 pgs. of reading per week, mainly from research articles; midterm; 8-10 pg. research paper; final (canceled this semester due to the TA strike).\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "May 16, 2004",
            "review_content": "\nProfessor Massad is, quite simply, the most influential teacher i've had at columbia.  Do not buy the \"brainwashing\" salvo you read below, but instead know that this is a teacher who's brilliance is unmistakable.  Take his class (any of them) if you want to be pushed to thought, to be stirred, to challenge little prepackaged ideas.  No differently than most other professors, he has a political opinion, but he refreshingly makes no efforts to hide it.  Anyone with half a brain will tell you that he does not marshall his will over his students, but instead allows for real substantial debate and discussion in class.  Come looking to think seriously about issues in the middle east like nationalism, zionism, women, human rights, and violence and Massad will not dissappoint. \nWorkload:\nTopics: 1/2 semester.  Heavyish reading.  1 paper.  1 easyish final\nPal/Isr.: Lots of reading (but great reading).  1 paper, midterm, final.  Final was cancelled for TA strike so no judgement.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 21, 2004",
            "review_content": "\nHe teaches a polemic, not an academic class, and abuses the position of teacher to rant at his students, offering little analysis grounded in anything resembling reality.  He won't engage in actual debate, instead changing the subject any time it looks like someone might pin down his having simply made things up.  He also barely mentions the CC books.  The syllabus might as well not have existed.  The fact that this man is allowed to teach at the university is a disgrace and tarnishes its academic integrity.  The problem isn't that I disagree with his views; the problem is that he seems to think he can just state them as facts, and anyone who disagrees is either stupid or part of some grand conspiracy.\nBy the way, he's Jordanian, not Palestinian.\nWorkload:\nTheoretically, papers, a midterm and a final.  Good luck writing about all those books you never discussed in class.  The only perk is that he not only shows up late, but usually finishes his ranting at least 45 minutes early, so classes are - thank god - relatively short.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "October 17, 2003",
            "review_content": "\nMassad is excellent.  But in my opinion many students in the class were prejudiced. They wereoffended that Massad would care enough about them to try to teach them that prejudice is nothing but ignorance.\nWorkload:\nmoderate/heavy reading easy final\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "September 15, 2003",
            "review_content": "\nA perfect example of brainwashing.  To teach grown people as if they were babies is a disgrace to the university.  He lets you know on the first day that he isn't going to gove you both sides to the conflict.  Can you imagine if a psychology professor declared that he was only going to teach the \"Nurture\" theory and assume that he was coorect and therefore the \"Nature\" side of the argument would be disregarded.?Massad should be embarrassed about what how he teaches (not to mention Columbia). \nif you do take the class (who wouldn't after hearing all the hype) try to research as much as you can before you determine that what you heard from Massad (or the out-of-print books he supplies for readings) contain any truth. \n\nWorkload:\nEnough reading to make you not want to read more on your own which you need to do to establish any credibility\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 03, 2003",
            "review_content": "\nI'm happy about my experience in CC.  The man is smart, a good teacher, and most importantly, kind.  He does take a left-of-center political stance on most issues but I was surprised to find that any mention of politics is almost exclusively used to make a point about the readings.  Whatever, I learned a lot and got my money's worth.\nWorkload:\nmedium to heavy\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "November 15, 2002",
            "review_content": "\nProf. Massad was arrogant and humorless. He was a bad language teacher; he put zero thought into the classes, made fun of our translations, and went straight from our (crappy) book. He might make an interesting professor for political science or something, but as a language teacher he was awful. His only qualification for teaching Arabic was that he speaks Arabic. In my opinion, he lied to us about word etymology, and if he didn't know something he it sounded like he would make it up, instead of researching the question and getting back to us. He obviously didn't care about the class. I notice that he has not taught Arabic for the past few semesters, but if he ever pops up as a teacher of Arabic, try to take someone else (like Taoufiq). \nWorkload:\nmid-range (translations and compositions two times a week)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 28, 2002",
            "review_content": "\nProfessor Massad has many and strongly-held beliefs and opinions, which you will certainly become familiar with as the year goes on. I loved hearing them, and they often changed my own before-unconsidered assumptions, though I concede that some people might not agree. But I always felt that he wasnÂ’t proselytizing nor showing off. I found his willingness to share and perhaps encourage dissenting opinions was enlightening because it is so rare among professors. The discussionÂ—led and sometimes deliberately provoked by Professor MassadÂ—often digressed, but I found that these digressions, usually involving modern applications of a philosopherÂ’s ideas, were some of the most interesting times in the class. My thinking has changed as a result of Professor MassadÂ’s CC classÂ—he encouraged us not only to question answers or conventions, but also to question and consider what is revealed in the questions themselves. \n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "May 12, 2002",
            "review_content": "\nI think, although it was perhaps the most difficult class to sit through at times, Massad's class is a necessary fixture in the mealac dept. I think he's a necessary fixture, too, ego and all. All you ever hear about the middle east is the israeli/american point of view, and he shows you the side of the story you never hear. I'm half-israeli, so it was perhaps more difficult for me than for most to listen to him constantly dis my country and refer to the mean and cruel Israelis, but in some respects, he has a point. He made me realize that there is no clear \"correct\" point of view on the situation in the middle east because both sides commit equally atrocious acts, and while he drained any hope i had of any kind of resolution over there, at least i'm not stupid anymore . . . definitely an educational experience, and i think people who immediately shut him out based on his first display of egotism should think twice and try to listen to him and weed out the pertinent information from the opinion. he's not lying. that's a ridiculous claim. every factual thing he says is backed up by documented evidence that is compiled in two giant thick packets of reading that cost a hundred bucks in total. \nWorkload:\nwe did one paper for the midterm and two four page papers for the final. topics were fairly boring and i didn't much enjoy writing them, but i had other crap going on at the time, so you know . . .\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2002",
            "review_content": "\nA bizarre experience. Massad, whose writings and lectures on the Middle East have made him the most controversial professor on campus, is usually brilliant and provocative. But he's always frustrating. The first semester of the course is a pretty stupid affair. The quality of the class varies greatly with Massad's level of interest in a particular subject, and he isn't interested in very much until he gets to Marx and Nietzsche. Our lecture on Thomas Aquinas, for instance, lasted about 20 minutes. You'll spend most classes wondering how an apopleptic rant about US Foreign Policy that relates only vaguely to Plato or Aristotle is supposed to represent the \"core\" of your Columbia education. Massad clearly tries to provoke his students into applying ancient philosophy to current events, but he takes a categorically anti-U.S. tack at every possible opportunity, and usually succeeds only at alienating his students. The second semester is much better, mainly in the second half when Massad's additions to the syllabus become the focus of the course. I'll never forget what he taught me about Fanon, Cesaire, Adorno, and Edward Said - but it was only at these moments when CC felt like the experience Columbia purports it to be. The class features no discussion, which is a shame seeing as how that's ostensibly the point of taking these courses in 20-person sections. Massad, in my opinion, is an egomaniac and entirely uninterested in hearing anything other than the sound of his own voice. I found his predilection for using his academic training to pick apart the semantics of statements made by his students horrifying. Do I regret taking Massad's CC course? I guess not. It definitely wasn't boring, and occasionally it was terrific. That's saying a lot for a core course, I suppose.\nWorkload:\n3 5-page papers, midterm, final. An easy grader overall; he's extremely lenient when you're writing about subjects he doesn't care for. The readings are pretty long in the first semester and absolutely insane in the second.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "May 02, 2002",
            "review_content": "\nThis was possibly the most offended I've ever been. Massad does not even pretend to give the entire picture, he states that on the first day. Besides being offensive, is it really worth it to take a class that doesn't tell you both sides of a controversy? I worry about the people who enter the class with little to no knowledge of the topic and form their opinions based on Massad's lectures and assigned readings. Massad also doesn't allow students to finish their questions before answering them. The class is taught unethically, and should be renamed \"Why Palestinians Hate Israel.\" In sum, it sucks to take a class and walk away not feeling like you can form an educated opinion. It also sucks when your professor, (in my opinion) lies and even after being proven wrong by students, continues to lie.\nWorkload:\nA LOT of reading, two eight to ten papers and a final. Don't believe him when he says the first day that there will be two five page papers, he's lying.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "September 15, 2001",
            "review_content": "\nHe's friendly, charismatic, and interesting. He's smart too. Really nice guy, presents some fantastic ideas (none of which are his, of course) that will likely change the way you view the world. Runs lectures like big class discussions at times, though he tends to cut people off. NOTE: While Massad is very smart and interesting, he is very opinionated and radically biased. Do NOT take this course unless you are prepared to filter what he says. Massad tells you as much himself, and if you learn from Massad in a constructive way, you will be much more able to learn from other Columbia scholars who are equally biased in less conspicuous ways.\nWorkload:\n2 5-7 page papers, easy final.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "September 04, 2001",
            "review_content": "\nHe might as well have cut through the bullshit and titled the class \"Contemporary Egyptian Civ\", because we didn't get exposure to any other culture within the class. The reading is interesting, mostly, particularly the literature. Like the Intro to Islamic Civ class, however, it is all heavily biased. The professor (and, shockingly, many of the students) tend to turn discussion sections into \"us vs. them\" blame game, where they list the west's various cultural crimes ad nauseum... not that it's not justified, but it's not really productive or interesting; if you're in this class, chances are you already know Europe and the US suck. It's a lecture course, but in an effort to make it a discussion class, Massad arbitrarily picks on people to answer questions that come out of the blue. If they aren't answered satisfactorily, he tends to just let the subject drop instead of elaborating or correcting. There's no context; one never gets a timeline of Egyptian history or politics, and so it's easy to forget which work is a commentary on which leader or movement. The spring 2001 class was blessed with TAs who made it all worthwhile, but all in all, there are better courses in the MEALAC dept.\nWorkload:\n2 papers and a final. Paper topics were rigid and dull, and Massad refuses to let students design their own topics. The final's a piece of cake if you've read things.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "May 02, 2001",
            "review_content": "\nOne of the best, most worthwhile courses I have ever taken. I came into this class knowing next to nothing about the situation in the Mid East, and now I feel like I have an intimate grasp of the history and origins of the conflict. Prof. Massad is a funny, engaging, and passionate lecturer and not afraid to criticize Israel rather vocally. As a result, expect many intense, but always polite, arguments between Massad and pro-Zionist students. From what I can tell though, he never lets his biases influence his grading, so you can expect fair treatment regardless of your political views. The one draw-back is the papers, which are basically a regurgitation of the readings and require no independent analysis or research. There was a lot of complaining about this though, so maybe he'll change it next year.\nWorkload:\nThere is A LOT of reading, but if you can keep up with it, it is generally interesting and helpful. Two 8 page papers.\n"
        },
        {
            "course_name": "Palestinian and Israeli Politics and Societies",
            "review_date": "December 31, 1999",
            "review_content": "\nWow, tensions were flying high in this class between Zionist- sympathizers and Massad (and, to a lesser extent, between Zionist-sympathizers and Palestinian-sympathizers). Massad is clearly pro-Palestine in outlook, and while some students find this troubling, others find it refreshing. His descriptions of the suffering endured by Palestinians make great scholarship -- but he seems unable at times to see why the Jews, in their own words, would support and perpetrate such horrible policies. I agree with Massad's stance, and I am glad to be able to take a class where the professor isn't afraid to condemn a country for chronic flouting of UN resolutions and international law. At the same time, the lack of zionist voices in the (generally mixed-quality, sometimes brilliant) reading list and the strict guidelines on paper topics (they steer you towards making Massad's own points) make this class not as thought-provoking as it should be. In all, most students were at least a little bit disappointed, though I felt this was because they felt frustrated having to learn the brutal history of Israel as fact, not because of shortcomings on Massad's part. The course may not be perfect, but in scholarly terms, Massad is after something real, and there is a lot to be learned if you go along with him -- even if you criticize him all the way.\nWorkload:\nOn the heavy side, though there is no midterm. Heavy reading packet in two volumes, which can be hard to keep up with, since Massad talks at length in class about most of the authors and their work anyway. 8-page paper; final exam.\n"
        }
    ]
}