{
    "prof_info": [
        {
            "prof_name": "Gania Barlow",
            "prof_id": 9580,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 24, 2014",
            "review_content": "\nGania was probably one of my worst experiences at Columbia. Lit hum was the thing i looked forward to least because it was such a draining, boring class. 2 hours felt like 2 days. Also, by the end of the semester, you don't feel like you've developed at all. I wouldn't recommend that you take lit hum with her. She's ok in terms of grading but her feedback is really useless. Honestly, if you could avoid lit hum with Gania, you should.\nWorkload:\nAs was mentioned by other posts. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 03, 2013",
            "review_content": "\nMs. Barlow is an excellent teacher. Although my class definitely seemed to have a lot more work than some of the other Lit Hum sections, I thoroughly enjoyed it and found the class interesting and education. In the Fall, we had weekly Passage Analyses that were each about 1 page long, but in the Spring she changed the format to online Wiki discussion posts/threads, which were less time consuming. The midterms were very straightforward, and her grading is fair. Her essay grading can be a bit tough, but if you participate and do well on the midterm and final you can get an A in the class even if you get B+/A- on the essays. The one downside is the amount of work, and not only did we read every book on the syllabus (unlike many other sections), but we even read an additional book. I would still definitely recommend this class.\nWorkload:\nWeekly Passage Analysis/ Wiki Posts, readings, midterm, final, 2-3 essays. Easy. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 10, 2012",
            "review_content": "\nLit Hum:  She is super nice and interesting to listen to.  She is very understanding as well.  On another note, she gives pop quizzes quite frequently.  She will work out a time to go over any work or questions that you may have, but she cannot explain what she would like from you very well.  She is a hard grader on essays and is not clear as to what she wants you to write about.  Her essay prompts are very confusing.  It is easy to get a good class participation grade.  \nWorkload:\nIn the middle.  Not too tough.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 13, 2011",
            "review_content": "\nI really enjoyed taking her class! I agree with the other person who reviewed, the class discussions really don't teach much- it really is just her asking some questions that very few people answer on what we read the night before. However, the papers she chooses for us to read are very insightful and I learned a lot from them. In addition, I thought the workload was very fair- about 1-2 pages of writing a night that are graded mostly on completion (if they're really well-written, they can raise the next essay by a third of a letter grade) along with four essays and rough drafts for the first three. \nIn terms of grading, I thought it was fair. In the interest of disclosure I did end up with an A-, but to be honest, I really didn't spend hours upon hours writing the essays. I probably could have gotten an A if I actually spent the right amount of time on everything instead of procrastinating until a day or so beforehand. Also, for the rough drafts, she gives a HUGE amount of feedback that is really helpful towards rewriting the final paper if you listen to her. I'd definitely take her class again.\nWorkload:\n1-2 pages of writing a night, three 3-7 page essays, one 1500 word reflection essay, and three rough drafts\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 04, 2011",
            "review_content": "\nDO NOT TAKE HER CLASS. \nI learned absolutely nothing from her teaching. To make matters worse, she's a hard grader, and does not give out A's. A- was the highest grade I heard of. She mumbles all of class and says \"ummm\" more than anything else. \nClass consisted of us \"discussing\" an article we had to read the night before. She would ask questions, almost no one would answer and then she would mumble and move on. \nTerrible professor, sweet as a person but don't waste your tuition money. And you'll have to actually work hard to do well. \n\nWorkload:\nFor every class we had to write at least 1 page of our thoughts. Not graded but still annoying. And normal 4 essays for the semester - hard grader though. \n"
        }
    ]
}