{
    "prof_info": [
        {
            "prof_name": "Tatiana Smoliarova",
            "prof_id": 2662,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 15, 2015",
            "review_content": "\nProfessor Smoliarova's Lit Hum class is one of the most enjoyable classes I have taken during my time at Columbia. She has no arrogance about her even though she is obviously brilliant. She requests the class call her by her first name, something not often done by professors. \nShe strikes a beautiful balance in the classroom of leading the discussion while engaging the class and having us chime in with what we think. She will keep conversation going but always wants to hear what we think.  \nI would take pretty much any class she is teaching because she is not just a teacher in the classroom but genuinely cares about her students and their concerns. If something is going on in your life she understands you and will work with you one on one to catch up with the material--without you even asking but with her approaching you. \nShe's an incredible teacher and an even better person. \nWorkload:\n2-3 essays of 6-8 pages. If you put effort into them you should be doing well in the class. A few pop quizzes which aren't too difficult. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2012",
            "review_content": "\nI was SO excited to have Tatiana after reading all the CULPA reviews about her and realizing I got lucky with my LitHum professor. I thought class was going to be exciting and discussions would be great and on top of that, it wouldn't be hard to get a good grade.\nThis thinking was a bit premature--because I was very very wrong about how classes would be. The same two or three people would talk each class (and they often grew annoying) and no one new ever volunteered. She's extremely passive and doesn't really call on people to do anything except when it comes to reading passages from the texts. Thus, as you can imagine, she's awful at facilitating discussion. She asked vague questions that didn't really lead to any substantial discussion and I feel that I ultimately got very little out of the class. She often spent at least half of the two-hour class lecturing on the background and the historical context of each text (which is valuable but when you only get two classes maybe to discuss a text it's really not a focal point whatsoever). \nIt's true that the class is easier than other LitHum classes (possibly--I wasn't ever in a different LitHum class so I have no basis for comparison), but I think this was incredibly detrimental to the class. After students realized that you basically didn't have to do any of the reading and could skim Sparknotes for an hour a week and still probably pull an A- in the class, there were just such low expectations for the class that basically no one did the reading (made the lack of participation even more pitiful), students slept in class and she didn't call you out on it (unless you slept every minute of every day), students always had their laptops on and clearly were not paying attention, basically the entire class was checked out (save for the two or three people mentioned above). This is not what a discussion class should be, and certainly not what a Core class should be.\nPersonally, I did maybe half of the reading (less and less as the year went on). I wanted very much to get a lot out of this class, because I think having this literary background is very useful, but when you don't need to do the work to do well in class, and you have so much other work to do for other classes/extracurriculars that you actually do need to do, this class is just not a priority. And if everyone thinks this way because the professor has allowed the students to do so, then the class just becomes a joke.\nSo in case I haven't been clear: the class, simply put, was boring. I got virtually nothing out of it, and most of what I did learn was simply from reading the texts. Tatiana is incredibly nice and sweet, but that doesn't make her a good professor. She wasn't interesting and she was unsuccessful at engaging with the class. If you have her, stay in the class if you're not looking to put a lot of work in or get a lot out of it, or if you hate reading or something. But if you're looking to really learn and you were excited as an incoming freshman about the Core this is one class I do not recommend. I guess I'd still go to the first few classes and see what happens. Maybe your class will be better than mine (the lack of participation was of course not entirely her fault).\nWorkload:\nCouple papers each semester (2-3?) usually somewhere between 4-6 pages, graded probably the easiest out of everything\nSuper easy midterm (made by her) and not bad final (coursewide) each semester\nEmail her the equivalent of a \"discussion post\" or \"discussion question\" for each text \nShe sometimes gives quizzes (like a couple each semester) and asks for really obscure things (like character descriptions and dates that books were published, not quote IDs or things other professors do)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 11, 2012",
            "review_content": "\nI am sure there are other people out there who think that their LitHum teacher is better but Tatiana is the ONE AND ONLY best LitHum teacher you can wish for. For some lucky reason I ended up in her class and it was a blast. As long as you do some of the reading (which she doesn't have much control over since it is dictated by the core) and show up to class you WILL get an A (or even A+) in her class. If you are lucky enough to have her then keep her and if you are looking to switch into her class, DO IT. She is cute, intellectual, witty, kind, and an absolute genius. You come to realize how fucking smart she is but you never feel intimidated or looked down on. Have fun!\nWorkload:\nA few quizzes now and then (usually if she feels that a majority of the class is not doing the reading she will add some more quizzes), about 5-6 papers over the year, midterm, and final. Easy grader if you put in some effort. Will make you ask a question about the reading once a week in an email.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 12, 2010",
            "review_content": "\nShe is an amazing teacher!\nShe is the sweetest, most caring teacher you will ever find at any university. Using funny personal stories about her son into Greek Literature, she captured the attention and love of the whole class. She was so dedicated that even after being 9 months pregnant, she came to wish us good luck for the final exam!\nThe essay topics are very general and easy. \nAlso, class discussions are very interesting and the two hours pass by very soon.\nIf your in her class, celebrate! \n2-3 4-5 page essay. Very very fair grader!\neasy midterm and year wide final, both fairly graded.\nWorkload:\n2-3 4-5 page essay. Very very fair grader!\neasy midterm and year wide final, both fairly graded.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 28, 2008",
            "review_content": "\nTatiana is by far the best professor I've had this year. As has already been said, she comes off a little shy at the beginning of the school year, but she slowly breaks out of her shell and turns this class into one you will remember forever (no joke). \nShe is the cutest, nicest, and smartest professor you may have at your time here at Columbia.\nShe speaks like 5 languages and always provides insightful and meaningful context to the novels that we read. However, she is not one of those brooding intellectuals who holds their knowledge over your head and makes you feel bad about yourself, but rather she encourages class discussion and is always willing to listen to your dialogue (unless it's just plain stupid). \nYou cannot ask for a better professor to get you acquainted to Columbia. Her great stories about her son and Soviet Russia will bring you back to class every single meeting.\nPut quite simply: My class and I have the deepest affection for this professor and would take her over again in a second. \nWorkload:\nWe tend to go at a slower pace than other LitHum classes, but we somehow make it through the whole syllabus. \nThere was a total of 5 papers in the year and around 5 quizzes as well (simple date quizzes and passage analyses). She is a fair and understanding grader. She does not want to make life hard on you.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2007",
            "review_content": "\nTatiana is a really wonderful professor.  She was a little shy at first, but when she was comfortable with the class she was funny, insightful, and very engaged with the students.  Although the historical background and general review of the works could become a little lengthy (probably used somewhat to avoid the awkwardness of lack of student preparation), they were pertinent and helped to contextualize the works. \nDespite the pace of the syllabus Tatiana somehow managed a good amount of in depth analysis of pretty much all the works.  Her little insights to the works and to the syllabus as a whole were golden, promoted some interesting class discussion, and motivated me to actually read the texts, and to read them with more acrity.  \nWorkload:\n3 papers a semester, about 5 pages each--VERY easy grading, ocassional quizzes on dates and concepts (just memorize them right before...also, these grades don't really count, they're to help for the exams).  From what I understand, Tatiana gave us much less reading than other Lit Hum instructors typically do, but we cover everything for the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 20, 2006",
            "review_content": "\nTatiana is absolutly amazing! She is cute, hysterical, very devoted, and extremely insighful. she tells amazing stories about her soviet childhood, is very humble and is always trying to learn new words from students, and has very interesting ideas when it comes to the work. If you have the chance, take her one hundred percent! \nWorkload:\nLight. Two papers, graded fairly easily. Standard midterm and Final. A quiz or two, easy as well. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 20, 2006",
            "review_content": "\nTatiana is absolutly amazing! She is cute, hysterical, very devoted, and extremely insighful. she tells amazing stories about her soviet childhood, is very humble and is always trying to learn new words from students, and has very interesting ideas when it comes to the work. If you have the chance, take her one hundred percent! \nWorkload:\nLight. Two papers, graded fairly easily. Standard midterm and Final. A quiz or two, easy as well. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2006",
            "review_content": "\nF***ing awesome.  Take Tatiana's class.\nWorkload:\nLight.  Extensions on papers, easy quizes (that don't even count), straightforward exams, no attendance ever taken.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 02, 2006",
            "review_content": "\nTatiana is really nice and makes it a great class.  She goes on tangents and tells stories all the time, which makes the class pretty enjoyable.  She knows her material well, and comes very prepared to each class.  Sometimes she asks questions that people don't know, as Lit Hum requires an enormous amount of reading in a short period of time, so small details are usually not remembered.  Unfortunately, Tatiana thinks we may remember it.  However, she doesn't actually hurt you for not knowing - the midterm and quizzes are relatively easy and require a knowledge of important part of the book/play.  The papers are not too bad - many options for topics are given, and she is willing to meet with each student to help him/her out.  She is also very understanding about deadlines.\nWorkload:\nMidterm, 1-2 quizzes, 2 papers, final.  Discussion Q for each book. Midterm was pretty easy, as were quizzes.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 20, 2005",
            "review_content": "\nTatiana is wonderful.  Her nervousness and accent were a little worrying at first, but both were soon overcome.  Her passion for the classics (as well as her ability to read the texts in the original greek) allowed her to be a phenominal lecturer.  At 9 AM, this is truly a feat.  There isn't as much class discussion in this class as there could be, but this might have been more because of the 9 am time slot than anything else.  Tatiana grades fairly and is always willing to meet outside of class to discuss papers, class, or just to chat.  I am planning on taking more literature classes with her, and I would strongly recommend Tatiana to anyone looking for one of the better Lit Hum teachers.\nWorkload:\nLight to Medium.  All of the readings (as with any Lit Hum class), 2 short quizzes, 3 short papers, midterm, & final.  She makes the midterm and quizzes in the same format as the standardized final, so she prepares everyone well.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 18, 2005",
            "review_content": "\nTatiana is wonderful!  Her teaching style leaves a bit to wish for, in that there is relatively little class discussion.  However, this is made up for by her obvious passion for classics, and her occasional tangents are generally interesting.  She's fun during class, she's understanding with deadlines and is a fair grader.  \nWorkload:\nFair: 2 papers per semester, in-class midterm and final.\n"
        }
    ]
}