{
    "prof_info": [
        {
            "prof_name": "Sandeep Juneja",
            "prof_id": 2617,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "W4150 Introduction to Probability and statistics",
            "review_date": "September 08, 2005",
            "review_content": "\nI took this class with Professor Juneja over the summer, and I must say he's the best professor I've had in years. He's normally a professor in India but does summer stints each year at Columbia. He's very intelligent, kind, laid back, and receptive to student questions, however dumb they may be. He stretched my personal limit for mathematical density with nitty gritty proofs, but I was better for it. My only pet peeve with his lecture style was his tendency to erase stuff on the board before people have had a chance to copy it down. \nRegarding the material, don't ignore the calc prereq. The way the material is presented, you don't actually see calc until the second term, but all of the sudden you're asked to do integration by parts and other BC calc type problems. (I felt sorry for the poor soul in the front row on the first day of our work with integrals who raised her hand, pointed to the integral symbol, and said \"What's THAT?!\") Prof Juneja really knows how to get your interest though by tying things into real world problems. He levels with you that the stat part of the class toward the end is much more boring, and he's right. Still, everyone with a science background should have some of this stuff. \nWorkload:\nWe had 5 problem sets. In the beginning they weren't to bad, but they got more difficult later. Also, he fell a little behind and had to squish a lot of material in at the end. The last problem set had as many problems as the previous 3 combined, and they were only given to us about a week before the exam, so it required some serious cramming.\nUnless your good at tricky math problems that require you to see shortcuts, the tests are very hard. The averages for the midterm and the final were about 60%, but it was curved up so the average was in the B+/A- range. This was reasonable, because Professor Juneja prefers to give you problems that really make you think rather than questions that are simply obvious if you know the material. If you think you did awful on the exam, don't drop the class until you find out the average.\n"
        }
    ]
}