{
    "prof_info": [
        {
            "prof_name": "Brahim Kerkour",
            "prof_id": 2767,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "July 09, 2010",
            "review_content": "\nI love Brahim!  He made music hum so stress free and fun!  The material is pretty dry/simple at times but he really tries to make it more interesting with anecdotes/a lot of audio demonstrations.  He is a composer himself and you can tell he is really passionate about music (always makes class more enjoyable).  Also his accent is pretty soothing too (he's from Morocco).  I think what I like most about him is that he never made anyone in the class feel dumb so everyone felt at ease to ask questions.  At the same time he offered more complex ideas for those who did have some background in music.\nWorkload:\nExtremely light - about 20 pages of easy reading per week.  Free form concert report, very easy/fair midterm and final.\n"
        },
        {
            "course_name": "Ear Training I",
            "review_date": "January 23, 2008",
            "review_content": "\nBrahim's pretty awesome, not going to lie.  He does teach a lot of ear-training, but you also learn about cool things like microtones and spectral music along the way.  Always arrive early, and ask questions - he tended to get into these interesting and fabulous tangents.  I think I learned more from the tangents than I actually did in the class.  Very cool guy and great teacher - I highly recommend him.\nWorkload:\nThe occasional homework.  One midterm, one final.  Lots of participation.  Come to class and ask questions occasionally, make sure you know what you're doing, and you'll be fine.  It's not hard to get an A.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 23, 2007",
            "review_content": "\nThis is a tough review to write because I like Brahim a lot. \nHe has a genuine passion for the subject and it shows, at times itÂ’s even infectious, but when the exams came around I often felt like he could have done more to convey the information he wanted us to know. Unfortunately he can be one of those professors who teach you something AFTER you see it on the exam. HeÂ’s a gentle grader on the concert reports and the paper but frustratingly harsh on the exams, often marking you off for things that could go either way and not giving you the points when you go talk to him later and clearly exhibit that you know the material. I would say that you should find another professor but everyone in the Music Hum department seems to be lacking in one significant respect or another. \nYou might as well stick with Brahim unless you have a line on another really good teacher for this class but be prepared for surprises and take good notes. Talk to him after class if youÂ’re unsure about something and spend A LOT of time listening to the crappy music particularly in the second half of the class when it gets harder to differentiate between some of the symphonic styles. He gives out stuffy guides for the exams, if he teaches the course like he did with us follow the first one to the letter, plan on exercising a broader knowledge of concepts on the second (a lot of people got tripped up on the second exam because they were expecting something like the first one) and a combination of the two for the final. DonÂ’t sweat the papers so much, just write what you genuinely think and pick something you enjoy. Overall, this class kind of sucks but thereÂ’s no way around it and you could do worse than Brahim. \nWorkload:\nPretty much standard. Light reading but lots of listening to music you may or may not enjoy (if you donÂ’t like it youÂ’re SOL because youÂ’ll have to listen to it anyway to do well in the class). (2) concert reports, (1) 5-7 page paper, (2) mid-terms, final exam.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "October 17, 2006",
            "review_content": "\nBrahim was great!\nHe was one of the best teachers I had. He tried to engage us with music and provided creative materials (how art and music go together, how elec-music is made, etc)and musical background to help us understand the course better. He doesn't try to push or voice his opninons over others' and the students were free to talk and discuss about how they interacted and responded to the course material. \nHe teaches with enthusiasm, is very well-prepared, tries to take care of everyone in class and is very very fair. \nThe course gets a little dense and dry towards the end, but is tolerable. There is a midterm and areview_content. review_content sheets are given out before the exam, and the IDs only come out from the reivew sheet-with an extra credit ID that isn't on the sheet or wasn't covered in class.\nWorkload:\nLight reading and listening, one midterm, one final, one concert report and a research paper.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 27, 2006",
            "review_content": "\nBrahim is an awesome Music Hum professor. He is really easy going and makes the class very low-stress. Made everyone comfortable in voicing their opinions. His tests and assignments were fair and he didn't grade too harshly. \nOverall a really fun guy to take Music Hum with.\nWorkload:\nTypical Music Hum: light reading and listening before class, 2 papers, midterm and final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 17, 2006",
            "review_content": "\nBrahim is a very friendly and easygoing guy, who you can talk to about anything.  He's young, but he treated the students with professionism and respect, and was sometimes funny.  I did not like the material in the class, but he tried to make the class interesting and stimulated class discussions.  He's not very eloquent in his speach and almost every other word is \"um\", \"ok\", or \"alright\".  I once counted over 500 um's in a period.  It was annoying at first, but you tend to stop noticing it after a while.  His exams were very fair - they covered only listening identifications and essays.  He did not make us memorize small details about the exact structure of every piece, which I heard some other Music Hum teachers make students do.  Overall, he's definately one of the better teachers to get for Music Hum and the workload for the class was pretty light.\nWorkload:\nMostly just reading and listening assignments.  Very few written assignments.  A very general 3 page concert report where we  can write about any classical music concert/opera and a 6-8 page research paper.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 29, 2005",
            "review_content": "\nBrahim is a really good Music Hum teacher. Very enthusiastic, organized, and well-prepared.\nWorkload:\nStandard Music Hum: light reading, concert report, 6-8 pg research paper\n"
        }
    ]
}