{
    "prof_info": [
        {
            "prof_name": "Olivier Sylvain",
            "prof_id": 3233,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 24, 2007",
            "review_content": "\nProf. Sylvain is one of the better teachers for CC that I've had. He's very straightforward, and not very strict, two things that really appealed to me. He's not going to bs his students by commenting on the \"flowery\" language or some other literary nonsense- but rather he goes straight to the point of the text, which I found to be quite refreshing from my lit hum teacher. Great experience in CC with the guy.\nWorkload:\nHe grades pretty easily, 3 essays, and the midterm/final. Midterm and Final can be difficult by the number of ids he put on, but if you do your readings, you're fine for the class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2007",
            "review_content": "\nProfessor Sylvain is a truly amazing CC professor!! His lectures are an absolute necessity to make some of the material make sense. He can be demanding but understanding about the difficulty of some of the texts and sympathetic to the amount of work that students get from other classes. He also encourages participation and is always willing to help; he wants you to think outside the box on papers and in discussion but also provides guidelines as necessary :)\nClass:\nProfessor Sylvain always writes the key points on the board as students arrive. The classes (almost) always begin with a bit of history about the author and the background of the text itself. After that, Professor Sylvain usually does a thorough review of the main points, highlights, and explicates as needed. He always asks for questions and tries to encourage discussion as he is explicating. Usually we begin to discuss before he gets through the explication but sometimes we spend the latter half of class discussing (after we start to understand what the author of the day is actually talking about).\nParticipation:\nCW and in class count for about 25% of the grade or so. Self-explanatory.\nThe tests:\nOne midterm and final, as is standard for CC. There are three sections: IDs, passage directed questions, and one long essay. They are very fair tests: Professor Sylvain will only test ID's that have been covered in class or are astoundingly similar; the essay topics are usually also overarching themes that you have discussed...a lot...He will also hold review sessions that are very helpful a few days before the exam. (Oh, and he curves when he feels it necessary, which has been every time in my experience...)\nThe papers:\nThere are three papers, between 1000 and 1500 words usually, counting for a total of 35% of the grade. Professor Sylvain always gives recommended topics but always is open to you creating your own, so long as you run the topic by him. Very fairly graded with much helpful commentary :)\nAll in all, this class is absolutely amazing! I may be biased because I loved CC but I think that it definitely had a lot to do with the fact that I had Professor Sylvain. He put in a lot of unique readings that really helped tie the entire course together. \nPrepare to do the work; if you put in a lot, you will also get out a lot! :) I hope you love the class as much as I do.\nWorkload:\nLots of CC reading. Midterm, final, three papers. Prepare for a few hours per week of reading (sometimes less) and of course, requisite hours for papers and exams.\n"
        }
    ]
}