{
    "prof_info": [
        {
            "prof_name": "Rebecca Calisi-Rodriguez",
            "prof_id": 12985,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Animal Behavior",
            "review_date": "November 09, 2014",
            "review_content": "\nNot a great professor, but she might get better as this was her first time teaching. At first she seemed incredibly cheerful and bubbly and I was excited to be taking Animal Behavior with her, but there are two main issues that quickly became apparent during this course.\nFirstly, her email policy is a bit unreasonable considering how hectic Columbia/Barnard student schedules are. Although she repeatedly prides herself on being accessible, I found her policies strange and her behavior overall inaccessible. She would only look at emails made to set up meeting requests, and ignore any other questions, comments or concerns sent via email. This alone is not the worst policy, but I found that when I tried to talk to her after class she would often just tell me to set up a meeting with her, and when I tried to set up a meeting with her via email she would refuse to schedule a meeting between us since I am at work during her normal office hours. In a particular email in which I was trying to find a time to meet with her to review an exam after she had denied an initial meeting, she got a bit combative with me, which I found unprofessional. Other students may not have had such experiences, but as a particularly busy student I did.\nSecondly, her exam grading policies were absurd. On the first exam she would give us a short (maybe 3 inch?) line on which to write 2-3 sentence responses, and then clarified halfway through the test that any parts of answers not directly on the tiny lines would not be graded at all. The second test was better after complaints from students, and hopefully she will not do this in the future. \nThe material is the only saving grace of the course. Calisi does know her stuff and the lectures are generally enjoyable and interesting. The material itself isn't too challenging especially after taking intro level bio, and I liked the research-driven focus of the textbook and of the lectures. Calisi's passion for animal behavior is certainly commendable, but the strictures and rules Calisi has set up for her class are not. Although I was disappointed in her this semester, I think in the future she may be a better professor.\nWorkload:\nReasonable. 1 Chapter's worth of reading per class, 3 exams, and a final project in which we have to record the behavior of a wild animal for 3 minutes and create an ethogram for their behaviors. The only frustrating part of this project is that, unlike past semesters of Animal Behavior, we can not go to any zoo or aquarium for this assignment, meaning that you are limited to the \"wildlife\" of NYC (ie squirrels).\n"
        }
    ]
}