{
    "prof_info": [
        {
            "prof_name": "Todd Gitlin",
            "prof_id": 1934,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 25, 2012",
            "review_content": "\nI absolutely loved this class and would highly recommend him as a teacher. Being an Econ/Math major, I didn't expect to be particularly interested in CC, however Todd Gitlin made the class enjoyable with his keen insights and ability to explain the material. Oftentimes in my notes, I would simply quote him verbatim. He likes to hear himself talk, so if you like rigorous class discussion, he may not be the teacher for you. That being said, he does not discourage discussion at all and is respectful and courteous to comments/questions.\nHe is understanding with exertions and not a difficult grader. He uses a point system and it was easy to get 24/25's on his papers (especially if you argued for a view he would probably agree with and could articulate it eloquently). \nAll in all I enjoyed this class. I never once did the reading and yet arguably know more about CC than most of my friends. He is truly a brilliant man and relates the readings to current events or his own interesting stories.\nTAKE HIS CLASS\nWorkload:\nthree papers (3-5pg, 5-7pg, 7-9pg)\nmidterm (easy)\nfinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2009",
            "review_content": "\nIf you are taking CC with Todd be aware that he runs an almost purely lecture-based class. Most days he solicited one or two questions which he answered thoughtfully and extensively but there was rarely any sort of dialogue. If you are expecting to discuss the course material you will be disappointed. \nThat said, Todd is a good speaker and usually contributed significant insight into my understanding of the texts. Just know what you are getting into. \n\nWorkload:\nThree papers, each of increasing length, and a shit-ton of reading. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 27, 2008",
            "review_content": "\nI HATE HIM.  Not good for discussion.  Blew me off for two meetings I scheduled with him.  Gave me a horrible grade on a paper JUST because of three minor grammar errors.  Also, he's an arrogant bastard.  He talks forever in class, and if your questions don't apply to his prepared notes, he WILL ignore u.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 19, 2007",
            "review_content": "\nThe man, the legend...seriously, do not miss the chance to take CC with this man. He's a great lecturer, and he was really open to student comments. Discussions kind of waned in the second semester, but Gitlin discusses details that were interesting. I think over time we just wanted him to speak for the whole two hours.\nVisit him during his office hours, and he'll be totally willing to sit down and discuss whatever, even if it's unrelated to the class. He's also quite understanding if you need an extension on something.\nYou don't need to do your reading. Just participate. There's just too much to attempt to try it all.\nWorkload:\nthe usual CC workload (so really intense), three papers a semester (differing lengths), midterm exam, final exam \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 19, 2007",
            "review_content": "\nThe Man, the Myth, the Legend. Only those words can describe TG and his infinite wisdom. Gitlin is wonderful, knowledgeable, and extremely helpful if you don't understand the material or need help with a paper. \nWhat made this class great for me was that he actually spends twenty minutes at the beginning of class giving us some context and explanation of the argument in the work at hand--a blessing for anybody who has never studied philosophy before. He honestly wants to make sure that everybody understands the material and cares about students. \nBe aware: he is a little bit of a tough grader (I'm guessing in large part due to being a high-up professor at the Journalism School). He'll catch every mistake and flaw in reasoning. Also, be prepared for quick turnarounds with papers which are usually assigned only a week before they're due. \nIn short, he is certainly one of my favorite professors I have had. He's the type of prof that you can go to his office hours and just talk about life for an hour or so.\nBe thankful if your CC Professor is Gitlin!\nWorkload:\nMidterm and Final (in class), three papers with a choice from pre-written topics increasing in length (3-5, 5-7, 7-9)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 18, 2007",
            "review_content": "\nIf you have Todd Gitlin for CC, consider yourself very lucky. He's possibly the smartest person I've ever met, he truly enjoys teaching undergrads, and he will help you get a lot out of the reading even if you're not always prepared for class. He spends a lot of time lecturing, which turns out to be amazing because he is exceptionally lucid and articulate in his analysis. He is adept at talking about any text, and his commentary was so well-structured and thought-provoking that I found myself wanting to quote him verbatim in my papers. Besides the fact that he is an amazing lecturer, he's also a very understanding instructor; he didn't mind giving the occasional extension, and he was always willing to meet during office hours (and he usually responded to e-mails promptly). I learned so much from this class, found myself engaged by texts that I wasn't even expecting to get through, and am very much looking forward to taking another class with Professor Gitlin in the future. His class is simply one of the best CC experiences you could ask for.  \nWorkload:\nThree papers of increasing length (the longest was 7-9 pp.), all graded fairly, although you have to put in a good deal of research and thought to earn the coveted A. His midterm and final consisted of IDs and an essay; the IDs were fairly basic, although they required pretty thorough explanation if you wanted full credit, and we were asked to create our own essay topics for the final (we had to meet with him to confirm that our topics were acceptable beforehand). The reading could sometimes be a bit much, but Professor Gitlin was understanding and would pare it down if it seemed like too much. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 21, 2004",
            "review_content": "\nQuite simply the greatest catch possible for a CC professor. Todd Gitlin has it all--charm, wit, and a knowledge base so deep you could drown in it. Majoring in Mathematics as an undergrad, PoliSci as masters, then a double PhD in Sociology and Journalism, Gitlin is so well-read and brilliant, you will quickly be blown away by having a professor at the best Journalism school in the country sitting down to talk about Plato and Machiavelli.  In class, if you feel even slightly interested in the material you are reading, his class will be incredible. If you choose not to participate, Gitlin won't call on you. Class has ups and downs., but usually they are fantastic. A warning though, if you say something stupid, Gitlin usually pauses, and ignores what you just said. It's really funny, but usually he doesn't indulge pointless conversation because he truly believes in this class (he volunteers to teach it).  Outside of class, Gitlin is happy to sit and talk with students. Stop by his office and share what you are thinking, whether it's about class, politics (he is acutely aware of american politics and a heavy hitting liberal),  or just something in your life. He will be happy to give you advice. MAKE USE OF THIS MAN, THERE ARE A HANDFUL OF PEOPLE IN THE WORLD LIKE TODD GITLIN. \nWorkload:\n3 papers per semester, mid term, final. all easy grading, but remember he's a journalism school professor--if you stray, he will pick up on it.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 12, 2004",
            "review_content": "\nA special catch, Todd Gitlin is a professor of Journalism at Columbia's prestigious journalism school.  He is a Larry David look alike with a smile that could cure the world of polio.  He cares as much about  himself learning from the contemporary civlization texts as he expects his students to do.  Professor Gitlin's essential base of knowledge is so wide and deep (phd in sociology and journalism M.A in political science)  that he makes up for many of the core texts he admits to having never read before teaching the class.  As a result, Professor Gitlin's class wavers between thought provoking explanations and standard speculation.  Some of his classes fly by while others fall flat.  Much of it depends on what he knows and what he thinks he knows.  Nevertheless, Professor Gitlin is always open to challenge from students and he constantly challenges them through the socratic method.  Outside of class he always makes himself available and is eager to learn about his students ambitions and concerns.  A relatively new professor at Columbia, one can sense that he is estatic to be here.  \n\nWorkload:\n4 papers.  Easy grader.  Midterm and final are fair and easy\n"
        }
    ]
}