{
    "prof_info": [
        {
            "prof_name": "Homa Zarghamee",
            "prof_id": 12702,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Econometrics",
            "review_date": "December 15, 2016",
            "review_content": "\nHoma is extremely good at expressing content clearly and concisely. She states the important points in a few different ways such that the material becomes ingrained. She is also just very agreeable, funny, and down to Earth.  \nThe course was structured such that the important information was streamlined and the less relevant/more convoluted material was left for a later course. Someone who already has some background in econometrics therefore might find it pretty easy, while anyone who is trying the subject for the first time ends up with a very firm understanding of the most important concepts/methods. If you are especially looking to learn R, this course won't provide you with any incentive structure but might present an opportunity for you to do so according to your own motivation. \nThe replication of an actual study that utilized econometrics was pretty tricky for most people (our data set was partially in Dutch, for example) but Prof. Zarghamee was very understanding if a team had put in a significant amount of effort but ran into trouble. She is generally extremely helpful. It is important to note that this is the first time that the class was taught with R instead of Stata, which would inevitably have an impact on the difficulty/plausibility of the assignment.\nAll in all, she made it was far more interesting than I expected it to be. It obviously dug into some more technical aspects of the major. I only wish I had tried econometrics sooner. \nWorkload:\nWeekly problem sets graded for effort\nMost people found the (1) midterm difficult, but it had a nice curve- learn all the formulas. All of them. \n1 major replication assignment accompanied by a presentation (done as a group, split up work as you please) \n1 small assessment of internal/external validity\n1 Final \n\n"
        },
        {
            "course_name": "Economics of Gender",
            "review_date": "May 13, 2015",
            "review_content": "\nIn spite of the sterling reviews this professor has received I venture to guess it has more to do with the fact that you can get an Econ credit by reading a measly few NYTimes articles per week. \nThis teacher is unresponsive, apathetic, and, frankly in my opinion, just really, really lazy. She never responds to emails even when she has not sent out the time and location of the exam the day before the exam--leaving her students wondering where in the heck they're gonna take their final! Most classes during the week (at least one lecture per week) consists of literally going through the homework problems one at a time (hint: these are not the sorts of questions that require this level of review). \nFairly easy grade by Econ standards...but really this is only an indication of how little this professor cares. \n\nWorkload:\nhomework + midterm + final\n"
        },
        {
            "course_name": "Economics of Gender",
            "review_date": "April 23, 2015",
            "review_content": "\nAwesome Class!!! If she teaches it again TAKE IT!!! She is an amazing teacher and is really engaged in the material.  She definitely knows her stuff. This is a great econ elective to take.  The work material is the lightest of all econ classes.  Homework is graded on a check/no check basis so if you do it, you get full credit.  The Midterm was literally straight out of the book.  If you come to class and follow in the book, there is no reason you shouldn't get an A.  This class could be difficult for those without a background in econ but don't let that intimidate you from taking it, it's totally manageable! Awesome class and awesome professor.  Take it! You won't regret it!\nWorkload:\nSuper Light\n20%-Reading Responses. Super light, and really interesting articles.\n10%-Interview a family member about topics covered in class\n35%- Midterm. If you read the book and went to class then it was cake. Also fair grader.\n35%- Final. Final is not cumulative, just a second midterm pretty much \n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "April 28, 2014",
            "review_content": "\nAMAZING CLASS, AMAZING PROFESSOR. Her first semester teaching at Barnard her class had  30 people in it, two semesters later and it had to be capped at 100. She is the best thing to happen to the Barnard Economics Department. She is exceedingly clear, brings the material to life, ingrains the concepts so deeply that you begin applying them to everything. Not only is she incredibly approachable and really wants to see her students succeed, but she is also just a cool person at large - she has been recognized for some remarkable research she has done and continues to do a lot of additional work each semester. TAKE HER CLASS, it is the best thing I have done in my time here. \nWorkload:\nSame as below \n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "December 21, 2013",
            "review_content": "\nProfessor Zarghamee is a gem! Grant this women tenure immediately, Barnard/Columbia!! She is a great addition to the Economics department. Not only is she a highly intelligent and wonderful professor, but she is also warm, funny, kind and approachable--like someone you'd want to grab a beer with after class.  \nShe conveys all the concepts of Econometrics in a very crystal clear and concise manner--and she even provides class notes that highlight the main points of the lecture. If you are confused about ANYTHING, she will do her absolute best to answer your question and address your confusion--not matter how minor the question may seem. I also liked that the class was small (only about 20 students) so it didn't feel like a lecture at all and that I could get personal attention. I looked forward to going to class because she teaches it so well and the subject is inherently super interesting. She also makes herself very available during her office hours and after class. \nThe problem sets are manageable and include STATA exercises (that the TA goes over during recitation). The midterm was somewhat difficult because the first half of the course covers the foundation and basic of regression analysis and hypothesis testing. However, the final was easier so it all evened out. Personally, I really enjoyed working with my group to do the regression replication because it forced us to truly delve into STATA and data analysis while apply everything that we'd learn throughout the semester as well as learn more complex econometric techniques. You will do well in this class as long as you put in effort and do all your work. It also doesn't hurt to have a genuine interest in the subject and its real world applications.   \nWorkload:\n10 problem sets with lowest dropped, midterm, final, article assessment, presentation\n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "December 05, 2013",
            "review_content": "\nProfessor Zarghamee is excel at economics and is able to teach everything clearly and effectively to students. Her humorous personalities make this class more enjoyable! She enchanted me and made me can't stopping thinking about econ and her great lecture after class. It is she who made me want to major in economics even though I did not like economics that much before.\nI avoid going to bathroom during class time because I don't want to miss anything in great lecture. This is an intense course: learning micro and macro in one semester. But as long as you dont miss any class, you will be a master of econ (even if you never read the book)!! Her lecture is so effective and enjoyable! I didnt learn anything on micro before, but I earned a decent grade at the midterm simply because I did not miss any her lecture (PS: I never open the textbook unless I had to find hwk questions). \nDONT WAIT AND TAKE HER CLASS! YOU WILL BE THANKFUL TO THIS DECISION!\nWorkload:\nI problem set per week with an econ hunting/ naturist.\n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "November 14, 2013",
            "review_content": "\nI have thoroughly enjoyed Professor Zarghamee's class.  She literally goes through the reading concept by concept with a powerpoint during class so there is no need to read unless you don't understand something.  She is very open to questions and have a very laid back and effective teaching style.  I highly recommend any class by her. She not only knows what she's talking about, she knows how to teach it and explain it in a way that you will understand. \nWorkload:\nThe homework is light but just enough that you are able to fully grasp the concepts.  Each week we are assigned bookwork and a short current event assignment. 2 tests (midterm and final) which were graded fairly and not too hard. \n"
        }
    ]
}