{
    "prof_info": [
        {
            "prof_name": "Daniel Cooper",
            "prof_id": 1263,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 29, 2004",
            "review_content": "\nOk, this class is anything but an \"easy A.\"  Professor Cooper is a VERY tough grader and is unclear in his lectures and even more unclear in his directions for assignments/quizzes.  There is so little work in this class that it's very hard to get a good grade because there is little room to improve your work.  Be prepared to turn in papers before the last ones are handed back, making it that much harder to make improvements upon your work.  Professor Cooper passes around an attendance sheet each class, but attendance does not factor into your final grade.  If you ask him to check on your grade or to do anything else for you, you will need to bug him over and over again with e-mails and it still may not get done.  \nWorkload:\nTONS of reading, 1 group project that you won't have to do anything for, 1 - 10 page paper, 2 - 4 page papers, 2 essay type quizzes.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 05, 2004",
            "review_content": "\nThis class had sooooooooo much reading.  In particular for a 1000 level course.  As nice as Danny is (& he is), he let's discussion take place of lecture & is not necessarily interested in your opinions when it comes to the papers.  Basically, what he wants is a book report on what you read.  Having said that, it is not a bad class for those of us who are not mathematiclly inclined.\nWorkload:\nHeavy for the level it is - 1 research papers, 2 smaller papers, 2 Quizzes, 8 required books.\n"
        },
        {
            "course_name": "Statistics/Research Methods",
            "review_date": "November 12, 2004",
            "review_content": "\nTaking this class with Professor Cooper was fun.  The idea of taking statistics during the summer was scary but Prof. Cooper made easier for all the students.  He was strict with the homeworks being on time but in the end it was best for everyone.  Prof. was flexible at times and he was fair with the grading.\nWorkload:\nmidterm and FinalWeekly homework\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "July 31, 2004",
            "review_content": "\nBelieve all you've heard. Yes, Daniel Cooper is a very nice man. Yes, the class is easy. True, it's often boring. But for those of you who are shopping for a pretty enjoyable and not-too-painful filler class, I recommend Evaluation of Evidence. I'm an Econ major and I took this class in Spring 2003 to pad my schedule. It's that rare easy, breezy elective you're always looking for and can't ever seem to find. First of all, it's very easy. Obviously the ready can get heavy considering it's an intro level sociology course, but it's always manageable and it's also not at all hard to tell when it's important to read and when it's not. There are five books - three of which you have to write about book-report style. One's required, the other two are your choice. 'Nuff said. Read three if you want. The truth is, most of the material's actually pretty interesting even if Cooper's presentation leaves you cold. Though he's likeable enough, he definitely has the ability to lull you to sleep with his monotone delivery and bland lecture style. I say take the class for the Durkheim book on suicide, if for no other reason. That's really just a fascinating piece of work. This is also a class I skipped out on more than a few times and managed to get an A in anyway. \nSo, take Cooper's class when you have other, tougher coursework to tend to and are searching for the fifth course that won't break your back. \nWorkload:\n3 papers in manner of book report. 1 long, 2 short. \"Midterm\" and \"Final.\" I think each were literally 3 questions that ranged in difficulty level somewhere between common sense and the most obvious points made repeatedly throughout each lecture. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "April 22, 2004",
            "review_content": "\nI disagree with the previous reviewer.  Prof. Cooper is a sweet man.  His class is very organized and structure. although at times it may be boring overall this class is good.\n\nWorkload:\nWorkload: 1 long paper 8-10 pgs, 2 short 4pgs each. and two quizes which he gives you time to prepare for\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "April 10, 2004",
            "review_content": "\nMr. Cooper is not a full time teacher. He is an adjunct, and this is for a reason: he should not teach. His class in painfully boring and made me decide not to major in sociology. Each class he simply outlines what the assigned books said, verbatim. It is a ridiculous waste of time. The papers are in actuality book reports. He explicitly tells students to refrain from giving their opinion or interpretation of the material. While the class may not be demanding, his grading is rather nit picky. Basically, steer clear of this class.\n\nWorkload:\nNot too bad: a few books, a quiz or two, two bookreports, and a long paper. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "November 18, 2003",
            "review_content": "\nHe is a great instructor, who cares about students and enjoys teaching. The lectures are interesting and if you're a sociology major, take Ev of Ev with him if you can fit it into your schedule. The class is pretty informative and his selection of books/topics is very good.\nWorkload:\n1 long paper (8-10pgs) and 2 shorter ones (3-5pgs), midterm, final\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "April 22, 2003",
            "review_content": "\nGreat Professor...he actually talks to the class like the students are worth something and makes a great effort to call on people that want to speak and listens and responds in a respectfull manner unlike most Columbia professors who really like to hear themselves talk.  The readings Cooper chooses are very interesting (except the first few that are staples for Sociology class but are really boring).  Bottom line:  Cooper has good, clear lectures, is very approachable and actually seems to care that his students get the material.  I cant say that its a super class to take as an elective but very worthwhile and rewarding as a required class. for some majors.\nWorkload:\n3 papers due early in the sem. and two quizzes.  Very reasonable workload and he is an easy/fair grader who just wants to see if you got the material which is not hard to get.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "April 02, 2003",
            "review_content": "\nRight now I'm skipping this class to write this review... The reason? Simple.  The class is so amazingly boring that I can't stand to go.  On my way to each class, I nearly cry at the prospect of sitting through another one of cooper's boring lectures, which offer NOTHING that is not already found in the readings.  If you are the type of person who loves to have very organized notes and a very structured class, then by all means this is your man.  However, if you are looking for some sort of engaging learning experience, then you should not take this class with cooper.  He is a fair grader, and certainly covers all the information that he expects you to know.\nWorkload:\ntwo 5 page papers, one 10 page paper, two easy tests.  Don't kill yourself doing the reading, just try to suffer through the lecture and you'll do well.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 10, 2002",
            "review_content": "\nThis class was really wonderful. I am not saying it was the hardest class in the world--on the contrary, it was fairly easy. But many things distinguished this class from other typical intro level classes. The books were really interesting, representing 5 different styles of sociological research. And the teacher was great! He was friendly, knowledgable, and relaxed. Everyone was so at ease in his class---people asked many questions and raised interesting concerns with the books. People were comfortable participating in class especially because the teacher was so encouraging, respectful, and engaging. I also think Prof. Cooper was an incredibly fair grader. He definitley did not arbitrariliy hand out good or bad grades. What was so striking about this class was the fact that although it was an intro-level class, and it was not so difficult, I came out feeling like I had learned a lot. \nWorkload:\nthree 4-page papers, based on the each of the books we read, midterm and final, both with a methodology section and an essay.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "November 19, 2002",
            "review_content": "\nThis is probably the most boring class I have ever taken. The sad thing is that some of the books read are interesting, but going to lectures is the most pointless eercise in the world. Prof. Copper recites what was in the reading, and does not make anything clearer or easier to grasp. If you do the reading you can understand everything on your own without a problem. Attendance in the class is not that great, so he tries to be really strict and picky on the exam. The only reason you would take this is if you are already so enamered with the science of sociology that nothing can ruin it. Because if there is one thing that can turn you off from this subject, this class would be it. \nWorkload:\n3, 4-5 page \"opinion\" papers on the three out of the 5 books read in class; Midterm, Final; attendance taken but not counted.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "November 18, 2002",
            "review_content": "\nprof. cooper is a wonderful teacher. i can't say enough good things about him. the lectures are clear and organized; notes come out making sense and actually help when studying for the midterm and final and while writing the three papers. he's laidback and a fair grader. he knows what he's talking about\nWorkload:\n3 4-page papers based on three of the five books you read for class, just take good notes and you'll be able to pick out the important points to hit on...midterm is strongly methodologically based as is the final\n"
        }
    ]
}