{
    "prof_info": [
        {
            "prof_name": "Katharine Soper",
            "prof_id": 2853,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 10, 2012",
            "review_content": "\nKate was a great Music Hum prof. Whether she's a great composer... well, check out her website and judge for yourself.\nThe class moved briskly and covered a lot of material. Unlike many music hum professors she spent 2 weeks on modern music, so if you want less Mozart and more Reich, take Soper. She hit the highlights, but definitely lingered less on Mozart and Beethoven and the other classical greats. I personally think that was fine, and was happy to learn more about 20th and 21st century *concert* music (ie no Beatles, think Stravinsky and Stockhausen and Reich).\nShe posted courseworks readings for every class, but they were relatively short and worth doing because they supplemented the lectures well. Generally there were about 4 songs totaling 20-30 minutes for each lecture.\nYou had to attend a western music concert and write up a 5 page report focusing on whatever you wanted, due the last class. During reading week there was another 5 page paper due, with a relatively broad topic.\nThe midterm and final were identical, and non-cumulative. Part 1 was known listening: she posted 25 songs we'd heard in class/on courseworks and we had to be able to identify title and composer of the ~5 she picked based on a ~30 second sample. Part II was unknown listening, she'd play a few minutes of music similar to what we'd heard and we had to identify a likely composer and explain what elements of the music made them a good fit. Part III was basic multiple choice, which if you paid attention in lecture you'd do fine on. Part IV was an essay responding to a prompt, pretty open ended as long as you cited specific composers & titles.\nWorkload:\nLight, but useful. About 2 pages of courseworks reading and 20 minutes of music listening per class. About 4 1-2 page assignments. 5 page concert report. 5 page final paper. midterm and \"final\" that was identical to the midterm.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 03, 2012",
            "review_content": "\nFor one, I think that using the Mac in class was a bad idea. She clearly does not know how to use it efficiently and often bent down in the middle of sentences, while continuing rambling, to find something on her laptop. It was distracting and made it so that the class often had to sit in silence while she fiddled around with it. That said, I think using a PowerPoint or something typed would be helpful in this class, because her handwriting was really hard to read. That, and she wasn't really good at getting through what she planned on getting through that day. This is probably for two reasons. 1) She would ask us questions about our reactions to music or what we knew about a particular time period, but, really, she was getting at some ridiculously obscure fact. Music history isn't something that's really intuitive, and she tried to get us to sort of have the answers ourselves, but she should have just told us what she was getting at. It would have saved time and been a lot less awkward silences. But even more so, it was annoying because it seemed like she was more interested in her time than ours. She could fiddle around with her laptop and stop in the middle of what she was saying to find a music clip, but if we weren't 30 seconds early to class, the door would already be closed. That was really distracting, too, because individuals would always come in on time/a little late and she would have to stop what she was doing to let them in. It wasn't really necessary to close the door unless she was playing music, which, at the beginning of class, she often was not. Also, she often dumbed down musical explanations to the point where they were useless. Her explanation of tonality, such a key concept, was botched, and I'm pretty sure only the kids who had played music before could discern what she was trying to say. If she had just taken a day to really explain tonality and, perhaps, dropped a day of modern music (which she obviously is a fan of...Skipping Brahms in the Romantic Era to do some really crazy and not necessarily useful modern music), or at least used some sort of textbook to keep us all on the same page, it would have been more fulfilling. That said, this would also make this class harder, which is not necessarily something that's great in the student's eyes.\nShe would critique little details of our arguments in our papers, so I don't really know how this class is going to end up grade wise. She would preface everything with \"everyone has a valid opinion,\" but if someone voiced an opinion against modern music either in class or in a paper, she would reject it. I get that she's a modern composer, but I also think the goal of this course was to educate us on the classics, not really new, modern stuff that may fall out of fashion in the next year.\n\nWorkload:\nListening every night, Sometimes writing on that listening, 1 Concert Report (4-6 pages), 1 Opera, 1 final essay (5-7 pages), Midterm, Final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 14, 2011",
            "review_content": "\nKate is overall a very nice person and teacher, but there are some flaws in her teaching method, which is completely understandable because she's a grad student and is still exploring education.\nThe Bad:\n1. She doesn't return hw assignments, which can be really frustrating because you never know what she thinks of your opinions or if your ideas are even valid or interesting.\n2. The classroom dynamic can be HORRIBLE at times. Maybe it was just my class, but she oftentimes is lacking ways of engaging everyone in the class in an interesting way.\n3. She gets annoyed if you're late to class, but many times during the semester she was the person late to class. Don't throw stones when you live in a glass house.\n4. The only time we were ever on track in class was the first day. She often goes on (relevant!) tangents that can be really interesting, but we would suffer every class by losing material to study which would've been pretty cool.\nThe Good:\n1. Midterm/Final was 100% fair. She knows how to make a good exam. If you paid attention in class and studied moderately you got a good grade.\n2. She's nice and understanding!\n3. She's got the enthusiasm, just needs to work on the delivery.\nWorkload:\nCompletely appropriate for a college class. Responses to listenings/readings on a every-other-class basis. Not tough at all.\n"
        },
        {
            "course_name": "Intro. to Ear-Training",
            "review_date": "April 13, 2006",
            "review_content": "\nI really liked Kate's class. She is very sweet and helpful and easily reachable for help outside of class. Yes, ear-training is challenging, but the best way to keep up is to do the assignments when they are assigned and ask questions -- most likely, someone else is just as confused as you are. Kate made this class very enjoyable, though, and I would highly recommend her.\nWorkload:\nWorkbook assignments for each class (listening exercises). They really are not meant to take two hours but can take a long time if you are having trouble. Some assignments are more difficult than others. Kate was very receptive to our comments about an assignment being too difficult and tended to alter her lesson plans/syllabus accordingly.\n"
        },
        {
            "course_name": "Introduction to Ear Training",
            "review_date": "February 17, 2006",
            "review_content": "\nKate Soper was a fine instructor for ear-training. It's a terribly obscure skill to be able to distinguish between a minor and major seventh, but she was quite helpful in enabling those of us who cared to reach our silly aural goals. She puts up MIDI files on her website that you can download and listen to, and is always available to talk to during her office hours. She has her own website - she's a singer-songwriter and a composer. \nNot bad, not bad at all. Just not great.\nWorkload:\nMore than you would expect for a 1 credit class. Expect to spend at least 2 hours listening to shit for each class.\n"
        }
    ]
}