{
    "prof_info": [
        {
            "prof_name": "Neslihan Senocak",
            "prof_id": 3447,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 16, 2013",
            "review_content": "\nMy favorite professor at Columbia to date. Open, smart, a great thinking, that constantly challenges your assumptions and really teaches you how to read texts - a great skill. \nShe is also a fantastic person. Smiles often, is very nice, and all-around lovely. \nShe was also very open about class discussions. Even if you didn't read, you could easily participate. The texts would often present a question, or problem and she'd just ask us our opinions. For example, do you think its fair that our current prison system throws people into jail? Or should we go back to cutting off a finger? Which is, in reality, more cruel? What would you rather receive for punishment? Etc. \nShe is a historian, and before we read any new philosopher, she would have someone give a presentation on who they were, the period they were writing in, etc. It was extremely helpful. \nShe's just the best. I had such a great time in CC because of her. If you're in her section, you're lucky.\nWorkload:\nProbably less than other classes. Cuts down the reading, and we only had one paper to write. Granted it was like 8-10 pages, but it really wasn't bad - she gave us several different prompts and ways to write the essay (For example, what did so-and-so say about this thing? Or put two authors in conversation with each other. Or write your own philosophical work). Fairly graded midterm and final that were non-standard across all of CC.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 12, 2011",
            "review_content": "\nI enjoyed Professor Senocak's class a lot! We focused a lot on the historical contexts of the readings and also about how they are applicable to our time. I think this is way more interesting than just analyzing the text for 2 hours. With this said, she is very opinionated and I think that if you have a more conservative stance, this class could be less enjoyable for you. I loved it because we agreed on most things - but other students that disagreed probably would not say the same.\nWorkload:\nTough but reasonable - shorter readings than some other sections - 2 long papers that require outside research - midterm and final that are solely IDs\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 23, 2010",
            "review_content": "\nFrankly I found Professor Senocak's classes quite brilliant.  Her background in medieval history took many of the philosophers commonly considered drudgery - including Al Ghazali and the Protestant Reformation - and really brought them to life.  Her accent can be rather difficult to understand in the beginning, and she speaks very quietly, but Professor Senocak's points are really quite insightful.\n   I worry that her less-than-glowing opinion of the Enlightenment will make the spring term more difficult than it should be.\n   Professor can be very strict on skipping classes.  She sometimes makes people write three page papers on content they missed, even if they provide a sick note.\nWorkload:\nTwo LONG research essays relative to other sections, but the midterm and final are almost criminally simple.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 19, 2008",
            "review_content": "\nProfessor Senocak is a reasonable professor. She isn't very inspiring with her analysis of the texts, but she is in the history department and understands both the historical context and significance of the text. I have come out of this course appreciating how each work was heavily influenced/biased by the works before it, understanding what was unique about each and then seeing how the ideas have shaped the ones we believe or reject today. \nShe is Turkish, has not previously lived in the US and has views on the texts that are markedly non-traditional, which can be seen as a positive. That being said, her views of texts are expressed but she is very open to alternative interpretations and defenses/criticisms.\nThis class is different in a few ways:\n1) The professor is COMPLETELY open to comments no matter how ridiculous, (she will often play devil's advocate to get students to argue between themselves)\n2) There is a 'class notes assignment' which students have mixed views about. It basically entails going through a text and pointing out major arguments, assumptions that the author makes, logical sequiturs (these are very hard), what the author left out etc. It suits a perceptive and logical reader. If you aren't rigorous with your logic these assignments could make the class a nightmare. She is a pretty objective grader, so be weary before you bs, at any rate make it sound well thought out and seemingly accurate.\na few tips:\n1)If you don't read the books well, take extensive notes in class. On exams she only asks what has been discussed in class.\n2) Class participation is weighted heavily so just talk a lot, even if you have nothing substantive to say, agree and disagree with others, talking about your feelings. She prefers this to saying nothing at all, and it will reflect in your grades.\n3) Don't be late, she dislikes this and attend all classes if possible, this will almost guarantee a good grade.\nOverall her style isn't for everyone, it suits a logical person who likes to talk. She is un-intimidating, a little aloof, cheerful and very open-minded. Grading is fair and on the lenient side, she gives a decent proportion As and A-s, maybe around 30-60%.\nWorkload:\n7 class notes assignments over the term these could take 1-3 hours each, depending on how much you have read/how easily you pick up sequiturs. 1 essay - 5-6 pages, on any topic that interests you. midterm, final, class presentation (10-15mins) on the historical context of one text and it's author.\n"
        }
    ]
}