{
    "prof_info": [
        {
            "prof_name": "Szabolcs Marka",
            "prof_id": 2817,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "weapons of mass destruction",
            "review_date": "May 16, 2016",
            "review_content": "\nI took this because (1) I took Professor Marka's \"Physics for Poets\" class and loved/aced it; and (2) I'd heard from friends that it was the easiest class they'd ever taken. THIS CLASS IS NO LONGER EASY (if you don't know Physics and Math).  I think Professor Marka has had to crack down due to all the A's his students were getting, ha. \nFirst off: Professor Marka is AMAZING. He is hilarious, humble, kind, and so enthusiastic. Everyone adores this guy. AND-- he is THE genius who was recently on the front page of the New York Times for having confirmed Einstein's theory of general relativity by studying gravitational waves in space. He is truly one of the coolest professors at Columbia.\nThis class is not what it used to be, however.  Apparently (before the alleged crackdown) you could coast in this class. That is no longer the case -- this class, although easy and completely manageable if you put work into it, is not intuitive by any means.  Class attendance is no longer optional if you want to get a decent grade.  Much of what is discussed in class (guest speakers, etc.) is not Google-able and will be asked on the exam. \nDo the homework (answers are ALL Google-able, but they sometimes take a while to find) and write a decent term paper -- these are the only easy A's in this course.  For the final exams, make sure you GO TO RECITATION.  The team goes over what will be covered on the exam and will show you how to do the equations. The exams are still a bit tricky, though.  Thankfully, I took this course with a group of 6 friends, and if any of us missed class, we would fill each other in on what was covered. \n**TL; DR -- Professor Marka is the coolest, nicest professor ever, but this class is NO LONGER easy (if you don't know Physics and Math) and takes a lot of work.  Do really well on the homework and term papers (only easy A's in this course), and study/go to recitation for the exams. \nWorkload:\nSix homework sets (all answers are Google-able, but it takes a while to find some of the answers); 3 midterms (he drops the lowest grade); 1 final; 1 term paper.  Thankfully you're allowed \"cheat sheets\" for all midterms and for the final. \n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "May 13, 2015",
            "review_content": "\nProfessor Marka is the shit. If you're not a science person (which is who the class is obviously designed for) you will probably feel pretty lost the first few lectures. After a while you start getting some of the stuff and if you're interested you can learn a lot. If you're busy you can skip class and not miss a beat. \nWatching Professor Marka is the real pleasure. It's like someone gave a curious child unlimited resources and encouraged him to play with all the dangerous things in the lab. He gleefully handles liquid nitrogen and harasses his TA by being casually brilliant. He also speaks in a hilariously villainous German accent which can be a little hard to understand but makes the class that much more of a good time.  Professor Marka is a world class scientist who specializes in Black Holes and other mysterious shit. Get him to explain it all to you and take this class for an fun and easy way to knock out your science requirement. \nTL;DR Professor Marka is the man. Class is Easy A. Very little work. \n\nWorkload:\nTwo homework sets during the semester, 3 midterms, 1 final\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "May 08, 2015",
            "review_content": "\nEasiest class I've taken in both my college and high school careers. \nNo work necessary. Okay, maybe a few psets and a term paper about nothing and a presentation at one point. No midterm. Take home final. \nIf you're a humanities person like me with absolutely no sense of science needing to fill the patriarchal requirement of the CC science requirement, take this class. Oh and also if you're lazy, take this class.\nThere were 130 people registered for the class and I'd say that about 20 would show up to lecture on a good day. \nYou're fucking welcome. \nWorkload:\n7 Psets, Presentation, Term Paper (four pages), Final\n"
        },
        {
            "course_name": "weapons of mass destruction",
            "review_date": "November 18, 2014",
            "review_content": "\nProfessor Marka was without question the nicest, most enthusiastic, most sincere guy I've ever met, let alone Columbia professor. He is BRILLIANT, immensely warm and understanding. He has a bit of a thick accent, but, at least for me, that made him all the more endearing. He asks very little of you for this class (not even that you show up most of the time), but if you do give him even a little bit of energy and/or curiosity, you will be rewarded in spades. Not only is he more than willing to give you a good grade for relatively little work, but he teaches amongst the most interesting and under-discussed courses at CU. WMDs is simply fascinating, and his enthusiasm is infectious. Don't worry about not being a scientist! He doesn't give the greatest explanations in the world of the complex scientific phenomena covered in this class, but they are serviceable, and you really don't need to understand it all--just get the essentials of how whatever he is describing works and you'll be fine (his explanations should be more than clear enough for you to do this). Moreover, though the class opens with some technical, dry explanations of nuclear reactions, it quickly moves on to a broader discussion of nuclear technologies that will appeal to anyone from political scientists, historians, and human rights majors to environmental scientists and engineers.\nI really cannot say enough nice things about this class and Professor Marka. This class was the most interesting class and (surprisingly because there is no work) amongst the most informative classes I've taken at Columbia. If ever a professor deserved a gold-nugget, it is Marka. He is simply the best. Definitely do yourself a favor and take WMDs.\nWorkload:\nBasically none. A joke of a problem set which you can just google the answers to (and which is the ONLY piece of work you get all semester), no required attendance, the final is an in-class essay of your choice (again, could not be easier--he wants to give you an A), and the class he asks you to lead is the only remotely difficult thing, but if you are even somewhat interested, it's really easy. He'll give you some recommended reading (lots of it) and you can do none of it if you want to, but I recommend reading some of his suggestions; it's really interesting stuff!\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "August 06, 2014",
            "review_content": "\nThis class was a very strange class. I would recommend taking it if you're looking for an easy way to fulfill a science requirement and do not have a genuine interest in the material. Attendance is pretty much optional and in my opinion not necessary, The only times i went to class were to force myself to do the reading for another class that i had immediately after that, but other than that there was no point. And i really did try for about the first month.\nThe format of the class is pretty much some sort of experiment that usually doesn't work done by Marka and his assistant, this takes about 10-15 minutes then for the rest of the class he just goes through slides, many which have the word optional written across them, therefore REALLY discouraging me from paying any attention at all. \nthere were suppose to be problem sets due very two weeks but it took him about two months to actually get that going and the homeworks were long but you could mostly look up everything online. There were 3 midterms which he failed to evenly space out so towards the end of the semester it felt like we were having a midterm every two weeks, The midterms were mostly based off of questions in the practice given beforehand and the material seemed pretty basic, but I had never taken any sort of physics class before so I had no idea what the answers were if the answer wasn't previously given to me on the practice. Don't bother purchasing the textbook for this class, it is completely useless and won't help at all. Cheat Sheets allowed on all midterms anyway so you could put the practice exams on there. \noverall, the material isn't easy if you haven't taken physics before but the class also has a bizarre curve that pretty much ensures that everyone does well. \nWorkload:\nvery light. everything can be done the night before\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "September 24, 2013",
            "review_content": "\nI love professor Marka. He's the best professor I had so far at Columbia. He made me develop a genuine interest and understanding of the physics terms and bases. He has the coolest office and is definitely an extremely energized professor that is always in high spirits. I had an extremely pleasant experience with his class and I think that's what classes should be about in the end. I had a great time, learned a lot, brushed up skills and elected him my favorite professor so far. I'd make him a golden nugget if I could.\nWorkload:\nApproachable, understandable, makes sense. Fair, honest and straightforward proposals. Well designed midterms and finals.\n"
        },
        {
            "course_name": "Electromagnetic Waves and Optics",
            "review_date": "January 17, 2012",
            "review_content": "\nDear Professor Marka,\nHi, remember me? I was in your 3008 Class. Yes, I was wondering where my grades were. You see, I spent a lot of time studying for your class, and you seemed to like teaching it, heck, you even took us up and let us watch you cut things with your laser cutter! But why, oh why Professor Marka, hasn't my grade been posted yet?\nYour lecture notes were a disorganized, your accent made you a little difficult to understand, but I grinned, and I bared it, Professor Marka! You see, I tried! I tried very hard to enjoy your class, professor! You explained to us the most interesting of modern physics experiments, you always explained how the concepts were relevant to everyday life; this could have even been a good CULPA review! It could have been! \nBut no, Professor. After delivering our final exam grades just hours after the test was over, you have yet to post our semester grades. It has been four weeks, Professor. I have already begun learning newer physics; the applications of what you taught me! Just the way you wanted--\nBut still, not a grade in sight!\nSincerely, \nA student \nWorkload:\nBUT WHAT GRADE\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "January 21, 2009",
            "review_content": "\nMarka is the most inept professor/teacher I have had in my life, and this is a view shared by EVERY person I knew or worked with in the class >15 people. Sure I got a good grade, but this class was worthless. The course material is obviously engaging and the foundation of so much physics.  Upon further investigation.. I found out that Marka has trouble keeping graduate students to work with him in research.  Here's a few reasons to describe what makes Marka so bad:\n-Poor (useless) lecture style: does not explain derivations, explains topic as if it is a review, starts talking about things that are barely examples of the phenomena\n-Poor class organization: Syllabus gets filled in on courseworks as a one word topic a few weeks after each class, spaced 2 out of 3 midterms with 2 classes in between, homeworks get handed back months later or not at all\n-Long and difficult homeworks of which the lectures are of no help, draws on concepts and ideas that you may have never been exposed to\n-\"-has no concept of how little the class understands the material, not helpful during office hours because he Doesnt Understand Questions\nhow unfortunate that a class he teaches is a requirement for so many physics majors.  to get a good grade- share homeworks, copy down the questions from the practice midterm on to your formula sheet- he uses the exact same questions and answers year after year from the practice midterms to the midterms/final\nsample of review for midterm, that he posted on courseworks two days before midterm.  In summary, teach a course by listing pages of information that students have to know:\n\" Please make sure that you understand the material covered on pages 313-331, 355-382, 413-441, 519-577 and the related problems. (pages 453-488 are recommended)\n.\nThe multiple choice and conceptual problems most likely will cover: \nA.P.French: An Introduction to Quantum Physics\n.\nSome of Chapters 1 and 2\n.\n-> Please make sure that you understand the material covered on pages 17-102 and the related problems. (pages 1-16 are recommended)\n.\nAlso, please make sure that you study the material posted on courseworks.\"\n\nWorkload:\nhard homeworks, 2/3 midterms and final that use exact questions from practice exams, random grade given at the end anyway\n"
        },
        {
            "course_name": "Electromagnetic Waves and Optics",
            "review_date": "December 30, 2006",
            "review_content": "\nMarka is a good professor overall.\nGood points:\n1. Very entertaining, engaging professor. More classroom participation than normally expected in a physics lecture.\n2. Very accessible, helpful with questions, knowledgeable about material.\n3. Enthusiastic about material, decent pacing most of the time.\nThings that I didn't like:\n1. The TA took forever to grade things. We didn't get midterm grades till nearly the end of the semester, and I think I only recovered 1 or 2 of the many graded problem sets (he took forever to grade those too.)\n2. In class, Marka uses powerpoint slides a lot. This is good when you want to review material (he always posts them online) but bad because he never does the derivations for equations on the blackboard, which would have helped immensely.\n3. Tests had a tendency to be very long. Only the final was of appropriate length.\nOverall, this was a good class that is significantly more difficult than W3003 and W3007. \nWorkload:\nPretty standard workload for a W300x physics class.\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "December 15, 2006",
            "review_content": "\nProfessor Marka made this 2000 ridiculously difficult. Not only does he recycle slides from his 3008 class, he assigns homework from their textbooks/midterms. The first exam was unnecessarily difficult and nothing like the homework problems. He uses like 6 different books and the one he starts out with is this POORLY written book by Pain. The text is confusing and the homework problems are all algebra and no physics. The class got a little better once we stopped using that book, and then he hit us with this insane E&M; homework. The curriculum for this course is fantastic. I just wish it was taught better. I hear he's better at his 3008 course, maybe he's just not fit to teach fundamental concepts. Nice guy though.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "August 21, 2006",
            "review_content": "\nI thought Marka was a good professor.  It was a huge class, so it wasn't at all personal, but I think he did as much as he could to ensure that most of the class was not left behind.  Attending class really didn't contribute very much to your understanding and he often covered different material than what we were tested on, but I often liked going to class because he was so entertaining (especially when he did experiments) and earnestly enthused about physics in a way that was contagious.  He posts everything he does on Courseworks, and his slide shows are helpful if you've already read the book.  The homeworks are graded fair to easy, and the midterms and final are reasonable.  The course covers a whole lot of material, so it is often fast paced, but I thought Marka made it as close as possible to fun.\nWorkload:\nWeekly problem sets-HARD, two midterms, final\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "August 19, 2006",
            "review_content": "\nI think the most awful thing about his class is powerpoint presentation. Even though he might be good physicists, his teaching abilities are not that satisfactory. For those who will be majoring in Physics, it should be taken into serious consideration that the materials presented in the course are very important. Thus a good professor is required to make the materials clear and more interesting. Marka fails to draw the attention of his students in this reagrd. \nThe class had no sense to me when it reached its third week. I cannot judge his intellectual abilities in physics, but i am sure that he does not communicate with his students well in the class. About the workload and finals, previous reviews are enough to give everybody a good impression.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "August 16, 2006",
            "review_content": "\nProfessor Marka is a lively instructor who tries his best to engage the entire class.  He always stopped to listen to, and answer all questions.  He was also always available after class to talk further about the lectures.  His grading is fair, and it's clear that he likes what he does.   \nWorkload:\nChallenging problem sets that he allows groupwork on, and exams with (more than one) cheatsheets.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "July 17, 2006",
            "review_content": "\nMarka is awful.  He teaches using power points and pointing to derived equations rather than deriving them himself, which personally, leaves me with no understanding whatsoever.  He introduces concepts in differential form when the class is all incoming freshman who mostly haven't taken any diff. eg. classes.  He gives these ridiculously easy \"quizzes\" at the end of lecture that are elementary in concepts and then bombards students with the most difficult questions possible for problem sets.  I think he means well, but he really was the worst physics professor I've ever come across in my life.  \nWorkload:\nTwo midterms and a final.  Beware! The final is not cumalative at all.  I spent all my time restudying and 80% of the test was the last two lectures on thermo.    Nothing is cumalative.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 08, 2006",
            "review_content": "\nTwenty less people come every time class is held!\nMarka seems like a good professor but secretly isn't. The lectures are pretty much useless, the homeworks are ridiculously bad (only advanced problems, and lots of them). Recitation sections weren't any good, either, and only 5 or 10 people would usually show up.\nJust survive it... after Parsons it's an extreme let-down. It doesn't grade that tough, I guess...\nWorkload:\nTen awful problem sets. You'll have more time if you never go to class.\n"
        },
        {
            "course_name": "Electromagnetic Waves and Optics",
            "review_date": "January 19, 2006",
            "review_content": "\nProfessor Marka is a good teacher whose classes definitely offer something different than most physics professors at Columbia. For one, he actively encourages class participation. He usually began lectures by discussing a recent development in physics and asking us our opinion on it as well as thought-provoking questions. He was also highly enthusiastic about the physics he was teaching (a characteristic that most physics professors fail to convey). \nHe devoted extra time to interesting concepts that are not usually taught, like rainbows and interferometry. Classes were done using a projector, and while I prefer to learn from a blackboard, this was not a serious impediment to learning the material. While he admits that the proofs of theorems arenÂ’t the most interesting part of the subject, class was usually interesting, though suffered from beginning at 9:30. \nWorkload:\nSlightly lighter than typical physics class workload, definitely allowed you to learn the physics rather than racing through problem sets.\n"
        },
        {
            "course_name": "Electromagnetic Waves and Optics",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Marka is a fine teacher who focuses heavily on applied sides rather than trying to teach as if Physics were literature (something many professors here does). The classes are interesting and does not require you to remember stuff that you will never need except for passing exams. Instead, he wants you to master the underlying physics of the experimental world. His exams are pretty easy, which means in class you can have a take it easy approach and rather than thinking about how to get an A can actually concentrate in the physics.\nI think any student, except for the few who do not care to attend the classes and then complain that he is vague, would love his teaching style.\nWorkload:\nStandard.\n"
        },
        {
            "course_name": "Electromagnetic Waves and Optics",
            "review_date": "January 15, 2006",
            "review_content": "\nI think Professor Marka is the worst physics professor I have ever had, although you will find many who love him to death for reasons that are beyond me (I've heard everything from \"ohh, he's a nice guy\", to \"he's better than Millis\" which is NOT true).  I had Brooijmans for 3007 and since he didn't say a sentence that wasn't in the textbook, I thought that was the worst it could get.  Then I took Marka's class and after a few weeks ended up *wishing* he'd just recite from the textbook.  The times when I actually went to class I would wait for him to explain something, but instead we would spend class time either looking at portriats of the physicists themselves, or else photographs of some experiment that used the techniques that we were supposed to be discussing.  All I ever got from him was overview.  Specifically, several of the classes later in the semester focused on irrelevant concepts: one entire class was devoted to laser safety; another class he showed only pictures of a vibrating guitar.  Worst of all, when he actually did go through the math, it was all by powerpoint presentation - he never once - EVER - wrote on the actual board - he would just click a button and the equation would magically rearrange itself into the form he wanted it in (or rather, that the textbook author wanted it in) and he left it up to you to figure out the algebra later on your own.  This is a fine technique if you are explaining principles (which, as I said before, is all he ever did), but horrible for actually teaching physics.  Here's the kicker: in the review session for the final (which was, mind you, conducted by the TA), we all finally learned how to actually *use* the dipole and multipole formulas we'd been ostensibly studying for a semester.  All the countless classes of useless talk by Prof. Marka amounted to our just being confused about what the hell was going on.  The final itself was not only a joke, but - unbelieveably - he also called on us to identify those portraits for credit!  He'd already done this on the midterm and we thought he was kidding when he said they'd be on the final - but we were wrong.\nWorkload:\nproblem sets, midterm, final\n"
        }
    ]
}