{
    "prof_info": [
        {
            "prof_name": "Alexa Jervis",
            "prof_id": 1976,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Latin I",
            "review_date": "December 24, 2010",
            "review_content": "\nI agree with the previous reviewer about the cough drops and the general quality of the class, but I just wanted to add a little about Professor Jervis' grading. I spent the whole semester trying to figure out the way in which she grades and I still don't know. Particularly on quizzes, my grades seemed to be either given at random or I got the same grade on two quizzes where my performance was radically different. She grades easily, so it's not like it upset me, but I sure would have liked to know the system for distributing points.\nAnyway, Jervis' class is overall fine. We learned Latin.\nWorkload:\none translation assignment per class, weekly quizzes, two midterms, final \n"
        },
        {
            "course_name": "Intermediate Latin I",
            "review_date": "December 21, 2010",
            "review_content": "\nVery nice lady, really knows her stuff. The class is mostly translations, with some Roman history thrown in here and there for good measure. Her exams are very fair, and her grading is extremely lenient. She is genuinely in love with Latin, and it really shows. As the daughter of the great Political Scientist Professor Robert Jervis, you can tell that she was really born to teach. She is very helpful if you are having trouble with the translations, and is quick to clear up any questions that arise. She is quite funny, and loves to relate everything in Latin to modern pop-culture. She does digress and the class ends up talking about some current event or other, but it is a nice break from the tedious translations of Cicero. While the cough drop thing is true, I didn't find it to be much of a distraction--more like a little annoyance.Overall you can't go wrong with Professor Jervis.\nWorkload:\nTranslations for every class--not too heavy at all. Weekly quizzes, which were just passages from the previous weeks translations. Drops lowest two quizzes. Two midterms, final. Grading is very lenient--she is not a stickler for vocabulary, as long as you get the sense of what is being said.\n"
        },
        {
            "course_name": "Intermediate Latin I",
            "review_date": "December 06, 2010",
            "review_content": "\nProfessor Jervis has a wonderful personality and conducts a lighthearted, engaging class. She also makes sure to leave time to talk about Roman history and put the readings in context, which in is not only helpful to understanding the texts, but a welcome break from straight translation. HOWEVER, I am writing this review primarily as a PSA for wayward students who, like me, are easily irritated by the noises people make when they chew. This semester, on any given class period there was about a 2 out of 3 (perhaps higher) chance that Professor Jervis would be sucking on cough drops throughout class. And when she consumes cough drops, she really goes to town. She frequently makes smacking noises with her mouth and lips, and talks with the cough drops in her mouth, changing her speech in a way that I found highly irritating. Furthermore, she mentioned that she is prone to sore throats and coughing, so it seems safe to assume that the cough drops eating is standard for her in the fall/winter, not just a fluke of this year. \nI don't want anyone to misunderstand me--I really like Professor Jervis. She is an engaging, funny teacher, she grades fairly, and I really feel that I have learned a lot from her. But her incessant cough drop chewing literally has driven me to take up smoking again, (after quitting) as a result of being so strung out from the massive amounts of annoyance caused by having to listen to her smack her tongue and talk with her mouth filled with saliva. I have talked to three other people in my class about this issue--two said that the cough drop eating did not bother them at all, while one agreed that it drove him insane. Since it may not bother you at all, and she is a great teacher, I highly recommend signing up for Jervis' class and waiting until she starts consuming cough drops--if the cough drop consumption bothers you, you should switch classes, because it will continue all year.\nWorkload:\nTypical for Intermediate Latin I--reasonable amount of translation for each class, weekly short quizzes, two mid terms and a final. She grades fairly and is lenient about making small mistakes.\n"
        },
        {
            "course_name": "Selections from Latin Literature: Roman Satire",
            "review_date": "May 13, 2006",
            "review_content": "\nProfessor Jervis did a good job.  She knows her Latin and brought a good background in recent theory in classical satire.  She kept class interesting with a good coursepack, interesting discussions, a great guest lecture, and a persistent effort to make sure the class got the jokes or modern parallels.  We had a series of student presentations which probably would've worked better as papers submitted to her rather than student-led sessions.  The translation assignments were very well sized, not too long, not too short.  She could stand to get a little more confident in the classroom, less worrisome about students' interest; for instance, she would sometimes stop talking about a topic because she thought people would get bored.  But actually we found it very interesting, since she did a good job explaining the different poets' historical contexts, formal styles, all the stuff that makes translation bearable.  She picked good poems to translate, too.  You really pick up on the different feels of Horace and Juvenal and the variations within their own works, the different styles of humor, the comedic strategies, etc.  She's approachable, pretty funny, brought cookies to the final.  She seems to have improved upon the faults noted in other reviews, so she'll hopefully keep improving and people will have an even better time in her future classes than I did in this one.  Take her.\nWorkload:\nNot too tough.  Easy midterms, a final which just takes a lot of re-reading, class presentation, translation assignments of near-perfect length.\n"
        },
        {
            "course_name": "Latin Literature Selections",
            "review_date": "May 28, 2004",
            "review_content": "\nProfessor Jervis is a very friendly and capable teacher.  She did very well teaching our small class (7 students).  We went over the material (Livy) at just the right pace.  She always allowed questions and even amended her syllabus when we complained.  We had two midterms, not that bad, and a final.  We also did an in class presentation which was fun and had a short paper to write in the end.  The material itself is a bit challenging because it is a lot of battlefield description.  Book 6 which we did during the second half of the semester is harder than book 1.  I would reccomend taking this class especially if it is going to be a small group of students.  Jervis is an engaging teacher who knows her stuff but is not intimidating.\nWorkload:\ntwo midterms, a presentation, a final , a paper\n"
        },
        {
            "course_name": "Lyric Poetry: Catullus and Horace",
            "review_date": "January 22, 2004",
            "review_content": "\nI'm surprised there aren't any reviews of Alexa yet - she was responsible for the most useless, boring and frustrating Latin experience I've ever had.  While the material - poetry central to the Latin \"canon\" - was fine, class was a mess:  we very rarely discussed literary features of the poems, or their historical circumstances, focusing instead on translating each poem with as little efficiency as possible.  Worse still, Alexa was extremely insecure and nervous;  she claimed she was not a poetry specialist and showed quite clearly, by constant grammatical mistakes and total ignorance metrical rules, that this was true.  (Why she was assigned to teach the course, considering all the unemployed academics out there who could have done a better job, baffled our class the semester through.)  Our TA was very good, and even dealt well with Alexa's obvious resentment at the fact that he often needed to correct her grammar or history.  \nWorkload:\nManageable midterm and final (though the final was surprisingly long), useless 5-6 page paper on Catullus or Horace's aesthetic criteria and our guess as to their opinion of THEIR OWN POEMS - a topic violating major rules of academic writing.  Oh, and class participation, which is sometimes forced upon you because everyone is so bored and resentful that they don't want to volunteer.\n"
        }
    ]
}