{
    "prof_info": [
        {
            "prof_name": "James Curley",
            "prof_id": 5966,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Social Development",
            "review_date": "June 03, 2015",
            "review_content": "\nThis class was a blessing. First off, Professor Curley is a wonderful professor. This is a subject that he knows extremely well, and it shows in the way that he sets up his lectures. He explains everything succinctly and clearly and presents exactly what he wants you to get out of the class. He's also in the habit of showing a lot of videos during class to supplement the material which  is extremely helpful considering that understanding social development becomes a heck of a lot easier when you actually watch experiments being done. \nHe posts lecture slides in advance on CourseWorks, and they are incredibly detailed and helpful. He highlights important material, he summarizes long-winded paragraphs from the textbook in a mere sentence, and he goes at a reasonable pace. He also does helpful review sessions the classes before the midterm and the final including take home points from each major topic on the exams. He truly wants everyone in the class to do well and doesn't try to set his students up to fail. \nWorkload is simple. One research paper that he gives you ample time to accomplish, and the topic is your choice. One midterm and one final that are entirely 3-4 sentence short answers. The textbook for this class is really detailed, but can at times be rather long-winded and in depth. Looking at the slides from class is enough to get A's on his exams.\nOverall, an easy informative class. \nWorkload:\n30% research paper\n30% midterm\n40% final\n"
        },
        {
            "course_name": "Social Development",
            "review_date": "May 16, 2015",
            "review_content": "\nTake this class. Now.\nProfessor James Curley is an intelligent, knowledgeable, and effective instructor who always does his best to make his lectures interesting with videos and interesting facts. The material itself is also very interesting.\nHe seems like a really cool guy and genuinely wants the class to do well, and I felt his exams were extremely fair and straightforward (all the questions are short answer, though). He is not out to get you or trick you on the exams whatsoever; he literally just wants to know if you know the material he presented to you. The exams are not difficult if you study. Like I said, he is very fair.\nThere was honestly nothing about the class I didn’t like. Just take this class!\nWorkload:\nOne midterm, one paper, one final exam. Minimal readings. \n"
        },
        {
            "course_name": "Brain Evolution: Becoming Human",
            "review_date": "December 25, 2010",
            "review_content": "\nBrain Evolution: Becoming Human\nThis was a great class although one session a week was hardly enough to cover the material. He manages to make you curious about things that others make seem dry while not reiterating things that either you should know or is presented in papers, which are posted weekly.\nLectures and power points are posted and he follows pretty closely, however stories, including questions raised by other students, make attending beneficial and enjoyable. \nI'd recommend this class for anyone with an interest in psychology, neurobiology, anthropology, or general interest in any combination of those subjects.\nHe makes himself available and has interesting knowledge on a very wide variety of topics. \n\nWorkload:\n 1 midterm, 1 final, 1 power point presentation on a paper of your choice. 1-3 papers weekly, usually fairly short (and usually interesting) 2 hour class 1 day a week (class goes by quickly!)\n"
        }
    ]
}