{
    "prof_info": [
        {
            "prof_name": "Jason Buhle",
            "prof_id": 12315,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Mind, Brain, and Behavior",
            "review_date": "May 23, 2012",
            "review_content": "\nOverall, I was pretty happy with this course. Professor Buhle is a solid professor who does his best to present the material concisely and effectively. Although going to lecture is not an absolute necessity, I would ultimately say that it helps because some of the material is not easy to learn by yourself from the book. First of all, the book is not the greatest for a variety of reasons, but mostly because the figures are often confusing and sometimes downright useless. Second of all, Prof. Buhle really does a nice job extracting the key points from each chapter and simplifying the material so that it was clear to understand. He also always used \"alternative\" teaching methods, such as having no-points check-in quizzes at the start of class to jog everyone's memory. My only gripe with this is that the check-in quizzes actually ended up wasting a lot of class time. Class started at 9:10, and it would often get until 9:30, and we still would not have actually started the lecture yet, but would still be doing the quiz. However, I did appreciate his effort to implement these quizzes, and I think they were effective and helpful on the whole. My recommendation for the future would be for him to continue having the quizzes, but less often so that less class time is wasted (towards the end of the semester we had them almost every lecture).\nRegarding the grading: I guess I should start by saying that I received an A+, but so did 26 other people out of 146 total students, so it's not that impressive (these numbers are 100% real because Prof. Buhle sent out the final grade distribution to everyone). So it's clear that a ton of people, including me, did very, very well, and I am admittedly a little biased when I say that it was pretty darn easy to get a good grade in this class. Exam 1 was really easy and Exam 2 and the final, while they were harder, were not that bad (Exam 2 had a generous curve as well, and I'm sure the final was curved too). That being said, OH MY GOD THE EXAMS (#2 and the final) COVER SO MUCH MATERIAL. Over the course of the semester, I spent on average about 1-3 hours studying for this class each week (basically just doing the extra credit self-tests), which is pretty low, but I spent hoursssss studying the days before the exams. Exam 1 is fine (and easy), but the problem is that exam 2 covered like 15 chapters or something, which is kind of a lot, and the final is cumulative (covered like 30 chapters!). It was just a lot of painful memorization. I almost wish we had had an additional midterm, because that would have prevented Exam 2 from covering that ridiculous amount of material. It also would have meant that the grading rubric would be a tiny bit more forgiving for people who unfortunately screw up one exam. The course had Exam 1 worth 20%, Exam 2 30% and the final 50%, so an additional midterm in there could have maybe meant that the final could be weighted less, or that a midterm could be dropped or something. I guess it ultimately didn't really matter, though, because soooo many people did so well anyways. Like I said, Prof. Buhle sent the grade breakdown out, and a ridiculous % of people got A+, A, and A-'s. I think I remember that nearly 60% got in the A range.  At the same time, as with any science class, there was a huge range, and people also did very poorly (4 people failed). But Prof. Buhle reallllllyyy gives you every opportunity to get a good grade. I mean REALLY. Not only did he give a generous curve when the grades on Exam 2 were low, there was also ridiculous amount of extra credit available (experiment participation, courseworks self tests). He even gave us one point of extra credit on our final for filling out our courseworks evaluations. He clearly was not out to fail anyone (as evidenced by the fact that 27 people got A+'s, and many, many more got A's and A-'s). I feel bad for the people who failed...but come on...he gave everyone so much extra opportunity to do well! I would definitely recommend this class, especially to someone who is confident with his/her ability to memorize a large amount of material -- you'll probably do extremely well. However, it isn't the best class to take if you're just looking to satisfy the science requirement or if you are not good with rapidly memorizing and cramming -- you might not (probably won't) do well.\nSummary: The information was generally interesting, I personally found it relatively easy to get a really good grade, and the professor is enthusiastic, knowledgeable, and effective. I really appreciate Prof. Buhle's level of engagement with the students. Out of all the professors I've had so far at Columbia, he is definitely the one who most actively engaged the students outside of class. He was always sending us e-mails with helpful updates (such as the fore-mentioned grading breakdown), and everyone could tell that he was just so genuinely passionate and willing to help students. He made pleas at the start of almost every lecture asking students to come to office hours -- he really was just so eager to help. I regret never going to his office hours because he seems like such a nice guy.\nRandom note: Prof. Buhle kinda looks like James Franco, am I right??? Kinda sorta maybe? Not bad...not bad at all. Hope I'm not just crazy. \n\nWorkload:\nOptional extra credit: self tests, experiment participation. 2 midterms and a final. I spent 1-3 hours a week studying on average (so pretty little), with the exception of the weeks where we had exams, where I spent many more hours on the class.\n"
        }
    ]
}