{
    "prof_info": [
        {
            "prof_name": "Morgan Pecelli",
            "prof_id": 3031,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 03, 2007",
            "review_content": "\nMorgan's attempt at writing her own CULPA review and hoping to escape unscathed is both pathetic and disgusting. What kind of professor writes their own culpa reviews in desparate attempts to defend themselves. This completely undermines the sincerity and honesty that CULPA provides.\nOn to her class. The workload is ridiculous. She doesn't know what she's doing. The discussions and assignments are pointless. The midterm and final are ridiculously difficult and fail to provide me an opportunity to truly visualize and dissect these texts in the sacred realm that is contemporary civilizations. I am duefully appalled at Morgan and hope that she doesn't repeat this disgusting action.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 16, 2007",
            "review_content": "\nSimply put, Morgan is not a good CC Professor. Sure, she is friendly and approachable, but you will not learn anything in her course. This is her first time teaching CC and her first time reading many of the texts, and she knows absolutely nothing about the historical background (something I find very important for these texts). She only sent out the most random emails that didn't do anything except fill our mailbox with junk. Her discussions are random, pointless, and boring. Class dragged on forever. If this isn't bad enough, she gave massive amounts of work: required responses for EVERY class, daily reading quizzes for most of the semester, 4 essays (yes there were four essays, as written in the syllabus), lots of reading. Contrary to the review below, she never told us to forget about grades and truly learn. Instead, she wrote, again in the syllabus, the mean would be a B no matter what! Most of us in the class put in a lot of work, but got no results. If you want to learn something in CC, don't make Morgan. \nWorkload:\ndaily responses that must be posted 6 hours before class, daily reading quizzes, 4 essays, midterm, final \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 29, 2006",
            "review_content": "\nThe previous review is inaccurate and unfair.  Morgan is both extremely accessible outside of class, and readily willing to provide help.  While she is admittedly not an expert in the texts (she is an anthropologist), her help is always constructive - she provides all sorts of supplementary materials, such as audio and video clips, to guide our understanding of the texts.  WhatÂ’s more, she prepares lengthy section notes for each text, emailed in advance, with thoughtful questions to guide reading and studying.  As far as papers are concerned, Morgan creates careful constraints that allow for creativity while at the same time really force you to become a better writer.  She is also readily available to help in the writing process - I sent her a one page outline of a paper, and within a few hours, Morgan sent me back several pages of point by point commentary on my ideas.  \nTo focus on MorganÂ’s grading system is to entirely miss the point of higher education at an institution like Columbia.  I spoke with Morgan about her system, and she said that she devised it in a way that was intentionally disorienting, so that students would stop focusing on their grades and start caring about what they are actually learning.  (And, as an aside, the papers are not graded out of whole numbers. If you get an 8.5 on a paper, multiply this by ten - and viola: you receive an 85 on the conventional 100 point scale.)\nTo say that MorganÂ’s running of class is Â“problematicÂ” is downright hurtful.  This woman clearly spends great amount of time preparing for class.  She knows what every student wrote in his or her reading response, even those submitted just an hour before class.  Yes, there are lulls in discussion.  But to blame these entirely on Morgan is simply ridiculous.  DonÂ’t the people in a class have as much impact on the flow of discussion as the material and the professor?  I certainly think so, as I like to feel as though education is participatory and performative, flowing as much from professor to student as from student to professor.  And the CC head sat in on every class.  And sure, he gave Morgan some suggestions which changed some aspects of class: this is her first semester teaching CC, clearly someone who is the head of the department is going to be able to give her constructive feedback. She, like all of us, is fallible, after all.\nWhile I would agree that the midterm was an unpleasant experience, I think that this is an example of MorganÂ’s ability to be flexible.  Several students, myself included, spoke with her about the midterm, and the final was different.\nI donÂ’t even know how to address the way in which the previous review discusses class time.  Â“PedanticÂ”?  Morgan isnÂ’t a lecturer.  She is not trying to force certain information upon us.  CC is a discussion-based course.  As I mentioned above, education is participatory. To change the direction of one of MorganÂ’s discussions, one needs only to raise his or her hand.  The point about the discussion of religious texts illustrates my point.  It was blatantly clear during the discussion of religious texts that students in the class were annoyed that they had to read such texts.  It seemed students thought that because they donÂ’t believe in the particular religions the texts espouse that they are not affected by these texts. What? This is Western Thought weÂ’re talking about.  Nobody exists in a cultural bubble.  I donÂ’t care if you have never seen a bible in your life.  If you have grown up in the West, youÂ’re very conceptions of morality and self (to name just a few) are inseparably tied to these texts.  This is no Â“Sunday-\nschool teacherÂ’s nightmare, completely unguided,Â” this is the refusal of students to actively engage in texts that they deem irrelevant and irrational. \nOn to the work load.  We did not have four papers.  We had 2 five-page papers, one art project (which gave complete creative freedom), and one 2-3 page Â“policy brief.Â”  Morgan has even suggested that this workload will be diminished next semester.  Not to mention the fact that our readings are substantially sized down compared to other CC classes.  We have between 50 and 70 pages to read per class, which, both because of the denseness of the material and because Morgan understands that we have higher priorities than CC, is extremely helpful.  Also, Morgan is constructing the syllabus for next semester almost entirely based on student requests (weÂ’re adding such authors as Said and Baudrillard).  \nIn short, I highly recommend Morgan, and would not want to take CC with anyone else.  \nWorkload:\nTwo 5-page papers, one art project, one 3 page policy paper, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 14, 2006",
            "review_content": "\n The previous review is grossly inaccurate, unfair, and simply untrue.  IÂ’ll try to take it apart sentence by sentence.  Morgan is both extremely accessible outside of class, and readily willing to provide help.  While she is admittedly not an expert in the texts (she is an anthropologist), her help is always constructive - she provides all sorts of supplementary materials, such as audio and video clips, to guide our understanding of the texts.  WhatÂ’s more, she prepares lengthy section notes for each text, emailed in advance, with thoughtful questions to guide reading and studying.  As far as papers are concerned, Morgan creates careful constraints that allow for creativity while at the same time really force you to become a better writer.  She is also readily available to help in the writing process - I sent her a one page outline of a paper, and within a few hours, Morgan sent me back several pages of point by point commentary on my ideas.  \nTo focus on MorganÂ’s grading system is to entirely miss the point of higher education at an institution like Columbia.  I spoke with Morgan about her system, and she said that she devised it in a way that was intentionally disorienting, so that students would stop focusing on their grades and start caring about what they are actually learning.  (And, as an aside, the papers are not graded out of whole numbers. If you get an 8.5 on a paper, multiply this by ten - and viola: you receive an 85 on the conventional 100 point scale.)\nTo say that MorganÂ’s running of class is Â“problematicÂ” is downright hurtful.  This woman clearly spends great amount of time preparing for class.  She knows what every student wrote in his or her reading response, even those submitted just an hour before class.  Yes, there are lulls in discussion.  But to blame these entirely on Morgan is simply ridiculous.  DonÂ’t the people in a class have as much impact on the flow of discussion as the material and the professor?  I certainly think so, as I like to feel as though education is participatory and performative, flowing as much from professor to student as from student to professor.  And the CC head sat in on every class.  And sure, he gave Morgan some suggestions which changed some aspects of class: this is her first semester teaching CC, clearly someone who is the head of the department is going to be able to give her constructive feedback. She, like all of us, is fallible, after all.\nWhile I would agree that the midterm was an unpleasant experience, I think that this is an example of MorganÂ’s ability to be flexible.  Several students, myself included, spoke with her about the midterm, and the final is going to be different.\nI donÂ’t even know how to address the way in which the previous review discusses class time.  Â“PedanticÂ”?  Morgan isnÂ’t a lecturer.  She is not trying to force certain information upon us.  CC is a discussion-based course.  As I mentioned above, education is participatory. To change the direction of one of MorganÂ’s discussions, one needs only to raise his or her hand.  The point about the discussion of religious texts illustrates my point.  It was blatantly clear during the discussion of religious texts that students in the class were annoyed that they had to read such texts.  It seemed students thought that because they donÂ’t believe in the particular religions the texts espouse that they are not affected by these texts. What? This is Western Thought weÂ’re talking about.  Nobody exists in a cultural bubble.  I donÂ’t care if you have never seen a bible in your life.  If you have grown up in the West, youÂ’re very conceptions of morality and self (to name just a few) are inseparably tied to these texts.  This is no Â“Sunday-\nschool teacherÂ’s nightmare, completely unguided,Â” this is the refusal of students to actively engage in texts that they deem irrelevant and irrational. \nOn to the work load.  We did not have four papers.  We had 2 five-page papers, one art project (which gave complete creative freedom), and one 2-3 page Â“policy brief.Â”  Morgan has even suggested that this workload will be diminished next semester.  Not to mention the fact that our readings are substantially sized down compared to other CC classes.  We have between 50 and 70 pages to read per class, which, both because of the denseness of the material and because Morgan understands that we have higher priorities than CC, is extremely helpful.  Also, Morgan is constructing the syllabus for next semester almost entirely based on student requests (weÂ’re adding such authors as Said and Baudrillard).  \nIn short, I highly recommend Morgan, and would not want to take CC with anyone else.  \nWorkload:\n2 papers, an art project, a 2-3 page \"policy brief,\" daily reading responses, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 13, 2006",
            "review_content": "\nMorgan is clearly still trying to get it together, and failing most of the time. Apart from being a nice person and willing to help, her help is usually not constructive. Her grading makes no sense at all, she devised a system that ends up really screwing people over (i.e. grading 5 page papers out of 10 in whole numbers). Her way of running class is so problematic that the head of CC came to sit in on the class and initiated a lot of changes, like eliminating the daily reading quizzes (yes, she had daily reading quizzes!). Her midterm was absurd- questions in list format, unnecessary memorization, not enough analysis, it didn't test on understanding in the least. The discussions are irrelevant, circular, unproductive, and when not entirely abstract, pedantic and obvious. I feel I get nothing out of classtime that reading the texts carefully wouldn't accomplish. Worst of all, discussions of religious texts devolve into a sunday-school teacher's nightmare, completely unguided. \nWorkload:\nFour papers (she's completely crazy), the occasional in class quiz, short graded responses before each class, midterm, final. \n"
        }
    ]
}