{
    "prof_info": [
        {
            "prof_name": "Theodore Hughes",
            "prof_id": 2610,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Korean Literature and Film",
            "review_date": "January 19, 2011",
            "review_content": "\nThe previous reviewer summed it pretty well, so I will make it short.\nTake this course!\nProfessor Hughes is genuinely interested and very knowledgable. He tried to provide many different points of view and does not impose his own view onto his students. The film selection is a great mix from 1940's to 2010, most of which are very interesting and often thought-provoking. The readings were decent, and oh, having the autual Korean writers in class was great (He invited Shun Kyungsook and Kim Youngha to class)!\nGrading is also generous, and the TA (Jon) was really nice.\nWorkload:\nManagable.\nWeekly postings, 1 midterm, 1 take home final, 1 long paper, 1 group presentation.\nHe also gave out extra credit assignment.\n"
        },
        {
            "course_name": "Korean Literature and Film",
            "review_date": "January 05, 2011",
            "review_content": "\nThis class infuses a lot of history alongside literature and film. Professor Hughes' lectures provide you with snapshots of the different kinds of literary and artistic movements that arose in Korea during the country's different historical periods: colonization, post-colonization, Korean War, modernization, as well as aspects of North Korean history. Even if you are Korean or Korean-American you will learn something new about Korean history and definitely get a good dose of quality Korean films and literature. This semester he invited two authors to speak to the class and do some Q&A.; It was fantastic. You rarely get that in other lecture classes. He's also very patient and thorough in all of his explanations of class expectations, guidelines and class format. \nClass structure:\n1 day per week movie screening (optional attendance, but if you don't go you really miss out.)\n1 day of lecture on historical background, key players, movements, definitions, plus film review. \n1 day of lecture on literary movements and close reading analysis. \nYou also give a class presentation with your classmates. This is a fun project. \nAlso, take advantage of office hours. Even if you feel like you learned everything for that week, he gives you a fresh take on it during office hours. \nI understand that some people might not be 'blown away' by his lecture-style, but he's eloquent succinct and well-informed. He's also sensitive to controversial topics that might dominate the news headlines, which is refreshing. \nGo ahead, take it. \nWorkload:\nWeekly postings about the movie. \n1 midterm\n1 final (this past semester was take-home)\n1 medium length paper (12 pages?)\n"
        },
        {
            "course_name": "Korean Literature and Film",
            "review_date": "May 18, 2009",
            "review_content": "\nI took this class to fulfill a major culture requirement and it ended up being one of the most enjoyable classes I had. It was amazing to learn Korean history through its literature and films, and I enjoyed most of the readings and films we read or watched in class. I am a Korean, so I have to say I might have had some background knowledge to begin with, but I still learned a lot about modern Korean history in a global and less nationalistic perspective. The class definitely had a post-modern tone to it, as we frequently discussed gender and colonialism. We also talked a lot about the relationship between literature and film. Overall, it was a joyful class, and the grading was generous. \nWorkload:\nIn-class midterm, 8 page essay, take-home final, a 2 pg film response, weekly coursework postings, 2-3 short stories/articles a week, and a group presentation.\n"
        },
        {
            "course_name": "Korean History & Literature classes",
            "review_date": "May 02, 2009",
            "review_content": "\nTed Hughes is an amazing professor. He's incredibly erudite, great at situating any text or film in the context of both Korean and global history and brings in a lot of interesting readings and films that spark a lot of discussion and interesting posts. He's also just a really nice human being in general. Unlike some professors, you can argue with his opinions about the texts and films in class and he will not only listen to you and respond but also thank you for your input. \nHe does have a tendency to stare at the ceiling which I didn't think was a really big deal. For one, Prof Hughes really cares about his students. If you ask a question, he really takes the time to answer it. He doesn't require you to buy 120 buck coursebooks. All the readings, which were light and doable, were uploaded onto Courseworks. He even put in a list of his recommended film texts for those who had further interest in Korean film. He does use Korean words in class but he always follows up with an explanation and writes down the romanization on the board.\n\nWorkload:\nWeekly postings, midterm, paper, take-home final. \n"
        },
        {
            "course_name": "Intro to Korean Culture",
            "review_date": "June 06, 2006",
            "review_content": "\nProf. Hughes is not a hit or miss, he is simply a miss. \nAlthough I do highly admire his extensive knowledge of Korean culture, he presents it in such a way that is sometimes difficult to understand. He lectures as if everyone in the class is a Korean culture expert. Another thing that really bothered me is the fact that he always looked at some invisible line just above everyone's head, so even if you raised your hand to ask a question, he either didn't see it or was just ignoring you. Most of the classtime was spent on him analyzing various works of Korean literature, which although highly interesting, were difficult to understand without some sort of information on their historical context.\nWorkload:\nHeavy. A lot of reading, a lot...\n"
        },
        {
            "course_name": "Introduction to East Asian Civilizations: Korea",
            "review_date": "August 30, 2005",
            "review_content": "\nTeddy Hughes is a hit or miss. You will either learn a ton about Korean literature (its more a lit class than a history class) or come out feeling like you wasted an entire semester on nothing. His style is a bit quick - doze off for a second, and you will have missed the entire analysis of one of the shorter works. You kinda have to pysche yourself up for this class. Just wandering in will leave you clueless and bored, sitting in the back doing crossword puzzles from the spec. Try to pay attention, you might learn something. Stay interested. If not, you won't have a clue what he's talking about. Esp cause he likes to throw Korean out left and right, and rarely writes anything on the board except Korean.\nWe watched a few movies towards the end of the class. That was kinda fun and a good break from the high speed literature lectures. The shorter ones you don't really have to pay attention to. The 2-day + ones are essay topics for the final.\nHis grading is quite lenient, as long as you pay attention in class. Take a risk or two in your essays, and that'll nail you that A. Otherwise, I'd say this is an easy B+ with minimal work. (Dumb essays with simple analyses, however, will net you a dumb grade.)\nWorkload:\nHeavy reading due each class - 1 MT, 1 3p Paper, 1 5-7p Paper, 1 In-Discussion Presentation, Take-Home Final.\n"
        }
    ]
}