{
    "prof_info": [
        {
            "prof_name": "Irving Kalet",
            "prof_id": 2439,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Communication Systems",
            "review_date": "May 22, 2015",
            "review_content": "\nIrving Kalet is the man. I would say this class is one third a history lesson. Kalet loves to bring context to the material he teaches, which I really enjoyed. I felt like he genuinely wanted to share his love of communications with his students. He manages to bring up Picasso in a EE class and cannot stop talking about how Hedy Lamar is \"the most beautiful woman in the world\". I also live for every time he brings up cellular communications. He ALWAYS asks for a student's phone, holds it up, points at it a few times, talks a bit more about cellular communications, then returns it. Priceless. \nI highly recommend this class. In the EE course flow, you're given the option between Computer Networks and Intro to Communication systems. If you're at all interested in Communication Systems and want an easier class, definitely take E3701.\nWorkload:\nThe workload is relatively low. Kalet assigns problem sets once a week and the TA basically just checks that you wrote something down. The problem sets are graded based on \"effort\". There is one midterm and one final. If you do worse on the midterm than the final, Kalet will drop your midterm grade. Kalet also gives multiple practice tests for both the midterm and final. He usually puts similar material every year, so the tests aren't difficult.\n"
        },
        {
            "course_name": "Random Signals & Noise",
            "review_date": "May 03, 2012",
            "review_content": "\nThis was a great class.\nKalet covers random processes, analog modulations (using random processes to calculate the real signal to noise ratios, not the fake ones you'll cover in 3701), matched filters, linear estimation and parameters estimation.\nBasically, it's a course that uses probability to do fun things, which is about infinitely more enjoyable than a probability course.\nHe always makes sure to review any topics that you'll need to know, like probability or modulations, and his lectures are well organized and thorough. He also likes to slip in historical fun facts about the engineers who pioneered these topics.\nEasy to talk to, and available if you need help. This is fun course, and if you attend class and do the homework it won't be too challenging.\nWorkload:\nWeekly p-set\n1 midterm\nfinal\n"
        },
        {
            "course_name": "Intro to Communication System",
            "review_date": "January 20, 2005",
            "review_content": "\nThe Best EE professor I've ever had. Professor Kalet is an expert in modulation and his broad knoweledge in the communication industry makes the lectures very interesting. Very good at delivering the course materials. \nAlthough the textbook he uses, \"Communication Systems\", by Simon Haykin, covers a lot more than what needs to be taught in the course, but when you read the acknowledgement, it explains everything.\nIf you are an EE major, and need to choose between 4710 Intro to Network Engineering and 3701 Intro to Comm. System, I strongly recommend 3701.  3701 is a lot easier and the lectures are more enjoyable.     \nWorkload:\nweekly ~ biweekly hws.1 midterm covers analog modulations 1 final covers digital modulationsboth exams open book\n"
        }
    ]
}