{
    "prof_info": [
        {
            "prof_name": "Matthew Birck",
            "prof_id": 2919,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "May 10, 2006",
            "review_content": "\nI should preface what I'm about to say by mentioning that this was Birck's first time teaching a lecture course, not only at Barnard, but ever.  With that in mind, you'd think that being so close to college himself, he'd remember that grades do matter.  In any case, Professor Birck's class was an absolute nightmare.  The lectures were based on slides that were copied directly from the textbook which he hates so much.  He ran through slides with pictures of large complex molecules and showed mechanisms with a laser pointer.  He used the blackboard maybe 5 times in the whole semester to draw out a full mechanism.  Good luck finding any in the book.  Every morning he came in and informed us \"it's Monday\" or \"it's Friday\" almost as if an excuse for how tired he was or how incoherent his lecture was about to be, so it was somewhat surprising how he managed to speed through every lecture.  But worry not, nothing that was mentioned in class will be relevant any time you are tested in that class.  The two midterms were take-home, and only an exercise in who could google and/or use wikipedia the best.  The questions were far from specific, and when he made the test more specific, he still expected certain information that he had not asked for.  The worst though, was that the questions had very little to do with anything that he ever mentioned in class.  The only way to begin to answer them was to use Google.  How scientific.  The final was a bear- open book/slides/notes, but very long, asking for things we were told we didn't have to know or asking about enzymes that were mentioned in one paragraph of one page of the textbook.  Many of the main themes we covered in class we were never even tested on.  Basically, go to class, don't go to class- it's your call because it makes no difference anyway.\nWorkload:\nTwo take-home midterms: I hope you're familiar with wikipedia.\nOpen book/notes/slides final- very long and irrelevant to much of the course.\n"
        }
    ]
}