{
    "prof_info": [
        {
            "prof_name": "Mark Phillipson",
            "prof_id": 4986,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 21, 2010",
            "review_content": "\nGreat teaching and a really good guy - highly recommended.  He was always really well prepared and got most of the class involved in discussion.  He wrote more comments than any other teacher I've had.  I really think he helped my writing.  I couldn't go to his office hours but when I talked to him after class he was happy to talk and gave good suggestions.  I feel luck that I had him for Lit Hum.\nWorkload:\nStandard Lit Hum\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2010",
            "review_content": "\nI don't normally post reviews of anything but I can't believe that last review.  I switched into Mark's section half way through and the difference was like night and day.  He was totally motivated with a humorous approach, he kept the class really engaged with discussion.  I always looked forward to it. There were a lot of strong personalities in our class and he was great at bringing everybody in without demanding a set way of understanding the text.   The wiki was kind of time consuming at times but I liked seeing what other students were doing.  Projects were a nice alternative to essays.  He also added Alice in Wonderland to the syllabus, which I loved.  This was the best class I had last year and one of the best I've had at Columbia.  PS the pizza actually kind of sucked, but it was free so I can't complain.\nWorkload:\nWeekly posting, essay, project, midterm, final.  Tons of reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 08, 2010",
            "review_content": "\nClearly, the previous post was written by Mark himself - please disregard it!  Listen up, kids:  THIS PROFESSOR'S A JERK (to put it nicely).  I have compiled a list of reasons why one should not enroll in this guy's class...it goes like this:\n1.  It's true - He gets his notes from Wikipedia. \n2.  He's just, well, not that interesting! - although, he thinks he's super cool and funny.\n3.  If you pose a conflicting idea to the discussion, he WILL either dismiss it/you entirely or laugh.\n4.  His discussion aren't very thought provoking.\n5.  He doesn't communicate effectively - you'll never know exactly what he wants (truly).\n6.  Weekly mini essay assignments, which must be posted to a wiki; these become a pain in the butt, especially if you have a full load or aren't a good writer.\n7.  The mid-term is unreasonable, under the time constraints...you will be writing and writing and writing.\n8.  And, lastly...if you are an introvert, DO NOT TAKE THIS COURSE!  You will be picked on, receive poor grades, and/or worse - be compelled to go to his office hours WEEKLY (ugh)!\nSo, the moral of the story is, kids:  If you're smart...you won't take a class with Mark, unless you want pizza at the end of the term, that is!\nBye.\n\nWorkload:\n(12) Weekly mini-essay assignments; (2) Essays; (1) Mid-term; (1) Final; Participation (in-class, office hours and/or additional postings to the wiki).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 21, 2009",
            "review_content": "\nPLEASE IGNORE THE TWO NEGATIVE REVIEWS. THOSE PEOPLE ARE LOSERS WHO DROPPED OUT BECAUSE THEY COULD NOT HANDLE LIT HUM AND DIDN'T GET THEIR LITTLE A's. Let me first start by saying that I have never read any other book besides Harry Potter in my life prior to Lit Hum, and I enjoyed every minute of it because of Mark.\nHe's a great teacher, energetic, exciting, makes the class very lively, always has a smile on his face, and encourages ideas of all kinds. You can basically tell him that the sky is green and that the world is flat and he will gladly accept your ideas, as long as you have reasonable evidence to support your claim. He keeps the discussion within the context of the lit hum books (which is why the above losers dropped out because they wanted to expand the discussion to society and other mindless areas). \nHe also likes to make the occasional pop-culture reference to books as well as briefly enact some traits of some of the characters, which tends to keep the class engaged. Not even 10 mins passes by without us laughing at some insightful joke he makes up.\nOffice hours are also very helpful. He greatly helped me formulate my ideas and essays for the books.\nTake him as a professor if you want to have a good time in Lit Hum, and I'm saying this even though I'm a guy who used to hate reading books, yet this class has taught how to appreciate them once again. (and he hosts pizza parties at the end of the semester!!!)\n\nWorkload:\nREASONABLE. Weekly posting assignments are usually given on the weekend and due on Wednesday. And this is very helpful since we have discussions about the book on Mondays, then his office hours are on Tuesdays, which then allow you alot of opportunities to formulate your ideas for your post. It's only usually about 200 words or so.\n2 essays - talk to him about your ideas since he's very helpful\n1 midterm - reasonable. Just read the books, look over class notes and you'll be fine.\n1 final - same as the midterm.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 21, 2009",
            "review_content": "\nI thoroughly enjoyed this class.  Mark is energetic and is raises good questions to get discussions going.  He does kind of pick favorites based on good weekly postings, and sometimes he lets the loud mouths of the class monopolize the conversations a little too much and doesn't pester the quiet people enough, but this encourages the eager student to write better and speak up more.  He grades pretty hard, if you're \"average\" you'll get a B, which most people probably aren't used to getting.  He's a really nice guy, though.  Go to his office hours and he'll be very helpful about what he wants to see in an outstanding weekly posting, and he'll like you more the more he gets to know you.\nWorkload:\n2 essays, one midterm, the standard final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 11, 2009",
            "review_content": "\nI only slightly agree with Mark's previous reviews. I felt very prepared for the first semester final, whereas I would hear students from other LitHum classes say they weren't prepared in the least. In class there is actual discussion and he tries to get everyone to contribute. He might not get his information from the best sources, but that doesn't mean they're any less accurate. Not a great professor, but not horrible either.\nWorkload:\nWeekly online postings, 2 essays, midterm, and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 18, 2009",
            "review_content": "\nFeel very unlucky if you get this guy as a teacher. He has no idea what he's doing. I think he gets his notes from Wikepedia. When we were supposed to be reading Oedipus he came to class with The Medea, and then proceeded to make the whole class talk about their ideas for an upcoming paper, FOR A WHOLE HOUR! He finally went to get the book during a class break. The bottom line is his class is boring, and he gives stupid weekly postings that are truly annoying. Anyone with an opposite view  is brushed off during discussions. The only plus side to this class was that he gave us free pizza at the end of the semester. \nWorkload:\nTypical lithum, WPs or Weekly Postings on the Columbia Wiki online,   2 esssays, a midterm and a department final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 2008",
            "review_content": "\nUgh! I despised every minute of this class. If you get him as a teacher, SWITCH! The class was so boring. He read his notes from Wikepedia, and had no background knowledge of the works(they were Wikepedia's!). The day that we were to discuss Oedipus, he came to class with The Medea in hand. He picked favorites during the first few weeks, and  they were the ones who took over class discussions. Anyone who had an idea that was different from else's was cut off from  discussion. He also gave weekly assignments called WPs(done online on the CU WIKI) that were just a pain in the ass. He seems nice, but beware!! If you're a great BS-er, you'll probably love this class, though.\nWorkload:\nWeekly Postings or WPs, the usual lithum stuff(Two essays one 3 to 4 pageS, another 5 to 7)\n"
        }
    ]
}