{
    "prof_info": [
        {
            "prof_name": "Ronald Briggs",
            "prof_id": 4850,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II",
            "review_date": "August 28, 2015",
            "review_content": "\nProfessor Briggs' W3350 class was not easy for me. I struggled with Spanish in nearly all areas - writing, reading, speaking, listening, cultural understanding, etc., but go to his office hours, and he'll be pretty helpful in regards to how you should fix up your essays (which are probably the most important part of the class grade). He's a good guy, but he's not wary of asking questions that are difficult to answer immediately, and he's not afraid to tell you straight-up that you're not thinking far enough for your essays. Be prepared to work hard, and you should be fine. \nWorkload:\nWe went backwards through history, reading texts that were more modern first and going back to the 1700s at the end of the semester. The readings were usually about ten pages or so, but very dense and difficult to get through. We would also have to form questions regarding the text, and then research more information to answer our own questions (research would have to be cited from reliable sources). You'd write this research into a short paragraph and upload it online. Most classes, we would start off by naming themes in the reading, then it would be someone's turn to present on the author of the day, then we would go back to the themes, break up into groups and read the uploaded homeworks to see what new information we could draw out about the themes. \n4 essays, 1 presentation on author, daily readings and daily research paragraphs   \n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "April 18, 2014",
            "review_content": "\nHe truly cares about his students. He spends time in class making sure everybody understands assignments and what he expects. The readings he chooses are all interesting, but it is possible to get away with not doing some of the readings. He provides thoughtful comments on essays that really helped me improve as a writer. Keep in mind that he expects 2 drafts of every essay and grades BOTH of them. Your total grade for that essay will be the average of the 1st and 2nd drafts. I would definitely recommend his first-year seminar class.\nWorkload:\n2 essays, 2 presentations, participation\n"
        }
    ]
}