{
    "prof_info": [
        {
            "prof_name": "Gene Henry",
            "prof_id": 11093,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Earth's Environment System: Climate",
            "review_date": "December 30, 2010",
            "review_content": "\nThis class has to be my biggest disappointment at Columbia thus far.  The class was, at times, pathetically redundant with the Frontiers of Science curriculum, which itself was often pathetically redundant.  The class's makeup also seemed to be averse to learning Environmental Science itself, as most students were either Sustainable Development Majors or were there for the Science Requirement.  Thirty minutes of a class were once spent on explaining why the seasons occur, and amazingly several members of the class were still confused.  The subject matter was tragically interesting - the first half of the semester, taught by Jason Smerdon, dealt with Atmospheric Circulation and Weather Systems.  Although at times he came off as shallow, Smerdon was extremely charismatic and held the class's attention quite well.  The second half of the semester was taught by McManus, and although he came off as more intelligent than Smerdon, his lectures sometimes rambled and his class notes were not helpful with studying, consisting mostly of pictures and scanned scribblings.  His lectures focused on Deep Ocean Currents but also spent way too much time on the same 3 ideas about Climate Change.  \nI would have liked to call this an \"easy\" class due to its sparse and repetitive subject matter but this was not an \"easy\" class.  Even if you pay attention and take notes in class, and even if you read the optional readings from the textbook, I still cannot say you're going to get an A in this class.  The weekly labs were a shitshow.  The TAs came disastrously unprepared to labs, which as the semester progressed often required downloading glitchy software that the TAs did not understand how to use and also failed to tell us to download in advance.  Most labs consisted of inputting data into Excel and making graphs over and over again.  It did not matter if you understood the subject matter (which was often a painfully basic grasp of Climate Change), but a few formatting errors in Microsoft Excel or Word could cost you one or two letter grades.  The TAs often didn't respond to emails sent regarding formatting yet penalized students harshly on formatting when grading labs.  Their grasps of labs' actual content were also maddening, and they were often bitter and angry when politely challenged.  If these people are on the front lines of environmental change and study, we are fucked.\nIt is seriously unfortunate that this class is a requirement for an EESC degree, as this completely turned me off to the entire department\nWorkload:\nextremely redundant and painful weekly labs worth 30% of grade, P/F homeworks worth 10%, 30% midterm, 30% final\n"
        }
    ]
}