{
    "prof_info": [
        {
            "prof_name": "Ursel Schlicht",
            "prof_id": 9695,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 25, 2011",
            "review_content": "\nPretty good experience. Ursel was very flexible in scheduling the course. She allowed time for students with music experience to play short songs as the appropriate music era approached. She's very knowledgeable about the material. She can also simultaneously teach to people who are new to music and to people who have 12 years of experience.\nTwo of the concert reports were handled by default; one was an on-campus string quartet, and the other was the Met Opera. We had the freedom to choose the third concert. Reports were usually due within a week and a half. Concert reports could be done as a stream of consciousness if you know what you're talking about.\nMy only complaint was that technical difficulties sometimes wasted time.\nWorkload:\nVarious homework: sometimes listening, sometimes reading, sometimes both. Could be done in less than an hour.\n3 800-100 word concert reports\n1 quiz\n1 midterm\n1 final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 22, 2010",
            "review_content": "\nShe's a really nice woman who genuinely wants to teach something about music. Even so, it's not always clear what she expects you to get out of the lectures and some minor things pop up in the quizzes. The larger things she definitely stresses though, and it's pretty easy to tell what's important to know. \nYou do need to purchase a textbook, but the 6 cd set she requires is available in the Music Library in Dodge, so you can just load it into your itunes instead of buying the cds. \nOverall, not a bad draw for a Music Hum teacher. \nWorkload:\nRegular listening exercises and some reading out of the required textbook.\nTypical 3 concert reviews - pretty lenient grader\n2 quizzes during semester and 1 final \n"
        }
    ]
}