{
    "prof_info": [
        {
            "prof_name": "Jose Blanchet",
            "prof_id": 4995,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intro Probability/Statistics",
            "review_date": "May 23, 2013",
            "review_content": "\nI agree with the reviews below: Jose is a bad teacher, and spends excessive amounts of time teaching theoretical math. However, if you went to class and to recitations (Aya, his TA, was amazing), I felt you could do fine. He does, after all, curve. And if you're interested in modeling actual scenarios, you can learn about that from an incredibly smart guy.\nBut don't get me wrong--if you can take this class with someone else that has good reviews, do so. This class was, in many ways, torturous, and often felt like we were hitting our heads against a wall. If do you end up with him, GO TO RECITATION and office hours. \nWorkload:\nA lot. 7 ridiculous problem sets that required you to ask the TA's to explain all the questions. Two hard midterms, hard final. \n"
        },
        {
            "course_name": "Intro Probability/Statistics",
            "review_date": "May 18, 2013",
            "review_content": "\nIf you really want to be tortured during the class, take this professor. The professor neither taught the predetermined content nor explained the knowledge, which in his opinion is hard and \"useful\", clearly. \nThis is the worst class I have ever had in Columbia. I usually don't try to say something bad about something, but the school should fully instigate the professor's integrality of teaching ability to the standard of Columbia, an ivy league university. \nIf you can, DO NOT take this class. \nWorkload:\nAround 7 Homework (hard as BALLS), suprise quiz (only one time and drop the lowest one), midterm X 2 (which I don't even understand the problem. Final (like what you encounter in midterm). \n"
        },
        {
            "course_name": "Intro Probability/Statistics",
            "review_date": "May 15, 2013",
            "review_content": "\nThis was literally the worst class I've ever taken, and probably will be one of the worst classes for all of my undergraduate experience. Jose is a nice guy, and he cares about his teaching, but he is a godawful teacher. Lecture does not follow the book at all, and as a person who rarely paid attention in lecture, I literally had no idea what to study for the midterms. Unfortunately probstat is probably one of those classes that'll be useful later on... But I can genuinely say that I did not learn a single fucking thing this entire semester. What the fuck.\nThe most confusing thing for me was all the notations that are used. Jose just jumps right in and starts using all this official probability notation without any explanation as to what any of it means. Class would have been much easier if I knew what they were.\nAlso, in March, he puts up his first course evaluation. Apparently he got overwhelmingly negative reviews because he dedicated an ENTIRE lecture to attempting to refute the negative things we all had to say about him.\nWorkload:\n8 psets, lowest score dropped\npop quizzes, lowest dropped -- JOKES because there was only 1 pop quiz\n2 midterms -- class average < 50% on both of them\nfinal\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "January 18, 2012",
            "review_content": "\nI'm an undergraduate student so please keep that in mind as I review this class. \nThis is an awful class. It's incredibly stressful for someone who has had only one course in Probability & Statistics, no experience in Matlab and very limited recollection of ODE and Calculus tricks. This was the same for all undergrads in the course.\nNothing that Jose said or wrote made any sense. The lectures were way over my head but a few of the Asian graduate students followed along and had very lively debates with Jose. It's next to impossible to teach this course to undergrads and grads at the same time especially grad students who have strong backgrounds in probability. \n\nWorkload:\nThe homeworks were super tough. Luckily, a few of my friends had the homeworks from the previous semester and that's how we got by. \nThe midterm and final were impossible. I got a 48/75 on the midterm (grad and undergrad average of 64) and a 43/100 on the final...and I got a B+. But I easily could have gotten a C-. The grading is incredibly arbitrary.\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "December 15, 2011",
            "review_content": "\nI'm writing this review before my perspective of this class is colored by the final exam and my grade.\nThe good:\n1) Blanchet is highly intelligent and he seems to be working at a different level than most people. \n2) He's fairly nice and he genuinely cares about this class. He's willing to make changes if he feels that students will learn more, but has absolutely no compassion for absences or lack of motivation.\nThe Bad:\n1) He can't teach very well. From what I've heard, he's improved significantly from the previous years. However, he moves too quickly and digs into the material before he outlines what it's used for. Sometimes, his review lectures are more useful for picking up the material.\n2) The homework assignments involving programming have little to do with the examinations, which makes them tedious if you're just trying to pass the class. \n3) Blanchet enjoys challenging his students. He makes practice exams challenging, but then makes the actual exam almost exactly the same. That means that this class ends up being execution more so than problem solving. Though graduate students may not be that smart, they are much more precise than I was. \nConclusion:\nI would avoid Blanchet if I could. I feel that Mariana does a better job of conveying the information and adding relevance to the subject matter. Jose's class has felt like a random assortment of topics rather than a class to introduce statistical computing and simulation. This class shouldn't be a Ph. D seminar, let's cover the basics and explain why the topic is important. Let's not focus half the class on efficiency and reducing running time.\nWorkload:\n7 Bi-weekly problem sets, easy programming in the beginning requiring basic matlab and implementation of equations, hard programming at the end requiring problem solving and actual implementation\nMidterm was fairly straightforward and almost exactly the same to the practice. However, the material is presented to be much more daunting than it actually is and undergrads bombed the course.\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "May 13, 2009",
            "review_content": "\nLet me start off with the 2 main points of this review:\n1) Professor Blanchet is a brilliant and accomplished engineer and is in general a nice and sometimes funny person.\n2) Professor Blanchet is the worst teacher I have ever had at Columbia, in terms of both difficulty of material and lack of teaching acumen. \nBasically, you will be expected to have retained everything you have learned in ODE, probstat, stochastic, and any other math courses you have taken prior to Simulation to do well in his class. Professor Blanchet's English abilities are poor at best, and this is fine in the case of some other professors (for example, David Yao of Financial Engineering E4700); however, his language skills are poor to a point where the material isn't being correctly conveyed, and most students either doze off or leave the class in confusion. He is also very easily distracted and often goes on a wild tangent and departs from the material he is supposed to be presenting. \nThe midterm was very tough, especially for undergraduates. About 2/3 of the undergraduate class dropped the course after the midterm and in general I'd say a little less than half the class dropped after the midterm. The final is even harder as he opts to test on material that hasn't been taugh in the class in what he considers an \"educational opportunity\" to learn new simulation techniques. Wonderful. \nMy sincere word of advice: if you can, wait until Maria Cravioto teaches the class again. If you are like me and had no choice but to take it with Jose because of scheduling...welcome to club misery.\nWorkload:\n7 homework sets, can drop 1; last 2 took about 10-15 hours to figure out and program in Matlab. Midterm 30%, final 45%, both ridiculous for most undergraduates who aren't math Olympiad material.\n"
        }
    ]
}