{
    "prof_info": [
        {
            "prof_name": "Rebecca Schleifer",
            "prof_id": 12808,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Human Rights & Public Health",
            "review_date": "January 07, 2014",
            "review_content": "\nProfessor Schleifer (shly-fur) runs a fairly solid seminar. She does an excellent job of merging theory and practice, which polisci/human rights classes frequently fail to do. While a lot of the class was on seemingly random subjects, I feel like it all contributed to giving us a sense of both health in the context of human rights, AND human rights work in general. A lot of human rights classes (I'm looking at you, Intro) are rapid-fire fests of easy to memorize but academically and socially incoherent information.\nLooking back on the class, I think Schleifer tried out different teaching styles on different folks. This was a nice touch even if it didn't always hit the mark. She at least helped a class of us stay engaged when we're trying to discuss law at 8pm on a Monday, not an easy thing to do.\nSchleifer comes from Human Rights Watch, which is kind of a big deal. She brought in some incredible guest speakers, straight from saving third world prisoners from getting killed in drug detention centers or children getting poisoned in gold mines or other grave business, all of whom I guess she worked with at one point or another.\nThis was the second year Professor Schleifer taught at Columbia. Technically the class was co-taught by J. Paul Martin, who is everywhere in the human rights department, but he sat in the back for a single class and that was it. Must be some departmental bs.\nWorkload:\nNot too bad. Class attendance and participation (15%); co-leading two class discussions on assigned readings (15%); project design evaluation written as part of a group (midterm, 10pg, 25%); project design memo outlining a human rights and health investigation (final, 10pg, 45%).\nReading load is over 100 pages a week, but I don't think most people did all the reading. In any case, there's only one class per week.\nI got an A- in the class even though I think I flopped on the class participation portion. I suspect I owe my A- to the majority of the class being relatively weak writers.\n"
        }
    ]
}