{
    "prof_info": [
        {
            "prof_name": "Katalin Makkai",
            "prof_id": 1493,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "January 22, 2009",
            "review_content": "\nFirst and foremost, the Philosophy and Human Existence course material was really great. Philosophers both past and present were well represented, and the course readers were thoroughly interesting.  Be forewarned, however, that this course if NOT for those of you that lack interest in philosophy.  This is philosophy course through and through, and, in order to get the most out of this class, you will want to spend the extra time required to wrap your head around a great assortment of thinkers.  Katalin Makkai certainly knows what she is talking about when it comes to the material.  She is well versed in the ways of the French Existentialists and could talk for days about Immanuel Kant.  If there is a professor in the best position to teach this class, it is she.  Her class is, although she'd rather not call it this, a lecture course and mostly revolves around her explanations of the dense assigned readings. But if you pay attention and follow the conversation, you will take a lot from it this course.  The greatest complaint I had was with the T.A. Although the class was only about 30, all of the grades were determined by the T.A. and an outside grader. Unfortunately, when the T.A. graded the papers, he brutally (and often rudely) shredded apart every bit of it. However, the grader graded quite easily. It just depended on what letter of the alphabet your surname began with (a 50-50 throw up). I wish that Prof. Makkai had done the grading, for I feel she would have best understood the points that we, her class, were making. \nWorkload:\nNot so bad, but you MUST do the readings or you will be completely lost.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "December 13, 2008",
            "review_content": "\nThis class is great if you are up for challenging readings and concepts. There is a reading due for every class, most of which are not very long but are very intense. Prof. Makkai spends the class going over the reading which we're supposed to have read ahead of time. Even if you don't do the reading you will probably be able to figure out what is going on. She does a great job of explaining hard concepts. The readings may seem daunting but she never tests on ideas that weren't explicitly explained in class. A great introduction to philosophical inquiry but definitely not for someone who wants to slack off. Make sure to keep up with the reading! It sucks when you haven't done the reading for awhile and then you have to write a paper and go back and do it. \nNot recommended for people with short attention spans or people who aren't genuinely interested in philosophical ideas and thinkers.\nWorkload:\nReadings for each class that can be very challenging. In-class midterm with IDs and essays, two papers, and a take-home final that we had a week to do. Overall, very fair. No surprises on the tests or the papers.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "December 13, 2008",
            "review_content": "\nThis class is great if you are up for challenging readings and concepts. There is a reading due for every class, most of which are not very long but are very intense. Prof. Makkai spends the class going over the reading which we're supposed to have read ahead of time. Even if you don't do the reading you will probably be able to figure out what is going on. She does a great job of explaining hard concepts. The readings may seem daunting but she never tests on ideas that weren't explicitly explained in class. A great introduction to philosophical inquiry but definitely not for someone who wants to slack off. Make sure to keep up with the reading! It sucks when you haven't done the reading for awhile and then you have to write a paper and go back and do it. \nNot recommended for people with short attention spans or people who aren't genuinely interested in philosophical ideas and thinkers.\nWorkload:\nReadings for each class that can be very challenging. In-class midterm with IDs and essays, two papers, and a take-home final that we had a week to do. Overall, very fair. No surprises on the tests or the papers.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "May 20, 2004",
            "review_content": "\nReadings were tough.  She was very helpful after classes and she tried hard to explain things to students (although in a very philosophical manner).  THe sad part is that she kinda threw us into the pool of complication without telling us how to swim out of it.  You better take notes in class because you'd have to depend on it when it comes to BSing the phil papers.  I have to confess that I \"B*S*\" my way throughout the course......based on the note of course. i got an A-.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "May 02, 2004",
            "review_content": "\nKatalin Makkai is a wonderful professor.  Her lectures were extremely interesting, and more often than not they were in fact interesting *discussions*, rather than just only her speaking.  She always had interesting things to say, and is very knowledgable, and was interested in what the students thought too.  Very fair grading.  The readings could be tough, but many were interesting, and they sparked very interesting discussion.  I highly recommend this class, and this professor.\nWorkload:\nModerate reading, in-class midterm, one 5 page paper plus rewrite, one 5 page final.\n"
        },
        {
            "course_name": "Aesthetics and Ethics",
            "review_date": "May 01, 2003",
            "review_content": "\nThis course was unlike any philosophy course I've taken.  While I can't say that it met my expectations (I expected to read Adorno and Cassirer and stuff) I really enjoyed the class.  And the variety and relevance of the texts was impressive. The professor encouraged class discussion- I only wish that we had had more time.  The movies were a fun way to bring life to philosophical ideas (and, by the way, provided a pretty great introduction to modern classics of American film)! In short, a fun course.  If you are interested in some diverse food for thought, classic film, and an opportunity to engage creatively with the class material, then you'll appreciate the opportunity.\nHer quirky teaching style takes some getting used to, but she is very approachable.  I felt very comfortable expressing my thoughts, both in and out of class.  The workload was very light- I'd almost liked to have had the opportunity to write more. \n"
        },
        {
            "course_name": "Aesthetics and Ethics",
            "review_date": "April 28, 2003",
            "review_content": "\nProfessor Makkai is wonderful-everything you would expect from someone with a Ph. D from Harvard-except pretentious.  She is incredibly knowledgable and finds a way to present even the most complicated material in an interesting way that someone with no experience in philosophy can understand.  Plus, she is the most approachable professor I have ever had at Barnard.  The paper topics are broad and allow lots of room for creativity.  She is a very fair grader. The films are fun and highly relevant to the rest of the material.  If you are at all interested in philosophy or film or just want a to take a course with a great professor, I totally recommend this course!\nWorkload:\n2 5-page papers and a final\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "April 22, 2003",
            "review_content": "\n....[CULPA CENSOR]....What a waste of an elective. This class sucked. She is clearly very passionate about philosophy and knows a lot, and doesn't really care whether you like it or not. For an intro class, the readings were far too abstruse and complicated. Fortunately, you don't HAVE to talk in class and you don't even necessarily have to do the readings. The papers are ridiculous. The ones I actually thought about and worked hard on earned low grades, and the ones I pulled out of my ass thirty minutes before class got A's. What you know about philosophy and how you interpret the material doesn't make a bit of difference; the name of the game is Guess What Professor Makkai is Thinking! If you can use the right terminology in your papers, even if you plagiarize it right out of the texts, then you're gold. Her wit and \"cool chic\" style are entertaining for a day until they become irritating and detrimental to class discussion....[CULPA CENSOR]....\nWorkload:\nTwo or three 1-2 pages papers, one 4-5 page paper, no midterm, a final comprised of two 1-2 page papers\n"
        },
        {
            "course_name": "Aesthetics and Ethics",
            "review_date": "April 17, 2003",
            "review_content": "\nWOW!  If you want to take a great class with a wonderful professor this is the class to take.  If you are one of the many in this school who yearn to be inspired this is the class for you.  If you always thought Nietzsche and Kant were dull and difficult to understand this is the class that will change your mind.  If you are tired of apathetic and self-absorbed professors then take any class with this professsor.  Professor Makkai makes the subject of philosophy fascinating and the movies we watch in class tie directly to everything we learn.  Overall, this is a great class with a great professor and I highly recommend it.\nWorkload:\nThere are two 5-page papers and a final.  There are selections from various texts that are very thoroughly explained in class.  You do not read books that you do not discuss.\n"
        },
        {
            "course_name": "Aesthetics and Ethics",
            "review_date": "April 04, 2003",
            "review_content": "\nbeware! professor makkai's cool sarcasm is used to cover up her extreme lack of teaching skills.  the classroom is a place for her to perform, not teach.  she hardly gets through readings because she rambles on, makes no connection between texts... prof. makkai is good at name dropping and looking complacently at the ceiling while the class waits for one of her brilliant statements... [CULPA CENSOR]....the class has tons of potential, though it is more a film class than a philosophy class, but makkai makes it, especially the readings, thoroughly unenjoyable.  \nWorkload:\nmedium.  2 six page papers and a final.  a good amount of reading and required movie viewing once a week.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "April 03, 2003",
            "review_content": "\nI took Professor Makkai for Introduction to Philosophy and Human Existence. Makkai's teaching style is careful and creative, and as she lectures she often paces in silence for a minute or so before making a delicate point about the very nuanced world of philosophy.  She is passionate and engrossed as she teaches. Like a great pitcher with impeccable control, she reminded me of Greg Maddux as she lectured. At the front of the room she'll pause in silence briefly, gearing up to rear back and throw something just off the corner of the plate - she's fascinating to watch and listen to.  A very fair grader with plentiful, helpful writing suggestions.  Always available outside of class.  \nWorkload:\nModerate, but certainly challenging for an intro course.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "January 23, 2003",
            "review_content": "\nThis was a great introductory philosophy class.  Prof. Makkai is quirky and interesting and her presentation of a wide variety of philosophical texts was informative and worthwhile.  She's a fair grader, giving positive and constructive comments on papers along with corrections, and lenient in terms of lateness or absence (although sometimes I actually thought she was a little *too* nice to people who were consistently tardy).  The fact that there were no in-class exams -- and no mid-term at all -- was also a plus.  In any case, I highly recommend Prof. Makkai and encourage anyone to take her class!\nWorkload:\nthree short (~2pp) papers, one longer paper (~4pp) and a take-home final (two ~3pp essays)\n"
        }
    ]
}