{
    "prof_info": [
        {
            "prof_name": "Katherine Underwood",
            "prof_id": 9583,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 09, 2014",
            "review_content": "\nBefore I found out I was in Kassi's section, I dreaded UWriting. After our first class, I was excited to have someone so passionate and knowledgeable about writing and gender studies. She made the class fun and memorable, with various visitors (like Thomas Page McBee and Jamil Smith!) and occasional snacks. \nShe expects improvement, so if you enter as a strong writer, you will lose nothing in Kassi's class. She finds a way for every student to learn new writing techniques and by some miracle, all her students come out of the class as better writers (or at least in my section).\nThe assigned reading was super time-consuming and ate up my printing quota, but the responses definitely gave me a deeper understanding of the works. The responses also make writing the final essays a breeze, since most of your points would be in the shorter responses.\nMeetings with Kassi were my favorite aspect of her class -- she takes the time to really know her students and their respective writing styles, which she then tries to work with. She isn't too harsh of a grader and allows for a resubmission of one of the final Progression drafts (but with heavy revisions). \nTLDR: Kassi is the best -- she works with students to improve their writing and everyone comes out of her class as a better, stronger writer.\nWorkload:\nFour UWriting Progressions with draft, formal draft, and final draft; weekly reading assignments and 200-800 word responses (ungraded); numerous group presentations (ungraded, I think?); four one-on-one meetings to discuss each progression.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 20, 2011",
            "review_content": "\nKassie is an amazing teacher! I was worried headed into the UW course from the stories I had heard about other professors. She really will go above and beyond to help you- but only if you put in the effort- she will not just pass out easy A's. That said, I also feel she was a very fair grader. She gives the rubrics with exactly what she wants in your paper- I heard fellow classmates complain that she didn't understand their \"scientific\" style or appreciate their creative writing - this is a basic writing class and that is what they are looking for. I am a terrible writer and and Kassie was extremely helpful with every step of the process for me. She says it on the first day \"there is no reason for any of you not to get an A in this course.\" Meet with her outside classroom hours- she is very flexible and happy to chat. I think she may base a bit of your grade off of improvement (you have to turn in 3 drafts of each paper including the final)- listen to her criticism and fix what she says to. \nWorkload:\nWeekly ungraded writing assignments based off of a reading, varying in length 200~800 word responses. 4 progression papers. 4 meetings with her outside class hours to discuss the first draft of each progression\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 29, 2011",
            "review_content": "\nFull disclosure: I hated UW. I felt it was an utterly useless class, except for the sessions that focused on MLA. Most of the time we dealt with pseudo-philosophical questions that arose from the texts - unfortunately the point of UW is not to allow for an appropriate, rigorous discussion, but just to give some random context for the ridiculously artificial writing structures advanced by the Writing Center. \nHOWEVER, Kassi is an amazing instructor. She is extremely nice, her written feedback on essay is actually helpful and you can tell she really enjoys teaching and writing. She gave us a lot of writing-focused material, which other sections may not deal with. If it weren't for her, I would have just killed myself midway through the semester, but having Kassi as an instructor made UW only reasonably painful.\nI definitely recommend her an instructor and you should consider yourself lucky if you are assigned to her session! (And even luckier if you somehow place out of this awful waste of time.)\n\nWorkload:\nStandard UW workload, with the four progression essays. Weekly (ungraded) writing exercises are a bore, but can actually be useful when you have to deal with the essays. (Which does not mean that writing these essays will be useful to... well, anything.) Kassi's grading is rather tough and if you do not abide by UW's standards she may very well give out B's and C-s. As someone who enjoys writing, I tailored my writing to their pattern and managed to get A's my essays.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 19, 2011",
            "review_content": "\nKassi is this bubbly professor who is as sweet as she is smart. I'm surprised no one has written about her yet! As far as grad student professors go, take UW with Kassi. She will prep you expertly, and she has some other aspects, tips, and handouts that other UW professors do not do. She was strict on attendance and being on time, but she was also incredibly accommodating, and would meet with you after class or before class, or even on the weekends! She has dedication to her students, passion for the subject, and allowed time for some fun creative writing as well.\nKassi is young and relates well to students. You respect her, but can also see yourself hanging out at a bar with her. I'm sorry, but who does not want a professor who goes to Woodstock and encourages class potlucks? I learned so much about my own reading and writing skills - her grading was tough (as most grad students are) but she also allows re-writes on more than one essay. You may turn in late submissions with good reason, and she only docks 1/3 a letter. If you do poorly on any essay, rewrite it and you will end up with, at the very least, a B+.\nA terrific professor. I would definitely take another class with her.  \n \nWorkload:\n4 essays - Lens, Comparative, Research and Reflective, formal drafts for those essays, and daily writing exercises that count towards class participation.\n"
        }
    ]
}