{
    "prof_info": [
        {
            "prof_name": "William Ryan",
            "prof_id": 1403,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 10, 2005",
            "review_content": "\nSolid Earth should not be taken as a class for the science requirement if you are not a major.  In addition to the 3 hour lecture, there are weekly labs from 4-7pm every wednesday.  Lab writeups take forever to do because we mostly are stuck doing things we dont know how to, ie: trying to draw a cross section without anyone telling us that we need to find the apparent dip instead of using the dip angle given.  Even as a major, the class is frustrating.  you don't see much of the teachers, except Bill Ryan shows up for the labs, unlike Bill Menke.  It's mostly up to the TAs that you have.  \nBill Ryan's lessons were always well organized, and every wed we would do a case study on what we learned the previous monday.  For instance, we learned about the Yucca Mountain project acter learning about nuclear energy.  Expect more encouragement from him than Bill Menke.  Class nicknamed the pair Mild Bill and Wild Bill.  \nWorkload:\nLabs are excessively long, but you do learn an incredible amount from them.  Weekly hw assignments, can be vague and frustrating, but worth it.  One field trip that is about 10 hours on a Sunday. \n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 06, 2005",
            "review_content": "\nBill Ryan was Solid Earth's saving grace.  Just when you couldn't take any more of Bill Menke's rambling, unorganized lectures about sedimentation, out comes Bill Ryan with wonderfully organized Power Point lectures and genuinely interesting topics to discuss.  The second half of Solid Earth is completely different from the first half, and I think that the second half (Ryan's half) is the better part.  All his lectures are very engaging, and he'll always stop to answer questions.  He's very available to students outside of class, and, unlike Menke, Ryan will stay for the labs and actually help out.  During one lab he patiently sat with me and a few other people until we figured it out - and that's something I just can't see Menke doing.  \nBill Ryan is a very nice guy and a great prof.  Yes, he helped come up with the completely evil labs and problem sets that was the bane of my existence during this semester.  But because Ryan was there to help us out on everything, the second half of the course wasn't as terrible as the first half, and after the course ended I find I can still recall many of Ryan's main lecture points - something I can't do with Menke's lectures.  Overall, I'd highly reccommend Bill Ryan for any course.\nWorkload:\nWeekly problem sets, weekly labs that are insanely complicated, 1 midterm, 1 very easy final.  Everything is very time-intensive.\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 04, 2005",
            "review_content": "\nBill Ryan is a nice guy.  He's been to the bottom of the ocean in the Alvin submarine that they used to look at the titanic.  But this class is terrible.\n"
        },
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "April 16, 2004",
            "review_content": "\nBill Ryan is a kind, passionate, intelligent man.  He cares deeply about environmental issues and about his students understanding the material.  If you ask him a question, he will stick with you and teach you until you understand.  Briliant, but never arrogant.  \nThat said, Solid Earth is an extremely time-consuming class.  Much of the material is interesting, but it is presented in a way that feels almost like leap-frogging from subject to subject each week.  The labs are ridiculous, data-heavy, spreadsheet-heavy, time-consuming ordeals.  Fortunately, in Fall 2003 we had a fantastic TA- Janet Baran- who really made the experience much better.  As another reviewer said, Baran and Ryan together made the course a good experience.    They both deserve teaching awards.  \nIf you're not an e3b or ees major, DO NOT TAKE THIS COURSE.  It's 4.5 points for a good reason.  However, If you are, look forward to having Bill Ryan as a professor!    \nWorkload:\nEvil.\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 19, 2004",
            "review_content": "\nBill Ryan is one of the most wonderful professors ever.  He's very sweet, attentive, responsive, and he really gets to know his class.  He spends as much individual time with a student as is necessary, and he helps out on all the tricky parts.  Helped me do an entire lab - without him, it would've been hopeless.  \nBE WARNED:  this class is taught with Bill Menke.  Menke is quite the opposite of Ryan.  He makes up the problem sets of the first half of class, which are horrible horrible horrible.  You never know what to do with them and emailing him didn't help.  I asked how I can improve, his response: anticipate what i might be grading you on and do it.  Roger that, menke.  \nThis class is indeed quite time-consuming.  We were fortunate to have a great TA - Janet Baran - who combined with Ryan made this class very interesting and informative.  Chilled atmosphere, a bit like what a grad class might feel like.  Don't let Menke throw you off - it gets much much better towards the end.\nWorkload:\ntons.  get friendly with your macs, labs require hours on them.  write ups are tiresome and weekend-consuming.  don't bother reading the book, just go to lectures.  midterm - tricky, written by menke, you'd swear you never saw some of that stuff in class.  know the rock compositions.\nfinal - mostly mult choice, T/F, essay.  written and graded by ryan - liked it much better.  \n\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "December 18, 2003",
            "review_content": "\nRyan is a legend and a deserving one. He is truly brilliant and an interested and animated teacher. He can appear aloof and dated at times, but he is truly an incredible professor who genuinely wants his students to understand his material, the implications, and the applications. Expect to work in this class, but expect to enjoy it.\nWorkload:\nlots. weekly HW, weekly lab-write-ups, mid-term, final, all-day field trip (all time-intensive)\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "June 03, 2003",
            "review_content": "\nrun from thsi class and avoid it if you can. horrible, a ton of work, professors who have no idea what they are talking about, and stupid books that have no color and teach you nothing. labs are long and tedious, and as smart are yout hink you are, you won't do well. \nWorkload:\nTOUGH. expect to spend weekends slaving over this and asking friends to pray for your mental well being\n"
        },
        {
            "course_name": "v2200",
            "review_date": "January 02, 2003",
            "review_content": "\n(note this course is cotaught with Bill Menke.) Bill Ryan is both an enthusiastic teacher and a well known geologist.  His lectures contain lots of information and he users powerpoints that are available to download over courseworks.  He really wants his students to understand the material and is just a generally nice guy.  He takes the time to talk to a crying student, etc, and just seems, well, grandfatherly. Don't let him fool you though, you may think he has no idea who you are, but he does.  He knows who comes to class and who doesn't, and he knows who is putting the effort in and who isn't.  I would take a class just because Ryan is teaching it.\nWhile I thought Ryan was a nice person and a great teacher, I was kind of unsure what material this course was supposed to cover.  I learned a lot about the solid earth, such as where to find oil, tectonic plate movement, etc... I just can't really tell you what subjects we studied.  That is the major problem with this class as well as with climate -- they are a broad overview of who really knows what.  Also, beware of the labs.  They are impossible to do without the TAs and are almost entirely computer based.  You will sit in lab not knowing what the heck to do until Ryan, Menke, or one of the TAs comes and helps you.  You will need this help at least 5 times per lab.  (These lab instructions were much more vague than climate labs.)   Labs are also such a pain to write up...... but were easier than climate.\n\nWorkload:\nOne midterm - essay format, One final - multiple choice format  (the final was a killer, and everyone had expected essay format), weekly (although my class managed to make 5 drag out the length of the semester) homeworks, and weekly labs that take 3-9 hours to write up each week.\n"
        }
    ]
}