{
    "prof_info": [
        {
            "prof_name": "Eliza Butler",
            "prof_id": 10054,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "19th Century Art",
            "review_date": "January 17, 2011",
            "review_content": "\nClass and Professor:   This class was really fascinating, and Professor Crary has an interesting and unique interpretation of 19th Century Art. The problem is he takes far too long to say it. We did not finish his syllabus, and, after spending 3 or 4 whole classes on David (who worked mostly in the 18th century...),  we skimmed over Impressionism, skipping Post-Impressionism and the end of the century entirely. We missed a lot of the big paintings that you would expect to cover, but I think the \"road less traveled\" is more his style. He was a little disorganized too, and didn't allow computers at all, which made note taking (and sharing) very cumbersome. \nTA:  Eliza Butler is amazing; she is by far the best TA I've ever had. She is very laid back, and seemingly without effort can produce some of the most productive and interesting discussions. She encourages independent thought and criticism. She's a very fair grader, and is realistic (and lax) about student attendance. She manages to be informal, but still commands a sense of respect. I have had her for two discussion sections, and am signing up for a third, and planning on taking her Art Hum section next semester (if I can get in). And she's smart as a whip!\nWorkload:\nMinimal: 1 midterm exam, 1 midterm paper, and 1 final paper, no exam. Class attendance: optional if you're regularly attending section.\n"
        },
        {
            "course_name": "Intro to Art History I, Intro to Art History II",
            "review_date": "January 03, 2010",
            "review_content": "\nI took this class as an elective because I thought it would give me an interesting and helpful overview of early art history. For the most part, I regret that choice. It's not that difficult, but it's also not that interesting. First of all, it goes wayyyyyy too fast, and doesn't examine anything in-depth. While Moxey is great, he only lectured a few times. Most classes are guest lecturers and many of them aren't good speakers. Only section/ Eliza made it bearable. If you can get into a class TA'd by Eliza, do it! She's an angel: smart, nice, helpful, and will give you tips on what to study.\nWorkload:\nLots of reading, but you don't have to do it all. Two pretty easy & short papers. A lot of memorization for the midterm and final, but if you are good at memorizing they're not hard.\n"
        }
    ]
}