{
    "prof_info": [
        {
            "prof_name": "Elizabeth Wishnick",
            "prof_id": 2473,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: Political Development of East Asia and the Pacific",
            "review_date": "May 25, 2005",
            "review_content": "\nUgh. I can't explain what a disappointment this class was. I love the course material but I still dreaded going to the class because she was SO boring. Even her reading selections were not all that great, and in-class discussions were always stilted and dry and never EVER engaging. To top it off, she's anal as hell (so anal that a student got up to go to the bathroom and she yelled at him and made him sit back down, what is this--5th grade?!) and it carries over in her grading. So instead of being graded on the quality of your arguments, you're instead graded on margins, footnotes, etc. I guess that's fine for people that don't really mind that, but in courses like these I always want feedback on how I'm thinking about the issues, and you definitely won't get that in the class. It's surprising because she's won lots of accolades and is semi-prominent in the field but I think in her case, it is all fluff.\nWorkload:\nfour 2 page papers, 20 page research paper, and a big presentation \n"
        },
        {
            "course_name": "Introduction to Contemporary Chinese Politics",
            "review_date": "May 20, 2005",
            "review_content": "\nBased on her lectures, Prof. Wishnick is a bland person.  Not only do her lectures fail to frame the material in a noteworthy way, they also fall shallow of any real depth.  Everything I learned in this class came from books.  Even though  I didn't derive any of my inspiration for the take home exams from class, I still attended regularly because she takes attendance.  Unfortunately, if you're interested in Chinese Politics, the other class at Columbia is taught by a self-identified bad lecturer.  If you're really interested and you want a class that lures you out of bed I recommend Chinese Foreign Policy with Prof. Nathan.  Studying with Prof. Wishnick is not a particularly rewarding or memorable experience.  \nWorkload:\ntake home midterm and final (each a 10 page essay)\n"
        },
        {
            "course_name": "Introduction to Contemporary Chinese Politics",
            "review_date": "March 12, 2005",
            "review_content": "\nI am only half way through the semester for this course. Since I saw that Prof. Wishnick was one of the most wanted for CULPA reviews, I decided to contribute. I really like this class, but I think it's mainly because I'm genuinely interested in Chinese politics. Prof. Wishnick is not one of the most extraordinary professors I've had, but she is knowledgeable, forthcoming, and very nice. I think I hold reservations because her lectures tend to be a little too slow and a bit boring. Sometimes I feel like everything she says in class is covered in the reading we did the night before. I always hope that she'll add something more to the lectures so I can better understand the mechanics and strategies behind the decisions made by the Chinese government, and sometimes she does, but more often she doesn't. But I find that the course is very well taught for a political science course. She chooses really informative reading material even though it is a lot. The reading really helps you understand the political situation of China since 1949. She also shows us 2-hour long videos every two weeks or so, which really gives you a good, visual sense of the political history. \nIn general, so far in the semester, I feel like this course is more like a history course than a political science course, which is fine by me because I'm a history major, so I like courses formatted like this. There's a lot more emphasis of how China came to be the way it is today than the inner workings of the Chinese government system. But I think the second half of the semester may fill this gap because we still have to cover a lot more material, like the Reform era, foreign policies, domestic policies, etc.. I really recommend this course because, not only is the subject intriguing, Prof. Wishnick really knows her stuff and is really, really nice.\nWorkload:\nAbout 100-150 pages per week, depending on the topic to be discussed in class. Take home midterm and final, each a 10-page essay -- one for the Maoist era, the other for the Post-Mao era.\n"
        }
    ]
}