{
    "prof_info": [
        {
            "prof_name": "Xavier  Llovet Vila",
            "prof_id": 11108,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 15, 2016",
            "review_content": "\nXavi was easily one of the best professors I have had at Columbia. I can't recommend him highly enough. My Spanish improved quite a bit this semester, and Xavi was so funny, charming, and enthusiastic that attending class was always a joy. He was a great lecturer who explained new grammar concepts patiently and clearly; he spoke slowly enough that it was easy to understand what he was saying, which meant that he hardly ever had to explain anything in English; he gave every student detailed, constructive, timely feedback throughout the semester; and maybe most importantly, he made it clear that he cared deeply about all of his students and wanted us not only to succeed but also to take care of our mental and physical wellbeing (a rarity for a Columbia professor). I will genuinely miss being in his class next semester. If you get a chance to take Spanish with him, do not hesitate. \nWorkload:\nTypical for a Spanish class--a few exercises in MySpanishLab every night, some work in the grammar book most weeks, three movies to watch throughout the semester, several short compositions, and a final project. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 10, 2011",
            "review_content": "\nXavi is AMAZING! I absolutely loved his class, and that saying a lot considering I was in Spanish until 7 on Fridays. He is amazingly engaging and truly dedicated to making sure that his students understand (and can think in) Spanish. He makes a point of saying that he hates grammar, and wants us to move beyond simply memorizing rules. \nI've already recommended him to all of my friends.  He is the best Spanish professor I've ever had, Barnard needs to keep him around. \nIntermediate 2 got a bit intense after the midterm because a ton of new grammar rules and tenses were thrown at us out of nowhere, but Xavi did a really good job at relating the info to real life situations. \nI can't say it enough...TAKE A CLASS WITH THIS MAN!\nWorkload:\ntypical\nmidterm, final\n4 compositions (500 words) 2 versions \nfinal project (written and oral components)\nsome supplementary activities throughout the semester, nothing too intense and class is always fun!\n"
        },
        {
            "course_name": "Spanish 3332 (Now 3330)",
            "review_date": "May 06, 2011",
            "review_content": "\nXavi is meh.  I think the class was decent, but the topics were definitely very cliche and very highschool in the sense that the homework and essays seemed like busy work.  Honestly, I can't say I learned much of anything, and I don't think the students around me would disagree.  Moreover, most of the kids in the class were either hispanic or fluent, so it was a bit tough to compete with them.  \nXavi himself is interesting enough and is always willing to offer help, but I don't think he is the best the department has to offer.\nWorkload:\n3 essays, 2 rewrites a piece.  Homeworks every night.  1 Final essay.  Light but tedious.\n"
        },
        {
            "course_name": "Intro to the Study of Hispanic Cultures",
            "review_date": "April 28, 2011",
            "review_content": "\nIf anyone deserves tenure in all of Barnard, and most definitely in the Spanish Department, it is this man. Xavi is an excellent professor, need I say, possibly the best Spanish professor I have had in nearly five years of Spanish classes. He relates material from class to contemporary issues, presents fun videos, and really develops his class in such a carefree and relaxed manner that it is a pleasure to come to class every time. Overall, I thought that he was extremely fair in grading and that his comments on the essays were exceptionally helpful in improving my Spanish writing. Xavi is truly a remarkable teacher, that not only takes great interest in his student's work, but is also very dedicated to the study of Hispanic cultures. \nWorkload:\n3 Essays, Two Versions each, and Parallel Activities every week. Very fair grading, I would honestly say that it tends to be on the easier side compared to other Spanish teachers. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 13, 2011",
            "review_content": "\nXavi Llovet Vila is not to be confused with Xavier Vila who also teaches Intermediate Spanish II.\nXavi was the best teacher ever. He has so much energy and is so passionate about the language that every class was incredibly engaging and fun. He also has an amazingly dorky yet charming laugh that will blow your mind! I don't plan on being a Hispanic Studies major, but Xavi's class was by far my favorite class of the semester. I can't even begin to describe how awesome he is... Xavi presents the material in a clear manner and is always patient with questions. He likes it when his students participate, which isn't a problem because he makes it so easy to do so.\nFrom talking to friends in other classes, Xavi's grading seemed to be a bit harder than that of other spanish teachers. Perfect scores are very difficult to get on the compositions or other work we do. However, this should not deter you from taking spanish with Xavi. You can easily get an A if you devote some time and effort into the class. Don't half-ass your final project. It's not difficult at all...\noh btw.. Xavi is hott (with two T's) \nWorkload:\nStandard for Intermediate Spanish II. Workbook excercises, 4 compositions, midterm, final project, and final.\n"
        }
    ]
}