{
    "prof_info": [
        {
            "prof_name": "Heidi Applegate",
            "prof_id": 2266,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 31, 2005",
            "review_content": "\nConsider yourself very lucky if you get Heidi for Art Hum. She is engaging, funny, and very committed to the class. Her lectures were extremely well-prepared and very interesting. She is open to what students have to say and willing to take their views into account. If  you notice something about a piece that she hadn't thought of, she'll admit that, instead of just brushing you off. \nI thought the grading was very fair. She does look for specific things on the midterm and final, but she isn't a fanatic about things like dates (you have to be within a 5 year range) and spelling. In order to do well on the papers, you will need to come up with an argument about the assigned painting or sculpture or piece of architecture,  instead of just describing what you're looking at. If you can do that, then you'll be fine. Also, Heidi graciously offers to read one draft over the course of the semester, and returns them with tons of helpful comments. \nWorkload:\n4 papers, of which you have to do 3; 3-4 pages each; you have to go to the Met, the Cloisters, the Frick, MoMA, etc. on your own time. For one of them she asked us to include drawings, but as she professes to have no drawing ability herself, she isn't harsh about that aspect of it. There are lots of readings from the primary course reader, plus a few additional readings that she had on reserve. These tended to be long but much more interesting than the stuff in the Primary Course Reader. There are a few DVDs you have to watch, and sometimes she'll have you look at the features on the art hum website,  but it really isn't bad at all.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 11, 2005",
            "review_content": "\nI think professor Applegate is the best.  She taught me how to really engage with and read a piece of art, and for that I'm very thankful.  I chose art hum section number unlucky 13 out of a morbid feeling of hate for the core, but thank god I did.  This woman restored my faith in the core curriculum.  Heidi's class was always engaging, and her willingness to confront the pieces critically (the Parthenon is so bootleg and anyone who says different is a grade grubber!) makes the course refreshing.  She's also quite funny.\nWorkload:\nWrite three of four papers, that while graded strictly are still not that hard  (four pages each).  Mid term and final are standard art hum material, and kind of a pain.  Two fun field trips.  And, as one other review noted, she brings cookies sometimes to class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 11, 2005",
            "review_content": "\nI think professor Applegate is the best.  She taught me how to really engage with and read a piece of art, and for that I'm very thankful.  I chose art hum section number unlucky 13 out of a morbid feeling of hate for the core, but thank god I did.  This woman restored my faith in the core curriculum.  Heidi's class was always engaging, and her willingness to confront the pieces critically (the Parthenon is so bootleg and anyone who says different is a grade grubber!) makes the course refreshing.  She's also quite funny.\nWorkload:\nWrite three of four papers, that while graded strictly are still not that hard  (four pages each).  Mid term and final are standard art hum material, and kind of a pain.  Two fun field trips.  And, as one other review noted, she brings cookies sometimes to class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 05, 2005",
            "review_content": "\nHeidi is an excellent teacher, she is very friendly and approachable.  Art Hum has easily been my favorite class at CC so far, and I'm positive it's because of her.  She grades very easily,  I found, because I really had no idea what to write about for most papers and with a little thinking and a \"stretch analysis\" of the topic, she generally rewarded her students.  If you get Heidi for Art Hum, count your lucky stars!\nWorkload:\n3/4 short papers on great subjects, a frantic midterm, and a laid-back, moderate final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nHeidi was a good art hum teacher. She always came prepared, and was always excited about the material.  Heidi was knowledgeable and made sure to include lots of class interaction. Having checked other sections before picking her, I would characterize her as being one of the better (if not one of the best) choices for Art Hum.\nWorkload:\nFriendly and flexible, student gets to choose 3 out of 4 papers each with fairly broad internal choice. Readings are generally requested but not \"required\" and only focused on during the midterm and final. No quizzes of any kind and no \"homework\" other than the papers. 2 class field trips, with fairly easy assignments if you can't make them. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nHeidi did a great job, and I think she is only going to improve her methods.  She is a solid, nice, passionate teacher who understands the faults of the core but steers students towards the best understanding they can achieve.  Our class warmed up to her after just a few classes, and I think it turned out just fine. Be glad you have Heidi.  She's supercute.\nWorkload:\n4 papers, 3 required.  Midterm, Final.  Kinda harsh grader on the papers, she wants you to think. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 12, 2004",
            "review_content": "\nHeidi is fun and helpful and seems to have a strong knowledge of what was covered, even with it being the first time she taught ArtHum. She grades a little harsher than I thought was necessary, but she is still really nice and gives candy sometimes!\nWorkload:\n2 field trips, 3 papers, midterm, final, very little reading\n"
        }
    ]
}