{
    "prof_info": [
        {
            "prof_name": "Hannah Hoch",
            "prof_id": 3071,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 18, 2016",
            "review_content": "\nHoch is one of the most useless professors I've ever met. She cannot teach for the life of her. All she does is read off her powerpoints which she posts online anyway so why bother going to class? I think the material she teaches is super interesting as a psychology major, but she makes it as dry and boring as humanly possible. During lecture, she gives bizarre examples to try and explain the material, but all they do is confuse the class even more. \nShe also can't write an exam worth a damn. If you expect to do well simply by self studying, then you're shit out of luck. When one of my friends asked her whether or not we should focus on textbook or lecture more, she said, \"Oh if you just memorize my study guide and you'll do fine!\" BULL SHIT. I did exactly that AND read the textbook cover to cover AND looked through all of her powerpoints and did dreadful on the exams. Not that I expected to do well because her exam questions read like they were written by a monkey with a computer. I'm not sure if it's even humanly possible to get a good grade in this class because she doesn't curve a single one of her terribly written exams. \nDon't take this class, at least not with her. If someone else teaches it, anyone else, then go for it. In the hands of a different professor, it would probably be much more interesting and actually worth your time. It's really a shame that Hoch is so incompetent because the accompanying lab with Professor Ken Light is an absolute delight, but honestly it's not worth it to suffer through whatever the hell Hoch is doing. Really, nothing is worth it.\nWorkload:\n2 midterms, 1 final, 1 weird video project, and a bunch of random, stupid assignments. It would be a reasonable amount of work if you had any hope of doing well on the exams. Just don't take this class. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "October 25, 2016",
            "review_content": "\nLearning and Behavior \nProfessor Hoch is one of the worst professors I have ever had. If I didn't need it for a requirement I would've dropped it. Her lectures are incredibly dry, she reads off her slides, and when asked a question, she always finds some way to avoid it. I learned more by reading 2 0/)// in the textbook then I have in her lectures. She is an incredibly sweet woman but this woman cannot teach. When I met with her to talk about my difficulty with testing, she told me that I should probably not be taking classes that require me to take exams, and should stick with papers. I have never been more disappointed in a professor in my entire time here. This class is not worth your time. \nWorkload:\nExams cover basically nothing you've talked about in class. A video project, multiple smaller assignments \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "October 20, 2016",
            "review_content": "\nI am a senior at Barnard, and Professor Hoch is the worst professor I have ever had. I don't know why she is still teaching at such a prestigious school. She reads verbatim from the slides, and then, when students have questions, she simply cannot answer them. Her catchphrase is \"Oh, I'm not sure. I'll let you know.\" Well, she never does let us know. \nNo one attends lecture because - let's be real - we all know how to read, and we can read from the slides that she posts online ourselves. Her class is miserably boring. She tries to show videos to make the concepts clearer for us, but they are usually ridiculous and unhelpful. She is also terribly disorganized. She takes weeks to grade assignments that she assigns to us the day before - not right. The work load is not light, and the exams are not easy, considering what a terrible professor she is. She should be fired, end of story. \nWorkload:\nA typical psychology class. You need to study and memorize a lot. The problem is that you basically have to teach yourself the information because Professor Hoch does not know how to teach. If you have the time to teach yourself the material and memorize it, then you will probably be fine. \n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "March 06, 2014",
            "review_content": "\nProfessor Hoch is one of the worst professors I've had at Barnard. She is a really friendly person, but she literally reads off of her powerpoints and doesn't add anything more than is already written. This would all be fine if her exams were super easy and vague, but they aren't. They are surprisingly tricky. She barely seems to know anything when asked questions that require more knowledge than is available on her slides. Going to lecture is nearly useless, except that she takes attendance about half of the time, even though it's a large lecture.\nI'm shocked each and every time we have class by how useless of an instructor she is. Additionally, she shows an annoying number of videos (probably five per class).\nDon't take this course unless you need to to fulfill a requirement.\nWorkload:\nThree non-cumulative exams: first two are each worth 30% of final grade, final exam is worth 40% of final grade.\n"
        },
        {
            "course_name": "Advanced Seminar in Language Development",
            "review_date": "November 19, 2013",
            "review_content": "\nHoch seems nice and pleasant. And she is. But this class seems more like a student-run club, filled with babysitting anecdotes, maybes and \"I don't know, but\"s. Each class is led by two students who do some extra preparation and try to answer everyone's questions with what they \"feel like\" the answer might be. Hoch only taught the first class. I don't feel like I've learned anything concrete in this class, and that which I have learned has come from a very elementary text book with sentences like \"cognition is something that happens in the brain\" and \"bilingual speakers all share being exposed to two languages.\" Truly fascinating, right? \nHoch's participation in class is minimal, and her contribution I swear to you is 49% \"huh, I'm not sure\" and 49% \"I don't know...\" 1% of the time she'll offer a very vague clarification and 1% of the time she'll share a marginally intriguing tidbit of information. Otherwise she sits there with her eyes squinted and mouth slightly dropped, as if she herself is in a static state of confusion.\nThe quality of this class ultimately depends on the previous experience of your classmates. If you do end up taking this class, make sure you have a good foundation in language development already, or else you will wind up utterly mystified and dissatisfied. \nWorkload:\nDiscussion questions every week that don't get graded or commented on. Opinion paper, 3-5 pages on any theory we discussed in class. Final paper on a topic of our choosing, 15 pages.\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 21, 2011",
            "review_content": "\nProfessor Hoch is very sweet and she means well, but this woman cannot teach. I was most excited for Abnormal Psychology this semester, but it ended up being my most dreaded class. I didn't realize it was possible to make Abnormal Psychology boring. She literally just read off of her slides or recited the DSM-IV-TR to us. She also could not answer a single question, which was frustrating considering I am interested in going into clinical psychology and am very curious about a lot of the disorders we were learning about. Her clearest answer all semester was \"Well, um, I don't know.\" We also got WAY behind and skipped a lot of material because she would take an endless amount of questions and comments.\nProfessor Hoch does give study guides before each exam, and those are helpful, but that does not make my incredible frustration with this class disappear. If you want to take abnormal psychology, don't take it with Hoch. \nWorkload:\nTwo midterms and a final. Reading in the textbook before every class (but you really only need to reference the textbook a bit when studying for exams), and some additional recommended readings that she MAY ask about on the exams. \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 20, 2011",
            "review_content": "\nPlease listen to me. Please, please, please don't take this class. I know you'll read past reviews and Hoch doesn't sound so terrible and you know you're a good student so you figure, \"eh, how bad can it be? I mean three tests, all 50 multiple choice questions, all non cumulative, sign me up!\" NO! DON'T! Do yourself a favor and no matter how tempting it is, avoid hitting that little button that would seal your fate and add one of the most mind numbing, ridiculous classes to your schedule. But now, enough of my ranting and raving and a little info on why you should actually NOT take this course!\nFirst point. While all the lectures are done on powerpoint and provided before class, they are all basically taken straight from the text. What isn't taken from the text is pretty nearly always unclear. No problem you say? I thought the same. Except if you think this will make studying easy, you are sorely mistaken. While Hoch seems to be fine regurgitating the textbook during lecture, her multiple choice tests will phrase said info in ways that are totally alien to you. In other words, study to your little hearts content, but come time for the exam and you will look at test that suddenly is asking you to work with the information in ways that you never have before. And one thing that I can say that was true for all students, whether or not they did fabulously on exams or horrendously, no one could accurately guess how they fared on the exams. As a matter of fact, it was pretty much a given that if you thought you did well, you did poorly and when you thought you bombed, you actually did okay. \nSecond sticking point: All those who like to have conversations and actually ask the professor questions need not apply. Asking Hoch questions indefinitely sends her scrambling amongst her notes only to tell you she needs to get back to you. But rest assured, next class she will have added a slide to the ppt addressing questions from the previous class. Although you better hope that her answers don't raise any more questions because again, she'll have to get back to you. Then again you could try the more immediate hands on approach and actually go to her office hours. Now don't get me wrong, she is so sweet, and so nice and does amazing work, but when I went to go talk to her about an upcoming test she acted like a deer caught in the headlights. Or rather like I had hustled her into a corner of the Psych department at gun point and demanded that she hop on one leg while tapping her nose and singing the star spangled banner. A ridiculous analogy I know but trust me, it was no where near as ridiculous as the conversation I had with her. I had to ask her the same question 5 times before she actually managed to understand what my question was...\nThird sticking point: The discussion question on courseworks which she responds to before exams she gets back to incredibly infrequently... and then the day before the test, after not answering the questions posted over the weekend, she sends out an email saying she's answered the questions posted but will not be answering any more and that we should answer each other's questions on cw. Right, cause that's going to happen. \nSo I'm done... proceed with caution and enter at your own risk. But if you value your brain and are looking to learn about abnormal psychology and not actually develop one of it's disorders I would look elsewhere for a class. All this said, she's very nice and I wish her all the best. She just has a lot of learning to do about how to teach... do you really want to have your effort reflect her inadequacy. Just think about it... \nWorkload:\n3 tests, all 50multiple choice, non cumulative. On each test #50 is a giveaway, where she says \"put down \"a\" for the answer; if you don't you won't get credit for this question (don't be fooled the rest of the test isn't so nice). 1 extra credit opportunity for those who are present for at least half of the classes. The extra credit (should you earn all of it is worth 3 points which gets added to your lowest test score. The assignment itself is a three page review of an abnormal psych article that you have to get approved by Hoch).\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 19, 2011",
            "review_content": "\nJust like any of Professor Hoch's classes, this one is taught using PowerPoint slides.  The material isn't difficult and her exams aren't hard, if you use her study guides.  She gives a study guide before every exam, and nothing is on the exam that isn't on the study guide.  The class tends to move slowly, but most people find that they can follow along and do other things on their computer and are fine.\nThe material is interesting and provides an overview of various disorders in psychology, and is definitely an important class for anyone majoring in psychology or with a general interest in psychology.\nWorkload:\nEasy - 3 exams (non-cumulative), 1 extra credit article summary.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "February 04, 2011",
            "review_content": "\nI've had Hannah Hoch for two courses.  The material IS dry and she isn't always the best at making it seem REALLY interesting.  However, I found her examples in Learning much clearer and helpful than in Developmental.  Once or twice she did get confused (but psych and definitions are always confusing...) but really did offer and/or come back with examples that really helped me conceptually.  I don't think you can just \"read the slides\" and do well in the course, she does change things and gives examples (some of which are on the exam) only in class.  Also, she is very open to questions and aware that at times, Psych of Learning is really boring... and dry.\nAlso, if you don't do well on an exam (as it's pretty much multiple choice - which I hate) and go to her she is very helpful and willing to go over each question.  In fact, she helped me rethink how to approach her questions and how to study that helped me improve SIGNIFICANTLY on the last two exams (from a B- to an A).\nAnd, it's pretty nice that she gives you a study guide for EACH exam and will not test you on anything not on that study guide.  However, you do need to know the study guide inside and out.\nShe's not the best professor, but I really don't think she's the worst.  She does want you to do well and will do her best to make sure you do (that includes you going to class... she takes note of that too).  But you do have to work for it.\nWorkload:\n2 Midterms, 1 Exam (non-cumulative), an extra credit option. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 06, 2011",
            "review_content": "\nThree scantron sheets later, I'm still fairly undecided about Professor Hoch. Basically, if you go to lecture, do the readings, do the extra credit assignment, and study religiously from the posted study guides, you will do well. I wish I had done all of that, but I still managed to do ok with a minimum of effort....and you can too! \nI took the course without lab and the lectures basically consisted of Prof. Hoch reading from her powerpoint slides, which are exactly the same as last year's powerpoint slides, and will most likely be exactly the same as next year's powerpoint slides. I thought the videos of Prof. Hoch and her colleagues tutoring autistic children at her workplace were by far and away the best part of the course, and really served to elucidate the principles she was teaching. They almost made up for the time she said that bats were a kind of bird.\nWorkload:\nTwo exams (30% each), Final (40%), extra credit that adds 3 points to your lowest exam. Sharpen up your #2 Pencil!!!\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 18, 2010",
            "review_content": "\nProf Hannah Hoch is an absolutely terrible professor! She is the worst psych professor I have ever had at Barnard, and I'm not sure why she is teaching courses in the department. She also works with autistic children, and I'm sure she's very good at that, and she should clearly stick to that. Her lectures are totally disorganized. She reads from her notes. When people ask questions she's always confused, and sometimes stops mid sentence to consult the textbook. She puts videos in her lectures, but they're usually really stupid and not relevant to the material, and most of the time she doesn't know how to use the projector anyway. She has an attendance sheet, and she offers an extra credit opportunity only to the students that attend more than 50% of the lectures, because if not there would be absolutely zero motivation to go to class. She has review sessions right before the exams, and she gets really nervous during them because she doesn't know the answers to peoples questions and then she laughs nervously. She gives examples about learning theories, and then students tell her her examples aren't relevant, and then she agrees that they are not relevant. One time she was convinced that the entire class was laughing at her, and she stopped class to ask why we were laughing at her. And then she asked us if she had something on her face. The whole class was awkwardly quiet and then she said \"Well now I'm really embarrassed and I have to stand up here and finish teaching class and I might have something on my face.\" Please, avoid this class at all costs. It's an absolutely waste of tuition money. \nWorkload:\n2 midterms\n1 final (non cumulative)\nAll multiple choice, no essays.\n1 extra credit opportunity: a journal article summary. Really easy and fast.\nThere is no need to read the textbook. She posts review sheets with questions, and if you know how to answer the questions, you might do well on the exams. Although you never know, because she often puts things on the exams that she had explicitly said before she wouldn't. And the multiple choice questions are really awkwardly worded. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 18, 2010",
            "review_content": "\nI had Professor Hoch for Psychology of Learning, and I loved her. The tests are extremely fair, and the workload is not overwhelming. Her experience with autistic children really brings the material to life (she uses videos in class), and I enjoyed this aspect especially. You can do well in the class without going to lectures. However, I looked forward to lectures as she supplemented the material with antecdotes, videos, and real life experiences; this REALLY helped on exams. She is always enthusiastic and available to her students, whom she truly cares about and wants to do well. The only way anyone could hate this class is if they are bored by the subject. Hoch is a fantastic professor. \nWorkload:\nmultiple choice exams are extremely fair; opportinity for extra credit. she gives a+'s if you deserve one. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 02, 2009",
            "review_content": "\nProf. Hoch is indeed not the best lecturer- she relies heavily on her powerpoints and notes and often cannot think outside the \"box\" of examples she has already stated. However, her explanations are usually clear, and frankly, the material is not very difficult. She tries to be as straightforward as possible, and is successful for the most part. The course material is inherently dry, but her examples of her work with autistic and learning disabled children show how the information can be applied in real life. She also seems incredibly nice and is open to questions. So overall, this class is not super interesting, and the lectures certainly aren't dynamic, but the material and the class itself are both relatively painless. The information is good to know if you're a psych major (or want to fulfill the science requirement), but I would certainly not recommend this class as an elective.\nWorkload:\nFor the lecture- two exams, one final. Textbook reading that is absolutely not necessary to do well on the exams. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 02, 2009",
            "review_content": "\nI wondered this semester why so many people were in Hoch's Psych of Learning class, and now I know why: the reviews on here are way too nice to her!  She is truly an abysmal professor, though a very sweet and approachable woman.  I want to like her so badly because she's cute and bubbly and tries hard, but she has absolutely no grasp of the content of the classes she teaches.  I had her for Developmental Psych last fall and thought she was horrible, but she's even worse in Learning--who knew it was possible?  She can't answer questions thoroughly, she constantly confuses herself when speaking, half of her slides have the wrong information on them, and she is incapable of coming up with examples on the spot--if it's not in her notes, given in a textbook or something, she can't explain it.  \nHer tests are fair and she's easy to talk to and really wants everyone to succeed, but lectures (which she now takes attendance at, by the way) are actually truly painful.  I feel bad for her as she struggles through every single concept, but don't have a done of sympathy as she's a professor and should at least mildly understand the topics she's lecturing about.  Probably not worth the decent grade you'll end up with, honestly.\nWorkload:\nFair.  Two midterms and a final.\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "July 13, 2009",
            "review_content": "\nProfessor Hoch is a great professor and loves what she teaches. Not only does she care about the material, she cares about her students. Before the tests she is always available to answer questions. She tells her students to post questions on courseworks and answers them almost immediately.  She is also great when it comes to responding to emails.  She is a fantastic Professor!!\nWorkload:\nFair. \n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "May 06, 2009",
            "review_content": "\nHannah Hoch feels passionate about developmental psychology, especially since she works with autistic kids. However, going to her class is pretty pointless because she posts the powerpoint slides online, and all she does in class is read off the class. She is very enthusiastic and often shows entertaining videos, but there is nothing valuable that she says in class that you can't find from the slides. \nWorkload:\nReading that is not necessary (but helpful in studying for exams), 3 exams, 1 extra credit article summary\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "December 17, 2008",
            "review_content": "\nHannah Hoch is a sweet person, but an inept professor. She is incapable of teaching a lecture without her slides, which are available online. The slides present no more information than the text book, which is the only valuable aspect of the class. There is barely any reason to attend class, and when you do, you always regret it.\nHer voice is grating and unbearable, and she looks like she is twelve years old.\nShe is unable to answer any question not explicitly stated in her lecture slides. She is incapable of figuring out the technology necessary to show her slides, so she spends ten minutes every class setting up. Any extra material she brings to class is wholly unhelpful, consisting of anecdotes about her brother's children.\nWorkload:\n3 exams, non-cumulative final\nThe tests are pretty easy, with no thought or creativity required\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "February 15, 2008",
            "review_content": "\nI have been in this class for only four weeks now, but I already regret enrolling. She is a sweet woman, there's no doubt, but a completely incompetent professor. She appears to know nothing about the field of psychology outside of her work with autistic children. For example, she couldn't explain different types of brain scans we learn in Psych 101. The class is painfully slow and taught at a middle school level. We have not even begun to look at disorders yet. I am only writing such a harsh review because I wish I had seen one before taking the class. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "October 24, 2007",
            "review_content": "\nLet me just preface this by saying that I am writing this review while in her class.  Literally.\nProfessor Hoch tries hard, yes, but she fails miserably.  She does not explain things clearly, and she often makes mistakes.  There are also many instances where she cannot answer questions that aren't already answered explicitly on her Powerpoint slides.  Basically she ends up making things more complicated than they are, or confusing the students.  I prefer just reading the book and learning from my lab instructor (the amazing Professor Taylor).\nThe class is fairly easy though.  2 midterms and a final, all outlined by Professor Hoch.  Some extra credit is available.  I cannot attest to her availability because I have never sought her help.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "June 13, 2007",
            "review_content": "\nTake this course with Hannah Hoch!! She is great!! I agree with the other reviews in that the subject inherently is a bit dry (especially if you are not a psych major)-- but, if you have to take this course, she went out of her way to make it fun, interesting and easily understandable (and succeeded!). I am a psych major and was pushing off this class-- but I am SO happy I waited and took it with her-- I learned a lot, and she is just so passionate about what she does (and sooo sweet) that she made the class extremely enjoyable! (the class also ended up being invaluable for the psych GREs and later psych classes, so take it if you would need).\nWorkload:\nHannah Hoch is extremely approachable and available almost 24/7 via email. She is soo helpful with any questions and provides a review sheet for each midterm (2 and a final). You dont need to read the book (she has great, detailed slides)- just follow the review sheet and you will be absolutely fine! The final was basically non-cumulative because the only \"old\" info was taken exactly from a review sheet, which only highlighted the most important information.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 09, 2007",
            "review_content": "\nI hated this class but it's not entirely the professor's fault. I blame Barnard's ridiculously stringent science requirements, forcing me to spend so much of my time doing something that I care SO LITTLE ABOUT. \nProf. Hoch is a well-intentioned but inexperienced professor. I imagine she will improve somewhat, but that doesn't make the class any better. Most students (myself included) are there only to fulfill requirements and are generally uninterested in what seems like arbitrary definitions to phenomenon that may or may not exist and may or may not have any relevance to real life. \nThat said, it's not a terribly difficult class to do well in (way easier than Psych of Perception, also offered fall semester) but for me it was most difficult to get past the fact that every bit of work I did for that class was not teaching me an f-ing thing.\nWorkload:\nDon't be fooled. Her tests are straightforward but only if you study a lot. Meaning, way more than you'd like to on material this dull. So it's do-able. Just extremely, extremely painful.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 30, 2006",
            "review_content": "\nOh, poor Hannah Hoch. She tries so hard (showing YouTube videos, encouraging student participation) but in an intro psych course where every lecture is on PowerPoint, down to the examples... it's just not going to be interesting. The advantage is that she posts each lecture online, so technically you never have to come to class at all (and judging by the amount of empty seats, many seem to take this approach). I would recommend coming somewhat frequently, though, as she often makes mistakes on the slides that students correct in class. That said, if you have to take this course for a requirement, don't be scared. She's very sweet and approachable, offers extra credit (5 points on your lowest test grade), and holds extra review sessions upon request. If you don't have to take it, however... just don't, and spare yourself the boredom.\nWorkload:\nRecommended reading for every class but all of the information you need on the tests is from class--it's pointless to buy the textbook. Two midterms and a final, noncumulative. A psych journal article summary for 5 extra credit points.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 20, 2006",
            "review_content": "\nProfessor Hoch was very nice and not demanding.  The lectures came directly from her slides which were posted on courseworks before class and the exams came directly from her slides.  This made for a relaxing class with minimal work and no suprises. The textbook was wordy and pretty much useless. I don't feel like i learned a whole lot, but that can be said for many college courses most of which require much more work and produce much more stress.  \nWorkload:\nLecture: 2 midterms and 1 noncumulative final. 1 optional extra credit article summary.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 10, 2006",
            "review_content": "\nProfessor Hoch is a sweetheart. She's new to Barnard and really young. Her lectures are interesting and you can tell she's really passionate about it. She includes funny clips and pictures in her slides. The class was relatively easy especially for psych majors but even for non. The textbook was difficult, but her lecture (and lecture slides) really help. \nThree exams (non cumulative), extra credit assignment to summarize a psych article, and lab (if you're taking it with lab)\nWorkload:\nNot bad at all. \n"
        }
    ]
}