{
    "prof_info": [
        {
            "prof_name": "Jonathan Cole",
            "prof_id": 2438,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Law, Science, and Society",
            "review_date": "January 05, 2014",
            "review_content": "\nProfessor Cole and his Law, Science & Society class were exactly what I wanted from a seminar in my senior year. This seminar was one of the top 3 course I've taken in my 4 years here (in any department, though I am a Sociology major).\nCole is so incredibly kind, brilliant, easy-going and just an overall great teacher. He made me think critically and question things that I had always taken for granted. \nI highly recommend this course, especially for seniors. If you take it, make sure you really immerse yourself in the critical thinking and push yourself - it's worth it!\n\nWorkload:\n--heavy weekly readings (you don't really need to do them, but you'll want to at least skim them because it makes class more interesting and you won't want to disappoint Cole, because he's so wonderful)\n--12-15 page final paper that will force you to do serious mental work! good stuff.\n--expected participation\n"
        },
        {
            "course_name": "Law, Science, and Society",
            "review_date": "September 01, 2010",
            "review_content": "\nOne of the most interesting, intelligent and thorough professors I've ever encountered.  \nHis class in Science, Law and Society will convert you to skeptical thinking and question everything you think you know.  Some of the readings are light and enjoyable while others are difficult to grasp.  Regardless, do them all if you want to get the most out of this class.  The work load is one 20 page paper where you objectively deconstruct a topic pertaining to science or the law thus questioning an established paradigm.  It is a bit more difficult than one may think, because you must push aside pre-conceived notions.  Of interest are the articles which Professor Cole wrote, such as studies questioning the efficacy of cholesterol lowering drugs.  He'll have you thinking about laws pertaining to equality, America's fear based response to terrorism, medical epidemics and a slew of other subjects which the media skews to formulate our opinions.  This was one of the most fascinating courses providing you actually do the readings and participate in class.  As a bonus, Professor Cole is sincerely nice and appreciates your presence at office hours.  \nWorkload:\nProf Cole takes attendance so do show up.  He also calls on people during class so you must do the readings which are mostly enjoyable albeit lengthly.   One twenty page term paper which is more difficult than you think because you must actually think.  Knowing that Prof. Cole, not a T.A., will be reading it makes you want to do your best. \n"
        },
        {
            "course_name": "Law, Science, and Society",
            "review_date": "May 13, 2009",
            "review_content": "\nProfessor Cole is wonderful.  He seems to be friends with every famous professor / writer / Nobel laureate ever, and all of the readings he chooses (usually from among his friends) are generally very interesting and easy to read.  The class is about half him talking about different issues (for example: freedom of speech, affirmative action, scientific risks and media) and half discussion, but don't get the wrong impression-- it's not political but rather a critical look at how we form opinions and evaluate sides of arguments.  He really teaches you new ways to think about things and makes you question everything you think you \"know.\"  I thoroughly enjoyed the seminar and think he is just a really cool guy.  I'm not in the sociology department (actually it seemed like a good amount of the students, at least a third of the seminar, weren't), but he does a great job of opening up discussion regardless of academic background.  It's an extremely relevant course that I think has helped me become much more critical, skeptical, but also open-minded.\nWorkload:\nReadings every week: 50-100 pages, but very easy to read.  Most people didn't read but he didn't care all that much, he'll tell you what you really need to read.  One 15 page paper at the end of the semester, absolutely nothing else.\n"
        },
        {
            "course_name": "Law, Science, and Society",
            "review_date": "January 20, 2005",
            "review_content": "\nProfessor Cole is one of the nicest professors at this school.  He seriously is soo sweet and really just interested in having an interesting discussion among the class. He also comes prepared with planned questions that really got me thinking about the topics and questioning my views. I would definitely recommend this if you are interested in discussing the topics up for debate.\nWorkload:\nvery light. readings every week, I did most of them, but most people didnt or skimmed them, hes very cool about it.  1 25 page essay due at the end on any topic related to the material.\n"
        }
    ]
}