{
    "prof_info": [
        {
            "prof_name": "Tuncel Yegulalp",
            "prof_id": 4342,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Data Analysis and Modeling",
            "review_date": "May 17, 2014",
            "review_content": "\nHe's a professor who is poor in giving lectures though he seems to be nice. All things from this class were learnt by myself, so did my classmates. And always there were about half of students present in the classroom.\nThe comparatively slight homework is the only reason you should take this class.\nHe may have good research and papers, but I think he should review his way of teaching and take some changes. Otherwise, he is definitely the worst professor in teaching I've met at Columbia.\n\nWorkload:\nSlight\n"
        },
        {
            "course_name": "Environmental Data Analysis and Modeling",
            "review_date": "February 20, 2013",
            "review_content": "\nI've had my fair share of poor professors, but Yegulalp is definitely one of the worst I've ever had here at Columbia. His lectures are not only dull, boring, and uninspiring, but he mumbles to himself, expects everyone to know exactly what he's talking about, and has a rather superior attitude as well. I am taking Environmental Data Analysis and his labs are literally him doing a trial and error run of R coding on the spot. He makes a million mistakes, just basically talks to himself as he codes, and never asks anyone how we are doing. Definitely one of the most uninspired, downright awful professors at Columbia.\nWorkload:\nSurprisingly okay. Not too bad.\n"
        },
        {
            "course_name": "Economics of Earth Resource Industries",
            "review_date": "November 03, 2011",
            "review_content": "\nProfessor Yegulalp is a very nice person, however, in my opinion his lectures are incredibly difficult to follow. He presents complex concepts with limited explanation and formulas and examples without reviewing his assumptions and/or the steps he took to get to his answer. The powerpoints are also not very inspiring and the tone of the class is rather dull. Unless you are a science/math whiz I would not recommend the course - unless you want to teach yourself engineering economics. We also did not have a TA and I had to bribe friends/the math help room for assistance.  \nWorkload:\nA few hw assignments, term paper, midterm, and final. The midterm and final are take home but can take copious amounts of time.\n"
        }
    ]
}