{
    "prof_info": [
        {
            "prof_name": "William Reinisch",
            "prof_id": 13348,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Innovation and Entrepreneurship",
            "review_date": "January 24, 2017",
            "review_content": "\nOne of the worst classes to take- strongly advised against taking this course.\nThe faculty initially starts with a study-plan that seems great on paper, but is seldom followed as promised. One of the key points of the class is said to be \"REVIEW SESSIONS\" - where the professors help the students come up with business Ideas.\nNot only were these sessions unfruitful, they were often confusing; with the professors' changing their stance on an idea every alternate session. The professors require that we come up with innovative ideas, yet they outright reject any direction that they think may not be interesting.\nRather than having a discussion about an idea, or even giving a new direction to the same, the faculties insist on changing the proposal - even up till the last few weeks!\nThere is hardly any incentive on the amount of hard-work given in the class, as your grade only depends on whether the professor likes the final presentation or not.\nMore often than not, it seems that the professors make a call by the mid-terms about every group and barely change their grading, despite the amount of effort put in.\nThis is not only unfair to people who are not grasping the ideas taught outright but also rewards those groups that have been judged positively over other groups in a biased manner. There seems to be no scope for improvement for people who are lagging behind, or whose ideas the professors do not agree with.\nRather than being an academic experience, the course simply boils down to an episode of Shark Tank.\nWorkload:\nHighly dependent on whether the professors like your business proposal. If they do, the workload is negligible. Otherwise, it would require medium high workload.\n"
        }
    ]
}