{
    "prof_info": [
        {
            "prof_name": "Michael Riordan",
            "prof_id": 2367,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Microeconomics Seminar",
            "review_date": "January 25, 2005",
            "review_content": "\nProfessor Riordan is a nice guy, and he is genuinely interested in his class.  The reading for his seminar was not too overwhelming, but he does require annoying two page responses to the reading each week, which are graded with a check, check +, or check -.  Other than that, the only other grades were participation and the 10-20 pg term paper on any subject we covered in class.  Thoughout the semester, the material we covered in class was interesting (auctions for 3G spectrum, the Microsoft antitrust case, universal service policies, and creative industries) but the presentaiton of the material in class was a bit boring, and he ends up lecturing and writing obscure equations on the board.  I found the best part of the class was the term paper, on which I could write on what I found interesting.  He's not an extremely lenient grader, but was fair enough.  Wouldn't kill myself to get into the class, wouldn't kill myself if this was the one I got.  \nWorkload:\n2 page papers every week, 10-20 page term paper.  standard, really.\n"
        },
        {
            "course_name": "Microeconomics Seminar",
            "review_date": "January 01, 2005",
            "review_content": "\nProfessor Riordan is a very considerate and likeable professor, and very knowledgeable in his field.  In this seminar we covered 4 different \"real-world\" topics from an economics perspective.  While on the surface they are interesting, I generally was bored with the class.  He tried to get the class to lead the discussion, but that rarely was productive, and resulted in a seminar discussion that tended to be disjointed and confusing.  He knows a lot, though, and is very accomplished in his field it seems.  \nWorkload:\n100-150 pages of reading per week, 2 page essay due on the reading for every seminar (once a week), 10-20 page term paper; a tough grader, has pretty high standards content-wise...your weekly papers and term paper better be interesting.\n"
        }
    ]
}