{
    "prof_info": [
        {
            "prof_name": "Drew Youngren",
            "prof_id": 13457,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "May 06, 2020",
            "review_content": "\nAmazing teaching! It's often hard to describe what makes a good math teacher, but Youngren checks all the boxes. Clear, passionate, down-to-earth, and is always looking out for his students. There was never an unfair assignment, an unclear lecture, or really any moment where I was frustrated with him or the class. Yeah, the material is tough, but he makes it very understandable. \nHe uses a lot of 3D models in class, and a lot of real-world analogies, which really helped me understand what the hell Muli actually was. He puts a lot of emphasis on learning vs just memorizing, and he really wants you to understand why you're doing something, not just how to do it.\nI hope I get to take more classes with Youngren because he is absolutely phenomenal!\nWorkload:\n1 problem set a week. Usually 3-5 problems, and some psets are more difficult than others. Working with a partner it takes 2-3 hours on average.\n2 midterms and a final. The first midterm is much harder than the second. Final is pretty standard and cumulative.\nClass is very slightly curved but he doesn't make that clear in his syllabus. \n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "December 16, 2019",
            "review_content": "\nTo begin with, the class is not curved despite the fact that the averages are not good (around 70% for the first meaning most people get Cs and around (80% for the second meaning most get B-). Drew is a boring lecturer who does not really know how to teach the material. You are better off learning from the textbook and other sources because his lectures do not have much information and when they do it is simply a formula and example, no explanation on the slides themselves and his explanations if you decide to attend lecture are pretty bad.\nWorkload:\nWeekly Problem Sets (around 5 hours)\nWeekly Quizzes\n2 Midterms\nFinal\n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "September 11, 2019",
            "review_content": "\nDrew in an angelic human being who loves teaching math. His lectures are engaging, presentation of material is at a comfortably brisk pace if you're prepared for the class, and his humor is underrated. His voice is very audible and his blackboard writing, very legible. He's also great about answering questions, and not at all intimidating. His class was by far my favorite freshman year class. \nWorkload:\nVery standard, 1 pset per week that takes a few hours depending on the person, 2 midterms and a final. \n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "May 26, 2019",
            "review_content": "\nFairly straightforward lecturer. He's clearly very passionate about the material and tries to make the concepts as interesting as possible. The exams are pretty reasonable, if you complete the assignments and study using the practice problems and the practice exam he provides you should be fine. \nThe weekly problem sets can be quite tough but you can usually figure out how to do the problems if you attend the lectures and read the textbook thoroughly. Quizzes are generally very easy and straightforward. If you attend the lectures and do a 10 minute review before the quiz you'll usually get an 100 on each one. He claims there is no curve for the class but given the grade distribution for the exams and how the final grades actually turned out I find that hard to believe. \nI'd recommend Youngren so long as you are prepared to be challenged and work hard.\nWorkload:\nWeekly problem sets (can be very challenging)\nWeekly Recitation Quizzes (usually pretty easy)\n2 in class exams + the final exam\n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "September 06, 2018",
            "review_content": "\nOne thing I will credit Drew for is that he doesn't waste time. Pretty much within the first two lectures you will get into maths that you will not have learned before (if you're from an AP Calculus BC background). The class was fairly difficult, but if you studied well and hard, you would be rewarded. Personally, I thought that the exams were very straight-forward and fair. His midterm and exam comprise of two parts: multiple choice and free response. In my opinion, the free response has always been easy and true to what we learned. On the other hand, the multiple choice is a lot more specific and harder, requiring much more thought and knowledge. The homeworks were much harder than the exams ever were. I think the average time someone has spent on the homework hovers around 5-8 hours. There are also weekly quizzes in recitation that can be difficult, just because of the time crunch (need to complete in ~15 min) and tricky wording.\nI would advise taking it second semester. Since this class is a requirement for SEAS kids, in the first semester there are always a lot of new freshmen who have taken this class before or taken higher maths. Second semester are the students who moved up from Calculus II to Multivariable and the curve in that semester is a lot better.\nDrew Youngren is a pretty good prof. His lectures can be hard to follow sometimes, but he's extremely enthusiastic and loves this subject. He's good at answering questions you may have on the subject, and will go over practice final/midterm questions with us.\nWorkload:\nThe exams( two midterms and a final) are not easy, but straight forward. They cover a lot of ground. The multiple choice is fairly difficult. There's weekly or bi-weekly (sometimes) problem sets for homework that can be easy or very, very difficult. Average amount of time someone spends on that homework is around 5-8 hours. There are also weekly quizzes in recitation that should be studied for.\n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "May 17, 2018",
            "review_content": "\nThe class itself is a mixed bag of people coming straight out of Calc I/II and a few people who couldn't get credit for having already taken it. It did sometimes feel like the professor measured the success of the class based on the overall average, which didn't consider how well those learning the material for the first time were doing.\nThat being said, Youngren is a great lecturer and very accessible both with his office hours (a 2 hour block that expectedly gets over-crowed around exams) and with scheduled appointments where he can explain things more in depth. He's very focused on actually teaching the material and posts his dynamic Mathematica lecture slides immediately after lecture. I don't recommend skipping lecture though; despite his general tech savvy, Youngren has not figured out how to include the notes/examples written during class (which are essential).\nI felt like the course was rushed. There's a lot of material from both Calc III and IV. The focus of the class is obviously on the more applicable aspects of Calculus, but it did seem like there were gaps in what we covered that might've made the material make more sense. If you have the time and space in your schedule and are someone who needs an explanation for math rather than just examples/applications, I recommend the old III/IV track instead. \nThere is no curve but he sets the ranges for letter grades himself.\nAnother note: most of the applications we learned didn't make any sense to me until after I took Physics 1402 (flux and fields) so don't feel bad if some stuff doesn't click until after the final. \nSummary: Good teaching, nice guy, go to lectures, fast paced class\nWorkload:\n Manageable. Weekly problem sets (15%)  and quizzes (20%), both of which vary greatly in difficulty from week to week\nTwo non-cumulative exams (35%) and Final (30%) weighted on last third\n\n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "April 19, 2018",
            "review_content": "\nReally boring lecturer, especially hard to stay awake in the 8:40 lecture. Nothing he teaches in class can't be picked up through the notes he posts. I was in his very first section, and there was no curve for the class, despite many people doing very poorly on the exams. Weekly quizzes were sometimes tough, and the compensation would be to \"make the next one super easy\" instead of curving. (Which, as anyone who teaches a math class should now, does not balance that out...) \nTl;dr\nBoring + harsh\navoid if possible\nWorkload:\nWeekly quizzes\nWeekly homework (sometimes very hard)\nMidterm, final (not curved)\n"
        },
        {
            "course_name": "Multivariable Calculus for Engineers and Applied Scientists",
            "review_date": "December 22, 2017",
            "review_content": "\nThis class is very different from standard Calculus classes that you will take/have taken. Professor Youngren puts a lot of emphasis on conceptually understanding the material as opposed to just knowing how to do the problems/regurgitating equations. For a class geared towards engineers and applied scientists, it was surprisingly theoretical and not applied at all. Although Professor Youngren is an enthusiastic and intelligent professor who is very approachable, the reason this class is more difficult is because you get so lost in the basis of the theorems and the proofs during lecture that you come out not knowing what you even learned. \nThe second problem with my experience wasn't the professor, but since this is the highest level math class a freshman can place into, the class is filled with mathematical geniuses and students who took the class three years ago, making it very difficult for those who haven't taken the class to keep up. He also doesn't curve your grade as a result, but will shift it up 1-2% to the next highest grade increment if you're close. My 87 was still a B+ after the curve.\nTake this class if you're really good at math and don't want to do much work, or if you want to learn a lot of conceptual stuff about math and are fine with a lower grade. Definitely don't expect a free A or A-\nWorkload:\nHomework: 5-10 problems a week, generally doable if you ask friends for help or think about it together. 15%\nWeekly quizzes during recitation that were either very simple or very difficult, usually only two questions. 20%\nTwo midterms: 35% total, average was around an 80\nFinal: 30%\n"
        }
    ]
}