{
    "prof_info": [
        {
            "prof_name": "Adina Popescu",
            "prof_id": 2025,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "History of the City of New York",
            "review_date": "July 06, 2006",
            "review_content": "\nI had Adina a few years ago as a TA and it's taken me a while to cool down to write a review. Hands down in my 4 years at Columbia, I have never had a TA with more negative attitude. She often came to sessions without having done the reading. Called us \"spoiled\" because some didn't do all the reading. Wouldn't let those of us who had managed to cram it in to contribute. Sulked and snarked. Refered to Prof Jackson as \"Kenny\" which I thought was lame. Passed back my paper with pizza oil one it. Oh, and I got an A so I'm not being sour. I just think she has some teen issues and needs to work them through. Rolling one's eyes and being snarky usually ends at...like...age twelve. Really, don't bother. Whatever her damage is, never mind, just go somewhere else. I had a friend in another TA group who gave me notes and relevant chapters from books, and study guides for exams. Adina wouldn't help us because we were spoiled. Oh boy, get out of graduate school and try your attitude outside these Ivied walls and find out WHO is the SPOILED one, miss thing! Hope you can keep a job. Adjust yourself.\nWorkload:\nOur workload was pretty heavy but interesting. Her workload was obviously an ordeal and trial for her.\n"
        },
        {
            "course_name": "History of the City of New York",
            "review_date": "July 06, 2006",
            "review_content": "\nI had Adina a few years ago as a TA and it's taken me a while to cool down to write a review. Hands down in my 4 years at Columbia, I have never had a TA with more negative attitude. She often came to sessions without having done the reading. Called us \"spoiled\" because some didn't do all the reading. Wouldn't let those of us who had managed to cram it in to contribute. Sulked and snarked. Refered to Prof Jackson as \"Kenny\" which I thought was lame. Passed back my paper with pizza oil one it. Oh, and I got an A so I'm not being sour. I just think she has some teen issues and needs to work them through. Rolling one's eyes and being snarky usually ends at...like...age twelve. Really, don't bother. Whatever her damage is, never mind, just go somewhere else. I had a friend in another TA group who gave me notes and relevant chapters from books, and study guides for exams. Adina wouldn't help us because we were spoiled. Oh boy, get out of graduate school and try your attitude outside these Ivied walls and find out WHO is the SPOILED one, miss thing! Hope you can keep a job. Adjust yourself.\nWorkload:\nOur workload was pretty heavy but interesting. Her workload was obviously an ordeal and trial for her.\n"
        },
        {
            "course_name": "British History 1760-1867",
            "review_date": "April 03, 2005",
            "review_content": "\nI completely disagree with the other review of Adina for this course.  Yes, the discussion section was often painfully quiet, but this was not Adina's fault: she came up with really interesting questions about the reading material and really tried to spark discussion. However, because her questions were mostly based on the reading assigned and because the majority of people in the class had not done the reading, only one or two people ever responded to the questions.  Of course she expected everyone to have done the readings--that's what's expected in a history course! I highly recommend her as a TA. \nWorkload:\nWorkload depends on the course you are taking, not on the TA you have.  She is a fair grader whose main expectation is that you answer the question given. \n"
        },
        {
            "course_name": "British History 1760-1867",
            "review_date": "March 08, 2005",
            "review_content": "\nAwful.  Absolutely awful.  Her section was always painful...she would sit there and wait for the students to start talking when we had no idea what to say...no prompts.  The other TA in the class was energetic and enthusiastic about presenting information to students (unfortunately i didn't find this out until the very end of the semester), but Adina would just sit there ....it was almost as if she was trying to make us feel stupid for having nothing to say.\n     I don't think i've ever seen her smile, nor do i think i've ever heard her say anything nice.  She brought a great deal of negative energy to this class and didn't teach us anything.  Never have her as a T.A. if you can help it.\nWorkload:\nshe expected us to do every bit of the irrational amount of reading that the professor assigned...tough grader\n"
        },
        {
            "course_name": "Making of the Modern American Landscape",
            "review_date": "May 15, 2004",
            "review_content": "\nAdina was absolutely great as a TA.  She forced me to see that our assigned readings differed in terms of how they analyzed history, not just by subject matter.  In section she comes off as a little abrasive but if you're serious about history you probably won't mind.  Her comments on written work were also very helpful.  I would highly recommend picking her section if you have the chance.\n"
        },
        {
            "course_name": "American Civilization Since the Civil War",
            "review_date": "April 12, 2004",
            "review_content": "\nAdina is one of the best ta's I've had since I've been here. Although she may seem to be a little standoffish it is only because she is shy. If she doesn't have the answer to your question, she will look it up and bring the relevant material to section the next week.  She is a fair grader and genuinely wants her students to do well.  She is also very willing to meet to discuss and review the term paper.\n"
        }
    ]
}