{
    "prof_info": [
        {
            "prof_name": "Shelley Saltzman",
            "prof_id": 2048,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "English",
            "review_date": "May 11, 2015",
            "review_content": "\nShe is AMAZING. \nShe is caring, intelligent and a GOOD TEACHER. We all know you can easily find good scholars who are bad teachers here at CU. She is intelligent, and able to deliver the intelligence at the same time (yes, she IS a full package). Even though you will be bombarded with homework assignments and in-class writing exams, you will learn a ton. If you can take her course, you will be one lucky student.\nWorkload:\nHeavy, but fair. \n"
        },
        {
            "course_name": "College Composition",
            "review_date": "April 16, 2006",
            "review_content": "\nA pretty useful class, but a horrible, horrible teacher. Most international students I know are afraid of taking this class because of her. She is an extremely harsh grader, who neglects ideas and picks on the smallest things. I took this class in spring 2005, got a B-; and later in University Writing in fall I got an A-. Apart from grading she is not a friendly person either - I was honestly pretty fed up with her showing off as a Doctor, and also her unfriendliness when I tried to talk to her after class. In short, Shelley is one of the worst English teachers I have ever met in life. I wish I had taken College Composition with another more friendly, encouraging teacher, so that I would have enjoyed writing earlier.\nWorkload:\nA lot of work - both reading and writing. She expects you to write on one essay over and over again. When you try to seek help from her for more opinions, she says different things every time and makes you more confused of how to improve your writing.\n"
        },
        {
            "course_name": "College Composition for International Students",
            "review_date": "January 04, 2005",
            "review_content": "\nShe is great. As a international student, it should be a must that people take this class. Extensive thorough discussion based classes covers basic essay writing tools that are required at college. She makes the students feel personally attached to the topics so that they can bring the best out of them. She is a bit hard grader, but it is just not possible to exaggerate how helpful her remarks on the essays are. I was often amazed to find how thoroughly she examines each. Above all, it helped me to have a better understanding of US academic system's expectation from college students, and of US society as a whole on the broader perpective.  You may sometimes feel that she is nagging too much to make you revise you near perfect eassay, but mind it, you will be the beneficiary at the end.\nWorkload:\nFour essays, but each one need to be revised multiple times. No mid-term. One reserach based ten page term paper and a two hour end of course in class essay exam. When you are taking this course, keep aside at least four-five hours each weekend for this course, if not more. But remember: it is a worthy investment for your own sake.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 26, 2004",
            "review_content": "\nThis class was so helpful! If you are an international student you are definitely going to learn a lot. Interesting essays from Norton Reade rand great topics for exams. I loved her!!!!\nBut be prepared,grading is tough though! It is almost impossible to get an A. But the knowledge she gives is worth it! \nWorkload:\nessays almost for every class, 8-page research paper (a lot of fun to write with her - she is extremely helpful), in class midterm and final which are  graded less strictly than home essays.\n"
        }
    ]
}