{
    "prof_info": [
        {
            "prof_name": "Michael Sobel",
            "prof_id": 2554,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "December 27, 2014",
            "review_content": "\nWorth noting before taking this course is that it is mainly taken by graduate students. This has pros and cons: the main pro is (perhaps) that there are a lot of students in the class who don't really seem to care. Sometimes this may be because some of their English isn't stellar; the main con, however, is that this might also be because they already know the material really well. \nNo matter, though, because honestly this was one of the easier classes I have taken here at Columbia. The material totally has the potential to be really hard, but there is a solutions manual that you can Google for the homework, and the exams were the easiest exams I have taken since high school, no joke. They were almost offensively easy.\nBIG BIG BIG word of advice: Sobel never says this in class, but he will ask A LOT of definitions on exams (literally 25% of the final was f***ing definitions). DEFINITELY know the axioms of probability, that was asked on both the midterm and the final.\nSobel himself is not the most personable man you will ever meet. He tended to be really snappy when people asked questions in class, unless of course you're an attractive female. Moreover, he is honestly an awful teacher. I learned approximately 0% of the material from actually attending class, and ended up teaching myself all of the material, which, I reiterate, was honestly not too bad. In class he tends to do a lot of proofs of theorems that we will never use. He does them in a really handwavey way - which might sound appealing to some, but he isn't GOOD at being handwavey, so it just ends up being confusing and annoying.\nPlease don't take my negative review to mean that you shouldn't take this class. This is honestly a great probability class to take if you want a pretty easy grade and are willing to spend some time near exams teaching yourself the material. I know for a fact it was much easier and less work-intensive than 3105 and the IEOR probability class (I have friends that took each of those at the same time I was taking this who confirmed this testimony).\nWorkload:\nHe gave us 3 homeworks, that each would have taken a pretty long time if I didn't have the solutions manual, but would have totally been doable. Anyway, THERE ARE ONLY 3 HOMEWORKS, maybe a couple more if he remembers to fit them in, so you have plenty of time to do them.\nOne midterm, one final, both very short, very easy. On both there will be a definitions section and a basic application of Bayes Theorem. In addition, the midterm will have some basic calculations with random variables, maybe a counting question, and a couple general distribution questions (find the constant c, are these independent, what is the marginal distribution, that kind of stuff). There also should be one slightly trickier problem where you just need to write things out and expand until it makes sense. The final, along with the questions previously mentioned, will have a couple binomial distribution questions, and some random calculations with expectations and variances and whatnot. Nothing too bad.\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "August 23, 2014",
            "review_content": "\nSobel is a difficult professor to like. He's very standoffish in class, with an attitude that he just disdains teaching and thinks his students are dumb. He seems to play favorites a bit, and does warm up a bit if he likes you.\nThe lectures were meandering, often not following any particular chapter or organization. He'd give \"examples\" that consisted of him reading a bunch of numbers aloud from the book with absolutely no explanation on how they were derived, or what we should be learning from them.\nAll that said, I did appreciate that he really emphasized a more fundamental, intuitive understanding of the material. He wanted us to understand the main concepts, and not worry too much about the details of every obscure test. Maybe this went a little too far, but it was nice that we didn't entirely miss the forest for the trees.\nHe was generally not very willing to help. Office hours weren't too useful, and he refused to provide things like a study guide for the exams. His response was that he was reasonable, and the exam would emphasize the important stuff. This was fairly true for the midterm, but less true for the final.\nWorkload:\n~5 problem sets. Each was similar in length to what I've had in other classes with 10 or 11 problem sets, but twice the time.\nMidterm and final. Both were fairly long, not tooooo tricky but still somehow difficult. Mostly because he gave us no preparation for them.\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "April 15, 2014",
            "review_content": "\nThis man was probably the worst professor I've had so far at Columbia. His lecturing style was awful. He seemed to have a good grasp of the course material but terrible at conveying it to us. Lectures consist of him talking vaguely about various topics, with little attempt to actually introduce the class to them. He never bothers to write anything on the blackboard. The few times he does write on the blackboard, its usually just some derivation of a formula that nobody knows where it came from. \nFurthermore, he makes several mistakes daily in these derivations and never notices them. Nobody in the class tries to correct him either because everyone is confused as to what he is actually talking about.\nGiven that his lectures are completely useless and serve only to confuse you, you'd think you could just read the textbook and get along fine. While this strategy would serve you well in doing the homework, his exams are based very little on the textbook. Most of the questions deal with concepts that he's talked about in lecture that don't appear in the exams. So a good portion of your final grade is based on concepts that he offhandedly rambles about in class and doesn't even bother to write down.\nHe is also exceedingly dull so paying attention in class is extremely hard. This plus the way he bases his exams make for a frustrating class experience.\nWorkload:\n4-5 moderately hard homeworks, a midterm and a final. The exams are based mostly on lecture material. The homeworks were confusing at times and required a lot of banging your head against a wall but we had a good deal of time to complete them.\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "August 08, 2005",
            "review_content": "\nAvoid this class at all costs. Even if that means choosing a new major. I could not agree more with the previous review. Sobel has been, by far, the worst professor I have had at Columbia. Statistics/Methods is not the type of class that one ought to suffer through, but Sobel surely made this an absolutely unbearable experience. \nHe was absolutely inept at teaching. The concepts we were supposed to learn in class are actually quite simple, but he managed to complicate them beyond reason. He is terrible at explaining concepts and, if asked for further explanation, he'll tell you that you should have been able to figure it out on your own. Going to office hours is a complete nightmare as he will offer no help whatsoever and will actually make you feel absolutely inadedquate.\nHe is impersonable and does not care about his students. He is rude in and out of class. Despite being a 10 person class, the man did not know my name by the weekend before the final! I really could go on forever. \nReally, I know I must sound like an angry student. I've never in my life written a bad Culpa review for a professor, but this man really and truly the worst instructor I have ever had. Don't make the same mistake I made. Avoid him like the plague! \n"
        },
        {
            "course_name": "V3212 Statistics/Methods",
            "review_date": "May 20, 2005",
            "review_content": "\nAVOID THIS MAN. Michael Sobel was the worst instructor I have had at Columbia. In fact, he's the worst instructor I have ever had and I went through the New York City public school system! There's no way I can state strongly enough how shocked I am that any university has ever hired him. His teaching style was abominable. He dumbed everything down to a point where it was incomprehensible. The class moved ridiculously slowly and we didn't get through the syllabus. His grading was inept and showed his own lack of comprehension of the material since he would grade down for not phrasing any idea in exactly the words he had stated it in class. If you quoted the textbook you were wrong because he had \"clearly emphasized\" how he wanted you to \"understand\" the idea in class. If the textbook is wrong (ie writing its ideas mean you lose all credit) then why does he assign reading from it? He didn't put the homework on courseworks until halfway through the semester, and never posted due dates. The homeworks seemed to have been made up hastily and sloppily. They were ambiguously worded and contained typos. Then he would blame the class when no one would succeed on them. Most of all, he was incredibly unprofessional. When I asked him when his office hours were, he barked that they were on the syllabus on courseworks and that I could look it up myself. The syllabus wasn't on courseworks, never had been, and was indeed never posted by the end of the semester. Then, when I set up a meeting with him, he was almost 15 minutes late and didn't drop a hint of apology. Despite all this, he was quick to toot his own horn. He spent days telling the class how lucky we were to be receiving this valuable information we couldn't get from any textbook from him and how he was not only enriching our academic careers but our lives as a whole. He also went on about how professional he was, though no one had questioned whether he was or not. Please, if you have to say it, you ain't got it.\nWorkload:\nFour homeworks 20% (lowest grade dropped), midterm 35%, final 45%\n"
        }
    ]
}