{
    "prof_info": [
        {
            "prof_name": "Elena Aprile",
            "prof_id": 1072,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "General Physics I",
            "review_date": "November 13, 2009",
            "review_content": "\nPostbac Premed here.  Unfortunately all the reviews I've read about this professor are accurate. Physics is hard and dense, especially with this particular text chosen for the class.  \nProf Aprile has confused deriving equations for teaching the logic behind the physics, often relying on our ability to integrate and substitute terms rather than helping us develop an understanding (or a stratety) of physics.  Her lectures lend themselves to students who memorize facts (often loosely and without reason), not to students who want to learn the science. Because of this, application of the sicence to more involved problems which require a creative science mind are nearly impossilbe, and because of this, no real appreciation of the subject can be achieved. \nAdditionally, she is more focused on how many chapters we get through rather than if we acutally learn something. Her lectures, therefore, are ill-prepared and often rushed--and because of this, she often writes incorrect formulas and often confuses terms, all the while complaining that we dont have enough time to finish anything.\nHer TA, in particular, Pontus, has been a great asset to her class, however, by attempting to answer the \"why's\" behind the calcuations.  Other than that, I truly felt that I taught myself physics this semester, often poorly.  I am impressed with Columbia's lack of interest in the quality of it's professors in this regard. And while Prof Aprile is clearly brilliant and an amazing researcher, I think the University needs to re-evaluate its priorities with regards to teaching it's students who are not only spending a sum of money, but who also do want to learn.\nWorkload:\nWork load is relatively light. probelm sets for each chapter every week of about 7 problems, 3-4 of which are randomly selected for grading. 2 mid terms. (She calculates a second curve based on everyone's dropped lowest score. You recieve the better of the two.) Exams are a little tough but very fair, only 4 questions each. Grading of them, however, can be EXTREEMLY strict. Take your time on them.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "October 15, 2009",
            "review_content": "\nShe is very bad at lecturing and the students are definitely not helping. The students ask her questions that slow down the whole process of learning for everyone else. If you take her class, you better suck it up and read the book because her lectures will not help you.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "April 17, 2009",
            "review_content": "\nPretty much everything the last reviewer said is still true. She is nice, but she has said more than once she doesn't want to be there, she doesn't finish problems and spends forever deriving equations without showing you how to use them. \nTo her credit, we do get out homework back in a timely manner (probably thanks to the TA), she puts up her lectures notes on courseworks (even though they aren't that helpful) and she does do little experiments in class sometimes that range anywhere from mildly entertaining to be scared for her safety. Also if you show improvement on the second midterm she will not count the first. \nIf you are commuting any sort of distance to class, you are going to have a hard time making yourself show up, I promise. \nWorkload:\n2 midterms, a final and weekly problems sets usually 7-12 problems only two of which will be randomly chosen to be graded (this can hurt or help you).\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 11, 2007",
            "review_content": "\nElena Aprile is first and foremost a researcher. She comes in 5-10 minutes late every class, and it is blatantly obvious that she does not want to be there. She doesn't even do most examples completely, because she just starts you off and then tells you what you WOULD do and doesn't even give you the answers. I think she was doing the examples directly from the book and that's why she never told you answers, but still, she shouldn't expect us to just go to the book and search for those exact problems. Once, she even said in one example \"So this is the penguin, no friction, blah blah blah, you plug in his mass and blah blah you get his acceleration.\" Didn't even solve the problem or set it up. And every now and then she says something like \"I don't know why we do this, this is such bullshit\" but when you get her started on her research of blackbody radiation, she gets SO happy and goes on for years. Probably a great researcher, but definitely not worthy of being a teacher.\nWorkload:\nHW due every other week (towards the end of the semester she started to give us HW due every week), 2 midterms, 1 final. Very straight forward.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 28, 2004",
            "review_content": "\nThe only way I survived this class was by forcing myself to go to the lecture with my book, completely ignoring Aprile, and taking my own notes out of the book. Her lectures are basically straight from the book anyway.  The TA holds a recitation the night before problem sets are due and does every problem for you, which is great until you get to the tests and realize you don't know how to do anything. Basically Aprile is brilliant with her research, but terrible when it comes to teaching.\nWorkload:\nweekly problem set, 2 midterms, final\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 20, 2004",
            "review_content": "\nThis is what happens when you hire a researcher without any experience in teaching and ask him/her to teach a really tough class.  Prof Aprile is a nice lady but a terrible teacher.  I went into this class loving physics, especially that I had gotten straight 100s in high school honors physics, but that all changed after this class.  Every week less and less students showed up for the lectures.  I tried to go to most lectures but ended up doing my chem lab report like a lot of other people.  She basically does the same sample problems in the book and mumbles somethings to herself as she's doing them.  A lot of times she wastes class time by talking about how she got a ticket from the cops for speeding, or how she loves to drive fast.  The only people who did well in her class were people who had already taken both AP physics in high school and had done well in them.  Anyway I haven't heard good things about the other 1401 teacher either so I'm afraid you have to make a choice between a bad and a worse.\nWorkload:\nShe teaches two chapters a week, usually you end up doing a total of about 10 problems from those two chapters.  The problems are extremely difficult, and no hints are given.  The first midterm is horrible, especially because you're not used to her tests.  The second midterm is even harder, and the final is a nightmare.  All grades are curved\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 19, 2003",
            "review_content": "\nDefinitely one of the worst experiences in my life. You may as well never go to class becasue she poorly teaches right out of the crapy text and sleeping in your own bed is probably more comfortable anyway. She talks to the board, gets irritated easily by questions, poorly answers those questions (becasue she is never actually listening to them), delivers an unorganized lecture, does long complicated derivations that are not imperitive to learning the material at hand, and always runs out of time so that she ends up trying to teach an entire chapter in 10-15 min. Waste of time when it comes to office hours. Ask for help and she'll simply tell you to \"do more problems. It will click. That is why the final is worth 50% of your grade.\" She is alomost as useless as her TA. He's a really nice guy but his english is lacking and he is never sure of anything. The up side?? The curves are great. nonetheless.... DO NOT TAKE THIS CLASS...    \nWorkload:\n10 impossible problems sets, 2 violating midterms, and a final that will make you want to slit your wrists\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 15, 2003",
            "review_content": "\nFrankly, the worst physics prof i ever had.  Her lectures make no sense, her classes sizes are probably around the 180+ range but you only see about 50 students during her lectures.  Homework is a hassle to do, but not too hard.  The two midterms were ok but the final was really hard.  DO NOT TAKE APRILE! Although I'm not sure how the other physics prof would be, I'm sure he/she would be better than aprile.  \nWorkload:\nProblem sets each week, takes fair amount of time.  2 midterms are ok. Final is hard.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 12, 2003",
            "review_content": "\nElena Aprile should, frankly, stick to her research.  She was on the Columbia homepage for her great and revolutionary work in dark matter.  Well, her lectures are like dark matter--students are nowhere to be found and nothing makes any sense.  And the book isn't much better.  I didn't learn anything.  Her Italian accent's hindrance to her lectures was only exceeded by her TA's, which made recitations useless.  I guess Elena is a nice person, but don't take her class unless you're looking for a cure to insomnia.  I believe that in physics, teachers can make the biggest difference between understanding and learning the material and causing students to avoid class like the plague.  I don't know what the other physics teachers at Columbia are like, but they have to be better.\nWorkload:\n10 easily graded homework assignments worth 10% of the final grade, two low-curved midterms worth 20% each, and a giant final worth 50% of final grade.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "November 03, 2003",
            "review_content": "\nThe previous reviews for Aprile are unduly harsh. Yeah, she has a pretty thick Italian accent, but once you get used to it, its not terribly difficult to understand her. The biggest problem is when she is deriving formulas. She'll sometimes ski steps, and every now and then make a mistake when writing something out. But if you speak up and call her on it, she's always more than willing to correct a mistake or explain the steps she doesn't write down. As far as the difficulty of exams, she does tons of problems in class. If you understand those, and understand the problems on the sample exams she makes available, the midterms and final should be a piece of cake. Yeah, she's certainly not the best lecturer around, but I think you'll learn physics well enough, and if you do some homework and pay attention to class sometime, and above all, go over the sample exams, the grades will come easily enough.\nWorkload:\nTwo midterms and a final. Weekly problem sets which are only 10% of the grade, so don't bother losing sleep over them.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "August 27, 2003",
            "review_content": "\nBoring.  I did not learn any physics for two semesters.  Do not take her if you can take Kim instead.  Kim substituted for her class once and was more organized and clear.\nWorkload:\nOne problem set approximately per week or so.  2 midterms, 1 final.  Not horribly difficult but the class average is always low.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "June 16, 2003",
            "review_content": "\nA living nightmare! Physics used to be my favorite subject...until I came to her class. The worse teacher I've seen so far in Columbia. A useless class! She is completely disorganized and her concept of teaching is throwing in random examples in the board without explaining the theory, mumbling in Italinan accent, and hopelessly trying to explain a chapter in 20 minutes. \nWorkload:\nAlmost weekly problem sets, midterms, final - but who cares... nothing helps, nothing is going to teach you physics!!!\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 10, 2003",
            "review_content": "\nHorrible lecturer.  Depending on who you are, homeworks can be easy or hard so whatever, everyone in 1400 gets the same horrible book.  I tried to stay awake in her class, but I just can't.  If the 1600 class has a lecture about the same, I suggest you go to those and take the 1400 exam.  The 1600 level class is so much more lively and you can pay attention, meaning you take better notes.  So get a 1600 education but take the 1400 exam.  If Kim is available, take him instead.  Avoid this woman.\nWorkload:\nWeekly Homeworks, 2 midterms, second one is stupid hard. Final exam\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 06, 2003",
            "review_content": "\nThink of a normal physics lecture. Aprile's lectures are like that lecture translated into Italian by one of those free translation things they have on the internet, translated back into English by a monkey, typed up and printed out, cut up into individual sentences, and then randomly reassembled into an hour and 15 mintures of sheer incomprehensibility. I had Sciulli last term, and while he phoned his lectures in by powerpoint, at least I could understand him. Aprile came in on the first day promising student interaction and fun, but that's a little tough when you can't understand what's going on. Her accent isn't as thick as other reviews make it out to be (although it took me a few classes to figure out that \"teeti\" is actually the Greek letter that most people call \"theta\"), but the lectures themselves are shamefully disorganized. She usually started each class by pointlessly reiterating her few cogent points from last class, like reproving a whole equation. Then she would go on to do half of a couple problems tangentially related to what she just said. Then she would realize she had forgotten something and go back to the beginning. Then she would realize she was running out of time and jump forward to something else. Then she would try to teach half a chapter in the last 10 minutes before class, before running out of time and pushing the homework back another day. She was constantly stumbling over herself. I feel sort of bad for her, but the class is really a mess. You have to teach yourself. I actually went to about half the lectures, because I found the textbook pretty bad too, but it really wasn't worth it. The only enjoyable part was when she hooked a tiny little wire up to a car battery to demonstrate how currents generate magnetic fields and then walked away. It started smoking, and when she smelled the smoke, she panicked and swore. That was fun. \nWorkload:\nNot bad at all. 2 midterms and about 10 homeworks, plus the final.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "April 14, 2003",
            "review_content": "\nAprile's not a talented lecturer...you could probably learn the same amount straight from the text. Her tests vary in difficulty but as long as you know the material well, you will do well (much of that is based on the fact that there is a curve and the rest of the class doesn't do well). I suggest that you get a physics tutor or set up a study group, learn the material, and you'll get higher than a B+.\nWorkload:\n10 HW sets (10%), 2 midterms (20% each), final (50%)\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "February 17, 2003",
            "review_content": "\ni agree with the last review.  i could actually feel the knowledge being sucked out of my brain during her lectures.  she should go eat a physics textbook.  DON'T TAKE HER.\nWorkload:\n2 midterms and a final, my ass hurt after the second midterm.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 15, 2002",
            "review_content": "\nHorrible. I actually got stupider in physics by taking this class. She just mumbles and writes crap on the board and wonders herself how to teach it. hw is easy, everyone gets a B+ in the class, but the curve sucks in terms of getting an A- or above. out of 140 students only 10 end up with an A-...someone explain that to me\nWorkload:\nweekly hw, 2 midterms, first extra easy, second graded ridiculousy hard, final\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 04, 2002",
            "review_content": "\nprof aprile TRIES to be a good teacher. she is , however, dull as hell; her lectures are uninteresting, useless and completely straight from the -somewhat nice- textbook. the exams are not hard, and extremely well curved- a 19/50 on the 2nd midterm was a B/B+!! the homework problems take a long time to do, but it pays off in that the exams are in the exact same format and level. she solves problems in class sometimes, in a very unorganized way, and some of them also end up in the exams , so going to class sometimes can kind of end up helping you- considering you don't doze off to the sound of her italian accent!!\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 18, 2002",
            "review_content": "\nNice lady, but she has an italian accent and she mumbles. She uses a terrible textbook, and doesn't teach everything required to do the homework. If you think you can get by without going to class, think again. She tests on questions she went over in class. Also, if you do well on your first midterm, dont get cocky or confident, because the second is 5 times as hard. I'd take Parsons in 1601 before I took her for 1401 again.\nWorkload:\nweekly problem sets, 2 midterms, final\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "July 20, 2002",
            "review_content": "\nIf you take Aprile's class and want to actually learn something, be sure to grab a seat towards the front... She tends to mumble and her accent is sometimes a bit hard to understand (esp when she's mumbling)... Sometimes she'd forget that her audience is not the blackboard. But she does a good job doing sample problems on the board, though she's pretty bad at answering questions in class. Her exams are not too hard if you've done and understood the homework problems, which can take a looong time to do. Hint: Start early! \nWorkload:\nweekly homework (takes a while to do); okay midterms and final\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 05, 2002",
            "review_content": "\nProf. Aprile generally teaches directly out of the text, which makes showing up to class unnecessary. To make the classroom even less populated, the answers to problem sets are all on the webpage (if you can fididdle with the URL). Tests are extremely well curved, and are easy to perform well on since she allows the use of a formula sheet. I recommend not going at all, and studying the day before the test...at least you'll beat the curve.\nWorkload:\nWeekly problem sets, two midterms, final.\n"
        }
    ]
}