{
    "prof_info": [
        {
            "prof_name": "Mary Putman",
            "prof_id": 3974,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Another Earth",
            "review_date": "December 08, 2020",
            "review_content": "\nTake this class! The material is very tame, as is the workload. It's also super interesting and Putman is an awesome instructor, even over zoom. Would definitely recommend this course for fulfilling the science credit, especially for non-SEAS/non-STEM majors!!!\nOne thing is to ALWAYS do the optional readings. Sometimes the assignments and exams cover content not explicitly in the lecture, so you need to keep up with the modules. \nWorkload:\n7 HW sets, weekly readings (optional but strongly encouraged), midterm, and final exam. All very tame\n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "March 27, 2016",
            "review_content": "\nPutman's maternity leave came about midway through the semester I had with her, but her appearance in the audience of the lecture a few weeks later clearly shows her interest in the class.\nShe starts the lecture with an \"alien of the day\", and relates how this alien may or may not be biologically, chemically, and physically able to live in the universe in such conditions as on its planet. Examples included Superman and the alien from Avatar, etc. A kind of silly trigger for the beginning of class, it actually does provide some insight into requirements for life in the universe, which *is* the point of this class.\nThe material was fascinating; a combination of the three classic sciences point to possibilities for life in the universe. Sometimes it will make you feel very small, but it is this notion which, I think, makes this class all the more fascinating.\nPutman uses a multiple-choice card to gauge the reception of basic concepts learned in class. She asks a question on the board, provides 4 possible answers, and the class holds up the letter of the response they think to be correct. This is a great way to get the participation of the students. Additionally, she would send out in-class assignments (usually worked on in groups or pairs) to answer a short list of questions. This would be counted as a participation grade.\nGrading was fair; tests were on the material learned in class. Homeworks were occasionally more difficult than the material learned in class, but this was because they were more mathematical than the theories we learned during the lecture.\nWorkload:\nFrequent homework sets, some in-class participation required\n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "November 13, 2012",
            "review_content": "\nMary is an interesting person. Students are rude to her and she is rude right back at them. She shows us interesting videos and likes some discussion. However, she says all the material can be learnt in the lecture and that is absolutely untrue. She'll mention it for a split second in class and expect you to know the intricate details only explained in the textbook. She hosted a trivia (Who wants to be an astrobiologist) before the midterm for our review session, which was a waste of time and was filled with misleadingly easy questions. I haven't enjoyed my time in the class, because I find the teacher to be a distraction from the material. If you are taking it for easy points as my intention was I would suggest reconsidering a few more PE courses.\nWorkload:\n(15%) 4 Quizzes: Open Note, Mostly from lectures or book material (one is dropped)\n(25%) 7 Homeworks: Mostly from lectures or discussion\n(25%) Midterm: Harder than expected, but still manageable with average of 84\n(35%) Final: TBD\n"
        }
    ]
}