{
    "prof_info": [
        {
            "prof_name": "Robert  Holliday",
            "prof_id": 12959,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Computer Science Theory: Computability - Models - Computation",
            "review_date": "September 24, 2015",
            "review_content": "\nFantastic professor. He was extremely clear throughout every lecture, and took time after every lecture to answer every question you have, even if that means reviewing what he went over in class. If you're taking CS courses in the summer, definitely consider this one to knock out your requirements.\nThe problem sets didn't take too long, and as for the midterm and final, he gives out a study guide that will indicate pretty much what *exactly* will be on them. The workload is very, very light, and the exams are very fair if you use the study guides he provides. Honestly, you can spend very little time preparing outside of class for the exams if you pay attention in class and sometimes stay after class to ask questions because he's that clear (some will say slow-paced, but the concepts are very well-elucidated). He largely covers the textbook, but I never found myself really needing to turn to it.\nWorkload:\n-Weekly problem sets (should take at most 5 hours for each one)\n-One midterm\n-One final\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "August 05, 2014",
            "review_content": "\nThis review is for the summer session Discrete Math class with prof. Robert Holliday. He only teaches in the summer, and apparently he has been teaching at Columbia for many years. He seemed really nice in the beginning, but that turned around quickly. He doesn't care about the students actual learning the material; every lecture felt rushed.\nThe homeworks were very long. However, they made up mere 20% of the final grade. I thought it was unfair given the  amount of work you had to put in in them. The midterm was very easy, too easy, I'd say. He gave us a study guide and said that what wasn't on the study guide would not be on the exam. That wasn't true: one problem asked to use a formula that didn't appear on the study guide. The final was much harder than the midterm. It seemed that he made it so intentionally to force a better grade distribution. \nIf he's the only option for the summer, don't take it. Just take the regular class in the fall or spring. \nWorkload:\n20% problem sets, very long\n40% very easy midterm\n40% not so easy final\n"
        }
    ]
}