{
    "prof_info": [
        {
            "prof_name": "Susanna Coffey",
            "prof_id": 13759,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Drawing II",
            "review_date": "December 08, 2019",
            "review_content": "\nI had Susanna for Drawing II and I was deeply disappointed and frustrated with her attitude and management of this class. \nFirstly, she was deeply disrespectful of our time. This class is SIX hours long. That is already draining. Regularly she would shorten our lunch-break without warning. She would run class 20 minutes into the hour long break but then expect us to come back at the same time. She released us from class 45 minutes late one day. She required us to come in an HOUR AND A HALF early to our final class and only gave us a 15 minute lunch break.\nSecondly, she was rude. She would call out and shame students who misinterpreted assignments or forgot to do homework (which is difficult to blame them for because it was often very unclear what we were expected to do). She would snap and make very rude comments when I spoke to my fellow classmates. I understand and value silence in a creative space. However, expecting zero social interaction over a 6-hour class (or out on field trips...how are we supposed to not speak and why is that helpful?) was unreasonable. She would regularly threaten us/our grades when we she was displeased with us. It felt like a power trip.\nOverall, her teaching drove me to resent this class and the work I was doing for it. It did not feel like a space that fostered learning and creativity. It felt like a space where she was in control and she enjoyed that. It sucked, I love art and was excited to finally incorporate a Visual Arts class in my schedule but this was a miserable experience.\nWorkload:\nPretty intense. Semester-long project of 20 pieces. Weekly drawing and sketchbook assignments. Several mandatory excursions to art galleries/museums.\n"
        }
    ]
}