{
    "prof_info": [
        {
            "prof_name": "Karen Santos Da Silva",
            "prof_id": 12614,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Composition and Conversation",
            "review_date": "December 08, 2016",
            "review_content": "\nKaren is an amazing professor! She is very thorough, extremely knowledgable, and wants to help you improve your French. This class was reading-heavy and, as the name suggests, analysis heavy. We spent a significant amount of time learning/going over analysis techniques.Since this was the first year the course was offered, it will probably change a little, but the course was broken into units based on type of literature (poetry, prose, theatre). I would strongly suggest this class to anyone looking to work on their literature analysis or improve their French writing and reading. It's a great intermediate class if you want to get your French skills polished a bit before jumping into more intense literature/film classes. I would also strongly recommend this class just for the professor -- Karen is really kind and funny. \nWorkload:\nIn class midterm, in class final, 2 in class analysis presentations, a few short compositions (all very manageable!!)\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "October 22, 2014",
            "review_content": "\nI do not know why there are not many reviews on Karen already. TAKE HER. Any class you can take with her-- I GUARANTEE that you will learn so much French. Her accent is extremely clear, the assignments are manageable, and even the literature she selects (for more advance French) is incredibly interesting.\nAside from that, she cares. She really wants you to learn, and again, I guarantee you will. \nWorkload:\nVery very manageable, about 3 compositions, sometimes a few readings. It all depends on the level of French, but she is very straightforward and understanding. \n"
        },
        {
            "course_name": "Intermediate French I, Barnard",
            "review_date": "October 21, 2014",
            "review_content": "\nKaren is a wonderful teacher. She is tough and won't put up with any bullshit but she will help you improve your french like no other. She encourages you to speak, won't give you straight answers but rather, explain things to you in French or aid you in understanding it on your own. Her critique of speaking and homework is constructive and never hurtful and she is a great, funny woman. \nIf you do the homework and you are willing to learn you will go far in her class with a good grade\nWorkload:\nFew quizzes, homework 2x a week (workbook activities or handout sheets), midterm and final exam \n"
        },
        {
            "course_name": "Composition and Conversation",
            "review_date": "August 13, 2014",
            "review_content": "\nProfessor Santos da Silva was fantastic and I highly recommend taking a class with her. I felt very comfortable speaking in class and even though she would always correct you, it was done in a very pleasant and helpful way. Due to her corrections, my accent greatly improved in class. In terms of the class set up, it was always open discussions based on the topic of the day, whether it be a chapter from a novel we read or a current event. The class did a great job of covering a lot of material. We started with a self-portrait unit, followed by a current event unit, ending with a very appropriate unit on nyc. The vocab quizzes are graded very fairly and she doesn't take off too many points for grammatical errors. Make sure to do all of the blog posts and hand in your journal every week because they do truly count towards your grade. Overall, you will have work to do after every class, but it is totally worth the experience.\nWorkload:\nWeekly 1 page journal entries\nWeekly short blog posts\n3 vocab quizzes\n3 compositions\n1 oral exam\n"
        }
    ]
}