{
    "prof_info": [
        {
            "prof_name": "Marina Blitshteyn",
            "prof_id": 10783,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 11, 2011",
            "review_content": "\nIf you find yourself in Marina Blitshteyn's class, please for your own sanity do EVERYTHING in your power to get out of it. She seems nice enough at first, but don't fall for it. She's pure evil. \nWe were loaded with hours of pointless homework each night that she never bothered to read or grade. We got the first real taste of Marina's insanity, however, when she asked us to write our full first drafts for the first progression in two days, from Monday to Wednesday, with absolutely no warning to allow us to plan ahead. From there it only went downhill. A few weeks into the semester she acquired this habit of emailing us our homework for Wednesday, like clockwork, between 2 and 3 a.m. on Tuesdays. Homework for Monday would be sent at 5 a.m. on Sunday. I have never had an instructor with such little respect for his/ her students. We would ask for our homework in class, and she would refuse even that small request, saying \"oh don't worry, I'll email it to you\" and thereby denying us the ability to manage our time effectively. Gallingly, she expected far less of herself than she expected of us. She took as long as three to four weeks to send us comments on our formal drafts, sending people responses one by one so that some people had two weeks to incorporate her feedback for the final draft while others had only 48 hours. She never even bothered to comment on our drafts for the third progression, despite saying she would. She said no to almost all requested extensions. She steadfastly refused to clarify details of assignments in advance, so we could not work on them in advance.\nI expect my professors to read my homework assignments, to give me enough time to complete them and advance warnings about due dates, and to be willing to explain what the assignments will be. I expect them to be understanding when their students ask for extensions because they have been given a single night to complete a substantial assignment with no prior warning. I also expect them to give me feedback in a timely manner, at least when I am expected to incorporate that feedback into a second draft. Marina did none of these things. She acted unprofessionally and callously, and it was all too clear to everyone in the class that whoever allowed her to teach made a grievous error.\nWorkload:\nMindless busywork writing assignments every class, which often take hours, are never read by her, and are typically emailed to us at the last minute, in addition to the exploratory, formal and final drafts for each of the three standard UW essays. Our class never really got around to the reflection essay.\n"
        }
    ]
}