{
    "prof_info": [
        {
            "prof_name": "Herbert Terrace",
            "prof_id": 186,
            "total_reviews": 28
        }
    ],
    "reviews": [
        {
            "course_name": "Evolution Of Cognition",
            "review_date": "November 08, 2016",
            "review_content": "\nWhile his socratic teaching method was at first a little foreign, after a few weeks in the class I actually appreciated how this teaching style invoked deeper thought on my part which ultimately led to a deeper understanding of the material. With regards to the course layout, I found the order to which the material was presented to be extremely logical and easy to follow. It is very obvious that Professor Terrace is extremely knowledgeable in this subject which made going to lecture a very informative and thought provoking experience. The amount of information that we were held responsible for was very manageable and I felt it was introduced at a very reasonable rate.\nLastly, I highly recommend taking this class at the same time as Science of Psychology if you need that requirement as well as so much of the material overlaps. \n\nWorkload:\nThe work load is beyond fair with weekly quizzes, three multiple choice exams, no final and no papers!\n"
        },
        {
            "course_name": "Evolution Of Cognition",
            "review_date": "November 08, 2016",
            "review_content": "\nWhile his socratic teaching method was at first a little foreign, after a few weeks in the class I actually appreciated how this teaching style invoked deeper thought on my part which ultimately led to a deeper understanding of the material. With regards to the course layout, I found the order to which the material was presented to be extremely logical and easy to follow. It is very obvious that Professor Terrace is extremely knowledgeable in this subject which made going to lecture a very informative and thought provoking experience. The amount of information that we were held responsible for was very manageable and I felt it was introduced at a very reasonable rate.\nLastly, I highly recommend taking this class at the same time as Science of Psychology if you need that requirement as well as so much of the material overlaps. \nWorkload:\nThe workload is beyond fair. Weekly quizzes and three multiple choice exams with no final. Couldn't ask for a better workload. \n"
        },
        {
            "course_name": "Evolution Of Cognition",
            "review_date": "March 02, 2015",
            "review_content": "\nSome men are born to teach, the Aristotles and Confuci (Confucius plural). Then there is Herb. Professor Herb is the only man in the world that can raise a chimpanzee, basically teach it how to talk, dress it in awesome clothes and get a movie made about himself and his off the wall adventures with his furry companion... then turn around and bitch about it. Besides learning that every question is a stupid question and that psychological research is a joke because the whole field is obsessed with impressing this man, you will not learn anything from his lectures. His grumpy rants, only to be interrupted by the prolonged sound of him sipping from his diet coke (or occasional coffee which requires a dry, effortful blow), have little content that you didn't learn in any intro to psych course at any school, community college, or picture book. However, the worst thing about Mr. Terrace's class of buffoonery, was the tests, which he was absent for, which his TA's wrote... In short the tests in this class resemble those written by a dyslexic fourth grader who just discovered adderall. Anywho,the textbook is from the 1960s, unpublished by the man himself, which includes many different fonts and fun misspellings that could be used for drinking games! Finally, the class is curved which is good! Oh wait, it is not? I could have swore he said it was curved... the syllabus says its curved... he gave us our scores during the year on a curve... NOPE! Professor Shouldretire crushed the curve at the last second just as he has crushed so many dreams, GPAs, hearts, and talking-monkey hopes. Damn you Herb, damn you.\nWorkload:\nA few illiterate exams. No need to read any text he gives you, the tests don't cover any of it. The only real workload is the constant fighting with your TAs over questions that have 3 correct answers. \n"
        },
        {
            "course_name": "Evolution Of Cognition",
            "review_date": "May 19, 2014",
            "review_content": "\nDO NOT TAKE THIS CLASS.\nTerrace should have stopped teaching 15 years ago.  His information is outdated, the tests are mostly illegible and do not reflect the material of the class, and he is an asshole if you try to meet with him in office hours. \nThat being said, the actual content of the class is very interesting.  If any other professor lead the class, I'm sure it would be one of the best in the psych department.  Readings range from scientific articles to magazine articles to a DRAFT of a textbook he tried writing over 15 years ago.  The course would be much better if it just had a standard issue textbook.  \nBut it doesn't matter.  His tests are terrible, not because of the difficulty of the course, but because the answers are sometimes objectively incorrect and because the syntax is at a 5-year old's level.  The TA's often made fun of how ridiculous some of his practice test questions and answers were.  Unfortunately the actual tests were the same if not worse. \nEx. 1: One of the readings explicitly said that pigeons could learn a relational principle.  The answer on his test was that they couldn't.  When brought up in office hours, he said the article was wrong.\nEx. 2: Terrace said that procedural memory is not memory, and even though he understood how this would confuse people on tests since he never explained it to us, he would leave it the same next year.\nEx. 3:  One time Terrace asked the class if we had seen the movie Her.  After barely anybody raised their hand, he promptly spoiled the ending of the movie.  \nTests are often graded so that the difference between an A- and an A+ is one multiple choice question.  At the same time, the difference between a B- and a B+ may be 6 questions.  Not sure if this is common, but it seemed illogical to me.\nI should add that I got an A+ in the course.  Even with that grade, I strongly recommend avoiding anything with Terrace.\nWorkload:\nWeekly pass/fail quizzes you can re-take - 10%\n3 tests - the first was fine, the last 2 were prime examples of how not to write a test.  They will make you hate the class - 30% each\n"
        },
        {
            "course_name": "Evoulution of Consciousness & Intelligence",
            "review_date": "September 02, 2008",
            "review_content": "\nhonestly as i went through the course i was like this professor has to be kidding me...literally the course is taught by the student and then he often chimes in and says his piece and questions what the student brings to the table on the topic he offers... but by the end of the semester when we had to do the paper  i realized how much i had learned from writing the paper and reading the assignments. its a totally different way of teaching and your grade is based on the presentation and the final paper and thats it. he gives you two weeks off to do the readings which you dont have to do at all...but look as much as people say its death..its really not that bad- its interesting topics and basically discussion in the class but when you get to the paper you feel like there is alot of pressure cause the guy doesnt know anyones names and could care less about how the presentation turned out as long as its relevant and the outline is good. so the grade is all on the 10 page paper. but hes really leinient and quite approachable..he basically does the work for you besides your paper. \nif you need to take it- its not bad at all def not death like others are saying\nbut if you dont need to - then its not worth it. \nand its pretty cool having the first 2 weeks off of class\nWorkload:\n2 presentation that he basically does for you and the final paper that is like 10 pages. and he gives you questions you have to answer.leinient grader \n"
        },
        {
            "course_name": "Evolution Of Cognition",
            "review_date": "August 24, 2007",
            "review_content": "\nSomeone wrote \"People who say this class is the equivalent of death need to grow up.\"  No.  This class is the equivalent of death.  And you mark my words and you will understand them if you take this class.  All the reviews are true.  This was the worst Professor or teacher I have EVER had.\nWorkload:\nwould be pretty light, only 3 tests.  not a lot of material. so not bad but the problem is that it doesn't matter because his tests are written in such a way that you won't understand the question.  Class is optional.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "July 18, 2006",
            "review_content": "\nDo not take this class.  He doesn't curve till the end so you have no idea how you are doing and you will drive yourself nuts  As far as teaching....he lectures straight from the slides.  His TAs were disconnected and his students slept.  He was impossible to talk to.  The slides were not good and contained long quotes from Freud which he liked to read word for word.  He gave unedited chapters of his book which was rejected for publication to the class.  The tests were silly, from test banks and did not match up at all with the book or what was learned in class.  In fact, often the slides/book/test answers contradicted each other.  I did manage an A, but after a horrendous semester.  It was a miserable class and I hear great things about Galanter.  Wait for his class unless you want to spend your semester studying and memorizing useless facts just to deal with the crazy, unedited tests.\nWorkload:\nwhat you make of it.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 19, 2006",
            "review_content": "\nAlthough a knowledgeable and brilliant psychologist, as a teacher, Prof. Terrace is boring.  His lectures are very dry and can be difficult to stay awake through.  It is obvious he knows what he is doing, and perhaps he is overqualified to teach an intro class.  He seems unenthused about everything with the exception of his own Nim Chimpsky experiment.\nWorkload:\nA lot of reading.  Three tests, no final.  Tests weren't too bad, but were harder than expected.\n"
        },
        {
            "course_name": "The Evolution of Consciousness",
            "review_date": "December 28, 2005",
            "review_content": "\nAlright, I had heard bad things about Terrace as an intro psych teacher: talks about himself, dry, biting, etc.  However, in this fascinating seminar, his character is somehow quite endearing.   You realize what an expert he is on his subject, and it's quite hilarious to hear him insult others in the field (Chomsky is a favorite).  He really really makes you think, but does not dominate the discussion.  Each person teaches a class, which is basically whatever you make it.  And the subject matter is SO interesting.  Highly recommended.\nOh, and his sense of humor is actually stellar.\nThe one downfall is that he doesn't ever tell you your presentation grade, so you turn in your final paper with NO idea of how you're doing in the class.  But you should just chill out about this.\nWorkload:\nSeminar presentation-- a lot of work, but you pick your topic so it should be interesting.  60 pgs of reading/week assigned by the student presenting.  Not necessary to do all of it, just get a good idea of what will be spoken about.  Final paper with absurd philosophical/scientific questions that you have no idea how to answer-- fun and frustrating.\n"
        },
        {
            "course_name": "Evoulution of Consciousness & Intelligence",
            "review_date": "December 11, 2005",
            "review_content": "\nI feel compelled to write a review to contrast the harsh treatment Terrace has received on this board.  Although I can't comment on his Intro class, the consciousness seminar was my favorite class of the term - always interesting, always informative.  \nThe course had the usual drawback of a seminar in that you rely on the competance of your collegues who pick weekly readings and give presentations.  The presentations are continually interupted, but this is only annoying if you are giving it and you are unprepared to be sidetracked.  The subject matter is extremely difficult to wrap your mind around but I think Terrace does a commendable job of \"leading the horses to water\" so to speak.  He is certainly an expert in the course's central themes.    \nWorkload:\nCould go either way.  You can put a lot into this class or fairly little.  The weekly readings are assigned by students so they vary in quality and are not tested directly.    You could do many suggested readings (Prof gives a sizeable list) and get a lot out of the course, or fulfill just the minimum: one presentation -1hr or 2hr depending on how many people cover you topic and a take home exam  consisting of one essay that incorporates many course themes.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "June 08, 2004",
            "review_content": "\nOh Boy. This was a tough class through which to sit. This guy like graduated from harvard and studied under B.F. Skinner at columbia. His accolades seemingly neither prove nor enhance his teaching ability. it just didn't make sense. here's a guy who worked directly under the guy who practically defined psychology in the late 20th century, and he can't finish a thought or a sentence. His book, which he wrote and was nice enough to make everyone buy, reads like stereo instructions. nothing was clear. \nthe TA's were more help than he was. During the pre-midterm review session, it would be a safe bet that everyone inattendance learned more in that 2 hours than in a semester. it would be a mistake to take this class and hope to learn anything. nice guy, though.\nWorkload:\nmidterm, final. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 24, 2004",
            "review_content": "\nI saw all the horrible reviews and I thought \"I'll give this professor a shot.\"  I regretted that almost immediately.  I agreee with all of what others have said about this class.  It's not really that hard, in fact I managed a B without really reading the textbook or coming to the last month of class (that's how little the materials helped me).  But easy doesn't mean bearable.\nThe first major problem is that he wrote the textbook...but never finished it.  As a result there are constant references to chapters, graphs, and pictures that don't exist.  Even my TA said that it was one of the worst introductory psychology books he's ever seen.  To top it off his power point lectures either serve to repeat the book verbatim or directly contradict it.  Often in discussion sessions our TA would end up having to reteach certain parts of the lecture because what was said simply didn't make sense to anyone.  \nAll in all, it's not a really tough class but it is incredibly frustrating and, I found, skippable...\nWorkload:\n3 tests all count the same, not cummalitive, multiple choice and graph. no papers but weekly quizes in discussion sessions\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 13, 2003",
            "review_content": "\nTerrace is as bad as they say.  But, he is brilliant.  Perhaps that is why he is such a miserable lecturer.  If you want to hear from someone who is an expert in his field, take this class.   If you want to be entertained---don't.\nWorkload:\nMild.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 07, 2003",
            "review_content": "\nOh jesus...that is honestly all that I have to say.  The sad thing is that this isn't a terribly hard class.  In fact, it is fairly easy.  However, Terrace is so boring it made my teeth hurt.  The only thing mildly entertaining about the lectures is when Terrace shows up in a pink dress shirt.  For some reason he is strangely captivating in this get-up.  And, the text?  Well, let's just say it is no suprise that it is still in manuscript form.  I don't like monkeys.  And, as a cognitive psychologist who plays with monkeys, Terrace speaks an awful lot about them.  Also, his lecture examples are infamously confusing.  So, in conclusion...if you don't like monkeys and boring/confusing lectures don't take this class.\nWorkload:\nNot bad. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 19, 2003",
            "review_content": "\nI started this course with a fair amount of trepidation based on the mostly negative reviews here on CULPA, and, unfortunately, the course was just about as bad as promised.  I won't rehash what everyone else said in great detail, but just for fun, the textbook is crap, the slides are confusing, Terrace's unemotional delivery of material is soporific, and the tests are irritatingly detailed.  Luckily, there's a pretty steep curve, since few people do well, so I managed to get a decent grade, but the overall experience was an unpleasant one.  This course makes it obvious that Columbia is more intent on hiring profs who are prestigious researchers (as evidenced by Terrace's recent scientific breakthroughs) over those who are simply good teachers.\nWorkload:\n3 non-cumulative exams along with weekly retakeable pass/fail quizzes during the discussion sections\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 14, 2003",
            "review_content": "\nYes, the class is boring and you may fall asleep. Yes, Prof. Terrace speaks in a monotone. Yes, the book is unedited and lacks a glossary. Yes, a large part of the class is devoted to behavior/conditioning/linguistics. However, if you want to finish the science requirement, this is a manageable class to take. All you have to do is do the reading, print out the powerpoints and review sheets to study before the tests, and bring specific questions to the TA-sponsored review sessions. (I doubt many other teachers outside of high school give practice tests, key terms, review sessions, and post their lectures online.) The non-cumulative tests are a huge plus, and you can put the class out of your mind before finals officially start.  Also, you will take a short quiz in every discussion section--this is actually a good thing! In my section, as long as you took the quiz, even if you failed, you still received credit for it and all of them added up to 100% averaged in as class participation. Plus, if you can get past the dull presentation, some of the material is actually interesting, especially the unit on the classic social psych experiments. Just face the fact that not all of your teachers are going to be good and you should be fine.\nWorkload:\nManageable--do the work all along and study for the tests and you can probably get an A-.\ntests: 3 non-cumulative tests (somewhat detailed), quizzes in discussion sections. \nreading: about a chapter or a few articles a week.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 12, 2003",
            "review_content": "\nThe people who say this class is the equivalent of death need to grow up. It's a nice way to scoot right around that science requirement of the core, without doing any science at all. The class was informative, although presented in slightly dry tones. Professor Terrace's personality and presentations may be slightly dull and dry, but just keep taking notes and you'll realize the material itself is pretty interesting. Showing up to class and taking notes on what he says (not the power points-- you can get those later online) prove to be invaluable come exam time, as you learn his random babblings were actually important. \nIn taking this class, I discovered a formula that never failed me. Get a laptop and learn to type fast. During his lectures, instead of focusing on how dry the sound of his voice is, just write down everything he says in bullet format, underneath the headings of the corresponding slide he's showing. A week before each test, print up the slides and match each heading with your notes, and study them that way. It's a no-fail, and excellant preparation for each test. Just take notes on the required readings as well, and you are virtually guaranteed an A on every test. I promise. \nWorkload:\n3 non-cumulative exams-- no final whatsoever. This is invaluable come finals week, when you are already done with psych! A fair amount of reading per class, but it's goes fast. Don't bother with the \"suggested\" readings. One mini-quiz per week given by a TA who only asks that you relatively know what's going on to earn full credit. An alright course with a great grading system. Take it. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 15, 2002",
            "review_content": "\nAm I the only one who kind of liked him? His lectures were not bad, they were actually relatively interesting most of the time.  He lectured in an easy to understand way and he wasnt afraid to waste class time showing movies that pertain to the subject.  While the critiques before me talk about his book, I must admit it was not a pleasure. It was poorly written, however, I found it actually much more benificial cause it was his exact views, and the tests came directly from it cause he is the one who wrote it and the test, so it made it easier to be successful in the class. So while it was not a very encouraging book, it was ok to get by.\nWorkload:\n3 tests, no cumulative final, which is REALLY nice. they are really pretty hard though, you have to know details, so if you are not prepared to study for this class, dont take his section.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 12, 2002",
            "review_content": "\nNot quite as bad as everyone says. Professor Terrace is indeed a boring lecturer, but his lectures are fairly easy to follow and often informative if you can get past his deadpan monotone delivery. The worst part about this course is easily the textbook, which, as stated before, is written by Terrace himself. Like the lectures the book is a pretty boring read, though quite informative. The annoying part about it is its incompleteness Â— no glossary or highlighting of key terms, frequent grammatical and editorial errors, missing (but important) diagrams all over the place, sometimes missing sections of text. And it costs almost $50. Piece of advice: get a good TA. The discussion sections were probably the saving grace of this course.\nWorkload:\nThree shorter, equally weighted tests, which is nice, but they're rather difficult. Discussion sections have weekly quizzes, but these are pretty easy and can be retaken if failed or missed.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 08, 2002",
            "review_content": "\nWorst class ever. The only way a freshmen could have been worse introduced to a college lecture class would have been if instead of going to the lectures, someone had kicked my in the nuts for four hours a week. The lectures are like chinese water torture and the only reason the man teaches is probably because he want's his little monkey projects to stay funded. The only interesting class was when he put on a video, which turned out to be about him and all these other psychologists made fun of his research. I don't care how boring Gallanter is, it can't be worse than the ass pounding this class was.\nWorkload:\nThe textbook would better be used as fire paper, but you MUST read to pass the all multiple choice exams. One discussion group a week with a quiz. Terrible class.....\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 29, 2002",
            "review_content": "\nIt was an interesting class to say the least. Off the bat, he is boring. If his voice doesn't put you to sleep, his 100s of useless slides will. I've never slept so much, even in High School. The textbook that you HAVE to buy and he wrote, consists of about 150 pages divided in to chapters in particular reading. Don't try to complement the lectures with the textbooks cauz it just won't work. I mean some stuff was interesting, The guy knows his stuff, but you are always wondering how to put it all together. Hope you get a decent TA...\nWorkload:\n3 exams that are not cumulative but that are hard as hell. Mandatory discussion sections with quizzes that can be re-done until you pass it. If you get in the B range, you're lucky.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 09, 2001",
            "review_content": "\nI would advise you to take Terrace's Science of Psychology if you enjoy the feeling of being raped again and again. I began the course with a sincere love of Psychology and a strong desire to make it my major. After taking the final test of the semester, I have neither. Terrace is a truly horrible lecturer, as each of his lectures (as well as his slapdash attempt at a text book) are comprised of many vaguely-related digressions. He utilizes his time in front of the class to speed through the miniscule amount of course material he has to present, and then passes the rest of the hour-and-a-half entertaining himself with random PowerPoint slides that have little relation to what should be the content of the lecture. Unfortunately, there is no source text to consult in case one actually wishes to learn something. Rather, Terrace's students are treated to an manuscript of Terrace's ramblings that is missing essential diagrams, bold-printed key terms, a glossary, and a sense of organization. What makes this even more offensive is that this pile of paper costs $46.10, and CANNOT BE SOLD BACK!! The rest of the reading comes from lengthy artices of slight relevance that, of course, must be photocopied on the student's dime. Countless inconsistencies appear among what is said in the lectures, what is printed in the text, and what the T.A.s have to say in discussion sections. These inconsistencies are naturally left for the student to sort through before the test. However, in spite of Professor Terrace's contempt for his students, it is possible to enjoy bits and pieces of his course due to the innate merits of the material. For the record, I will continue my Psychology track, if for no other reason than to reclaim my love for the material that was thoroughly trampled by Herbert Terrace.\nWorkload:\nThree non-cumulative exams, weekly quizzes (pass/fail) in discussion section\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 08, 2001",
            "review_content": "\nTerrace has done some important psych work...but as a teacher, he's not very effective. The class itself is easy - completely managable for science idiots like me looking to finish the requirement. It covers all the basics - history, memory, language, etc. But his lectures are convoluted, seemingly thrown together, and really not worth much at all. If it weren't for good TAs, nothing would make much sense. Basic concepts seem alien until re-explained. Making things even worse is the fact that he uses his own textbook, one that he wrote and apparently never got published. It's unfinished (lots of \"place chart here\"), which is REALLY ANNOYING. It's also as nonsensical as his lectures, so be sure to utilize the TAs! He really shouldn't be teaching, in my opinion - he's clearly smart, but should stick to the lab where he only has to deal with monkeys instead of students.\nWorkload:\nthree exams a semester, non-cumuliative (very nice at finals time because it's already all over). a decent amount of reading, not too much...but make sure you get to the psych library early to get reserve readings - for a huge class, there aren't nearly enough copies on reserve and everything is always gone the week before exams. weekly mandatory discussion sections with a 5-minute pass/fail quiz each time - makes you go to section...if you fail, you can re-take it as many times as neccesary, but not if you miss it. i usually loathe sections, but it definitely helps clear things up for this class. plus, the TAs write the exam, so listening to what they have to say is more valuable than what Terrace tries not to garble.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 08, 2001",
            "review_content": "\nUnlike Charleton Heston, this man deals better with apes than humans. His lectures are intolerably boring, so much so that only half of the three hundred students attend them on any one-day. This truancy is facilitated by the fact that he wrote his own text book which is basically a transcript of the lectures, and the TA's post the lecture notes on the internet. with these two sources, it is possible to skim by the weekly pass/fail quizzes and the three non cumulative exams, though i do mean skim since the exams are terribly specific. avoid this course if at all possible (psych majors must take it, though it is also taught by Galanter, who i hear is more engaging.)\nWorkload:\nthree non cumulative exams, weekly pass/fail quizzes\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 07, 2001",
            "review_content": "\nLook, this class is NOT as bad as everyone says. BUT, Terrace definitely leaves something to be desired. He has a great wealth of knowledge of his subject, but lacks the charisma to present it with any real affection. His text book is horribly organized and poorly edited, but informative. Thank goodness there are sections.\nWorkload:\nNot bad at all. 3 NON-CUMULATIVE exams, no final.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 02, 2001",
            "review_content": "\nOh please, for the love of god, don't take this class with this man. It is the equivalent of an academic root canal. If you are lucky, you will fall asleep. That is, if you are stupid enough to attend the excruciatingly boring lectures; stupid, because he wrote the only textbook used and lectures from it verbatim. He even repeats the anecdotes. I'm not kidding. If you for some reason must take this class under pain of death, just read the damn book before the tests and you should be ok. Or you could try the old 'Abracadabra' method, since the inane things are multiple choice.\n"
        },
        {
            "course_name": "Animal Cognition",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is an extremely boring course, but hey, for 2 hours a week (once a week) it's worth it. Terrace is the worst lecturer by far that I've ever seen. Even he falls asleep in his own class, no joke. Workload: Leading 1 or 2 classes, which involves a 2-hour speech which is continually interrupted by boring additions from Terrace, and writing an outline for the class to follow and an annotated bibliography on all the extra reading you have to do. Also an in-depth final take-home exam/paper.\n"
        },
        {
            "course_name": "Animal Cognition",
            "review_date": "December 31, 1999",
            "review_content": "\nHe'd rather be playing with monkeys. Herb wrote a textbook but no publisher will buy it; unfortunately you've still got to shell out forty bucks at the bookstore for the manuscript, which is poorly illustrated and filled with errors. Monotonous lectures complement the horrific text -- avoid at all costs.\n"
        }
    ]
}