{
    "prof_info": [
        {
            "prof_name": "Louise Ermelino",
            "prof_id": 1994,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style I",
            "review_date": "August 29, 2005",
            "review_content": "\nI thought Louisa Ermelino one of the best teachers that I have had yet at Columbia. She is kind, she is funny, and her comments are always straight to the point. If you require hand-holding, don't take her class. If you want to learn how to write, and write well, then sign up early. I was lucky enough to have a great group of people, but the ones who seemed less than satisfied were also the same people who didn't prepare properly, made excuses, and were defensive. What a coincidence...\nWorkload:\nThe usual for S&SI;: short story, monologue, scene, poem, plus some readings\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 02, 2005",
            "review_content": "\nLouisa is a trip.  Her grading is very fair and mostly based on effort but the workload is a little heavier than most S&S; I classes.  You have stories to read & respond to, character worksheets to do, writing excercises... most of which I found unhelpful and generally time-sucking.  She has a tendency to make mean under-the-breath comments which are less than supportive but she has a good sense of humor.  As long as you're on her good side, the class will go well for you.   I really think these classes depend more on who's in the class with you and I happened to have a pretty good section, but, I think Louisa's method of critiquing (having people read their stories aloud in class and then giving instant verbal feedback) is pretty ineffective and doesn't really allow anyone to absorb the material or give constructive feedback.  Also, her critques themselves seem uninvolved and distracted.  She generally says the same things over and over again.      \nWorkload:\nMore than usual S&S; I classes:  writing excercises and stories/story responses in addition to all portfolio work\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "February 13, 2004",
            "review_content": "\nWonderful instructor.  She understood that for most, this class was their first ever college writing course, and graded based on effort.  Very encouraging and open to meeting with you outside of class.\nWorkload:\nHeavier than most SSI classes, with writing excercises on top of the normal poems, short stories, etc.\n"
        }
    ]
}