{
    "prof_info": [
        {
            "prof_name": "Annette Insdorf",
            "prof_id": 3990,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Polish Cinema",
            "review_date": "May 03, 2007",
            "review_content": "\nWonderful!  This has been one of my favorite classes ever and Prof. Innsdorf is an absolute delight.  Her lectures were sparkling, but she artfully led the discussions in such a way that you wanted to participate.  She valued our opinions and the general atmosphere of the class was stimulating and inviting at the same time. Yes, she expects you to write well for your papers, but you should be a good writer if you're here at Columbia!  The films were engaging, just like the professor. Definitely take this class!\n"
        },
        {
            "course_name": "American Film History, Senior Seminar in Film Studies",
            "review_date": "December 27, 2006",
            "review_content": "\nI'm surprised to see all the sniping reviews here about Insdorf.  It seems everyone I talk to absolutely adores her.  Anyway, I'm not alone in thinking she's quite wonderful and a highlight of my time at Columbia.  Insdorf's lectures are quite sexy -- full of insight, infectious passion and charm.  She knows many top figures in the film business and isn't shy about sharing those relationships if you need access to people for your thesis research.  She's a top figure in film criticism and a major player on the festival circuit, so yes, she's insanely scattered and busy during her office hours.  You can't go into her office needing emotional hand-holding or support - you probably won't get the coddling you're looking for.   But I disagree with the other reviewers who think she doesn't care about her students.  I've seen her give warm attention and respect to even the most insane rambling from students in senior seminar.  I've seen her dance like a freak in the office when a student's song was playing over the Internet.  She's great.  Really cool, very human.  And she built one of the most prestigious film departments in the world on a shoe-string budget.  It's simply not true that she gives an overly academic or literary approach to film study.  If you do the reading in, for example, American Film History, you'll find that there are long, difficult chapters on film technology, camera work, and film practice; and in fact, if you don't internalize all of that material, you cannot possibly do well in her class.  Where her background as a PhD in English Lit does impact your life, is that she does not tolerate bad writing.  She'll literally fail you if you commit any of a series of standard grammar sins on your papers.  But she's very clear about them upfront, so you just need to actually show up, listen, and perform like a student at an Ivy League institution.  \nWorkload:\nIn her American Film History class, the exams can be demanding - you will have to do the reading to do well in the class.  I found that the difference between people who were satisfied and dissatisfied by her class was clear:  doing the reading makes all the difference.  But in the end, your grade is dependent on your TA.  TA's in the film department are rarely top-notch.  They're in film production, and we're in film studies, and they are simply different disciplines.  \n"
        },
        {
            "course_name": "American Film History, Senior Seminar",
            "review_date": "March 22, 2006",
            "review_content": "\nI will not disagree with what most people have already stated about Annette. \nShe is quite the Cannes starlet, and she may well fantasize about her past, translating for Truffaut. She runs the department well from a public relations point of view --hey Columbia's undergrad film program still makes all the lists in spite of the fact that we don't have any real production classes, or equipment, or funding, or a way to meet real producers making films in the real world, or a dedicated networking apparatus to get our students out into real film jobs-- but she's not an empathic teacher, and that makes her lousy in the classroom. One can smile and smile and still be a villain. Well okay, she's not a villain, but she smiles too much. She just wants you to hand in work so she can scan it and give you a B. Her lectures are not dull or boring or rambling. They often sparkle. She will keep your attention even, but try talking to her in office hours, or during your senior seminar and you will see that her static artistic vision, her over-extended schedule, her pre-conceived notions, and the vague indifference behind that enormous smile are all really quite tedious.\n"
        },
        {
            "course_name": "American Film History, Senior Seminar",
            "review_date": "July 24, 2005",
            "review_content": "\nThe leading lady of the Film Dept. behaves like a starlet -- self absorbed, she doesn't care to listen when you have questions or concerns. Instead, she picks up the phone and sends e-mails DURING her office hours, with you sitting right there in front of her. Who could blame her? She has so much schmoozing to do that she gets little time to actually worry about running an entire department. \nHer American Film History course is interesting (and mandatory for film majors), with a good line up of must-see films and an occasional rarity. Her lectures, however, are repetitive and not very insightful, since, as everybody knows, she's been giving her lectures off notes written many years ago. As for the Senior Seminar, avoid her if you can -- she just wants you to hand in the goddamn paper. She doesn't really care if you're stuck in your research or if you haven't written a word until way pass the official deadline. There are other senior advisors who are actually interested in what you're doing, so look for their seminars instead.\nWorkload:\nTests and papers in American Film Hist and one paper plus thesis research and paper in Senior Seminar.\n"
        },
        {
            "course_name": "American Film History",
            "review_date": "July 07, 2005",
            "review_content": "\nShe's charming and knowledgeable.  Although it often seems like she's reciting her notes verbatum, her lectures are NOT boring.  I appreciated her enthusiasm.  grading depends entirely on the TA\nWorkload:\nTwo papers, a mid-term, and a final\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "May 06, 2004",
            "review_content": "\nI have never written a culpa review before but I feel that I must do so for posterity.  Yes, she must have some good ideas, but she does not take her role as a teacher seriously.  She discourages.  Blindly.  She does not approach students' work with an open mind or actually try to help if they have questions about her opinions or grading methods.  If your approach to film is not identical to her's (from a very academic, concrete perspective) she will not try to understand where you're coming from.  Instead of helping to teach you her way, she'll just compare you to other students in the class and hint that you'd never understand or be capable of performing up to that level anyway.  I really thought she was rude.  I'm sure that she used to be a better teacher, but she just made me feel bad about myself and my work for no reason.  If you want to take her class, just make sure that you think she's a genius and you totally understand her method and you'll do just fine.  \n"
        },
        {
            "course_name": "American Film History 1930-1960",
            "review_date": "September 18, 2003",
            "review_content": "\nIf you decide that you are going to major in Film, there is no way to avoid Annete Insdorf.  While you will occasionally find a student who really likes her and has nice things to say, Insdorf is hard to love.  Her lectures are just that, opportunities for her to talk AT you for an hour and a half and, unlike every other professor in the department, she does not encourage students to \"jump in\" and ask her questions, raise ideas, etc. However, I've had some really annoying kids in lectures who loved the sound of their own voice, so maybe her lack of interest in student participation is a blessing...depends on your perspective.  Her lectures emphasize visual metaphors in the films watched and are pretty light on theory- a good thing.  However, her style of lecturing is akin to listening to an encyclopedia talk: everything is written out beforehand and simply read off the page.  Again, maybe this is a personal thing, but I can't help but feel she does a lot by rote and does'nt really engage with the material afresh every class.  It's obvious that she has delievered the same lectures a hundred times and she seems fine with just reading off her (English Major-esque) analysis.  If you do take this class, don't piss her off by leaving early or not going to discussion section...she holds grudges.\nWorkload:\nThere are actually tests in this class.  What, tests?  Yes, like a real 2-3 hour midterm and final with short answers and several essays.  Plus there was a final paper too. It's all doable, no question, but tests are a pretty unique occurence in most film classes...\n"
        },
        {
            "course_name": "American Film History 1930-1960",
            "review_date": "August 10, 2002",
            "review_content": "\nInsdorf is a godsend for film aficionados and majors who are interested in taking a literary approach to film analysis. Her lectures are engaging and densely packed with information. Her enthusiasm is infectious. She truly loves the films she shows, and this comes through in her lectures. Experienced film students will find the deficit of Film Theory either a welcomed break or a disappointment depending on their tastes, and novices will not have a hard time keeping up. The class is also conveniently broken down into a screening, followed by the lecture - Students pressed for time can skip screenings of films they have already seen and walk in for the lecture.\nWorkload:\n2 papers (5-7 pgs.), weekly discussion sections, in-class midterm and final. Tests are VERY long, but not particularly difficult. Readings are optional depending on the TA.\n"
        },
        {
            "course_name": "American Film 1930-60",
            "review_date": "May 21, 2002",
            "review_content": "\nInsdorf is the perfect example of what a film teacher should not be. She does not even stay to watch the films screened in class and instead retreats to her boudoir, where, perhaps, she reviews her ancient notes and dreams of Truffaut. Also, she is boring, very boring. And she gives you tests! Tests!!! Her smile is as wide as she is small.\nWorkload:\nTESTS!!!!\n"
        },
        {
            "course_name": "American Film 1930-60",
            "review_date": "May 21, 2002",
            "review_content": "\nInsdorf is the perfect example of what a film teacher should not be. She does not even stay to watch the films screened in class and instead retreats to her boudoir, where, perhaps, she reviews her ancient notes and dreams of Truffaut. Also, she is boring, very boring. And she gives you tests! Tests!!! Her smile is as wide as she is small.\nWorkload:\nTESTS!!!!\n"
        }
    ]
}