{
    "prof_info": [
        {
            "prof_name": "Dawn Strickland",
            "prof_id": 11575,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Discrete Mathematics",
            "review_date": "December 04, 2014",
            "review_content": "\nDespite what past reviews have said about Dawn, there's another perspective that's worth considering. Which is that she is an incompetent teacher w.r.t. teaching concepts that students are not already familiar with. For students with a strong mathematical background, this is no problem, because, as previous reviews have mentioned, this class covers more breadth than depth. But because of the increase in CS majors, there's a corresponding increase in students in the class who haven't had as rigorous a math background. For us, Dawn's explanations leave a lot (everything) to be desired. She frequently backtracks, corrects herself, and equivocates when answering questions, e.g. (in response to a student's question) \"Well, you're right if we're on the same page,\" which is a non-answer, or \"If you're confused just try the practice problems on this at home,\" which defeats the purpose of going to class. \nThe fact that the class seems to be split into students who have seen everything except graph theory before and students who have seen none of it means that, at least this semester, the latter were afraid to ask questions, which Dawn read as comfort with the material rather than confusion about the concepts (and/or the motivation for them). Disappointing, because I feel like the subject could be rewarding as taught by a teacher good at working with large audiences.\nAvoid Dawn's section of this class if you can.\nWorkload:\n2 midterms and a final. These bite if you're not careful.\n6 relatively easy problem sets.\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "November 17, 2014",
            "review_content": "\nShe is without a doubt the worst professor i've ever had at columbia. She was rude in person, would constantly screw up proofs in class, and would generally explain poorly. Everything I learned from this class, I learned from the (somewhat lacking) textbook. Avoid at all costs.\nWorkload:\nOptional textbook psets - 1 per week\nPop quizzes(?) (not in my section, but she said she had done it before)\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 26, 2014",
            "review_content": "\nI'm sorry but this class is just not on par with the equivalent classes offered by other top universities . While you learn basic (extremely basic) proofs, a bit of probability and counting, and some graph theory - you learn very little of all and you only learn it at a very practical level. Professor Strickland will stop to take every question and it's a large class so expect to spend a lot of time listening to things repeated over and over again. The homeworks are pretty easy and all done through CourseWorks so a textbook is not necessary unless you want to do the practice problems she recommends, which are only worth it if you don't have a decent math background because the homework and test questions can all be solved using the same techniques used on examples in class. If you're the kind of person who prefers to read the textbook - just buy it and don't go to class. The tests are pretty easy if you enjoy math and more than enough time is allotted. An honors class in the subject really should be offered but in the meantime, enjoy the easy A if math is your thing. And don't look at the homework given by many other schools or you may find yourself depressed it's way beyond what you were taught.\nWorkload:\nReally light\n~7 psets with 7-15 questions, many of which are multiple choice\n2 Midterms\n1 Final\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 25, 2013",
            "review_content": "\nDawn definitely does not deserve a silver nugget.\nYes, she is generous with grades and is very friendly, but she does not teach! Discrete Math is a very broad and deep field. We hardly did anything in this class. She spent a lot of time doing basic probability and counting, and not enough time on more advanced concepts. We just brushed over loads of cool graph algorithms and problems, without actually solving one in class or seeing in depth proofs.\nDawn's tests were of decent difficulty, but she did not expose us to problems of that difficulty before hand, which was frustrating. This class should have an honors sequence.\nWorkload:\n40% final. 60% midterms\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 25, 2013",
            "review_content": "\nPrevious comment said Dawn was a good teacher despite the classing being too easy, but I actually doubt if Dawn really taught well. She seemed to mess around with what she said in class: A frequented scene was she wrote on the board, stopped, and found out what she just wrote was wrong, and more wrong than a pen slip. I don't think this is expected of a good teacher. In fact, both the course textbook and a TA recitation session seemed to have better instruction than the class lectures.\n\nWorkload:\nHomework is not collected or graded, and you typically don't need to need do them (They have no value either in understanding the course material or in helping for the exams). If you don't understand anything, just read the book. Reviewing for midterms generally takes 1 hour, which makes me doubt if this is a 3-credit course.\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 25, 2013",
            "review_content": "\nFirstly, as the previous reviews have stated, Dawn Strickland is one of the nicest professors you can have. She is very friendly and approachable and will gladly answer any questions you have. However, I have several gripes with the course (not necessarily with Dawn herself).\nTo start, the textbook for the class is garbage (Discrete Mathematics and Its Applications by Kenneth Rosen). It's full of convoluted examples with little explanation for how the problems are solved. The information is conveyed in the most elaborate terms, and once the material gets difficult, it is extremely difficult to understand. I think the textbook really needs to be changed. Just check out the Amazon reviews for it: http://www.amazon.com/Discrete-Mathematics-Applications-Kenneth-Rosen/dp/0073383090\nSecondly, the optional homework comes straight from the book. I'm certain that almost nobody did it, because (1) it's optional, and (2) the book is no good. There are no quizzes in the class either, so your grade is entirely dependent upon the exams.\nHowever, Dawn's lectures are well-structured and pretty informative. You can learn most of the easier material just by going to lecture. However, once the material got harder, I couldn't understand much of what was going on in class. To study for the exams, I pretty much just Googled what I needed to know from the book and then took her practice exam.\nMy last gripe is this. I actually did well on the exams and got a good grade in the class- however, I cannot say that I know much of anything about Discrete Math. I really don't feel like I learned anything from the course. If you asked me what Discrete Math is and why it's important, I couldn't tell you. I studied in a way that allowed me to do well on the exams for some reason, but I'm still confused about much of the material and really was not satisfied with the course.\nAs a whole, I don't think it's hard to get a good grade in the class. It just wasn't a very pleasant experience, and I feel like the course needs a major overhaul.\nWorkload:\nOptional homework, no quizzes. 3 midterms (drop the lowest one) and a final.\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 23, 2013",
            "review_content": "\nIn this review, I'm going to be very careful to distinguish between the content of the course and the instructor.  \nI can't say enough good things about Dawn both as a person and an instructor.  She is an excellent instructor who definitely took her role of teaching this class very seriously and did a great job teaching it.  She was always very well-prepared for lectures, easy to follow, and enthusiastic.  She's also very approachable and will take the time to answer questions and help students who are having trouble.  In class, rather than just doing math on the board, she makes a point to write out (in words) the steps that she is doing when they are confusing, which makes note-taking a lot more valuable.\nThat being said, I strongly believe that the CS department needs to rethink content of the course.  What I'm about to say applies to any section of this course taught at Columbia.  It covers a wide range of topics, and therefore doesn't have much time to go into depth on any of them.  This alone is not a problem, but what is a problem is that the course is way too easy, almost laughably so, for anyone who has a decent background in math.  This really would be a good course to have an honors version and a regular version (with both countable towards the CS major and minor).  Regardless of who you are, you'll probably learn something in this class.  However, some people will learn a lot more than others, and the course attempts to appeal to students who have had a wide range of mathematical backgrounds.  As someone with a relatively strong background, some of the questions I heard in class were cringe-inducing and painful to hear.  \nA detailed day-by-day syllabus is provided for the course.  I definitely recommend going to the lectures for the material you're trying to learn rather than attempting to learn it out of the book.  The latter is possible, but it's probably harder and more time-consuming than trying to learn from the book because the book is not very good.   Homework from the book was assigned but not collected.\n\nWorkload:\nThe grading was based on three non-cumulative exams and a cumulative final, and was computed by the better of:\n30% Best Midterm, 30% Second Best Midterm, 40% Final\n25% Best Midterm, 25% Second Best Midterm, 50% Final\nEither way, the worst midterm was dropped.  The averages on the exams were as follows:\nMidterm 1: 80\nMidterm 2: 66\nMidterm 3: 68\nFinal Exam: 80\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 21, 2013",
            "review_content": "\nDo yourself a favor and take this class with Jonathan Gross to actually learn Discrete Math. He's not great, but he beats Dawn Strickland.\nDawn is probably the nicest professor in the whole of Columbia. She's like a pre-school teacher. This doesn't really help. She literally didn't teach us anything this semester. She teaches the very basics of theory and does some problems in class. She assigns problems from the textbook that are harder than what she teaches in class. Her exams have problems which are harder than the textbook. This is a recipe for disaster. I think math classes should be taught in such a way that students get loads of practice and are tested at a level equal to what they are prepared for, not more. We also missed 3 classes this semester, so we didn't cover a lot of material.\nIn the end, I didn't learn much from this class. I feel under prepared for CS Theory. I think Dawn should count the problem sets towards the final grade, and give us harder, more relevant homework, which will prepare us for the tests. The textbook goes into the subject in depth. You should read the more interesting proofs and theories from the text if you're interested in the subject.\nWorkload:\n60% from 2 highest midterms of 3\n40% final\nHW doesn't count towards your grade.\n"
        },
        {
            "course_name": "Intro to OR: Deterministic Models",
            "review_date": "January 15, 2013",
            "review_content": "\nDawn is really awesome.  There's really nothing not to like about her.  Some parts of the class were not incredibly exciting, but she was empathetic about this and admitted that some of the material wasn't the most exciting.  She was always well-prepared for lecture and seemed like she really enjoyed teaching the class.  She's also incredibly approachable and friendly, and makes asking questions during lecture very easy.  I am sorry to hear that people took advantage of this last spring in her Discrete Mathematics course, but that was not a problem this past semester.  \nThis class definitely teaches a lot of good material.  The material definitely compliments what is taught in COMS 3137 - \"Data Structures and Algorithms,\" though there is no programming component in this class.  Some of the algorithms exist in a few variants (simplex, one-phase simplex, two-phase simplex, upper-bounded simplex) and it's important to keep these varieties straight in your head.\nThe homework was mostly out of the book.  Some of the problems were a bit of a pain, and a lot of tedious work overwhelmed the concepts that we were learning.  However, most of this is just the nature of the material.  The book itself is not very good, and I don't think it was a good choice for the class.  It has a good number of typos and makes the material so much more complicated than it needs to be.  For that reason, it is important to attend every single class and take good notes, as the alternative of trying to figure out the material from the book is much more stressful and time-consuming.\nWorkload:\nAccording to the syllabus, the grade was calculated as follows:\n25% Homework Assignments - there were a total of 7 graded homework assignments over the course of the semester\n35% Midterm - open-book and open-notes, similar in format to the practice midterm, but generally covers the topics that are not covered on the practice midterm\n40% Final - same deal as the midterm, but all the problems came from the second half the course, despite us being told it was cumulative exam\n"
        },
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 17, 2012",
            "review_content": "\nThe good: Dawn is incredibly fair and straightforward. The material was a breeze. Her exams were only somewhat more challenging than the homework, and lined up with what we did in class.NO problem sets, but there are potentially quizzes every morning. This keeps you on top of your game, though, and the problems come directly from the homework.\nThe bad: She's unbelievalby accomodating to her students (which is great), but this means she answers every dumb question in class...questions that are often too dumb for office hours. This is incredibly frustrating and holds back the entire class.\nOverall, I'd strongly reccommend her, though. She's a wonderful person and made this class unbelievably easy.\nWorkload:\nNext to nothing. No p-sets. Suggested problems instead, which showed up on quizzes the following lecture. If you pay attention in class and glance over the suggested problems, they're no problem.\n"
        }
    ]
}