{
    "prof_info": [
        {
            "prof_name": "Alice Heicklen",
            "prof_id": 2525,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Developmental Biology",
            "review_date": "January 10, 2017",
            "review_content": "\nPre-requisites: The class assumes an understanding of fundamental biology concepts so its best to have taken Intro Bio. That being said, it is not necessary to review any old material before hand. \nCourse Overview: The course is an overview of the circle of life. It begin with an overview of development: Fate Determination, Stem Cells, Imprinting, and Artificial Programming/Reprograming. It then moves on to discuss the Development of gametes, fertilization, gastrulation, sex determination, and development of key organs such as the heart. Throughout the course, their will be 5 article discussions that relate to the material at hand.\nClass (Professor Heicklen): Professor Heicklen's uses powerpoint slides to present the material with cool video illustrations when appropriate. Unlike other professors which sometimes cram to cover all the material on the slides for a given lecture, Prof. H. goes at a reasonable pace and any material not covered is carried over to the following lecture. She really enjoys interactive lectures and will frequently pose questions, make tables on the board and ask the class to help her fill it out, and also draws diagrams on the board that correspond with a handout so you can fill in the blanks as she draws them. Overall I found her lectures to be effective at presenting the material and her passion for the material keeps you engaged. Furthermore, while at times I found myself getting behind in the material due to other classes, this class was fairly easy to catch up on later on (assuming you attend lectures). I would recommend her to receive a silver nugget on culpa.  \nreview_contente review_content Sessions: As mentioned before, their are 5 articles with associated HW questions and discussions. While the in class group discussions weren't to hard (and because the majority of the grade is participating), it never felt like to much work. The article HW questions sometimes were confusing, however, I found that attending the article review sessions were very helpful in clarifying any questions, getting hints, and being prepared for the class discussion so I recommend people attend them. \nStudy Problems: The non-graded problem sets were very helpful in determining how the material may be tested and helped to elucidate important key points from lectures. Many people either added points to their pre-existing reviews using material from the problem sets or annotated the problem set answer key. Either way, it is very important to have worked through (or at least look through) the problem sets as they are reminiscent of exam questions.\nOverall Recommendation: Definitely take this class to fulfill any Bio/Biochem requirement or for fun if you have an interest in the subject matter. You learn a lot, Professor Heicklen is fun, clear, and fair, and the workload is very reasonable.\n\nWorkload:\n2 Exams (Non-Cumulative) \n1 Final (Non-Cumulative) \n5 Articles with a ~1-2hr long HW question assignment and in class discussion\nFun Extra Credit Opportunities like making an Origami embryo \n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "December 27, 2014",
            "review_content": "\nMy experience going into this course was that there was a lot of moaning and griping beforehand from friends who had already taken the course about how the lectures were really tricky to follow because of Prof. Heiklen's teaching style. I mention this because I feel like the course gets a lot of bad press on the word-of-mouth front but it's ultimately not that awful- in fact, it's probably well worth your taking if you plan on becoming a healthcare professional. Though it's probably not stuff that you will ever actively apply unless you become a researcher or an OBGYN, she keeps the course pretty relevant and lets you walk away with a good understanding of important scientific breakthroughs in what people commonly think of as \"stem cell research\" that will probably have significant therapeutic potential in next few decades.\nLectures consist of her explaining mostly unmarked slides: you should print them out beforehand to make notes on them: I realized after a couple of classes that you waste too much time trying to make diagrams in your notebook because the speed of her lecture is not slow enough for you to be wasting time redrawing slide images. As previous reviewers mentioned, Prof. Heicklen will also assume mastery of some basic bio stuff covered in the Mowsh lectures, so if you don't remember the premise of a lecture and you fail to ask her to do a quick review, the entire lecture will go over your head. This is mostly fine, because Prof. Heicklen generously makes recordings of all her lectures- they are very helpful for studying, and any questions that you still have after listening to her lectures can be clarified by her in office hours. She makes herself super available to students and is generally very friendly and enthusiastic about the subject, which is always great.\nThe exam questions are kind of hit and miss- the general consensus is that the substantive stuff she asks is not that hard: the difficult part is understanding what exactly she is asking in the first place, because she tends to phrase her questions in a way that won't make any sense unless you get used to her very specific lingo for describing dev bio concepts. You can have a very good understanding of the material, but still get a question wrong because you didn't understand the way she wants you to answer a question based on her phrasing. Luckily, she will also provide 4-5 years worth of previous exams, and those usually will help you better understand the types of concepts she's interested in testing, as well as how she phrases the questions. Also, she will hold review sessions herself before each exam. Go to these after you've studied. They will clarify A LOT of stuff for you.\nCompared to other upper level bio courses at Columbia, the tricky part about studying for dev bio is not the difficulty or the amount of material. Those are both reasonable. The annoying part is going back to the lectures and trying to figure out what exactly she was trying to teach you. I say this without irony: there were a couple of lectures where the students left and half the class did not understand what was going on during lecture at all. Still, everyone seems to figure it out before the exams because between the recordings and the textbook and office hours, the resources are all there for you to get a good grasp of the material.\nPart of your grade is based on one-page response questions based on recent papers, as well as in class clicker questions. The material on these papers will appear on exams. She helps you with those as well: 1 or 2 lectures before the actual article discussion days, she will give an introduction to the paper in class. During these introductions, she will usually talk about what she considers important (ie. testable) in the paper. Those explanations will usually explicitly answer 2 or 3 of the response questions, so it's important to pay attention when she's doing those intros.\nFinally, the great thing about this class is that there is a ridiculous cushion for an A range grade. There was no curve for the A- cutoff: you only had to manage an 80% overall to get a guaranteed A-.\nOverall, this class was not bad at all. Prof. Heicklen lectures fast and sometimes convolutedly, but she's a dedicated teacher and incredibly knowledgeable. If you just put in the work, you'll be fine.\nWorkload:\n2 midterms (20% each)- if one grade is higher than the other, it will be weighted 30% and the lower grade will be weighted 10%. This is an amazing gift.\nThe Final is worth 40%\nPaper response and clicker questions 20%\nAND THE CRAZY 80% CUTOFF. The final median overall score of the class was just below the cutoff by maybe 3 points, so basically half the class got at least an A-. Ridiculous.\nI performed mediocrely through the entire semester, and got an A. My final score was a little under 90%.\nAnd yes. The egg is a wonderful bag of tricks. That is, as previous reviewers note, pretty much the one thing that everyone from this course will take away.\n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "December 29, 2013",
            "review_content": "\nFor the most part I would recommend taking Developmental Biology with Dr. Heicklen. I do not disagree with other reviewers on here who say that Heicklen moves through her lectures really fast and that the lectures go all over the place, but I believe that the value of the course material and Heicklen's genuine passion for dev bio offset her lack of skill in lecturing. I honestly don't think Heicklen's lecturing skills are all that bad, but this is coming from a guy who took this course after taking Organic Chemistry with Dalibor Sames, Jesus was that an awful experience (see the man's culpa reviews if you don't believe me). Heicklen is very receptive of questions from her students, if you're not sure about something that was mentioned you can always raise your hand and she'll do her best to clarify whatever uncertainty you may have. Most of the time she will fill in whatever you're missing; occasionally you'll end up even more confused, but this is true for a lot of professors. \nUnlike other upper level bio courses Heicklen spends much less time reviewing content taught in the intro course with Mowshowitz, therefore you spend more time learning dev bio; this shouldn't be much of a surprise as Mowshowitz's office is only like 10 feet away from Heicklen's so the two undoubtedly discuss course material with each other. Her lectures consist of mainly powerpoint slides with occasional writing on the chalk board. From time to time Heicklen will read recent news articles that relate to the course during class. The reading of research articles is incorporated into the course as well and a lot of the material taught in Heicklen's lectures are drawn from research articles. This is great because it gives you an idea of how the course material relates to current advances and discoveries in science. The downside is that the articles she assigns can sometimes be very difficult to read. The exams are not too bad, as long as you review the answer key to the problem sets you'll come to understand Heicklen's style of questions and you'll end up doing fine. Plus the grading is pretty fair, the median is a B+. Heicklen also likes to reference the show \"Friends\" a lot to explain concepts so if you like that show you'll pick up on Heicklen faster than your fellow classmates. \nIf you're thinking about taking this course I would suggest registering for it and giving it a shot, you can always drop it if you're not feeling it. Developmental biology really is a fascinating field and a lot of the stuff you'll end up learning in this course are at the forefront of discovery and innovation in biology. \nWorkload:\nHonestly, not too bad. Three problem sets, one before each midterm and one before the final. There are also 5 research articles you have to read and answer questions to that are submitted during article discussion days. You have to really read the articles because Heicklen quizzes you with clicker questions during article discussions and the questions are sort of difficult. Material from the articles also show up on her exams. The articles are probably the most difficult part of the course. Heicklen doesn't follow the textbook very closely but her assigned readings may be helpful to some who like to get an overall picture of things.\n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "November 08, 2012",
            "review_content": "\nI am surprised that no one on CULPA has commented on Dr. Heicklen's teaching style in detail. \nDr. Heicklen is a teacher with an amazing passion for the subject that she teaches. However, it is equally amazing how poorly-developed her teaching skills are. Do you remember that mess-of-a-second-lecture on sex determination that she gave in intro biology last year? Well, you get a whole semester of that in developmental biology. Doesn't that sound fun? \nMan, not only does she have a tendency to spew half-digested nonsense from her mouth, she also talks fast. \nJust about every lecture this semester has been a wild goose chase to figure what the heck Heicklen just said for the past 75 minutes. When she gets overexcited in her lectures, she speeds into utter incoherency. It happens all the time. This problem is exacerbated by the fact that she doesn't follow the textbook too closely. And thus it is hard to read up on what she was \"trying\" to say. What a mess. I love Dr. Heicklen's passion for the subject. But it literally derails this lady. She gets caught up in her excitement, and it all goes downhill. \nDon't get me wrong. Developmental biology is a fascinating subject and you will learn a lot from this class. I would recommend this class for the value of the content that you will learn. Heicklen draws much of her lecture material from the newest research in developmental biology. The reading of recent journal articles is a critical component of the class, and I really appreciate that too. \nBut Heicklen's mess of a teaching style has made it an excruciating experience. And her tests, heavy on the regurgitation of incoherently worded concepts and light on the thinking... you either know it or you don't. I, like many people, do not speak Heicklen and find quite a few of her test problems nonsensical, much like her lectures. I actually kind of miss Dr. Mowshowitz. I do agree with Heicklen, however, that the egg is a sack of \"goodies\" and \"tricks.\" That one has been drilled into my mind permanently. \nEveryone in Dr. Heicklen's class will come to believe that: (in Heicklenese) \"with its many, many tricks, the egg is a sack of goodies.\"\nWorkload:\nHeavy\n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "December 20, 2011",
            "review_content": "\nOverall, I enjoyed Dev Bio with Dr. Heicklen.  She is very passionate about the subject matter and wants to share her excitement with her students.  This class, however, is not all fun and games.\nFirst off, going to class is a necesity- the only notes you get are in class (there are blank powerpoints on courseworks that make no sense if you don't go.  It is also necessary to pay attention for the whole class, since Dr. Heicklen goes really fast, can be super confusing, and there are only review sessions right before the exams.\nThe exams were tough- you either know the material or you don't, and literally anything from class can be tested, including questions about the articles that we read for class.  Study hard, and go to the TA review sessions, which are crucial to doingreview_content  review_content your notes, and do the practice problems well in advance- you learn the material through the problems (similar to Mowsh bio) and if there is something tripping you up, you should have plenty of time to ask questions.\nTo expand on the articles, there are 8 in a semester, usually about 10 pages total. You have to answer some questions to turn in before class, and then you do clicker questions in class as discussion.  The challenge is that the questions for the hand in are tough, and you cannot ask a TA or Dr. H herself about them.  You must read, re-read, and read the articles again, and then answer the questions.  I recommend working in a group for these after you've tried them yourself.\nOverall, I enjoyed the class because I found the material interesting.  Just be prepared to put in the time.\nWorkload:\n8 articles with questions and in class questions, 2  midterms, 1 \"cumulative\" final (emphasis on the last 1/3 of the material)\n"
        },
        {
            "course_name": "Lab in Cell and Developmental Biology",
            "review_date": "June 01, 2008",
            "review_content": "\nThe first three weeks or so of the course gives you background on molecular and cellular laboratory techniques, and the remainder of the semester is used for the independent project.  It's a great opportunity to do original research.\nThe course takes up a lot of time (being 5 credits), but it is worth it.  Dr. Heicklen expects you to come into the lab outside of the scheduled time to complete experiments, but you have a lot of flexibility during the scheduled lab period. In general, the class will meet together once a week to discuss a research article for one or two hours at the beginning of the lab period, with rest of the time free to complete experiments.\nAs long as you have a good amount of time to dedicate to this class, you will be fine.  Dr. Heicklen is a great professor, and you will learn a lot from her in this class.\nWorkload:\nmoderate. Five one-page research article summaries, practical midterm, 10-page final paper and occasional homework assignments.\n"
        },
        {
            "course_name": "Project Laboratory in Developmental Biology",
            "review_date": "May 26, 2008",
            "review_content": "\nThe class moves at a fast pace early on, but it is definitely manageable.  You won't spend much time reading or studying but rather you will be doing stuff in the lab.  The labs are time-consuming, and depending on your skill level and prior lab experience, you may or may not have to spend extra time in there.\nDr. H is a great teacher, and while she may initially seem intimidating, she is very friendly and approachable.  She is also very good at explaining and clarifying things.\nThis class primarily teaches you advanced laboratory techniques and provides you with an opportunity to take part in original research.  As such you won't have much new material to learn, but will often have to recall and apply knowledge from earlier biology courses (not nearly as bad as it sounds).\nThis is a very good course.  This biggest issue is the time-commitment, and that is only early in the semester. As I became more familiar with what I was doing, I found myself spending less and less time in the lab. \nFinally, if the other people in your class are friendly (like mine were) you will have a great time.\nWorkload:\nA handful of short and easy assignments. 1 midterm, a practical in which you use the lab techniques you learned earlier in the semester.  You will have to read several research articles and turn in half-page summaries of them (seems difficult but gets easier).  Finally, your research article.  Considering you have roughly half the semester to do it you shouldn't have too much trouble.\n"
        },
        {
            "course_name": "Project Laboratory in Developmental Biology",
            "review_date": "May 26, 2008",
            "review_content": "\nThe class moves at a fast pace early on, but it is definitely manageable.  You won't spend much time reading or studying but rather you will be doing stuff in the lab.  The labs are time-consuming, and depending on your skill level and prior lab experience, you may or may not have to spend extra time in there.\nDr. H is a great teacher, and while she may initially seem intimidating, she is very friendly and approachable.  She is also very good at explaining and clarifying things.\nThis class primarily teaches you advanced laboratory techniques and provides you with an opportunity to take part in original research.  As such you won't have much new material to learn, but will often have to recall and apply knowledge from earlier biology courses (not nearly as bad as it sounds).\nThis is a very good course.  This biggest issue is the time-commitment, and that is only early in the semester. As I became more familiar with what I was doing, I found myself spending less and less time in the lab. \nFinally, if the other people in your class are friendly (like mine were) you will have a great time.\nWorkload:\nA handful of short and easy assignments. 1 midterm, a practical in which you use the lab techniques you learned earlier in the semester.  You will have to read several research articles and turn in half-page summaries of them (seems difficult but gets easier).  Finally, your research article.  Considering you have roughly half the semester to do it you shouldn't have too much trouble.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "December 10, 2007",
            "review_content": "\nWow, it looks like the same person has been reviewing Professor Heicklen at 10 day intervals.  Just kidding.\nI did like her two lectures on development in the Mowshowitz, which made issues like somatic nuclear transfer (Dolly!) and the histone modification code very accessible.  Some people complain about the way she phrases things, but, on the whole, I found her to be very understandable.\nHowever, she does cover several transcription factors and their binding to DNA in the course of development.  She says that we should not bother to know what they do.  I do wish that, at least for FYI purposes, she had explained what each family of transcription factors does.  They keep coming up in the news, and I wish I knew what it is they do.\nWorkload:\nGo to her two lectures.\n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "June 28, 2007",
            "review_content": "\nThe course has been very enjoyable. The material covers a broad range of developmental biology. Everyone will definitely find something interesting, whether it be fetal development, organogenesis, sex determination, cell division. The seminars are well-organized such that every student gets to participate and share ideas, thus making the class very lively and friendly.  Prof. Alfred's dedication to her students is also unforgettable. The lecture slides and handouts, which are available for downloads, are clear and informative making the lectures easy to follow. She is also very accessible for students requiring extra help with the materials. I highly recommend this class to anyone in the biology department. \nWorkload:\nThe workload is moderate. There are only three exams in total. For each seminar (6 in total), students only have to read 1-2 paper and answer a few short-ans questions (short summary required for graduate students). \n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "June 18, 2007",
            "review_content": "\nIf you like lectures that are packed with good material in a comprehensible format, this class is good for you. Professor Heicklen puts an enormous amount of work into her lectures and it shows. She is clearly fascinated and passionate by developmental biology and this enthusiasm is translated in her teaching.\nThus, the course is not easy - you have to keep up with the reading and class attendance , and you will not be able to \"fake it\" on the exams - but Heicklen is clearly on the students side and tries to make it as easy as possible for the students to access and absorb the material. One example - all of the lectures are posted on courseworks before class - these provide invaluable material for tests and study guides. \nProf. Heicklen also makes it clear that Developmental Biology is constantly changing field of research - and she introduces the class to some of the newer directions it is taking through journal articles that form an integral part of the course. \nOverall, I highly recommend this course. Professor Heicklen renders a potentially mind-numbing subject into lively and intriguing topic that makes for a fascinating semester.\nWorkload:\nYou cannot do well in this course without mastering the material - and that means that you cannot skip lectures and you have to stay up with readings - but if you do this, you will do fine on the exams. Professor Heicklen is very fair and reasonable in assigning work and grading, and is responsive to feedback from students.\nI had 4 to 7 hours of studying a week for this course, but this will depend on your study style and your previous experience with Biology.  \n"
        },
        {
            "course_name": "Developmental Biology",
            "review_date": "November 20, 2005",
            "review_content": "\nThe worst experience at columbia!!!The course load was way too much for a 3-point class. Too many research articles for the class to read. She barely makes her lectures understandable, but the book was really great with hard core materials. The total number of students gets lower and lower as you approach closer to the drop date. She is nice, but makes the class very difficult. If you want to work really hard on top of your other classes then take it. You have to devote a great amount of time on it.\nWorkload:\n2 mid-terms, final, 1 oral presentation on a research paper which is not bad but you must know everything about it. The final is awefull because you have to read more than 20 research articles and most of them are really hard and long. For every oral presentation all students are required to know the papers and ask questions about it; these are all part of the grade.\n"
        },
        {
            "course_name": "Project Laboratory in Developmental Biology",
            "review_date": "May 10, 2005",
            "review_content": "\nIf you are looking for a class that is not going to kill you don't take this one.  The work load is excessive and a bit ludicrous.  The professor's expectations are very high. She expects you to go in at all hours of the day and spend copious amounts of time running the lab experiments.  These hours are on top of the required 8 which you must already dedicate to the class.  It is also completely disorganized and frequently the Professor will not give you all the information you needed to run experiments correctly.  Furthermore, she treats the class as a lecture and lab class spending at least 2 hours per class peroid lecturing -- this makes completely assignments on time very difficult.  Expect to spend a LOT of time in the lab trying to complete your assignments.    Also expect to be frustrated with the total lack of direction that the professors provides.  While I don't think she was a good/effective teacher I do think that she genuinely cares about the students and wants to teach them the material she's just not able to do so at the moment...maybe with a few more years under her belt that will change.\nWorkload:\nheavy --  required 8 hours/week.  Once the independent project starts, anywhere from 5-20 hours/week outside of the normal class hours.  4-5 papers (varying length all under 7 pages),  half a dozen article summaries, 1 oral presentation, final paper for the independent project (~10pages), and surprise (not anymore) quizes -- which may be changed into exams (according to the professor).\n"
        }
    ]
}