{
    "prof_info": [
        {
            "prof_name": "Jonathan Gill",
            "prof_id": 529,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 17, 2006",
            "review_content": "\nThis review is a little late.  I took Lit Hum w/Jonathan in Spring 2004.  He is easily the best professor I've had at Columbia outside of my major (architecture).  Jonathan is probably one of the smartest people I know, and yet somehow respects his students' opinions to the highest possible level.  He is also blatantly honest, giving me a \"C+\" for an essay that was only mediocre when he knew I could write a much better one.  On that same note, because I was capable, and dedicated to the class, I finished with an \"A\" for the semester.  Jonathan also gives wonderful life advice, so if you need \"a talk,\" he's there.  I would recommend him to anyone and everyone.\nWorkload:\nOne essay, one final, and the usual lit hum readings + 1001 arabian nights.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 12, 2004",
            "review_content": "\nJonathan makes a great first impression on the class -- he's SO full of energy, connects well with young people, and is a Columbia graduate himself.  He has taught this course before, and takes total control, dropping some works, and adding others.  He (re-)reads the books along with the class, each time he teaches.  He makes it easy to care about lit-hum, often drawing lessons from the books and applying them to real life.  He frequently discusses personal matters: his wife, his young children, his parents, and he how the themes of literature surface within his life (i.e. jealousy between his kids, telling the truth to his wife etc.).  He makes lit-hum a very human subject (in fact, it bordered on a psychology course).\nI do have a few complaints about Jonathan as a professor -- there is a predetermined 'correct' answer to every question he asks, and he'll waste no time shooting you down if you're incorrect.  Because of this, he can be intimidating, especially to the more shy members of the class.  He plays favorites too.  He also can get ridiculously off-topic (often talking about music or old movies).\nIf you get Jonathan as your professor, consider yourself lucky Â– youÂ’ll have no problem staying awake, and youÂ’ll gain a good understanding of each work.\nWorkload:\nIn general, heÂ’s lenient Â– he understands that we have a lot of other work to do and works with the students.  The essay he assigned was hard, and required research (the expectations for the paper were very different from in-class).  His grading on the essays was very harsh, although the overall grades werenÂ’t terrible.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 09, 2004",
            "review_content": "\nIf you get Jonathan, stay in his class!  HeÂ´s incredibly intelligent and incredibly fun.  Shy people can get intimidated at first, but after about a week the class is a blast.  HeÂ´s not afraid to tell you when youÂ´re wrong but heÂ´ll also admit when heÂ´s wrong.  You may end up learning more about life than lit hum but in the end, itÂ´s really the same thing.  \nWorkload:\n1 essay and a final \n"
        },
        {
            "course_name": "American Literature 1870 - 1940",
            "review_date": "May 21, 2004",
            "review_content": "\nGill is a lot of fun and relishes interacting with his students.  He intentionally chooses books you might not otherwise read (\"Puddenhead Wilson\" by Mark Twain?!) and will show movies in class.  He really seems to care about students thinking and not just passively reciting facts and conventional theories.  Also, he wore this Indiana Jones-style hat to class every day which made the course that much cooler.\nWorkload:\nA lot of reading, with bulky tomes such as \"American Tragedy\" and \"Call it Sleep\" being read over the course of 1-2 weeks each, but there are no tests, only 1-page response papers that probably don't necessitate actually completing the books.  As long as you have something insightful to say, both in your papers and in class, you're golden.\n"
        },
        {
            "course_name": "American Literature 1870 - 1940",
            "review_date": "May 09, 2004",
            "review_content": "\nHe is an excellent professor: knowledgeable, well read.  He has a broad base of knowledge and is great at making multiple connections.  He has a prediliction for the underrepresented in literature (African-Amercan, Immigrant, Jewish....), but doesn't beat this over your head at the expense of the larger value of a work.  Seeks active participation and loves encouraging discussion in the classroom. He likes showing classic movies based on the books you are reading and comparing and contrasting with books.  He does this with purpose and style giving merit to the films as well as the books.\nI took this class as a pre-requisite, and it has ended up being one of my favorite classes.  \nWorkload:\nNot bad at all.  One page critcal commentary per book you read.  He loves insightful thinking. \n"
        },
        {
            "course_name": "World Lit",
            "review_date": "April 09, 2002",
            "review_content": "\nTeaches GS lit classes. Great teacher, great guy, lots of fun. Be an active participant in class and show that you've put thought into your papers and you'll do well. Gill wants you to be excited about learning, that's all. If he likes you, he'll be your strongest ally throughout your time at General Studies.\n"
        },
        {
            "course_name": "World Lit",
            "review_date": "April 09, 2002",
            "review_content": "\nTeaches GS lit classes. Great teacher, great guy, lots of fun. Be an active participant in class and show that you've put thought into your papers and you'll do well. Gill wants you to be excited about learning, that's all. If he likes you, he'll be your strongest ally throughout your time at General Studies.\n"
        }
    ]
}