{
    "prof_info": [
        {
            "prof_name": "Jeffrey Saletnik",
            "prof_id": 9684,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 21, 2009",
            "review_content": "\nJeffrey was a great professor for Art Hum.  He was simultaneously challenging but quite fair, and he made sure that the class kept a good pace, which was both comfortable and well thought through.  He is a good lecturer, uses discussion fairly, and his powerpoints that feature all of the the artwork that you'll need to know for the course are put together in a fashion that makes them interesting as well as continuously force you to tie key themes of the course together.  Jeffrey is quite personable too and very accessible during office hours, and he seems to cut down on the busy work that can seem to plague other sections of Art Hum.  This professor is crazy smart and lacks the pretension that a professor of his caliber has the tendency to pick up over time.  Hopefully, Jeffrey sticks around to teach a few more sessions of Art Hum, as he comes highly recommended.  Also, be sure to check out some of his books and articles, as he is a big deal when it comes to media theory and the Bauhaus.\nThe trip to the MET was quite an enjoyable experience, as Jeffrey was both engaging and willing to let students discuss what they saw and thought.\nWorkload:\nQuite reasonable.  4 brief responses. Two standard 5-7 page papers, and a midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 03, 2009",
            "review_content": "\nSaletnik was a bit serious at the beginning of the semester, but as time wore on he loosened up. I've decided that he's a chill person, a fair grader, and passionate about art history. He knows the subject thoroughly and he knows how to communicate it, a rare combination. His powerpoint presentations are thoughtfully put together and make clear the point he is trying to make each class. He is not the most engaging lecturer in the world, but he demands just enough class participation to keep people interested. \nBottom line: You could definitely do  A LOT worse than Prof. Saletnik. Stick with him and you might even learn something. \nWorkload:\nstandard art hum. 2 papers, 4 1-pg responses, midterm, final, light reading. \n"
        }
    ]
}