{
    "prof_info": [
        {
            "prof_name": "Bashir Abu-Manneh",
            "prof_id": 2357,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Global Literature in English",
            "review_date": "March 30, 2012",
            "review_content": "\nProfessor Abu-Manneh is one of the best professors I've taken a class with. He is really knowledgeable about the subjects he teaches, and he is also incredibly kind. I encourage his students to go to his office hours, because he will take the time to listen to you, and will offer constructive criticism and positive re-enforcement. Although its been some time since I've taken his class, he remains one of the most influential professors in my college career who has really guided me to do the best work I've done for a class and instilled in me the confidence to excel in all others. \nHe's not a hard grader at all. But he does get upset when students clearly haven't done the reading and no one in class is participating. \nWorkload:\nA book a week with weekly posts. \n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "November 12, 2011",
            "review_content": "\nI picked his section of Critical Writing completely randomly, and I'm so glad I did. Prof Abu-Manneh is incredibly intelligent, if not altogether wise--he goes on rants about everything from campus problems to middle eastern political conflicts, in a way that is both sensitive and insightful, and hilarious to boot. Despite being a thursday morning class, it was a joy to listen to him go on (sometimes for over an hour), and I left every lecture feeling inspired. \nThat said, this is a very unconventional lit class. There is a minimum of actual 'critical writing', and you read no works of literature directly. Instead he structures each class around one major school of literary theory, with two students presenting readings on it that are largely summaries of the greats (everything from Barthes to Saiid). The class is completely discussion based and sometimes falls flat if your classmates aren't into it (the material is very dense), but he's always willing to slow down and explain tricky points, and is super flexible about the syllabus. He's also very accessible outside of class if you're struggling, and as a previous reviewer said, its totally worth it to drop by just to get to know him--when I was freaking out about the final paper, he basically just told me to chill and it would work out, and it did!\nIf you do the majority of readings you will have a pretty solid background in critical thought by the end of this class, and if you rise to the occasion he definitely will too. He's a fair grader, and you can definitely get by slacking off on the readings if you have to; he will never call on unwilling students, and if the class dynamic that day isn't working, he will talk about something unrelated instead, and just cancel whatever classes/subjects he has to. \nAll in all, this was a great section for critical writing!!\nWorkload:\nNot bad at all, the readings are heavy but all recapped in class so you don't have to finish them, and some of them can be redundant. Originally three 5 page essays which he made into one 5 page and one 10 page final essay, no tests, and weekly discussion posts on courseworks (2 paragraphs) to show you read something. \n"
        },
        {
            "course_name": "Cultures of Colonialism - Palestine/Israel",
            "review_date": "May 11, 2011",
            "review_content": "\nI'm not sure I'd recommend this class. The course is nothing like what I expected, and it was extremely one-sided and biased. Granted, there were probably students who were expecting that, but from what the course description said, I think we as students should have been better warned.  The literature we read was incredible, but to get to the literature, you had to read long and tedious history books (that got really repetitive really fast). Class discussions (when we had them) were great, but lectures tended to be long and frustrating (Professor Abu-Manneh also has a strange fascination with the phrase \"as it were\"). All in all, I'm glad I took the course for the perspective it gave me, but unless you're willing to put up with a bunch of dull history and lectures for some amazing literature and class discussion, don't take the class. \nWorkload:\nA book a week (and some of these books were REALLY long), a weekly post on the book, midterm and final. If you keep up with the readings, it's not too bad. \n"
        },
        {
            "course_name": "Cultures of Colonialism - Palestine/Israel",
            "review_date": "February 08, 2009",
            "review_content": "\nBashir is undoubtedly one of the best professors at Barnard, and probably the most thought-provoking.  He's very passionate and knowledgeable about the subject matter.  If you really want an in depth understanding of the matter, no class in the MEALAC department holds a candle to this one.  The readings were extremely interesting and informative, and Bashir is a genuinely nice, approachable guy.  He'll always take the time to thoroughly address your questions and concerns.  I HIGHLY recommend this class!\nWorkload:\nAbout a novel per week.  Three papers.\n"
        },
        {
            "course_name": "Global Literature in English",
            "review_date": "August 31, 2007",
            "review_content": "\nThe syllabus for this class was amazing-- I read almost every book and it was so worth it. As for Bashir-- at first I thought he was overrated-- but as the semester went by--he won me over. He tends to go on a bit about Marxism, as he is a Marxist scholar, a bit much but for a lecture--this class was great-- Bashir is hilarious, intelligent, and definitely worth getting to know outside of class and if you can, try taking a seminar with him. He is very laid back, down to earth, and genuinely nice.\nWorkload:\nNot much. A novel per week and worth reading. Weekly discussion posts. Two papers: One 5-7 pages and another longer 10-12 pg paper. \n"
        },
        {
            "course_name": "Global Literature in English",
            "review_date": "April 14, 2007",
            "review_content": "\nThis class is great! For anyone who appreciates an English class that delves into cultural context and wants to get into real political and social issues, this is definitely worth taking. Bashir is hilarious and always engaging. The discussions, though intellectual and complicated, never fail to amuse. Note that the reading list, despite being considered \"global\", tends to focus on Arab/African novels.\nWorkload:\nA book a week and a weekly posting. Midterm is 5-7 page paper, final is 10-12 page paper.\n"
        },
        {
            "course_name": "Cultures of Colonialism - Palestine/Israel",
            "review_date": "November 21, 2005",
            "review_content": "\nBashir is amazing.  End of story.  This class definitely had the potential to turn into 9am hell filled with lots of petty arguments.  Yet, this was almost never the case.  Instead, Bashir kept everyone awake and facilitated excellent discussion, despite the early hour.  The class is divided into two parts: the first part is mostly historical background with really interesting readings from political scientists, anthropologists, and historians.  After this, the class is then dedicated to literature and the occassional film.  The syllabus was really excellent, alternated between Israeli and Palestinian authors (both from Israeli and in the diaspora).  I loved this class so much that I was inspired to take a grad seminar on Israeli literature with Uri Cohen this semester which, sadly, doesn't hold a candle to Bashir's class.\nWorkload:\nA book, some short stories, or a series of articles each week, plus criticism.  Plus a weekly courseworks response.  Two papers.  I you put in some effort, stop by his office hours every once in a while, and show some general interest, you'll do fine.\n"
        },
        {
            "course_name": "Culture and Politics of Globalization",
            "review_date": "May 30, 2005",
            "review_content": "\nIf I were to teach this course, I would have had us read the \"No Nonsense Guide to Globalization\" as a primer, and then looked at perhaps a couple chapters of a couple of the books Bashir selected in depth.  His book choices (generally) were quite good, but the amount of reading he assigned was completely unreasonable (expensive if you bought it, and troublesome if you didn't), and personally I found myself unable to glean more than the general thesis of each author when there was much good information to be found.  Usually these overarching statements propped up Bashir's linear progression of US global domination.  As another reviewer noted, there is a lot of economics in this class, which, having never taken an economics class before, I found complicated.  When I asked economic questions, both in class and via e-mail, Bashir was not particularly helpful in delineating answers.  To his credit, in class sometimes I wasn't very clear on what I did not understand, but, rather than draw out the information, he generally got frustrated and ignored me.  When we had to meet with him to write a paper he was always very thoughtful and considerate, but when I came to office hours on other occassions I felt like I had to talk quickly or waste his time.  How much of this was my own internalized embarresment, I do not know, but I do know he did not make me feel welcome.  This seems to go against Bashir's flexible and laid back persona, but he manages to encapsulate both in certain moments.  Usually when I asked him questions outside of class in person or via e-mail, he did not answer them (\"bring it up in class\" or no e-mail reply).  In short, I did not learn as much as I had hoped because rather than give up a fair amount of time to truly do the reading, we were always tripping over ourselves to catch up, and, except for the overachieving few, the class had very little to contribute as a result.\nWorkload:\nMany many books, generally in their entirety.  We would have been better off going deeper into certain sections than \"spanning the globe\" but only tickling our toes in the sea.\n"
        },
        {
            "course_name": "Cultures of Colonialism - Palestine/Israel",
            "review_date": "May 27, 2005",
            "review_content": "\nI think Bashir is fantastic! I was surprised the mediocre reviews since most of the people in my class seemed to really love Bashir. His lecture style is laidback yet he's incredibly passionate about the novels he teaches. As an individual, Bashir is very approachable and willing to comment on rough drafts; he also insists you address him by his first name (heÂ’s young for a professor!). ItÂ’s true class conversations were sometimes stagnant but this, I can authoritatively say, was due to the insanely early start time (9am) rather than Bashir's facilitating. In fact, Bashir ingeniously catalyzed thought-provoking discussions despite the ungodly hour at which the class convened.  And, on the rare occasion when nobody speaks, youÂ’ll completely enjoy listening to Bashir lectureÂ—partly due to his endearing English accent and partly due to his manifold brilliant ideas.  ItÂ’s a predominantly Barnard course, which means there are a bunch of girls who spend the entire hour just staring at Bashir who, from my understanding, is gaining the reputation as quite a heartthrob (this is important to note because it is true that you may have trouble concentrating). \nYes, Bashir assigns copious amounts of reading but, honestly, you don't have to do much beyond reading a few of the novels (although I'm glad I read almost all of them since they're rather interesting). I havenÂ’t taken any other Barnard English courses but the workload seemed only a little heavier than the ones IÂ’ve taken in the College.  \nWhile the course could have degenerated into a political diatribe, I think Bashir did an excellent job keeping us focused on the literature surveyed as well as documentaries screened and actively engaging everyone who wished to speak.  While the papers are very open ended, they are far from frustrating considering Bashir is amendable to any topic that sparks your interest. I had to laugh when I read the review claiming Bashir is a Â“real ball-busterÂ” because he's actually a very fair grader (the grade I received was identical to the ones IÂ’ve received for Comparative Literature courses at the College). I think Bashir is absolutely superb and would unequivocally recommend his course to anyone interested in comparative literature; IÂ’m pretty sure heÂ’ll become a great Columbia legend one day.\nWorkload:\nA book, secondary readings and CourseWork postings every week. Midterm is a 6-10pg paper and the final is a 10-15 page paper. Go to class more than half the time, read a book or two and consult with him on at least your first paper to make sure you're on the right track. No worries, you'll do well.\n"
        },
        {
            "course_name": "Culture and Politics of Globalization",
            "review_date": "May 13, 2005",
            "review_content": "\nThis course was kind of a waste.  Bashir is a really nice and funny guy, but I'd say it safe to say that most people who took this class felt they learned very little.  We had to buy a ton of really expensive books, which no one really read because he assigned WAY too much reading for every class, and each class was spent talking about our own personal opinions on globalization.  There was a large concentration on the economics side of globalization too, so it's not a typical English class at all.  Come time for the papers, the topics were incredibly broad and most of us had no idea how to go about responding to them. If you are really interested in the politics and economics of globalization, perhaps you will find this class worthwhile- assuming you do all the reading.\nWorkload:\nThree 4-5 page papers...two of which he assigned in the last two weeks of class. \nEasy to get away with doing very little reading, even though he assigns several hundred pages a week.\n"
        },
        {
            "course_name": "Cultures of Colonialism - Palestine/Israel",
            "review_date": "April 19, 2005",
            "review_content": "\nGood class.  If you can deal with the 9am start time you should definitely take this class.  Professor Abu-Maneh knows what he's talking about and provokes interesting discussion.  The only downside is the amount of work.\nWorkload:\nAbout a book a week.  (Some are very long.)  Weekly responses on CourseWorks and two papers, 5-7 & 10 pages.\n"
        },
        {
            "course_name": "Global Literature in English",
            "review_date": "April 17, 2005",
            "review_content": "\nThe Post-Colonial Lit. is fascinating and not too be missed. But I found Bashir to really be a ball-buster. \nWorkload:\nDespite the excessively heavy reading, novel plus criticism plus online posted response--it seemed irregardless of effort put into the course, your best was just never enough. \n"
        },
        {
            "course_name": "Global Literature in English",
            "review_date": "December 29, 2004",
            "review_content": "\nI loved this class and Bashir's laid back teaching style.  There was a lot of reading but it was well worth it.  \nWorkload:\napprox 8 novels plus criticism, two papers \n"
        }
    ]
}