{
    "prof_info": [
        {
            "prof_name": "Ioannis Kymissis",
            "prof_id": 4497,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Solid-state devices and materials",
            "review_date": "December 24, 2012",
            "review_content": "\nThere are two positive things I can say about this class: Kymissis is a nice, well-intentioned guy, and some of the material is quite interesting and useful. \nUnfortunately it shows that he's totally out of touch since the rest of this course is totally disastrous. Arbitrary grades and problems on problem sets (they're graded out of 3 points, yes, reflect for a moment how ludicrous it is to spend 5 hours on a problem set then get a 2/3 on it while your friend who put the exact same answers will get a 3/3. And don't bother trying to protest it since you won't see those grades until after the final.) The TA and Kymissis also seem to think locking students out of a lab which is required in order to complete the aforementioned problem sets is acceptable. Best of luck trying to do it even if you manage to get into the lab though, the computer they provide you with will probably crash about 4 times.\nThe tests are calculator races since he loves putting about 5 10-part questions on a 1 hour test (this is less true for the final which is more reasonable in terms of time.)  They also encourage you to just write down random units and some equations since you can get a quarter of the points for just writing the correct units. Although this seems cool at first, it's actually really silly since it doesn't contribute at all to anyone's understanding of the material and serves only to skew the curve. He did set up a Piazza (online message board) and answered questions with acceptable clarity in an intermittent frequency. It would've been infinitely more useful if he had posted solutions to old tests. Yeah, he posted every old test from 2008-2011 for the final BUT none of the solutions. He did something similar for the second midterm. It wasn't until I read a Piazza answer that had been posted a couple hours before the final when I realized something simple I had been doing wrong. It wasn't on any of the totally useless problem sets, but on a lot of the old finals. He also didn't post a lot of the relevant problem set answer keys until about halfway through reading week. I feel fairly comfortable I would ace the tests if I had enough time to do them and proper resources to study from (i.e. old answer keys.)  But don't bother looking to the useless half-textbook he makes you buy at the beginning (may be it's out of print for a reason?) He lectures from slides, which on the one hand is good since organization is obviously not his strong suit. On the other hand he never gets through all the slides in a particular lecture. \nAt the end of the day though, the material is not extremely difficult. It is simply an extremely frustrating class, wherein a bunch of factors conspire to make the curve much steeper than it should be. If you put in a lot of effort into deciphering what exactly he's asking on his frequently typo-riddled questions, go to the TA recitation, and practice typing really fast on your calculator you could potentially walk away with an A. I know I probably won't since ain't no body got time for that shit. \nWorkload:\nProblem sets that are more frustratingly ambiguous calculator exercises rather than lengthy and/or conceptual.\n2 manageable midterms you won't be able to finish. A final. \nYour grade will probably be arbitrary. \n"
        },
        {
            "course_name": "Solid-state devices and materials",
            "review_date": "December 17, 2012",
            "review_content": "\nProfessor Kymissis is a pretty good professor. He seems to really enjoy teaching. When you go to class and when you talk to him, you would expect to learn a lot from his class. Unfortunately, that's not the case. \nThis is the most poorly organized class I have taken at Columbia. Aside from the problem sets being an entire waste of time (just hours upon hours of mindlessly plugging numbers into your calculator), the textbook was extremely difficult to understand, and the lectures were too. I did a lot of work for this class, but walked away only with a mild intuition for the ideas behind solid state devices. You will do way more work than you should consider how much you will learn, and you won't do well on the exams because (like the homeworks) the exams come down to who can plug numbers into the calculator fastest. This is one stressful course, and it simply isn't worth taking. \nI feel like this course could have been better had the lectures/homeworks/exams been structured better. Kymissis uses a lot of jargon without understanding that students have to intuition for some of these ideas beforehand. \nThere was also a lab component which caused a lot of stress. The professor and TA repeatedly had students go to the lab to take measurements, only to discover the setup wasn't working. This is entirely unacceptable - I pay tuition and I expect to get my money's worth when I take a class. Don't waste your time with this class. It sucks. \nWorkload:\nWeekly problem sets that you won't be able to complete.\n2 Exams (calculator race) and a final.\nA couple minilabs, which couldn't be done this year because the TA and professor fucked up.\n"
        },
        {
            "course_name": "Solid-state devices and materials",
            "review_date": "December 25, 2010",
            "review_content": "\nProfessor Kymissis is one of the best professors I've had so far at Columbia. How many of your professors post annotated slides from every lecture and set up a class wiki for you to ask questions that are visible to the entire class?\nThe course itself is straightforward. You'll cover some basic principles of semiconductors, then go into the fundamental models of PN diodes, MOS capacitors, MOSFETs, and BJTs, with a bit about band theory at the end. It sounds a little intimidating, but it really boils down to reapplying the same ideas in a few situations. The graphs associated with each device are vital, and Professor Kymissis does a good job of making sure we understand exactly how to use them.\nI have a few criticisms, but they're fairly minor. Problem set and exam grading was slow, but we had more then enough material to use for studying. Professor Kymissis likes to ask a few tricky questions on each test, and they usually amount to using the principles of how a device works in a situation that hasn't been covered directly in the class or the problem sets. The problem sets can be long, but they're far from unmanageable.\nOverall, the pace of the course is spot-on, the material is neither trivial nor overly-difficult, and there is so much study material and assistance provided that the only way not to learn is not to try.\nWorkload:\nWeekly problem sets that start off very easy, then get somewhat challenging and stay that way. Exams are fair, but take note of a quirk in the grading system: you get a significant number of points for writing down the units of the answer, and sometimes relevant equations, for every question (even a question you otherwise haven't started), so it's in your best interest to run through the test filling in units before answering any of the questions.\n"
        },
        {
            "course_name": "Solid-state devices and materials",
            "review_date": "January 01, 2009",
            "review_content": "\nProf. Kymissis comes to class very prepared.  His lectures, besides his interesting demonstrations, are composed completely of powerpoint slides.  He uses a Tablet PC to write notes on the slides as he goes through them during class.  He posts the annotated slides on courseworks.  He also makes use of the a course wiki which becomes very useful for clarifying concepts when doing problem sets and studying for tests.\nThat being said, lectures can become a little boring when he goes through derivations.  Most of the learning for this course will happen when you do the problem sets.\nHe tries to stress that it is better to understand the material then to simply memorize all the equations so he allows hand-written cheat sheets for the tests (1 sheet) and final (2 sheets).  Some of the questions he asks can therefore be tricky, at least they were for me.\nNever posted final grade distributions but an A is definitely possible if you put in the effort for the problem sets and do practice tests he gives out.\nWorkload:\nWeekly problem sets (20%) - graded liberally (out of 3 pts), two midterm tests (20% and 20%), and a final (30%).\n"
        }
    ]
}