{
    "prof_info": [
        {
            "prof_name": "Emrah Cakmak",
            "prof_id": 4557,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 15, 2010",
            "review_content": "\nLooking back, I really learned a lot. However, during the class I was ready to strangle him and I feel like the rest of my classmates were too. He made us work hard but we still had fun. There was one day he commented on how we were really tired and someone mentioned it's because we're hungry so the next time he brought in really expensive truffles to keep us awake, which was really nice of him.\nHe tends to get off track often and then whatever we didn't cover becomes homework which meant a TON of reading. learn to skim and then highlight/comment the most important things so you'll be able to offer your opinion in class.\nHe is easy to get along with and always offers helpful tips in order to improve. All in all, I enjoyed the class and had many memorably laughts.\nWorkload:\nA lot of reading, and it's almost necessary that you read at least part of it in order to volunteer and speak in the next class because if you don't, he'll pick on you for not speaking. And three papers - he'll have a first draft due before then in order to make sure you can do the best job.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 05, 2010",
            "review_content": "\nEfe, efe, efe. what can i say about him that would do his class justice?\n'total love-hate relationship',\n'Sin wave', \n'I love him, he's so cool', \n'He's driving me crazy, I hate him', \n'I totally get what he meant',\n'WTF was he saying?'\nThese are not diverging opinions, friends, these are things you will find yourself saying, yes ALL of you and yes ALL of these things, throughout the course of the semester. 'It is a contradiction, yes, but one you must inhabit'. You'll get it soon enough.\nThere will be days you'll walk into his class wanting to be his best friend only to walk out frustrated and with oodles of confusing homework. Then there will be days you'll walk in miserable, dreading falling prey to his characteristic sarcastic left-brow-raise only to have the best time. He'll do whatever he feels it takes to make the class lively which is an unfortunately broad spectrum of things: you'll either luck out and he'll buy 80 dollars worth of truffles for the class orrr.... he'll ask you to re-read a text and draw out the characters and events on a field map. He was genuinely surprised at our lack of enthusiasm on that task.\nHe's great for support. He'll always answer your emails and questions and agree to meet you outside of class, is constructive with criticism [even if you don't quite get what it means] and won't make fun of you for saying something stupid unless he feels like you're mocking him. \nDefinitely a memorable class, he's pretty cool, but drove me and pretty much all of my classmates crazy sometimes. \nWorkload:\nthree essays. fair amounts of reading.\n"
        }
    ]
}