{
    "prof_info": [
        {
            "prof_name": "Evan Haefeli",
            "prof_id": 2737,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "March 30, 2010",
            "review_content": "\nThis class is amazing. Aside from a bizarre tendency to spend several minutes at the beginning of lecture writing a vague and difficult-to-follow outline on the blackboard only to speed through the rest of the material, Professor Haefeli is a great professor. The material is clearly presented and I found his numerous asides to be funny and entertaining. Each lecture is organized around an argument that is presented along with other possible explanations so that I left the class with a far more universal picture of the American Revolution than I had ever imagined could have existed. \nYou also get to spend part of one class watching 1776--a definite bonus.\nThe reading is always interesting and related to the lectures. Definitely necessary for the papers. \nWorkload:\nA bit on the heavy side of standard reading for a history class. \n3 papers (8 page, 5-7 page, and a take home final)\nParticipation in section and weekly Courseworks responses \n"
        },
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "January 02, 2010",
            "review_content": "\nI loved this class. If you are interested, just take it and you won't regret!\nYou will get to learn what America was like before and after the revolution, and you get to explore how American identity is formed or transformed during these critical years in the American history. The class approaches the subject in many different perspectives: intellectual, economic, political, military, etc. \nI personally found the military history part really boring and skipped the entire Fisher book, but I read everything else since they were all very interesting and well-written. \nAnother great thing about this class is the lectures. You can see that professor Haefeli comes to every lecture well-prepared, and lectures were all very interesting and well-organized. In retrospect, I wish I took my notes on my laptop, but he prohibited laptops in the beginning of the class (However, half-way through the class, I think handful of people were typing in their laptops anyway). \nAll the TAs were awesome, too. It was one of the few classes in which so many TAs had their presentations, and each had something interesting to say. I think this class was the best history lecture class so far at Columbia.\n\nWorkload:\nPretty standard history class. A book or two per week of reading and weekly postings. \nWhen you are reading, focus on the main thesis of the lengthier books (but I do recommend actually reading some since they are enjoyable) and read and understand the primary documents thorougly. \n3 papers (paper, midterm, and final) and 20% section grade. TAs grade your papers so they will determine your grade.\nI got an A overall but I had to work hard for it. \n"
        },
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "December 27, 2009",
            "review_content": "\nI enjoyed Revolutionary America with Professor Haefeli.  The lectures were for the most part interesting and he provides you with an understanding of early American history far beyond what you previously had.  His lectures could be a bit slow at times, but they were always well organized and each class had a clear goal.  The weekly readings could be a bit heavy, but it is not necessary to do them all, just enough to make weekly Courseworks postings and discuss the material in section.  That being said, you may want to do all the readings simply because they are interesting and truly enhance the class experience.\nSection was generally pretty interesting, with a heavy emphasis on participation and discussion.  The TA grades the papers and pretty much determines your grade.\nAll in all, a worthwhile course which leaves you with an in depth knowledge of early American history (1750-1815) and professor Haefeli does a good job structuring the readings, his lectures, and the course overall.  \nWorkload:\n*Weekly readings (approx. 200 pages per week)\n*Weekly Courseworks responses to readings (about 2 paragraphs)\n*Three papers including take home final with a week to complete.\n*Heavy emphasis on class participation in determining grade.\n"
        },
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "December 23, 2009",
            "review_content": "\nLoved it.\nAttend class on a regular basis.  His lectures rest on clear arguments, and provide a useful context for your papers.  The final allows you to use information he provided,  so organize and date your notes.  Also, he has a dry wit.  Very entertaining.  (His favorite punching-bags are Canadians and George Washington's questionable military leadership.)\nOn the first lecture, he will make you aware of the Revolution's historiography: Whig, Progressive, Imperial, etc.  He does this to make you aware of the various interpretations of the subject.  You don't need to be an expert to understand it, however.  The readings--especially some by Gordon Wood--provide useful outlines of the time period.\nThe workload is pretty comfortable.  Three take-home exams, and participation at weekly discussion sections comprise your graded work.\nWorkload:\n* Weekly sections with your TA.  This person will grade your exams.\n*Readings: About a book-worth a week, sometimes less.  You will need to know these well when completing the graded work.\n* Three papers (\"Take-Home Exams\").  The first two are 6-8 pages, and the last is about 10 pages.\n"
        },
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "February 15, 2007",
            "review_content": "\nProf. Haefeli made this a great class.  Considering how popular US History is here, it was surprising that this lecture class had only about 30 kids (perhaps the bad CULPA reviews had something to do with it?).  But Haefeli was an excellent and clear lecturer, who led a very cogent historical narrative of the period.  The  TA Nathan was the best TA I've had at this school, and in some ways offered the most insightful commentary.  I would reccomend this class for anyone whose a fan of the time period or any other History Major.\nWorkload:\nMedium to heavy.  About 300 pages of reading a week, of which you have to do some.  Take home midterm, final, and test, all of which are a collection of 2-6 page essays.  Graded very fairly, and if you do the reading, the papers will be easy to write. \n"
        },
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "February 15, 2007",
            "review_content": "\nProf. Haefeli made this a great class.  Considering how popular US History is here, it was surprising that this lecture class had only about 30 kids (perhaps the bad CULPA reviews had something to do with it?).  But Haefeli was an excellent and clear lecturer, who led a very cogent historical narrative of the period.  The  TA Nathan was the best TA I've had at this school, and in some ways offered the most insightful commentary.  I would reccomend this class for anyone whose a fan of the time period or any other History Major.\nWorkload:\nMedium to heavy.  About 300 pages of reading a week, of which you have to do some.  Take home midterm, final, and test, all of which are a collection of 2-6 page essays.  Graded very fairly, and if you do the reading, the papers will be easy to write. \n"
        },
        {
            "course_name": "Revolutionary America 1750-1815",
            "review_date": "December 17, 2006",
            "review_content": "\nI like Prof. Haefeli. He's young, and you can tell that he really is enjoying himself. Also, he improved so much over the course of the semester that I think he was still unsure of himself in September. I really enjoyed this class. It was not too hard, and he speaks SO CLEARLY. It's great for taking notes. The TA, Nathan, is really nice, too. See if you can get him. The only bad part about this class is that Haefeli writes the notes on the board for the first ten minutes of class, but otherwise...\nWorkload:\nNot bad. Take home midterm and final. 1 paper. Book/week of reading and coursepack. Pretty standard. With discussion section.\n"
        },
        {
            "course_name": "Early American Religious History",
            "review_date": "January 07, 2006",
            "review_content": "\nI didn't really enjoy this class at all. I feel as if the general sentiment of the class was--A BIG WASTE OF TIME. He is an incredibly unfair grader and I would strongly warn against taking this class!\nWorkload:\nVery heavy, boring, and sometimes incomprehensible.\n"
        },
        {
            "course_name": "Early American Religious History",
            "review_date": "December 21, 2005",
            "review_content": "\nVery difficult grading. Tons of reading. Don't think I learned that much.\nWorkload:\nTONS!\n"
        }
    ]
}