{
    "prof_info": [
        {
            "prof_name": "Isaac-Davy Aronson",
            "prof_id": 3064,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 31, 2007",
            "review_content": "\nIsaac was an excellent University Writing teacher. He was enthusiastic, approachable, knowledgeable and fair. I have nothing bad to say about him. He made an otherwise boring class interesting. Consider yourself lucky if you wind up in his section.\nWorkload:\nFour essays, multiple drafts (ungraded) and one group presentation. Don't slack on the drafts because feedback is invaluable. Grading is moderately tough; you need to work for a good grade.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2006",
            "review_content": "\nIsaac is by far an amazing teacher.  The first day of class, I knew he would be amazing just by the way he was dressed.  He's an awesome teacher and I realy feel like everything he did helped you towards becoming a better writer.  Not only was he an amzing instructor, but he was really funny and nice.  Whenever you would go visit him during office hours, he would always ask you how things were going in your own life, he really geniunely cares about his students.  As I already said, Isaac really helps you improve your writing by offereing effective insructions that can help you towards a better paper.  His comments are comprehensive and VERY LONG, but that really helps you towards improving your owrn writing.  If you get Isaac as your teacher, prepare to work hard, but Isaac is worth it.\nWorkload:\nAverage Uni Writing coarse load.  Dates are flexible, just go and talk to him and he's usually fine with dates.  He is a tough grader, but you can't help but like the class because Issac is your teacher.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 17, 2006",
            "review_content": "\nISAAC IS AMAZING.  He is the kind of teacher who is both a friend and an instructor.  He is completely cool, young, and fun.  The best part is that he is really smart, and actually knows what he is talking about.  The classes are extremely well structured and taught even better.  His comments are helpful and well thought out.  He really puts a lot of time and effort into the class and wants you to improve your writing, and he CAN help you do that.  He used to be a student at Columbia as well, so he understands what it is like to be a freshman and how much work you have.  It is a pleasure to be in Isaacs class and just to know him in general.  Isaac is one of the few TAs I've met who teaches on the same level as a professor.  Congrats if you have him, if not, try and switch in...\nWorkload:\nA lot of reading (one essay per class), and short hw assignments about the essay.  4 big papers, but you spend a lot of time reviewing and revising them in class.  Fair grades.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 08, 2006",
            "review_content": "\nIsaac is amazing. The class itself is one of the less interesting parts of the Core Curriculum, I think, but he really makes the best of it. He's a pretty funny guy and is always willing to meet with you outside of class to help you with your papers or writing in general. He's almost too eager for my taste since I fear meeting with instructors outside of class, but it's wonderful to see a teacher care so much about his students' work- especially since he's a grad student. It's ironic, almost, since he's one of the best teacher I've had this semester.\nOne of the best things about Isaac is his essay comments. Sometimes his comment will actually equal the length of your essay. He's very good at helping you tweak your work and guiding you in the direction of \"fruitful questions.\" At same time, however, he is a hard grader. Well, not so much a hard grader as someone who really gives you the grade you deserve. Even though you'll have to work for your A, you'll learn a lot about writing in the process (and probably more than this course was designed to teach you. Which reminds me: I have no idea what it was supposed to teach me).\nVery few people like Uni Writing, so there's not much hope there, but you should consider yourself very lucky if you get Isaac as your teacher.\nWorkload:\nThere was a reading and a 500 word or so assignment after almost every class, but they weren't graded- they just gave you bonus points after every paper. 3 papers between 1500 - 3000 words and a final \"reflection\" paper between 1000 - 1500 words.\n"
        }
    ]
}