{
    "prof_info": [
        {
            "prof_name": "Diane Vaughan",
            "prof_id": 2957,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Mistake, Misconduct, Disaster: How Organizations Fail",
            "review_date": "May 09, 2014",
            "review_content": "\nI took Professor Vaughan's class last fall and absolutely loved it, possibly one of my favorite classes at Columbia so far. I loved the wide range of case studies-- from plane crashes to stock market traders to religious fanatics-- and while there was a lot of reading for this class many of the readings were focused on these interesting cases. Vaughan knows what she's talking about, and she's clearly extremely knowledgeable of her field (she's considered the #1 expert on shuttle crashes, and was asked to testify at the investigation hearings for the Columbia shuttle explosion). While Vaughan is not the most incredibly vivid and lively speaker, her familiarity with everything she talks about comes across in lecture.\nI worked hard in this class, but I was easily motivated to do so simply because I was interested in the material. If you find this isn't the case, this may not be the class for you. While there is a lot of reading, some of it can be skimmed, and you really get most of what you need to know in lecture. So combining doing (most of) the reading with attending lecture will get you far. In the end, I was really happy with this class and even today much of what I've learned has stuck with me.\nWorkload:\nWeekly reading (varies, anywhere from 25-75 pgs/week)\n2 exams (one halfway through the semester, another on the last day of class but not cumulative)\nFinal 12-page paper (you get to write it about a documentary, way easier than any other paper I've written of this length)\n\n"
        },
        {
            "course_name": "Mistake, Misconduct, Disaster: How Organizations Fail",
            "review_date": "December 24, 2013",
            "review_content": "\nThis course is a joke. I learned absolutely nothing and the only thing I achieved from this class was fulfilling a graduation requirement.\nVaughan is a very amiable and personable teacher who manages to ingrain no knowledge in your head after an entire semester. She agrees with pretty much anything any student says, often goes on tangents and talks about irrelevant stories about her life, and never clearly explains any theory or concept she talks about. She doesn't ever use the board or follow a progressive teaching process - she jumps from topic to topic with little cohesion.\nFor example, if it's so important for us to know about the Bounded Rationality model and Practical Drift, she should actually take the time to explain them clearly and write down a short definition or quick points on the board. She just asks us about what we learned from the readings and says it's all good (it's not).\nShe assigns an unreasonable amount of reading (easily 150 - 200 pages per week) about boring case studies that get into more detail than necessary. She makes you read 3 entire books in addition to the numerous articles too. The readings can sometimes be interesting and you might actually learn something from a few of them, but by and large, they are meaningless babble about unnecessary details of nuclear power plants or something.\nI personally didn't do any of the reading for the second half of the semester and only paid attention in class. With the little knowledge I was able to glean from the lectures, I was able to get a good score on the exams. This just goes to show how ridiculous this class is.\nThe midterms asked for definitions and short essays on various incidents. She only asks about incidents she talks about in class, so you can skip the rest of the readings.\nYou have to write a 12 page paper on a film, analyzing it using her organizational causal model. You just have to segregate points in the movie into various subheading of her model. Not hard - doesn't require much effort.\nI do not recommend taking this class.\nWorkload:\n2 midterms\n12 page paper\n3 short 1 page write ups which are not graded - you just have to turn them in\n"
        },
        {
            "course_name": "Mistake, Misconduct, Disaster: How Organizations Fail",
            "review_date": "December 26, 2010",
            "review_content": "\nMistake, Misconduct, and Disaster was a very interesting course regarding the \"dark side\" or complex organizations and the deviance they can systemically produce. \nIt consists of applying a causal model, which can get a little complex, to numerous organizations, along with learning some basic sociological theories regarding decision making.  Unfortunately, this was the first semester that the course was offered, so it was a little unorganized.  Lectures did not always follow the syllabus, which often changed.  Additionally, some key points were not easily deciphered either from readings or in class making this course somewhat confounding.  Regardless, the course offers valuable and practical insight into the organizations that some of us hope to work for.\nI enjoyed Professor Vaughan, who has devoted her career studying organizational deviance.  She is warm, friendly, supportive, but mostly passionate about her work.  Her book on NASA's space shuttle Challenger provides insight regarding how and why such a disaster can occur.  It is the foundation of the course.   She keeps regular office hours, and I would recommend you go.  As long as you sincerely show a concerted effort, she's very helpful.    \nClass discussions were interesting, especially when we split into groups and practiced decision making.   Everyone viewed the same information in different ways, yet we have to make a consensus.  Lots of inner squabbles and positioning which is exactly the point of how and why large organizations make decisions.  \nThis is not an easy class, and definitely not an easy A.  You need to devote a great deal of time to the assignments, which are lengthly.  I was lost for a couple of lectures, but it finally came together toward the end of the term.  \nWorkload:\nHeavy reading assignments, some of which (The Cuban Missile Crisis) are difficult to follow.  Lots of downloadable articles and several books.   One midterm consisting of an in class test, and a take home three page paper.   One in class final exam, and a twelve page paper which is the culmination of all theories discussed in class.  Neither were easy.  Grading was a little rough, but I still learned a great deal.  Those who attended class on a regular basis did the best.  \n\n"
        },
        {
            "course_name": "Mistake, Misconduct, Disaster: How Organizations Fail",
            "review_date": "December 25, 2010",
            "review_content": "\nVaughan was an enjoyable and amiable professor. Every class she would ask a multitude of softball questions and agree with more or less anything that students said in a sort of \"Oh, that's a nice contribution to the discussion,\" even if it were completely wrong.\nThat said, if you're looking for rigorous instruction in sociology, don't bother. She's well-published and knowledgable, but her agreeableness means that the lectures aren't emphatic enough. You spend the majority of the class learning a relatively simple model and apply it to a bunch of cases. You can do this stuff in your sleep.\nWorkload:\nTwo midterms, take-home final (12 pages), all generously graded\n"
        },
        {
            "course_name": "Disorganization, Deviance, and Social Control",
            "review_date": "November 30, 2006",
            "review_content": "\nAn inspiring teacher, the kind you expect to have at an Ivy League school. I agree with the previous reviewer that she doesn't just want you to parrot back theories, but rather truly understand how they work in contemporary society. She's written extensively on subjects like the Challenger space shuttle disaster and she recently won a major award for her work. Columbia classes are often devoid of practical application, but I can definitely see how this class will help me become a better critical thinker, more aware of how different theories shape our view of crime and disorder. Anyone who thinks that sociology is a Mickey Mouse subject should take this class - it will definitely change their mind.\nOne note: If you say something to her and it seems like she's ignoring you, don't take it personally - she's slightly hearing impaired.\n"
        },
        {
            "course_name": "Deviance, Disorganization, and Social Control",
            "review_date": "June 03, 2006",
            "review_content": "\nProf Vaughan is an incredible woman. Every sociology class should be as accessible yet informative as hers is. She organized information so at the end of the course I didn't feel as if I had just learned a bunch of theories but, rather, saw a larger picture about the topic. Unlike many professors who just want you to spit whatever they say back at them, she made us also employ the theories critically and gave us the opportunity to make informed theories of our own in relation to what we had already learned. She helped show every student how to think sociologically as well as just understand a sociological theory. She was also extremely warm and had a great sense of humor. Her only flaw was that sometimes she let class discussion get out of hand and didn't direct it enough. This was her first undergraduate course, though, so she'll probably get better at this. The course material she chose was fascinating and her own work was especially enjoyable which is not always the case since it seems like many professors just include their own material because they have egos about it. Hers was actually groundbreaking in the field and very exciting. Take this course! I wish I could take it again.\nWorkload:\nTwo midterms, Final paper, Final\n"
        }
    ]
}