{
    "prof_info": [
        {
            "prof_name": "James Leighton",
            "prof_id": 655,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "May 24, 2013",
            "review_content": "\nIt's been a while since someone's reviewed Leighton, but for the most part everything the past reviewers have said are true. Compared to Breslow, Leighton's a lot younger, and subsequently more dynamic and engaging. He enunciates his words. He draws molecules that are actually easily discernible. He won't miss your hand if you thrust it up, eager to ask a question of clarification or to show your peers how intellectually curious you are. \nTo do well in his class, 1) Come to lectures. 2) Take good notes during lecture. Make sure you're not just copying down molecules and ignoring the context/explanations that he's giving them. 3) Study the notes regularly, memorize the reactions, and understand the mechanisms. Leighton gave us psets regularly throughout the semester, and if you can do those psets without having to look at your notes, you should be fine for the midterm. \nLeighton's exams are quite conceptual; though the problems are hardly ever straight from the notes, if you know your notes well and can explain/comprehend just about everything he talked about in class, you should have no problem getting an A or an A+ in the class. Seriously. He likes to test a) proposing mechanisms, b) reaction predictions (ugh...stereochemistry comes back with a vengeance this semester), c) designing syntheses (which all involve some sort of retrosynthetic analysis of the product). \nIn the end, the class averages still weren't that high; the averages for the midterms were 64, 65, and 76 respectively, while the average for the final was a 69.7. Don't try cramming for this exam; my friends who were most successful in this class all put in a little time daily for the first couple of weeks, until they were able to get a hang of Leighton-style orgo. \nNate's also a pretty good TA. He's a funny and chill guy. His recitations were a lot more helpful first semester (since understanding Breslow's lectures required more effort than deciphering the Rosetta stone), but second semester they were merely rehashes of Leighton's lectures. Nate's pretty approachable for questions, and is willing to help you do well in the class. \nNow for my experience: I am by no means great at organic chemistry. As whole, the class got better at orgo as the semester progressed, while my grades stayed pretty stagnant. It took me a while to realize that was because I wasn't putting enough time into the class. So I swallowed my pride, starting recopying notes, and then did quite well on the final. Somehow, I ended up doing better than I expected in the class. Unlike the previous reviewers, Leighton didn't send us an end of the year email, and I'm pretty sure he curved my class to a B+. \nBut the bottom line is, if an idiot like me was able to get through this class with a grade much higher than I had hoped for, with steady effort, you can too. \nWorkload:\nIn my semester, it looked something like this:\n3 midterms - 15% each (45% of total grade)\n1 final - 13 questions, out of 235 total points (45% of total grade)\n9 (or 10) mostly weekly recitation quizzes, lowest 1 dropped (10% of final grade)\n**optional Psets that Leighton gives, which of course everyone does anyways. \n\n"
        },
        {
            "course_name": "C3045-C3046 Intensive Organic Chemistry (for freshmen)",
            "review_date": "May 18, 2010",
            "review_content": "\nThis was hands-down my favorite class freshman year. It can be kind of intimidating at first - Professor Breslow is a genius (you learn about the Breslow intermediate second semester) and some of his lectures can go pretty quickly - but take solace in the fact that everyone feels lost.  If you stick close to your TA first semester, you'll be FINE. Plus, because both Breslow and Leighton consider the class \"above average,\" it's fairly easy to make an A+ (I made one both first and second semester). I think the class is itself scaled to an A-, which is a lot better than the gen chem or regular orgo classes. So if you are placed into this class, TAKE it.\nAlso, orgo just gets easier as you go along. I must say that I spent a lot of time on orgo first semester (you need to read and understand the book chapters VERY WELL). But if you get through first semester, second semester is a breeze. Leighton doesn't care about the book (although he took some exam questions verbatim from his \"recommended homework\" so if you're smart, you'll look at those problems) and his exams come STRAIGHT from his notes.  He's also really good about extra office hours and his class notes are very clear. \nBoth semesters and both professors were absolutely fascinating.  I am really going to miss this class - it made me a chem major, I loved it so much. So take it! It'll be the best decision you make freshman year. \nThe final in Breslow's class was not that hard, although the average ended up being really low - he just asked you to do a lot of \"application\" problems rather than synthesis. Make sure you know what anthracene looks like and how napthalene reacts!\nThe final in Leighton's class was a piece of cake. Just take the time to review your notes and it's super easy.\n\nWorkload:\n1st semester: pretty substantial, you need to read all the book chapters and do all the hws to be prepared\n2nd semester: really light - just do a weekly problem set (only every other one is graded by a check, check plus, check minus system) and pay attention in class and the exams/final are a breeze. \n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "January 23, 2010",
            "review_content": "\nThis was my absolute favorite class freshman year (I'm a sophomore). If you get in to this class, take it take it take it. I have a bunch of friends who got in but took gen chem and regret it now.\nFirst semester: Yes, Breslow teaches very quickly. Yes, he does tend to skip chapters he doesn't care about and tell you to read them at home. But he is really an amazing teacher. He is very clearly excited about what he's teaching, loves to make jokes (which often catch you off guard), and always takes the opportunity to tell you about real-world applications. I brought my English-major sister to sit in on the class when she came to visit me, and even she was entertained all class. He is honestly one of the smartest people I have ever ever met. I don't think I ever looked at the clock ever all semester. His tests are hard, and are sometimes about applying what you've learned to things you've never seen before, but the curve is extremely generous. He said at the beginning of the semester that in order to not discourage students from taking the class, he tried to give them what they would have gotten had they taken gen chem (A or B range, and frankly, if you're in this class, a B is still pretty damn impressive).\nSecond semester: Leighton is a really good teacher. After Breslow, his lectures definitely seem slow, but his drawings seem like the most beautiful things you've ever seen. He also manages to teach this semester WITHOUT A BOOK, which, thinking back on it now, is pretty amazing. He's just that good at explaining things. And what's really nice is that, because the class is so small (in what other organic class can the teacher learn your name??), you can ask questions, to which he is very responsive.. The tests are definitely hard, but again the curve is generous. I have heard of people getting C's in this class, but the majority of the kids my semester got in the A range. \nNote: From seeing my friends take organic now, the book Breslow and Leighton use is SO MUCH BETTER than the one used in regular orgo classes. It's extremely readable and explains things with really funny cartoons sometimes. It was worth reading first semester just to see resonance get compared to rhinos and dragons and unicorns. No kidding. I get my old one out to explain things all the time.\nWarning: Bio is a HUGE LETDOWN after this class.\nWorkload:\nFirst semester: reading the book is optional but definitely helpful, optional problem sets (from the book), recitation quizzes, 3 midterms & final (one midterm or 1/3 of the final can be dropped. I seem to remember that you could also drop all the quizzes if necessary); I think it was curved to a B+.\nSecond semester: he says the book is a paperweight--I don't think I looked at it all semester (and didn't need to), shortish problem sets (that he writes and are graded on the \"check\" scale), 3 midterms (one can be dropped) & final; When I took this class, he sent us an email at the end of the semester saying 2/3 of the class got >= an A-, but that he really thought we deserved it.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "March 28, 2009",
            "review_content": "\nBeware--this class is full of premeds, overachieving engineers, and future chem majors.  And it's at 9am.  It's especially useful for premeds and chem majors, since it saves you a full year of gen chem, but some background in orgo is definitely helpful.  Mostly, people don't realize that for synthesis questions, you have to ask yourself \"what can I make with X and Y,\" \"how do I make this kind of molecule,\" \"what do I add to X to get Y,\" etc.--it's NOT just memorizing X+Y=Z.  \nBreslow teaches the first semester.  He's totally brilliant (google him for some fun facts, as well as amusing pictures of him when he was young), but should NOT teach undergrads.  Don't bother showing up to class--I went to every class, wrote everything down, tried my best to stay awake, and should have slept in every morning and just done everything out of the book.  Luckily, Michelle Hall was the TA our year and she is FANTASTIC.  I have no idea how any of us would have passed without her.  Also note that while the midterms are all fair material out of the book, the final is INSANELY hard--he wants you to \"apply your knowledge\" to stuff you haven't seen or something, but it's totally impossible.  In my class, about a third of the class ended up with some kind of an A. \nIf you can make it through first semester, James Leighton is totally awesome.  He's super organized, draws large, clear molecules/mechanisms on the board (Breslow drew lots of tiny scribbly drawings--it's a nice change!), and is dynamic/engaging enough to keep almost everyone awake.  Class attendance is absolutely necessary, since he lectures from his own notes and covers things not in the book (the book is still helpful for review and practice problems, though).  Our TA was not very helpful, but it didn't matter since Leighton is such a badass.  Exams are definitely mechanism-heavy (unlike Breslow's), but mostly fair.  At least you know what's coming, since he posts practice tests.  The final is pretty hard, but not as crazy as Breslow's.  2/3 of our class got some kind of A. \nWorkload:\nPrevious reviewers covered Breslow's complicated system.  Leighton's class had 4 midterms (best 3 scores make up 50% of your grade), final was 40%, and several problem sets are 10%. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 10, 2006",
            "review_content": "\nI was quite impressed with Leighton as a professor.  His lectures were extremely organized and he did a very thorough job of explaining the material.  He also had helpful TA's, gave homework far enough ahead of the due date to allow students to get help in office hours or recitations, and was very good about answering questions.  I would clearly recommend him for second semester orgo if you want to come out with a good understanding of the material.\nHowever, all of these benefits come at a significant price.  The grading, while very fair, is brutally tough.  An earlier reviewer who said that you can still end up with a B+ even with above average scores on all the tests is absolutely right.  And you if score above the mean but by only a few points, you'll probably end up with a B.  While Leighton does give you a chance to earn some points on his tests (means were in the 60's and 70's, much higher than the ones I've heard from the Nuckolls section), scoring in the 80's and 90's is still extremely difficult, which may come as a bit of a shock for people coming out of Katz's 1st semester section (I was one of those).\nDespite the tough grading I would still recommend Leighton for the quality of the lectures.  But be prepared to sweat for 16 weeks and then just hope the final goes well if you want a decent grade.\nWorkload:\nUnlike some other intro. science classes, Leighton's class is more about studying than problem sets.  Only 8 problem sets (4 collected and graded on a check system), and no recitation quizzes (a plus).  On the other hand, there are four tough and tricky midterms (15% of grade each, lowest one dropped) and a tougher, 14-page final (45% of the grade and will make or break your semester).  Be prepared to live in Butler for this class.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "December 09, 2005",
            "review_content": "\nLeighton is probably the best professor I've had here. His lectures are amazingly clear and organized-- I wish he taught first semester orgo and biology. As one of my friends said, you may even find that you \"wish you could take Orgo for the rest of your life.\" His notes are so good that you'll probably never consult your textbook again, except maybe for practice problems. The course is difficult, mostly because there's a LOT of mechanistic details/reagents to remember (if Orgo were open-book, there wouldn't be so much to it) and because everyone in the class seems to study an inhuman amount, but exams and grading are extremely fair. If you spend enough time studying, you'll be fine. If you only leave yourself one day to study, you will probably struggle for a B-range grade unless you have an amazing memory. \nWorkload:\nStandard for science courses. Problem sets (5%), 4 exams (50%, one dropped), final (45%). Spend the time to rework homework problems and doing the recommended probelms from the text.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "June 02, 2005",
            "review_content": "\nI took Professor LeightonÂ’s class because my TA from last semester recommended him to me.  He said that he was a clear and well-organized lecturer and he was right.  I have to admit before I started taking Orgo II I was already a bit apprehensive.  I heard awful stories from the premeds before me that Orgo II would be the worst class I would have to take to get into medical school.  By the time I finished the class, I didnÂ’t find that the case at all.  Perhaps Professor Leighton went out of his way to make it enjoyable.  I found myself less confused than last semester and the reason could be his teaching.  He went by his notes and I didnÂ’t use my textbook at all.  His notes are really the bible to organic chemistry II and if you want to do well in the class I suggest you write over the reactions numerous times until you see electron movement in the mechanisms when you sleep.  Even though Professor Leighton is an awesome professor it doesnÂ’t save you from the other premeds you see at the library everyday with their o chem books and notes.  I have to say in this class there is almost no curve.  The other downside is that the final can ruin your grade if you have been doing well all semester, since itÂ’s worth 45%.  It may seem unfair, but with a class size of almost 200 students it is hard to grade everyone fairly.  All I have to say is study really really hard for the final, so it doesnÂ’t bring you down.  If you want to learn Orgo II well take it with Professor Leighton because the class will be only a few of the premed classes that you will actually enjoy.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 30, 2005",
            "review_content": "\nLeighton is a great teacher. His lectures are filled with a ton of information so make sure to come to every class and take very good notes if you want to do well. If you write down everything he puts up on the board, and study it for the tests you will probably do well. Although everyone says Orgo II is harder than I, I found II to be much easier because Leighton is such a good teacher. HW doesn't count for more than 5% of the grade, the 3 midterms are 45% and the final is 50%. Take Leighton. \nWorkload:\n9 Problem sets, 4 midterms(one dropped), 1 final\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 27, 2005",
            "review_content": "\nProf. Leighton is the best orgo teacher you can have! He gets through all the required material and the notes are amazing and organized. He is very clear and does not digress. He doesnÂ’t expect you to memorize useless pKa values like Cornish did but there is still tons of memorization, but thatÂ’s orgo for ya. The only bad thing about the class is it is total cutthroat competition. Grading is BRUTALLY fair, which ends up disappointing. I did above avg on every midterm (except for the one I dropped) and the final and ended up with a B+ meaning that the class is curved around a BÂ…very brutal. But I guess this is the way it is at Columbia, when a teacher is good they expect their students to know their stuff and it is more likely that they will, so it is crucial that you stay ontop of the material. Despite this I highly recommend Leighton. If you take orgo do not miss out on an opportunity to be in his class. \nWorkload:\nWeekly or bi-weekly homeworks, only a few of which are collected and graded on a check scale (5%). Four midterms, one can be dropped (45%). One final (50%). All quite fair. \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 26, 2004",
            "review_content": "\nWe can glorify Professor Leighton for all the things listed below, and oh how true they are, but one key difference between Leighton's Orgo and just about every other class in the department has not been brought to light. The things he emphasizes in lectures are given exactly proportional attention on the exams, granting students the satisfaction of knowing that long study hours paid off. And he doesn't do this by taking exam questions straight out of the lectures -- rather, he makes it perfectly clear in the problems, often with a friendly hint, which of the many concepts he teaches he wants you to apply. Exams vary in difficulty, and so do the grades -- one of the consequences of such organization and clarity is that you'll really kick yourself for not getting something when you realize looking at the key that it was so simple and straight out of the notes. One more thing -- when you finish Orgo 1 with Cornish or Katz, just burn your textbook, because its convoluted and incomplete, and Leighton's material is so much better and more interesting, and of course, much more relevant to exam stuff.\nWorkload:\nDo the practice tests! They are so similar to what the real exams will look like. I wouldn't say the load is light. It is demanding, but he enables you to make progress with every minute you spend -- rework the problem sets, and be sure you always know where you are in terms of his lecture material.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 26, 2004",
            "review_content": "\nWe can glorify Professor Leighton for all the things listed below, and oh how true they are, but one key difference between Leighton's Orgo and just about every other class in the department has not been brought to light. The things he emphasizes in lectures are given exactly proportional attention on the exams, granting students the satisfaction of knowing that long study hours paid off. And he doesn't do this by taking exam questions straight out of the lectures -- rather, he makes it perfectly clear in the problems, often with a friendly hint, which of the many concepts he teaches he wants you to apply. Exams vary in difficulty, and so do the grades -- one of the consequences of such organization and clarity is that you'll really kick yourself for not getting something when you realize looking at the key that it was so simple and straight out of the notes. One more thing -- when you finish Orgo 1 with Cornish or Katz, just burn your textbook, because its convoluted and incomplete, and Leighton's material is so much better and more interesting, and of course, much more relevant to exam stuff.\nWorkload:\nDo the practice tests! They are so similar to what the real exams will look like. I wouldn't say the load is light. It is demanding, but he enables you to make progress with every minute you spend -- rework the problem sets, and be sure you always know where you are in terms of his lecture material.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 19, 2004",
            "review_content": "\nIf you are going to take the 2nd semester of organic chemistry, take it with Professor Leighton. He is a very straightforward lecturer, and his sort of intense clarity may make him seem a little cold, but he turns out to be a very nice guy as well as a good teacher. A lot of material is covered in this class, but Professor Leighton gets through everything, and makes it all as simple as it can be. He is definitely helpful in office hours (as are the TAs), and like the other reviewers say, he is interested in helping you, not in failing you. His test questions can be a little tricky, but they are fair. Professor Leighton seems to know everythign there is to know about the subject, and he expresses his knowledge extremely well. He is always very prepared, which makes him easier to follow. After taking organic chemistry II with him, I wouldn't want to take it with anyone else.\nWorkload:\nThey workload is definitely reasonable. There are 4 tests (your worst one is dropped), and a final. There are 4 \"graded\" problem sets (as well as 4 ungraded ones), but they are not closely graded--if your answers are even reasonably correct, you will get a \"check-plus.\" There are no recitation quizzes or anything like that. He gives \"reccommended problems\" to do in the textbook, which are often helpful, but not required.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 11, 2004",
            "review_content": "\nProfessor Leighton is by far one of the best pre-med professors I've had.  I agree with the other review that there is a great deal of competition in this class but that's true of any class, especially the pre-med requirements.  Leighton's concern for his students is evident from day one when he tells you that he is not out to make this a pre-med weeding out course but is more interested in you learning the material.  He takes his time to draw out mechanisms carefully and throughly explain things.  If you still have questions, his TA's were great and he is always available either by email or in his office hours.  He also would hold extra office hours before exams and tried to ensure that you had every opportunity to get all your questions answered.  He's a great lecturer and cracks the occassional joke.  I HIGHLY recommend taking his course.  I really enjoyed it and I know a lot of other people that did too.  From his class, I've started to consider becoming a chem major (a sentiment felt by others as well).\nWorkload:\nWorkload is fairly light.  4 exams and you get to drop your lowest of those 4.  Also a final (can't drop any part of that) worth 45% of your grade.  He gives you 2 problems sets before every exam (so 8 total) but only every other one of them is actually graded.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 10, 2001",
            "review_content": "\nIf you're not a pre-med or some sort of science major then stay as far away from this course as possible. Expect high levels of competition amongst students as many are vying for spots in highly competitive med schools. Professor Leighton is a great teacher. You probably won't realize it until the end of the course when you're studying for the final, but he really does a great job of tying together an enormous amout of material. Professor Leighton breaks from the traditional mold of a teacher of a pre-med required class in that he's not out to get you, he's there to help you.\nWorkload:\nExpect 4 exams, approximately 5 graded problem sets and a final exam. Exams were extremely fair as is the grading process.\n"
        }
    ]
}