{
    "prof_info": [
        {
            "prof_name": "Anjana Sangar",
            "prof_id": 2049,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "December 24, 2005",
            "review_content": "\nI have never met anyone talk more about being a good teacher without ever really teaching anything.  However, Professor Sangar is an extremely nice lady.  She does seem to genuinely care about her students which is nice.  She even brought in food for us a few times.  This doesn't get you very far when you're trying to learn Hindi though.  We only really went through the workbook about 2/5 hours per week with the rest of the time filled with useless conversation about how accomplished she is, how much people love her, and general life lessons for us to follow.  During class it seems funny, but when you're trying to do the homework and studying for the quizzes you'll remember that you were actually supposed to learn Hindi.  The 2 hours that are spent going throught he workbook aren't really even too helpful.  You read a conversation once and then you wait for the rest of the class to read the same conversation.  If you already know Hindi and are just taking the class to learn to write, the class is fine but a bore, but if you want to learn to speak the language: STAY AWAY.  Very little is learned about Hindi, but a lot is learned about the greatness and the widespread love the world has for Professor Sangar.  I was unaware of this, but apparently she is an Indian icon, or so her stories go.  The only reason I learned anything in that class were the weekly TA sessions with Andrea.  She was wonderful at explaining things and very helpful.  I learned more with her in 1 hour than I did in a week with Professor Sangar.  If you want to learn Hindi, look for another professor.\nWorkload:\nDaily Homework that is due when you want it to be due.  It all has to be in by the end of the semester but she is leniant as to the dates in between.  Quizzes: 4 quizzes that are easy if you know the language, but hard if the only expose you really have is in Professor Sangar's class\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "April 27, 2004",
            "review_content": "\nAnjana-ji is very friendly and approachable, and she cares a lot about her students... she is constantly arranging special activities and trips, cooking homemade indian food, and spends considerable amounts of time imparting advice and general life lessons.   She is a very entertaining, funny, sweet woman, who misses no opportunity to burst into song... class is never boring with anjana-ji.  However, you also don't learn very much.  Her handwriting is practically illegible, and her english poor enough to cause considerable communication problems (eg she NEVER understands the questions people ask her in class).  Very little emphasis is put on speaking, so don't expect to be able to carry on even the most basic conversation unless you have previous exposure to the language.\nWhich brings us to the final point-- Anjana-ji definitely gears the course towards the students of South Asian descent.  This can be a real problem in many ways, but most significantly, it segregates the class.  Non-indians end up feeling very isolated, marginalized, and unwelcome.  Although I have great affection for Anjana-ji, I would have to recommend that students wanting to learn Hindi enroll in one of the other sections.\nWorkload:\nDaily homework, and approximately four longish quizzes throughout the semester.  No midterm or final.  She is a VERY lenient grader.\n"
        }
    ]
}