{
    "prof_info": [
        {
            "prof_name": "Garrett Ziegler",
            "prof_id": 2269,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 04, 2007",
            "review_content": "\nI completely agree with the other reviewer who gushed. CC was life-changingly wonderful, partly because of my smart classmates, but mostly because of Garrett. Every discussion was impeccably moderated, interesting, and challenging. \nGarrett's selections of extra readings were fabulous and diverse. CC is by far the best class I've taken, ever, and I think about our discussions and the texts we read all the time. I'll just reiterate some of the things the other reviewer said; Garrett actually cares deeply about what you say and think and write, and therefore makes you care even more. He's completely brilliant about basically everything you could want to know or talk about. CC has truly been one of the best experiences of my life.\nWorkload:\nFair, and even if some days there's a lot of reading, it's all fascinating.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 25, 2007",
            "review_content": "\nThis is the best class I've ever taken in my life, and 90% of it has to do with Garrett. I know that most of my class feels the same way. He is such an incredible teacher and a really wonderful person. He always takes you seriously (and I've really said some ridiculous things), he makes you feel comfortable talking in class or in person, he is patient and caring, and though he knows so much and is so brilliant, he is humble and wants to learn from his students. I have never had such an experience before. He is not out to prove anything like most teachers are, and he listens to everything his students say and reflects on them. I learned to take myself and my words as seriously as I do now because he did. He will write pages of comments on your papers and is always available to talk about them; he sends his class information about upcoming talks that he think would be useful or interesting; he sents out NYtimes articles almost twice a week that pertain to our readings. He is SO lax about deadlines, and he can be, because his students respect him so much; he doesn't have to demand control over his class because they way he teaches it is so compelling that you can't help but do all the work. I really can't say how lucky I am to have had this experience. Yours will be wonderful! Take ANY core class you can with Garrett. You will really be getting 110% out of the course.\nWorkload:\nusual CC reading. sometimes adds more reading. a very fair, on the lenient side, grader. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 20, 2007",
            "review_content": "\nMr. Ziegler is a wonderful teacher. He knows everything about everything, he's sensitive, he emails you back within a few hours, he's generous with his time, he spends a lot of time grading papers and comments on every sentence so you really learn a lot, he forces you to work hard, asks all the right questions in class, and best of all, he takes his students very seriously. He never let discussions spiral into those annoying abstract conversations. He is friendly in class, and if you're shy about participating, he doesn't put you on the spot at all. He is definitely a no BS kind of guy, so you really need to think about what you say and write, but I have learned so much from him and particularly because of this. He works hard preparing the syllabus and class discussions, and he makes himself available to talk about paper ideas, or anything really. You should absolutely try to get him for a core class. I think the experience I had in his class is the kind that Columbia intends students to have, if it's not too corny to say.\nWorkload:\nNot at all a lot of reading, but class is intense. sometimes forgets to give breaks. sort of a tough grader--actually, a very fair grader. but well worth it\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 20, 2007",
            "review_content": "\nMr. Ziegler is a wonderful teacher. He knows everything about everything, he's sensitive, he emails you back within a few hours, he's generous with his time, he spends a lot of time grading papers and comments on every sentence so you really learn a lot, he forces you to work hard, asks all the right questions in class, and best of all, he takes his students very seriously. He never let discussions spiral into those annoying abstract conversations. He is friendly in class, and if you're shy about participating, he doesn't put you on the spot at all. He is definitely a no BS kind of guy, so you really need to think about what you say and write, but I have learned so much from him and particularly because of this. He works hard preparing the syllabus and class discussions, and he makes himself available to talk about paper ideas, or anything really. You should absolutely try to get him for a core class. I think the experience I had in his class is the kind that Columbia intends students to have, if it's not too corny to say.\nWorkload:\nNot at all a lot of reading, but class is intense. sometimes forgets to give breaks. sort of a tough grader--actually, a very fair grader. but well worth it\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 20, 2007",
            "review_content": "\nMr. Ziegler is a wonderful teacher. He knows everything about everything, he's sensitive, he emails you back within a few hours, he's generous with his time, he spends a lot of time grading papers and comments on every sentence so you really learn a lot, he forces you to work hard, asks all the right questions in class, and best of all, he takes his students very seriously. He never let discussions spiral into those annoying abstract conversations. He is friendly in class, and if you're shy about participating, he doesn't put you on the spot at all. He is definitely a no BS kind of guy, so you really need to think about what you say and write, but I have learned so much from him and particularly because of this. He works hard preparing the syllabus and class discussions, and he makes himself available to talk about paper ideas, or anything really. You should absolutely try to get him for a core class. I think the experience I had in his class is the kind that Columbia intends students to have, if it's not too corny to say.\nWorkload:\nNot at all a lot of reading, but class is intense. sometimes forgets to give breaks. sort of a tough grader--actually, a very fair grader. but well worth it\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2005",
            "review_content": "\nThe best.  The nicest, smartest, most caring UW teacher I can imagine.  He's very accomodating and insightful.  He will respond to your drafts with extremely helpful and thoughtful comments that give your no-matter-how-shitty-\ndrafts a chance to receive a good grade.  A fair grader, you will not get an A without serious revisions of your papers.  As long as you do the work thoughtfully, no matter how bad a writer you are, you can still do well.\nWorkload:\nIn comparison to friends, less work than other UW sections, but still similar.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 11, 2005",
            "review_content": "\nGarrett is absolutely amazing! Everyone truly loved him and he is very  knowledgeable in many areas. If you put effort into his class and do the readings and participate in class it will help a lot. He is generous with grading but makes you think.. you need to work for the A. He keeps class interesting and has a great sense of humor. He is strict with peer-reviews, but will on occasion extend due dates and is very accessible and willing to work with students on a rough draft of a paper. If you have him, keep him. :)\nWorkload:\nThe usual uni writing load... readings and short writing exercises.. 2 papers, CCP project, and 1 reflective essay - a toal of 4 papers.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 17, 2004",
            "review_content": "\nIn my opinion, Garrett is the best that you can get for this core class. He is very intelligent, and knowledgeble about so many different areas and subjects that at times it can be a little intimidating! Yet, at the same time, our class was never boring, the discussions were always animated and interesting, and he has a great sense of humor. He also spends as much time reading and commenting on your essay as you spend writing them, and I feel that he is a very fair grader. He gives very helpful comments, is also available to meet with, and really helps you improve your writing. I think that pretty much my whole class respected him and enjoyed our discussions. My only complaint was that we fell a little behind in terms of when our papers were assigned and due, but this was partially because our class got so involved in discussions that we spent a little too much time on the articles in the begining of the class than we should have. Another good thing: unlike most UW teachers, 'peer review' for our class was completely anonymous, so that your paper was not torn apart in class, which I really appreciated. \nWorkload:\nYes, you have to work hard for this class, but it is completely worth it. However, if you are just looking for a class that will be an easy A, BS-ing class, this is not the class for you. In the begining, one to two short papers and reading a week, later in the semester three big papers, a group project, and a retrospective paper. I can't stress this enough though: if you have the chance to take Garrett's class, take it!!!\n"
        }
    ]
}