{
    "prof_info": [
        {
            "prof_name": "Banu Baydil",
            "prof_id": 13011,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "W3600 Introduction to Probability and Statistics",
            "review_date": "April 27, 2015",
            "review_content": "\nTook her stats with calc class...worst decision of my life. She is absolutely awful.  Every class is her reading a powerpoint of slides that the book has provided.  She reads them verbatim.  Doesn't teach shit.  Never have i ever been less inspired by a person to learn and more inspired to copy homeworks.  She's just damn awful in every sense.  Super nice and is probably super cool outside of class but she will screw you over.  Gives a problem set once a week, super long and very hard.  Copy it online or you'll get a shitty grade.  \nheres the thing...she USED to be cool.  she used to be the best...take home midterms, 100% on homework upon minor completion but the school got on her back for giving out too many A's so she had to crack down and she cracked down hard.  Offers no help whatsoever in anything.  If you have no stats background prior to this class, get a tutor ASAP or drop it, take an intro class with a bunch of very basic concepts and then take this class for the major requirement.  If you go into this blind you get a bad grade.\nWorkload:\nproblem set once a week, three midterms and a final\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 16, 2015",
            "review_content": "\nBanu. Banu. Banu. The best and worst teacher you will ever have. \nNote: She will most likely not be able to run her class the same way. The department will probably make her grade differently. Unless someone tried really really hard, I doubt there were any Bs in her class. \nBut for our class, which was her first class at Columbia, it was beautiful. Two midterms and a final, but she will drop your lowest out of the three. Our first two midterms were take-home, with extra credit, and many questions copied right from the book. Most of the class did not even go to the final. Homework also easy and mostly from the book with lots of extra credit. Annoying group project at the end but if you showed even the slightest amount of effort (turning in a draft), you were set. EASY EASY EASY. This class helped my GPA incredibly. \nFor the downside, you will not learn any Stat. We spent the first month and a half on chapters 1-2. So she was stuck \"teaching\" the really difficult material incredibly quickly. (Today class, we will do chapters 5,6, and 7). Because of her grading policy, no one bothered to learn anything after the midterms. And since they were take home midterms, no one bothered to learn anything anyways. You're screwed for econometrics. \nWorkload:\n2 midterms, 1 final- lowest dropped\nHomework- from book with extra credit, 90% buffer \nAttendance, 90% buffer (what the heck is wrong with her) \nProject- not so hard\nIf you talk to her (she's really nice), and go to her office hours, and talk in class you can easily get an A+\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 03, 2015",
            "review_content": "\nI found Professor Baydil to be a kind, generous instructor who recognizes that W1111 is an introductory course and does not try to push her students too hard. Baydil often responded to student requests for extra time with problem sets positively, and was open to changing dates as students requested. I highly recommend this course - while the class was dull at best, it was not hard to get an A, and Baydil was pleasant and responsive to student queries. If you speak occasionally and sit in the front/middle, she will favor you and will be incredibly friendly. Not a challenging course for non-math/science majors.\nWorkload:\n3 exams, about 7 short problem sets, 1 final project. She drops the lowest exam grade, and our first midterm exam was take-home. VERY reasonably graded, she is straight-forward in her expectations and doesn't put surprises on the exams. Our final contained reiterated problems from the second midterm with the numbers switched. Attendance was taken once (but is a large part of the final grade, so attend).\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 03, 2015",
            "review_content": "\nI found Professor Baydil to be a kind, generous instructor who recognizes that W1111 is an introductory course and does not try to push her students too hard. Baydil often responded to student requests for extra time with problem sets positively, and was open to changing dates as students requested. I highly recommend this course - while the class was dull at best, it was not hard to get an A, and Baydil was pleasant and responsive to student queries. If you speak occasionally and sit in the front/middle, she will favor you and will be incredibly friendly. Not a challenging course for non-math/science majors.\nWorkload:\n3 exams, about 7 short problem sets, 1 final project. She drops the lowest exam grade, and our first midterm exam was take-home. VERY reasonably graded, she is straight-forward in her expectations and doesn't put surprises on the exams. Our final contained reiterated problems from the second midterm with the numbers switched. Attendance was taken once (but is a large part of the final grade, so attend).\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 03, 2015",
            "review_content": "\nI found Professor Baydil to be a kind, generous instructor who recognizes that W1111 is an introductory course and does not try to push her students too hard. Baydil often responded to student requests for extra time with problem sets positively, and was open to changing dates as students requested. I highly recommend this course - while the class was dull at best, it was not hard to get an A, and Baydil was pleasant and responsive to student queries. If you speak occasionally and sit in the front/middle, she will favor you and will be incredibly friendly. Not a challenging course for non-math/science majors.\nWorkload:\n3 exams, about 7 short problem sets, 1 final project. She drops the lowest exam grade, and our first midterm exam was take-home. VERY reasonably graded, she is straight-forward in her expectations and doesn't put surprises on the exams. Our final contained reiterated problems from the second midterm with the numbers switched. Attendance was taken once (but is a large part of the final grade, so attend).\n"
        }
    ]
}