{
    "prof_info": [
        {
            "prof_name": "Morgan Luker",
            "prof_id": 1982,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 16, 2005",
            "review_content": "\nMorgan is one of the nicest teachers I have encountered  here at Columbia. I was really nervous about taking this class and he made it not only painless but very enjoyable. He is a great teacher and delivers very clear and interesting lectures. His class is very relaxed, and if you do the work he assigns (which is minimal), you will have no problems at all and you will learn a lot. You will be very lucky if you can get into his section!\nWorkload:\nVery reasonable. The readings are not too long, and the concert reports are fun. If you do the readings and go to class, the exams are pretty easy.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 10, 2005",
            "review_content": "\nMorgan is awesome. He is sometimes unitentionally funny and its adorable when he gets nervous in class. He is a grad student so he often comments on how hes had too much caffaine or that he has his own tests to worry about. He is really passionate about musicology and its cute when he gets irritated at the lack of time for the material and the class. He is fun and keeps your attention. \nHe structures his class in a very straight-forward way. Hes pretty organized and makes the material extremly clear and understandable. He is really accomodating with office hours and is very willing to help. Hes a bit of a psuh-over and if the class wants something (say a section to be excluded from the test) he'll most likely give in. He presents the material very much like the book so you are really never confused as to what you need to know for the tests. \nHe brings in his friends who sing songs live that we are studying and supplements the class with his own materials which are never on the test. \nThe concert journals are his alternative to a 10 page dull paper (thank you morgan!). Badically, you go watch 5 concerts and write your observations on them. An easy way to get points and also its really interesting to go hear different live music and actually be able to intellectually talk baout it. This class was awesome and I loved Morgan!\nWorkload:\nVery very straight-forward mid-term and final. No tricks, just material straight from class and book. 5 concert reports which are easy and actually fun to do. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "October 18, 2004",
            "review_content": "\nMorgan is the coolest teacher I've had here -- he's a very Brooklyn kind of guy (that's were he lives) -- and although he's pretty passionate about the music, he's very relaxed about class. his specialty seems to be jazz so if you can just hold out until you get there (the beginning of the sylabus is all chants/ hymns) you will be in for a pleasant surprise. seriously hot.\nWorkload:\nmedium-rare\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 27, 2004",
            "review_content": "\nReally cool guy, very laid back.  Very knowledgable about music; incorporates fun material into class.  Really good looking too.  Gets you interested.  He's funny too.\nWorkload:\nPretty light.  Definately manageable.\n"
        }
    ]
}