{
    "prof_info": [
        {
            "prof_name": "Jan Vecer",
            "prof_id": 1368,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Stochastic Processes: Applications I",
            "review_date": "January 19, 2010",
            "review_content": "\nThough i've only been here for a semester, Jan Vecer (G6501) was my favorite professor. Though perhaps his personality might disagree with some, he is a funny, lively, intelligent professor that teaches the material pretty well. Though often he teaches from the book, it is still helpful when he explains the concepts in a new way. he moves fairly quickly through the material, and at the end of the semester, you feel like you actually have learned something. \nBe prepared that he not the professor that will invite you to chat in his office hours, but if you are open minded you will enjoy his sarcastic jokes and attempts at showing the real world applicability and examples of the topics that he teaches.\nWorkload:\nThe workload is very small, 2 tests and 1 final. No homework/quizzes/nothing. The test are pretty straightforward and if you did pretty much any studying you should be fine. My final was a little trickier and I thought was more centered on the last 2 days of class but still was not bad. \n"
        },
        {
            "course_name": "SIEO 4105",
            "review_date": "May 08, 2006",
            "review_content": "\nProfessor Vecer is one of the best professors I have had at Columbia.  Don't get me wrong, his class is faced paced, his goals are unclear, and there is no syllabus.  Despite these minor inconveniences, Professor Vecer truly gets the students to think in terms of probability.  The  class was mainly composed of grad students, but he still managed to keep it comfortable for the undergrads.  He is not an easy grader, often giving little or no partial credit, but that is only a problem if you do not understand the material (which is all available in the book).    Also, all of his tests and quizzes are open book and open notes, and he gives lots of guidance DURING the test as to how to solve the problems (for one problem he gave the exact method, all you had to do was fill in the numbers).\nWorkload:\nOccassional problem sets (4-5 problems each, don't count for much, always get full credit just for turning it in), 2 midterms (open book/open notes), 1 final (open book, open notes)\n"
        },
        {
            "course_name": "Probability",
            "review_date": "April 28, 2006",
            "review_content": "\nVecer is an awful professor and a jerk. He claims that he \"teaches from the book\", but what he actually does is copy the book verbatim and offer no additional insight. (I might also add that the book, Sheldon Ross's Introduction to Probability, is a terrible, confusing text.) Vecer's core belief is that you either have an intuition for the material or don't; in either case, he is absolved from his responsibility of teaching (or even trying to do so). He does no preparation for the class whatsoever, other than bring the book with him. He's also completely disorganized and blatantly puts zero effort into class. There's no syllabus, no dates for exams, no homeworks posted in advance, no practice tests, nothing. \nOn top of this, he finds students annoying and treats them like crap. I once went to him after class with a real, academic question (not some BS about late homework or whatever). Instead of answering my question, or, God forbid, showing an interest in one of his students, his put on his iPod, started walking away from me, and told me to go to the TA's office hours. He also doesn't have set office hours (\"by appointment only\"), and he has a habit of not responding to your email until just after your requested time has passed.\nIn short, he's not only the worst professor I've had, but also one of the biggest ass***** I've met in my entire life. Everyone involved would be happier if he left Columbia.\nWorkload:\nNot bad. Problem sets were generally short and fairly easy. Exams weren't that hard.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "December 05, 2003",
            "review_content": "\nThe fact that this guy is still teaching makes me doubt the sincerity with which Columbia reviews teacher evaluations. Jan Vecer teaches straight out of the book, gives homework out of the book, and tests on something totally different. In my opinion, he honestly believes that either you get it or you don't and if you don't understand the material you shouldn't be in the class (kind of defeats the purpose of teaching...). Unless you have a very good understanding of prob. stats, avoid this class.\nWorkload:\n6 problem sets, midterm, final.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "October 06, 2003",
            "review_content": "\nOut of the 25+ professors I have had, Professor Vecer is absolutely the WORST professor I have ever had.  First, the syllabus he provides is so ambiguous (he states that we will cover each topic in the textbook).  Secondly, his teaching style is not helpful at all.  He quickly covers each topic providing a few very easy examples (which always seem to involve dice) and then excepts you to be a professional statician for the exams.  His antipathetic nature towards his students deserves no approbation.  I believe a professor like Jan Vecer should not be allowed to teach since his whole attention is focused on his research probably.  He has no place being in a classroom.  How does he keep his job?  If you really want to learn statistics and be tested on your knowledge, I would recommend NOT taking this class . . . the exams do not test your knowledge of what you learned.  You can study the book from page one till the end and do all the questions and still manage to fail the course!!  Please, please, if not for yourself, but for me, do not take this class.  \nWorkload:\nFive HW assignments -- fairly ok.  2 midterm exams -- incredibly hard and 1 final exam -- even more difficult.  He does not curve grades.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "October 06, 2003",
            "review_content": "\nOut of the 25+ professors I have had, Professor Vecer is absolutely the WORST professor I have ever had.  First, the syllabus he provides is so ambiguous (he states that we will cover each topic in the textbook).  Secondly, his teaching style is not helpful at all.  He quickly covers each topic providing a few very easy examples (which always seem to involve dice) and then excepts you to be a professional statician for the exams.  His antipathetic nature towards his students deserves no approbation.  I believe a professor like Jan Vecer should not be allowed to teach since his whole attention is focused on his research probably.  He has no place being in a classroom.  How does he keep his job?  If you really want to learn statistics and be tested on your knowledge, I would recommend NOT taking this class . . . the exams do not test your knowledge of what you learned.  You can study the book from page one till the end and do all the questions and still manage to fail the course!!  Please, please, if not for yourself, but for me, do not take this class.  \nWorkload:\nFive HW assignments -- fairly ok.  2 midterm exams -- incredibly hard and 1 final exam -- even more difficult.  He does not curve grades.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "December 19, 2002",
            "review_content": "\nVecer is the worst teacher ever in Columbia. He teaches directly out of the book but then he gives exams that are out of this world. Don't ever take this guy. He is so bad and lazy. The worst thing about him is that he changed the syllabus everyday. Is it fair to entirely change the syllabus after you decide to take the class because of the syllabus. Honestly, Vecer is the worst teacher and the most superficial Professor at Columbia. STAY AWAY. STAY AWAY. STAY AWAY.\nWorkload:\nHe changes it every day so who knows what his next class will have.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "December 19, 2002",
            "review_content": "\nI don't know if he's really the worst professor ever.  (Maybe it's just that I had him the same semester as the professor who is really the worst ever, so he seemed better by comparison.)  He certainly seemed inexperienced.  The whole structure of the class was very disorganized.  He kept switching around the specifics of the grading and assignments.  He taught totally from the book, so going to class was more or less optional.  If you did choose to go, he did his best to answer questions (his English is more than adequate, by the way).  The most frustrating part was his inability to manage time over the course of the semester.  We went way too slowly at the beginning and had to skip some important material at the end.  If he actually took the time to prepare lectures that did not involve teaching every word of the book, he might be a decent professor.  He's certainly not a bad guy either way (sort of oddly funny), so there's a decent change he'll be better next time around.  Right now, though, he's certainly mediocre at best.\nWorkload:\nNot bad.  We had two \"quizzes\" (basically midterms) and a final, in addition to about six homework assignments that were not long.  Some questions on the exams were tough, but they're all open book (and if you REALLY understood the material, they were doable).  They were all curved, and he was willing to listen when people complained.\n"
        }
    ]
}