{
    "prof_info": [
        {
            "prof_name": "Christine Cynn",
            "prof_id": 1807,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Medicine & Power in African History",
            "review_date": "May 18, 2009",
            "review_content": "\nI was warned in advance, so it's my own fault for taking the course, but Cynn is definitely sort of scary. If discussion is not going the way she wants it to, she will tell you either a) that you're wrong b) that you're staying on the surface too much and that you need to dig deeper or c) that you are presumptuous. It's a lot of course material in a short period of time, so be prepared to read EXTREMELY THOROUGHLY and take notes for discussion. She strongly encourages students to come to her office hours, and she is extremely knowledgable. The material is fascinating, but she might be too harsh to make this class worth it for most students.\nWorkload:\n200-300 pages reading each week, 2 moderated classes, 1 paper ~10 pages, 1 paper ~15 pages\n"
        },
        {
            "course_name": "Theorizing Women's Activism",
            "review_date": "March 03, 2009",
            "review_content": "\nI can understand why some other reviewers might have found Cynn a bit harsh because at first I felt the same way but we had a small seminar of about 8 people and she really grew on me. I think Cynn is an extremely intelligent and caring professor. She would always find any time to meet with you about a paper and was lenient about deadlines if you were having personal issues, she even offered extra credit opportunities. Probably the best thing about her is she was so enthusiastic about intriguing us as students that when we started doing a class research project that we all were very into she totally restructured the course to accommodate that. One of the other most impressive things about her was that when we wrote papers in stead of just giving us grades she wanted us to learn to write better and interpret theory better so she gave great comments and was willing to take rewrites. Bottom line this woman cares so much about students and totally gets the point of teaching. \nWorkload:\nThree papers, the first two are short and the third is longer. She helps you with all of them and is very communicative when guiding you through the process. The course requires you do outside activism in a feminist related cause which is totally amazing and more classes at Barnard should require it. \n"
        },
        {
            "course_name": "Medicine & Power in African History",
            "review_date": "May 30, 2008",
            "review_content": "\nProfessor Cynn is, truthfully, one of the most intelligent and competent instructors I have ever had the pleasure of meeting.  I took a seminar with her this past spring; though the coursework was challenging, I learned and retained more from her class than I did in any other during my four years at Columbia.  Cynn teaches you how to think differently, address issues from different, previously unexamined angles, and write with greater clarity.  She encourages class discussion, and while her intellect can be extremely intimidating, I felt more comfortable talking in this seminar than I did in any other course.  I would recommend taking any and all classes possible with her--she's excellent.  Her grading is tough but fair, and if you put a lot of work into the class, you'll end up successful.  Meet with her during office hours about papers--another thing I never felt comfortable doing with professors before this class--and she'll really help you with any struggles/issues you're having on your paper.  \nWorkload:\nTons of reading--the class met once a week, and we had upwards of 200 pages per week.  One short paper (7 pgs), one long paper (15 pgs), two in-class presentations on weekly readings, mandatory participation.\n"
        },
        {
            "course_name": "Gender, HIV & AIDS; Postcolonialism",
            "review_date": "January 23, 2008",
            "review_content": "\nProfessor Cynn is the most PHENOMENAL professor I have encountered at Columbia. I was really surprised by previous reviews of her. She is intelligent - as in she knows everything about the courses she teaches and almost everything else. She is an extremely caring professor who will go the extra mile to help you gain a better understanding of the issues in the course and will assist you in any way you need with summer jobs, post grad plans etc. I learned more in my classes with her than most of my other classes put together. It is under her tutelage that I learned what critical thinking really meant. At the end of last semester, the entire class spent half an hour brainstorming our evaluations to ensure that is worthy of her and half of the class is taking Medicine and Power in Africa with her this semester - we love her that much. If you have the opportunity to take a course with her, don't pass it up - a professor like her is why you pay the astronomical tuition. \nWorkload:\nIt's always a ton of reading, you can get away with not doing all of it, but you need to do most of it, she can smell bs a mile away. She is big on presentations, which are largely informal. There is usually a short paper and a longer research paper, consult with her as much as possible and take it very seriously, while she is a fair grader, like I said before she has a really strong BS detector so don't hand in a rush job. you won't get an A, but an A- is feasible and even a B+ will most likely feel like a gold medal, it's one of those classes where you learn so much, the grade doesn't even really matter.\n"
        },
        {
            "course_name": "Asian American Women",
            "review_date": "October 24, 2007",
            "review_content": "\nI can't stress how great this woman is!  She is truly invested in her students and their ideas.  She makes a genuine effort to look at texts in a deconstructive, non-simplistic way.  She seems a bit intimidating at first, but once you get to know her, she's really a doll!  Since our class was small, she used to let us bring food.  She even bought us all Chinese food once!  Class seemed more like a fun, easy-going discussion than a \"serious\" academic course, even though the concepts/conflicts we discussed were often highly complex.  \nShe does demand a lot from her students intellectually, but that's not atypical of Barnard/Columbia professors.  The readings for this class were FANTASTIC!  The syllabus consists mostly of immigrant novels.  Take this class if you want to have FUN and if you want to be challenged intellectually.  \nWorkload:\nAbout a book a week, but most of the readings were great.  You also have to watch 2 or 3 films, but those were usually good too.  One 5-7 page paper, and one 15 page research paper.  Cynn is also a VERY fair grader.\n"
        },
        {
            "course_name": "First Year English: The Americas",
            "review_date": "August 09, 2005",
            "review_content": "\nHer style is hard to get used to at first -- she's something of a speed-talker -- but once everyone settles in, the class is fine.  Not great, not awful, just fine.  Only speak up if you have something interesting to say.  The reading sounds like a lot on the syllabus, but you can get away with doing part of the reading if you think you'll be able to talk about it.  She takes MLA format very seriously.  Above all, take her suggestions on your first drafts!  They're not usually detrimental to whatever Vision you had in the first place, and it definitely helps in the final grade.\nWorkload:\nTwo 4-6 page papers, one 8-10 page research paper -- two drafts per paper.  Reading for every class.\n"
        },
        {
            "course_name": "First Year Seminar",
            "review_date": "June 10, 2005",
            "review_content": "\nAside from being a cruel hypocrite, she's damned BORING! Claims she enforces all rules of the syllabus and will fail you at the strike of the clock but then lets certain students show up late every day, turn in papers a week late, and basically do whatever they want. Clearly an intelligent scholar, except, she never shares any of her knowledge with the students struggling to make the required number of comments per discussion. In short, a rude, cold woman with little interest in the education of anyone but herself. \nWorkload:\nnot demanding. just boring.\n"
        },
        {
            "course_name": "Feminist Texts I",
            "review_date": "May 04, 2005",
            "review_content": "\nHighly recommended class-- the readings are interesting and the subject matter fabulous!  With that said, do yourself a big favor and take the class with a professor other than Cynn.  Class discussions seemed to lag, and most importantly, her grading is absoltulety erratic; not only is she impossible to please but there is little consistenancy.\nWorkload:\n2 five page papers (you may select topic from five or so essay questions), 1 fifteen page research paper due the last week of classes... managable workload, however, her grading system is TERRIBLY IRREGULAR and DIFFICULT.\n"
        },
        {
            "course_name": "First Year English: The Americas",
            "review_date": "December 07, 2003",
            "review_content": "\nProf. Cynn is very, very intelligent and can seem a little intimidating because she just knows everything.  Her class is very business-like and she never says anything that isn't related to the work at hand.  This is probably good if you like that sort of learning environment, but if you are looking to have a friendly teacher-student relationship, you will be disappointed.  I actually found her to be sort of creepy, but maybe that's just me.  The work isn't too daunting -- except when she assigns a paper and a TON of (unrelated) reading at the same time.  All in all, the class discussions can be fun, but that has way more to do with the students than the teacher.  Also, her grading is fair but her comments on essays are sometimes annoying.\nWorkload:\n2 essays, 1 huge research paper, tons of reading, and several extra-credit papers based on required outside lectures.\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "November 20, 2003",
            "review_content": "\nshe's intense, but very good.  a pretty demanding class (lots of reading, okay amount of writing).  she's super intelligent, which is great because she adds a lot to discussions.  class can be boring (mainly, when you dont do the reading...), but overall not bad.  \nWorkload:\ntwo papers, one research paper, a few short responses to lectures....not that bad\n"
        }
    ]
}