{
    "prof_info": [
        {
            "prof_name": "Kentaro Kaji",
            "prof_id": 2005,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Bodies and Spaces Over Time: America's Obesity Problem After 1945",
            "review_date": "May 29, 2004",
            "review_content": "\nThe previous reviewer hits the nail on the head, or perhaps it's the cow on the flesh. What I appreciated about Professor Kaji's class was his hands-on, mouths-on approach to teaching. It's rare to find a university-level class nowadays where you rot your body as well as your mind. After that whole Inferno mess in Lit Hum, I now have a heightened and fattened respect for the gluttonous. Take this class.\n"
        },
        {
            "course_name": "Bodies and Spaces Over Time: America's Obesity Problem After 1945",
            "review_date": "March 13, 2004",
            "review_content": "\nProf. Kaji would always show up late to class with a bag of White Castle hamburgers, and the worst part was that he'd eat them all at once, rolling them together until they formed a large, doughy beef cluster, and he wouldn't give any to the class. Every once in awhile, our TA would open his mouth expectantly, but Prof. Kaji never deigned to give up the slightest piece of his giant hamburger-ball. After eating, he would wipe his face onto his cummerbund -- he always wore eveningwear, as if to show off the elegance of the truly mentally obese -- and then slurp at an extra-large beverage in a white cylinder as big as my head. I found the whole thing kind of attractive, but the homework -- eating a side of beef every hour -- was a drag. For our midterm, we had a pancake-eating contest, which was fun.\nDespite the constant overeating, the class is actually centered around a sort of intellectual obestiy, the kind that has developed since the days of Pynchon and progressed to the style of reporting of Wolf Blitzer. Truly an enlightening experience -- I have learned to spot intellectual obesity in some of the skinniest staff at Columbia! All in all, i recommend this course -- only BYOH (hamburger).\nWorkload:\nnot too bad...a lot of consumption, as described above. taken concurrently with a gym class, you might not become too fat...\n"
        }
    ]
}