{
    "prof_info": [
        {
            "prof_name": "Robin Herrnstein",
            "prof_id": 1874,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 08, 2004",
            "review_content": "\nI would say that if you can dig the \"baby science\" aspects of the class, then Robin is killer. You want her as your section leader. She without doubt makes the class way more interesting by bringing in anecdotes from all her science readings/personal experiences, and does a great job at keeping the subjuct non-technical and easy to understand. Outside of class, she was always approachable and loves to just chat about anything science related. She will def go out of her way to make sure you find what you are looking for should you ever inquire something of her, class related or not. \nWorkload:\nSome bitch work (problem sets every few weeks), minimal reading for section, most work done in class. Sorta hard A, but an easy B+, if that makes sense.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 20, 2003",
            "review_content": "\nYou really have to give Robin an A for effort.  She tried so hard to make this class exciting.  The class itself is so flawed.  It's geared towards the \"nonscience\" type which basically just means all the problem sets are written in cryptic baby language.  I would say (at best) 50% of the class actually attended lecture.  I mean, who the hell goes to a 9:00 AM FRIDAY lecture!?!? (especially when you can just read it later because they post it on the website). The difficulty level of this class wasn't very hard at all.  However, 30% of our grade was based on our section.  Other section leaders had zero homework.  Ours had busywork.... I know Robin didn't want to hand out grades based on a whim, but it was kind of frustrating to see other people in frontiers slacking off while we had to do somewhat stupid projects.  I really liked Robin as a person but her teaching style was a bit too middle school science class... It was her first class at  Columbia, though, so maybe she'll adjust to the college scene a bit better.\nWorkload:\nfor lecture: 5 problem sets (some were HARD! but mostly just took forever), lowest grade dropped (40%), section assignments (30%), final (30%) (no midterm)\n"
        }
    ]
}