{
    "prof_info": [
        {
            "prof_name": "Kunaal Sharma",
            "prof_id": 12852,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to International Politics",
            "review_date": "March 10, 2014",
            "review_content": "\nI took this class, in my first semester and it was the first class I took in my major (political science). Overall, this is a very good class for an introduction to the discipline, especially as compared with other intro classes.\nProf. Putnam sets a theme for each class to cover (human rights, NGOs, etc...). You go to class, she puts up the slides, you listen and then she promptly puts the notes up on the course wiki (kind of a better version of Courseworks). The material is all very accessible and the textbook, that you must buy, is very clear, and efficiently didactic. There is an additional case studies textbook which offers applicable instances of the topic being studied for the week.\nProf. Putnam is very straightforward about her lectures. She goes through the concepts on the slides, adding additional information from her notes, and every here and there she calls on the class for answers. Though one may not think it important, I like that she has enthusiasm in her voice and changes her tone throughout the lecture; this kept me awake and into the class. I loved it when she talked about international institutions and governing bodies (such as the UN), I could tell her expertise is unmatched and that she enjoys teaching the subject. I also really liked that she wasn't snobbish or intimidating towards us newbies (as I'm sure she could have been as a Harvard law graduate and Ph.D. recipient in political science from Stanford). Prof. Putnam is easy to talk to and easy to approach, which was a nice contrast from my other poli sci course that semester.\nWhat prospective students need to know is that this is an intro class, not field work. I think Putnam understands that and keeps the set up of the class simple for that reason. We studied broad topics in IR and learned the basic theories that govern them. She did however have us play an IR game the second class which really was a terrific deviation from typical Columbia fare. The game built relationships between students in the class and set a tone of collective action for us students which manifested in multiple study groups and reviews.\nPutnam was also very kind about her office hours; she was willing to sit with me for the entire time (as long as no one else showed up) and work with me through the questions I had. \nThe sections were a necessary compliment to the lectures. Putnam had the TAs cover the case studies more deeply and additionally, each section was a review of the current week's lectures. My TA Kunaal was exceptionally attentive to our needs and would adapt the class to meet our biggest concerns. I had the feeling that Kunaal was working closely with Prof. Putnam to balance the class most effectively and he was dedicated to getting all of his students to grasp the concepts. He was easygoing but was skilled in managing the class and held our respect.\nOverall, this class is a great choice for Poli Sci beginners who are looking to get started in IR. It is a big class, that covers all of IR broadly and really gave me the feeling that I was learning something that I could apply. I found myself reciting the information and theories from the course throughout the semester outside of class. The reason I recommend this course so highly is that I came out of it with the confidence that political science is for me and that I can succeed in the pursuit of the subject.\n\nWorkload:\nThe work in the class is very fair but requires hard work. There is a midterm, a paper and a final. The two tests required an understanding of everything learned but did not require a micro attention to each topic. If you know the important points for each lecture, you will have no problem succeeding in the class. The grading was completely reasonable and Putnam curved the tests slightly, as needed.\n"
        }
    ]
}