{
    "prof_info": [
        {
            "prof_name": "Dorian Warren",
            "prof_id": 3298,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Labor and American Politics",
            "review_date": "February 02, 2015",
            "review_content": "\nI don't know what all of the hype is about. I found his lectures extremely dry and boring, he failed to respond to numerous emails (many people in my class had this same issue), he never returned feedback on paper drafts, did not give back papers for grades, and it is February 2 and we STILL do not have our SSOL grades. \nWorkload:\nweekly readings, one in class midterm, one paper, and one take home exam. no idea how he grades, as we only got our midterms back...\n"
        },
        {
            "course_name": "Labor and American Politics",
            "review_date": "January 28, 2015",
            "review_content": "\nDo not take this class. Yes, it's supposedly easy and your most likely breeze through the class. It's simply a midterm, a 5-7 paged paper and a final. Warren is simply not invested in the class he showed a movie in class at least 4 times and canceled class three times. He comes off as very nice and likable. With that being said we are nearly a month past the grade submission and none of us have heard from him. I know of at least half a dozen people who have emailed him and the TAs none of them have responded at all. The vagueness from the political science department implies that they to have been unable to contact him. In addition, to not being able to complete the grades he doesn't even have the guts to talk to those he's screwing over. I've even seem him on MSNBC during these last few weeks so he hasn't dropped off the face of the earth just Columbia's campus. With all that being said I enjoyed the class but it doesn't make up for this ridiculous situation. Even the worst professors I've had over these past three years submit their grades. Dorian does not deserve this silver nugget and he certainly doesn't  deserve the tenure he has been granted.\nWorkload:\nMidterm, Final and short 5-7 page paper, low amount of readings most of which are unnecessary \n"
        },
        {
            "course_name": "Labor and American Politics",
            "review_date": "January 23, 2014",
            "review_content": "\nehhh, totally ever age. Honestly, I went in there thinking this guy would write my law school recs, and I realized that he's totally not very invested in the class, was quite boring, and the topic itself was dry (versus what it should have been considering its the most extraordinary freaking social movement of our time!!)\nHowever, office hours with him is infinitely better, so seek him out then if you have any real questions. In my POV, he's better one on one (as say a major advisor in political science) than as a class wide lecturer. Also, the TAs were fine, nothing spectacular and frankly, all three seemed pretty dreaming uninterested.\nWorkload:\ntotally fine; reading are annoying and wayyyyy to much since most say the same thing, plus he gives you the questions for the midterm and the final is take home. just submit drafts of your papers to him and you will do well!\n"
        },
        {
            "course_name": "Politics of Policymaking",
            "review_date": "December 22, 2013",
            "review_content": "\nThis course is in flux. This year was a brand-new course that had been completely overhauled from what from every account I heard of, was a disaster last year, taught by someone entirely different. It's entirely possible that it will change a great deal again next year.\nProf Warren was one of those professors who I'd bet is a great discussion leader, but doesn't always have his heart in it when it comes to lectures. He's an easygoing and approachable guy and I always liked talking to him one on one after class if I had questions. But it seemed clear that the material he was covering in the first half of the semester (a lot of political science theory about how policies are formed and carried out) seemed pretty basic to him. When he got into real-world examples, he was more engaged and engaging, but that was minority of his lectures. \nLast third of the semester was taken up by guest lecturers, who were a bit of a mixed bag. Standouts included Steve Cohen, Esther Fuchs, and Lawrence O'Donnell (yes, as in MSNBC/The West Wing/Homeland). All in all, made me a bit jealous of the MIA folks in Conceptual Foundations who always seemed to be having a great time (except for the last three weeks which were apparently hell), but wasn't as bad as some of my classmates made it out to be. Besides, I don't want to be known as Missing In Action for the rest of my career (common American interpretation of the acronym MIA).\nSyllabus is very U.S.-centric, and even the international examples assume the presence of functioning democratic systems. You won't be learning much that applies to places like China or Russia, for example.\nWorkload:\nErratic and changes from week to week. Reading load is sometimes heavy (150+ pages a week), and you will need to post something online each week from readings. There is a group powerpoint/discussion leading assignment that rotates in sections, you'll do that once in the quarter. Then there is a semester-long project in which you create a policy and write short but technically challenging memos about it with different focuses throughout the semester. I think there were four such memos total. There is also a take-home final in the form of a similar memo, but using a provided case study rather than your own policy idea.\n"
        },
        {
            "course_name": "Labor and American Politics",
            "review_date": "January 16, 2012",
            "review_content": "\nAlright.  There's a lot of fanfare around Professor Warren, but I think many reviewers may be buying into the hype. Warren is personable and friendly, but I'm not actually sure he knew all that much about the subject matter--wait, I take that back, there wasn't much to know about it. Let me do you a favor and tell you what you'll take away from class: labor power has been steadily decreasing for the past 60 years while the power of business to take manipulate of workers and take away benefits has increased. Done. You get an A!  I didn't do any of the readings and got an A (okay maybe I did one). \nI knew nothing about labor and walked away knowing everything about it, though. Warren did present the information in a very engaging way for such a boring topic, so he does get that credit as it's due. I'd recommend taking a class with him I guess, only about something more interesting than labor. \nWorkload:\nsome essays\n"
        },
        {
            "course_name": "American Politics Seminar: Community Organizing",
            "review_date": "May 10, 2011",
            "review_content": "\nProfessor Warren is really great. He has a sense of humor, knows how to keep class discussion going, poses thought-provoking questions, and assigns interesting reading material. He is obviously very knowledgeable and enthusiastic about the subject matter, and he is approachable and very quick in responding to emails and students' questions. He is respectful of student views and does a good job mediating when students expressed opposing viewpoints during class discussions. There is a lot of reading required for this class but if you're interested in social justice issues you will find it useful. Overall, it's a great class and I would highly recommend it.\nWorkload:\nTwo 6 to 8 page response papers, an in-class presentation (with another student or in a small group), weekly readings (approximately 250 pages/week), option between doing a take-home final exam (answer two essay questions) or write a final paper (length of approximately 15 to 20 pages)\n"
        },
        {
            "course_name": "American Politics Seminar: Community Organizing",
            "review_date": "December 06, 2010",
            "review_content": "\nThere's not a lot I can say that hasn't already been said. This guy is one of the best teachers I've ever had. He cares and wants it to be a great class. You will enjoy this class and learn a lot. It may not appear so right away, but what you learn in Community Organizing is applicable in many other places. Moreover, his classes seem to attract very entertaining individuals that are passionate about the subject. It developed an atmosphere where you wanted to work hard in order to keep up with everyone else. \nIf you aren't the most outgoing don't worry, I was one of the least active participants in the class and still did very well. As long as you show an interest and grasp of the subject in your papers he will take care of you.\nWorkload:\nUsually about one book per week, sometimes he throws an article or two in there as well. Read enough that you can actively discuss several key concepts in class.\nTwo 6-8 page Papers. One class presentation (You work with one or two other students and basically lead class with discussion questions about the book. If it gets slow Warren chimes in with some thoughts/questions of his own), Option of either a take home final (about 10-12 pages) or do a case study about something involving community organizing (about 15-20 pages)\n"
        },
        {
            "course_name": "American Politics Seminar: Community Organizing",
            "review_date": "May 09, 2010",
            "review_content": "\nNo question about it, Professor Warren assigns a lot of reading.  However, he tells you to skim some of the books and not to focus on certain parts, and he goes over the basic points in class. That said, you'll want to do a lot of the reading.  This is one of the few classes here that has really changed me and opened my eyes up to new and interesting things, and you should definitely take it.  You might be overwhelmed and up until 3 just before the papers are due, but it's worth it.\nClass discussions are also great.  It's a seminar full of opinionated people and while he doesn't lecture, Prof. Warren guides the discussion so we don't just spend time talking about anecdotes from our own lives.  I made some great friends in the class, too.  With the possible exception of CC, it was one of the best classes I had.\nWorkload:\nSlightly higher than typical--about a book a week, but they are pretty skimmable.  Two eight page papers and a take-home final.\n"
        },
        {
            "course_name": "Labor and American Politics",
            "review_date": "December 10, 2008",
            "review_content": "\nI took Labor and American Politics with Professor Warren in Spring 2008 and thoroughly enjoyed it. Prof. Warren is a superb lecturer. He presents the outline of his lecture on Power Point slides and sometimes incorporates historical movies and/or YouTube clips. Though this is a lecture class, Prof. Warren encouraged class participation frequently. The class had a wiki-space, and students posted news articles related to the course material; we would then spend the first 10 minutes or so discussing the news. Prof. Warren is young and cool. Take advantage of his office hours - he has fascinating research interests, wants to hear about what you're into, etc. I'd definitely recommend this class or any other taught by Prof. Warren. The only downside was that the TA was not that knowledgeable about organized labor. \nWorkload:\nTypical for a Poli. Sci. class. Lots of reading, but not all of it was essential. He overviewed the most important readings in class. One paper, one midterm, one take-home final. \n"
        },
        {
            "course_name": "Labor and American Politics",
            "review_date": "November 12, 2007",
            "review_content": "\nTake anything you can with him. He's young, fun, smart, approachable, funny and wonderful.\nHe's one of the best professors I've had at Columbia. I am a conservative and I thought taking a Labor politics class would be awful. Prof Warren, however, doesn't fall into the typical poli sci liberal indoctrination style. He listened to everyone's ideas and was more than willing to play devil's advocate to both sides-which is good because the class has lots of discussion.\nThe readings and lectures were fascinating and informative. I found myself WANTING to do the work for this class. The few times I missed class I was actually sad and disappointed. \nHe brings in lots of current event to explain concepts. One girl in my class had a habit of emailing him relevant articles and a few times he made the entire lecture about the article she sent him. The lectures are never dull. \nI've also heard he gives A+'s though I can't officially confirm. \nTAKE THIS CLASS\nWorkload:\nQuite a bit of reading but doing all of it isn't mandatory he summarizes major points in class- but if you have any interest in the topic at all you won't be able to put down the readings he chooses. Take home midterm, take home final and a 7 page paper. All graded VERY fairly.\n"
        }
    ]
}