{
    "prof_info": [
        {
            "prof_name": "Margo Rosen",
            "prof_id": 1729,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 23, 2016",
            "review_content": "\nProf. Rosen is a godsend. The previous reviewers described her very well, so I won't go into detail, but had to add that you MUST take her class. You will learn a ton both about the texts and about your own writing. She should have a gold nugget.\nDon't be scared by her grading on papers. My theory is that she has some sort of secret curve/bonus where everyone's finals are \"really really well done\" (you don't get them back or to see the grade even if you ask) allowing her to bump up everyone's grade at the end of the semester. She doesn't want to penalize good, thoughtful students for a dud paper, so she will probably make it up to you in this way. Combined with generous allotments for participation and Google Docs, Prof. Rosen allows for many opportunities for redemption (or if not redemption, bonus points). At least half the class will get in the A-range according to my transcript. \nMy main advice is to participate well (she called me out on not talking enough in office hours, although she doesn't spot call) and take her comments about close reading and extrapolating features of the text as a whole from words/phrases in the the passages very seriously on exams and essays. My exams literally looked like this: \"quote of 1-4 words in the passage\" --> feature of the text (e.g. rhyme scheme, narrative discrepancies, teleology): brief note form explanation. Make a list of features of each text and memorize it so that you can do this easily during test and you'll have no problem. \nTL;DR: MARGO IS THE BEST. She will challenge you to do good work and teach you a lot about the texts and how to write. Her grading is very fair. She is warm, understanding, and very smart. If you're in her class, you've lucked out. \nWorkload:\nVery fair. The Google Docs assignments shouldn't take more than 15 minutes (I did them in between my previous class and the start of her class each day for the entire year and was fine). By making her essays passage analysis she takes away a lot of guesswork and saves you time. As noted, the midterm and final include fewer IDs. She literally changes the department wide exam to be more appropriate to our class, including substituting passages. No quizzes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 19, 2016",
            "review_content": "\nI just wanted to say that I absolutely agree with all the previous reviews: Margo is warm, caring, wonderfully professorial in that frazzled, excitable sort of way, and an excellent teacher. There's no point in restating all the points the old reviews say; they all still hold perfectly true. Professor Rosen is an EXCELLENT Lit Hum teacher.\nA note on her essays: the close-reading point still holds true. You need to focus in on one passage and analyze it with little reference to the book as a whole. She's also big on being concise and cutting out fluff - the \"bullshit\" line that an older review mentioned seems to be part of a yearly trope she uses. If you follow that advice, though, it's not hard to get a good grade on your papers. Just have a point to your essay, back it up with details in the passage you're analyzing, allude to the point in your intro, and make the point in your conclusion.\nWorkload:\nTwo (occasionally three) papers/semester, midterm, Lit-Hum-wide final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 19, 2016",
            "review_content": "\nProfessor Rosen is an excellent teacher, and her strengths are particularly well-suited to Lit Hum. Her class is constantly and consistently engaging, interesting, and even fun. I'll go into a lot of detail about her class, which will probably sound dry at times; that's simply a function of my extended analysis and poor prose. Her class is absolutely fantastic, and was an incredible introduction to the Core here at Columbia. She is highly recommended, and deserves even better than the silver nugget she has currently.\nA disclaimer before I begin: Obviously, a lot of the quality of a Lit Hum class depends on the students - if they're all quiet, the class likely won't be enjoyable, no matter how great the teacher. I was lucky enough to have a relatively lively class, where at least 10 people spoke in any given class period, rather than 3 or fewer people making all the contributions. On the other hand, both by making a large chunk of the grade (30%) based on class participation, and with her easy and engaging manner, Margo definitely brings out the best in her students.\nProfessor Rosen's class is focused on close reading. Her essays are all exercises in that skill: to get a good grade, simply mine the passage for the tiniest linguistic details that the author might have placed to make a larger point, then make the larger point yourself in the conclusion. Afterwards, go back and write an introduction that leads naturally to your analysis and conclusion; she's a stickler for writing the intro AFTER the rest of your paper.\nMargo is an absolute joy in class; she comes to every session smiling and spends the entirety of each class jumping off into tangentially related analyses of the text that keep both her and her students excited. Because of her emphasis on close-reading, Professor Rosen's classes tend to be a series of 10-20 minute stops at different self-contained places in the book. For instance, you might spend 15 minutes on a particular juicy scene in Crime & Punishment, without making reference to much of the surrounding book (besides the places in which language from the part you're analyzing gets repeated). Then, after both class and professor have exhausted (or nearly exhausted) their analysis of the symbolism, sentence structure, metaphor use, and other features of that particular section, Professor Rosen will nudge the class towards a different passage, later in the book. As such, her class isn't so much a review or exploration of the books as a whole, but a tiny taste of what truly deep mining of the text can net you in particular places in each book. (Close reading!)\nProfessor Rosen is a Slavic literature buff by trade, but that doesn't stop her from being immensely and obviously excited and knowledgeable about all the works on the syllabus. Perhaps her biggest weakness is that she doesn't have a lot of background knowledge on the historical circumstances surrounding the books beyond the notes she prepares for class; however, if you ask a question she doesn't know the answer to, she'll always research it and bring the answer to the next class. She truly cares about her students; she'll often try to organize fun activities with her class's event funds. For instance, she might take the class to a performance of one of the plays you read, or have a trip to the Cloisters, or organize an out-of-class review session for the final with pizza or at Symposium (she'll let you vote on what to do with the funds, but she has plenty of good suggestions). She also has a 10-minute break built in to the middle of her 110 minutes, and she'll try to organize a signup list where each week, a different member of the class brings a snack. Small, cute things like that don't really impact the class, but are certainly a nice touch from a veteran, All-Star Lit Hum teacher.\nAs far as grading goes, Professor Rosen will generally give poorer grades on the first paper than later ones; this is explained by the fact that she doesn't give a 'discount' at the beginning of the semester to account for the fact that students don't yet know how to write her close-reading-heavy preferred paper-type. As you learn how to write the type of paper she likes, your grade will improve; don't be afraid when the majority of the class receives C-range grades on the first paper. Margo is generally a pretty easy grader when it comes to your final grade; her final A-range is usually around 40%. The grading breakdown varies, but is generally something like:\nFirst paper - 15%\nMidterm - 15%\nSecond paper - 20%\nFinal - 20%\nClass participation and Google doc - 30%\nThe Google doc assignment is one that takes place before each class. Each student has to find a particularly poignant or loaded quote from the assigned reading for that class, post it to the Google doc for that particular class session along with a thought-provoking question about the quote, and answer someone else's question. While the minimum is one quote and one response, quality and quantity are both good things here (and both can make up for a poor class participation record, if you realize you're not speaking up as much as you should be).\nProfessor Rosen's emphasis on close-reading extends to her tests. Instead of simply asking you to identify the work, author, and context of a quote, Professor Rosen asks that you analyze the quote and list as many features as you can find in the quote that are indicative of what work it comes from. For instance, whether it is poetry or prose, what sort of narration it includes, what themes might emerge from its content, etc. This different method for passage ID's means both that your passage ID's will take much longer than other classes' (which is why you'll be given fewer of them), and that less of your grade is dependent on simply knowing quotes (instead, you need to know the FEATURES of each work that define it and separate it from others). Be aware that you won't get back your papers or tests quickly - it'll often take upwards of a month. You'll almost always get back a paper before the next one is due though, and the midterm before the final happens.\nProfessor Rosen is unafraid to give her own interpretations of symbols in a book once the class has given its analysis. Although she's an incredible facilitator (be careful - if you so much as scratch your nose, she'll assume you're raising your hand!), she'll also tell you her own view of the texts. She'll make it very clear when this view is her own and not necessarily shared by her colleagues, but her theories are often eye-opening, provocative, and extremely intriguing. Many of these theories come into play later in the second semester, as she really enters her zone of expertise - especially surrounding Crime & Punishment and To The Lighthouse.\nSpeaking of specific books, Professor Rosen isn't afraid to monkey with the standard Lit Hum syllabus. She doesn't like Sappho, for instance, and this year she removed it and Ovid's Heroides in favor of Ovid's Metamorphoses (which I personally think was a wonderful decision). She's been teaching Lit Hum for a long time (She once mentioned a class she taught in 2002, I think), and she tends to lean towards the classic elements of the syllabus as opposed to the new additions. (With that said, the last book she teaches is almost always the graphic novel Maus, which hasn't ever been on the official Lit Hum syllabus to my knowledge.)\nProfessor Rosen will never agree to have class outside - she finds it distracting and she makes good use of the blackboard - but she gives off the sort of fun vibe that makes even books you've read and disliked in the past seem fascinating and deep when she teaches them. She'll breathe new life into the dusty old classics, and if you pay attention, she can make books you'd never have considered enjoyable feel like some of the best in history - which, after all, they are; that's why they're on her syllabus.\nWorkload:\nTwo or three 3-page papers per semester, in which you analyze a single passage (lots of emphasis on close reading); the last paper each semester might include an option (or requirement) to analyze and compare TWO passages in 4-6 pages instead.\nIn addition, there are mandatory posts to a class Google Docs page before each class - you have to find a quote from the assigned reading, ask a question about it, and answer someone else's question. If you've done the reading, the whole exercise shouldn't take more than 15 minutes.\nAlso the usual in-class midterm and Lit Hum final, although Professor Rosen will generally amend the passage ID's to have fewer questions but require longer responses, as I note above.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 09, 2012",
            "review_content": "\nMargo Rosen is GOD. Her class delivered everything I expected out of the Columbia Core, and really was life changing. After taking her class, I feel prepared to read and analyze any text that comes my way. She advocates \"close reading,\" and wants her students to become experts at it. By the end of the year, the things we would pull from the texts and the conclusions and observations made TRULY blew my mind and changed the way I see the world. In my opinion, THIS is what the core is about. \nNot only is Margo a brilliant woman, but she is also extremely down to earth and a wonderful person to talk to about just about anything. Make use of her office hours--she will truly make a concerted effort to get to know you as a person and to understand your own learning style. \nI cannot say enough about this professor and this class. I wish I could have her for CC too (and every other class I ever take ever.) She epitomizes the type of person I want to be when I grow up: someone who is smart, has a wonderful sense of humor, cares a lot about learning, but doesn't take herself too seriously, and wants to see others succeed. She could make any work of literature fun, stimulating, and fascinating. \nIn short, take this class. It will probably be one of the best intellectual adventures of your life. I know that sounds cheesy as hell, but that is what this class is and I loved EVERY second of it.  \nWorkload:\nNot too bad! A couple of papers, graded harshly if you don't catch onto her close-reading preference. If you focus in on one passage and tear it apart, you will do fine.\nWiki-posts for each class that also can be thought-provoking. You choose a passage and pose a question and then you answer someone else's question. \nI felt VERY prepared for the exams after her class. In fact, the department-wide final was a BREEZE!!! \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 15, 2012",
            "review_content": "\nProfessor Rosen is very thoughtful, approachable, and enthusiastic. Definitely the best instructor I've had at Columbia so far. She is so genuinely excited about all of the works we read that after each class, I ended up liking even the works that I had initially disliked. She encourages discussion and lets you make any point as long as you can soundly back it up with specific details in the text. The other reviews are pretty much spot-on, but I just want to say that Margo is a truly wonderful Lit Hum professor. Take her class!!!\nWorkload:\nThe other reviews are correct. From what I can tell, it's less than the workload of other classes. I know some other classes had to write 10 page papers, but ours were either 3-5 (1st semester) or 4-6 (2nd semester) pages of analysis based closely on the text. We had to post on the wiki for each class, but that was not bad at all. It ends up being helpful for reviewing at the end of the semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 29, 2012",
            "review_content": "\nProfessor Rosen is absolutely fantastic. \nThis is pretty much all you can ask for in a lit.hum class, and Margo delivers.  She is genuinely excited about legitimately every work we read and it shows. Discussions are really innovative and fun.  Rosen usually spends a little bit of the first class on a new work going over the author of the text, his time-period and other possible social impacts of the time, but after, discussion delves right into the text.  Rosen is an advocate of what she calls \"close reading\" where she breaks down text sometimes word for work, and ends up coming to some really unexpected but amazing conclusions which definitely provide an entirely different perspective on a work.  Discussions do proceed mainly on her guidance but she respects every point brought up, and is accepting of other readings of the work as long as they are appropriately backed up by textual evidence.  She is really knowledgeable of every work and this shines through her discussions and opinions.  \nIn terms of grading, she is pretty tough on essays.  She asks for relatively short essays (3-5 pages) because she advocates for concise and to the point writing.  She one time told us it was her job to get us to stop \"bullshitting\" on essays because we had been so conditioned for that in high school.  She hates repetition in essays, and will really shred an essay apart if it is obvious no work was put in and there was no discernible conclusion.  Some people complained they didn't get what she wanted out of the essays, but she makes it really clear she wants strong close textual analysis building up to a conclusion in relation to the topic.  She gives 4-5 topics for essays, but always leaves the possibility open for any other topics.  Since she is so knowledgeable of the text and advocates close analysis so much, the midterm and final seemed relatively easy--including the passage IDs because we spent so much time understanding the different writings of each work and what makes them distinctive.\nIn terms of workload, the essays are pretty short and second semester there were only two of them.  First semester she had a short analysis piece due on Tuesday and online discussion posts for Thursday, both of which are pretty short.  Second semester she changed it to only Wikispaces posts online for every class.\nProfessor Rosen is definitely one of the best professors I've had at Columbia and taking Lit. Hum with her is the best. \nWorkload:\nFirst Semester:                                                       Second Semester:\n10% Paper 1                                                               20% Paper 1, 2\n20% Paper 2                                                               20% Midterm, Final\n20% Paper 3                                                               20% Participation, homework\n15% Midterm, Final \n20% Participation/Discussion\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2011",
            "review_content": "\nI love Margo. She's honestly exactly what I want in a Lit Hum professor. She's frazzled and energetic and passionate about everything we read.\nClasses are very much about the discussion. Margo will interject or steer the conversation, but in the end, we're usually the ones to arrive at big points in the text. She's also something of a renegade in her interpretations of texts; she's very willing to go with conclusions drawn from the tiniest of passages and reinterpret the entire text based on just that small section, and you can change her perspective if you have the passage to back it up. That said, this won't leave you unprepared for the final, you'll just have a unique perspective on the texts.\nMargo's tough on essay grades, but her feedback is always spot on, and if you deserve an A, she'll give it to you.\nWorkload:\nTypical reading, an assignment due each class (for most of the semester, it was a short response Tuesday and then a discussion post Thursday) 3 essays that increase in terms of grade percentage.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 29, 2009",
            "review_content": "\nBy far the best teacher I've had at columbia so far. Discussions were relevant and interesting, engaging even when treating subject matter which tended towards the dry side... Amazing use of outside resources really made the texts more dynamic, great choices for last book of the year (Art Speigleman's MAUS I & II was amazing and very different) best prepared I've ever been for any final/midterm... felt like the test was a breeze because she made it so easy to learn what we needed. (not to say it was dumbed down at all). Really cares for students' well-being, not just that they come to class and don't look too hung over/asleep/tired/bored. Amazing. I want her to teach all my classes. seriously.\nWorkload:\nposts on wiki and written responses to close reading for every class... tough at first but became really easy over time and were VERY worth the legwork when it came time for the exam\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 03, 2007",
            "review_content": "\nI love Margo. She evolved from a very good teacher to one of the best I've had. A highly intelligent and warm woman.\nWorkload:\nMore than other Lit Hum classes because of the discussion questions, but not excessive. She prepared us well for the class-wide Core final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 17, 2007",
            "review_content": "\nMargo is always excited about the texts. She is thoughtful and intelligent. Every class begins with either a short 'info session' on the work or a question that sparks the discussion. We often find ourselves short on time not because much of it is wasted. Rather, Margo brings out many points of discussion. She is understanding and allows us to pursue any argument as long as it is support by the text.\nWe leave discussions with a greater understanding of the texts, even if we don't read everything. Margo is approachable and is willing to answer any question. If she doesn't know the answer, which she will admit, she will actually find out and come back with an answer next class session! (instead of hoping we'll forget about it.)\nThe workload is light, other than the reading. Two discussion questions of any length, as long as it is concise and analyzes the text. Three 3-page (max) essays for first semester. Two 6-page (max) essays second semester. Midterms are the same format as the Final and are not entirely difficult. She is will to host review sessions outside class and even ordered pizza for us.\nMy suggestion: Take Margo's class! It embodies all the great qulities of the Core.\n\nWorkload:\n1st Semester: 2 Discussion Questions each class, Three 3-page essays. Midterm & Final.\n2nd Semester: 2 Discussion Questions for one class, 2 Online passage analysis (wiki site) w/ 1 response to another's analysis, Two 6-page essays, Midterm & Final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 21, 2007",
            "review_content": "\nMargo is awesome! She is informative yet humble. I cannot give the woman enough credit. She prompts discussion and is enthusiastic. She also is encouraging and very nice. She is also very smart, you can just tell by how she gets excited about the subject matter.\nWorkload:\nstandard for lit hum. ok papers, fair grader. hard midterm\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 10, 2006",
            "review_content": "\nMs. Rosen is absolutely fabulous! She is enthusiastic, intelligent, and humble. She lets her students speak, even if they are completely off topic, and never makes forceful corrections but rather is very respectful and kind! I absolutely love her lit hums class, anyone who has her is very fortunate!\nWorkload:\nDiscussion questions to be turned in every day at the beggining of class, moderate papers. The discussion questions can be very time consuming, it depends on how much time you want to put into them. She prizes hard work. Her midterm was difficult...\n"
        },
        {
            "course_name": "Russian II (both semesters)",
            "review_date": "January 30, 2004",
            "review_content": "\nAmazing.  My favorite professor.  She makes grammar interesting and she's witty without wasting our learning time.  I look forward to Russian every day because of Margo.  She has high expectations for her students, but she's friendly if you need help or have questions to ask.  Humble, too; she often says things like, \"Bear with me-- I haven't taught this material before.\" Meanwhile, we students wink at one another as the greatest teacher in the world tries to apologize for her instruction level!\nWorkload:\nNightly homework.  Tests for which Margo prepares us to the hilt.  Practically spoon-fed Russian language.\n"
        },
        {
            "course_name": "Russian II",
            "review_date": "December 13, 2003",
            "review_content": "\nMargo Rosen is the best professor I've had.  Period.  I wish she taught all my classes.\nWorkload:\nFair.\n"
        },
        {
            "course_name": "Second Year Russian I",
            "review_date": "November 27, 2003",
            "review_content": "\nMargo Rosen is fantastic.  I can honestly say she's the best language teacher I've ever had, and I've taken a LOT of language classes.  Unlike many other teachers, she really engages the material and tries endlessly to pull your face out of the textbook and get you actually talking.  Often, during group \"conversation\" exercises from the book, you have to leave your seat and actually converse with the other students.\nShe encourages conversation in class, as long as you make a good effort to use the current material.  I can't count the times we've all cracked up laughing over a bon-mot po-russki.  Yet somehow, we still cover everything we need for the tests.  I swear, room 707 must be in a time warp.\nShe also really explains grammar, instead of just lecturing about it.  If you want to know why that vowel is fleeting, or when you're supposed to drop the soft sign, she will explain it happily and articulately.\nShe teaches a great class, whether your interests are academic or functional.  She also rewards creativity, encouraging students to explore what they can do with what they already know.  If you want a class where all you're expected to do is copy the example and change the word you're declining, please don't take Russian with Margo.  If you want to have fun and learn Russian for real, sign up!\nWorkload:\nStandard for a language class.  Second year Russian has a lot more essay writing in the regular homework, though, and more translation from English to Russian (of entire conversations).  Some days have no homework, somedays have 4 pages of essay questions.  Nonetheless, it's bearable.  Very few surprises on the chapter tests.  Margo gives quizzes before the chapter tests (I think they're of her own design) to keep you on task in preparation.  Which is great, because otherwise I'd probably not do as well.  Also, she's serious about turning in corrections.  Some teachers let you get by without them, but Margo will stay on your butt until you turn them in.  Do them--it's for your own (and your grade's) good!\n"
        },
        {
            "course_name": "Second-Year Russian",
            "review_date": "September 10, 2003",
            "review_content": "\nWhat is it about the Russian department monopolizing all the nice professors?  This woman is incredibly nice, smart, patient, and instructive.  She isn't even Russian, and her accent sounds like it's on the money!  I look forward to her class every day, and I listen to every word she says in order to maximize my learning.  Margo is a treasure.  She will keep you on your toes, though....  No slipping through the cracks in this class.\nWorkload:\nTypical workbook assignments.  Her tests are tough since she really wants to know if you've learned the material.  Hey, it's for your own good!\n"
        }
    ]
}