{
    "prof_info": [
        {
            "prof_name": "Margaret Vail",
            "prof_id": 3243,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Film and Culture",
            "review_date": "January 05, 2012",
            "review_content": "\nA subpar slog of a class that we had to sit through on Tuesday nights to get an easy grade. There's nothing engaging here for casual observers, and nothing rigorous here for fans of the subject. A proper title for the course would be \"Intro to Ethnographic Documentaries,\" as that's all we covered. Film and anthropology experience is helpful but absolutely not required.  \nObviously Film and Culture isn't about watching blockbuster movies.  I'd say half of them were great.\nVail might be decent in real life, but this falls on her. She's a tremendously poor lecturer. I wish it wasn't so, but I don't think she's ever written a lesson plan in her life. She might ramble for 5 minutes or 45 minutes, and it's impossible to tell when her personal observations end and important information begins. It was truly like listening to word salad. To her credit, she does at least give us a basic syllabus and lets us out roughly 15 minutes early.\nIt's also quite difficult to take notes; she expects us to do so in the dark without the aid of laptops or cell phones. As ideas go, this one wasn't very...bright?\nPreviously she taught this in the fall and the companion course Culture Through Film & Media in the spring. Now she's planning to stop teaching Culture Through Film & Media at Barnard so that she can focus on NYU students instead.\nI finished with a B+. Not the fairest grade, but I could certainly have gotten an A had I attempted the extra credit.\nTAs: There is a semi-optional discussion section. Matt Sanger was phenomenally engaging and helpful, if he's still around. You can seamlessly switch between the 6+ TAs if need be, although it's not encouraged.\nWorkload:\n1. In-class midterm and final (answer 4 out of 6 prompts over several pages in a blue book. Questions are given to you one week in advance, though the test is not open notes). Original thought is punished.\n2. A 3-4 page essay on the Margaret Mead Film Festival.\n3. Option of either weekly Courseworks postings (several sentences or paragraphs long) or 50-minute TA session. Doing both, and/or taking volunteer opportunities, leads to significant extra credit.\nPlenty of reading, all of it is pointless and not discussed in class (except Auferheide). Wait until the day before the test, then study the readings referenced in the test questions.\n"
        },
        {
            "course_name": "Culture through Film and Media",
            "review_date": "May 01, 2011",
            "review_content": "\nMargaret Vail is great.  Her lectures could use some work - she tends to ramble, be overly apologetic, and go off on tangents.  Still, she runs the class well, brings up fascinating points, and clearly cares about the subject matter.  She is easy to understand and is never confusing.  Students seem to really enjoy her class. Additionally, Margaret always goes out of her way to bring up interesting side opportunities that students might be interested in.  The films are super interesting, but almost everything we watched was a documentary, despite the fact that she said there was going to be a \"diverse\" subject matter.  Still, the films were interesting.    \nI found some of the reading superfluous and unnecessary, but a lot of the questions on the midterm and final have to do with the reading material.  The assignments were very clear and well explained (finally!  A class that ACTUALLY tells you what they want from you).\nThe films were diverse in topic matter and unique - definitely wouldn't have been exposed to these pieces otherwise.  I'm so interested in anthropology now.  Margaret obviously cares about the class, and it's nice to see that she's so dedicated.  She also invokes interesting \"big picture\" ideas during lecture.  Also, online discussion was actually interesting/effective (most online ones are not).\nWorkload:\nSeveral articles to read per week, midterm + final (just memorize the reading and you're fine), weekly discussions (online or in class, your choice), and a film review.  Super easy workload.  \n"
        },
        {
            "course_name": "Film and Culture",
            "review_date": "January 07, 2011",
            "review_content": "\nProfessor Vail is kind although you don't really get to know her because it's a large lecture class of about 200 students (although only 100 show up each week). You watch a movie and you have weekly readings although you don't have to do them, as long as you go to discussion section. My TA was great and really helped bring to light the key points of the readings and of the class as a whole. It is easy, but not useless, I feel like I did learn things, it just wasn't hard. You basically need five hours to study before the midterm and ten hours before the final and you're good. Which granted, compared to most classes, isn't much. \nTry to have a good TA because honestly, it'll make all the difference in your discussion section. Annie is awesome if she TAs again. \nWorkload:\n1 in class midterm, 1 film review, 1 final, pretty easy and STRAIGHTFORWARD\n"
        },
        {
            "course_name": "Culture through Film and Media",
            "review_date": "September 19, 2009",
            "review_content": "\nOverall this was a worthwhile class. Professor Vail is affable, down-to-earth, interesting, and intelligent. For a non-anthro major this is the perfect class to get a small dosage of the field. The class time isnt convenient (7:30-10:30pm Th) but she usually let us out around 10 and either way, most of the class is spent watching a film or two. The movies, for the most part, are pretty interesting and its disappointing to see that each week a large portion of the class either 1) slept through most of it or 2) didnt come at all.\nIf you are truly interested in anthro the fact that Vail doesnt lecture too much may be disappointing. Either way, this is really a class that you can take a lot a way from depending how much you put into it.\nWorkload:\nFilm journal (1/2-1 page per week) to be turned in at the end of the semester, short 3-5 page film review, BS online postings for participation, midterm and final for which she gives you the questions in advance. The questions are multi-part and sometimes a little difficult. However, if you go to the optional discussion sections right before the midterm/final the TA's essentially read off VAIL's prepared answers. I simply jotted down everything they said, memorized it, regurgitated it on the exams and got the easiest \"A\" of my Columbia career.\nLet me just clarify that while easy, this class is NOT vapid.\n The  easy \"A\" was an added benefit but I would've enjoyed this class even I came away from it with a different grade.\n"
        },
        {
            "course_name": "Culture through Film and Media",
            "review_date": "September 05, 2009",
            "review_content": "\nMy feelings about this class were mixed.  On the one hand, Professor Vail is a lovely person, her own fieldwork is interesting, the workload is reasonable, and her teaching style is extremely accessible.  Her lectures are clear and easy to follow and her grading is fair.    However, I found myself disappointed that the readings and lectures were not more challenging. If you are an anthro major (like me) I would consider this course as a 5th class to balance out an overstuffed course load, but probably not recommend it otherwise.  I'd recommend it more for non majors looking for a fun, accessible foray into anthropology.\nWorkload:\nVery reasonable.  ~2 articles per week (not demanding reading), 2 page film review, a film journal due at the end of the semester, in class midterm and final (questions distributed well in advance, graded fairly).  It's suggested you post on Courseworks and attend a weekly discussion section but it's not mandatory.\n"
        },
        {
            "course_name": "Film and Culture",
            "review_date": "December 21, 2008",
            "review_content": "\nAt first the size of the class put me off a bit. I feared that this would be just another impersonal large lecture class. But Professor Vail is so amazing that she manages what could be an underwhelming experience into one of the best classes I have had at Columbia (and I am a Senior).\nProf. Vail is smart, personable, interesting and experienced. She is also highly approachable, engaging and encouraging. (I might add that she has the quickest e-mail response time of any faculty person I have ever dealt with at Columbia!)\nThis is a course that you get as much out of as you are willing to put into. It can be just an interesting and pleasant experience or you can really engage with the course material and get tons out of it. I would encourage everyone with an interest in the field to take this class and really spend time with it. You will be rewarded.\nWorkload:\nInteresting and accessible readings, weekly Courseworks postings, required and valuable sections. Long one time per week class meeting, which is necessary due to the nature of the course.\n"
        },
        {
            "course_name": "Culture through Film and Media",
            "review_date": "May 17, 2008",
            "review_content": "\nWhat a nice teacher! And such a pleasant class! Although the format of the class was kind of a pain (once a week for 3 hours + 50 minute weekly discussion class), the content is so interesting that you hardly mind it. You watch films weekly, then have readings that accompany the films you watch. There's quite a bit of reading, so it's important to not fall behind on that, since the tests are heavily based on them. \nAnd Vail is such a nice, approachable teacher. She does her best to keep the class interesting by often inviting directors or actors in the films watched in class. \nWorkload:\nweekly journals, film review, midterm, final, 1 trip to watch a film off-campus\n"
        },
        {
            "course_name": "Culture through Film and Media",
            "review_date": "May 10, 2007",
            "review_content": "\nVail is very nice and not very demanding. Its not essential to go to class-the exams are reading based and she gives you the exam questions beforehand. \nWorkload:\nmidterm, final, 1 film review (~2 pages), 3-4 reading reaction papers (1-2 pages)\n"
        },
        {
            "course_name": "Culture through Film and Media",
            "review_date": "March 23, 2007",
            "review_content": "\nEven if you are not an anthropology major, you will love this class. This was one of the best, most interesting classes I've taken so far at Columbia. My only wish is that Professor Vail taught more and that she might teach a seminar based on her own research of backpacker tourism. She is passionate, kind, funny and very helpful if you need to see her outside of class. Because she is a filmmaker herself and curates film exhibitions, she has great anecdotes about the films and filmmakers we watch. Only a couple of early films I found pretty tedious, but they were still necessary to understand the historical context of the docu.genre. If anything, just be sure to get in a good discussion session. The first one I was in was utterly pointless, and I ended up switching into another which really helped. \nTake her class, she's awesome! \nWorkload:\nModerate reading, participation, reaction papers, very intimidating midterm/final which she ended up grading generously. If you keep up with readings, attend sessions (once a week), and complete assignments whole heartedly, there is no reason you should not do well. \n"
        }
    ]
}