{
    "prof_info": [
        {
            "prof_name": "Farah Griffin",
            "prof_id": 2893,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "African-American Literature I",
            "review_date": "January 28, 2014",
            "review_content": "\nAmazing class! All selected texts are incredibly interesting and enlightening. Her lecture style is excellent, very engaging, yet relaxed. There's one 5-page paper, one in class midterm (IDs, passage analysis, and essay) and one take home final (three 2-4 page essays on different topics and including most of the texts/authors as options for analysis...basically lots of freedom to craft eloquent essays). If you do the readings, you will do very well in the class. I recommend attending lectures because Farah Griffin provides great insight on the various texts. Midterm: 92, Essay: 92, Final: 96\nWorkload:\nVery mild. \n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "January 07, 2014",
            "review_content": "\nI adored this class.  Professor Griffin is an amazing teacher, and the subject matter was very interesting.  She is a great lecturer, and as long as you pay attention to her and attend class regularly there is no reason why you should not get an A.  The TA, Valeria Tsygankova, was also extremely helpful, and was willing to extend an essay deadline that was due a day when I had three other papers due.  I definitely recommend this class to fulfill a literature requirement; it's not too difficult and very interesting, and could be a good GPA boost if you play your cards right.\nWorkload:\nNot bad at all; in class midterm, take home final, and essay.  She did surprise us with a pop quiz but it ended up not counting towards our final grade.  There are readings (obviously) but you can do those the night or two before and still do well.\n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "January 07, 2011",
            "review_content": "\nExcellent class. Professor Griffin assigns the right amount of work for each class, it's substantial enough that you feel like you're leaning, but not so much that you feel overwhelmed and don't do it. Her lectures are really interesting and she takes questions at the end of each class. She is able to place each text within a historical and literary context so you leave feeling like you've really understood many dimensions of the text. She's super nice and funny, very welcoming at office hours and replies promptly to emails. Highly recommended for anyone looking to get a solid background in AA literature. \nWorkload:\n1 midterm paper (5 pages), 1 in class midterm (super straightforward if you do the reading and review) and 1 take home final (3 mini papers)\n"
        },
        {
            "course_name": "African-American Literature I",
            "review_date": "December 17, 2010",
            "review_content": "\nProfessor Griffin is a wonderful instructor. Not only is she incredibly articulate and engaging, but she is also readily available to meet with her students outside of class. Although this was a lecture class, Professor Griffin made an effort to include students in discussion. The readings were all very interesting and Professor Griffin's ability to break down texts made them even more enjoyable. Professor Griffin truly seems to care about enabling her students to succeed in the class. Not to mention the TA, Jarvis, was equally as helpful and approachable!\nWorkload:\nFairly light. Many of the readings were excerpted. In terms of graded assignments, the class was given a take-home final (50%) consisting of three 3-4 page essays, an in-class midterm (25%), and a critical 5-page essay (25%).   \n"
        },
        {
            "course_name": "African American Literature",
            "review_date": "January 14, 2008",
            "review_content": "\nLoved the class, fantastic lecturer, at the forefront of her field. Columbia is lucky to have her and you will be very lucky to take a class with her.\nWorkload:\nLight, variable reading before class, event review, midterm, final, and paper all equally weighted for the final grade\n"
        },
        {
            "course_name": "African American Literature",
            "review_date": "December 20, 2007",
            "review_content": "\nI was disappointed.  While Professor Griffin is very nice and incredibly knowledgeable, it was hard for me to invest much in this class.  Part of the reason was that I didn't find my classmates' comments to be particularly insightful, and I wanted Prof. Griffin to clamp down on that more.  Also, her grading was extremely easy-- it did not give me much incentive to work harder.\nThat said, the reading is interesting and you will learn a lot about black intellectual history.  I wish we read more complete novels rather than excerpts, but the nonfiction (political) stuff we read was very good.\n\nWorkload:\nEasy. Midterm, 5 page paper, take home final, and event report (where you go to an event related to the course and write a page or two about it).  not too much reading each week.\n"
        },
        {
            "course_name": "African American Literature",
            "review_date": "December 20, 2007",
            "review_content": "\nI was disappointed.  While Professor Griffin is very nice and incredibly knowledgeable, it was hard for me to invest much in this class.  Part of the reason was that I didn't find my classmates' comments to be particularly insightful, and I wanted Prof. Griffin to clamp down on that more.  Also, her grading was extremely easy-- it did not give me much incentive to work harder.\nThat said, the reading is interesting and you will learn a lot about black intellectual history.  I wish we read more complete novels rather than excerpts, but the nonfiction (political) stuff we read was very good.\n\nWorkload:\nEasy. Midterm, 5 page paper, take home final, and event report (where you go to an event related to the course and write a page or two about it).  not too much reading each week.\n"
        },
        {
            "course_name": "African American Literature",
            "review_date": "December 20, 2007",
            "review_content": "\nI was disappointed.  While Professor Griffin is very nice and incredibly knowledgeable, it was hard for me to invest much in this class.  Part of the reason was that I didn't find my classmates' comments to be particularly insightful, and I wanted Prof. Griffin to clamp down on that more.  Also, her grading was extremely easy-- it did not give me much incentive to work harder.\nThat said, the reading is interesting and you will learn a lot about black intellectual history.  I wish we read more complete novels rather than excerpts, but the nonfiction (political) stuff we read was very good.\n\nWorkload:\nEasy. Midterm, 5 page paper, take home final, and event report (where you go to an event related to the course and write a page or two about it).  not too much reading each week.\n"
        },
        {
            "course_name": "African American Literature",
            "review_date": "May 17, 2006",
            "review_content": "\nI just want to begin with: I hope that I can take another class with this woman  before I graduate.  She must be the best kept secret on CULPA.\nI think Dr. Griffin is actually forced to keep her feet wet amongst undergraduates because she lectures as if we know a lot more than a lot of us actually know. She seems to really enjoy talking to the students who can connect what we are reading to their knowledge of the cannon of African American and feminist literature although she encourages new interpretations of the work. If you can make a good argument for something she didnÂ’t lecture on, she is receptive. So for everybody who wants an opportunity to express their thoughts that fall outside of the regurgitative box that the professor builtÂ—hereÂ’s your chance.\nShe's very passionate about her subject and wants her students to understand everything that birthed the writings. This is her life. She writes books about it, lectures about it and runs the Institute for Research in African American Studies which amounts to her probably being one of the busiest professors with whom you will have to try to meet and her schedule fills up quickly. Email her and youÂ’ll have more success. SheÂ’ll reply to your email and have an answer ready to discuss with you and/or the class at the next meeting.\nDr. GriffinÂ’s appointments have to go through her secretary. Only use her secretary for appointments. If you have questions about anything else go to the TA or Dr. GriffinÂ…just trust me on this. \nAll in all, there's a good spread of assignments to give you an opportunity to make your grade.\nGriffinÂ’s very clear about \"mapping\" the themes that she is focused on for each book and the unity of themes between the books so if you read and attend her lectures you can, in my opinion, easily do well on her exam. There were  appx. three people who got 100s on the midterm and 12 or 14 \"A\"s in a class of 40. \nShe gives the paper assignment a month before it is due so you have plenty of time to write it. It was due on the last day of finals so we havenÂ’t gotten them back yet. It doesn't seem that she expects anyone to really do well on the paper and her former students say she grades papers harshly so weÂ’ll see. \nThe TA this year Â– Jamel was an EXTREMELY accessible guy who was enthusiastic about helping us with our papers. \nThere is a group web project that is supposed to be fun that is supposed to allow you to seriously boost your grade if you mess up on the midterm or paper. \nBeware on the group project-- Griffin just tells you to do it without setting deadlines along the way for progress check-ins so if you don't make your group work on it before the last week, there is a good chance that they will not do anything until 3am the morning that it is do. \nMy one problem: Its the end of the semester, the seniors graduated today and I still don't know how I did on my group project which we did three weeks ago. \nAs always, there was a little too much historical/political influence crap that Columbia professors really seem to be into and I did start to mistakenly call this class African American History instead of African American Literature.  However, she unpacks the novel as creative literature for, and with the class so it kind of makes up for the history lessons. \nKey ideas: Migration Narrative, Ancestors, Musicality in the prose, \nFinal Tip: Ask questions about every book. The more class participation Â– the fewer quizzes.\n\nWorkload:\nMidterm(IDs and an essay), 10-15 page paper, Group project, response papers and quiz\n"
        },
        {
            "course_name": "African American Literature",
            "review_date": "April 21, 2006",
            "review_content": "\nDr. Griffin is absolutely passionate about her topic. Unfortuneately she analyzes the novels withing the context of their social/historical/political framework but so do half the profs in the English department. She does comment on the poetry of Baldwin and Morrisson but you just can't miss that. Major themes that you are going to be tested on will be both literary and political with a slant towards course long political themes. \nShe's really sweet and approachable but not highly accessible since she must have one of the busiest schedules on the campus. \nShe is responsive to emails and gives you a lot of notice for all of your assignments like 1-3 months in advance instead of just two weeks like some of the professors. \nBut... she does not grade generously. Do your work, come to class stay on top of things and really knock out at least one thing and you'll be okay because she gives the heaviest weight to the assignment that you do the best on and will calculate the worst assignment at a muuuuuch lower percentage rate. \nShe has one of the most interesting classes that I have taken in my two semesters at Columbia so its a shame she's taking off for 2006-2007 to write a book but that's what she does. \nWorkload:\nOne midterm, pop quizes, response papers, group project (ICK!!), 10-15 page final analytical paper\n"
        }
    ]
}