{
    "prof_info": [
        {
            "prof_name": "Royden Kadyschuk",
            "prof_id": 11157,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Reading David Foster Wallace",
            "review_date": "October 02, 2014",
            "review_content": "\nOn the surface, Royden seems like the perfect professor: relaxed, engaging, knowledgeable....hip. Unfortunately, there's not much under the veneer of \"the cool grad student teaching a summer class\". \nThe class is a blast. If you are a fan of DFW, you will love it. The main draw is interacting with the small class. Royden does a good job of facilitating discussion and adds a lot of insight which is not surprising since he has taught the class for like 5 summers.\nIf all you want is a deep reading of DFW and a good discussion section about his work, then you will get a lot out of this class. If you want to make yourself a better writer, a better close-reader, or get productive feedback on your work, this is not the class in which to do it.\nDespite promises of feedback regarding our written work, specifically the final paper and take-home exam, Royden literally vanished when it came time to make good. In talking with others who took the class, I came to realize that I was not the only student whom he let down. He didn't respond to email (at all), he made mistakes when calculating grades, and seemingly doled out grades using a dartboard. I saw him on campus recently, and it was as if I had never taken the class: no recognition.\nThis is very disappointing since, from the beginning of the class, he presents himself as engaged and on top of things. I was ready for one of those transformative Columbia experiences, but ended up having one of those \"Oh, they don't really give a shit\" experiences that are also common here.\nKeep our expectations low. You will get out of it exactly what you put into it, and your grade might reflect that. Who knows?\nWorkload:\nLots of reading, but that's obvious. Short presentation , 2 page paper, 5 page paper, take-home final. Easy if you stay on top of the reading.\n"
        },
        {
            "course_name": "Reading David Foster Wallace",
            "review_date": "August 01, 2013",
            "review_content": "\nRoyden is super helpful and sweet, and the six weeks we spent reading David Foster Wallace were great. Yes, we read a lot (all of Infinite Jest, plus short stories and fiction pieces) but if you enjoy DFW (and, come on, you wouldn't be taking this class if you didn't) then it's not bad, and you have a bunch of other people that are slogging through all the reading, too. There are definitely easier English courses out there, but the workload, ultimately, wasn't too much to handle. \nWorkload:\n~2,000 pages of reading over six weeks (about 200 or 300 pages per class), one final paper, and a take home final (all essays, not difficult). \n"
        },
        {
            "course_name": "AMST 4000 Intro to American Studies",
            "review_date": "May 18, 2011",
            "review_content": "\nRoyden is the cutest TA ever. He is just adorable. First, for Intro to American Studies, he prepared lamenated, professional-quality handouts for every section. Sometimes they were bookmarks, sometimes book covers, and they had pictures and quotes from the texts we were discussing that week. It was so nice to know that he really prepared for every section, and his students got a souvenir each week. But on top of this, he's just a really nice guy. He's soft-spoken and always willing to talk to you and answer your questions. He loves it when people have strong views about the text, and he is always encouraging when students participate in discussion. Great TA.\nWorkload:\nN/A\n"
        }
    ]
}