{
    "prof_info": [
        {
            "prof_name": "Erika Jakubassa",
            "prof_id": 1748,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Weimar Cinema",
            "review_date": "November 11, 2003",
            "review_content": "\nthe bad review here causes me to leap to erika's defense, because, damn it, she is cool. to that previous reviewer: chill the [bleep] out and stop blaming this instructor for the morons in your class. sheesh. i'm in this class right now and am enjoying it thoroughly, though i am lucky to have an intelligent, articulate group of students in it with me. the selection of films is a good intro to the period, and the class complements well my studies in german art and history. erika is a bit reserved but funny, and at times quite insightful out of nowhere. the presentations did seem kind of unnecessary but they are what you make them: give a middle school level one if you want, or go a little further and do something more interesting. i quite recommend this laid back, interesting class.\nWorkload:\none presentation, a midterm paper (about 5 p) and a final paper (about 10 p). about three articles per week to read that i enjoy and actually look forward to for the most part.\n"
        },
        {
            "course_name": "Cultural History of Weimar Cinema",
            "review_date": "October 27, 2003",
            "review_content": "\nMake no mistake, this is a horrible class taught by incompetent, annoying, and (appropriately) German professor .Frau Jakubassa ensures that the class discussions will leave you bored beyond belief. The readings are interesting, and the films you watch are spectacular, but Erika has no idea how to lead a class, or illuminate you on the more exciting points of Weimar cinema. She clearly has nothing interesting to say herself, limiting her interjections to bored, half-hearted affirmations of whatever crap some lame barnard girl is spewing. Some people will tell you, \"oh she knows her subject, but she just likes to let the discussion take its course.\"  Don't fall for this easy excuse. If she knows her stuff, she should talk about it in a lively, engaging manner; but she doesn't. I had the misfortune of being in class with some incredibly awful people, and Erika let them dominate the discussion, even though it was obvious she was as disinterested in their monologues as the rest of the class. Nothing she says is interesting. She makes you do middle-school presentations in class where she assigns you a subject (eg. Fritz Lang) and you have to make a 5 minute speech about Fritz lang. Nothing original, just get an encyclopedia and photocopy the page on Fritz Lang and read it out aloud. Also, since she has no idea what she's doing, she makes up for it by being nit-picky with your presentations, pretending that she's doing her job as a film professor. This pretty much sums up the class. She offers no insights apart from the rote \"social mobility,\" \"class difference\" mumbo-jumbo she likes to cough up every now and then. Clearly she knows little about artistic movements in film, much less discussing them in class. I started off the semester being hopeful - then things got progressively worse. The drop deadline came and went, and I still held out hope. Then, about two months into the class, panic set in when I began to realize how much I hated this class and how badly I  wanted to skip class and just watch the movies on my own time. She has no business teaching a class anywhere.\nWorkload:\nAwful in class presentationOne final essayReadings every week\n"
        }
    ]
}