{
    "prof_info": [
        {
            "prof_name": "Gil Anidjar",
            "prof_id": 392,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "God",
            "review_date": "April 26, 2016",
            "review_content": "\nGil had an interesting teaching style. He always asked for questions at the beginning of lecture, but didn't always seem to get around to answering them. He just kind of talked about what he had planned and then if something was related to a question, would point that out. I guess he took questions to encourage participation, but I had no motivation to ask a question because I didn't think it would be answered. Pretty much everything he said was interesting, though.\nTOO MUCH reading. There weren't many assignments so reading was basically the only thing we had to do, but it was impossible to get through it all. I ended up doing very little of it on a weekly basis and then doing what was necessary for the midterm and final paper.\nThe only reason I'm hesitant to say I'd recommend is because Gil added an attendance policy after the drop deadline, and students could only miss 2 classes. That was pretty annoying for someone who hadn't been missing very often, but wanted the option when necessary. \nWorkload:\nA lot of weekly reading\nMidterm paper on 3 readings\nFinal take-home paper\n"
        },
        {
            "course_name": "Religion 101",
            "review_date": "January 02, 2012",
            "review_content": "\nThis course is not one to have expectations of, and, to his credit, Prof. Anidjar is very up front about this fact. His lectures appear to be improvised, and are usually based off of whatever questions from students he can scrounge up--promulgated usually by the 25% of your grade that comes from class participation.\nThe texts are exceedingly difficult and his lectures have to be reflected upon, but if you're willing to really think about them it's probably worth your time. The review sessions held before the midterm and the final by TAs were essential to understanding the course, but attendance is also important--even though at times it feels futile.\nHe said in one class, and it became a theme, \"it is impossible to evaluate a class until five years after it ends,\" so perhaps this review is futile. That's kind of how the whole thing goes, anyway.\nWorkload:\nTwo papers, a midterm and a final, written in 24 hours for between 8 and ten pages. A challenge, but graded by the TAs.\n"
        },
        {
            "course_name": "Religion 101",
            "review_date": "December 30, 2009",
            "review_content": "\nWell, for a professor that turned up in \"America's 101 most dangerous professors\", or whatever, I was expecting at least one psychotic episode in class, or maybe just a good solid racial slur, but got neither. What I did get however was a well instructed lecture. Here's How Professor Aninijar runs things:\nFirst, he comes in and trys to get everyone that is in the class to get an easy A to peace out, but being incredibly boring the first two classes.\nAfter the drop deadline, and half of the class vacated, he starts instructing. He does so by mentioning some news article or current event. This story, that is articulated very casually, is then used as an anchor exhibit for say.. Foucalt, or some other reading we are focusing on that week. \nWe did'nt cover a rolodex of the world religions in this class because as the class trys to communicate, the dividing done to these religions, filed away in these nice names, is a warp on religion itself. \nSomething to know before taking this professor's classes: He does not give a flying f*ck about what your idea of a \"normal\" course is, or how bad it will ruffle your feathers to do something out of the box. \n\nWorkload:\nLIGHT\n"
        },
        {
            "course_name": "Religion 101",
            "review_date": "December 21, 2009",
            "review_content": "\nIf you want to take a comparative religions class, this is not the course for you!  The reading list includes some books that relate to religion and many that do not.  The goal of the course is to rethink the way we consider religion and to \"relinquish religion,\" but the majority of the class time was spent not analyzing religion or actually learning anything, but rather discussing bits and pieces of the books and then getting majorly sidetracked.  Although Professor Anidjar knows his material and is a wealth of information, the course failed to actually teach anything substantial.  About half the class didn't even bother coming to lecture, and I found myself often needing to drink coffee to avoid falling asleep in class.\nWorkload:\nEasy.  The syllabus outlines about fifteen books, or a book a week, but you can get by without really reading any of them.  If you skim a chapter or so of a few books you'll be fine.  Two papers (5-6 pages each) relating various non-religious ideas to religion.  \n"
        },
        {
            "course_name": "Religion 101",
            "review_date": "December 10, 2009",
            "review_content": "\nAlthough called religion 101, this course provided no information on religion in the way one would expect. We did not study Judaism, Christianity, or Buddhism, but rather spent class time having (granted entertaining) irrelevant discussions on books that no one in class read. The books cost me over 300 dollars and I read at most a chapter out of each one because it is not necessary and they were all quite long. There was no motivation to read, or even come to class for that matter since attendance was not taken-- even though it counted for a third of our grade? The discussions were very interesting, and the professor is clearly brilliant, but I didn't feel like I learned anything other than how to see religion in different ways (as sexual difference, law, ect.). Interesting in theory but a rather disappointing class in terms of taking away any kind of learning experience. One positive thing is that Gil really makes you think and often asked the class to ask questions that could not be answered; however, this does not constitute an entire course. Global core, woohoo.\nWorkload:\nRather light, only a take home midterm and take home final. Five-six pages on a prompt he provides in class. Consists mainly of write about what religion means without thinking about it in terms of specific religions, but rather equating religion to other entities. \n"
        },
        {
            "course_name": "Jews and Arabs",
            "review_date": "November 30, 2009",
            "review_content": "\nThis course was on neither Jews nor Arabs. Don't bother taking it if you're looking for a course that, in some way, fits that description. If you are, however, looking for a course on unicorns or forks (I'm not even kidding) you might consider taking Gil's class. Most classes were spent doing deconstructive readings of texts which would end up branching out into abstract, philosophical discussions which no one, not even those participating, actually followed. This is where the extensive discussions on unicorns came up. Three classes were spent on one word in Said's Orientalism. The week after, we actually zoomed out and read the sentence from which the word came. If close readings of texts are your thing... enjoy! If not, this course will most likely baffle you. I could probably BS my way through some contrived explanation of how this approach to reading texts somehow relates to Jews and Arabs but... you'd have to be under the influence of something to buy it\nNo syllabus. He verbally tells you which books to buy but don't even bother purchasing them-- you'll only end up reading a sentence in most anyway. \nGil himself is actually quite approachable and nice. Despite feeling slightly misled by the course title, I actually enjoyed the class. That also might have had something to do with the A- at the end of a semester of NO WORK with the exception of a 5-page paper (which I threw together the night before).\nWorkload:\nOne five-page final paper on any text covered in class.\nAn easy A if you actually participate. If you do no work, like I did, you can expect an A-.\n"
        },
        {
            "course_name": "Jews and Arabs",
            "review_date": "November 30, 2009",
            "review_content": "\nThis course was on neither Jews nor Arabs. Don't bother taking it if you're looking for a course that, in some way, fits that description. If you are, however, looking for a course on unicorns or forks (I'm not even kidding) you might consider taking Gil's class. Most classes were spent doing deconstructive readings of texts which would end up branching out into abstract, philosophical discussions which no one, not even those participating, actually followed. This is where the extensive discussions on unicorns came up. Three classes were spent on one word in Said's Orientalism. The week after, we actually zoomed out and read the sentence from which the word came. If close readings of texts are your thing... enjoy! If not, this course will most likely baffle you. I could probably BS my way through some contrived explanation of how this approach to reading texts somehow relates to Jews and Arabs but... you'd have to be under the influence of something to buy it\nNo syllabus. He verbally tells you which books to buy but don't even bother purchasing them-- you'll only end up reading a sentence in most anyway. \nGil himself is actually quite approachable and nice. Despite feeling slightly misled by the course title, I actually enjoyed the class. That also might have had something to do with the A- at the end of a semester of NO WORK with the exception of a 5-page paper (which I threw together the night before).\nWorkload:\nOne five-page final paper on any text covered in class.\nAn easy A if you actually participate. If you do no work, like I did, you can expect an A-.\n"
        },
        {
            "course_name": "Jews and Arabs",
            "review_date": "January 20, 2008",
            "review_content": "\nI cannot express how little he cares about this class, or teaching in general. \nHe WILL teach you to read in a different way, which is exciting once you get past the arduousness. \nIt was aggravating to buy 15 expensive books and only read 5. So buy them one at a time..he doesn't follow any syllabus. And went spent the first part of the semester reading Orientalism.\nBut for my grade, I thankful.\nWorkload:\none final 5-pager, that's it\n"
        },
        {
            "course_name": "Freud & Derrida: An Introduction",
            "review_date": "July 25, 2007",
            "review_content": "\nHe's no walk in the park (try Derrida or Freud!).  I was confused by him, but that should not necessitate that he was confusing.  It takes time to work on the level with him.  He's moving very slowly.  So slowly that I never caught up to him.  He can handle silence.  He listens well.  He'll appear to say things that he did not say, hence people calling him mean.  He sticks to his guns unless there's a strong enough point to convince him otherwise.  His thought provocations are reason enough to stand in the classroom if there aren't any chairs.\nWorkload:\nAll of Freud, maybe Derrida. (Impossible)\nA 10 page reading of one paragraph. (Possible)\n"
        },
        {
            "course_name": "Freud & Derrida: An Introduction",
            "review_date": "July 25, 2007",
            "review_content": "\nHe's no walk in the park (try Derrida or Freud!).  I was confused by him, but that should not necessitate that he was confusing.  It takes time to work on the level with him.  He's moving very slowly.  So slowly that I never caught up to him.  He can handle silence.  He listens well.  He'll appear to say things that he did not say, hence people calling him mean.  He sticks to his guns unless there's a strong enough point to convince him otherwise.  His thought provocations are reason enough to stand in the classroom if there aren't any chairs.\nWorkload:\nAll of Freud, maybe Derrida. (Impossible)\nA 10 page reading of one paragraph. (Possible)\n"
        },
        {
            "course_name": "Freud & Derrida: An Introduction",
            "review_date": "May 21, 2005",
            "review_content": "\nHe is too cool for school, it's true, which is why all the women in the class are in love with him. He is certainly nicer to the women who speak up than the men, which does not say much, because he is not very nice to either. That said, he is an excellent teacher: he brought a new dimension to my learning at Columbia by demanding that students look at not only individual words, but also syntax, and not only what a text says, but also HOW it says it (i.e. what does this sentence do? what does it produce in you as a reader? ). The only written assignment for the class was a final 10-12 page paper which required students to pick one paragraph from any of the texts we had laboriously and repeatedly read, and show how it means (through explication). \nThe class and the professor are both highly recommended because there is no bullshit--how rare!\nWorkload:\nAnidjar asked that we come to the second week of class having read all of the texts (of which there were perhaps 10). Most people probably read about 50 pages per week. One 10-12 page final paper. Anidjar probably doesn't care enough about grades to give you a bad one.\n"
        },
        {
            "course_name": "Freud & Derrida: An Introduction",
            "review_date": "April 29, 2005",
            "review_content": "\nA decidedly odd man, I would highly recommend this class to anyone who is remotely interested in understanding how Freud and Derrida thought.  Prof. Anidjar cares deeply about the material and it comes across in his instruction, which is highly specific.  His strongest point is also his weakest:  he seems to believe that reading should be a slow and painful process.  The effort can be both endlessly rewarding and draining, and not always successful (nor, I suppose, should it be).  Prof. Anidjar adds new dimension to the phrase \"too cool for school\" and takes himself entirely too seriously (and yet, he is the most caustically sarcastic man I've ever met).  Those however, are only personal observations, and on a whole, the class and Prof. Anidjar are highly recommended.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 29, 2003",
            "review_content": "\nwhile he may be condescending to some, he's a genius, and you'll be thankful you took him down the line.  you will not get away with saying any bs in this class.  every comment you make will be meticulously picked apart and decimated if need be.    lots of work, but worth it.\nWorkload:\nfull book before class, reading responses.  lenient grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 23, 2003",
            "review_content": "\nI wasn't in his class in the beginning, but I heard he was pretty intimidating and tough.  This is just to scare people off and it worked because there was only about 12 students in the class left.  At times, he makes you feel stupid, but it's still a class you want to take.  He might be a tough grader, but in the end your grades don't count because the lowest he will give is a B.  Stay in the class!!!\nWorkload:\nShort 200 word response on each book the first day, midterm, dept final, 2 papers 1-5/6, 2-7/8\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 21, 2002",
            "review_content": "\nGil Anidjar takes time getting used to - he seems quite intimidating, serious, and anal about details from the get go, but as the class goes on, you realize that he's a pretty down to earth guy with a sarcastic sense of humor. The class is pretty intense and you're expected to read everything, or at least half of the book, by the first discussion on it. He forces you to back up your opinions with lots of textual references, and class participation is a must. Overall, he's a good prof, but not for the faint of heart.\nWorkload:\n2 papers, one 5-6 pgs, the other 7-8. lots of reading (obviously it's lithum), midterm, dept. final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 07, 2002",
            "review_content": "\nIgnore the negative reviews, which are mostly from those afraid of a challenge and who probably dropped out after the first couple of weeks. Prof. Anidjar, one of the leading Biblical scholars of his generation, was quite simply the best English instructor I ever had. He'll make you work -- you do have to read an entire text before each class -- but it's worth it, though intimidating the first couple of weeks. He'll force you to question any preconceived, knee-jerk conclusions you're tempted to spew out without close reading and thinking -- and it carries over to real life when you're analyzing newswriting or watching what you write. A friendly guy with a dry sense of humor, too, whom you'll appreciate increasingly more once the class is over.\nWorkload:\nTwo papers, weekly reader reaction/close reading to the text, final, midterm, texts\n"
        },
        {
            "course_name": "Contemporary Israeli Short Story",
            "review_date": "April 03, 2002",
            "review_content": "\nGreat guy. He is not condescending in any way, in fact you get a feeling like he is Â“one of the guysÂ”. Always available after class and understands if you have serious domestic issues that may require extension on any assignment. He does not impose any political views (in fact I have no idea what his political views are) but engages in class discussions. If you are at Columbia to learn, take his class.\nWorkload:\nLots of reading, simple 2 paragraph 'book report' every week, but only one 10 page paper at the end of the semester.\n"
        },
        {
            "course_name": "Contemporary Israeli Short Story",
            "review_date": "January 03, 2002",
            "review_content": "\nGreat course, great Prof. There is a lot of reading but the lectures and discussions are some of the best that I have ever experienced at Columbia. Grading is very fair and the class met only once a week.\nWorkload:\nlots of reading 1-2 page essay each week, 10-15 page essay as final project\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2001",
            "review_content": "\nI just signed up for this class a few days ago. I went to the first class and was appalled at the amount of work he gives. I mean, freshman have to write a paper a week for L & R (they don't know that, but as a sophomore, I do!). He also wants everyone to write a paper a week, in addition to the major papers. He digressed almost immediately, and stayed off topic for a long while. He also does not split the reading up. He expects the books to be read for the first class. Since I'm a sophomore, I dropped this class immediately. I feel horribly for the freshmen who are stuck with him. Good luck guys.\nWorkload:\nAvoid if possible. Way too much. A 300-500 word paper per week. 2-3 major papers. Books read for first class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 1999",
            "review_content": "\nGil Anidjar is condescending, has a superior attitude, and even goes as far as to announce that he does not really believe in compliments. He typically spends the first half of class insulting students' work from the previous class. He rarely lectures, but rather lets students lead the discussion by talking about their favorite passages, while he observes with a sullen and bored expression on his face. When he does give his insight, it is typically philosophical garble about the relationship between the past, present, and future rather than specifics about any text. Additionally, he has a poor attendance record and his strong foreign accent is often difficult to understand.\nWorkload:\nMuch more than the typical Lit Hum class. A 1-2 page paper is due every class, along with two other 6-8 page papers. He also requires that each text be completely read by the initial day of discussion rather that in appropriate intervals. The mid-term is much more extensive those of other professors and requires quote identification, along with context, lineage, etc. in addition to two long essays. Standard final exam.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 31, 1999",
            "review_content": "\nI just wanted to say that the person who wrote the first review should recieve the Pulitzer Prize for absolute correctness in Professor review. If you have a choice of lighting your hair on fire or taking lit hum with him, do not hesitate to light your hair on fire!\nWorkload:\nINCREDIBLY more than other lit hum classes\n"
        }
    ]
}