{
    "prof_info": [
        {
            "prof_name": "Lara Kammrath",
            "prof_id": 2027,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Organizational Psychology",
            "review_date": "May 04, 2006",
            "review_content": "\nI read so many great reviews for this course that I could not be more dissappointed. Be prepared to sit through three hours of meaningless common sense business environment advice like \"when giving feedback do it in a constructive way, dont attack\"...also the professor couldnt be less interesting to listen to. The reading is useless except to have the jargon. You spend three months in a team with three other people making up a fake business proposal (that you get no instruction on and has nothing to do with class readings, be prepared for an unfair grade for the written portion). All in all a really annoying, frustrating experience for what could be a great class. The fault lies on the professor and her selected readings.\nWorkload:\nP10 pg planning paper, 15 page written proposal, 15 minute presentation, all with the team,...8 pg indiv final paper and a final exam....a LOT of busy work with no real reward---avoid it.\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 23, 2006",
            "review_content": "\nI want to start off by saying that the other reviews of this professor are naieve at best.\n--the course topic is interesting, engaging and pop-culturally relevant but not academic (or not presented in an academic way) at all. there is a limit to how well/much one can teach the virtues of good business. it's like training someone to have a better sense of humor. maybe it could work, sort of. and there's no way it's going to be a complete success. \n--the class is so long, it verges on torture. people spent copious time doodling, text-messaging and playing games like minesweeper, to give you an idea of what might be more entertaining than the lecture itself\n--the first half of class is generally a lecture. kammrath addresses the class as if they were in approximately the 7th grade. there are some cool things you learn about business dynamics, but the entire course is devoted to sugar coating concepts and abstracting real ideas so much so that they beocme vague/weak/misunderstood\n--incredibly annoying 'target' language that becomes the rule rather than the exception. no offensive words, nothing that inherently implies a conflict, distrust or failure.\n--the second half of the class is an activity that is geared at driving the lecture topic home. it resembles a psych lab. the activities are sometimes enjoyable, definately better than listening to the lecture, but everyone takes them so seriously/personally---it becomes profoundly obvious that they do not realize that the exercises are not in REAL LIFE\n--Kammrath is nice and sweet, but boring and likes to cite her own flaws to the class. no cool stories or comedy from this woman. and she wont blow you away w/ her brilliance or command of the subject. She was a slight upgrade from a kindly TA. \n--overall, the topic is fun to learn about, and pretty light hearted. the class is a bit remniscient of an afterschool program. actually, i would say it's exactly like an afterschool program. too long, sometimes fun, but ultimately a take-it or leave-it kind of class. \nWorkload:\n--there is a TON of assigned reading, almost none of which is required in earnest. i would do one or two of the assigned readings, or just skim a few random pages. sometimes i wouldnt do anything to prepare, and i still had no trouble being an active memeber of the class discussion. bsing is EASY here. try and look like you're paying attention, a little creative thought and some good synonyms go a long way. \n--weekly reading that could choke a horse, group project (dont ask), final paper, final essay-style exam, oh and a participation grade! hooray for teachers who feel like taking attendance is a good way to make people want to show up and get them enthused about joining the class discussion\n--the group project is potentially a nightmare. she appoints the groups, there is no way to guarantee input from other group members--you cant fire anyone or force them to do a fair amount of work, or if they do have an input, there is no guarantee that it will be near the quality of work that you would be comfortable with turning in. do i sound like im speaking from experience?\nnot horrible, because there is limited crediblity in the field itself. most professional business psychologists make things up out of thin air, so its easy for you to do the same\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "August 26, 2005",
            "review_content": "\ni really really like lara. shes interesting and a really great professor. take any class with her. its almost impossible that youd be disappointed.\nWorkload:\nnever heavy. you might find yourself working extra hard just to impress her though.\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "August 09, 2004",
            "review_content": "\nThis was a good class overall.  Attending lectures is not neccesary, nor is reading the book, because the lecture notes are all posted online (this may not cover 100% of the material but it comes pretty close - enough to pull off an A of you really know the lecture notes well).  However the lectures aren't that bad - I fell asleep sometimes but while I was awake they were pretty interesting, and attending lectures definitely did help make studying easier.  The material is definitely intersting also, its the type of stuff you'll find yourself repeating to your friends as in \"hey wanna hear something cool I learned today?\" or \"ya know how we though Jake and Lisa had a really screwed up relationship bec they fight all the time? well I learned . . .\"\nto sum up, its an easy class with minimal work and interesting material\nWorkload:\nsome reading which is not neccesary\n3 non cumulative exams with 50 Mult choice and 6 short answer.  she curves but people usually did pretty well so the curve wasnt so big\noffers an extra credit paper which can raise your overall grade between 1 and 5 points, but its a long assignment and Kammrath said shed be a tough grader on it. i didnt do it so I dont know if its worthwhile.\n"
        },
        {
            "course_name": "Introduction to Social Cognition",
            "review_date": "July 26, 2004",
            "review_content": "\nTerrific professor!  Take this class if youcan!  She is very positive, caring and enthusiastic.  It is very clear that she loves to teach, she cares about her students and she wants everyone to do well.  The class itself is extremely interesting and the readings are great!\nWorkload:\nShort response papers, presentation and a short final paper.\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "July 14, 2004",
            "review_content": "\nA wonderful professsor, Kammrath always delivers a fascinating lectures filled with different psych experiments and modern day examples to support different psych theories. She always answers questions, and no matter how off topic someone's question may be, she always tries to find its relevance and is never condescending. And although she may go too quickly in class, all of her lecture notes are posted on courseworks. The reading is also not too heavy and very interesting whether you are a psych major or not.  Furthermore, she is very approachable and always makes time to speak with students outside of class. An overall excellent class.\nWorkload:\nThree noncumulativ exams, for which she always gives study guides and practice midterms. Nightly reading. If you do most of the reading, and use the study guides and practice exams, you should do well in the class.\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "May 14, 2004",
            "review_content": "\nAWESOME PROFESSOR!!! She gives you a study sheet, practice exam, and review session before every exam. She even comes in on her own time during the weekend for the review session, which is so nice. Her lecture notes are all on courseworks. Also, if you ever cannot make the review sessions, she's also open to seeing you during her office hours for questions. She is awesome! She's damn smart in psyc and she's great at answering questions. Also, she's always so nice and cheerful everyday.  I would definitely recommend this class. THe lecture was better than the lab to me only because the labs were kind of tedious to me. The topic of social psychology is way interesting in itself.  Great class.\nWorkload:\nNo homework. Reading articles now and then. 2 midterms and a final. Not cumulative. If you take the lab, there are 3 labs and the lab section overall counts as 30% of your class grade. The exams are not that bad. She has a variety of questions from the way easy to the challenging.  But again, she's really open to questions and she's very personable. Love her. Can't wait to take another class with her. \n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "April 13, 2004",
            "review_content": "\nI really appreciated Dr. Kammrath's thorough knowledge of the material and her willingness to impart this knowledge on her students. She always took time for questions and explained everything very clearly to the class. However, I cant deny that there were times when I was less than enthused to attend her class. She goes over a lot of studies to prove each theory, which in my opinion, got a little boring...in fact I was known to fall asleep for extended periods of time in class. She is a big fan of Powerpoint and as a result her lectures can be very detailed. The benefit of this is that she includes all the relevant information from the text book making it easy to suceed on her exams without ever having read from the text book.\nOverall, she knows exactley what she is talking about, and makes it easy to do well in her class. I would reccommend taking this class because in the end I did learn a lot even if it was at times a little boring.\nWorkload:\nUsual for a psych class: 3 noncumulative exams, the reading was (if you attended most lectures) completely optional since she summarizes all the important stuff in class. Overall, extremely doable\n"
        }
    ]
}