{
    "prof_info": [
        {
            "prof_name": "Eric Matheis",
            "prof_id": 12973,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I",
            "review_date": "September 06, 2015",
            "review_content": "\nProfessor Matheis was very passionate about French, and made it fun to learn. I loved the way he explained the grammar and answered detailed questions about it, and the detailed comments on the papers. I think I started thinking in French!\nWorkload:\nan hour each class\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 16, 2014",
            "review_content": "\nI had a great semester with Prof Matheis. He taught clearly and patiently and leaves thoughtful comments on your tests and compositions. Yes, he speaks the majority of times in French but that's the way you learn. He is also a super nice guy and very reasonable with attendance, grading, etc. He includes poems, songs, etc. to make courses more interesting and culturally relevant. I was a complete beginner when I started and now am able to hold a (really) basic conversation. I'd recommend him for FREN 1101\nWorkload:\n~2 hours work outside of class each week. \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "September 10, 2014",
            "review_content": "\nI entered class on the first day not knowing any french, and i was told that the course would be a \"emersion\" learning experience. It was basically a class where he spoke to us as though we know french and had been speaking it our entire lives. He spoke too fast and didn't take time to stop and clarify himself. When it came to quizs, he didn't put what he said he would on the quiz and instead put everything he told us not to worry about learning. I do not recommend him as a professor unless you were placed in Elementary French and already have an extensive background in the language. \nWorkload:\nAverage hw daily about 30min and quizs weekly\n"
        }
    ]
}