{
    "prof_info": [
        {
            "prof_name": "Bajeera McCorkle",
            "prof_id": 1769,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 17, 2011",
            "review_content": "\nPretty excellent. Took CC with her a few years back, but remember the course fondly. Ran into a fellow classmate and was inspired to post this after our rehash. She really engaged with the students, could be funny (sometimes inadvertently). She was good at facilitating debate in our class. Her CC class focused a bit more on politics then some other preceptors might, but all in all a very good course. And she's really smart. I explained Kant to another sophomore after our class on GMM. \nWorkload:\nFairly average CC workload in terms of written work. A bit more reading. Somewhat tough grader, but fair. My writing improved over the year and she was very helpful when I met with her to discuss my papers. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 23, 2007",
            "review_content": "\nvery reasonable, funny, lively. need to hand in arguments/\ncomments for each class--tedious. \nWorkload:\n2 papers, midterm, final. she needs to make quote id's less obscure\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 18, 2007",
            "review_content": "\nKeeps discussions lively. Not hard grader. Does not have superiority complex, and is easy going and sweet. a good bet for cc. very knowledgeable. however, her final has id's with no author, no prior list of quotes... very unreasonable for philosophy class where much is in translation, more appropriate for lithum where there is distinctive writing style.\nWorkload:\nmidterm, final, two short papers, comments typed for every class, which is annoying. \n"
        },
        {
            "course_name": "The Supreme Court and American Politics",
            "review_date": "February 25, 2004",
            "review_content": "\nI thought Bajeera was a fantastic TA and was very receptive to answering questions and clarifying material.  she also was very helpful in going over what was important to the cases when I met with her.  \nWorkload:\ntoo much reading, difficult exams\n"
        },
        {
            "course_name": "The Supreme Court and American Politics",
            "review_date": "November 06, 2003",
            "review_content": "\nEven though she was only a TA in this one, i thought i should warn people. She's really snotty, and if you go to her for help, even with a good question, she will look at you with disdain. \n"
        }
    ]
}