{
    "prof_info": [
        {
            "prof_name": "Sandra Goldmark",
            "prof_id": 3381,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Problems in Design",
            "review_date": "November 16, 2016",
            "review_content": "\nSandra Goldmark is one of the most insightful and brilliant professors at Barnard/Columbia, incredibly humble and an all around amazing human being. This is the best class I have ever taken and I learned more practical knowledge here than in four years at this school. You work with your hands a lot, both building set models and fixing things. The class is very interdisciplinary, you read everything from plays, to anthropology texts, to NY times articles. There are three major components to this class researching, fixing and designing (it is a theatre class after all). She is very open about the class being somewhat in flux though.\nYou spend an entire class learning how to fix things and fixing your own things. I learned how to solder and sew and fix an iphone charger and jewelry all while reading about how to break the cycle of use and discard not only in theatre but in our daily lives. Sandra is really focussed on sustainability and the environmental impact of consumerism. Be prepared to question and problematize every day items you do not actually need. \nThis is not an easy A class and do not take it for that purpose. The readings are manageable and honestly I did not do most of them and still did well. Quality of work is more important to Sandra than quantity of work done. Read the plays you will be designing though, that is important. There is a lot of thought that goes into this class and if you are not prepared to come to class and think on your feet and with your hands designing on the spot do not take it. Sandra expertly interweaves elements of thing theory into explaining stuff that we use as theatre artists. Sandra is tough, she expects a lot and at a high caliber, but the more you put into this the more you will get out of it. \nWorkload:\nVery manageable but hard because it takes a lot of thought and creativity. Moderate to heavy reading but not all of it is necessary. Designing in and out of the classroom, fixing somethings and one presentation.\n"
        },
        {
            "course_name": "Costume Design",
            "review_date": "April 04, 2011",
            "review_content": "\nYes, it's true, Sandra Goldmark is the bomb. She's a tough cookie, and you may be frightened by her uncanny ability to look at your work and know how you were feeling when you created it as well as exactly how much effort you put into it, but face the fear and DO IT ANYWAY, as that one book says. She's absolutely brilliant, very talented, quite straightforward, and a great human being to know (and admire... as you surely will). She invests in her students when they invest in their work.\nThis is essentially an art class, which is both frustrating and exciting for non-artists. You'll do a combination of dramatic lit analysis and rendering projects, including basic workshops on watercolor and color theory. What you're able to pull off in terms of design work has less to do with your talent as a painter or sketcher and more to do with your ability to form and communicate concrete, well-justified ideas about costuming each piece. It DOES help to have a background in visual arts. You MAY feel downtrodden if you can't draw to begin with, and she isn't going to hold your hand while you figure out how to negotiate that. However, Sandra is a genuinely caring and understanding person, and if she thinks it's fair, she'll cut you some slack. Only if she thinks it's fair. Otherwise, like I said...tough cookie.\nThe class includes awesome field trips to costume shops, an opportunity to build some stuff, and frequent class-wide critiques of your work (which is less scary than it sounds, and once you get over the initial shock of opening up your artsy brain to honest peer/prof critique, you'll find yourself reaching out for as much as you can get).\nBe prepared to spend some money on supplies and printing! This is a pain, and you have to do it.\nThis class opened up a whole design world to me, and I looked forward to it every week. It's not easy, but if you work hard and come to class prepared you can expect to feel refreshed by the creativity of the work and proud of what you accomplish in 15 classes.\nWorkload:\nLOTS OF VISUAL RESEARCH! Three major design projects broken up throughout the course of the semester as well as smaller projects every week (making newspaper dresses was da bomb!). Not much reading--a few plays--but you'll have to compile a TON of visual research for every project, which is very time consuming. I suggest moving into Avery and pouring through their art books. You will probably spend hours on google images. Printing and painting are also time consuming, but it's worth it, really, and if you put in the effort you'll get an A.\n"
        },
        {
            "course_name": "Scene Design",
            "review_date": "May 03, 2010",
            "review_content": "\nBoth of Costume and Scene Design were amazing classes. Not easy, but still amazing. I learned so much from Sandra - her feedback was invaluable to me, and I'm very glad I took her classes. Now, onto a list of things to note before signing up for her classes:\n- They are discussion classes, do the reading. \n- It is easy to let the homework get away from you, and leave it all until Thursday night. Don't. Building a good scale model of a set is not easy, and it's not any easier at 3am. \n- Take the time to do your research. Google Images might seem like your best friend, but suck it up and make the trip to Avery. This is one of the few times where the internet might just fail you. If you can't make it to Avery, at least use Artstor or one of the other digital image archives on CLIO.\n- BEST FIELD TRIPS EVER, if you're a behind the scenes type of theater geek. For Set Design we went to Hudson Scenic (where they build sets for Broadway musicals) and for Costume Design we went backstage at The Lion King and to a costume shop that works on costumes for Shrek (the musical), The Lion King, the Rockettes, and more. \n\n- No textbooks to buy, but you will spend money on supplies. These are essentially art classes in that respect. In the case of set design, a scale rule is a must. A lot of stuff can be found in the supply closet, but a few things you should buy for yourself: good pencils, a pencil sharpener, erasers, and a sketchbook. \nWorkload:\nBoth classes:\n- Read about 5 plays, bring in background research for your designs. (Usually 10-15 images or so, printed in color. Make sure to leave time to print. She hates it when you don't print.)\nSet Design:\n- Build a model of Minor Latham Playhouse\n- Build models for 3 designs, one is your final project\n- A couple of group projects, one was a collaboration w/the sound design class\nCostume Design\n- Designs for 3 plays, one is your final project \n- Lots of sketching, both in and out of class \n- A few in class group projects, one was news paper dresses\n"
        },
        {
            "course_name": "Scene Design",
            "review_date": "January 22, 2008",
            "review_content": "\nSandra is a fantastic professor, but be warned that her class is no walk in the park. Her pedigree is amazing and she is a working professional in the city, so she is insanely qualified, but expects equal quality from her students. She does not baby the class or hold anyone's hand, so be prepared to work hard for a good grade. That being said, Sandra's class is one of the most rewarding experiences I've had at Columbia. She recognizes hard work and helps her students in whatever way she can, if they come to her. Any class with her is definitely worth taking, as you will learn quite a bit. And, did I mention that she's brilliant?\n"
        }
    ]
}