{
    "prof_info": [
        {
            "prof_name": "Kenneth Torrey",
            "prof_id": 537,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Squash",
            "review_date": "May 21, 2014",
            "review_content": "\nFor those who will understand what this means- squash is the precise opposite of fencing. \nYou will start playing pretty much on day 1, and with Bid (whom we had for the first half or so of the semester) you will do little else than play, which is great, though your play will be limited by less actual instruction. Ken does more actual training, but still you mostly play games, which is fun. \nThe drills, when they do take place, are okay, but you often won't do enough of them to really impact your play. So this is much more about having fun than improving your game. \nYou will always get a great workout. You're running and hitting balls hard for the full 50 minutes. \nBid is so relaxed about absences, he will very often count you as present when you're not there. Don't expect this with Ken though. \nAll in all, highly recommended, especially as a complement to fencing (very cool and lots of fun, but you hardly move for most of the semester and don't actually bout much). \nWorkload:\nShow up, don't accumulate more than six registered absences, like every PE class. \n"
        },
        {
            "course_name": "Cardio Fitness",
            "review_date": "May 10, 2011",
            "review_content": "\nKen Torrey is the best instructor! He's very easgoing, enthusiastic, and is very willing to work with whether it's making up classes or getting to a higher fitness level. Moreover, he's one of the best administrators at this school and unlike most teachers, he wants to help students and work with them rather. For example, my friends and I missed other courses and made them up with his cardio class and he was very willing to help us make up those classes on our timeline.\nWorkload:\n6 absence policy\n"
        },
        {
            "course_name": "Squash",
            "review_date": "May 30, 2005",
            "review_content": "\nKen is awesome! I'm not a fan of the p.e. requirement here, and really only took squash because it was the only p.e. class that fit. Surprisingly, i'm coming out of this class happily. His unflagging energy and enthusiasm about the game is imparted onto us squash players to be. Furthermore, he is willing to patiently work with anyone who wants to improve their skills. I'd definitely take this class again.\nWorkload:\nAttendance - 6 skips allowed. Additional cuts can be made up by attending the other squash class (there's MW and TR, usually at the same time). \n"
        },
        {
            "course_name": "Squash",
            "review_date": "January 02, 2005",
            "review_content": "\nThis guy is great!  He clearly enjoys teaching, and he really knows the game.  He can take any skill level and improve on it, and he'll really make you enjoy coming to class.  Squash with Ken Torrey is a fantastic way to fulfil the phys ed requirement, and also a great way to get a work out and learn the game of squash.\nWorkload:\nCan't miss more than six classes.\n"
        },
        {
            "course_name": "Squash",
            "review_date": "February 11, 2002",
            "review_content": "\nProfessor Torrey is the absolute best! You'll learn all about squash and get to play a lot too! Professor Torrey is really funny and tries to connect with his students. The best is when he plays the air guitar on his squash racket!! If he really likes your class, you can get him to sing at the same time.\nWorkload:\nIf you have more than 6 absences, you can still pass - just go to make up classes. Professor Torrey isn't looking to fail anyone.\n"
        },
        {
            "course_name": "Squash",
            "review_date": "January 30, 2002",
            "review_content": "\nYou actually learn alot in this gym class. Squash, I think, is harder than raquetball or tennis because the ball is so deflated. Thus, you must hit it very very hard to get it to go anywhere. You get an excellent, concise, workout in 50 minutes. You'll sweat like a pig so remember to wear deoderant and short shorts. KT is an excellent squash player, and even if you are an accomplished tennis player, it isn't likely you will beat him. Funniest thing = He sticks his butt out when he plays. \nWorkload:\nmiss no more than 6 classes. You will learn squash so you can be a yuppy!\n"
        },
        {
            "course_name": "Squash",
            "review_date": "October 22, 2001",
            "review_content": "\nHe looks like the prototypical gym teacher, what with his short shorts and athletic build, but this man does his job excellently and kindly. Torrey explained the principles behind squash in a fun and interesting way. He left much time to play in the ladder tournaments. I liked it very much. Squash raquets and balls are supplied.\nWorkload:\nClass participation is the only requirement.\n"
        },
        {
            "course_name": "Squash",
            "review_date": "December 31, 1999",
            "review_content": "\nIt's hard to find a better Phys Ed teacher than Torrey. Everybody loves this guy. He's funny, he's smart, and he gets along with all his students. The class is fun, and you get to play most of the time.\nWorkload:\nThere is a 6-absence maximum, but it seemed to me like several people missed more and still passed. As Torrey said once: \"All absences are negotiable.\"\n"
        }
    ]
}