{
    "prof_info": [
        {
            "prof_name": "Guadalupe Ruiz-Fajardo",
            "prof_id": 3099,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 13, 2016",
            "review_content": "\nI absolutely love Guada she's so sweet and you can tell she's a very caring and talented teacher. She is non-judgemental, makes the class engaging and very organized. \nWorkload is average - some mini compositions, midterm, final and daily hw.\n\nWorkload:\nmidterm, final, video project, 4 small compositions\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "March 12, 2015",
            "review_content": "\nGuada is good! This class was a very enjoyable and interesting exploration of spanish. Guada is the most adorable person, always helpful, and finds interesting ways to teach using primary sources, news articles, and even pop songs. Her accent is amazing to listen to. This class is a good choice. \nWorkload:\nMinimal. Daily hw (doesn't check), compositions every few weeks (she lets you revise them), 1 midterm, 1 final, 1 oral presentation, 1 group project.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "March 12, 2015",
            "review_content": "\nGuada is good! This class was a very enjoyable and interesting exploration of spanish. Guada is the most adorable person, always helpful, and finds interesting ways to teach using primary sources, news articles, and even pop songs. Her accent is amazing to listen to. This class is a good choice. \nWorkload:\nMinimal. Daily hw (doesn't check), compositions every few weeks (she lets you revise them), 1 midterm, 1 final, 1 oral presentation, 1 group project.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "March 12, 2015",
            "review_content": "\nGuada is good! This class was a very enjoyable and interesting exploration of spanish. Guada is the most adorable person, always helpful, and finds interesting ways to teach using primary sources, news articles, and even pop songs. Her accent is amazing to listen to. This class is a good choice. \nWorkload:\nMinimal. Daily hw (doesn't check), compositions every few weeks (she lets you revise them), 1 midterm, 1 final, 1 oral presentation, 1 group project.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 17, 2014",
            "review_content": "\nGuada an incredible professor, hands down. For one, she's absolutely hilarious, and is very concerned with keeping the whole class engaged. We watched all sorts of youtube videos, movies, listened to songs, etc. We went on field trips to museums and movie screenings, too! \nShe does tend to speak quickly, and sometimes it takes a moment or two for your brain to process what it is that she's saying, but overall i had little trouble understanding her. Tons of fun group work. There's also a lot of useless textbook homework that no one ever does (or needs to do!) and it's never reviewed in class. \nGOLD NUGGET!!!! I CANNOT RECOMMEND HER ENOUGH.\nWorkload:\n She goes over grammatical concepts with helpful power points, and assigns essays 200 words in length after each section. My longest essay was 400 words. ARE YOU READING THIS COLUMBIA?!! 200-400 word essays, they're graded leniently too!! One midterm, one final. Maybe three 200 word essays, one 400 word essay, a final video project, final. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 08, 2014",
            "review_content": "\nKind of what you would expect out of a graduation requirement Spanish class. A lot of the kids were very unmotivated and quite bad at Spanish, though the professor was by no means the root of the problem. It's a lot of kind of silly worksheets in this class, though it's pretty effective in teaching you the language. Professor Ruiz-Fajardo (she signs her emails Guada, but I have no idea if I should call her that) is pretty in touch with how students feel, and she knows that the class, being required, is a chore for a lot of the people in it, so she tries to make it funny, usually successfully. She's a bit disorganized, but she's a fair grader and she really does try to help you learn the language. She also gives by far the best feedback on essays that I've ever gotten in a Spanish class.\nWorkload:\nA lot of worksheet busywork, a couple of presentations, midterm, final\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 08, 2012",
            "review_content": "\nBefore choosing Guada as my Spanish teacher, I had read many glowing reviews about her. Sad to say, I was very underwhelmed by her teaching ability. She definitely encourages class participation; however, my class was not very loquacious so she gave up pretty easily. She also teaches straight out of Gente which is by far the worst Spanish textbook I have ever laid my eyes on! The exercises are rather pointless and repetitive and they do not facilitate learning the grammar or the vocabulary. With regards to deadlines, she is extremely lax which is pretty nice; however, she does assign random little assignments in class which are mentioned last minute which  no one understands what they are. The homework is really easy (3 chapters of Gente Red and Blue books, 3 movie assignments, and a couple random packets); however, she is very unclear when certain assignments are due which is extremely frustrating.\nOverall, it does not seem like she really cared about the course. In the middle of the term, we had two substitutes teach while she was away, Jose Campanillo and Francisco Varo Rosales. Sad but true, I learned more in those two lectures than I did the entire semester when she was teaching!!!  \nWorkload:\n- easy HW\n- 1 midterm\n- 1 final\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 20, 2011",
            "review_content": "\n  Guada is a great teacher! She has a very good castellano pronunciation and is quite active. Wants everyone in the class to participate. The class focuses heavily on speaking and conversation but there are also written assignments. She is pretty relaxed about deadlines..you can practically give in all the stuff on the last day..but youÂ´d better try to keep up. You will learn a lot not only about grammar and vocabulary but also about Latin America, the history and culture of Spain..The level though is advanced I'd say..she is available and happy to help anyone who needs extra assistance. Overall, the class is fun.I enjoyed it very much\nWorkload:\n2 compositions, the first version of each has to be rewritten after her corrections, 3 grammar and 3 vocabulary handouts, 3 movies and handouts on them, a project: Spanish you hear around you (10 conservations),pretty easy midterm and final \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 13, 2011",
            "review_content": "\nGuada is good. It must suck to have to teach beginning language courses but she manages with grace. She doesn't hound you about homework anything like that. Turn it in when you want, but just do it in the end. Her main focus is talking in small groups and pairs which I thought really helped. You do have to learn most of your grammar on your own, but that's the trade off. Classes are usually pretty fun. I'd recommend her/ take her again. \nWorkload:\nAverage but you pretty much get to decide your own due dates. She's flexible.  \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "April 13, 2011",
            "review_content": "\nI actually like Guada a lot. She does speak very quickly and she does tend to go over elements of grammar quickly as well. Sometimes people find her difficult to understand (she speaks so quickly) and perhaps I did do slightly better because I had taken some Spanish before (albeit years ago). However, she is very approachable, willing to help, a very fair grader and very chill about when you turn in homework. If you're struggling all you have to do is ask for help and she'll go out of her way for you. Punctual and always answers emails. Very laid back. I can't stress enough how laid back and approachable she is. She expects you to do the work but she isn't a hard ass. I would take her again and I would recommend her.  \nWorkload:\nMidterm, final. Three compositions which you get to rewrite for a higher grade, exercises from the work book due every few weeks or so. \n"
        },
        {
            "course_name": "Elementary Spanish",
            "review_date": "April 18, 2007",
            "review_content": "\nAvoid Guada. Especially for Elementary I. If you have no knowledge at all of Spanish language (which youre not supposed to have if you're in Elem I) than you will not necessarily struggle but her classes will require alot of work on your part while she offers little help or clarity. Her assignments are ambiguous and the degree of difficulty of her tests range from extremely easy to near impossible, and it is impossible to predict what kind you will get. The bottom line is, when a teacher puts absolutely nothing into a class the students are going to get absolutely nothing out of it. Guada is generally nice, so if you are one of the many who decide to take an elem I course in Spanish when youve taken years of spanish before (never understood that but everyone does it! wtf?) go ahead sit back and relax, otherwise avoid her.\nWorkload:\nRandom assignments in workbook but never checked. One quiz per chapter. A few writing assignments. Midterm and Final.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 08, 2007",
            "review_content": "\nAs someone who was not thrilled about fulfilling my language requirement, Guada came as a blessing - by the end of her class, I actually enjoyed Spanish.  She leads engaging discussions in class and is incredibly helpful during her office hours.  Sometimes the instructions she gives in class concerning assignments are a little unclear, but if you are confused, she's willing to clarify things after class.  Basically, if you put the time in and show here that you care by actively participating in class, asking questions, and attending office hours, it will pay off in the end.\nWorkload:\nDepends - regular homework is rarely checked, but do it for practice - it helps.  4-5 quizzes and 3 compositions of 200+ words (one is an article piece, another is on a video, and the last on \"El Coronel...\" - if you are willing to put the time in early, Guada will review your compositions with you before they are due - it will improve your grammar and your grade as well.\n"
        },
        {
            "course_name": "1202",
            "review_date": "December 29, 2006",
            "review_content": "\nI think Ruiz-Fajardo is a terrible teacher.  She is usually the last one to class, her due dates are ambiguous, and her grading is extreme.  She is the most subjective teacher I have come across, to the point where comparable work receives largely different grades.  My advice: avoid her.\nWorkload:\nhomework (you rarely know when its due), 3 quizzes, 4 compositions, 1 midterm, 1 final\n"
        }
    ]
}