{
    "prof_info": [
        {
            "prof_name": "Eduardo Ponton",
            "prof_id": 2346,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanics",
            "review_date": "May 21, 2006",
            "review_content": "\nTends to stick closely to what the book covered, but besides that he is a solid professor. Class is pretty enjoyable, he's helpful enough in office hours and tests are reasonable. Workload occasionally pushed to the limit, your free time is not guaranteed.\nWorkload:\nSometimes a bit much, but this is a second year physics class. Stop whining.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 19, 2005",
            "review_content": "\nI must say that Ponton did not impress me the first day of class. He seemed like he was the kind of professor that simply regurgitated the text (which is pretty horrid due to its lack of description and ugly notation).  As a result, I rarely went to class but somewhere along the way I started enjoying him.  He's far from being a solid professor but there's something wry about this smirky spaniard.  The way he'll go on for an hour about a topic nobody understands and have the audacity to tell us, dead-pan, \"So if you review this for ten minutes when you go home, you should be prepared to do a typical problem on this material.\" Or how he asks, \"any questions\" after a topic even though he knows no one will ask him.  \nGoing to office hours was fun--I didn't really have any questions it will just be fun to hear the guy talk.  The semester would not have been complete without making Ponton laugh.\nWorkload:\nThe problem sets are typical; long, arduous, and sometimes unfairly graded.  Some problems will be enjoyable and make you feel happy that you're learning others you will label as \"Ponton\", which are essentially four pages of algebra and no physics.  Midterms and Final are manageable but not easy to completely ace--but that doesn't matter as class average was never too high.  \n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "January 30, 2005",
            "review_content": "\nWell I feel that the previous review is a bit strong.  This was Professor Ponton's first time teaching, and it may have even been his first experience with a course in this country.  Much hullabo has been made over the \"grading controversy\", but I really don't blame him at all for not being aware of the extent of ivy league grade inflation.  It is true that getting a B- is pretty  bad here, but only because grad schools assume that we go to a school where the average is an A-.   Not being aware of this situation isn't his fault in the least.  \nNow to the course:  as stated by the previous review, the book sucks.   It is long-winded, vague, and full of unecessary examples.  The presentation of Lagrangian mechanics is logically confusing and the reader soon loses track of what the axioms are and when the methods are applicable; it wasn't until I reverted to Goldstein's excellent book that I was really able to understand it.  \nThe problem sets were long and mostly taken from the book or from klepner/kalenko, but after initially adjusting to them I found them to be very helpful.  In some sense this class is more a class in problem solving than in classical mechanics.  \nProfessor Ponton's lectures are mediocre at best; he takes most of the subject material right out of the book with occasional extra material of his own that I actually found to be quite interesting.  This material usually complements the material from the book, providing derivations and improving the logical flow.  Nonetheless, his lecturing style is rather dull so it is often difficult to stay focused.  \nThat said, this class is intended for people majoring in physics, and while the workload is rather significant, I feel that it provides a good transition to the graduate level courses.  The first midterm was difficult, but again it provided a wakeup call and made me realize that I had to take the class much more seriously than I had been.  The second midterm was not quite as bad, and  the final was very reasonable.  \n**\nI should just add that one thing that I do agree with the previous reviewer about is that Professor Ponton was not very encouraging of students who are struggling...   eventually people are going to have to be able to take responsiblility for their own education, but this class is still only intermediate level and in any case there is no reason for the professor to discourage students.  \nWorkload:\nmedium...   probably a lot for anybody coming out of the 1400 track, but if you were good in 2601 (or presumably 2802), then it isn't too bad. \n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "December 29, 2004",
            "review_content": "\nI don't think there is much about this class or professor that I can praise. Lecture consisted of the professor mumbling into the board while writing neatly and drawing nice pictures until you realize that you're copying the textbook, which, by the way, sucks. Questions felt unwelcomed during lecture. Although the professor was fairly approachable during office hours, he was still a little intimidating. \nTests were sooo unreasonable. The first two midterms were so hard and nothing like the hw problems, or anything I'd seen before in that class. When he returned the tests in lecture the next day, he expressed how dissapointed he was in the consistently low grades we all had (the mean was in the 30s). He acted like it was our fault, like the whole class had slacked off. It never occured to him that he might not be preparing us enough for his exams or that they're not like the hw or lecture, or that he's just unreasonable... because the second midterm was just as bad as the first. \nThis pissed a lot of people off, but the icing on the cake was when he told a student that there would be no curve and that he was only going to consider the raw score. When word got out we had to get the department head to intervene. \nThis got us a more reasonable final and meant that over a third of us wouldn't be getting F's after all. But all in all, this guy taught me nothing, and everything that I taught myself wasn't even going to get me a good grade on any of his tests, including the final which was long but even had problems we had seen on the hw. \nI never felt prepared enough for exams, maybe it was because the lecture before exams, he'd be about to dismiss class without saying a word. Usually someone would say, \"Hey, isn't there going to be an exam next time?\", and the professor would be like, \"Sure, now what do you want from me?\". I made sure to bombard him with questions because I really wanted to do well. He could never give me a straight answer. \"How many questions?\" -- \"About 3 or 10... maybe\" -- \"Will the 2nd midterm be cumulative?\" -- \"Yes and no\" -- \"Will there be a review session\" -- \"Maybe\" -- \"Seeing as how we've covered 8 chapters of physics so far, which concepts will this exams stress?\" -- \"All of them\" --- Thanks for being so helpful...\nThere wasn't even a review session for the final, and he gave out a big fat list of problem from the book with a disclaimer at the top that said \"If you do all of these problems, you may(italicized) do fairly well on the exam... There is no guarantee that these problems or anything similar will be on the final...\" So why not give review problems that would help a student do REALLY well? Why would I waste my time doing 20 hours worth of problems if I'm only going to do fairly well? If I spend more than 20 hours studying for anything, I want to do damn good on the test! I'm ranting at this point... this class sucked. Avoid it at all costs.\nWorkload:\nWeekly problem sets (difficult, so working in groups might help), 2 midterms, final.\n"
        }
    ]
}