{
    "prof_info": [
        {
            "prof_name": "Darragh Martin",
            "prof_id": 4590,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 28, 2015",
            "review_content": "\nProfessor Martin is extremely kind and understanding - he's willing to give reasonable extensions if you talk it over with him, he does his best to give advice during office hours, and he's definitely not the kind of professor to grill you if you admit that there are somethings you don't know. He did grade rather harshly during the fall semester, especially on the first paper. Most people got B's and C's, but his grading gets more lenient as the semester goes on; I'm sure it's just his way of pushing students to work harder in a class that they'd usually slack off in. The first paper made me realize, ah, I should probably go to his office hours for help - and his office hours were a LOT of help. Just come in with a few ideas beforehand, don't be totally unprepared, and he'll push you to think differently about your ideas, to go further with them, and he's also really good with teaching you how to analyze the text (I found that it was really helpful when I got to talk to him one-on-one about analyzing the words and then examining how they work together). You probably don't want to ask him for as much help as I did (I'll admit that I'm kind of a pain-in-the-ass when it comes to asking teachers to help me with papers), but he was very nice and understanding about it all. \nProfessor Martin's way of teaching LitHum was also quite different from other classes, in the sense that he was very interested in discussing marginalized voices (women, foreigners, the poor, etc.) both by characters in the books, and by the authors themselves. You can notice that there are several important recurring themes that he likes to focus on - the permanence of art, marginalized voices, suffering leading to wisdom, etc. (They're more specific and detailed when discussed in class, but these are the general ideas). He also like to do \"Food for Thought\" presentations - basically, one student presents on a passage that we read for the week, and also brings food.\ntl;dr Professor Martin is helpful, nice, and intelligent, and it IS possible to get A's (or at least an A- if you put in the effort) but his class is NOT an easy A. \nWorkload:\nReadings can be rather long and dense, so try not to put them off if you plan on reading. You can get away with not reading sometimes (although I don't suggest it), but you do have Passage ID quizzes (they happen after the class finishes reading anywhere from 1 to 3, or even 4, books), which he may or may not warn you about. He drops the lowest quiz grade.\nFall semester has 4 increasingly longer papers, and spring semester has 3 explorations (short papers exploring a recurring idea) and 1 final paper tying the explorations together. There's also a creative project, a midterm, and a final in both semesters. Midterms and finals don't have Passage ID because you've taken the quizzes (and I definitely prefer the Passage ID being on the quizzes because you remember more after recently finishing). \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 28, 2015",
            "review_content": "\nProfessor Martin is extremely kind and understanding - he's willing to give reasonable extensions if you talk it over with him, he does his best to give advice during office hours, and he's definitely not the kind of professor to grill you if you admit that there are somethings you don't know. He did grade rather harshly during the fall semester, especially on the first paper. Most people got B's and C's, but his grading gets more lenient as the semester goes on; I'm sure it's just his way of pushing students to work harder in a class that they'd usually slack off in. The first paper made me realize, ah, I should probably go to his office hours for help - and his office hours were a LOT of help. Just come in with a few ideas beforehand, don't be totally unprepared, and he'll push you to think differently about your ideas, to go further with them, and he's also really good with teaching you how to analyze the text (I found that it was really helpful when I got to talk to him one-on-one about analyzing the words and then examining how they work together). You probably don't want to ask him for as much help as I did (I'll admit that I'm kind of a pain-in-the-ass when it comes to asking teachers to help me with papers), but he was very nice and understanding about it all. \nProfessor Martin's way of teaching LitHum was also quite different from other classes, in the sense that he was very interested in discussing marginalized voices (women, foreigners, the poor, etc.) both by characters in the books, and by the authors themselves. You can notice that there are several important recurring themes that he likes to focus on - the permanence of art, marginalized voices, suffering leading to wisdom, etc. (They're more specific and detailed when discussed in class, but these are the general ideas). He also like to do \"Food for Thought\" presentations - basically, one student presents on a passage that we read for the week, and also brings food.\ntl;dr Professor Martin is helpful, nice, and intelligent, and it IS possible to get A's (or at least an A- if you put in the effort) but his class is NOT an easy A. \nWorkload:\nReadings can be rather long and dense, so try not to put them off if you plan on reading. You can get away with not reading sometimes (although I don't suggest it), but you do have Passage ID quizzes (they happen after the class finishes reading anywhere from 1 to 3, or even 4, books), which he may or may not warn you about. He drops the lowest quiz grade.\nFall semester has 4 increasingly longer papers, and spring semester has 3 explorations (short papers exploring a recurring idea) and 1 final paper tying the explorations together. There's also a creative project, a midterm, and a final in both semesters. Midterms and finals don't have Passage ID because you've taken the quizzes (and I definitely prefer the Passage ID being on the quizzes because you remember more after recently finishing). \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 28, 2015",
            "review_content": "\nProfessor Martin is extremely kind and understanding - he's willing to give reasonable extensions if you talk it over with him, he does his best to give advice during office hours, and he's definitely not the kind of professor to grill you if you admit that there are somethings you don't know. He did grade rather harshly during the fall semester, especially on the first paper. Most people got B's and C's, but his grading gets more lenient as the semester goes on; I'm sure it's just his way of pushing students to work harder in a class that they'd usually slack off in. The first paper made me realize, ah, I should probably go to his office hours for help - and his office hours were a LOT of help. Just come in with a few ideas beforehand, don't be totally unprepared, and he'll push you to think differently about your ideas, to go further with them, and he's also really good with teaching you how to analyze the text (I found that it was really helpful when I got to talk to him one-on-one about analyzing the words and then examining how they work together). You probably don't want to ask him for as much help as I did (I'll admit that I'm kind of a pain-in-the-ass when it comes to asking teachers to help me with papers), but he was very nice and understanding about it all. \nProfessor Martin's way of teaching LitHum was also quite different from other classes, in the sense that he was very interested in discussing marginalized voices (women, foreigners, the poor, etc.) both by characters in the books, and by the authors themselves. You can notice that there are several important recurring themes that he likes to focus on - the permanence of art, marginalized voices, suffering leading to wisdom, etc. (They're more specific and detailed when discussed in class, but these are the general ideas). He also like to do \"Food for Thought\" presentations - basically, one student presents on a passage that we read for the week, and also brings food.\ntl;dr Professor Martin is helpful, nice, and intelligent, and it IS possible to get A's (or at least an A- if you put in the effort) but his class is NOT an easy A. \nWorkload:\nReadings can be rather long and dense, so try not to put them off if you plan on reading. You can get away with not reading sometimes (although I don't suggest it), but you do have Passage ID quizzes (they happen after the class finishes reading anywhere from 1 to 3, or even 4, books), which he may or may not warn you about. He drops the lowest quiz grade.\nFall semester has 4 increasingly longer papers, and spring semester has 3 explorations (short papers exploring a recurring idea) and 1 final paper tying the explorations together. There's also a creative project, a midterm, and a final in both semesters. Midterms and finals don't have Passage ID because you've taken the quizzes (and I definitely prefer the Passage ID being on the quizzes because you remember more after recently finishing). \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 29, 2014",
            "review_content": "\nEverything good you've heard about Darragh Martin is absolutely true. Darragh Martin and Literature Humanities were honestly one of the most memorable highlights of my first year here. Darragh knows exactly how to stimulate class discussion around important, interesting questions. One caveat: this section is almost entirely lecture-free, so if you're not about that discussion life, it's not for you. Darragh is very much interested in what his students have to say. He knows how to keep the classroom environment lively -- we had small-group discussions structured in a variety of ways, we had class outside at least three times, we took field trips in class and outside of class, we did imaginative readings, we presented scenes from the Oresteia and Medea in groups to explore performative texts, we did physical/staging exercises...no class was quite like another! It's quite the experience.\nOne common thread throughout the course I think is particularly effective is that at the beginning of each work, Darragh goes around the room and asks everyone for a question they have about the work or a topic/something they noticed they're interested in discussing. He takes notes and incorporates those questions into discussion, remembering days later who's interested in what.\nThe absolute best thing, though, about Darragh's Lit Hum is unquestionably the Food for Thought presentation. Halfway through each class, and after a five-minute break, one student takes over the classroom and after a five-minute presentation of close reading and analysis, leads class discussion for the next ten minutes, without any interference whatsoever from Darragh. In addition to helping us grow closer to the text, this really enhanced our understanding of the value of each of our voices as early as the second class in September, and allowed us to exchange our ideas student-to-student, which is a unique and vital relationship to cultivate. Each student is also responsible for bringing $10~$15 worth of food -- very important!\nDarragh is also notably concerned with addressing, not ignoring the problems inherent to the course and to the Western canon as a whole. Startlingly, the quote he wrote on the blackboard at the beginning of the first class, from To the Lighthouse, was a quote about intimacy -- we knew when he started talking about becoming close with texts that at the same time we weren't going to be leaving any stone unturned. He crucially adds Sappho's fragments to the first-semester curriculum, making sure there is at least one female voice. For introductions with new classmates second semester, Darragh asked that we all specify our preferred gender pronouns. This assumption-challenging attitude came out especially strong in the second semester. A group of students initiated an alternative narrative project, selecting a set of short(er) readings from traditionally marginalized voices, and Darragh let them run a very interesting class discussion for a day. And by popular vote at the end of the first semester, we cut Faust from the curriculum in favor of a day with Christine de Pizan's medieval feminist manifesto Book of the City of Ladies and two days with Tony Kushner (CC '78)'s wonderful play Angels in America.\nThe second semester has a large assignment (something like 18% of the grade) called the theme exploration. Students choose a theme (eg \"music\" or \"reading\" or \"intimacy\", what have you) at the beginning of the semester and write four 1~2 page papers tracking the treatment of that theme in each of the units. Then they write one 6~8 page paper (you're allowed to use, even copy & paste -- with editing -- your previous work) on that theme across several works. This makes the stress of writing the final paper much lower, and I think contributes to your understanding of the purpose of the course as a whole.\nOne of the neat things about the course during the second semester is that although Darragh encourages you to read by giving passage ID quizzes, we also did a significant amount of close reading in class, and discussed individual important passages from a given work in class. That was particularly important because the second semester readings grow very large, and Darragh understood that we weren't always able to finish them by class. Darragh's exams the second semester are also well-designed. Instead of having us focus unnecessarily on identifying passages, Darragh identified passages for us and then asked us to focus on close reading, imaginative comparison, contextualization...the sorts of things that are actually important to reading and understanding literature.\nDarragh will encourage you early on to bring your voice to the table (or rather, the floor -- he doesn't believe in the table-circle-and-outer-circle environment typical to some Core classes) -- make sure you have something to say. After that, go to office hours every now and then for help with your papers and make sure you've read everything by the exam.\nOn top of being a great teacher, Darragh's also a fascinating person -- check out darraghmartin.com to see what I mean. He writes plays and children's books. He's a Fulbright Scholar. He's just much too good for Columbia, frankly. As Eoin Colfer noted, \"Darragh Martin must be stopped.\"\nWorkload:\nTypical Lit Hum reading requirements (sometimes a little more). Passage ID quizzes (part of a 10% participation grade) at the end of almost every work both semesters. Two to three medium-length papers first semester, the theme exploration described above and another paper the second semester. A midterm that mirrors the final and a final, both semesters.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2014",
            "review_content": "\nDarragh is an angel. I switched into his section of Lit Hum for the spring semester after having an absolutely horrible experience with the class and professor I had in the Fall and came into the class very unmotivated towards reading and the Core in general. Darragh actually got me interested in the texts we were reading and is really great about being responsive to what students want to get out of the class. On the first day of discussing each text, he goes around the room and gathers questions that people have about the text or topics/scenes of interest and makes sure that the material we cover that day and in following days somehow responds to what students want. Another really great part of class is the presentations - after the first hour of class, we get a five minute break and someone passes around some food and then gives a quick presentation about a scene in the book - 5 minutes or less of your own interpretation of the scene and then a 10 minute class discussion. It's a very low-stakes presentation that breaks up the class well and makes the person who's presenting much more knowledgable about that text. He's also great at facilitating discussions and getting people to speak up (every once in a while he will call on people who aren't raising their hand just to get them to say something, especially if you make eye contact with him - nothing to be scared of though) and also encourages us to think critically about what the texts say about marginalized voices (women, people of color, colonized groups, etc), which is definitely not true of all Lit Hum classes. The only downsides to Darragh's class are the grading and the quizzes. He can be a tough grader, especially earlier in the semester and on the assignments that are worth less of your grade. He uses a much more liberal grading scale (95-100 is an A+, 90-94 an A, 85-89 an A-...) so he can be honest with what he thinks about your work numerically without being completely discouraging. He definitely becomes WAY more lenient as the semester progresses and I do think he really just tries to push us by not being the easiest grader in the world. He also gives pop quizzes during the semester, typically on the day we finish a book. The quizzes are passage ID and they count towards your participation grade, only to move it up your down if you consistently do exceptionally well or terribly. Again, a low-stakes assignment to get you reading. Because of the quizzes, you don't have to do passage IDs on the midterm or final - instead, he gives you passages that are already identified in terms of speaker, text, and context, and asks you to do a short analysis of them. This was much easier for me personally even though the quizzes were annoying. Other than that, the final is the typical LH final and the midterm was the short passage analyses and an essay similar to the long essay on the final (broad topic, talk about it using two texts). In terms of papers, he has us write short \"explorations\" that are 1-2 pages long about a specific theme for every unit of the semester. They don't have to be super focused or have a thesis or any sort of argument - it's just a place for you to develop ideas. The final paper is 6-8 pages long and can be about your theme (he literally allows you to copy and paste from your explorations into your final paper) or something else if you want. Each exploration was worth 3% of our grade and was graded a bit more harshly than the final paper (18% of the grade). \nOverall, Darragh is a great teacher. I really wish everyone could have taken the class with him. He is critical of the Core and encourages us to push back against a lot of the ideas expressed in the texts, is extremely available to his students and makes the class about us, and pushes us to work hard and do better in the class without actually hurting your GPA all that much. He let us have class outside pretty much whenever anyone asked. A groups of students also gathered texts (short stories and poems) from marginalized western voices in modern-ish literature to challenge the dominant Core narrative and he let them present those stories and lead discussion for a day, which was a really amazing part of the course. I am so glad I had Darragh and encourage you to work hard and talk to him if you end up in his class.\nWorkload:\nTypical LitHum level of reading. He changed the syllabus a little bit to include more female voices which was really cool. Class participation is a must. Papers, quizzes, midterm and final are all described in detail above. There was also a shorter paper assigned at the beginning of the semester worth 5% of our grade. Four theme exploration papers (1-2 pages) worth 3% each, final paper (6-8 pgs) worth 18%, midterm worth 20%, class participation (including quizzes and one short presentation) is 20%, final exam is 25%.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 02, 2014",
            "review_content": "\nDarragh has been the most inspiring teacher I have had in my entire life. He made me appreciate the core more than I ever could have anticipated.\nI'm that kid who didn't want to read texts written thousands of years ago and was sure I was going to sparknotes the whole term. I had no interest in classic lit whatsoever.\nDarragh changed my opinion on everything. He guides the class through passages and texts that make the literature come to life and makes you recognize the significance of passages in a way you would never read on your own.\nPeople complain about quizzes and hard grading, but Darragh emails out \"important sections\" before every reading, so if you sparknote but read the parts he emails, it's totally fine. Plus, you'll get the most bang for your buck on the meaty parts of complex books.\nHe also single handedly took the bullshit out of my writing. His 'close reading' style may take some adjusting to, but overall, in your college career you'll be so grateful for it.\nDarragh genuinely cares about all of his students. He's not \"out to get you\" he's not a \"GPA killer\" he is a FABULOUS teacher, and one who rocks cardigans on the regular. There's a reason he has such a cult.\nClass participation is a great way to boost your grade -- don't worry about what the reviews say on his grading -- the amount of knowledge that you gain will far outweigh your worries. Seriously, once you accept a B+ over an A-, your life will be so great. Not that that is necessarily the only possibility. I got a C+ on the first paper, B on the midterm, B+ on the last two papers and still got an A- in the class.\nHonestly, though, I would've been HAPPY with a B in this class for all of the incredible wisdom, laughter, and enlightenment I received from this course. The satisfaction of having a great teacher and actually LEARNING things, rather than an easy A, is why you attend Columbia in the first place. Every time you look up at Butler library you'll be grateful he was there to guide you through these works.\nWorkload:\n3 papers (two 2-pagers, one 4/5-pager), a midterm without passage IDs, final. A fun play scene you get to put on (most people get As), some reading quizzes\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 30, 2013",
            "review_content": "\nDarragh is genuinely invested in your understanding of the material. He comes from a theater background and is very into acting out the plays, getting inside the characters' heads, etc. which really makes the material come to life. Other reviews describe his enthusiasm for the material, but what they don't mention is his ability to really challenge his students to dig into the more uncomfortable aspects of the reading (rape culture in Ovid, homosexuality in The Iliad). He often asks you to take the side of the underdog and often brings issues of gender roles and sexuality into class, which not all of the LH teachers do. \nHis accent is great, his sense of fashion is always entertaining, and he has one student present each class and bring in snacks, so we always have a food break in the middle of what would otherwise be an insufferably long two-hour class. Darragh expects a lot of his students; he doesn't give an easy A and emphasizes participation enough that it's tricky to get through a class if you haven't done the reading. He gives reading quizzes after each major unit or each long book, which count as part of your participation grade. He's tough on papers, but has allowed us to rewrite papers if we're willing to put in the work and improve our writing. \nA few people switch out of his class; his teaching style is almost entirely discussion-based. He's a skilled discussion leader and can direct conversation without being too pushy or expectant. He gives creative assignments where he asks you to reinterpret or imitate the style of one of the books; these are more fun than anything and are not difficult at all. He's flexible on which reading gets done; he's willing to add or drop books depending on the class. \n\nWorkload:\na few papers each semester, reading quizzes every few weeks, creative assignments, the average amount of LH reading. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 10, 2013",
            "review_content": "\nI will agree with some of the previous reviewers that Darragh's class is not one you'll easily get an A in. I worked very hard the first semester and just barely scraped an A minus. And we do have much more work than some other sections. Doing the reading isn't really optional - or at least, not if you want to be able to keep up with the level of discussion in class. First semester, I skipped out on quite a few readings, and it showed in my participation. Once I started reading everything (or as much as I could, and skimming/sparknoting the rest) I started getting a lot more out of the class. Participation is only like 10-15%, so you could feasibly get away with never talking in class as long as you do well on quizzes and assignments, but I wouldn't recommend it.\nThat said, Darragh is easily one of the best professors I've had so far at Columbia. Not only is he intelligent, caring, and adorable - he's also dedicated to evaluating the purpose of Lit Hum. This often occurs from a gender studies perspective, but if gender studies isn't your thing, he will certainly be respectful of that. That said, I think if you consider feminism/queer theory scary subjects, this class will help you realize that they aren't at all, and can be very approachable. I never thought I could get so much out of the class, and I probably would've thought Lit Hum was a ridiculous, antiquated class if not for having Darragh as a professor.\nWorkload:\nMidterm, final, and 2 essays per semester, as well as about 200-300 pages of reading a week and a short creative assignment or quote ID quiz about once every 2 weeks. Really not bad, but more than what \"easy\" sections might have\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 25, 2013",
            "review_content": "\nDarragh is an inspiring teacher that truly makes the core worthwhile. He's certainly tough when it comes to grading, but it comes from a place of true concern and care; he's more interested in your academic and intellectual growth than your GPA. Occasionally, his readings can be fairly inconsistent in length, with some nights involving 150+ pages and some less than 50, but he's fairly tolerant of a couple slip-ups in terms of assigned work. He's also more interested in \"broadening\" the scope of the core, which means a little more time spent thinking about non-traditional focal points of LitHum, like women authors and queer theory applications, but it doesn't feel intrusive. \nWorkload:\n2 shorter papers (3-4 pages) + ~200 pages a week + 1 midterm + 1 final + 1 longer paper (6-7)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 10, 2012",
            "review_content": "\nDarragh is great. He's witty, challenging, thorough, and sets up a schedule so that a different student brings in snacks every day so that we can eat cookies during our five minute break. ;)\nI agree, he is a pretty tough grader----I received Bs even after working pretty hard on my papers. Recently I've been meeting with him several times prior to each paper, though, and it has definitely helped me to do better in his class (currently have an A/A-, so it's not impossible to get As). I do most of the readings, but there are definitely those in the class who don't. Sparknotes/Shmoop works. If you feel seriously unprepared (i.e. haven't read or Sparknotes'd at all) you can go talk to him in the beginning of the class and he's understanding about it.\nYou should be glad to have Darragh; he guides the discussion well with just the right balance of asking questions/giving us info/letting the class discuss.\nWorkload:\nclass midterm/final, 2 papers, ~10 short discussion posts per semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 03, 2012",
            "review_content": "\nThe review below is correct. Darragh's class isn't as easy as some Lit Hum sections. However, his style of teaching is clear, he's pretty funny, and a nice guy. He's an understanding professor whose humor and cool drama exercises at least keep you awake. Admittedly, the grading is frustrating. Breaking a B on a paper is difficult, but he does give a lot of feedback on your writing, and makes his expectations clear. I'd rather have Darragh than some Lit Hum section where you sit and listen to some old guy talk for two hours. I'd suffer from B+ syndrome for it. \nWorkload:\nusual reading, two papers, courseworks discussion posts, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2011",
            "review_content": "\nIf you have any inclination of getting a good grade in lithum, DO NOT PICK DARRAGH. He is the hardest grader, giving half the class C+ and below on the first essay, claiming the grades would raise for the second half, and then giving out B- and C+ yet again. This class is a GPA killer as opposed to some other lithum classes that give out solid As on essays, Darragh's you'd be jumping for joy at receiving a B. \n\nWorkload:\nTwo Essays- 75% of the class got B or below on both\nCourseworks Posts - 6 first semester, 2 second semester \n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 25, 2010",
            "review_content": "\nI'm surprised no one has written a review yet. In my opinion, Mr. Martin is an excellent teacher. Not only is he very clear about what he expects in all three papers, his comments and criticisms are extremely relevant and helpful. As long as you continually improve on each of your successive drafts (two for every paper) there's no reason you shouldn't do well.\nHe's also unimaginably understanding about deadlines. Forgot to print out your assignment or paper? No problem, put it in his mailbox or give it to him during the next class. Down with flu for two weeks? He'll extend the deadline for your paper. Show that you're putting effort into the class and it shouldn't be a problem. Don't do your chemistry homework in class or he'll call you out (and not in an unreasonable manner, either).\nAnother good point is that he's very responsive to student feedback. At the end of every writing exercise/activity, he would ask how we felt about it. He then reused the good ones for subsequent papers and chucked the bad ones. \nGood teacher, incisive comments on papers, nice and reasonable about papers and deadlines, continuously improving the class based on feedback. What more could you ask for in a UW teacher?\nAlso, none of that reflection stuff at the end of the semester. One less paper to write, and you get more time to work on your research essay.\nDisclaimer: I'm an engineer and I did well. Should be a breeze for CC students.\nWorkload:\n30% Paper 1 (Lens Essay)\n30% Paper 2 (Conversation Essay)\n40% Paper 3 (Research Essay)\n"
        }
    ]
}