{
    "prof_info": [
        {
            "prof_name": "Masha Mimran",
            "prof_id": 11274,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I and II",
            "review_date": "April 10, 2015",
            "review_content": "\nMy first year at Barnard would have been way worse without Masha every morning. She is really incredible. Our class was small- 5-8 students. We all bonded with her and our class had this incredibly fun, loving, and engaging dynamic. Masha is a really interesting person and so sometimes we would get distracted from our lesson and talk about life and tell stories. Usually when we did this, we would talk in French so I felt like my French were really improving because I was learning to converse about normal stuff in French. She is really good at explaining stuff, but if you do the very light reading and the worksheets and you participate, this class should not be hard.\nMasha really cares about our learning and our interest and it really shows. My whole class adores her, and one boy even scheduled our class during his mandatory Core class and skipped it just so he could take Masha's class. On holidays she will bring bags and bags of Dylan's Candy Bar candy and give it to us to take home, and twice we also had a fancy cheese and cracker party. I feel like I've learned so much French and that I really wanted to learn it and enjoyed it. \nShe is a badass- she will not take shit from you so don't try and pull anything over her. ALWAYS print your essays and bring them to class. Don't skip unless you have a good reason and she really likes you. She has a lot of really fascinating stories and a ridiculous background so get to know her if you get the chance. Respect her, and she will respect you. \nWorkload:\nAbout 4 one page compositions per semester which are creative and fun. Reading and worksheets most nights, but not always. Quizzes every couple of weeks and workbook exercises to turn in the day of the quiz. Midterms and finals, which I never thought were hard. Sometimes she will cancel classes before weekends or breaks because she is nice and gets that we need breaks.\n"
        },
        {
            "course_name": "Elementary French I and II",
            "review_date": "April 10, 2015",
            "review_content": "\nMy first year at Barnard would have been way worse without Masha every morning. She is really incredible. Our class was small- 5-8 students. We all bonded with her and our class had this incredibly fun, loving, and engaging dynamic. Masha is a really interesting person and so sometimes we would get distracted from our lesson and talk about life and tell stories. Usually when we did this, we would talk in French so I felt like my French were really improving because I was learning to converse about normal stuff in French. She is really good at explaining stuff, but if you do the very light reading and the worksheets and you participate, this class should not be hard.\nMasha really cares about our learning and our interest and it really shows. My whole class adores her, and one boy even scheduled our class during his mandatory Core class and skipped it just so he could take Masha's class. On holidays she will bring bags and bags of Dylan's Candy Bar candy and give it to us to take home, and twice we also had a fancy cheese and cracker party. I feel like I've learned so much French and that I really wanted to learn it and enjoyed it. \nShe is a badass- she will not take shit from you so don't try and pull anything over her. ALWAYS print your essays and bring them to class. Don't skip unless you have a good reason and she really likes you. She has a lot of really fascinating stories and a ridiculous background so get to know her if you get the chance. Respect her, and she will respect you. \nWorkload:\nAbout 4 one page compositions per semester which are creative and fun. Reading and worksheets most nights, but not always. Quizzes every couple of weeks and workbook exercises to turn in the day of the quiz. Midterms and finals, which I never thought were hard. Sometimes she will cancel classes before weekends or breaks because she is nice and gets that we need breaks.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "August 01, 2014",
            "review_content": "\nMasha Mimran is an outstanding professor (if she's reading, I hope she knows who's writing this). I consider the hours I spent in her class to be some of my most well-spent hours at Barnard, on both an academic and personal level. Professor Mimran is brilliant and hilarious. She led our class in stimulating discussions on the works of Baudelaire and Maupassant, during which she not only shared her own unique perspectives, but genuinely listened to and considered ours. This is rare, especially in the overcrowded French courses at Barnard!  And she was able to make the grammar (and there was a lot of it) bearable, even enjoyable. She also organized other opportunities for us, such as hosting a French movie night. Professor Mimran is very much invested in her students--their well being, their ideas, and their success. \nWorkload:\nThe coursework is very manageable. Three compositions total, daily grammar exercises, and weekly posts online. Professor Mimran meets with you individually after you write your first composition--it's difficult to do literary analysis in another language, and she tries to help as much as possible. There is a midterm and a final. \n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "January 28, 2014",
            "review_content": "\nShe's a really good professor. She's hilarious, cheeky and engaging. She is thorough in grammatical explanations. Besides grammar, most There are about 3 quizzes, 3 compositions, a midterm, a final and class participation counts. She will drop your lowest quiz grade. One of the compositions is based on a french film of your choice so you have a chance to analyze a piece of your liking. Masha is also readily available to meet with you outside of class if needed. Just study and you will do well.\nWorkload:\nMild. See above.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "August 30, 2013",
            "review_content": "\nProfessor Mimran is a very nice person. She is very willing to meet with you in office hours (or even outside office hours) to go over concepts. The grammar in Intermediate II is a lot compared to Intermediate I. I found her explanations sometimes confused me even more so. There are a few papers (I think 3) where she grades on both your French ability and content. On essays she is tough on grades and getting an A certainly isn't easy (or even getting a B+ really). A lot of discussions on French Literature, really analyzing the short stories given out. Do not expect this class to be an easy A (as some lower-level language classes tend to be).\nWorkload:\nGrammar and a bit of reading for every class - usually not too much work. A few essays (I think 3) and a lot of quizzes and tests(maybe 6 in all). Last semester she dropped your lowest quiz grade. \n"
        },
        {
            "course_name": "Translating Madness",
            "review_date": "May 02, 2013",
            "review_content": "\nAmazing professor!! She is passionate and extremely knowledgeable. She is also very approachable and is always willing to help with advise on further research etc...The material was fascinating, and the professor always had interesting and insightful things to add to already great texts and films. The class atmosphere was also great, and Professor Mimran is really funny. One of the best classes I've taken at columbia! \nCourse material: medical texts, literary texts and films. The course explores how medicine and fiction influenced each other, especially during the 19th century, and specifically on the topic of madness and hysteria. It's really a fascinating course!\nWorkload:\nNot too heavy. Two papers and two exams. Weekly posts\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "December 20, 2011",
            "review_content": "\nShe is a wonderful professor, and I highly recommend her. She wants you to do well and always makes sure you know what to expect for exams and quizzes. The pacing of the course is fine, and you will come out of the class with a better understanding of french grammar. That being said, I would've liked to have spoken more in class. Speaking english was permitted for clarification of concepts and assignments. It's not hard to make a B, but I found it hard to do better than that.\nWorkload:\nNot terrible, and you always knew what to expect. Several quizzes, homework was checked, 3 essays, midterm, final. Not terrible. \n"
        }
    ]
}