{
    "prof_info": [
        {
            "prof_name": "Colleen Thomas",
            "prof_id": 2201,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Modern ",
            "review_date": "March 30, 2009",
            "review_content": "\nShe's amazing. Period. The way she moves and the movement she choreographs has caused me to think about my own movement in a new and more physically conscious way. She's helped me stay grounded in my movement and class is always interesting and fun. Everybody always wants to stay late and do the combination more times. Definitely take it if you can.\nWorkload:\nOne short paper. Attendance.\n"
        },
        {
            "course_name": "Contact Improv",
            "review_date": "January 01, 2009",
            "review_content": "\nGranted, contact improv has been a weekly habit for me for years, but Colleen is awesome -- able to explain principles, demonstrate them, and convince reluctant students to try things they think they can't do.  And she actually learns your name, which in some dance classes, doesn't happen.  Ever.\n"
        },
        {
            "course_name": "Contact Improv",
            "review_date": "July 06, 2005",
            "review_content": "\nthis class is so much fun!! (learning about the use of space and weight and trust and interaction and lifting technique to do things that physically shouldn't be possible...!) Most importantly, though, Colleen is a FANTASTIC teacher. As someone with almost no dance training, I very much appreciated her patience, attention to detail, dance knowledge, creativity, and incredible ability as a dancer. Watching her easily lift the biggest student in the class, who was a foot taller than her, and then roll him around her body, gave me a sense of safety and willingness to try new things. It's a little intense because of how closely and physically you work with people you're just meeting, and you have to do it like you mean it, and not care about embarrassment...! it's definitely a workout every time. take this class, if you can, and anything with her!\nWorkload:\nkeeping a journal-- writing up to a page after each class. easy to get behind on, but she's very relaxed about it. she collects it two or three times (without warning) during the semester. other than that, it's all attendance and participation.\n"
        },
        {
            "course_name": "Contact Improv",
            "review_date": "July 06, 2005",
            "review_content": "\nthis class is so much fun!! (learning about the use of space and weight and trust and interaction and lifting technique to do things that physically shouldn't be possible...!) Most importantly, though, Colleen is a FANTASTIC teacher. As someone with almost no dance training, I very much appreciated her patience, attention to detail, dance knowledge, creativity, and incredible ability as a dancer. Watching her easily lift the biggest student in the class, who was a foot taller than her, and then roll him around her body, gave me a sense of safety and willingness to try new things. It's a little intense because of how closely and physically you work with people you're just meeting, and you have to do it like you mean it, and not care about embarrassment...! it's definitely a workout every time. take this class, if you can, and anything with her!\nWorkload:\nkeeping a journal-- writing up to a page after each class. easy to get behind on, but she's very relaxed about it. she collects it two or three times (without warning) during the semester. other than that, it's all attendance and participation.\n"
        },
        {
            "course_name": "Modern ",
            "review_date": "November 10, 2004",
            "review_content": "\nShe is amazing.  Her material will challenge and satisfy you no matter what level dancer you are.  The class is release-y, yoga-y and \"athletic\" (aka go on the floor and put weight into your hands sometimes).  She is really sweet and really will watch you dance and offer helpful comments.  The other great thing about the class is that she is an absolutely AMAZING dancer and young enough to still really throw herself around, so just watching her is very inspiring.  A very positive, hopefully permanent addition to the department.\n"
        }
    ]
}