{
    "prof_info": [
        {
            "prof_name": "Edward Coffman",
            "prof_id": 1813,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Probability",
            "review_date": "January 28, 2006",
            "review_content": "\nProfessor Coffman is the worst teacher you will ever have in your life. \nThere is no way around that fact. Yes, I call it a fact. The list of justification can go on and on for pages on end, but I will just highlight how bad of an experience this class was to me - \n- Professor Coffman is a boring lecturer. Yes, other professors can be quite boring as well, but PC takes it to the next level. By the second week of the semester, 2/3 of the students decided that it was better to sleep in the comfort of their own beds than in class, while the other 1/3 dozed off in class.\n- PC does not answer your questions well. He has this subtle condescending attitude where he gets slightly irritated if you do not understand his lecture. The funny part is, he is such a bad lecturer that 2/3 of the class loses his train of thought within 5 minutes. The worst part of it all is the students don't even bother asking him to clarify, because he can sometimes be harsh and never is able to explain concepts clearly.\n- PC is a bad lecturer. It is impossible to follow him in class. The highlight of the semester was actually at the 2nd midterm review, when he proceeded to write a \"sample\" problem on the board that took  no less than 20 minutes to explain. Needless to say, we had never seen such a difficult problem before. A lone student courageously raised her hand and asked \"Professor, will a question of this difficulty be on the exam?\"\nPC proceeded to say that this problem was not difficult at all, and that we had covered all the concepts in class already. This next part is what is hilarious: he attempts to proceed to solve the problem, but gets confused by his own train of thought and his writing. He thinks about it for 5 minutes, then says something to the effect of \"The rest of the problem is easy. Finish it at home.\"\n- PC makes himself available at all times of the day 7 days a week. That is respectable. But why would you go to an office hour, to sit one-on-one, and have PC utterly fail yet again to explain a concept of probability. Not to mention you would probably be too scared to ask simple questions since he expects you to remember and understand everything he says in lecture.\nThe bottom line is this: Do not take probability with Professor Coffman. You will learn absolutely nothing, be wasting your tuition, be wasting your time, and actually leave the class more confused and less confident than before. \nTake the 4000 level course, as I heard it is much easier.\n\n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 23, 2005",
            "review_content": "\nProfessor Coffman is not a good teacher. It is hard to get around that fact. Students catch on early in the course and by the time the first midterm rolls around attendance is hovering around 20%. I don't think I have taken a class at Columbia where the average student put in less effort. The exams were all straight forward applications of the material in the book and the class. He himself characterized the final as a \"feel good exam\". Nevertheless the averages scores were around a 50%, making it very easy to get a good grade. \nThe class itself covers an interesting set of topics though it does tend to move slowly, and you are held to a very low standard.\nWorkload:\nProblem sets about once every two weeks. Two midterms and a final all of which were fairly easy. \n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 04, 2005",
            "review_content": "\nProfessor Coffman is a very nice man with an incredible knowledge of probability theory and its applications. Sadly, he has great difficulty communicating that knowledge. His lectures are generally unsystematic and difficult to follow, and he makes frequent conceptual and arithmetic errors which make understanding the material based on his lectures alone something of a game of probability in and of itself.\nFor the first two-thirds of the semester there were weekly problem sets, but after the class average on the second midterm came in at about 30% I think Professor Coffman gave up grading them. Now he distributes optional problems from a similar course at MIT.\nIf you have an option, do not take probability with Professor Coffman.\nIf you do not have an option and only care about your grade, you can probably get at least a B simply by showing up to class (and exams) and doing the problem sets. If you really want to learn probability and can only take Coffman's course, get another probability text to supplement Bertsekas and Tsitsiklis and prepare yourself--from the beginning of the semester--to spend several hours a week reading from B&T; _and_ your own book and doing problems that are not required.\nProbability is an incredibly interesting and useful branch of mathematics that is notoriously difficult to teach. It is unfortunate but ultimately unsurprising that Professor Coffman has come up with no revolutionary methods for making the study of the field less painful.\nWorkload:\nWeekly problem sets, average time to complete 2 hours but with a large variance: some took 30 minutes and some took 6 hours. Two midterms: the first was straightforward and curved reasonably for a SEAS course; the class average on the second was about 30%, not because it was particularly hard but because nobody in the class (myself included) understood the material. One final, which I haven't taken yet.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "January 05, 2004",
            "review_content": "\nRUN RUN RUN and DON'T TURN BACK!  This class was one of the worst academic experience of my life.  Professor Coffman is a great guy, but one would be better off not going to his lectures.  Not only are these lectures boring, but they are filled with a plethora of mistakes that bring one's confusion a step further.  The terrible book does not help, either.  One is tricked into believing that Coffman is an easy grader on the first day, but DON'T BE FOOLED!  His grading rue brick is vague, and in the end, he just arbitrarily affixes a grade to your transcript.\nIn addition, most exam problems are just embarrassingly hard compared to the homework.  AVOID THIS CLASS AT ALL COSTS!\nWorkload:\nAbout one problem set a week.  Some you'll spend a LONG time on!2 midterms1 take-home midterm (because the average on midterm 2 was low)1 final exam\n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 02, 2003",
            "review_content": "\nProf Coffman is a renowned engineer who has spent 20 years in Bell Lab. He's a very nice old man whose office hour is 24/7. He would give you his home no. and invite you to his house to discuss problems. Excellent approachability. He would try his best to pull up the grade of the whole class. But he devoted all his free time to office hours because the average score of the test was as low as 40%. Not too many people understand what he is teaching in class and the textbook he uses is terrible --nothing more than a whole bunch of equations written by some MIT professors.  nothing to worry about the term grade, as i said, he will give you make-up exams, extra credit hws ..etc. he's one of the most devoted teacher i've ever seen, but his lectures are not as great as his personality. \nWorkload:\nweekly problem sets that consists of 5-6 questions. \n"
        }
    ]
}