{
    "prof_info": [
        {
            "prof_name": "Lila Abu-Lughod",
            "prof_id": 1649,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "April 26, 2013",
            "review_content": "\nProfessor Abu-Lughod does not deserve bad reviews.  She is a sweet woman with extension knowledge. She is forgiving, accepting, and overall willing to speak with us all about questions we may have.\nIt seems the anthropology department has changed up how they are teaching intro's by means of rotation of the professors.  Which ultimately leads to well-regarded Columbia professors who are usually teaching seminars at graduate levels to teach us undergrads.  It's actually pretty cool to get that opportunity, and I am grateful for it. \nLila does indeed have disjointed lectures, but by the end of the class she does get out what she's trying to say.  You just actually* have to listen. \nWorkload is very light because she claims to understand college life through her new experience as a kids-in-college mother. As such, it means heavy workload at the beginning of semesters (2 3-pagers, 1 write up, a class assignment) and thins it out toward the end of semester.  It's perfect when your other courses demand so much of you. \nIf you haven't noticed, I would take a course with her again. \nWorkload:\nAssigns books at a time, but class isn't necessarily based off them as much as what they stand for.  Women's studies heavy, which is fine for me! Entire semester was 3 2-page response papers, 1 2-page ethnography, 3 in class assignments that are linked together at the end.\n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "December 21, 2011",
            "review_content": "\nIt makes me sad that Abu-Lughod has such bad reviews - I honestly enjoyed this class, even if the lectures didn't always connect seamlessly to each other. They were internally followable, definitely, and she obviously knows her stuff and gets excited about her subjects. She doesn't use powerpoints (if you're a science major, you may not be expecting this), so go to the lectures - they're worth it. She has a lot to say and is quite articulate, able to string together concepts in a way that makes you think.\nThis class is heavy on the reading, but the readings make the class. They're absolutely great. I feel as though much of what I've taken from this class comes from the readings; Abu-Lughod herself says that the class is mostly \"a guide to the readings.\"\nWorkload:\n3 short papers (chosen from 5 opportunities) on required films, in-class midterm, take home final, LOTS of reading (eight books plus several articles).\n"
        },
        {
            "course_name": "The Subject of Rights",
            "review_date": "January 12, 2009",
            "review_content": "\nThis was a graduate course and not likely to be repeated, but I just want to echo the comments made by folks in her other, older classes.  Abu-Lughod is well respected in her field and influential in her application of media theory to Middle Eastern contexts, but she does not know how to run a seminar. Her assignment of team in-class presentations meant that at least a third of the class was devoted to drowning, self-important graduate jargon that was often completely off target. Abu-Lughod was always too polite to shut them off, and would immediately attempt to redirect conversation to whatever topics she had outlined in her mind as important to begin with. She assigned mammoth amounts of reading but never gave pointers as to how to approach it, and she favored the few students in class who she had worked with in other contexts. \nThe other difficult thing is that it was clear that she was using the course to formulate her own thoughts on the topic of gender and sexuality rights in illiberal contexts. I know this is a common thing for professors to do, but she often seemed to be unprepared for the depth and seriousness of the issues at hand.\nWorkload:\nLots of dense reading, weekly Courseworks responses, a final research paper.\n"
        },
        {
            "course_name": "Gender, Culture, and Human Rights",
            "review_date": "January 03, 2009",
            "review_content": "\nI went into this class know Professer Abu-Lughod doesn't have the best reviews, and I hoped she might be better in a seminar setting.  She wasn't.  I had a hard time getting valuable information from each book we read--she didn't try to build from one week to the next.  Workload was rather easy...you don't really need to read the books except for the week you present.  It is past the final deadline for grades, and she still has not turned ours in.\nWorkload:\n1 book a week, 1 presentation, 1 paper on the book you presented, 15 page final research paper\n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "September 01, 2006",
            "review_content": "\nShe is a horrible lecturer.  Totally disorganized, kind of an airhead. The readings she assigned were great, but sometimes irrelevant.  We had to buy some books that were expensive that she should have just photocopied 3 pages out of because that is all we really got out of the entire book.  The TAs were pretty good.  Lecture was painful because she was such a flake and had no notes, no points to make...The syllabus was very, very structured, but you would  never know this from hearing her lectures.  Good books in general, the work load was weird.  Two out of 3 little papers...on strict topics that were RIDICULOUSLY DUMB.  Then midterm/takehome final that were basically silly.  She graded easily but her TAs graded harshly.  the assignments were up in the air...you never knew how you would do.  Good topics, good readings....bad class. \n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "June 04, 2006",
            "review_content": "\nMaybe the most disappointing class I have taken while at Columbia.  Prof. Abu-Lughod is a brilliant woman but you would never know it if you attended one of her disorganized babble sessions that were supposed to be lectures.  I often wondered if she prepared lecture notes or just went up there and winged it every class. I think my bad experience with the course also had to do with the fact that I felt the T.A.'s were horrible.  They seemed totally uninterested in the course and were all about asserting their dominance over us.  We had 2 lectures and 1 discussion session (with one of three T.A.'s) every week. My discussion sessions consisted of our T.A. talking and talking and talking....  I'm telling you... this man LOVED to hear himself talk.  He also loved to make people feel uncomfortable and was not afraid to insult students.  All in all I did manage to learn quite a bit about the subject but I think it was a reuslt of the interesting articles we read and the movies we saw.  \nFinal thought: Abu-Lughod is an great writer and researcher...  but her lectures made me want to stick needles in my eyes.  \nPost Script if I never hear the words, Post-Modernist...Agency...Discursive Tradition...Orientalist....etc. again I will be very thankful. \n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "May 26, 2006",
            "review_content": "\nI think professor Abu-Lughod has improved since the last reviews, so I figured I'd update them.  She is a very interesting lecturer.  You'll feel like you are sitting around discussing topics with your friends, which is a difficult atmosphere to cultivate with 40 kids.  If you like a more rigid format, you might not care for the class.  I found myself learning what I needed to learn without frantically taking down notes and cramming for exams.  She wants you to understand principles and fundamentals.  If you like classes where you go, sit, listen and discuss, this is probably a good fit for you.\nWorkload:\nTwo 3 page papers, you have your choice of 3 possible due dates and topics to choose from.  A midterm and a final that are completely manageable if you pay attention and think about what you've read and discussed.\n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "May 07, 2006",
            "review_content": "\nProfessor Abu-Lughod is not a very good lecturer. Her lectures were usually disorganized, and it was hard to tell what the most important points were. (I took this class without any background in anthropology or MELAC, so that may make a difference.) Plus, if someone asked a question she was liable to spend half an hour answering it (which is good, I suppose), but never get back on track. That said, the readings and movies were very interesting, and when she gave a good lecture, it was really good. Overall, I would recommend this class because the topic is relevant and very interesting, but be prepared for some confusing lectures.\nWorkload:\na lot of reading, two three to five-page papers, mid-term, take-home final\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "November 19, 2003",
            "review_content": "\nThe articles and topics are incredibly interesting.  If you skip a few lectures, don't worry about it- I hardly took notes in them and did fine.  However, be sure to read at least a few of the assigned readings each week.  You HAVE TO participate in the discussion section for her to like you.. if you do that, you'll for sure get an A.  Be warned,  she's a bit out there.  Her \"frazzledness\" drove me crazy at times!  But just deal, it's an easy and really really good course. \nWorkload:\nThree papers and a take-home final.. her grading is not hard at all!\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "November 17, 2003",
            "review_content": "\nthe course is co-taught with Amanda Swarr and was very interesting... weekly discussion section, too... overall good class... the readings are very interesting, but the lectures can drag on at points... the lectures are given by Lila, Amanda and the 2 TAs\nWorkload:\nAverage to hard...three 5 page papers, 1 take home paper final...  LOTS of reading though... sometimes it's hard to keep up...\n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "September 01, 2003",
            "review_content": "\nProf. Abu-Lughod tries very hard to make this class worth while.  she assigns good readings, interesting paper topics.  she prepares for lectures, invites guest speakers and shows a variety of relevant movies.  however, it seems that she can never really overcome the fact that she believes that it is impossible to teach a class on such a enormously broad topic - therefore what you end up with is lots of repetative explanations of easy to understand ethnographies because she fears making any generalization that is not supported by an anthropological study - so despite her effort classes are very boring and you really don't ever have to go - you will get just as much from just the readings,  the movies and the short papers - \nWorkload:\n reasonalble amount of reading -take home midterm and final - two short film responses \n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "July 10, 2003",
            "review_content": "\nWhile her lectures can be a bit scattered and sometimes boring, Lila really knows her stuff and the readings are great. She also is very approacable and really cares about her students. She incorporates films into the class, which you have to write two short (3 pg) papers on. The films are great and relate very well to the class readings. The Midterm and Final are both take-home and you have the ability to choose which readings you will write on, so you can eliminate the denser, slightly more boring ones. Overall, the grading was very fair and not too hard. I would recommend taking this class to anyone interested in women's studies or the middle east.\nWorkload:\nTwo 3 pg papers. Take home midterm and final.\n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "June 01, 2003",
            "review_content": "\nExcellent material used in this class, however, at times I dozed off because of her monotonous voice.  However, I did enjoy this class as well as the TAs.  This class has alot of potential and is quite enjoyable.  Wouldn't mind having her again for sure.\nWorkload:\n2 papers, plus 1 optional extra credit paper, midterm take home exam and final take home exam\n"
        },
        {
            "course_name": "Women and Gender in the Muslim World",
            "review_date": "May 21, 2003",
            "review_content": "\nIf youre into this sort of thing, the topic and the readings are interesting.  The professor is very, very knowledgeable, but seems uncomfortable in front of a crowd.  Her lecture style is disjointed, which can sometimes make the class boring.  But she and the TAs are really nice, we watched a lot of movies, and the work load isnt that bad.  I would take the class again.\nWorkload:\n2 of 3 short papers based on movie/reading combos, take home midterm and final, a bs in class debate that required nothing.\n"
        }
    ]
}