{
    "prof_info": [
        {
            "prof_name": "Eric Urban",
            "prof_id": 2431,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "January 15, 2014",
            "review_content": "\nI actually recommend this section if you have to take Calc III.\nYes, Prof. Urban has many teaching flaws. But for the math department, he's actually not half bad. He's relatively slow (could be a positive or negative depending on your own math abilities). A lot of times he reads straight out of the book. He has a heavy French accent (you get used to it pretty quickly). He never checks his email (big piss off). On the other hand, he's a really nice guy and will answer any questions you ask. He's pretty laid back and the class was relatively easy.\nThe class itself I found to be a very easy A (I am pretty good at math though, so take that for what it's worth). Most of the other students in the class were econ majors who suck at math but needed Calc III, so that helped the curve. His test questions are all the most basic forms of the problems we go over during class. He dumbs it down big time. The problems on the WebAssign are way harder than the test problems. Don't even bother studying those. (On the second midterm, for example, there were two questions that were variations of, If you have points A, B, and C, what is a plane that contains them all? Could not be simpler.)\nIf you take this class, this is what I recommend doing: set aside 20 minutes before each class and learn most of it beforehand. If you don't, you will sometimes find yourself completely lost and he doesn't repeat himself or elaborate much. Bring the textbook to class and follow along. Sometimes he uses notation I don't recognize that is explained in the book, and the book is also great at explaining concepts. Also, go to the Math room at Barnard if you have questions.\nFor the exams, read over the textbook thoroughly and do the sample problems and you'll be fine. Don't skip steps on the test: I found out the hard way that if you get the question right but don't do it the way we learned (or explain yourself), he WILL take off points. (Most math profs only check your work if you get it wrong.) Also, it's really hard to argue for points with him, but I guess that evens out over the whole class.\nWorkload:\n10 WebAssigns - you get 5 answers for each question, so it was not hard to get straight 100%'s\n2 midterms\n1 final (cumulative)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "October 01, 2013",
            "review_content": "\nSo if you're taking this class and you've already done something equivalent in high school he really isn't that bad. HOWEVER, if you are taking this course because you actually need to learn things, you may want to rethink registering for his section. First of all, he has a heavy french accent which would be fine if he didn't speak at a subsonic volume. You have to sit in the front row if you want to hear anything that he's saying. He knows his stuff, but doesn't know how to teach it. He's an overall nice guy, but that only takes you so far if you're a mediocre teacher/have mediocre communication skills. The class moves at a glacial pace which could be good or bad depending on your calc background/abilities. It is a struggle to pay attention in this class. \nWorkload:\nEasy, weekly problem sets on webassign. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 13, 2012",
            "review_content": "\nI must admit, at first I only ended up in Eric Urban's class because all of the other Calc IV teacher's classes were full, and after reading some of CULPA's reviews I sincerely went in expecting the worst.\nHowever, Urban is actually simply a mediocre professor. He is intelligent and he follows the book fairly strictly (even so far as using the same examples sometimes). He seems like a nice individual, and I have gone to a couple office hours and he was friendly and was willing to work through some problems on the chalk board. His homework is not very long takes maybe a couple of hours to do in total and is from the textbook, and for every homework assignment he hands out homework solutions which were helpful. \nFor the midterms, he bases the questions off of homework questions(he does not give the class averages but he told me them during office hours and when asked). He also gives practice midterms, goes through them in class, and then hands out typed well-written solutions. Also, as mentioned in a previous review, he does not use Courseworks very well, meaning it is imperative that you go to class so that 1) you don't miss homework assignnments and 2) you don't miss any handouts that he gives in class (i.e. homework solutions, practice midterms, graded homeworks). \nI received an A in this class, having gone to around 75% of the classes, but always doing the homework. I didn't do any excessive studying for this class (maybe the 2 hours for homework), but the material is not that much (covers two chapters in the textbook). The one part that was extremely hard was the complex functions/complex derivatives and integrals section that was tacked on to the end (and which comprised a lot of the final), but that required some self-studying. Overall, I have no idea how he graded the course but I received an \"A\" without working too hard in the class and not being that great at all in Calculus. \nPros:\n-follows the textbook (homework)\n-fairly decent professor, available during his office hours\n-handed back homework solutions\n-practice midterms very similar to the midterms (which sometimes had questions exactly from the homework)\nCons:\n-sometimes would get lost in his lectures and he sometimes would skip steps\n-not the best teacher but follows the textbook pretty well\n-coming to this class is a necessity because he doesn't post anything online\n\nWorkload:\nweekly homework assignments (exactly from the textbook), pretty standard homework sets, 2 midterms (he gave practice midterms with solutions that are fairly similar and they were based off of the homework), one final that was also very similar to the practice final\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 12, 2012",
            "review_content": "\nEric Urban seems as if he is an intelligent guy. but as a teacher i would not recommend him to anyone\nHere is why I would not recommend this class to you\n - Eric Urban does not teach. He reads the textbook in class and solves the examples that are in the textbook. when asked to explain something he is at a loss for words and does not manage to communicate it.\n - He is extremely rude and arrogant and does not give the slightest amount of fuck about the class or his students\n - He does not post anything on coursework's. not the homework's, the solutions to the homeworks, the grades, syllabus, solutions to practice finals. If you know how to do something you're lucky otherwise you're pretty much screwed in this class\n - There is absolutely no teaching that occurs in the classroom environment. Halfway through the semester i just went out of formality.\n - Grading. This class is not curved and the final is quite hard, so if you want an A in calc4 do not come here (If you think this is just cause I am stupid, I got an A+ in both calc 2 and 3)\n - He doesn't appreciate it when people bunk class and will make sure that you suffer in some way if you regularly do not go to class and do the material on your own. (So if you're one of those people who like to do that, he really made it hard for my friend who did)\n\nHere is why i would recommend this class to you\n.damn can't think of one good thing to say abut this class.\nWorkload:\nLong ass homework sets that can be confusing. 2 midterms that are quite doable. One hard final\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 22, 2006",
            "review_content": "\nI would never recommend Urban for calculus IV to anyone. Like previous comments, he is incredibly boring in class, and he simply repeats the information in the book (even the same examples). Personally, it was not difficult to understand his French accent, but that wasn't the main problem. It was that when asked to rephrase an explanation, he couldn't. Urban also gives very little partial credit, so in most cases on the tests you either get it or you don't. Even if there are multiple ways to solve a problem, if you don't do the easiest method (the method he wants) and get any part wrong, you get no credit. My friend got a D in this class, so be warned. \nWorkload:\n5+ hour homework sets a week, 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 14, 2006",
            "review_content": "\nI don't usually give negative reviews of professors, but Eric Urban is by far the most apathetic professor I've ever had.  You get the impression that he spent a total of 5 minutes preparing for the class, and from my observations his lack of interest started way before students began walking out during the middle of the lectures.  By lectures, I mean copying the textbook onto the board (and often making mistakes while doing so).  His accent really isn't that bad, but illegible handwriting provides another hurdle.  The only time that I learned anything at all in the lectures was when the TA taught the class for a week, and I was amazed by how easy the material can be if only someone can teach it in a clear, thorough manner.  Urban's attitude toward students can only be described as arrogant, especially when he refused to provide answers to the practice final even when that would have helped a lot.  All in all, avoid him, at least for the calc sequence.  I hear he cares a bit more about his upper-level math classes.    \nWorkload:\nlong, long, LONG problem sets that frequently took 10+ hours.  they are repetitive and messy, but don't necessarily help you learn the material better.  fair exams.  \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 03, 2006",
            "review_content": "\nI HATED this class! I found myself confused for a majority of the semester because Urban fails to clearly explain the material. His french accent, although not horrible, doesn't help either. At one point one of our TA's came in to teach the class and I, along with the rest of the class, felt enlightened. His homework is ridiculously, EXTREMELY long and his exams quite difficult even though he does curve to a B. He seems like a nice guy although at times somewhat condescending esp. when he asked,\"what? you don't get it, do you? what? really???\" For the sake of your sanity, it's in your best interest to avoid Urban.\nWorkload:\nhorrible weekly problem sets, two midterms, and a final\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 24, 2005",
            "review_content": "\nProfessor Urban did seem to take interest in the class in the beginning of the semester, but that quickly faded.  I blame the class somewhat because about 2 lectures in, more than half the class stopped showing up and even more walked out right in the middle of his lecture.  Because the door was right by the board, it was disruptive and extremely rude.  While this is no excuse for a lack of interest in teaching, it was certainly a mutual disinterst between Professor Urban and the class.  Professor Urban also had a hard time explaining things in more than one manner when people didn't understand him.  It was mostly a language barrier thing as he speaks French, but it wasn't the worst of problems.  What did bother me was that he refused to send solutions to the practice final even though we asked him to.  It didn't make much sense at all.  Overall, I hope if there was a class more enthused to learn he would be more enthused to teach, but all I can say is the class was extremely dry.  The material is not terribly difficult, but it is new (especially line integrals) and should be carefully taught.  There are much worse professors but I can't imagine Professor Urban being someone's first choice.\nWorkload:\nfirst 2/3 of semester: long tedious boring problem setslast 1/3 of semester: easy quick problem sets2 easy midterms1 easy final as long as you understand the concepts\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 03, 2005",
            "review_content": "\nI would not take a class with him again. His attitude was generally arrogant, and he was not very approachable or friendly. His accent makes lectures difficult to understand, and our class went through three TA's over the course of one semester, so it was difficult to get grading issues addressed. Exams were curved to a B, but points were taken off somewhat arbitrarily .\nWorkload:\nTypical of calc classes: weekly problem sets (10-15 problems), 2 midterms, and a final.\n"
        },
        {
            "course_name": "Complex Analysis and Riemann Surfaces",
            "review_date": "January 18, 2005",
            "review_content": "\nSolid professor and a nice, easygoing guy. Lectured coherently for the most part, with some moments of  confusion and some moments of exceptional clarity. His style didn't really encourage questions during lecture, but he was very accessible and eager to talk to students outside of class. I wouldn't take a class with him just to have him as a professor, but if you need to learn something he's teaching, you can count on him to teach it to you.\nWorkload:\nTake home midterm and final. Both were very good exams with problems of various difficulty levels and I learned a lot from each of them. He gave us several weeks to do the midterm, but only one week to do the final and since it was at the end of the semester (and also very difficult) that made it hard to finish.\n"
        }
    ]
}