{
    "prof_info": [
        {
            "prof_name": "Eric Simring",
            "prof_id": 1990,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Seminar",
            "review_date": "January 06, 2005",
            "review_content": "\nEric Simring is eccentric, loves to rock climb, and very clearly loves math. It comes through in everything he said. The class was us lecturing once the semester and Eric and everyone else listening. And you'd think that this would make it hard to evaluate him as a teacher, but not so. He helped us prepare every week, and was always ready to talk. And yes, he seems quite eccentric, but always encouraging, and patient. He would draw connection after connection so that people would understand, and do so until they were happy. I encourage people to take his classes, and to feel free to \"bother\" him when they do. He'd love it, and it'll be the best way to learn from him.\nWorkload:\none presentation. and had to keep up with readings (light).\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 25, 2004",
            "review_content": "\nAs a student who a) has taken Calculus before (7 years ago so you can all guess how much I remember) and b) enjoys rhetoric and \"unconventional\" teaching methods, I guess I can presume, based on many of the other reviews, that my assessments of Eric's class are going to be viewed as biased.  So be it.  I think that Eric's class is phenomenal.  I have taken many math, econ, science classes before and found myself both uninterested in the material and bored with the teacher's style.  Eric actually makes math interesting for me.   Yes Eric does assign a lot of homework, but I've found that I'm actually learning the material better than I have in most math classes I've taken before.  I'm not sure if I can attribute that to the workload or his teaching style or a combination of the two.  My suggestion to anyone looking to take a class with Eric is a) be prepared for a heavy workload...it's tough but it's worth it. b) if you are looking for a teacher to sit in front of the class and recite the book to you than you should look elsewhere.  c)  if you have questions or problems with the material, raise your hand in class or go to office hours.  In my experience he is always available to help.  I've noticed that in a lot of the reviews people have complained that Eric bases the class on a select few people who have \"taken Calculus before\".  This may happen from time to time, but, to his credit, I have very very rarely seen anyone raise their hand or ask a question in class when they have a problem.  He asks the class repeatedly if they are following the material, and quite often he is just met with silence.  Generally, the only people who do respond are the ones who have \"taken Calculus before\".  I think if you are willing to ask questions when you are confused and willing to accept a less conventional teaching method than Eric SImring is the best teacher I can recommend.\nWorkload:\nA lot of homework problems, but very flexible deadlines.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 21, 2004",
            "review_content": "\nOf course the people who say \"He's the man\" are the ones who have taken THIS SAME CLASS BEFORE! So he screwd the rest of us and that is not fair. Eric is OK ONLY  and believe me ONLY for students who have taken Calc I before, otherwise, forget it. He totally ruined my life and my GPA. HE DOESN'T TEACH!! and there's no other way around it. I totally consider the people who tell lies, (they are lying when they tell you he's great) should just keep their mouths shut. They come to class, and SHOW OFF because they're so brilliant!! NO! They took this class just last semester! and the people like me who are taking the class for the first time have to just teach ourselves or find a private tutor to TEACH us! I just feel so frustrated. I've waisted my time and money. I have never had such an awful experience in this University. New students, take my advice: stay away from this guy . And forget about asking questions about the material! That's boring for him and he just shuts you off! Ask him about painting, climbing, and any nonsense that has nothing to do with Calculus. And the hoemwork is ridiculous really. He doesn't show up for class, then he decides to do so and then he gives you TONS, tons, tons of homework and he just did not bother to teach. I regret having made the decision to stay in his class but by the time I knew how bad it was it was too late and the other sections were and are way ahead of us. Really a horrible experience and I hope the people the nest time I can choose better. This guy has made me HATE  coming to class and hate the material covered. There are no words to explain the dimension of his irresponsibility and the math dept. should do something about him.Just ask the nearly 15 students who already droped the class.\nWorkload:\nTONS!!!and not helpful.Hire a tutor or a secretary to help with the homework.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 18, 2004",
            "review_content": "\nEric is ridiculous, and if you have never taken calc before don't take his class.  There are several students who have taken a similar course (as recently as last semester at another school) and he makes the exams for them.   Class is also conducted for thier sakes because he hates to stop whatever he is doing to explain to those of us who have never taken calc before.  \nThe class is confusing, he speeds through the material and spends the class time talking about things that have nothing to do with math.  To make matters worse, he rarely shows up for office hours and has missed 4 or 5 classes so far this semester.  We have two weeks of class left and two chapters to cover.  \nWorkload:\nExtremely intense.  If you are taking other courses, forget about it.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 17, 2004",
            "review_content": "\nThe class this semester consists of 3 types of students. Those that have already taken calculus, those that have not, and those married to a math major. Those that have taken calculus before or are married to a math tutor think that eric is \"The Man.\" Those that are at the level you are suppose to be for an introductory calculus class are struggling and frustrated. 2 of the first 3 classes eric did not bother to attend which immediately put most of the class in a hole (except for those that dropped which was approximately half the class, we started at about 30 and are now at 15). Class begins at 6:10pm, eric stops talking about himself and begins instructing at 6:25pm(at the earliest). So, you pay for at least 15 minutes of every class to hear about how awesome he is. He allows one of the students to answer every question that he poses to the class, which accelerates the class to the pace of a review. The students that have already taken calculus seem to like this because it allows more time for rhetoric, instead of instruction. The department decided not to include section 2.4 \"the precise definition of a limit\" in the curriculum. Eric added it back in for us because he wants us \"to know calculus the best!\" Well, the result is that we spent two valuable weeks on this section, which is the most difficult concept in the book(that is why the other professors decided to leave it out), and adding these 2 weeks to the classes he didn't attend in the beginning of the semester and those during the semster and all his latenesses - our class is now far behind the other classes. It is now 2 weeks before finals and he has alot of material we need to cover before the final, which means we get a very unreasonable amount of time to learn alot of new material. With this rush coming, how does Eric respond? He didn't bother to show up for class this past wednesday 4/14/04. A girl showed up and said he was sick. Coincidentally, he was scheduled to leave for vacation after class that evening. During the lectures he usually goes off on tangents that have very little or nothing to do with the subject. These constant distractions increase the difficulty of absorbing the material. To compound this, our homeworks are not given back until at least 2 weeks after they are handed in(our first 3 homework assignments were given back to us during the 6th week of classes far beyond the time we were discussing the material in class). Eric gives enormous homework assignments(HUGE) to make up for his lack of effort in class. And then has the nerve to suggest that you should only be spending 4 hours a week on the homeworks. The lectures are on a section in the book, the homeworks are on 4 or 5 sections of the book. He seems to pride himself on writing illegibly and very quickly. He enjoys jumping around the class room from blackboard to blackboard twisting you around to try and follow what he is saying. No one that has not previously taken calculus will be leaving this class prepared for calculus II. Unless they are married to a math major. If I knew my semester was going to go this way I would have bought the book, taught myself and tested out of the requirement. The funny thing is, is that that is exactly what I am doing. Only difference is the $3,000 that I paid to Columbia to learn that Eric is \"The Man!\" Also, the reviews written previously about how great eric is were written by students that have previously taken calculus. I know them, I sit next to them in class and I have heard all their stories. Eric came into class on Monday 4/12/04 and told everyone not to read CULPA because of a bad review. So their glowing reviews about Eric are only in response to the negative review written previously. The saddest part about this whole thing is that he is lowering people's GPA's by forcing them to take so much time away from their other studies to make up for his lack of effort in class. And the only students that are going to receive an A in his class are the one's that are taking calculus for the second time(these students shouldn't even be in the class to begin with, I guess it's not their money they are spending). I have to go now because I have a lot of homework to do. Good thing I can hand it in late? I want you to realize that I have NOT written ALL of what Eric has done against us this semester. And neither have the other reviewers. I am just in shock that a university that claims to be of such a high standard as Columbia would allow an instructor to get away with this type of conduct. Eric likes to chyme in about how difficult his professors were at Berkeley. I bet they showed up for class. Possibly even taught for the full 75 minutes. \nWorkload:\nMuch more than is productive.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 15, 2004",
            "review_content": "\nI read the positive reviews about Eric and noticed that the negative reviews have been pulled.  Some people thing he is great.  Other people disagree.  He is a nice man, but he is not a good teacher.  He is irresponsible.  He talk too much about himself.  He wastes class time.  Then he rushes through the math.  He gives very hard tests and lots of homework.  And he does not cover a lot of the material in class.  It takes him a long time to give back corrected homework.  So you can be making mistakes all along and not know it.  He announced in class that someone wrote a bad review about him on CULPA.   He is a nice guy but a bad teacher.  \nWorkload:\nEvery week you get 20 to 40+ hours of homework.  And his tests are very hard.  He is flexible about when you hand it in, but that is because it takes him a long time to grade it. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 12, 2004",
            "review_content": "\nEric Simring is a great teacher. Is his class hard? You bet. It is Calculus after all and this is Columbia University. You will be expected to work, but that doesnÂ’t mean it is impossible. \nEricÂ’s efficacy is in being able to communicate with his students in a friendly manner while explaining difficult material. If you are looking for a light load, however, choose another teacher because he loves homework. He insists that only through practice will you be able to understand the material. And, although he is right, the homework load can be quite unbearable at times. Still he allows you to hand in the material when you are finished (as in late) and without penalty. He works hard to accommodate all his students to hand in late assignments and missing exams.\n\nWorkload:\nHeavy: Expect a ton of homework. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 11, 2004",
            "review_content": "\nEric Simring in THE GREATEST grad-student to ever teach Mathematics at Columbia.  Not only does he know his math, he can also relate it to a multitude of different subjects--including the humanities.    Okay, so he sometimes makes me say \"LETS DO SOME MATH ALREADY\" because he tends to digress deeply into an unpredictable but very interesting abyss!  But he always gets the job done.  Somehow, someway, he gets the job done.  Not only that, he has office hours, you can catch him at the Barnard Help Room, you can schedule to meet with him privately (believe me, he's good for it), and he offers 2,3, and even 4 outside-of-class reviews per semester.  He gives out handouts, he teaches you what's behind the math instead of merely showing you how to do something without fully understanding and thus setting you up for failure, and he has totally revolutionized the way of presenting the material by focusing on proofs and concepts instead of on problems.  To anyone who is studying at Columbia: whether you like math or not, whether you need to take it or not, take a class with Eric Simring!  You will learn more math than you have ever learned, you will laugh all semester at his bizarre humor (he once climbed the chalked board to demonstrate his mountain climbing abilities), you will make a great friend and you will witness someone who genuinely is burned on mathematics!  \nWorkload:\nHeavy but feasible.  Moreover, he's EXTREMELY flexible about due dates (WAY FLEXIBLE!).  Homework every week (trust me you want to do it).  LOTS OF EXTRA CREDIT!  No calculators, 2 Mid-terms and a final, which are nothing like any traditional tests you can imagine in the sense that you'll be prooving theorems as much as applying mathematical concepts.  They're hard if you don't go to class; easy if you glance through your notes once in a while.  Let's not forget about the huge curve.  Word to the wise: in any mathematics course, you want to read the book as well as attend lectures.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 06, 2004",
            "review_content": "\nEric is extremely arrogant, rude and very pretentious.  He is very unorganized and he enjoys writing in the most illegible handwriting ever. Then if you don't understand it he says, \"just bear with me here. I'm going to make this really hard and then really easy...\" and then keeps going. The main problem I found with Eric was that he will take one student who seems to be getting it and measure the rest of the class according to him.  Unfotunately for me and the rest of the people who  were seeing the concepts for the first time, Eric glossed over us completely without a second thought. \n If that wasn't bad enough he also uses these random obscure notations such as C.D... but don't get him started on what they mean because he will give a ten minute explanation involving some greek fable about Echo the nymph, just to prove that he is not only a genius in math but also extremely well versed in the humanities. When he finally decides to go back to his really imcomprehensible explanation of limits, he once again basks in the jargon of \"sufficiently arbitrarily close...\" but never explains the concept.  \nI worked really hard in his class and tried to meet with him during office hours but he was NEVER there. \nI'm usually not this unkind to anyone but honestly I still harbor a lot of anger for Eric because he ultimately really screwed me over in terms of completely my other requirements because I was so lost by the first midterm that I had to drop his class. \nHonestly, I know I sound bitter but I wasn't the only one who got screwed. I know at least three other students who were taking this class to fulfill econ and pre-med requirements who also ended up dropping it in order to save their GPA and their sanity. \nMaybe I just had a really awful experience but quite frankly, I really don't think it gets much worse than this man. Do NOT take this course. \n\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 06, 2004",
            "review_content": "\nWhat can I say except HE IS THE MAN!  You won't regret it.  Not only do you learn the material, but you get to hear crazy stories for half the class.  Even though class usually starts 15 mins. late everyday, he still gets through the material.  He always tries to make himself available and makes sure everyone understands key concepts before moving on.  When it comes down to it, Eric knows his Math, presents it well, and gets you interested in it.  Although some will complain because they feel he spends too much time trying to imitate his advisor's accent, it is clear that he is interested in helping out students and loves to teach.  You'll also get random jokes on everything from Bush to Passover (but don't worry, \"it's okay cause i'm jewish\").  If anything, Eric will give you a new outlook on Math and help make your day brighter with his eccentric personality.  \nWorkload:\nlots of homework, but you can hand it in late without penalty, a few quizzes, long midterm (he didn't expect us to finish), second midterm, and a final, lots of extra credit\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "February 04, 2004",
            "review_content": "\nEric Simring is exceptional.  \nEric wants to give an A+ grade to everyone of his students; however, you must work for it.  This is where his outstanding teaching skills enter.  He is kind, patient and takes the time to pay attention and challenge his students.  More importantly, Eric is ALWAYS willing to help and assist.   You can talk to him at any given time and have an amalgamation of the minds.  Eric is intelligent and a total badass, in my opinion. I loved his class!  His lectures are pleasurable and arduous, simultaneously.  The homeworks and exams are extremely long and challenging.  However, he factors the homework effort and assigns plenty of extra credit work into your final grade, which is an advantage.  I would highly recommend the class to all who are interested in pursuing the wonderful world of mathematics. It is very difficult to receive a grade lower than a B-.  Eric is the ideal math mentor.\n\nWorkload:\nHEAVY, Eric will make you earn the 3.0 points; however, it is definitely worth it.  \n"
        }
    ]
}