{
    "prof_info": [
        {
            "prof_name": "V. McNeill",
            "prof_id": 4127,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Transport I",
            "review_date": "October 30, 2013",
            "review_content": "\nIf you are a ChemE major then you probably have to take this class. So this is adressed to people who have the option of not taking it. In terms of material this class is much more a ODE/PDE class than it is a Transport Phenomena one. Professor McNeill doesnt really give the physical significance of any of the equations and even the problem sets dont require much of a knowledge of the physics of TP and is basically Math that is too complex for any one at this level to understand\nThe lecture style is quite dry. Like 'here is a bunch of differential equations that I am going to write on the board and read out while I am writing and you have to copy them down.' That being said sometimes she attempts at an explanation of what is going on. But its much less of that.\nThe HWks and exams are pretty hard and youre going to need to go to TA hours to solve them. SHe definitely does not give enough practice to prepare you for the exam. And there is quite a huge rift between what comes in the exam and whats on the homework.\nShe is kind of funny though and has a dry sense of humor that can be pretty hilarious sometimes. \nOtherwise she really does not do a good job of teaching something that is kind of non-intuitive to grasp for people in the first place. I made it a point to understand Transport Phenomena of my own accord but this class and prof Faye definitely didnt help. Vivian was more of a glorified note reader than a teacher and for all of that the class isnt easy to score in either.\nI would recommend that if another class can be taken, take that one otherwise goodluck. Youre probably going to have to youtube/khanacademy most of the material in any case\n\nWorkload:\nOne problem set every 1.5 weeks. 2 midterms and a final. Curves as generous as big booty hoes. Exams are really hard\n"
        },
        {
            "course_name": "Materials and Energy Balances",
            "review_date": "January 13, 2012",
            "review_content": "\nProfessor McNeill may not be the most dazzling lecturer, but she presents the material in a concise, easy-to-follow manner with helpful and often interesting examples. (Plus, if you pay attention, she has a killer dry wit.) I genuinely enjoyed this course, and I found Professor McNeill to be extremely intelligent, down to earth, and kind.\nOffice hours are helpful if you attend, but come prepared with specific questions or you will just stare at each other uncomfortably. Use the course as an opportunity to meet the people in your major--you'll be seeing a lot of them over the next few years.\nAlso, sidenote: the V stands for Vivian. Mystery solved.\nWorkload:\nSeven homework assignments, two midterms, a term project, and a final. All are fair if you make a modest effort to keep up with the material. Extra credit available on occasion for homeworks.\n"
        }
    ]
}