{
    "prof_info": [
        {
            "prof_name": "Rym Bettaieb",
            "prof_id": 5570,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Arabic II",
            "review_date": "May 04, 2010",
            "review_content": "\nProfessor Bettaieb is a wonderful teacher. She seems to really understand the difficulty students' experience with learning the Arabic language with all of its complex grammatical structures and intense workload. She provided great context for all of the chapters, sharing more specific information and materials with us than were in Al-Kitaab. Sometimes this seemed like an overload of work, until I realized that she was only providing this extra information to help us understand, not to overwhelm us. Her homework corrections are constructive, and she makes a great effort to be available during office hours or at separate appointments if students need to discuss something.\nThe written assignments were generally clear and helpful, but Professor Bettaieb and the MEALAC dept in general, it seems, need to work on their video selection. Greater efforts could be made to ensure that high-quality videos and audio clips find their way to the listening exams. Many times, the stress of taking an exam was compounded by the first few seconds of trying to make out Arabic through the garbled, low-quality videos we watched. Though it becomes easier to understand low-quality audio as the video progresses, on an exam where the video is played a limited number of times it would be very helpful to know from the start that the audio is clear. \nWorkload:\nIt will take the most work of any of your classes, hands down, but you learn to deal with it. Expect anywhere between 30 minutes to several hours of homework a night, with writing assignments that may require minimal external research and reading assignments that definitely require a dictionary to fully comprehend. It's probably great preparation for Arabic III, which I'm told completely takes over your life.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "May 18, 2009",
            "review_content": "\nAanissa Rym was a phenomenal professor, entirely devoted to facilitating your study of the Arabic language. Her Arabic accent is one of the clearest I have ever heard, which is a true blessing, especially for first semester when it's helpful to have each sound so distinct. This probably has to do with her vast knowledge of languages - I think she speaks 5? She expects you to do a lot of work outside of class, but I think every professor does, as the syllabus is quite rigorous, but it's to be expected in a 5 credit course. She was very clear in explaining grammatical concepts, and when she didn't answer questions, at least in my section, it was usually because the questions didn't make sense in an Arabic framework and were a result of people thinking in English and trying to speak Arabic, which she told us not to do from the beginning. Apart from this, she is a wonderful person. She really cares about her students and wants nothing but success for each one, and only employs strict rules about homework, I'm guessing, because it's tough to grade/keep track of that much paper each night and she doesn't want us to get behind. One of the best parts about her is that she speaks in Arabic almost all of the time, which is perfect for learning to hear the language better and getting down some vocabulary.\nWorkload:\nAssignments each night, range from 20 minutes to an hour or 90 min. Watch out, as some nights are a TON, and some require outside research (not many), but when they do, it's a pain to get stuff together. Oral presentation at the end of each semester, which isn't difficult to pull together at all. Finals are easy.\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "May 11, 2009",
            "review_content": "\nMeh, I agree that Rym exercised a lot of patience, but it seemed as though she was often making a point to SHOW how magnanimous her patience was.  And she most definitely has trouble understanding questions.  She frequently gave the wrong answer to students' questions even though everybody else in the room knew what was being asked.  Awkward.  I don't know if it's because she has trouble understanding American English, or she has trouble hearing, or poor comprehension skills, or what.  \nI disagree that she was clearer than the book.  The book rules.  She did put forth a lot of effort, though.  Sometimes too much effort for ten in the morning.  She was generally nice and a competent teacher.  However, the teacher's individual merits have little bearing on the Arabic experience at Columbia for reasons that I've outlined below:\nUnderstand that if you take any Arabic classes at Columbia you will be dealing with the MEALAC Department, which worships at the altar of Soviet-style central planning.  Your personal administrative and learning needs will be utterly disregarded for the sake of an amorphous student body.  I was moved from one section for which I had already registered to another section, taught by a different teacher, for the sake of keeping an even number of students in every class.  The reasoning was that \"too many\" students in one class makes it difficult for students to get individual attention, so they moved a PTSD sufferer who cannot fall asleep before 2 AM from his 3 PM class with fifteen students to a 10:30 AM class with twelve students.  Did I complain?  No, but I shouldn't have had to because the whole thing was ridiculous.  Both Arabic teachers I had regularly referred to \"The Department\" as the arbiter of their shifting, counterintuitive rules. Isn't that creepy? \nWhen I tried to register for Second Year Arabic last week, they had changed the registration rules so that anyone could register online even though all were \"supposed\" to get the instructor's permission via email before adding the section.  So, being one to follow the rules I asked and was given permission to join a particular section...only to find the class already full when I attempted to register.  I sent a second email to the professor explaining the problem only to be told that I would now have to wait for the Fall and try to get into the class then.  This after the person had already green-lighted me for their class.  Thanks, MEALAC. \nWorkload:\nObnoxious. Homework each and every single day, four days a week.  The homework for this class was the primary contributor to my burnout during the semester.  It's usually short and helpful, but it's sometimes nothing more than (insert synonym for obnoxious) busywork.   One 10 minute oral presentation, the requirements for which were poorly explained.  A final, which wasn't bad.  \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "May 04, 2009",
            "review_content": "\nRym is...interesting. I learned a lot over two semesters, but her method of teaching is quite intimidating. She picks on people a lot, and if you don't know what's going on, she WILL embarrass you. You find yourself learning the language just so you don't become her next target. Sometimes it seems like she picks favorites, but some people are just more prone to messing up. She's funny at times, but her mood swings can get a bit annoying. She's helpful at times, but sometimes she misunderstands questions and answers what she thinks you're asking, which can lead to general confusion. At other times, she is sweet and approachable. She really is very intimidating though, so, if you're looking for someone who's consistently nice and forgiving and approachable, keep looking. If you're looking to learn Arabic, though, she WILL teach you the language, and you WILL become comfortable with the language since she forces everyone to participate. Your grade will accurately reflect your dedication to the class, but the dedication is necessary if you want to learn a language as difficult to Arabic. Go take Spanish or some other Romance language if you're looking looking to fulfill your language requirement with an easy A. \nWorkload:\nnightly homework that can take a long time (a blessing in disguise, because you don't really need to do that much studying on top of the assignments), 6 quizzes (some with listening), no midterm, final\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "May 04, 2009",
            "review_content": "\nAanissa Rym is a wonderful, very gifted teacher, whose patience, kindness, and sense of humor made the class really enjoyable even when the material was quite difficult.  Her enthusiasm and boundless creativity led to a wide variety of classroom activities and great lesson plans, which reinforced the grammar lessons and vocabulary well.  Aanissa Rym always came to class with a very clear idea of what she wanted to accomplish, which meant that we were always busy, got the most out of our time each day, and left with a good idea about what was important from the section we were working on.  She was much clearer than the textbook (which I did not like very much at all), she encouraged - required - everyone to participate frequently, and had very high expectations of all of her students, but  again, has the patience of a saint and was very funny and sweet.  Aanissa Rym is an outstanding teacher - a gem!\nI agree with the previous reviewer, who said that if you're not prepared to participate, you may be embarrassed and put on the spot, and it's also true that you can tell within the first few minutes of a class what her mood is like and how much you'll laugh that day.  But her bad days seemed relatively few and far between, they're bearable, and she's usually back to her old self the next day.  And the awkwardness was definitely more towards the beginning of the year/semester (I had her for both semesters) and lessened as the year went on and we all got to know each other better.\nI think she's wonderful - I'd highly recommend her to anyone.\nWorkload:\na LOT.  For the first semester, it was six quizzes, every other week, and for the second, it was five.  Some listening quizzes that were really hard, and a very demanding final.  Oral presentation as part of final, no midterm.  Expect two-three hours of homework every night, which might not include going over the exercises you don't have to turn in.  She asks students (sometimes at random) to explain some of the concepts at the beginning of class before she fills in the details, so you definitely have to prepare everything and be comfortable with it before class.  It helps a lot when you do, though, and makes life much easier.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "March 19, 2009",
            "review_content": "\nFall 2008 was Rym's first semester at Columbia, but she knows how to teach. She's doing her doctorate at Drew University, so I don't know how long she'll be here. If you're willing to put in two to three hours of homework each night and if you're not afraid of speaking in class, Aanisa Rym will be very nice to you. She constantly encourages participation in class, and she will put you on the spot; if you're unprepared or confused, you'll be very embarassed. There were a lot of awkward moments (Rym can be somewhat moody), but also a lot of laughs. She answers questions clearly and patiently, which is important since you go through the material so quickly. She speaks in Arabic most of the time, but her accent is easy to understand (she's Tunisian). \nThe syllabus follows Alif Baa' and al-Kitaab to a tee. As in all Arabic classes, you have to do a lot of work at home. The quizzes and final are difficult, and you have to work pretty quickly to get them done on time. As part of the final we did a ten-minute oral presentation (which you can do with one other person) in class. She grades pretty easily; as long as you do all the homework and participate in class, you'll probably get in the A range.\nI loved the class. It was a s**t-load of work, but it was all worth it.\nWorkload:\ntwo or three hours of homework each night; biweekly quizzes that require several hours of studying; no midterm; long, hard final\n"
        }
    ]
}