{
    "prof_info": [
        {
            "prof_name": "kathy berenson",
            "prof_id": 3445,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 30, 2009",
            "review_content": "\nThis class was a boring but easy.  Berenson is a nice person and is very clear about what material you need to know, which is very thoughtful of her.  However there is nothing conceptual about this class.  Half of each test is a take home, and the other half is 50 multiple choice questions.  The take homes have questions that are mostly out of the book, but she always has a very specific answer in mind. Sometimes the questions are ambiguous, so start the take homes early so you can ask for clarification.  Also, she does not write her own tests, so sometimes concepts that you haven't covered will pop up on the tests, but she will explain it if you ask her too.  She is a nice person, but ultimately the class was a lot of memorization without being particularly challenging.\nWorkload:\nthe top three scores of 3 tests and a final constitute 95% of your grade, and the rest is your participation in experiments.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "September 25, 2009",
            "review_content": "\nA lovely teacher for psychology. She's very sweet and is willing to help the students. The workload is managable and all classes involve power slides which make it easier to read. Very interesting psychology stuff if you take intro to psych. \nWorkload:\nFour exams and the lowest one is dropped, paper due every exam that counts as 50% of your exam grade. Reading due every week \n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "May 19, 2008",
            "review_content": "\nKathy is really sweet. She is very lenient with her grading. She gives extra credit on every test (best 2 of 3 exams), and a final. They all are short answers and multiple choices, with the exception of the final (all MCs). As a new teacher, she conveys her ideas very well, getting straight to the point. Her lectures slides are post on courseworks, making it very easy to study for exams. What i didn't like was the textbook, which was way overly verbose. Maybe she'll change it next time. \nWorkload:\n3 exams, one is dropped. 1 final. 1 short paper. HWs due every class but only 8 will be collected and 5 of the 8 graded. Reading the textbook was a pain. I recommend getting a review book of some sort to help ease the pain.\n"
        }
    ]
}