{
    "prof_info": [
        {
            "prof_name": "Saskia Hamilton",
            "prof_id": 1790,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Poetry Writing",
            "review_date": "December 26, 2012",
            "review_content": "\nWhat a wonderful, wonderful professor. She cannot be understated. I can honestly say she has been my favorite professor so far. It was a true honor to be in her class. I would suggest her to anyone. I constantly felt the need to impress her and never let her down throughout the semester because she was so kind and knowledgeable. And she loved just BEING there, which was absolutely contagious. She is a wealth of knowledge. She would spout things about meter and poetry and poets that was so compelling. The best part was that she would take each of our poems every week and treat them like a delicate, ornate piece of art. The class was such a treat. I would take it again in a millisecond.\nWorkload:\nNot bad at all. Discussion online about the readings for that week. One poem every other week (although I heard this varies depending on the class). Notes on everyone else's poems to be turned in to the writer and Professor Hamilton.\n"
        },
        {
            "course_name": "Introduction to Poetry Writing",
            "review_date": "May 08, 2011",
            "review_content": "\n♥♥♥ Oh, Saskia Hamilton. You are too nice for your own good.\nNo, really -- she can *always* come up with something nice to say about people's poetry. Luckily, she can also be really insightful about it, otherwise it would get really cloying really fast. I could have done with a little more bluntness, but I have a really thick skin when it comes to criticism of my writing. Once you decide to ignore her kindness and focus on the content of her remarks, she can be a useful critic, and is a delightful person to chat with.\nWorkload:\nPffffft.\n"
        },
        {
            "course_name": "Poetics",
            "review_date": "January 05, 2007",
            "review_content": "\nI didn't necessarily learn any new vocabulary in this course, since I was already quite familiar with the nuances of rhyme and meter, and since it was not writing intensive at all I'm not sure my writing improved either.  But to listen to Prof. Hamilton ramble and rave about her favorite poets definitely gave me a new way of looking at poetry, and an appreciation for Wordsworth, Milton.. and an adoration of Rilke and Clare.  For the midterm, we had to memorize a bit of Paradise Lost - \"to internalize the rhythms.\"  How fabulous is that?  If you need a low-key way to get some poetry into your life, this is it.  The final paper nearly killed me because I put it off so long, but it was an incredible synthesis of an intense semester.  I know that sounds contradictory - this class needn't be a lot of work, but poetry just... wow.\nWorkload:\n1 500-word paper; a midterm with IDs, some short analyses, and a memorization; a 10-12 page final paper on a topic of your choice; she marked attendance so I'm not sure if that was factored into the grade\n"
        },
        {
            "course_name": "Poets and Correspondence",
            "review_date": "December 10, 2006",
            "review_content": "\nProfessor Hamilton is amazing. She's soooooo passionate about poetry and cares so much for her students. I love it when she comes to class asking how we're doing. There always seems to be a line to see her during office hours, because she's always willing to help out with anything and is incredibly supportive of your interests in the topics. \nThis was a senior seminar class, so there's a 25-30 page senior thesis expected by the end, a  annotated bibliography, and a working draft. Also, pairs led one week's discussion. \nWorkload:\nAverage...lots of reading, but it's interesting especially the letters, Senior thesis!!\n"
        },
        {
            "course_name": "Intro. to Poetry Writing",
            "review_date": "July 15, 2006",
            "review_content": "\nProfessor Hamilton is amazing. She is so brilliant and kind and takes a genuine interest in each student's work. She also takes time each semester to meet individually with every student just to chat--about poetry advice or anything else. Her classes are really casual and fun, but we always got stuff done. Definitely take a class with this wonderful professor if you can, regardless of your knowledge of poetry (she also teaches classes that don't involve actually writing poetry, if that's not your thing). \nShe is truly one of the treasures of the Barnard English department.\nWorkload:\nVery reasonable--some recommended but not required reading for each class. Also, every other week each student posts a poem for the rest of the class to read and critique, and every other week a commentary on a piece of published poetry.\n"
        },
        {
            "course_name": "Introduction to Poetry Writing",
            "review_date": "August 03, 2005",
            "review_content": "\nProf. Hamilton gives great feedback, and what's more, you respect her so much for being awesome, talented, and unpretentiously scholarly, that you take her criticisms to heart and put them to practice. You get the sense that she respects you immensely for what you do, and you respect her in turn.  As a previous reviewer said, she is very laid back,  which sometimes makes the class dynamic take over too strongly in terms of discussion: I too wished the contributions had been more equal.  Despite this (and partially because of it) Prof. Hamilton creates an open environment that is perfect for emerging writers. The best thing about Prof. Hamilton's classes is that she wants you to come at poetry as a WRITER and not as an analyst, which is not always the case with workshops at a high-achieving school like ours (I speak from experience).  This is not a contest to see who can make the most references in critiquing someone's poem or writing an essay, but a place to become vulnerable and grow, if you are ready to do that. It is about honest and simple observation and evaluation.  Essays, readings, memorizations, are all geared to help you discover something about yourself as a writer. On a personal note, she is more than willing to be there for students who are having a rough time, with poetry or whatever else. Saskia Hamilton is, in short, incredible. Do not miss your chance to take a class with her, even if you have to apply and reapply like I did: it is worth the effort.\nWorkload:\nPrint out and critique others' poems weekly. Hand in a poem every other week and a concise essay every other week, some readings, attend Barnard poets readings (sounds like a pain but is awesome) with the opportunity to introduce a poet at one of them, memorize a couple poems. Obviously, since these are workshops, participation is crucial.\n"
        },
        {
            "course_name": "Advanced Poetry Writing",
            "review_date": "April 14, 2005",
            "review_content": "\nProf. Hamilton is a great teacher. She is wonderfully encouraging of everyone equally if you speak up in class. I would highly recommend taking her poetry classes. The only thing that I felt was lacking was her control of the class' critiquing dynamic, sometimes I felt as if other students were not giving appropriate amounts of feedback compared to the high standard of others' critique, which is annoying, but inevitable in a workshop environment. I felt that if she had stressed equal participation in this workshop I would have gotten more out of it: she's a very hands-off workshop conductor and that has its good and bad aspects. Overall though, very very good class. Had an absolute blast.\nWorkload:\nlight. short essays, one poem every two weeks. sooo easy.\n"
        },
        {
            "course_name": "Poetry Movements since the 1950s",
            "review_date": "January 02, 2005",
            "review_content": "\nGreat class, great professor.  At first, I found her to be a little TOO supportive, telling everyone that their comments were \"excellent,\" to the point where I didn't know where I stood.  However, this weared off to a certain extent as the class progressed, and Prof. Hamilton really creates a very nurturing environment in which you feel comfortable discussing the texts.  (The reading list, p.s., is fantastic.  You don't have to do all the reading, do what you can, and I find that's enough.)  But perhaps the best thing about Professor Hamilton is her complete control of the material and her passion for the subject, which is infectious.  I can't wait to take Poetics with her.\nWorkload:\nas much reading as you can manage-- she'll assign an entire book but skimming and picking a few favorites is enough... also a very straight-\nforward midterm she prepares you for and two papers that you have to take to the writing fellows... lastly, you have to memorize any two poems you want... workload, in short, is completely manageable and enjoyable too (authors we studied include lowell, her personal favorite, as well as heaney, rich, ginsberg, creeley, duncan, baraka, hejinian, wright, and others)\n"
        },
        {
            "course_name": "Poetry Movements since the 1950s",
            "review_date": "December 29, 2004",
            "review_content": "\nThis woman is my goddess. I absolutely adore her, and even if poetry has no relevance to your major but you have the slightest bit of interest in the subject, take her class. Take one, take thirty. She compares Eliot to Dylan and brings up music on a regular basis--this is a very good thing, not tangental. She is truly the most encouraging professor I have ever had--she never ever makes a student feel ignorant for what they've said but rather repeats it in a way that makes everyone feel brilliant. She seems to be genuinely interested in what the students have to say. Participate in class and show her that you're working hard (go for office hours--she'll help anyone with a paper or a problem) and you're golden.\nWorkload:\nA dozen poets, two papers, a midterm (she spends the class before prepping so there's no way you can get less than an A if you listen)\n"
        },
        {
            "course_name": "Poetry Movements since the 1950s",
            "review_date": "January 09, 2004",
            "review_content": "\nThis is my 3rd class with Prof. Hamilton. I had perviously taken: intro to poetry writing, and poetics. Prof. Hamilton is simply incredible. she is passionate about poetry, and passionate about interests that students bring up. She respects her students. and most importantly instills respect for the material she presents. I would recommend this class or any class with Saskia Hamilton to anyone with even a mild interest in Poetry. The work is not hard, and there isn't a lot of it. It is fairly easy to get a B or an A, as long as you write coherent papers. The class can be frustrating because though you learn facts about poetry and poets and poems the field itself and prof hamilton's approach to poetry is subjective. At times you feel as if you have learned little, but you learn things that are almost more important - how to approach literature and deconstruct it, how to make connections within works and between authors. She's exteremly approachable. And if I could I would take more classes with her - unfortunately thus far I can only take one more with her: advanced poetry writing. take this class and don't be confused by her quiet and humble nature she's brilliant.\n"
        },
        {
            "course_name": "Intro. to Poetry Writing",
            "review_date": "November 15, 2003",
            "review_content": "\nProf. Hamilton is an incredibly kind, intelligent, thoughtful teacher.  The critiques (and class discussions) are useful and direct.  The exercises and assignments that she gives truly are helpful in improving your writing, not just busywork.  Finally, she respects her students' work.  It's a wonderful class.  She's a wonderful professor.\nWorkload:\na poem or short response to a poem every week.  a very small amount of memorization.  some poetry exercises.  have to attend Barnard poetry readings and either write an introduction to one or a review of the reading.\n"
        }
    ]
}