{
    "prof_info": [
        {
            "prof_name": "Noah Breuer",
            "prof_id": 3522,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Drawing II",
            "review_date": "December 21, 2010",
            "review_content": "\nNoah's a cool guy. He does assign quite a bit of homework, but if you can pull it off every week you'll find it really helpful (as the previous reviewer wrote, he really encourages working on a larger scale, and that can be intimidating when you have three drawings due in a week). He was pretty flexible with what constituted a \"drawing\" as well. We had students do sculpture, installation pieces, painting, printmaking, etc etc. By the end of the semester the class was encouraged to work on longer, more conceptual projects. Everyone was given a chance to stretch their wings. He also brought a in friend from RISD to do a guest artist lecture. They were super adorbs art bros, and broke into a rap mid presentation. \nHonestly, the crits could be a bit painful and drawn out. Mid semester they began taking up a lot of class time. Encouraging everyone to speak is not always a good thing. I would have preferred a more personal, direct critique from Noah himself, but the exercise got the class talking and thinking about what it means to create a successful piece. And Noah was obviously more pained by the crits than the class (or I guess I) was, and did a decent job of turning class time back into drawing time by the end of the semester. \nThumbs up dude!\nWorkload:\nSee review. \n"
        },
        {
            "course_name": "Drawing II",
            "review_date": "December 11, 2008",
            "review_content": "\nTAKE HIS CLASS.\nHe's a very professional, approachable, and funny guy. Usually I have a problem figuring out what to call each professor (Professor XXX? First name?), but the moment I saw him I could tell he was a \"Noah.\" Also, he's the only teacher at Columbia who will imitate an escargot begging you not to eat it. \nCritiques: \nHonestly, sometimes they can be a drag (because nobody wants sound stupid). Noah will half-prod, half-tease people into talking, and he makes sure that every person gets good advice. He will \"assign\" challenges to people and will urge them to work on their weaknesses for the next assignment. \nI was completely disinterested with drawing backgrounds, but he explained to me what a background would contribute to my drawing and showed me brochures/ postcards of artists who work intensively with background or the structure of a room.   \nHe also has a very good memory and will pick up on any changes/progress you've made in specific areas. Noah definitely tweaked up my awareness of my artwork (composition, lighting, movement, background, and meaning behind the art). My brain still hurts from all the thinking I did while drawing.\nClasswork:\nWe had about four models come in, but if you think that's too few, you can always talk to Noah about it. After midterms, he passed out a survey sheet for our input, and he adjusted the critique times, class work, and homework accordingly. \nEach class, he starts out with a slide show presentation of artists who work with the \"theme of the day.\" One week the theme was \"line,\" so he showed line artwork by famous and \"newly-famous\" artists. He also sends the names of the artists (and sometimes their links) in an email to everyone, so you can look the artist up.  \nFor the rest of the day, we work with the theme. Noah alters the requirements of each drawing we do, adding complications along the way so we can experiment. Then he assigns homework that relates to the theme.\nOther:\nWe went to the zoo once as a class, and that was incredible fun (especially since the Visual Arts Dept. paid for our tickets). He also gives us two breaks (10-15) minutes and one lunch break (45-60) minutes, which is reasonable, if a little too much. He appreciates punctuality, but he won't harass you for being late. What else... He's a recent Columbia MFA graduate, so he's up to his neck in information about galleries and new-and-rising artists. He begs us to go to exhibitions and sends us the links to them, too.\nI think above all, you could see how into art Noah is, and it's contagious. Too bad I'm not an art major.\nWorkload:\nThis is my second time taking Drawing II, and he definitely gave more work than my previous teacher. Sometimes we were assigned three drawings (variation of the same topic) and sometimes one drawing per week. He also encourages us to draw on BIG pieces of paper.\nHe gave us the final assignment four weeks before it was due and told us that he expected a lot for the final presentation/ artwork. BUT, I think he pushed us just enough to prod us into taking the course seriously. I barely got any sleep every Thursday (his class was on Friday), but it was worth seeing my progress.\n"
        }
    ]
}