{
    "prof_info": [
        {
            "prof_name": "Hilary Callahan",
            "prof_id": 2999,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intro Lab to Organismal and Evolutionary Biology",
            "review_date": "December 05, 2011",
            "review_content": "\nProfessor Callahan is enthusiastic about Biology and she honestly tries to be as clear as she possibly can. However, it is hard to disengage the subject matter from the personal anecdotes that she is used to making during lecture. I found some of them useless and annoying at times, but the other half of the time, I thought her stories were inspirational. As a person who loves Biology, it was refreshing to have a professor with the same level of interest. If you talk to her during office hours, she will be very helpful and welcoming. I believe people don't like her in class because its 9 am and they are usually too grumpy and sleepy to even give her a chance. At another time of day, I bet most people would find her funny and likable. \nWorkload:\n2 midterms and a final.\nappropriately curved.\nWeekly quizzes for extra credit!\n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "March 25, 2009",
            "review_content": "\nThis woman is unbelievable. Really, it's remarkable how she can politicize an intro biology course. And you'll still walk away knowing nothing. She talks and talks and talks but I can't even explain what she's talking about. She strays from the subject matter very, very frequently. I really couldn't tell you what the objectives of this course really is. She finds ways to fill time with her words, but they don't ever apply to the subject matter. If you love Al Gore, this is the class for you. \n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "April 19, 2007",
            "review_content": "\nProfessor Calahan is probably the worst lecturer I've ever had. Sure, she makes the class amusing at times with her quirks, but after a while, her big \"theatrical voice\" gets really under your skin. Also, she uses the class like a pulpit, preaching how bitter she is about Al Gore \"losing the election against Bush.\" It's a 50 minute lecture class three times a week, and she uses up I'd say about 40 minutes of each one talking about nonsense and her graduate work in Wisconsin. She tries to make the class funny, but it's a lame attempt. She also does not explain the material well at all, and she confuses the students even more when she tries to answer questions. \n"
        },
        {
            "course_name": "Contemporary Issues in Biology (Lecture)",
            "review_date": "April 19, 2007",
            "review_content": "\nProfessor Calahan is probably the worst lecturer I've ever had. Sure, she makes the class amusing at times with her quirks, but after a while, her big \"theatrical voice\" gets really under your skin. Also, she uses the class like a pulpit, preaching how bitter she is about Al Gore \"losing the election against Bush.\" It's a 50 minute lecture class three times a week, and she uses up I'd say about 40 minutes of each one talking about nonsense and her graduate work in Wisconsin. She tries to make the class funny, but it's a lame attempt. She also does not explain the material well at all, and she confuses the students even more when she tries to answer questions. \n"
        }
    ]
}