{
    "prof_info": [
        {
            "prof_name": "Barbara Morris",
            "prof_id": 12699,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "First Year English: The Americas",
            "review_date": "December 08, 2016",
            "review_content": "\nThis class was really interesting because of my interests in Latin American culture and American and Latin American literature. I think this course would appeal to anyone with interests in these fields and related fields, or anyone who simply is not interested in the legacy of the Mediterranean...This course was something I could relate to and apply to in my daily life.\nTo be honest I barely did any of the reading. Just make sure you read what you are interested in because you do have to write a few papers, and you'll need something to write about. Consider doing the presentation on what you think you will be interested in so you don't have to do as much of the reading, and you will have back ground info for your paper.\nProfessor Morris has been super helpful to me, some others feel otherwise, but I think that if you put in the work and you are open to feedback and proactive, she can be very helpful. Her edits on papers are really helpful and the assignments help you figure out how you can improve your work. \nWorkload:\nOne personal essay, a research essay, a final research essay, and a presentation.\n"
        },
        {
            "course_name": "First Year English: The Americas",
            "review_date": "December 19, 2013",
            "review_content": "\nProfessor Morris is kind of crazy, but the discussions can be interesting, and she is lenient in terms of due dates.  Sometimes it can be frustrating because she is so non-linear, but if you're into that type of teaching style, then this will be a great class for you.  The reading list was very interesting and included a good mix of North, Central, and South American authors.\nYou don't really have to do the reading, but be prepared to bullshit if she calls on you.  She is a relatively easy grader, although she makes it really hard to get an A, and most people who did receive A grades only ended up with A- grades.  I didn't find her commentary on the essays very helpful, but that's just me.\nIf you're interested in American literature (both Americas!), then this is a fun class to take, as it is laid back and not a lot of work.\nWorkload:\nReading Assignments\nFour main papers (two drafts of each)\n\n"
        },
        {
            "course_name": "First Year English: The Americas",
            "review_date": "November 10, 2013",
            "review_content": "\nProfessor Morris is a good professor. She encourages challenging class discussions, the readings are interesting and you'll learn a lot with her and from her. This course is a pretty good foundation if you're thinking of majoring in anything that involves latin-american literature.\nHowever, her clumsy approach to a lot of subjects that she is uncomfortable with - like race, homosexuality, etc - can be off-putting. She tries to fight it, but she's just not the most open-minded person. \nIn my opinion, that just makes the class more interesting, because it's funny to see a Southern woman with Southern opinions in real life. And brownie points for not trying to impose her beliefs on the class.\nWorkload:\nA final research paper, 2 essays, a creative paper. \nVery reasonable reading difficulty, about 10 pages to read for each class.\n"
        }
    ]
}