{
    "prof_info": [
        {
            "prof_name": "Lisa Son",
            "prof_id": 811,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar",
            "review_date": "December 08, 2016",
            "review_content": "\nI had Prof. Son for First Year Seminar (on Memory).  She is an amazing seminar teacher! She is very interesting and kind, and she cares deeply about her students and their personal and academic success.  Her class is interesting and fun, and very relaxed.  I would strongly recommend it!\nWorkload:\nVery, very low.  Weekly readings (short), 2 3pg papers.\n"
        },
        {
            "course_name": "Cognitive Psychology (no lab)",
            "review_date": "May 11, 2015",
            "review_content": "\nLisa Son is one of the worst, if not THE worst, professor I have ever had in my life. Her slides are incomprehensible without notes to accompany it, and even then, it's hard to make heads or tails of what she is saying. She will add in pictures or ideas that come to her mind and put them in slides that follow concepts but are not connected to that concept whatsoever. \nHer tests could not be more convoluted. Not only are her questions worded ridiculously, but there are also multiple right answers to the questions. She will sometimes give everyone credit when she notices that literally everyone in the class got a question wrong. Not only that, she never admits that she is wrong. There were multiple times this semester when she was simply factually incorrect and she refused to acknowledge it. She is so stuck on her high horse that she says things like \"I don't understand why this is a difficult concept\" or \"I think this is really easy.\" Also, she requires you to make graphs of EVERYTHING. We graph things that shouldn't ever be graphed. \nIf you take this class, which I hope to god you do not, always pay attention when she talks about her monkeys. She freaking loves monkeys. \nDO NOT TAKE THIS CLASS. \n\nWorkload:\n3 multiple choice and short answer midterms each worth 30% (she drops the lowest one), 1 cumulative final worth 40%. \n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "September 10, 2013",
            "review_content": "\nThese rankings are misleading - I was hesitant to take this course after reading the reviews below but I ended up doing well in the class with not much struggle at all.  The class exam average was normally around 80%, which she would curve to a B+. There are 3 exams and a final, and she drops your lowest exam. The questions are all very straight forward if you learn the lecture material, and Son was very generous in discarding any exam questions she though were unfair/students did not do well on. One of the few psych classes I got an A, and know many other students who got the same grade.  \nYou do not need to buy the textbook. Just go to all the lectures. \nWorkload:\nNot much, other than studying for the exams and final.  \n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "May 07, 2012",
            "review_content": "\nThis class was pretty much miserable.  I'm a psych major, and generally enjoy the psych classes that I take.  It's one of 2 options that psych majors have to take (either this or Learning) to satisfy the requirement, and from what I've heard, neither is fantastic.  The lectures were boring and the textbook was essentially useless.\nThe lectures were PowerPoints that she posted at the beginning of each class.  We never got through an entire PowerPoint, so notes tend to be all over the place between lectures when she reposts slides at the beginning of the next lecture.  Additionally, her tests are tricky and confusing (the average is about a 70 - she curves it to a B+, though).\nWhen people asked questions, Professor Son either gave confusing answers or didn't seem to know the answer (or argued with the entire class that her answer was right, when it wasn't).  It might just have been that she was having a tough semester, but the material was basically just intro all over again with harder tests.\nWorkload:\n3 exams (she drops the lowest grade), cumulative final.  Moderate reading, but the exams require a lot of studying.\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "April 29, 2012",
            "review_content": "\nNo idea why the reviews of Professor Son are so mixed--feel like it's misleading.  It looks like there was some sort of bad situation with her some years ago, but keep in mind she was probably very young then and she definitely has more experience now.\nI think Lisa is awesome, actually.  She's obviously into the material and she wants us to be into it too.  In response to the review below, seriously, your problem with her is that she wants you to come to class and be engaged in it?  OH NO, HOW AWFUL.  I actually don't agree that she's the sweetest person in the world, I don't think she's incredibly nice compared to other professors, but she's nice enough and I think she can teach fine.  Only critique is that her slides are pretty disorganized.\nOh also, don't even get the book.  I only studied it for one of the exams, and that's actually the exam I did the worst on.\nWorkload:\nthree \"midterms\" all MC with one short answer, cumulative final.  pretty easy but the wording of the MC questions can be confusing--and don't expect her to follow the \"formula\" of multiple choice (e.g. longest answer is probably right, if \"A and C\" is an answer it's probably there for a reason, etc.)!\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "April 26, 2012",
            "review_content": "\nIf you're sitting there, thinking to yourself, \"I need to do my lab requirement somehow, this can't be that terrible\"...wrong. Lisa Son is a very kind woman. She is also one of the worst professors I've ever had. \nAt the risk of sounding overdramatic: scattered lectures during which you must write down anything and everything because random facts you thought were relegated to anecdotal time-wasting will rise from the dead to haunt you on exams. Powerpoint slides that make decent sense with the accompanying lectures, but none without. Posted on CW including slides with nothing but images, bullet points that do not stress main points, and confusing figures. \nProfessor Son had a good grasp of some of the material but not all of it, and could only sometimes respond effectively to questions. Even when an entire lecture hall was muttering in confusion after a particularly poorly-explained study, she simply moved on. In responding to questions she frequently cited results of vague studies, apparently unable to provide actual details about how they were found, by whom, when, etc. Dodged the question when called out on this. Son also missed several lectures for health reasons, and while I'm sympathetic to how difficult I'm sure that was for her, it was very frustrating for students as well.\nThe textbook is very clear, simple, and relatively interesting. No material from it will directly appear on exams. These will instead be composed of ambiguous multiple choice questions, some of which are legitimately impossible to answer (logic errors, the right choice is just not there, etc.). Consolation: after every midterm 25 minutes of class will be devoted to debating questions, correcting answers, and promises of regrading. \nIf you are very patient and not easily frustrated, this class may be fine for you. I never went to OH but I imagine Son was helpful during them--she did genuinely care about her students' success (and accordingly curves generously). If you're can't deal with lectures from someone who doesn't unambiguously and confidently express expert knowledge in her field, skip Son.\nWorkload:\n3 midterms, lowest grade dropped. Cumulative final. Lab will significantly improve your grade if you put in a little time and effort.\n"
        },
        {
            "course_name": "Human Memory and Learning",
            "review_date": "August 21, 2011",
            "review_content": "\nNice woman, interesting material, horrible professor. While she obviously was very knowledgable and enthusiastic about her field, her inability to communicate the information to her students in a coherent manner is almost amusing, considering that she studies human learning. If you are looking for a class to P/D/F just for interest, this is a good one. If you are interested in psychology and want a good learning experience, steer clear of Son. Her tests are confusing and I don't know anyone who didn't walk out of her class with some ambiguity over the material. \nWorkload:\nThree tests and a final. medium reading. \n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "May 10, 2009",
            "review_content": "\nWhile this class will teach you a lot of interesting information about memory/the brain/perception/learning, this professor is mediocre. If you go to class, she's fine. If you don't go to class and attempt to rely on slides, the class is utterly incomprehensible. The slides make absolutely no sense whatsoever, do not relay information, and have a lot of pictures that don't even show up. Sometimes I laugh out loud when I load up a Powerpoint and think, \"Is she fucking serious?\" when I see yet another slide containing combinations of letters or a diagram and NOTHING ELSE. Its like she's trying to punish people who don't come to class, or she just sucks at teaching via powerpoint. If you're a psych major you should probably go to this class. \nThat said, if you're not a psych major and still inclined to go to class and good at taking tests, the class is curved (working out to 14% currently) because the tests are confusing and a lot of people do poorly on them. It is, therefore, very possible to get an A while having a low-B by real-class standards. But the tests really suck. The short answer are graded harshly, multiple-choice questions are worded very poorly, and she makes you use ScanTron to boot. \nDo not take this class unless you have to.\nWorkload:\nThree midterms containing MC and short-answers which are graded unforgivingly, \"reading,\" nothing else.\n"
        },
        {
            "course_name": "Cognitive Psychology (no lab)",
            "review_date": "June 25, 2005",
            "review_content": "\nLisa is a great teacher who is really sweet and cares that her students do well. It's easy to coast by without doing the readings, she posts her lecture notes on courseworks and if you go to most of the classes (even though its hard to wake up for a 9:10) the exams won't be too bad. A lot of the material was covered in intro and just went into slightly more depth, but she also covered a lot of really interesting experiments and sometimes takes a research based view of the subject. I found it interesting (albeit slow at times) and a very easy A. \nWorkload:\n3 midterm exams, 1 final, reading every class that isn't too necessary\n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "June 07, 2005",
            "review_content": "\nI really enjoyed the class--she focused on experiments related to what we were learning. She may not have been the most enthusiastic teacher, but she was organized, friendly, approachable, and interesting. What more can you really ask for without asking for everything? For her tests, know the experiments and you'll be fine. \nWorkload:\n3 midterms and 1 final. Midterms: 40 MC 2 short answer questions. Final: around 50 MC and 5 short answer. You can finish the midterms in 20 minutes. \n"
        },
        {
            "course_name": "Cognitive Psych",
            "review_date": "June 07, 2005",
            "review_content": "\nI really enjoyed the class--she focused on experiments related to what we were learning. She may not have been the most enthusiastic teacher, but she was organized, friendly, approachable, and interesting. What more can you really ask for without asking for everything? For her tests, know the experiments and you'll be fine. \nWorkload:\n3 midterms and 1 final. Midterms: 40 MC 2 short answer questions. Final: around 50 MC and 5 short answer. You can finish the midterms in 20 minutes. \n"
        },
        {
            "course_name": "Human Learning and Memory",
            "review_date": "December 20, 2004",
            "review_content": "\nI found this class to be thorough and interesting.  Professor Son was well organized, and she cares alot about the class.  She's  such a nice and good person, and I highly recommend any class she's teaching.\nWorkload:\n4 tests (which are comprehensive, but have no surprises)\n"
        },
        {
            "course_name": "Human Memory and Learning",
            "review_date": "August 03, 2004",
            "review_content": "\nI saw the reviews of Prof Son from last year, and I cant imagine what that class did to upset her so.  The material is not interesting, nor was she particularly able to make it any more interesting, but she did make it understandable - often by dumbing it down... but now I know a lot more about the subject and some of the important experiments done.  She concentrates a lot on the experiments about memory and learning.  Overall, the class was easy and understandable, and not much work at all.\nWorkload:\nA couple of midterms and a final.  All pretty easy and come from straight from the notes.  Memorize some experiments, which can be annoying if you are bad at memorizing.  But overall really easy.  You dont need to touch the book at all.  It doesnt help at all.  Also, if you need help, go to her in person.  She can be helpful, but not so much over email.\n"
        },
        {
            "course_name": "Human Learning and Memory",
            "review_date": "November 09, 2003",
            "review_content": "\nIn response to all the comments regarding the \"flipping out\" by Son and \"obnoxious\" behavior of the students, I will say that I think Prof Son may be a nice lady, but she is not an able professor. She reminds me of one of those people who always did their work and got good grades, but cannot teach the material at all. Because her command of the class was so poor, students took advantage of the situation and lashed out. Let's face it, people only treat you the way you let them. She has no authoritative presence in the classroom and is about inspiring as a brick wall. Sure, she's nice; that's all. If you want a professor who can teach, do not take this class.\n"
        },
        {
            "course_name": "Human Learning and Memory",
            "review_date": "September 07, 2003",
            "review_content": "\nI was also in that class where she \"flipped\" out at the class.  I have to agree with the last post - although she probably did react a bit extremely, the class was also being very obnoxious and spoiled.  I took intro with professor son and I loved it.  I took the human learning class because she was teaching it.  I have found that her exams are easy if you go to class - if you just listen to what she's saying and take notes, it's pretty easy.  You don't even need to read the book, unless you are unsure of some terms or require further clarification on some things.  The course packet is useless.  Just go on what she says in class and that will be enough to get you an A.  I also really like Professor Son because she tries to incorporate her own experiences into the lectures and attempts to keep the class engaged by doing short experiments with the class or telling anecdotes.  She's also an incredibly sweet person, which is why I felt so bad for her when the brats in our class took advantage of her and lashed out.  Her midterm was not all that hard if you reviewed the notes, and the final was basically the EXACT same thing as her midterm, with an addition of maybe two questions.  Seriously, she practically gave the A away if you did your work.\nWorkload:\nNot all that much.  Reading the book and course packet are really not that necessary.  The midterm is lengthy but not bad if you went to class and studied your notes.  Final was the midterm all over again with the addition of a couple of questions.  Just go to class and take notes and you'll be fine.\n"
        },
        {
            "course_name": "Human Learning and Memory",
            "review_date": "April 23, 2003",
            "review_content": "\nProf. Son is great - I don't understand why there are a few negative reviews here. First off, to address her freakout during one class - it was justified as the class screamed out at her about how unfair she was after she handed back the midterms. People blamed their bad grades to \"blurry slides\" and not having understood what she wanted. However, Prof. Son took 20 minutes of the class  before to explain the instructions so we would be familiar with them when studying for the exam. \nShe uses an overhead though powerpoint would be better but I didn't find that as anying as others did. Also she has many fascinating stories to tell and you can see how interested and knowledgable she is in the topic. I would definetely recommend this class.  \nWorkload:\nI didn't take the lab so there was only a midterm (which was fine if you studied hard) and a final (haven't had it yet).  and I basically - ok - never - read the articles as she expains the ones you need to know in class. The book is kind of pointless too - very dense -- only read what you need reinforcement on from lecture material when studying for the test. Otherwise useless. \n"
        },
        {
            "course_name": "Human Learning and Memory",
            "review_date": "April 23, 2003",
            "review_content": "\nIn response to the last person who wrote, I am in the Human Learning class as well.  It is true that more people did terribly on the midterm than did well.  It is also true that Professor Son said some nasty things and yelled at us all.  However, I have to say that I have never experienced a college class filled with more whiny obnoxious students in my life.  The woman practically spells out for you what you need to know.  She gives several review sheets, is painfully slow in class to make sure that everyone understands and is endlessly patient with everyone's cell phone going off every five minutes, people asking stupid ludicrous questions, and just basically acting like they're five and have never taken a college class before.  Professor Son is a really nice lady who got stuck with a really terrible classroom full of prissy students.  If you write down her slides and half listen and sort of study exactly what she tells you then you will do FINE.  No problems.\nWorkload:\nThe lab is a bitch--i have never done so much stupid work in my life that took so much time to do.  But the class is easy.  A midterm, final, a coursepack that NO ONE should even buy, and a text book that just reinforces what she says in class.  No biggie.\n"
        },
        {
            "course_name": "Human Learning and Memory",
            "review_date": "April 07, 2003",
            "review_content": "\nAvoid this class at all costs. Lisa Son is the worst professor I've ever had. I've had more inspiring high school teachers than her. Her midterm is ridiculous (more students got D's and F's, after the curve, than As). Students got upset and attacked her. She retaliated next class by spending the entire 75 minutes berating the class, comparing us to primates, even saying some of us have brain damage. She sucks. Avoid her at all costs.\nWorkload:\nmidterm/final (+lab work)...beware, she's an awful grader\n"
        },
        {
            "course_name": "Human Memory and Learning",
            "review_date": "October 19, 2002",
            "review_content": "\n\"Quiz\" = midterm--do not be fooled. If I had it to do over again I would have taken the lab with the lecture. As a non-psych major I didn't need it, but it would have made a great deal of difference. I found her to be knowledgeable and interested in the subject, but also very hard to talk to and reason with. \nWorkload:\n3 MIDTERMS and a final. Exams are very heavy on detail- plese keep this in mind. Doable, but boring without th lab.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 22, 2002",
            "review_content": "\nI took Professor Son's Intro to Psych class my first semester here, and, three semesters later, I still remember most of what she taught me. True, her classes were easy -- you weren't really tested on too much outside of what she went over in class -- but she presented the material in a well-organized manner, using overhead slides and demonstrations, rather than a straight repetition of facts. She was always very pleasant and cheerful and usually available for help any time, for as long as you needed her. Her class was such a great way to start off my college career, and really furthered my interest in psychology -- in which I had no educational background previously.\nWorkload:\n2 midterms, one final (not cumulative); 10-pg research paper on a topic of your choice; optional extra credit paper; participation in 4-5 professor/student lab experiments outside of class\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 14, 2001",
            "review_content": "\nI would like to know just who allowed this woman to teach a college-level course. Lectures are reminiscent of middle school: she simplifies and generalizes the material to an extreme. For example, she gave us a questionaire in order to demonstrate the disparity between male and female attitudes with regards to child-rearing, etc. When either the women or the men in the class did not produce the expected response to certain questions, she would say, \"OK. well, USUALLY women respond this way and men respond that way...\" It seemed that she would have preferred that we conformed to the gender norms because it would have been easier for her to explain the stuff, rather than recognizing the value in examining deviations from those norms. Also, she seems entirely unable to come up with more than one example for a given principle, such that after she's beaten the analogy into your head, it's difficult to explain the material in your own terms. But she doesn't expect that from you anyways - she'll beg you to limit your answers on exams to about 3 sentences. Just include the example she gave in class, or the exact wording from the text book, and you'll get an almost effortless A. To her credit, Prof.Son is energetic, has a very sweet demeanor, and will let you write an extra credit research paper to boost your grade (not that you'll need to). But, all things considered, this course is not worth it, unless you need to raise your GPA in a hurry, or you prefer diluted, stereotyped, and bland explanations of otherwise interesting concepts.\nWorkload:\n2 midterms, 1 in-class final. very little preparation required. optional research paper. lectures mirror the textbook almost exactly - either read or go to class. also, 4 hours of participation in psych studies - get them done early.\n"
        }
    ]
}