{
    "prof_info": [
        {
            "prof_name": "Jason Polisar",
            "prof_id": 10029,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry Recitation",
            "review_date": "April 30, 2010",
            "review_content": "\nIt's funny because the person below said almost exactly the same things I'm going to, but I'll go ahead and say them anyway (this is the review I put on his evaluation).\nI have to preface this by saying that I think it's totally inappropriate to swear in a course evaluation. However, when it comes to Jason, I am forced to make an exception, because there is just no better description than \"asshole.\" Jason is the rudest, most condescending person I have ever encountered in my life. After the second exam, he stood up in class and mentioned that some people hadn't finished the test. Then he told us that he would have finished in 20 minutes. How or why that is appropriate is beyond me, and it was not an isolated incident. Jason would frequently tell us, in response to questions, that he doesn't bother even opening our textbook, saying that he didn't \"need\" to read the book because he could just think of the topic and make up questions for his quizzes. He said all of this in a tone that seemed to anticipate the class giving him a standing ovation for his great accomplishment, when in reality I would expect no less of any TA for any other class. He has clearly let the \"power\" associated with being a TA go to his head, which is too bad because I think he could potentially do a decent job if he could lose the attitude. When we went over topics in recitation, I thought he did a good job explaining, but he did so in a way that made us feel stupid for asking, or like we were inconveniencing him. Jason was also not above making fun of students in his sections. I think he is in need of an extreme reality check: being a chemistry grad student does not make you some \"ruthless deity,\" and it certainly doesn't give you the right to treat your students (some of whom are actually older than you) as your inferiors. I came to loathe chemistry this semester, and it was mostly due to Jason. \nI think that basically sums it up, although it must be said that the other TA for the class (Corinne) wasn't any better. The class itself is decent (Beer is a nice guy), but unfortunately I would just not recommend this class unless there are better TAs. A good TA is important for understanding chemistry, and Jason is a mediocre teacher at best and such a horrible person that I'm not even sure he should be allowed to exist. \nWorkload:\n6 quizzes, one dropped. Every time the class did well, Jason would get all angry about it. In fact, I'm pretty sure he accused our class of cheating once because we had a later section and we did better than the earlier section (the difference in the averages was about 7%, by the way). It is also worth noting that when the earlier section did better, Jason made fun of our section and made all these comments about how the Monday class must be smarter. The quizzes are very tough, so study as hard for them as you would for a test. Better advice is to avoid Jason altogether, if you can.\n"
        },
        {
            "course_name": "General Chemistry Recitation",
            "review_date": "April 23, 2010",
            "review_content": "\nI completely agree with the previous reviewer. Frankly, before I took Jason's section I had read that review and brushed it off as some overly dramatic person writing the review. I retract that completely after having taken his section.\nJason is extremely offensive and just generally a bad person; it seems that he almost takes pleasure in his students failures. He refuses to carry a textbook, formula sheet, or anything that might be mildly helpful to students during recitation sections. He never does the homework problems, but he is granted slightly helpful with homework problems if you do ask, which is probably his only redeeming quality. \nI sat in the back during lecture, within earshot of Jason and his co-TA; he is constantly making rude comments and remarking on the Professor's teaching style and knowledge. If you attempt to ask him any question during a test or quiz he'll likely not even attempt to answer your question and brush it off with a \"everything you need is there\" statement and walk away before you can respond. Similarly, I believe that every single time we've taken a test he has remarked while passing it out something to the effect that \"you guys shouldn't worry, this test took me 20 minutes to finish.\" This same kind of comment will come up often, as if he wants you to get on your knees and praise his genius, or validate his statements with look \"oooohs\" and \"aaahhs.\" \nIt does seem as if he's always searching for justification or something in everything that he says, which leads me to slightly doubt his actual knowledge of chemistry. If he doesn't understand a question you ask him or doesn't know how to do a problem, he'll go into a talk about his organic chemist background and how he \"doesn't do this stuff\" or something to that effect then just tell you to read the textbook. \nThough I have encountered bad TAs here before, Jason is by far the worst and I would avoid him at all possible costs. It's not just his teaching that is bad. In fact, his teaching is really not the problem at all, it's his attitude towards the class and his students in general. He acts like he has way more power than he does as a TA, and seems to think that all of his students should worship him as their superior. In short, you should DEFINITELY not take him, or any class he TAs for that matter, if it can be helped.\nWorkload:\n6 quizzes, 1 dropped\ndon't do too well as a class on the quizzes because when the average is too high, he makes all the remaining quizzes exponentially harder\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 22, 2009",
            "review_content": "\nJason is clearly very excited about the power that he associates with being a TA. He was available and held review sessions when the other TA (Matt something) hardly even attended class.\nOther than that, I cannot think of a single positive thing to say about him. He is one of the rudest individuals I have ever met. He got into arguments with multiple students and has some serious aggression issues. He regularly and openly belittled students. For example, he made fun of one student's poor grades in front of a large group of students. \nHis favorite quote is \"memorize it.\" I think that he honestly didn't understand a lot of the concepts and was ashamed of this fact. Whatever the reason, his role as a TA is to explain concepts and not just tell us to memorize things. \nHis lack of chemistry knowledge also made it very difficult for him to lead section. He was, frankly, the worst TA I have ever encountered. Not only did he not have a firm grasp of the material, but he is such an offensive individual that I did not even want to be in the same room as him.\nWorkload:\nQuizzes as assigned by the professor.\n"
        }
    ]
}