{
    "prof_info": [
        {
            "prof_name": "Maria Garibotti",
            "prof_id": 11614,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "July 16, 2012",
            "review_content": "\nI found lectures dry and by-the-book; most of the class ended up skipping them. She covered the material, but I usually got lost - not sure if it was the early time of the class, me, or her. When people asked questions, her answers didn't usually demonstrate understanding of what it was that students were confused about, so answers were generally not helpful (and re-asking often felt redundant, since students gave up trying to clarify at some point).\nThe weekly MyEconLab assignments were incredibly easy, especially since the system gives you so much help and so many chances to get it right. The fact that perfect/near-perfect scores were trivial to get without having completed any reading and without any understanding of the material heeded learning for my lazy ass but they were a nice grade boost.\nI was always woefully underprepared for the tests, but even so I pulled through; I found them consistent, understandable, relatively easy, and pretty well-written. From the grades the class received, others agreed.\nThere are probably better ways to learn the topic, if you're way too lazy like me you should probably go with someone who will push you a little harder. However, I think if I put more effort into readings/attendance/attention I could have learned a lot, she certainly seems knowledgable. \nSecond midterm was only just before the end of classes, but I liked that system because it meant we were tested on basically all of the material non-cumulatively before the cumulative final. I was more evenly prepared for the final than I am in most classes, and had been able to identify all of my most difficult problem areas already on the midterms.\nShe's a nice person - she sliced five days off of her projected grading time for the first midterm when the class reminded her when the pass/d/fail deadline was in order to get scores out before the deadline. I really appreciated that.\nIn short: easy, dry, I found lectures hard to follow and unenjoyable.\nWorkload:\nPretty light, especially for a 4-credit class, easy weekly MyEconLab, consistent midterms (2) and final.\n"
        }
    ]
}