{
    "prof_info": [
        {
            "prof_name": "Rachel Chung",
            "prof_id": 2139,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Middle Eastern and East Asian Texts",
            "review_date": "February 25, 2015",
            "review_content": "\nIf you're ready to take Lit Hum all over again, take Colloquium with Professor Chung. The class is very discussion based, and because you only meet once a week (and only spend one week on each text), you get to dive into the text very quickly. Professor Chung has a few points that she tried to get to for each work, but the discussion is often led by students in the class. Each week began with Professor Chung asking students what they thought of the texts, and the class discussion often continued from these thoughts on one tangent or another for the majority of the course. \nThe amount of reading really varied, with some weeks requiring only 20-40 pages of dense philosophy and others entire novels that you can skim fairly quickly. The amount of work was definitely manageable. For the first eight weeks of the semester Professor Chung required a one page reading response due at the beginning of class, but by the midpoint in the semester she decided that they were \"optional.\" The two papers were also fairly straight-forward. Meet with her a week or two in advance and she'll give you some great guidance in choosing your topics and formulating your arguments, but you can literally wrote on anything you want. \nThe best part of the course by far were Professor Chung's insights. She really knows her stuff, and while she's not a Titan in the field like De Bary or Schirokauer, she actually *teaches*, and everyone in my section seemed to really enjoy the times when she actually spend 20-30 mins giving background or her interpretation. \nCan't speak to everyone's grades, but I participated a fair amount, went to OHs a few times, wrote two fairly good papers and got an A. I'm guessing most people who expected to get an A/A- were successful. A very enjoyable course overall. \nWorkload:\nOne-page weekly response paper (that she discontinued halfway through the semester)\nTwo essays, one 8-10 pages and one 10-12, both due around midterms and finals weeks, respectively\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "January 15, 2015",
            "review_content": "\nProfessor Chung is an amazing professor. She has the ability to make even the most tedious and cerebral readings digestible and insightful. Sometimes class discussion was quiet, but she was good at bringing up different points to think about and discuss.\nIf you can make her office visits definitely go! You can tell she really cares about her students and really takes the time to help you flesh out a paper topic.\n\nWorkload:\nManageable- weekly postings (she stops the postings at around week 9), two papers each that are 25% of the final grade.\nUnlike other Major Texts classes the oral exam is optional.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 10, 2012",
            "review_content": "\nFor someone who had only a passing knowledge of East Asian culture, Professor Chung was the perfect way to be introduced to it. Every week we read a classic piece of literature from East Asia that at least for me was brand new, but Professor Chung situated each work in the historical context within which it was created and how it influenced subsequent generations. She did a fantastic job leading discussion despite how quiet our class was, which obviously made it very difficult. Her honesty when advising us on our possible essay topics was much appreciated. \nIf you are looking for a class to fulfill your Global Core requirement, I absolutely recommend this one.\nWorkload:\n50% Participation and Half Page Weekly Response Postings\n2 Papers, One 6 Page, One 10 Page\nOptional Oral Exam\n"
        },
        {
            "course_name": "Music of East Asia",
            "review_date": "February 09, 2008",
            "review_content": "\nProfessor Chung is the best professor I have ever had.  THE BEST.  If you have a chance to take her class, take it.  The things that you learn from her class will continue to impact your life long after you graduate.  At least they have, for me.  Some people say that she assigns a lot of work, but I enjoyed her class so much that most of the work didn't feel like work at all.  Trust me, even if you're not interested in the topic just take any class she's teaching.    \n"
        },
        {
            "course_name": "East Asian Texts",
            "review_date": "November 12, 2007",
            "review_content": "\nI am obsessed with Rachel Chung.  She is by far the best professor I have had yet at Columbia, and I'm a senior.  She is passionate, caring, highly intelligent, engaging...you name it.  She is so interesting that it is easy to pay attention in class and easy to keep up with the reading.  If you get the chance, take her class!!!  Any class with her is the kind of experience we all come to Columbia to have.\nWorkload:\nNot stressful.  Steady reading, 2 papers and an a final where you basically go and talk to her, which is actually really fun.  Rachel Chung makes the homework for this class a pleasure.\n"
        },
        {
            "course_name": "Music of East Asia",
            "review_date": "July 22, 2006",
            "review_content": "\nRachel is a real character and someone I would definitely call \"easily approachable.\" She's usualy very bubbly and likes to turn lectures into more of an informal seminar. She spends about 80% of class time sitting against a table riffing on the topic at hand and the rest of the time either demonstrating concepts on the piano or singing (yes, singing!) \nShe likes to engage the class in discussion quite a bit and I found that her questions were really well formed and easy to answer so long as one actually read the material. Although no knowledge of music thoery is required for this class, she does nonetheless explain various modes and compositional aspects of the musics covered. If you get lost during these sections, fear not.\nThis course is not so much a course in East Asian music as it is a general East Asian Hum class with a slant toward music. Confucianism, Neo-Confucianism, Buddhism, Daoism, Shintoism, Animism -- all these subjects are covered (and much, much more) from their spiritual conceptualization down to their distinct musical expression. Various forms of East Asian theater are also covered such as Peking Opera, Kabuki, etc. If you have a real interest in East Asian culture, this class will blow you away. If you want something really focused on music, this class may be too broad for you.\nWorkload:\nReading is fairly light but steady and ranges from contemporary academic essays to ancient texts and even poems. There is no textbook for the course but rather a selection of downloadable texts available through courseworks.\nThere was a take-home midterm based on a short list of questions. Dr. Chung places a tremendous emphasis on concise and clear writing so the page-count wasn't long but the expectations were high. Quality, not quantity. The questions were pretty conceptual in nature and some students felt that Dr. Chung was a little too loose during her lectures and then a little too focused in terms of what she expected from the midterm. Even though I did very well on the midterm, I can see how some could feel this way.\nA 4-5 page concert report is also required. With all the music events happening in and around NYC, it wasn't hard for me to find a show to cover.\nFinally there was an oral final where students were required to sit in Dr. Chung's office one at a time along with her TA and present an argument based on one of a list of pre-prepared topics. At first I was totally scared by this concept but the range of the topics she chose was broad enough for a good conversation to develop quite naturally and I left the final feeling as if I had just had more of a philosophical chat with a good friend.\nThis class is more difficult than the default Music Hum course and I would recommend it only to people who actually want the challenge of a course on East Asian culture/music that is based more on conceptual thinking and non-Western ideologies. This class is not an easy A and students who don't really get involved and attend class did not do very well in it during the semester I took it. I will also say that this course had an absolutely profound influence on me not only as student but as a person in general and I am really glad that I took it.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "April 15, 2006",
            "review_content": "\nAn incredibly intellectual course, and the perfect instructor for it. Rachel is one of those professors that truly engages herself and her students in the texts. She is genuinely enthusiastic about the topic, and she makes the 110 minute class rather enjoyable. While the texts are incredibly complex, don't stress about it--It's Daoism etc., the essence of which is that you can never fully understand the content. \nWorkload:\n1 Page postings every week which stopped about 3/4 into the class. 2 papers, and an oral one on one final which was surprisingly easy to get through. I had a revelation during my oral which left me absolutely in love with the course and the professor.\n"
        },
        {
            "course_name": "Music of East Asia",
            "review_date": "September 14, 2005",
            "review_content": "\nAmazing professor!  Great class, great insights!  At first, it's a little hard-- a lot of reading and she doesn't hand out A's on the fly, but def. worth taking.  You'll learn a lot and she really does care about you.  On top, she's a brilliant musician...an artist...a very passionate person and teacher.  A must.  \n\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 24, 2005",
            "review_content": "\nProf. Chung puts great effort into the class. She makes herself readily available to talk on the phone for help outside of class and tries to explain difficult concepts of the  often unfamiliar east asian cultures. Shes very sweet but a little intimidating because she isnt very, sall we say,  down-to-earth and approachable.  But if you ask her for help, she'll always be willing. She tries very hard to strike up discussion in class, which sometimes doesnt steer the class in the right direction. Theres too much reading material to cover in class and the text is HORRIBLY not concise and easy (or enjoyable) to read. The in-class presentations kinda sucked because some students didnt present well and so you wind uo sitting there for an hour listening to not the most important info. The paper was fun to write since it was a tpic you choose yoruself. Ther class is great (but you gotta work hard) if you are takign MAJOR CULTURES or for your own knowledge of fascinating East Asian philosophy , culture, and history. Great class overall--highly recommended teacher.\nWorkload:\nTONS OF READING, POSTINGS for every class (annoying and a waste of time but makes you do the reading)...she stopped the postings after the midterm to give us time to write our 8-10 PAGE PAPER (on a topic you choose) which was really nice. REALLY HARD MIDTERM (cumulative), ORAL FINAL (you dicuss a broad theme of the class one on one with her).  If you work hard, you'll do well.  Also you present once in class on one of the day's readings. \n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor Chung is amazing. I enjoyed her class a lot because she is an interesting lecturer with a wonderful knowledge of Asian history. She makes students work hard and asks many insightful questions. The best part of the class were her lectures and class discussions. She is passionate about the material though she is very challenging. Though there is a ton of reading, having her as a teacher and learning about the material are worth it!   \nWorkload:\ntons of reading every class, midtern, final, and 8 pg essay. \n"
        },
        {
            "course_name": "Asian Music Hum",
            "review_date": "October 12, 2004",
            "review_content": "\nRachel is a darling and a talented musician.  Her knowledge on the subject is also stellar.  The class will involve lots of lectures though and very little music.  Additionally, you will be at a disadvantage without serious knowledge of Asian culture i.e. confucius, tao te ching, i ching etc..  On the flip side, you will learn a ton.  Exam's are excrutiating, make no mistake.  I can't believe I did well in this class because of the amount of stuff I was just unable to memorize - then again, it's how much time you have to read.  Don't take this class to fullfill the req if you reg. too late and couldn't get into Western Music (which I hear is like community college level), take Asian Hum if you can handle it.\nWorkload:\nMassive and foreign.  This class is NOT A MUSIC CLASS.  It is about culture.  You will be bombarded with tons of reading and very little music whatsoever.  Rachel is tough and smart.  This class is what I expect from Columbia.  I hated the class when I had it, and the room was an oven.  When it was done, I learned quite a bit.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 18, 2004",
            "review_content": "\nIf you have not taken Western Music Hum. and have no previous training in music, be careful taking this class. Prof. Chung is a nice, passionate, and engaging woman, but she mostly wants to engage with people who already know what she's talking about. \nAnd another thing, there was an ENORMOUS amount of reading for this class, more than some Lit. classes I have taken, and the connection between the music you hear and the reading is often a little weak. Be prepared to do a lot of outside work and to work hard for your grade. \nWorkload:\nMidterm, Final, 1 paper (5-7pgs) \n"
        }
    ]
}