{
    "prof_info": [
        {
            "prof_name": "Vittoria Di Palma",
            "prof_id": 2390,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "October 31, 2007",
            "review_content": "\nI have to say that at first I was terrified of Professor DiPalma because of the awful reviews she got on culpa.  However, I threw myself at the class and you know what?  I was pleasantly surprised.  True, her lectures are a little boring sometimes, but the info's generally good, to the point, accurate.  As for her exams, she's the easiest art history professor I've had, and I've taken over 10 art history classes!  She not only gives you an image list of 30 or so buildings for the midterm and final, she also gives you the exact images on courseworks.  If you studied that and attended discussion section, you could get an easy A.  As for papers, I'm not even sure I had to write one.  If I did, it was so easy it wasn't memorable.  Trust me, DO NOT BELIEVE THE OTHER CULPAS!!!  I just had her Spring 07, so believe me!!! She's pretty cool.\nWorkload:\nMidterm, Final, with images and list to help you narrow it down, and discussion sections.\n"
        },
        {
            "course_name": "20th Century Architecture and Urban Planning",
            "review_date": "July 29, 2007",
            "review_content": "\nThe lectures were absolutely dry.  It was a rare moment when I felt that I could keep my attention focused.  Though I feel that I learned alot, it seems that most of it was not because I went to the lectures.  The discussion sections were really helpful in reinforcing the material (which, when discussed in a different manner, I found interesting).  The workload, however was reasonable, but the slide tests (both midterm and final) covered an EXORBITANT amount of material - all to be memorized and spit back.\nWorkload:\nMidterm, Paper, Final\n"
        },
        {
            "course_name": "20th Century Architecture and Urban Planning",
            "review_date": "May 30, 2007",
            "review_content": "\nShe is very sweet and her lectures are very informative. She's always available after class. And by the last day I was surprised to know that she learned a lot of students' names! I don't know what I spent more of the class doing, listening to her lecture of trying to see through the dark whether or not she had on a wedding ring.\nWorkload:\nTerm paper, roughly 6-8 pages, very easy. Look at a few buildings in Manhattan and talk about them. Very little research. Midterm, easy. Final, much harder. But study and you will know your stuff. Discussion sections with reading, they say it's mandatory but you can get away with not doing it. \n"
        },
        {
            "course_name": "European Architecture: 1750-1890",
            "review_date": "August 19, 2006",
            "review_content": "\nProfessor Di Palma is almost totally disconnected from her class. She wandered through 18th century slides faster than one has time to write any notes. She's obviously very knowledgable in her subject area (but she has no clue how to get this information across to the class). I found myself straining to stay awake as her delivery was so monotone and uneventful. Here's my main gripe with Vittoria: her tests are completely midguided and her slide IDs are absurd. For the final she didn't even give us a list of images to study (just a list of buildings). Then, when the final came, she used slides she had never showed us from her vacation photos. And the photos were't even very good. You'd see an important building half obscured by a random tourist or an oblique angle of a wall (completly out of context with the building). I suggest staying away from this course.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 22, 2005",
            "review_content": "\nShe is certainly a nice woman but unfortunately not a great teacher. She really tried to lead the discussion but sometimes it just wasn't working. I literally learned nothing from those class discussions - all I know now is from the readings that were rather lengthy and boring at times. \nIn order to do good in class you have to do the readings cause she likes when you bring up the right points and it also gets you noticed since class participation is 20% of the grade.\nTwo papers require a visit to the Met and Moma and have to be 5-7 pages. Not bad but again it is hard to understand exactly what she wants to see in those papers.\nAnother thing is that you really can't miss a class because you never know which works she will discuss and which ones she will drop.\nIf you can't get anyone else go with Di Palma but if you have a choice do yourself a favor and avoid her.\nWorkload:\n2 papers, a couple of ungraded assignments (she asked us to draw the layout of St.John's Cathedral on 112th street without being inside once and there was a one-pager due on the second day of the class), midterm and final - slide ids, slide comparisons and essays. Pretty intense exams since there is a lot of writing involved and  the time is limited but if you attended all the classes you should do fine. \n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "September 11, 2005",
            "review_content": "\nOne of the worst professors I have had at Columbia. I think that if you have never taken an art history course in your life and want a broad panoramic view of twentieth century architecture - di palma may be your woman.\nHowever, as an art history major, I found her classes incredibly boring and insipid. We would look at great architecture and just gloss over anecdotes and the simplest, most basic aspects on aesthetics. Literally her comments on Liebskind were that his \"architecture evokes sensations\" ...\nHillary Ballon's intro to architecture class - while far broader in scope - was a far better class in teaching me about modern architecture. considering di palma spent a semester on it, and ballon little less than a month, it really should tell you everything about what a dull teacher di palma is\navoid her class. \n\n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "August 29, 2005",
            "review_content": "\nfascinating class. she is a great lecturer, really interesting and every class you walk away with your head spinning with new information. I am new to architecture and I was not lost at all, but you need to arrive on time and come to every class-- b/c she starts even a min or two early and lectures till the very end, and you will miss a great deal of information if you arrive late/not at all. the exams are really where i bombed- remember it is an art history course, so there will be A LOT of memorization. be prepared for that. recommended.\nWorkload:\nnormal. Final paper. Midterm and Final\n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "July 22, 2005",
            "review_content": "\nI'm sorry but I disagree with the previous reviews. The final was more difficult than the mid-term, but the mid-term was excessively easy. The paper was easy as well, it was only 5 pages long. \nIf you want to take a class about the world trade center and the sears tower, maybe you should start watching the discovery channel or something. My only fault with di palma is that I never felt she was providing the class with her own critical perspective. The architecture material did far outweigh the city planning, but interesting city planning projects were discussed. You will be fine with this class if you attend lectures and review readings to study for the final. I think it was a worthwhile course.\nWorkload:\nLess than average. \n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "June 06, 2005",
            "review_content": "\nProf. Di Palma's midterm and final were ridiculously hard.  She used the most obscure slides... absolutely ridiculous.. and I agree... this class was not graded on a curve.  The material was interesting, however the frustration of her teaching/ testing/ grading style was not worth it.\n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "May 18, 2005",
            "review_content": "\nThe professor is hit or miss lecture-wise- some can be really fascinating, and others a bit of a bore. for the most part, i found you could either do the readings OR go to class- they were redundant otherwise. My main complaint is that her midterm and final were ridiculously hard and werent even graded on a curve, as far as i can tell. and by ridiculously hard, i mean....there were people throwing their hands in the air each time the next slide came up. the final was 10 ids, 6 comparisons, and two short essays. three hours of hell. i made it out alive, but it was pretty gray.\nWorkload:\nmidterm, hard. final, harder. paper. FUN. \n"
        },
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "May 09, 2005",
            "review_content": "\nOh my god, what a waste. First of all, what class bills itself as being about 20th Century architecture but doesn't even touch upon the Empire State Building, Chrysler Building, World Trade Center, Sears Tower...? Lectures were long and boring, just slide after slide after slide. Both textbooks and lectures were the typical arty pretentious stuff that at first sounds really profound but then you realize there's little substance behind it. Basically you stare at buildings you've never heard of before and listen to how great they are. You won't learn much, and what you do learn will not be very interesting. You'll waste a lot of time reading books that say nothing of meaning. Also, the \"urban planning\" part? Practically nonexistant. Skip this class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 17, 2005",
            "review_content": "\nIt's obvious that she is very knowledgeable, but she does not do a good job of leading discussions. Rather, each lecture is just a series of slides and for each slide she just simply lets the class stare and grope for something to say. While this got slightly better with time as we all figured some of the obvious stuff to comment about, most discussion contributions are long rambly non-coherent shot-in-the-dark-type comments made by students who obviously have had previous exposure to the visuals arts. For the rest of us, it's mostly a lot of guesswork until dipalma finally makes her point(s). I don't feel that she ever really gave us the tools to analyze art in a less fuzzy way. Which made it absolutely frustrating where you can write the longest responses to an identification of a slide on her tests but it may still not be good enough. Overall with grades, I was not satisfied, given the workload and amount of material we had to know, coupled with the fact that she never really covers everything we need to know in class for the exam. There will always be that one point or two that you will have missed. so yea, like the previous reviewer, don't expect an easy A, unless you participate your ass off AND hit every nail. \nWorkload:\na shiteload of reading at times, a lot is irrelevant (like historical stuff), be prepared to memorize a lot of images for midterm and final. \n"
        },
        {
            "course_name": "Wasteland:  Environment, Technology, and the Modern Landscape",
            "review_date": "January 02, 2005",
            "review_content": "\nOverall a bad class. After the first week, half of the original 12 people had dropped the class; I would have if I didn't need it to fulfill a requirement for graduation. Of the six remaining people in the class, no one knew anything about each other or the direction of the class. She never took the time to introduce each student, or even find out our majors and other information that might contribute to the meaningfulness of class discussions, especially in such a small group. She does not call on anybody or pose provocative questions to catylize discussion. Instead class was marked by long periods of silence where she waited for people to contribute, which rarely happened. She seems knowledgeable, though in what I am not sure. On rare occations when we looked at images, she seemed very competant about breaking them down for discussion. All readings were from a small reader, after reading which she required a page single spaced response for each class. A guiding question might not have been too much to ask to attempt to have the class thinking on similar terms which might have created at atmosphere for discussion. She is devoted, and wants to meet with students, though when in her office, she doesn't have much to say. Overall, di Palma seems very smart and willing, but unable to commendeer a engaging class. \nWorkload:\nWeekly papers, graded harshly for some reason, a final presentation,and a final paper, all requiring a fairly significant amount of work, especially considering her resistance to giving \"A\"s.\n"
        }
    ]
}