{
    "prof_info": [
        {
            "prof_name": "Christian Rojas",
            "prof_id": 1068,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 16, 2016",
            "review_content": "\nI can't say enough good things about Professor Rojas!!! I think after teaching the course for so many years, he has it down to a science (no pun intended). He posts an assignment on courseworks each day (so five per week) and holds office hours every single day. The assignments are never due, but if you keep up with them you're good to go for the exams. During the second half of the semester I generally did the assignments every weekend or every other weekend rather than after each class, but it still worked out well. Because Professor Rojas is such a good lecturer that I never felt lost or like I had to teach the concepts to myself, which seems to be pretty rare for intro science classes. I simply showed up to class, did the assignments as much as possible, and learned organic chemistry! I never felt like I was blindly memorizing things or teaching myself from a textbook.\nA tip for the last part of the semester - you should keep a running list of new reactions that you learn and organize them by product. Then, memorize the mechanism and the reagents. Having a consistent study group throughout the semester is also helpful! \nApart from that, Professor Rojas is a really funny guy overall. He reads poetry during class and seems to have a good sense of the pulse of the class (and Barnard in general). If you have to take organic chemistry, you should hands down take it with Rojas. \nWorkload:\n3 midterms and a final. Although it's technically cumulative, the final is heavily focused on material from the last quarter of the class.\n"
        },
        {
            "course_name": "Organic Chemistry II BC3231",
            "review_date": "December 21, 2014",
            "review_content": "\nProfessor Rojas is, hands down, the best teacher I have ever had in my life.  I had him for both orgo 1 and orgo 2, and I feel so blessed to have had him for a whole year.  First things first, he knew every single person’s name in a class of around 120 by studying the pictures on the courseworks roster.  He also holds office hours every single day, where you just go through homework questions and he teaches you helpful tips for solving the problems and for studying, so I would DEFINITELY recommend going at least once a week, more around exam times.  There is no textbook for this class, because Rojas writes all of his own problem sets and tests.  The way he writes the test is that if you go through all the notes from lecture and all the assignments, you don’t need to study anything additional, which proved to be true!  Before tests I just made review sheets for each reaction and redid all the assignments and I was fine! I got an A in orgo 1 and haven’t gotten my grade yet for orgo 2 but I did well on the tests and I feel good about the final.  \nPlus, he is SO funny and tells lots of jokes, and also reads poetry and sings on a fairly regular basis, (he wore a turkey-hat on the class before thanksgiving).  \nHe started this video of the week thing during orgo 2, and he basically had videos made of him doing practice problems with the reactions we had just learned.  These were VERY helpful because sometimes when you go over so many reactions in lecture, it can be hard to understand how to do the problems.  \nOverall this class is AMAZING!!!\nWorkload:\nHe posts assignments every night that are anywhere from 2-8 problems, but they aren't graded or collected, so you can do them at your own pace.  He also posts the solutions the next night, so it isnt a big deal if you can't figure out how to do the problems.  Other than that just going over notes and assignments is what you do to study for the test.  Plus the videos.\nDon't be fooled, this class is very challenging and you will work incredibly hard, but Rojas manages to make it SO SO manageable and wants everyone to succeed.\n"
        },
        {
            "course_name": "Organic Chemistry II BC3231",
            "review_date": "December 21, 2014",
            "review_content": "\nProfessor Rojas is, hands down, the best teacher I have ever had in my life.  I had him for both orgo 1 and orgo 2, and I feel so blessed to have had him for a whole year.  First things first, he knew every single person’s name in a class of around 120 by studying the pictures on the courseworks roster.  He also holds office hours every single day, where you just go through homework questions and he teaches you helpful tips for solving the problems and for studying, so I would DEFINITELY recommend going at least once a week, more around exam times.  There is no textbook for this class, because Rojas writes all of his own problem sets and tests.  The way he writes the test is that if you go through all the notes from lecture and all the assignments, you don’t need to study anything additional, which proved to be true!  Before tests I just made review sheets for each reaction and redid all the assignments and I was fine! I got an A in orgo 1 and haven’t gotten my grade yet for orgo 2 but I did well on the tests and I feel good about the final.  \nPlus, he is SO funny and tells lots of jokes, and also reads poetry and sings on a fairly regular basis, (he wore a turkey-hat on the class before thanksgiving).  \nHe started this video of the week thing during orgo 2, and he basically had videos made of him doing practice problems with the reactions we had just learned.  These were VERY helpful because sometimes when you go over so many reactions in lecture, it can be hard to understand how to do the problems.  \nOverall this class is AMAZING!!!\nWorkload:\nHe posts assignments every night that are anywhere from 2-8 problems, but they aren't graded or collected, so you can do them at your own pace.  He also posts the solutions the next night, so it isnt a big deal if you can't figure out how to do the problems.  Other than that just going over notes and assignments is what you do to study for the test.  Plus the videos.\nDon't be fooled, this class is very challenging and you will work incredibly hard, but Rojas manages to make it SO SO manageable and wants everyone to succeed.\n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "November 06, 2014",
            "review_content": "\nProfessor Rojas is a saint.  He makes himself available to his students (office hours every day of the week!) and he really cares. His class is completely fair and while the exams are difficult he is a gem about partial credit.  This man deserves a gold nugget. \nWorkload:\noptional nightly problem sets (3-5 questions). He never collects them or anything but in order to do well on the exams do them. \n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "July 23, 2013",
            "review_content": "\nThis guy is the real deal. Patient as HELL and extremely encouraging. Orgo sounds daunting, but every important concept is explained clearly in his class. He grades very fairly if not leniently, but office hours are crucial if you want an A. I usually went twice a week. Also--he isn't charmed by suck ups. He doesn't play favorites at all, so don't waste your time with that route. Show up to class. Take notes. Go to office hours. And most importantly--do not be afraid to ask questions. Those are the things that matter to Professor Rojas and those are the things that will get you a great grade. He is an excellent, excellent educator and probably the best I've ever had. Best piece of information about Professor Rojas--he makes his own problem sets, so his tests are extremely related to the homework. If you master the problem sets, you'll do very well on his exams. There are no surprises. \nWorkload:\nnightly problem sets usually consisting of somewhere between 2 and 6 questions--really not a big deal because they take like 20 minutes and if you have a question just ask it in office hours. you don't need to turn them in, they're just for you. try to keep up with them as much as you can, but I've gotten A's on exams when I pushed off the assignments for a few days too (just make sure to catch up with enough time to review the problems 2-3 more times for a couple of days before the test). 4 midterms, very fair and not on so much material. 1 final, big emphasis on later part of the semester. \n"
        },
        {
            "course_name": "Organic Chemistry I BC3230",
            "review_date": "May 25, 2013",
            "review_content": "\nRojas is the best professor I have ever had. I was really, really struggling the first half of the semester and I went to him asking if I should withdraw, basically freaking out. He was so nice, and empathetic and urged me not to withdraw because I wasn't at that point. He gave me study tips and urged me to come to office hours at least once a week. I highly recommend that if you take this course you go to office hours MORE than once a week. He holds them every day at different times so you should be able to go to at least one. I went every day. These office hours gave me As on the 3 exams after the first 2. He explains and explains and explains like crazy and will answer anything at all. No question is dumb in this class and he takes every question very seriously and makes sure you understand what you need help on. He is so extremely supportive and helpful. His in class notes are also amazing and color coordinated and organized. I have never had any professor so dedicated and so patient. Orgo sucks but I ended up enjoying it a lot more because of him.  \nRojas also got the Emily Gregory Professor Award at Barnard, well deserved. \nWorkload:\n4 midterms (increasing in weight towards grade) and 1 final. daily practice problems for our own use, never turned in (definitely do these if you want an A). \n"
        },
        {
            "course_name": "Orgo I and II",
            "review_date": "May 02, 2013",
            "review_content": "\nPut very simply, Professor Rojas is an incredible Professor!  Although I hate organic chemistry, and I have really struggled through this class, Professor Rojas has helped an immense amount.  He not only explains everything in class very throughly (with color-coding, and super clear writing), but he is very open to questions and regularly answers related questions in the middle of lecture.  In addition, he just had a way of making the lecture (dare I say it, entertaining).  He would recite poetry to send us off to the weekend, he showed a video of translation of mRNA with Star Wars music in the background, and he often gave us \"fun facts\" (albeit orgo related) to bring up in intelligent conversation.  I highly recommend this class for anyone who loves the material, or who need to take orgo for a requirement.  Especially if you're debating between Columbia and Barnard.  Take orgo with Rojas...\nOne of his most endearing quotes is:\n\"unicorn+dragon=rhino\"\nIf you want to know why, enroll in orgo with Rojas!\nWorkload:\nThere were daily problem sets (for our own practice), and four midterms and 1 final.  Rojas recommended we dedicate 1 hour a day to orgo.  But be forewarned, if you take orgo lab simultaneously, you'll be hard-pressed to dedicate all of the time you need to orgo lecture (which is what happened to me).  \n"
        },
        {
            "course_name": "Organic Chemistry I BC3230",
            "review_date": "May 15, 2011",
            "review_content": "\nProfessor Rojas is part approachable student-oriented professor, part rock star.\nNot an actual rock star like Macklovitch.  But Rojas definitely gave off a rock star vibe in lecture.  He did things like recite Scottish poetry.  He has a good sense of humor.\nOn the approachable student-oriented side of things, Rojas explains things so clearly, with neat handwriting and color-coding.  He learned most students' names in a lecture course of over 100.  If you don't understand something, and you ask about it in office hours, he will find a way to make you understand.  His flexibility and skill teaching are truly amazing. \nYou will love him, and you will love orgo.  In order to also love your orgo grades, my advice is go to office hours at least once a week, preferably more.  Also keep up with the assignments.  Spend at least 15 minutes trying to solve a problem on your own before checking a solution.  If you still don't understand a problem after seeing the solution, ask about it at office hours.  The goal is not just to complete the assignments but to fully understand them.\nWorkload:\nRojas recommends an hour per day, six days per week.  I spent maybe an hour and a half per day, five days per week, and came out with an A.  I never found the orgo lecture course very stressful.  If you keep up, it's perfectly manageable.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "December 17, 2008",
            "review_content": "\nProf. Rojas is, hands down, the best science teacher I had at Barnard/Columbia for the reasons that every other reviewer has already noted.  Even compared to humanities classes (I was a humanities major), I think this class was extremely well taught and helped you appreciate orgo (somehow).  That said, it's no walk in the park, but what I do appreciate about this class is that the resources he gives you entitles everyone an equal chance to do well.  Here are the rules:\n1.  Attend every lecture and recitation session, no exceptions.  If you miss a lecture (bc of an emergency) get the notes immediately, go over them and make sure you get caught up.\n2.  Do the problem sets before the recitation.  \n3. Go to at least 1 or 2 office hour sessions a week.  He holds one almost everyday, there really is no excuse to not attend.  Also, if you can't make any of them, he'll meet with you on your own.  Don't be intimidated by his cultish followers, who try to hog up all the time asking questions.  Be bold and ask yours too.  \n4. Study for the tests at least 2 weeks ahead in advance.  He tests understanding, not how well you can memorize.  \n5.  Form a study group, with smart, kind-hearted folks.  Although, this is not absolutely necessary, it definitely helps and, if nothing else, when everyone else is partying on the Thursday night before an orgo exam, you don't have to be cooped up all alone and scared in butler.    \n6.  SLEEP THE NIGHT BEFORE TESTS - I can't say this enough.  The test requires critical thinking.  You need to be human (not half man half red bull) when you take it.  \nLastly,\n7. Don't get sick.  I know this sounds stupid, but I really mean it.  Take your vitamin C pills, flu shot, cut off coughing friends, etc.  Take care of your body and sleep because getting sick can absolutely hurt your chances of doing well in this class.  \nOk, well that was longer than I intended, but I sincerely hope this info helps you.  And I also think you should consider capping the number of credits you take to 15 during these semesters.  \n\nWorkload:\n1 problem set week (not collected), 2-3 lectures a week, 1 recitation/week, 3 midterms, 1 final\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 15, 2007",
            "review_content": "\nFirstly, I LOVE Professor Rojas (as does everyone in my class)!!!  He is one of the BEST professors I have ever encountered.  He's brilliant and makes orgo seem almost accessible.  \nHis lectures are very clear and organized, and although the exams are difficult, there is a HUGE curve in the end.  Even I found myself surprised at my final grade, as it was a LOT better than I had expected it to be.  \nI think the only thing that made me stick through with his class was not the fact that he taught it well, but because I really admired his personality.  He recites poetry occasionally, and cracks witty jokes during every class.  He doesn't get angry at the billions of cellphones ringing during lecture, and is very patient and considerate.  I know that Orgo is one of the hardest classes ever, and my grades weren't stellar, but if you ask me, I think that you should take it just to experience Rojas's awesomeness.  HE'S AWESOME.  Take orgo with Rojas at Barnard, you won't regret it.\nWorkload:\nThree difficult exams worth 20% each Final exam worth 40% Weekly psets (not turned in)\n"
        },
        {
            "course_name": "Organic Chemistry I BC3230",
            "review_date": "May 10, 2007",
            "review_content": "\nFinally paying 40,000$ for \"Columbia Light\" (aka Barnard) has paid off.  I tried taking this course at Columbia with Katz and had to  drop it. Katz may be a noble prize contender, but he is a horrible lecturer. Rojas is a terrific lecturer, is totally student oriented, AND he has legible handwriting. He holds office hours daily and is very organized and approachable. He explains things well and is a very soothing presence in a course that can be stressful. Rojas is everything a college professor should be, consider yourself blessed if you can get him for both semesters of orgo.\nWorkload:\n3 exams and a final. optional weekly problem sets.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "April 11, 2007",
            "review_content": "\nCan I please just start out by saying that this is the most adorable man I have ever met and I love him? That being said, orgo sucks. I mean, horror stories about organic chem are all true but honestly, Rojas makes it less painful. Yes his exams are horrible and sometimes you want to drop out of school but then you think of his poetry recitations or his fabulous anecdotes or hysterical references to pop culture and you tell yourself to keep going. Amazing professor who really knows what he's talking about-and overall one of the best science professors I've ever had - Definitely a treat after Gen Chem. He's adorable, intelligent, and very suave. Terrific. \nWorkload:\nThree midterms, final...weekly problem sets that aren't handed in\n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "February 20, 2007",
            "review_content": "\nINCREDIBLE TEACHER! Teaches very well (even though the class itself is HARD). He is very thorough in his explanations and try very hard to make every clear to his students. HE even washes the black board so everything he writes is clear with no background smudge! He's also very amusing at times with random jokes and romantic poetry. All in all, if you're going to take orgo, you'll be lucky to have rojas! I think he should be one of the \"golden nuggets\" professors =)\nWorkload:\nWeekly pset (not turned in). Three midterms and a final, all of them pretty damn hard. Class average is around a 60-70, so a HUGE curve.\n"
        },
        {
            "course_name": "Organic Chemistry I and II",
            "review_date": "October 31, 2006",
            "review_content": "\nRojas is the best professor I have had at Barnard.  He has made orgo as easy and enjoyable as it could possibly be.  His lectures are perfectly clear and easy to follow.  Also, I have to add the fact that he is possibly the most adorable person in the world, and a significant number of us are pretty obsessed with him.  We find ourselves swooning on a regular basis.\nWorkload:\nweekly optional problem sets that I used to study for tests. 3 midterms and a final. very fair. don't bother with the book, MEMORIZE his problems instead.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 22, 2006",
            "review_content": "\nProf. Rojas is the best!!!!! He's so cute, endearing and makes learning Orgo fun!! He recited poetry and Shakespeare sonnets in class! What a great class. \nDefinately take Orgo with him if you can. The tests were pretty hard - usually slightly harder than the practice tests he gives you before the tests - but there was a decent curve. Prepare to work hard - I know a lot of people who dropped pre-med because of this class. But don't worry, there is a decent curve.\nWorkload:\nWeekly optional problem sets (I recommend doing them, if not weekly, use them to practice before tests), 3 midterms and a final.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "May 03, 2006",
            "review_content": "\nWell it's orgo, so yeah it's hard. But Prof Rojas is truly an excellent lecturer. The colored chalk and funny side stories really help. He is quite organized and provides extensive office hours and practice exams. This is a course where you hace to review the material really every day to do a decent job here. Playing with the model set helps.\nWorkload:\nNon graded weekly problem sets. 2 fair midterms and final\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "January 10, 2006",
            "review_content": "\nProfessor Rojas makes me happy to have chosen to go to Barnard. He explains orgo so clearly in lecture and daily office hours that he suggests not reading the text (unless you don't understand something). Instead, he suggests spending time making flashcards, and doing problems (I also recommend reading your class notes, attending as many office hours as possible, and studying orgo every day so you don't get behind/ cram). His exams are difficult, but he curves at the end and all orgo classes require intense studying. Overall, Rojas is a wonderful teacher and person and makes orgo enjoyable.\nWorkload:\nWeekly prolem sets (not graded), old exams for practice, suggested practice problems from text, 3 midterms and a final.\n"
        },
        {
            "course_name": "Modern Techniques of Organic Chemistry Lec and Lab",
            "review_date": "August 22, 2005",
            "review_content": "\nProfesor Rojas is an absolute genius at explaining.  He is especially good at explaining Organic and making it come to  life in ways that it may have not before (outside of the lab).  He has a great attitude, clear expectations, and urges you to think outside the box -- allowing you to apply your knowledge to practical laboratory and real-world situations.\nI felt very lucky to be one of Dr. Rojas's students.  I would say he is the best teacher I've had so far not only at Barnard, but at Columbia.  He is kind, very open to questions, and eager to make sure you understand what it is you are doing in lab.  He doesn't want to make parrots, he wants thinkers and hard workers as his students.\nI learned so much in this course -- it really helped me learn to love working in college labs (as opposed to research laboratories).  It also helped me fall in love with organic chemistry because YES IT IS THAT COOL :o)\nIf you are reading this because you have him for ORGANIC CHEMISTRY II you are IN LUCK!  There are some of us who had Doubleday, as many of you did for first semester.  All I have to say is, I envy you deeply!  I cannot imagine how fun and clear and interesting Orgo II will be with Dr. Rojas.  You lucky ducks!\nWorkload:\n4 formal lab write-ups with interpretation of NMR, MS, and IR spectra.  Weekly quizes (some hard, others quite easy).  Weekly problem sets (take quite a bit of time, not the kind of thing to start the night before).\n"
        },
        {
            "course_name": "Modern Techniques in Organic Chemistry Lab, Intermediate General Chemistry",
            "review_date": "May 19, 2004",
            "review_content": "\nModern Techniques is an excellent lab, and professor Rojas is an amazing professor. He loves chemistry and loves to share his knowledge and passion with his students.  Highly Recommended!\nIntermediate General Chemistry was not quite as excellent, due to the fact that Rojas is an organic chemist. He did not have a firm grasp on the material and taught straight from Prof Chapman's notes. This made the class very difficult and the workload heavy. Not recommended.\nWorkload:\nLab: 4 extensive lab write-ups, weekly quizzes.\nLecture: weekly problem sets, 2 midterms, 1 final\n"
        },
        {
            "course_name": "Organic Chemistry I, Modern Techniques of Organic Chemistry Lab",
            "review_date": "May 03, 2002",
            "review_content": "\nProfessor Rojas is such an excellent professor with such an extensive knowledge of organic chemistry. Not just that, he really explains the material so well and so clearly. his notes are excellent and his lectures are very well organized. he holds office hours frequently and always tries to make himself available to students. he really cares for his students and wants to help them understand as much as possible. he has the tendency to crack jokes, some of which are lame, but some of which are really funny and appropriate. he can be very entertaining and he makes the lectures go by faster.\nWorkload:\nweekly problem sets, 3 midterms, one final\n"
        }
    ]
}