{
    "prof_info": [
        {
            "prof_name": "Rachel Austin",
            "prof_id": 13259,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "December 08, 2016",
            "review_content": "\nProf. Austin is an amazing professor!  She puts in a lot of effort to make the material manageable for all students.  She has plenty of office hours, and is very responsive to the needs of her students.  She fosters a collaborative learning environment, and her lectures are very easy to follow.  Highly recommend this course!\nWorkload:\nHigh.  Online homework assignments for each class, including problem sets, videos, and quizzes.  3 exams per semester and 1 final.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "December 08, 2016",
            "review_content": "\nI love Prof. Austin. She is so sweet and understanding. She drops your two lowest test grades (including the final). She really wants her students to succeed and love chemistry. She organizes the class by having video lectures for homework and then doing problems in class. I like this because I was able to ask her questions in class with her and the problems are always the hardest part of the tests. She is great. I love her. Take class with her \nWorkload:\nHomework after every class and pre-class questions that are graded for completion. Occasionally a 3 question quiz online. Not bad at allowing \n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "November 18, 2016",
            "review_content": "\nRachel Austin is one of the most amazing teachers I have ever had in my school career thus far. Gen Chem is not easy at all, but I am sure anyone who is reading this already knows that. I spend many, many hours studying and doing homework for this class every week. However, if you put in the work to study and do your homework, Rachel will make sure you succeed in the class. \nYou must attend her office hours if you are not already great at chemistry and are still hoping for a high grade. Not every lecture is specifically helpful, but during her office hours she will explain anything to you and I promise you will understand even the most difficult concepts if you attend office hours and come with questions or with a mind ready to learn chemistry! She is patient and kind, no matter how basic and sometimes dumb the question is. She also answers questions online in the class discussion form all of the time, so basically her office hours are always happening online. I mean, the woman takes the time to memorize most of the class's names and there are 170+ students in the class! \nHer classroom style is flipped. She uploads videos (which you can get through quickly if you watch them at double speed) before class and then instead of lecturing she puts up problems for you to work through with your peers during class. This doesn't work for everyone but I guarantee it will work better if you actually watch and digest the videos before showing up. Again, if this isn't helpful for you just make sure you watch the videos, don't go to class, and attend office hours instead to clarify any point from the videos.\nThe tests can be a little tricky, but her \"automatic curve\" that results from her lowered grading scale (an 88 is an A- just for example) and the fact that she drops two of your four test scores (you don't even have to take the final if you are happy with two of your other test scores!!!) basically even it out. If you know the basics very well and can apply your knowledge you will do well on the tests. \nThis is super long winded, but the main point is that this class can be fun if you decide to have a growth mindset. As someone with no chemistry experience in the past I can honestly say I have learned so much and I have thoroughly enjoyed being in Rachel's class. I would take the harder class here at Barnard with Rachel and really understand chemistry, then have an easier time in huge gen chem class at Columbia where I don't comprehend as well and don't get the same personal attention.  \nWorkload:\n3 preclass homework sets a week (1-6 questions graded on completion) \n3 postclass homework sets a week (8-20 questions graded on accuracy)\n5ish online \"quizzes\" per unit - 3.5 units total (since this is online it's basically just more homework)\nAll homework and quizzes count for 25% of your grade\n3 unit tests & 1 final (each test and the final count for 25% of your grade)\nLab is connected for this class (25% of your grade)\nAs you can see this adds up to 150%, meaning that she drops which ever two sections are your lowest, with the exception that lab MUST count as one of the four sections that factors into your grade. (So you could have your homework, two tests, and the lab total up your whole grade!!!!) \nDefinitely a heavy work load, around 20 hours a week if you haven't taken advanced chemistry before \n"
        }
    ]
}