{
    "prof_info": [
        {
            "prof_name": "Sonia Montero",
            "prof_id": 12627,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 23, 2016",
            "review_content": "\nOne of the greatest spanish professors I have ever had. Sonia is caring and easygoing, and she tries to build some of her classes around discussion. She is organized and has handouts for every class outlining the activities and lessons for that day, making it easy to study for the midterm and final. She is a rather easy grader, she gave me a perfect on the oral portion of the class when I stumbled through about a third of it, and always wants to help you get the best grade possible. I felt that I learned more in her class than in any other spanish class, even though she uses the textbook (Gente) less than all of my past professors. All in all, she might not be the best professor for challenging yourself to improve as much as possible, but she is one of the kindest professors I have had and creates a friendly and organized environment where you know she is there to help you.\nWorkload:\nSame as any Spanish class:\nWeekly MySpanishLab activities or assignments\n3 compositions of about 500 words\nProject (For me it was having a pen pal from Spain, which was really fun)\nOral Activity\nMidterm\nFinal\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "November 09, 2013",
            "review_content": "\nThe semester's not over yet, but I'm writing this review 'cos course selection begins next week for some of us, and I know some of y'all will appreciate this :) In brief, Sonia is amazing. I have her for Elementary I this semester, and she makes learning Spanish feel really effortless. Very intuitive explanations of language, lots of conversation time in class. Workload is very light, and I don't feel like I did much homework, but I've really learnt a surprising amount of Spanish. This is hands-down my favorite class this semester. Ella es una buena maestra, muy amable y paciente. \nWorkload:\nVery light, but somehow I feel like we learnt a whole lot. \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 30, 2013",
            "review_content": "\nSonia was a new teacher this year at Columbia. She is straight from Spain with a thick Spanish accent. Her class is very discussion-based. The textbook she uses is the standard Gente series, from which she gets some very menial homework assignments. We watched a few movies outside of class for homework and analyzed them. Participation is encouraged; she often teaches a discussion-based class structure, spending the first part of class each day going over the previous night's homework by going around the table and having each student give an answer.\nHer class was generally tedious, but she's funny if you can understand her humor. The way she teaches certain units isn't exactly catered to English-speakers, but she generally gets her point across. She teaches exclusively in Spanish. \nOverall not the best experience, but not bad, and she's a very easy grader. \nWorkload:\nA few essays, some reading, some short problem sets, some movies, a midterm, and a final. \n"
        }
    ]
}