{
    "prof_info": [
        {
            "prof_name": "Ioannis Mylonopoulos",
            "prof_id": 3549,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "V3248 Greek Art and Architecture",
            "review_date": "November 21, 2016",
            "review_content": "\nI just want to write a review to temper the universal praise this course and professor have received. I was really excited to take this class partly because of the stellar reviews they received. This class is a lot of memorization and memorization that will be useless to you unless you go further into studying this field. I was not inspired by the lectures nor did I even find them interesting. You look at famous works like the Venus from Melos and basically just learn when it was made and who possibly made it. You don't get very much Greek history or culture in this class. Maybe if Professor had slowed down it would have felt more worthwhile.\nDon't take this class if you looking for a course which will give you an understanding of Greek art which be with you for a lifetime. Don't take this class if you are not prepared to memorize hundreds of works. The professor plows through the objects at a quick pace and you will fall behind quickly if you aren't keeping up. Just to make it even worse he includes some works from the first half so you have to memorize everything for the final because you have no idea what will be on there. I just found that the work I put into this class didn't really pay off. \nHe also bragged about how he reads all of the final papers and makes comments on them but his comments were nearly worthless, occasional spelling corrections and then a final grade, that's it. He will also call people out in class, especially the ones who look like they are trying to hide. So if you are shy or don't do the readings this can be stressful. By the way, the readings are to prepare you for the lectures and do not need to be used on the midterm and final. Again, memorization is the focus. If you love Greek art and this is your thing then go for it but if you are on the fence then maybe take something else.\nWorkload:\nmidterm\nfinal \nfinal paper\n2 visits to the Met\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 27, 2015",
            "review_content": "\nI had Prof. Mylonopoulous for Art Hum in Paris last semester and as someone who wasn't looking forward to this core class, I was shocked by how amazing this class was. I don't know if it was being in Paris or having such an awesome professor or a combination of the two, but I'm so glad to have had him as my instructor. He really cares about the students and encourages you to think critically. He makes it so easy and comfortable to talk in class, which helps because participation is so important in these smaller core classes. The syllabus thoughtfully integrated all of the resources of Paris and you can tell he spent time selecting museums and pieces throughout the city, even taking us outside of the city on trips to see some of the architecture pieces that we studied in person.\nClass was not stressful at all, as along as you speak up and voice your opinions. He never made anyone feel stupid about their observations/interpretations, even though there were some out-there remarks. His accent is also charming - a combination of so many different European accents because he can speak so many different languages! Ioannis was cool. All I can say is take his class if he's teaching in New York. \nWorkload:\nPretty standard - Participation was high up there, there were two 3-4 page papers, a midterm and final. Something new/cool was also a final project where we got to use our creativity and get inspiration from any of the pieces we studied to create something of our own (it could be written, visual, etc.). Everything was pretty evenly weighted and not difficult to manage.\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "May 23, 2013",
            "review_content": "\nThis class was incredible - being Greek myself and being taught by a Greek professor while learning about Greek art and archi was a real pleasure. His lectures are engaging, I went to all of them, and he only calls on you if you raise your hand. Participation is encouraged though as he will ask your name when he calls on you and the more the answer, the more memorable you are, and the more he will like you. He corrects the papers himself, so recognizing your name will definitely help. I never did any of the readings but the lectures prepare you perfectly for the exam and midterm - he tells you what he wants you to know. A LOT of memorization is involved though. this is an intensive art hist course in the sense that he will ask you the exact date of the berlin painter`s vase and in what decade this particular minoan house was created. every date, name and artist has to be remembered, he doesnt create a list of 40 pieces to study for the exam for example, KNOW EVERYTHING. \nWorkload:\n1 8-10pg paper due at the end of the semester, 1 in class midterm, 1 in class final (very manageable)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 12, 2011",
            "review_content": "\nAbsolutely loved his class - one of the best professors I've ever had at Columbia.\nHe is clear, fair, and a wonderful presenter. I am in SEAS and learned so much from this class (despite thinking I would struggle through Art Hum). \nHe is also funny and makes class enjoyable. He will make humorous comments about the pieces of art that stick with you and make you really remember.\nIt is really easy to approach him with questions whether in class or out of class about paper topics, etc. He began the semester by saying his goal is to get us to learn how to talk about art. In other words, he really wants you to LEARN (which is why is first paper is ungraded, it's supposed to just get to learn how to write about art). A good initial summary of a painting, for him, is literally \"there are three people - a man and two women - the man is in front and holding flowers...\" a very very basic description, then he will lead you towards the more advanced ways of thinking about art.\nWorkload:\n3 papers, first one ungraded. a midterm, a final. all very fair - he did not give paper topics so you are free to write about whatever most interests you. there are readings for each class but i dont think anyone in the class ever did them and i dont think he ever really expected us to. i think part of the grade was also discussion.\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "August 10, 2011",
            "review_content": "\nI can critique this class only on two aspects - content and presentation.  For the former, I learnt many things that I was not aware of before this course. Every class taught me something new, every hour was useful. Because Prof Mylonopoulos keeps on highlighting the differences between different pieces of art, it is not difficult to remember the material after class. At the end of course I was able to look at a piece and tell its approximate age, in addition to my opinion whether it was an original or Roman copy. \nAs far as presentation goes, Prof. Mylonopoulos had the class' undivided attention because he would bring a mundane piece to life by telling interesting stories and events. At times I was so spellbound by his teaching that would not realize that an hour had passed by. He made very interesting observations on questions like - Is geometric period primitive? Was Alexander's conquest of East justified because what ancient Persians did to Greek temples? Questions like these made me see  not only Greek but also Meso-American art in a different light. The visits to MET were icing on the cake. \nTo sum up - Of the 5 courses that I took last Fall, including graduate level IEOR courses, this was the one which I enjoyed and learned from the most. \nAlthough I did not have much interaction with TAs, they seemed to be helpful to other students. \nWorkload:\nI am not a art history major and AHIS 3110 was the first college level class that I ever took outside of the realms of mathematics or science. I did not take this class for academic credits and so will not be able to comment on workload.\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "April 18, 2011",
            "review_content": "\nProf. Mylonopoulos was a good professor and I would recommend him.  His lectures were extremely organized and English language skills very good.  He was easy to understand and follow.  One of the problems with his lectures was that at times he tried to cover way too many slides and did not have enough time to go deep into each one of them.  He gave an overview of too many things and facts during lectures, and sometimes missed the big pictures. He kept saying in class how the material required many more lectures.   He has trouble cutting out stuff from his lectures for an intro course.  He is a very detail oriented professor and wants to see as much information as possible in the exams. However, during the lectures he covers so much materials he barely has time to really analyze one object or monument.   This is not a bad thing though...We really got to see lots of slides and learnt a lot about the material, we developed an eye for recognizing certain themes in Greek art, etc.  He also wants the class to pay attention and calls on people. He probably knew everyone's name by the end of the semester, at least everyone who had said something in class.  How many professors do that in a class of 65+? Name calling kept most of us awake and interested during lectures and I appreciated that he cared about us learning the subjects. It was in a way his way of communicating with his students and connecting with them.  \nReadings were useless and not interesting.  The lectures were a must and he takes attendance anyway. The lecture summaries he posted online were very helpful, particularly for the exams.  There is no discussion section. He does tend to treat his students like kids, I guess that is his style...but I found him to be very approachable, organized and a good professor.  \nWorkload:\nThere is one midterm, 2 met trips, one final exam and one final research paper 8-10 pages (which he wants you to start thinking about first day of class, and if you do, you will definitely get an A).  Exams are based on slides, but he basically expects you to rewrite the summary presentations he posts on the columbia website.  They are questions about each lecture. He hands out paper topics, a wide range of them.  TAs grade the exams and they were critical and detailed oriented per the Prof's demands.  \n"
        },
        {
            "course_name": "The Athenian Acropolis in the 5th & 6th Centuries BCE",
            "review_date": "April 17, 2010",
            "review_content": "\nMylonopoulos is brilliant (speaks many languages) and pretty funny, but not approachable nor warm. When I went to discuss my paper with him, he was pretty condescending and I felt somewhat like I was wasting his time. Granted, some students respond well to a blunt and to-the-point kind of professor, but I was not one of them. Additionally, the reading list was pointless; the \"supplementary\" readings (which were often only 5-10 pages) were relevant but weren't helpful nor interesting and certainly not required for the exams (which are average in difficulty. like everyone else says, its a series of specific questions and you usually know the response he's looking for.) Paper was relatively painless (I got an A with minimal work effort) but if you're looking for a warm supportive professor, he's not your guy. \nWorkload:\nmidterm, final, 8-10 pg research paper, maybe a participation grade (can't remember)\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "January 24, 2010",
            "review_content": "\nThis was a great class taught by an even greater professor.\nThe class includes material about early European civilizations, serving as a preface to Greek art up until Roman times. Ioannis is a nice guy, very approachable and helpful, and he manages the class to be fun and informative.\nEvery class begins with a recap of the recent sessions, sometimes presenting material side-by-side to create a fuller picture of the trends and shifts in art, sometimes serving as a pretext for the new topic to be introduced. He asks students questions to sort of wake up the brain and not start a class on a \"clean slate,\" which I found very helpful. He's very nice when asking students and isn't intimidating; he'll try to work with you to get to the right answer but won't press if he senses you'd like to pass on the opportunity to answer.\nThe class covers a lot of topics, but some are covered in much more depth than others. For example, art in early European civilizations were covered lightly compared to classical Greek sculpture or black and red figure vase painting. This is also reflected in the exams: in fact, you can actually sense (and if you don't, the TAs will point it out :) that some of the topics interest the Professor much more than others and are more likely to be the focus of one of the two exams.\nThe class is aimed at students who are interested in the material. There is no homework nor are the readings necessary; they seem more of an \"added value\" sort of thing if you're interested in further reading. There are two exams (midterm and final) which are graded 20% and 40% respectively. The idea is that when you do the midterm it's your first time confronting an exam on this course and too big of a weight might offset your grade. (I thought it was very considerate.) The structure of the two exams is the same; basically a bunch of questions to which your answer should be short and to the point. (You do need to remember some dates, but that's not difficult if you try to learn the style rather than memorize things.)\nUp to the midterm the focus is on Greek sculpture, and afterwards it shifts to vase painting. I have to admit that I personally found the first part of the course much more interesting... Vase paintings is a subject of archaeological importance to us, but to them those were everyday objects. (I always imagined a museum in the year 4500 presenting pieces from the \"Ikea\" workshop...) In between also covered are temple architecture, city planning, and Greek theaters to name a few. The Professor uploaded a bunch of slides with a lot of images to narrow down what we have to \"memorize\" for the exam, but again, if you pay attention to what he focuses on, or (as I found out too late) go to exhibitions he recommends (especially if they are in the school) you'll have a much better idea of what are the likely images for the exams.\nThe remaining 40% of the grade is a paper that is fun to do. You get to pick a topic out of 40 or so sculptures, vases, etc. at the beginning of the semester and once he approves your organization (basically, the \"chapters\" or the \"main parts\" of your paper) you can start working... He stressed that he doesn't care about anything but a few basic things -- description of the piece, what makes it special, along with some of your own analysis -- so you don't have to worry about questions like fonts, citation format, and so on. I think he puts more emphasis on the critical analysis so a huge bibliography is probably not important as long as you get the most widely known sources. (Also, throughout class he often touches subjects of the various papers, which I guess is helpful.)\nFinally, the best part about this class is the museum trips. You get two of them, and whether you like museums or not, he makes it a different experience. (I'm inclined to say \"if anything, take the class pass/fail just for them.\" :)\nOne more thing I have to add that made an impression on me is that he gives a lot of room for individual thought. When presenting the \"official\" version (or versions) for the meaning of something, he always says that we can't know for sure, obviously, and encourages you to take it with a grain of salt and think for yourself. Just because something is written in a book or is his opinion that he presents in class doesn't mean it's final... That is an attitude I wish more professors (and fields) would adopt.\nOverall, this is a fine class and an excellent professor. Highly recommended.\n\nWorkload:\nMidterm, final. I don't think either was too difficult. Paper, 8-10 pages, also not difficult. He says the benchmark is the best answer/paper -- which means that the ones who deserve A+ will probably get it. (I got a B.)\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "January 10, 2010",
            "review_content": "\nMaybe I'm in the minority, but I would avoid Professor Mylonopoulos. Yes, he is bright (maybe even brilliant) and interesting (he cracks some good jokes), but he hasn't been approachable or supportive! I'm sure most students don't mind this... But I didn't like that he never gave us a prompt for the research paper (one paper, 40% of our grade) and when students frantically emailed him asking how to structure the paper (what he wanted, etc.) the last couple weeks of class, he decided to announce that he wasn't responding to any student emails anymore. He acted like he had no time for his students! The majority of his students genuinely needed direction. I'm not sure why a teacher wouldn't realize that there was a problem that needed to be addressed (maybe he should have written a prompt, for example). \nI don't want to go into the pointless details, but let's just say that this teacher didn't make me feel at home in his class. The semi-daily \"quizzes\" or drills when Prof. called on people he knew the name of made me want to hide instead of participate. Maybe I'm just not as competitive as most people. But more to the point, why were dry things like the dates and periods of objects valued SO much? I would have liked to learn about more interesting things. It's not that I don't think dates and periods and vase shapes are important, it's just that I would have liked to have learned more on top of that. There wasn't much substance.\nIn the same vein, we saw a TON of images. This was great because I think I've been exposed to just about every ancient Greek artifact. That's nice! But we didn't go into much depth! We were racing through this stuff. And then when it came time for the midterm, we had to know EVERYTHING we had seen. That meant memorizing hundreds of slides. For the final there were five ppts that made up the \"study guide\". It was a huge amount of memorization and we had often learned nothing about the art piece except its date and one or two sentences of information! Good in some ways, bad in others.\nThis was a good class because I learned a lot. But it was definitely rushed and the Prof. was kind of harsh and unapproachable (in my opinion). I only missed two classes, but when I went to talk to him in his office hours the first thing he said to me was, \"I've never seen you before\" with an accusatory tone.... Remember, I mentioned I \"hide\" in class because I try to avoid the \"quizzes.\" I really didn't know what to say to defend myself (but seriously, does he really think he knows everyone's face in a class packed with 40 people?) and as a result I was pretty nervous the whole time we were talking.\nOkay, I sound pretty pathetic. I just don't think he trusts his students! I don't think he likes his students! He may like some individuals that he gets to know, but he seems determined to think that we are all lazy slackers! \nIt's not that I didn't do well in the class, it's just that he kind of sucked some of the enjoyment out of it. My advice is: get on his good side and do everything months ahead of time. If you suck up to him, he'll love you! \nWorkload:\n1 midterm (no slide list, had to memorize all images, a lot of images), 1 8-10 page research paper (no prompt) due last day of class, 1 final (5 ppts, hundreds of images to memorize info about, semi-cumulative (not dates))\nAlso, the exams aren't normal art history exams (ID's, comparisons and longer essays). Instead it is a series of short questions. Weirdly, every student is compared to every other student. For example, even though I correctly answered everything a question asked me to answer I wasn't given full credit because someone else gave extra information (like dates, even though the q didn't ask for any). So you have to go above and beyond. \n"
        },
        {
            "course_name": "The Athenian Acropolis in the 5th & 6th Centuries BCE",
            "review_date": "July 07, 2009",
            "review_content": "\nProfessor Mylonopoulos is incredible! As opposed to other art history classes where the lights dim and then it takes effort to keep your eyes open, Mylonopoulos is engaging and his material is interesting. I definitely recommend taking this course with him or any of his other courses. I plan on taking as many as I can before I graduate. Do not get intimidated by the syllabus the reading is minimal and amazing at contextualizing all of the info that gets thrown your way. Mylonopoulos is SO ORGANIZED and posts all the lectures with notes and slides after each lecture. He is by far the best art history prof that I had in Columbia.\nWorkload:\nWeekly readings (that are helpful but you can get by without doing them), short museum visit paper, mid term (standard art history nothing tricky other than memorizing the lectures, final (not cumulative and like the midterm) and a paper that he makes you choose the topic of the first day of class (do not wait til the end to write it)\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "December 16, 2008",
            "review_content": "\nProfessor Mylonopoulos is absolutely fabulous-and in the context of this class, he can basically be classified as a Greek god. In addition to being quite attractive (a characteristic which definitely helped him hold my attention during lectures) he is also a very good speaker despite not having a perfect command of English. I learned so much because of this class, and feel like I could go to an art museum tomorrow with the ability to explain and contextualize every piece of ancient Greek art in the place. I am such a fan of him that I am planning to take another class he's teaching next semester, and am very much looking forward to it. In short, if you care at all about art history, I highly recommend this professor!\nWorkload:\none 8-10 page paper, midterm, final, plus weekly readings that were basically unnecessary and which I usually got away with not doing.\n"
        }
    ]
}