{
    "prof_info": [
        {
            "prof_name": "Patricia Grieve",
            "prof_id": 1594,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "East/West Frametale Narratives",
            "review_date": "April 18, 2016",
            "review_content": "\nI took this class senior spring to fulfill the Global Core elective. I truly despised this class, and I dislike the Global Core requirement in general for how it completely lacks direction and does not fulfill its purpose.\nThis class was a small discussion class twice a week that was in Casa Hispanica (painfully far from EC) in which attendance was mandatory. No one ever spoke (or quite frankly touched the reading, which could have been very interesting if the professor could in any way teach it) and when people did you could tell it was just to get their participation grade up. \nThis class was my least favorite kind of joke class: just persistent enough that you had to stay semi checked in to do well. I much prefer the kind where if the class does not give you a reason to take it seriously, it acknowledges this by allowing you to gracefully not show up. \nGrading was totally arbitrary as I knew many people who got 95/100 on the midterm and the final seemed to be graded on improvement rather than performance.\nFor context Patricia Grieve runs the Global Core requirement department (or whatever it's called). She is a professor of Spanish literature. This class was, except for Arabian nights, entirely focused on European literature and culture (we read Cervantes and Chaucer, for example). I do not know why it counted as a Global Core course except that she is the one who gets to make those decisions. She is also the one who decided that some History and Econ courses about Asia (among others, I'm sure) do not count as courses about \"non-Western culture.\"\nImagine that, another white person pretending to be an educator of non-Western cultures by teaching Western culture. \nWorkload:\nparticipation, presentation, take home midterm right before spring break, extremely painful take home final ... can't remember what else / never want to remember what else\n"
        },
        {
            "course_name": "Hispanic Cultures I",
            "review_date": "January 06, 2012",
            "review_content": "\nProfessor Grieve is super sweet and tries her hardest in the class.  There is a ton of reading to do (even after she shortens the workload) and most don't do it, producing stale class discussion.  By the end of the semester, she would simply ask a question, hear crickets, and then point out the part of the reading that she was referring to and ask her question again.  This is not the fault of Prof. Grieve, but the course itself as the amount of reading to be done was just unreasonable.\nProfessor Grieve was very knowledgable and passionate about the material.  She is also from Indiana, so she doesn't speak too quickly and does not have a strong accent.  Being a non-native speaker myself, this helped me a lot.\nIt is very easy to do well in her class.  There are 4 compositions with a max of 400 words, each with a re-write.  I found that as long as I put in some effort, I got a solid grade.   The exams were also a cakewalk, especially on the last 2 since she gave out the questions on the test a week in advance, and for the last exam, allowed us to BRING IN materials (essentially, I just copied from one sheet to another on that one).  I barely studied for the exams, but because I paid attention and class and did the readings (somewhat) I was able to get good grades.\nYou won't be sorry if you take the class with Grieve.  Sometimes discussion can be dull as with all spanish classes, but chances are you'll get a very good grade.  It was easy to tell that Grieve wanted the class to learn the material and not worry so much about grading, which is why she simplified things so much.\nWorkload:\n4 compositions with re-writes, 3 exams, no final.  There is a participation grade so take advantage of that.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2011",
            "review_content": "\nProfessor Grieve is a very cheerful and pleasant professor, who also made the long 2hr classes seem relatively short. I would suggest taking notes in class as your move through the books and she points out specific passages, because those are likely going to be on the midterm, and even a couple show up on the final. She has been the chair of lit hum a few times, and definitely has a more methodical approach to teaching this class.\nHer questions that she asks in class are very pointed to a specific answer she wants, and at least for our class, we did not stray away from her teaching itinerary much. She discusses themes pretty well, but what I felt was that we did not connect the themes and ideals of the texts to our own lives. We usually only reached a literary analysis instead of critical thought about personal relevancy. \nOverall she was a pleasant Lit Hum professor, and I think it might have also been our own class that stopped the analysis short, because most of the people in it seemed pretty over it by the second semester of reading the texts. The books are much better second semester than first semester in my opinion, but they are also much longer and more difficult to finish. Don't let Don Quixote set you back for the rest of the semester like it did most people.\n Like others have mentioned, if you are concerned a lot about grades (like most are), make sure to go to her office hours and talk to her about both papers to make sure she likes your thesis. I know our class overall did poorly on the first paper, mainly because she did not like the specific theses/topics chosen. \nAlso, she adds Old School on to the syllabus, which is a great book and she allows it to be used on the final for the essay or passage analysis. A lot of people, however, use this on the final, so it might make grading a bit tougher/more competitive. \nWorkload:\n-First essay- was 7-8 pages, 15%\n-Second essay- 6-7 pages, 20%\n-participation 10%- -DONT COME LATE, SHE ABSOLUTELY HATES THIS, and unfortunately the subjective grading that comes with humanities can be affected by this. \n-midterm - hers was pretty easy, 6 simple quote IDs, a more difficult passage analysis, and an essay where most people get full credit.\n-standard final -- except she added 3 essay prompts that were different from the standard lit hum \"one word essay prompt\", because she was afraid of the difficulty level. If you think you can find a good thesis from three of the texts for the specific word, it might be beneficial to chose this essay topic instead of one of her supplements.\n"
        },
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "December 21, 2010",
            "review_content": "\nOverall a pretty good class. Professor Grieve is very nice and tries hard to stimulate discussion. Class can be a bit boring at times--just discussing the reading every class, but its definitely tolerable. The first test was pretty hard, but for the next two she told us exactly what would be on the exam which made them much easier. The compositions were a little annoying but definitely boosted my grade, and you can write on pretty much anything you want. Also there's no book to buy which is nice, and there are three unit tests instead of anything cumulative. \nWorkload:\nReading for every class (sometimes long, but you can skim), three unit tests, 4 one-page compositions\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 02, 2010",
            "review_content": "\nI found  Professor Grieve a refreshing way to return to Lit Hum spring semester.  The nine oclock class was often hard, but she was always in a good and perky mood, which helped make us more enthusiastic (or at least that was the intent.)  She was always available to meet outside of class, and was willing to look over paper drafts and outlines.  She gave good comments and feedback to help me asses my own work and figure out what she wanted out of my papers.  There are two responses to each book, but it really is not that much extra work (just a few paragraphs) and she does not grade them harshly.  She is part of the core board, and so she often knows whats going on and how to prepare you for the coursewide final.  Overall I was pleased with this class, much better than my first semester!\nWorkload:\nNormal lit hum, one or two responses to each book ( a few paragraphs,)  two  4-6 page papers (be straightforward and concise, she wants you to be able to back up your claims with text, and is big on close reading.)  midterm and final.  not bad, and she is often willing to change due dates and assignments if people are really overwhelmed that week.  she is flexible.\n"
        },
        {
            "course_name": "Andalusian Symbiosis",
            "review_date": "December 22, 2008",
            "review_content": "\nProfessor Grieve is really amazing. She is obviously extremely knowledgeable and she is really passionate about learning as much as she can now. She was an excellent counter to Professor al-Musawi's somewhat scattered lectures and she was always willing to meet with students outside of class. She's a very fair grader, and has this knack for making each student feel extremely comfortable in class and with the material. She's one of the professors I've been waiting for -- the kind that are so smart that they are intimidating but so nice that they are encouraging. She really gives me faith in Columbia, and this class was SO interesting. The readings were all relevant and she made sure we used the books we bought so we didn't spend unnecessary money. I loved this class and would encourage everyone to take it -- it's relevant, fascinating and something that everyone should know more about although many do not.\nWorkload:\nLots of reading because it's only once a week, two \"interventions\" which are 5-10 minute presentations with a 2-3 page paper investigating some topic from the reading, one short written response, a 35-40 minute presentation, a take home midterm which is more like a short essay, and a final 20 page paper. It looks like a lot but it's really manageable and fun. The midterm is really strict on word count so it's not too long, and she's a fair grader.\n"
        },
        {
            "course_name": "Cervantes/Shakespeare's World",
            "review_date": "December 16, 2007",
            "review_content": "\nProfessor Grieve is fantastic! She really deserves a star, and I hope that my review will contribute towards one. \nShe is one of the kindest profs. I've had at Columbia. For this class, we read a lot of early modern english drama (e.g. Thomas Middleton, Philip Massinger, etc), Othello, and Cervantes' novelas, which are really fun. It will help you understand the period a lot better: i.e. Shakespeare wasn't the only dramatist at this time. The correspondences among the works made the class really special. We would go over the text very carefully in class so those who didn't understand the spanish reading or didn't have the time to finish the reading emerged with a good grasp on the text anyway. And discussed the issues brought up, like the Spanish-English war-faring dynamic, and their common fear of Christian converts to Islam. The class deals a lot with Spanish contact with North Africa, too. She's brilliant and nice: what more could you ask for? She photocopied all the material for us from her bilingual parallel-text edition to save us money and time. \nWorkload:\nA fair amount. You have to read a play or novella every week, plus scholarly articles or historical source documents. There are lots of fairly short writing assignments regularly due. Standard literature midterm. \nWe had a choice between an 8-10 page critical essay or take-home final at the end of the class. There's a lot of reading, but it's really good! Fair grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 23, 2006",
            "review_content": "\nDO NOT TAKE THIS CLASS SECTION. switch out if you want to keep your sanity. Prof Grieve came in second semester after the best prof ever, and all fun aspects of the class died. She tries to connect to students through strange comments about pop culture and weather and her family. It's so aggravating. I didn't even read all the works, but sparknotes did the trick. Discussion was stunted and it focused not surprisingly on the sparknotes major points. Sometimes she ran off on strange tangents about spanish culture, her specialty. GET OUT OF THIS CLASS. fine grader, i got an A, but still, i would rather have gotten any other grade WITH ANOTHER PROFESSOR. \nWorkload:\n3 papers (BE STRAIGHT FORWARD), one midterm, one final. \n"
        },
        {
            "course_name": "Don Quixote ",
            "review_date": "December 18, 2005",
            "review_content": "\nProf Grieve is the best teacher that I have had at Columbia, and I am a senior. She is extremely intelligent and has mastered the material.  She brings incredible insight to the class regarding the material and is a genuinely kind person as well.  She is very concerned with the students both learning from and enjoying the class.  You should not miss out on the opportunity to have Prof Grieve, even if you are not interested in Don Quixote she teaches other classes you could take. Prof Grieve is such an inspirational person that if I had taken this class earlier on I probably would have majored in spanish or a humanities. Do not miss this opportunity, she far exceeds the expectations of an Ivy League professor! \nWorkload:\nMidterm, Final or Final Paper(10pg), 2 short papers (3-5pages)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2004",
            "review_content": "\nProf Grieve likes to be very nice and happy all the time. Her eternal sunniness and tendency to spout aphorisms can be grating. She is familiar with the works, but sometimes has strong emotional opinions about them. Make sure to approve any paper thesis ahead of time to make sure she agrees with it. The paper topics she offers are repetitive and usually obvious (you can find a hundred high school essays of the same topic online). She's a reasonably fair grader but she won't give much feedback on papers. Her corrections and comments would dwindle as the paper went on and sometimes I wondered if she even read the last two pages. She also doesn't direct class discussion when people begin to repeat each others comments or its clear no one really understood the question. If you stray from discussing the \"major themes\" that you would find in cliff notes etc, she will sometimes be interested but usually have little to say.\nThe midterm required detailed knowledge of the texts rather than just of the major themes.\nShe's very friendly and helpful outside of class since she wants everyone to be happy just like her.\nWorkload:\n2 or 3 4-6 pg papers, daily response questions (just point out the major themes and she'll be happy)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 18, 2004",
            "review_content": "\nProf. Grieve is a really great Lit Hum teacher.  She's incredibly smart and really friendly.  I thought she did a really good job of framing the essential questions of each book we read and of fostering class discussion.  I thought she could do a better job listening to students' comments and responding to each one individually -- sometimes she seemed a little bit detached -- but maybe it's just her style.  Comments on papers were incredibly thorough and helpful.  I learned a lot from Prof. Grieve and would recommend her section.\nWorkload:\nReading is the same as in all Lit Hum classes.  3 papers but the third is optional; midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2003",
            "review_content": "\nClass performance is key.  She grills you in class, she encourages a lot of participation from everyone, but she's a fairly easy grader (a classmate of mine handed in a paper a week late and still got an A).  Don't show up late to class, she hates that.  She's a bit quirky but she's a very nice professor.  Be alert in class, meet with her outside of class about your papers, and you'll be fine.\nWorkload:\n2 4-6 pg papers (which is very light for Lit Hum), daily response questions (don't have to be thoughtful, but required), and midterm (quotations are hard but again, she grades fairly easily) and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2003",
            "review_content": "\nProfessor Grieve is the nicest, most intelligent woman I have ever encountered.  She arrived second semester, and breathed life back into the section.  She is ricidulously knowledgable, and amazingly friendly.\nWorkload:\n2-3 papers, midterm and final\n"
        }
    ]
}