{
    "prof_info": [
        {
            "prof_name": "Carla Shedd",
            "prof_id": 3430,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Race and Place in Urban America",
            "review_date": "January 05, 2014",
            "review_content": "\nProfessor Shedd is very experienced and accomplished in her field, and you could tell she knew her stuff. The class however, could at times seem to drag on. The subject matter was interesting stuff for discussion, but most of every class was lecture. This was frustrating since we were not tested on anything, nor were we expected to use much of what was said in class in either the midterm or final paper. Since attendance wasn't taken, it was very tempting to skip class. My favorite part was the discussion section where we got to grapple with some really stimulating topics and really delve into our readings. DON'T underestimate how long the memos will take you. The TAs are easy graders, but 2 single spaced pages on the readings we were assigned is harder than it might first seem. Get them out of the way early in the course, and the rest will be smooth sailing.\nProfessor Shedd is really friendly and personable, and even granted me an extension I didn't deserve out of goodwill. She isn't a pushover, but she is reasonable and understands the stress of student life, and gives you a little wiggle room if she can see you're being sincere. She and the TAs also bend over backwards to help you with papers, so reach out to them if you need help.\nIf you're really interested in the topic or you have a pretty good work ethic, take this class for a solid grade and some new knowledge in a fascinating topic, that will better equip you for being a student in New York City.\nWorkload:\nNot bad, but heavier than it appears: Five memos on the week's readings from weeks of your choice, (1-2 single spaced pages).one reflection on a field trip to Harlem, an ethnography and easy presentation based off four field visits to sites in Harlem, a 5-7 page midterm paper, and a 10-12 page final paper. Easy graders, just get it done.\n"
        },
        {
            "course_name": "Crime, Law, and Society",
            "review_date": "March 15, 2010",
            "review_content": "\nThis course was interesting but also frustrating. The reading covered topics such as theories of social deviance and crime, policing, the prison system and corrections, and others, but there was definitely a focus on the connections between race and crime and how that impacts every level of the criminal justice system. Most of the reading was quite interesting (albeit somewhat repetitive at times) and not difficult. Weekly response memos on the reading and in-class discussions were kind of annoying for me because I didn't feel like I could make a good argument and address most of what we'd been discussing in one page. \nProf. Shedd is not a very good lecturer and it's hard to write down cohesive notes as she talks. She usually lectures with powerpoint, which helps somewhat with organization, but she never really goes in depth to explain theories and readings. Most of the class is class discussion, either talking in groups or as a class, which is usually kind of disapointing. I definitely feel like I never got anything additional out of lecture that I didn't get from the readings, which makes class feel pointless. Two guest speakers, Prof. Carl Hart from the psych department and a NYC police officer were really great. \nAlso, there is a more of an emphasis on the sociology of crime than on law, which may be good or bad depending on what you're more interested in learning. \nWorkload:\nNot too bad, weekly reading and response memos, take home case study analysis midterm assignment (5-7 pages), book analysis (5-7 pages), court observation and review assignment, take home final\n"
        },
        {
            "course_name": "Race and Place in Urban America",
            "review_date": "January 17, 2010",
            "review_content": "\nThis a difficult review to write, because I adored Professor Shedd personally and the subject matter - the inner-city black experience - is right up my alley, so to speak. But see, there's our first problem: the class is called Race and Place in Urban America, yet the focus is almost entirely on the black urban experience. With that said, we covered some under-appreciated topics within this scope, such as particular challenges to the black middle class. It's a lecture course, but with lectures that often consist of breezing through Power Point slides - look, here's Weber's definition of the Ghetto, and there's Merton's Adaptive Types - before devoting the majority of class time to \"discussion\" (read: debating every student's personal opinion). The course is light on theory, and more heavy on considerations of qualitative and quantitative research methods. A better balance of the two, in my opinion, could have helped some of the \"discussions\" grow into real, though-provoking conversations. Overall, the course was not *un*interesting, but the concept of \"place\" only seemed loosely tied to what was really the overall theme of the course (again, the black urban experience from Du Bois on Philadelphia at the turn of the twentieth century to current trends in gentrification in Harlem). Professor Shedd is charming in office hours (talk to her about her own research!), and the course will hopefully improve with age, becoming more theoretically robust, thematically integrated, and intellectually challenging. Until then, I recommend shopping this course and getting a feel for whether it's for you. \nWorkload:\nReading: yeah, there's reading, but very little of it is heavy (it's practically a Foucault-free scene overall). The urban ethnographies (Du Bois, Elijah Anderson, Mitchell Duneier) are really what made this course worthwhile (to me). Midterm research paper, tedious 2-page weekly response papers that were somehow supposed to contain a considered and well-written argument (okay, I admit to having an attitude about weekly response papers!), short ethnographic research assignment, in-class final that basically required that you prove you did the reading throughout the course. No really complex thinking or risk-taking is involved, which means it's not hard to do well, but more difficult to feel like you're processing and engaging and growing as student and a writer. \n"
        },
        {
            "course_name": "Race and Place in Urban America",
            "review_date": "January 02, 2010",
            "review_content": "\nThis class was probably my most interesting class all semester.  As a first-semester freshman, I had a love/hate relationship with it at first.  I struggled to understand some of the more theoretical readings, but Professor Shedd's wonderful in-class discussions as well as the weekly memos really heps with forcing one to synthesize all the information presented.  Race and Place was a course which challenged my previous conceptions, and due to the semi-ridiculous workload I came away with a great understanding of the important literature in the field.  There is a lot of reading, but all of it is very interesting.  I didn't always do the readings on time and it didn't matter, I ended up with an A in the course.  Professor Shedd is very engaging, intelligent, and nice, although she can be a bit intimidating when meeting with her one-on-one.  I enjoyed both the professor and the course and found Professor Shedd quite intelligent.  The assignments she gave really helped me to understand the themes of the course, and I am considering taking her other course just because she was such a wonderful teacher.  \nWorkload:\nHeavy, but doable.  A lot of reading.  Weekly memos to synthesize reading, one 7-10 page midterm paper on topic of your choice, a time-consuming but fairly easy and very interesting ethnography, a Harlem tour reflection paper, a movie review, and the final.  The memos were actually what I had the most trouble with.  Professor Shedd is a fair grader and the final will be no trouble if you do most of the reading and pay attention in class.  \n"
        },
        {
            "course_name": "Crime, Law, and Society",
            "review_date": "May 20, 2009",
            "review_content": "\nI don't usually write CULPA reviews, but I decided to on this one because the previous reviewers were a little too harsh. I took Professor Shedd's course this semester and genuinely enjoyed it... although it's true that she wasn't teaching any math or statistics in this context.\nTo start off, while I love Professor Shedd, it's true that she's not the best lecturer. She used PowerPoint and when she would elaborate on various points I often found it difficult to take coherent notes. This didn't really bother me, however, because you really didn't need your notes for any of the assignments (there were no in class exams - just take home assignments which you just needed the readings for). She also didn't actually lecture all that much. Even though this was a \"lecture\" course, she devoted a huge amount of time to class discussion (which counted 10% of your grade) and she did a great job raising interesting questions and getting people in the class talking. My class had a bunch of outspoken GS students with \"real world\" experience, and this generally made class interesting. I should also mention that she took attendance almost every class.\nI thought Professor Shedd put together a really interesting syllabus. While some of the readings were redundant (too much about race & crime), the workload was not very intense. This is the only sociology course I've taken, but I never had any problem completing all of the reading - which consisted mostly of journal articles & book chapters - and it was definitely less than what you'd find in a history course. The readings were also interesting; I especially liked this book assigned on Willie Bosket that we read over spring break. Besides reading, we had to do a total of 10 memos, in which we \"reflected\" on that week's material, brief a supreme court case, complete a case study analysis, write a book review, attend and summarize a criminal court proceeding and complete a take home final exam. She had relatively high standards on all written work, but I didn't have trouble getting A's as long as I wrote a few drafts (she won't accept sloppiness). There also are sooooo many assignments that if you don't do well at first you can definitely improve!\n\n"
        },
        {
            "course_name": "Statistics and Methods",
            "review_date": "January 19, 2009",
            "review_content": "\nOne word: horrifying.\nShe tried to teach math on powerpoint and did not use a marker ONCE the entire semester. She taught math by reading from her slides.\nThe program she was using, stata, was new to her and she was completely lost. She is nice and tried, but seriously, she was more confused with the program than we were. Whenever someone asked a question about it, she would send them to the TA.\nAs if that were not enough, she was a tough grader. Most people did not do very well and when I talked to others in the class they hated it. The material itself is not difficult, especially for anyone that has some statistics knowledge. She just can't teach, so expect to teach yourself.\nFor someone with very little knowledge of stats, the midterm and final were very difficult. Also, there was a stata project due the same day.\nShe is nice, but confused. If you dont want your grades to suffer, take it with someone else. I suggest Daniel Miller.\nWorkload:\nHomework assignments every week, midterm and final, stata project at the end of the semester\n"
        },
        {
            "course_name": "Statistics and Methods",
            "review_date": "April 21, 2008",
            "review_content": "\nSo I was pretty horrified when I realized that no one has taken the time to warn others about Professor Shedd. She's new and has the potential to be great in a few years, but for the time being..please, just stay away.\nShe tried to teach statistics by lecturing from powerpoint. LECTURING from POWERPOINT. At no point did she actually pick up a marker and work a single problem out on the board. Does she know she was teaching math?\nShe used STATA, a stats computer program, but when we would ask questions about how to work the program she would tell us to ask the TA because she was still trying to figure it out herself. Gee, thanks.\nI thought I might be crazy until I started talking to other people in the class. Everyone HATED it. A fellow sociology major who loves stats and has taken many stats classes before got barely got a B- after busting her ass.\nJust spare yourself.\nWorkload:\nOne homework assignment due every week, impossible midterm, final, and STATA project (due the same day you take the final)\n"
        }
    ]
}