{
    "prof_info": [
        {
            "prof_name": "Wendy Schor-Haim",
            "prof_id": 4531,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English (Workshop): Legacy of the Mediterranean I",
            "review_date": "September 04, 2013",
            "review_content": "\nI took Legacy of the Mediterranean for First Year English and I really loved Wendy. She has such an upbeat and happy vibe every class. Her enthusiasm and passion for teaching is great. She is very friendly and approachable and is always willing to help students. We read Euripides, The Bacchae, Hymn to Demeter, the Odyssey, Dante's Inferno, The Canterbury Tales, The Book of Margery Kempe, and a few short readings here and there. Even though I found some of the reading challenging once we went over it in class I understood it much better. I also really liked that the class size was small, it was about 14-15 students. So far Wendy has been my favorite professor at Barnard and I know other girls in my class really loved her too. I thought her comments and meetings were so helpful and I feel like after this class my writing improved. I definitely recommend taking a class with her! :) \nWorkload:\nReadings every night, 2 essays and drafts, and sometimes we had to write a reaction or analysis to what we read,  and a final research paper. \n"
        },
        {
            "course_name": "Legacy of the Mediterranean (Intensive)",
            "review_date": "March 20, 2010",
            "review_content": "\nI don't understand the previous review of Prof. Schor-Haim. I have taken two courses with Prof. Schor Haim and they have been the best classes I have taken at Barnard. My writing has improved immensely in the past year and it has been because of her true desire to help her students. She has a real passion for literature which is evident during class. She is very accessible and truly cares about each of her students. \nAlthough this course was difficult, in the end it was definitely worth it. The assignments require you to really think and analyze the texts. We had reading assignments every night and had to write a couple of pages on each night's reading. In the end though, these writing assignments were great because when the time came to write our papers, we already had written ideas with Prof. Schor Haim's comments, which made coming up with a topic for a paper a much easier process. Class was more of a discussion where everyone shared their opinions on the text and she gave us information about the time period of a text and other facts that would make the text easier to understand. I highly recommend this class to any freshman who wants to improve her writing while having professor who truly cares about her students. \nWorkload:\nReadings every night and a 1-2 page reflection collected at the end of each class, 2 essays with drafts and a research paper.\n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "December 13, 2009",
            "review_content": "\nMy roommate and I were in Prof. Schor-Haim's class last year and it was one of the worst experiences either of us has had at Barnard (and, from what I inferred from the other students, this was the general consensus). Prof. Schor-Haim is not qualified to teach English literature and it showed. She has degrees in Medieval History from NYU and consequently her level of knowledge about literature from the seventeenth century to the present was less than you would expect from a Barnard professor. On one memorable occasion, she taught us about the Rationalist philosophers from the Wikipedia entry on Rationalism. She also definitely held several classes on a work that she had not finished reading (if there were two days devoted to it on the syllabus), and sometimes assigned us supplemental readings she had not herself read, including the worst piece of criticism I have ever read from our edition of Frankenstein. (It turned out to be about Kenneth Branagh's movie version, as it happens.)\nHer ability to lead a discussion was also lacking. We spent most of our class time reading long passages out of the books for no real reason. I did not feel that class in any way enhanced my understanding of the works of literature. Her approach to essay writing was equally dismal. She treated us as though we were freshmen in high school, not in college, and allowed us very little intellectual freedom, sometimes punishing students for not writing about what she personally found interesting.\nThe syllabus for FYE: Legacy of the Mediterranean is not great, and the class is not structured well, but a good professor would have been able to take the less-than-ideal syllabus and make something worthwhile out of it. Prof. Schor-Haim failed miserably at this task.\nAs my roommate just put it: it was literally the worst.\nWorkload:\nIt fluctuated. Sometimes there was a lot (Paradise Lost), sometimes not so much (Candide). For the first few weeks she made us do ridiculous, busywork-type assignments but those faded out. She was overbearing when we did our research papers -- I appreciate a professor wanting to help and offering suggestions, but at a certain point I want to be able to do my own work, which was difficult with her breathing down my neck. Honestly, it wasn't terribly challenging, but it was frustrating, as many of the critical readings were not great and many of the texts were things that a lot of us had read before (Candide, Frankenstein, etc). Two essays and a research paper.\n"
        },
        {
            "course_name": "Legacy of the Mediterranean (Intensive)",
            "review_date": "November 19, 2009",
            "review_content": "\nI can honestly say that this class was one of the few that I enjoyed this year. The class size was very small and the professor was so eager to help her students. She did give a lot of mini assignments but they were all to help you prepare for the final essays. We read books like the hymn to demeter, The book of Margery Kempe, Inferno, and the Bacchae. \n She is a tough grader but fair. She is so interested in what she teaches you can tell she is very passionate. The topic itself wasn't all that interesting all the time but she helps you analyze it to understand it better. \nWorkload:\nTough but doable, 2 final essays, various reaction and analytical 1-2pg assignments and a research paper. \n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "November 13, 2009",
            "review_content": "\nEssay Writing is a wonderful class and Professor Schor-Haim makes it even better. She is willing to speak with all of her students and really wants them to succeed. I recommend this class to any student interested in learning how to organize their thoughts and create the best essay possible. The focus is on short essays written by essayists such as Susan Sontag, Annie Dillard, and Langston Hughes. The first essay is an interpretational assignment (giving your interpretation of an essayist's argument). The next two are more personal. Professor Schor-Haim is open to all types of writers and will help you as much as you need. Classes are extremely relaxed. One word to describe this class: enjoyable.\nWorkload:\nWeekly reading assignments and short (1-2 pages) responses. Three essays - three drafts of each. Two meetings with Professor Schor-Haim to discuss the essays. All in all, a light and interesting load. Very focused on your personal thoughts and interests. Take this class!\n"
        }
    ]
}