{
    "prof_info": [
        {
            "prof_name": "Patricia Lespinasse",
            "prof_id": 2667,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Caribbean Diaspora Literature",
            "review_date": "December 22, 2010",
            "review_content": "\nChill. So chill. I mean, don't take advantage of it or anything, but her class was like a book club where you could say anything you damn well pleased, inane or brilliant. Her approach was fairly hands-off: each week a different student gave a short presentation on the book, and then basically led discussion for the rest of the two hours. In theory a good tactic for a seminar, although in execution you often feel cheated, either because no one read the book and won't answer any questions, leaving the presenter flailing with no rescue from Lespinasse, or simply because the presenter is giving a half-assed take on the novel and the professor refuses to pipe up. Her actual lectures, which she deigned to start off the first few classes with, were quite interesting - it's a shame she trusts us to carry the class, because we usually couldn't. But she's quite nice, overall, and again: chill as hell.\nWorkload:\nA (sometimes quite long) book a week paired with a page-long informal response, one non-research paper under ten pages, and a fairly long take-home final.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 05, 2006",
            "review_content": "\nI took Pr. Lespinasse in Fall 05. She is very helpful and very nice inside and outside the classroom. She is very approachable and helped me a lot even after the semester was over. Pr Lespinasse is demanding in terms of quality of work that you submit, however, this is a writing class and if you won't put in the work you will not learn how to write academic essays. \nWorkload:\n4 major essays. Don't be late with them and drafts.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 03, 2006",
            "review_content": "\nI found this young Professor to be dynamic, knowledgable and motivated to help you.\nI particularly enjoyed the group working sessions, how well she communicated what was required.\nI absolutely hate most writing courses - I loved this class.\nWorkload:\nMEDIUM - 4 Papers (w/ required drafts)- In class assignments or group work in most classes\nDO NOT take this course if you have a pretty loaded schedule (work + school) - She is pretty serious about the deadlines.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 08, 2006",
            "review_content": "\nI took this professor last semester and she was not at all like what the other reviewers said.  She was quite knowledgabe and i learned alot.  the conferences were actually the best part of the class.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 07, 2005",
            "review_content": "\nHorrible. DO NOT take her. Comes unprepared, likes only boys in class, grades our papers in class giving those papers only 4 min of her attention, useless in class and during conferences. \nShe is a waste of time and space. Unbelievable that she's allowed to teach here.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 17, 2005",
            "review_content": "\nTHE WORST. really very under-qualified, and knows it, and feels insecure and therefore is on a weird power-\ntrip. The most painful class I have ever taken at at\nColumbia by far! once we did an activity where we cut up our papers into paragraphs, put them in an\nenvelope and traded with someone else and then had to see if we could guess the order of the paragraphs and recreate their paper. ON the floor. Terrible. \n"
        }
    ]
}