{
    "prof_info": [
        {
            "prof_name": "Amy Trompetter",
            "prof_id": 245,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Costume and Mask Workshop",
            "review_date": "May 15, 2004",
            "review_content": "\nIn my opinion, Amy Trompetter is a crazy woman who should not be teaching classes.  She seems to have no sense of a syllabus, in my opinion she grades based on whether or not she likes you, she changes her mind every five minutes and expects you to know what shes thinking. Really, don't take this class, I thought it would be fun. And it was. Once.\n"
        },
        {
            "course_name": "Acting Puppets and Mask",
            "review_date": "March 17, 2004",
            "review_content": "\nFellow students and I have commented amongst ourselves that we are very fortunate to have Amy as a professor here at Columbia-Barnard undergrad theatre.  Puppetry and mask performance are not commonly taught in college theatre programs, but I have found that they can be exceptionally helpful in one's work as a performer.\nThrough puppet & mask technique, Amy teaches about simplicity and clarity in movement, use of restraint, and a sort of humility that comes from putting all of your focus into animating an object (instead of focusing on yourself).\nAs another reviewer commented, Amy's teaching style is really grounded in the practical.  That is to say, the practical application of performance techniques.  Things can become confusing if you talk about ideas and techniques in theory.  However, by actually trying out your ideas and showing Amy what you have in mind, you will find a very productive learning experience.\nAmy seems very concerned about her students' work, and she responds well to students' enthusiasm and positive energy.  She is incredibly objective and offers pin-point feedback for presented work; she does not at all play favorites when it comes to giving feedback and constructive criticism.  This, I find, is a really great thing, since it means there's no chance for slacking off.  She really teaches students to just keep trying and trying in order to find something that works, something that reads well to the audience, something coherent and clear.\nWorkload:\nClass meets twice a week.  Work is a mix of practical and theoreitcal.  Some response papers to outside theatre viewings, plus some basic researching, journaling, and storyboarding in order to help develop performance presentations.  Midterm & Final performances, plus other scene work.\n"
        },
        {
            "course_name": "Rehearsal and Performance",
            "review_date": "March 11, 2004",
            "review_content": "\nWe are lucky to have Amy here in our theatre department.  Puppetry is a theatre art form not normally taught in college departments, but at Barnard-Columbia was have the opportunity to learn from one of the leaders in the field.  It is a very humbling art form and it further informs all of your work as a performer.  Amy teaches about finding the balance between restraint and action, and expressing an idea as simply and directly as possible.  She is very good at helping students find their individual strong points and working from there, but this is provided the student-performer is willing to listen to what she has to say.  \nAmy is indeed a character and has a very particular, if unconventional style teaching.  She's not your average Ivy League professor, but the training and teachings she imparts are on a very high level.  She has high expectations of her students, and this pushes them to produce quality work that they may nit have thought to produce otherwise.\nShe has traveled around the world, having visited the Middle East, India, China.  From tiny villages to larger cities.  She has video taped examples of traditional theatre from these non-Western cultures, and she has brought the ideas of these other theatre forms to influence our work here at Columbia-Barnard.\nAmy's realm is the realm of doing.  The best way to learn from her is to learn by actual practice.  The value of her teaching is found in the practical work.  At a school where so much of we are taught is theoretical, it is refreshing to have a professor who is so well-grounded in the practical.\nShe uses a style of blind justice and does not play favorites.  This is helpful preparation for a career in the real theatre world.\nWorkload:\nWhat you give is what you get.  It's not about required reading so much as participation, a willingness to listen and accept constructive criticism, and self-motivated preparation.\n"
        },
        {
            "course_name": "Theater and Society",
            "review_date": "January 14, 2004",
            "review_content": "\nCrazy.  Amy Trumpetter is one of the most disorganized, unapproachable, and unhelpful professors in existence.  Did I mention that she's crazy?  She'll stare off into space as if something catches her eye, but nothing is there.  Also note that this class is nothing like the course description.  It claims to tackle concepts of theatre as it relates to society, but is truly nothing more than a nonsensical sequence of puppet shows and poorly-acted scenes...and not the fun kind of puppet show.  You do have to get up on stage for this class.  I like acting, and I still despised most of these exercises.  The other teachers, Denny & Steve, are not so bad.  Denny attacks the class in a more conventional style and Steve is great at commedia, but doesn't really know how to instruct (he means well though).  Just don't take the class.\nWorkload:\nNot bad: a couple papers on really simple topics, reading a couple plays, take-home final, but arbitrary grading, so beware.\n"
        },
        {
            "course_name": "acting lab",
            "review_date": "December 08, 2002",
            "review_content": "\nAs another reviewer has said, Amy is talented. She deserves props for being good at what she does. She should stick with that. Her ability to impart knowledge to others is non-existent. Furthermore, her scattered approach to everything is confusing and frustrating beyond belief. Her assignments are ridiculous, not in that they are difficult, but at 11 PM the night before they are due she will send an email to the whole class changing the entire premise. You never know what to do. Her criticism is harsh and often so indecisive that she cannot be understood at all. While Amy is a talented performer, this class is not worth taking. Stick with another acting lab...you will learn much more. \n"
        },
        {
            "course_name": "Rehearsal and Performance",
            "review_date": "June 09, 2002",
            "review_content": "\nAmy is filled with brilliant ideas. She is not the most capable person with articulating them to her students, though. And to top it off, she is completely scatter-brained; I've had her three semesters in a row and she still calls me ANYTHING BUT my name. She's very forgetful and the most mercurial person you'll ever meet. Don't be surprised if the night before a major project is due she requires to make significant changes. She also has an odd way of making \"suggestions\" in passing and you'll suffer the penalties if you don't catch on quickly enough to utilize them in your own work. Don't get me wrong, I think Amy is brilliant as a puppeteer and a scenic designer; however, her teaching leaves a lot to be desired. And she does a poor job of directing actors. Unless you're a mind-reader, you may never understand what it is that she is trying to express to you. Come see her plays, just don't be in them.\nWorkload:\nRehearsals four to five nights a week and sometimes weekends; some outside research may be necessary\n"
        },
        {
            "course_name": "Intro to World Theatre, Intercultural Set Design",
            "review_date": "December 31, 1999",
            "review_content": "\nAmy really has a screw loose. She is that stereotypical type of theatre professor who wears a million layers of black linen, scarves, and weird shoes that look like clogs. She doesn't know how to organize a class or how to assign work. Basically, she was hired because she is good at what she does -- theatre design -- but she doesn't really know how to impart that to others. Ignoring all of this, however, Intro to World Theatre was a great class. She is basically the hostess of a variety of performers from various theatre traditions. Forget the fact that she speaks condescendingly to students, performers, or basically anyone. Forget the fact that she doesn't know how to lecture. Just sit back, relax, and enjoy some great actors from around the world who you would never take the time to go see but who are definitely worth it. Consider it free theatre as a class.\nWorkload:\nA few short papers.\n"
        }
    ]
}