{
    "prof_info": [
        {
            "prof_name": "Arlin Crotts",
            "prof_id": 2771,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 Earth, Moon, and Planets; Beyond the Solar System",
            "review_date": "June 01, 2014",
            "review_content": "\nProfessor Crotts is quite possible the worst professor in the history of Columbia. He will \"lecture\" on one thing, make you buy a hundred dollar book on another, and test you on something complete different. His class is useless. He goes on long tangents that has nothing to do with the lecture or anything relevant at all. He teaches science in class but has math everywhere else.  Please avoid this class if at all possible. \nWorkload:\nHomework sheets, a few quizzes and tests. \n"
        },
        {
            "course_name": "C1403-C1404 Earth, Moon, and Planets; Beyond the Solar System",
            "review_date": "December 06, 2011",
            "review_content": "\nI remember the incident incident referred to in the May 16, 2011 review, and that is not what happened at all.  The student asked a question, and the professor asked to come back to it.  When he did a few minutes later, the student had fallen asleep.  That particular student fell asleep often.  The reviewer seems to have been unconscious too to have been so unaware of what was happening.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n\nWorkload:\n.\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "May 16, 2011",
            "review_content": "\nArlin P. Crotts. Say that name out loud. Doesn't it sound... unfortunate? \nI hate to be mean, but wow. Professor Crotts clearly loves astronomy. He just hates teaching it, especially to hapless art and humanities majors. (Although my TA had nothing good to say about his graduate level courses, either.) \nI felt like I was being taught by the \"uncool professor who just doesn't get kids these days\" from an ABC Family show. Actually, that's pretty much it - think of a way less understanding, relatable, and fun Mr. Feeny and you have Professor Crotts. (Right down to the tweed jacket and glasses. Though, where Mr. Feeny had a costume designer, Professor Crotts just has himself. Not as good.)\nSo now you know Professor Crotts. What about the course, you ask? Well, it's pretty much what the previous review say. He blasts through the slides, which have little relation to the homeworks and quizzes, and yells about laptops. (Or, as he called them at one point, \"electronic rectangles\".) On the off chance that someone actually has a question, he will take far too long to answer it, if he answers it at all. (My personal favorite: A guy in the front row asks a question. Professor Crotts responds, \"Well, that's really complicated and I don't have the time here to answer it, but....\" and goes on to explain the answer for 15 minutes. When he is finally finished, he turns around. The guy who asked the question has fallen asleep.) \nOverall, take this class if you're good at math (because all of the homework is math), you need to get your science requirement out of the way, and you really can't get another astronomy lecture to fit your schedule.\n\nWorkload:\nA few homeworks, quizzes, a midterm, and a final. Sorry, I took this class last semester and I've blocked out the workload. In fact, I've blocked out most things related to this class. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "November 29, 2010",
            "review_content": "\nProfessor Crotts' class will remind you of that painfully awkward presentation given by the nerdiest kid in high school. The kid may have had a cool topic, may have been incredibly passionate about it, but had zero delivery skills. His lectures are disjointed, hard to follow, easy to sleep through, and advisable to miss. Take this class if you want a chance to get a good grade - he's fair about his grading and often dropped a quiz the entire class bombed. \nThe tests often have difficult questions that we didn't cover in lecture. Then again, nothing was covered in lecture that is at all relevant to the tests - mostly math/physics-based but not too challenging if you study the homework. \nWorkload:\nmidterm exam, final exam, 7 problem sets, 3 quizzes. drops the lowest hmwk and quiz grades. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 07, 2010",
            "review_content": "\nI thought the last review was very kind to Crotts. I was in that same class and would describe it as one of my worst experiences at Columbia. He is definitely an intelligent man, but he is not a good professor. I am surprised more reviews have not been written about him. At first I thought that he was just so nerdy and so far removed from normal social interactions that he did know how communicate with people. However, sometimes he just seemed rude. He could be so impersonable and cold that it was beyond social ineptness. I felt uncomfortable talking to him at any time. He was rude before class, after class, in office hours, through email (if he ever chose to respond). A number of students said that he never responded to emails. This is true. If I or anybody went up to him in person and asked about the email, he acknowledge receiving it, but never provided an explanation or apology for not emailing back. I guess it was his way of forcing you to go to class...\nIn class, he just went through the packets and avoided eye contact with the class. Then he gave us problem sets that were primarily math-focused. However, he never covered any math in class. So it was up to the students to learn it on their own; for some that was easy and for others not so much. The text does provide the formulas and basic applications of them, but sometimes Crotts' problems were more involved. There was no TA to go to for help and the professor didn't seem interested in anything involving that class. Then, half way through the semester, after the midterm, he told the class about the help room hours run by the grad students. The grad students are great; they offer help to all astro classes for an hour twice a week. The course is not that hard, but some people just are not suited for astronomy especially when it is taught by someone who is so distant and uninterested.  If you can avoid this class, do so. I hear Applegate is much better. On the bright side, Crotts seems to be a fair grader. Unlike most classes, the final exam is not most of what your grades depend on. He weights the exams, quizzes, and hmwk reasonably and there are a lot of opportunities for extra credit.    \n\nWorkload:\nmidterm exam, final exam, 7 problem sets, 3 quizzes.  drops the lowest hmwk and quiz grades. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 20, 2009",
            "review_content": "\nEvery single class, Prof. Crotts hands out his powerpoint in a stapled packet, then presents it. 100% lecture here, 0 class involvement - which is fine for me, but some of you might not like that there really isn't much chance to participate unless you raise and wave your hand around and beg for a question/comment. \nI actually thought Crotts was sorta funny, but since this is probably your basic level science requirement class, you have a loooootttttt of people who a.) don't EVER come to class b.) just check their email/Facebook on their laptops. The hilarious part about this, is that Crotts would get LEGITIMATELY angry when people would have their laptops out for the last month of class or so. What made it funny, is that the people checking mail etc. would shut it, but the people who actually took notes via their computers would feel guilted into shutting their screens down because of Crotts \"rage!\" \nThe lectures aren't particularly exciting, but I always thought there were a few interesting points brought up in each lecture... Crotts is basically the guy getting credit for pinpointing where ice is located on the moon by NASA, so say what you want, but he's obviously extremely intelligent. Unfortunately, I don't think he's able to articulate this intelligence in lecture that well, but he knows what he's talking about none-the-less. \n80% of the homeworks (7 of them) and quizzes (~3) were math ONLY. Basically, he used what we had \"learned\" in class as a medium through which to give us physicsish problems that weren't usually too hard to figure out if you thought about them. So, going to class was of no difference. Those who were good at math did well, those who weren't struggled. \nEverything is handed out/announced in class, and Crotts did not announce/use his email for anything except a couple of changes about a homework/quiz. I sent him 3 emails this semester, and all fell on deaf ears. This method of giving HW/quizzes is his indirect way of forcing you to class... that is, if you don't have a buddy to join you. I had to go to every class just to make sure I didn't miss an assignment or anything, but those who knew others in the class were able to skip and just get the info from his/her friend.\nI know most of this sounds negative, but it's just the objective side of the class. Subjectively, I thought he was a good guy who you could talk to, although it would be slightly intimidating, I would assume. Aside from the homeworks, I never found it necessary to work outside of the class. Even the quizzes/tests didn't require more than 30-1hr of prep., because again, they were math based. Soooo, the work level is low, and not very difficult. I would say that last sentence is the most important for those who just care about banging out a req. painlessly.\nTake it: If you want a class with a curve, that you don't reallllly have to go to everytime, and that doesn't require much time outside of class. If you're good at math/analytic thinking.\nDon't take it: If you really looooove in depth astronomy and discussion of it... or if you can't deal with lectures for the entire class. Or, if you really struggle with math conceptions/application.\nWorkload:\n7 problem sets, 2/3 quizzes (lowest of the 9/10 dropped... he was ambiguous about one thing, so I don't know if it was a test/quiz/PS/ditto/etc...). 1 midterm, 1 final exam (cumulative) Midterm median was low/mid 70s. \nFelt very very light. \n"
        },
        {
            "course_name": "Observational Astronomy",
            "review_date": "December 31, 2005",
            "review_content": "\nThis class was very possibly the worst class I have taken as a Physics and Astronomy major - and I can cite enough reasons why without even referring to Prof. Crotts's hygiene and personality.\nYes, Observational Astronomy involves the rumored class trip to MDM Observatory in Arizona - that was the reason I took the class. But the trip was in the middle of midterms, and Crotts did his best to teach nothing, leaving the 2 people on the class with previous observing experience to teach most of the basics of telescope use.\nThe lectures were horrible. He delivered information in a soporific monotone after handing us photocopies of the transparencies that he has written nearly every word of the lecture on. Despite this, he often fell silent (once for over 7 minutes) when he was trying to figure out how to explain something to us. He usually failed to get his point across - you could sort of sense he knew something but you couldn't tell what it was.\nThere were 2 projects that were the main part (70%) of our grade. They were both due during finals. Much of the work on the projects (data reduction, working with Linux operating systems and IRAF) were things that half the class had not encountered before but were not discussed during lectures or in homeworks. Because Crotts didnÂ’t give us our data or discuss our projects ahead of time, most of the work was done during reading week and even into finals.\nI had been warned against taking this class. I wish I had listened. With another professor it could be fun and very educational but with Crotts it was a stressful disaster.\nWorkload:\n4 problem sets/reading questions (easy), joke of a final (10 multiple choice questions), 2 huge projects\n"
        }
    ]
}