{
    "prof_info": [
        {
            "prof_name": "Peter Johnson",
            "prof_id": 294,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 26, 2005",
            "review_content": "\nIs this a review section or a place to submit essays? Geez, we all have issues, we're human. Johnson knows what time it is, he's outside of the box just enough to be synical without really caring. If GSers are complaining about having only one choice for CC section, they should take it up with the CORE office, not culpa.info. Johnson was entertaining, if that matters. He cares about the class. Shop it if you can. \nWorkload:\n3 papers, take-home questions for midterm and final. A lot of reading. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 22, 2005",
            "review_content": "\nAlright now, it seems this has become more of a forum than a review site. No one is doubting that PAJ offers a deep and academically challenging class, he does. But we don't have to be defensive against devil naming PAJ bashing. Whoever cited platitudes against the warning review was also defensive. Why must we be defensive? Unless, we are protecting something? Why can't we say that this is an awesome class with a teacher that is not afraid to go against the grain, whether the grain is the commonly held viewpoint on an author, or your arguments, beliefs, or attitudes? You see my dear seeker of truth and knowledge, critical thinking with PAJ comes at a price. Let us not overlook PAJ's disturbing issues when they may have serious consequences on your life (CC is a two semester gig): this course offers a window into the previously untapped inner realms of your consciousness. Should you try to tap it with PAJ? The advantages are there for sure and other teachers, more centrist or younger, might be unable to get behind the text the way PAJ does. But he has issues, I swear, and if you're at all sensitive you will have to deal with them, that is, if you care about your papers and why you are taking the class. GS students are not obliged to take CC, nor Lit Hum. So when a GS student takes CC it is for a serious reason. So why is it that GS students only have one choice when there are roughly 55 sections every semester? Core office will tell you that it's the rules. GS students are older and they don't think it would make sense to have older GS students discussing Plato with 18 and 19 year-olds. But it might be important to note that if GS students could be in other sections, PAJ might not get such a bad rap. Forced to take his section was a serious issue for me. I find that some professors enjoy having older students in their class, and others don't. PAJ is likeable enough at times, but I definitely felt un-welcome often enough if what I was saying did not fit his game plan. Older GS students may have life experience which causes them to approach these texts quite differently from an 18 year-old. I didn't feel like he was able to work with this fact at all. And not that he was in the wrong for staying into the text the way he saw fit, but the way he dealt with it was sometimes curt, insensitive, therefore making him unwilling to engage in the student's mode of thought. Is there only one way to arrive at truth and meaning in these texts? Maybe he's just another victim of academic trends moving (blind) faithfully towards analytic philosophy which leaving no room whatsoever for logical positivism. So please, we've had enough of these fr(#*)(in' bandaid reviews trying to wash out the wounds with more praise that is unwilling to recognize the polarity of this professor. I did not say bi-\npolarity. Everything has its plusses and minuses. I sometimes felt targeted by this professor in class, in front of other students, who told me so outside of class. Maybe his earlier career teaching poly sci left him with an adversarial approach dialectic. A transparent ego I did not find, and yet this is the very fact, his sharpened tongue and intrepid mind, which made his class so worthwhile. I am just saying it comes at a price. Beware, that's the point. What is wrong with knowing these things before dealing with him? I'm not saying don't take the class; I'm just trying to prepare my fellow Columbians. I certainly wish I had read this before I entered the class. Maybe if PAJ reads these reviews, I'll take this class again!\n\nWorkload:\nread the other reviews...\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 20, 2005",
            "review_content": "\nIt's amazing -- if you omit the pulpit-pounding and the snide tone, even the _one_ negative review of Johnson reads like a list of reasons to take his class.\n1) He wants you to look at texts for points you might not understand.  And he wants to help you end up feeling like you got things straight by the end of the discussion, if you can.\n2) He's going to push you in class -- which means that if you disagree with his point of view, you'd better be able to stick up for yourself.\n3) He's going to push you on your essays -- which means that if you're just going to recite his own point of view back to him, you'd better have a better reason for it than what he gave you in class.\n4) He's a nice enough guy to sign a late drop slip or help you transfer to another CC section -- or did I misunderstand how our \"PAJ is the devil\" friend happened to be around for Machiavelli but not for the end of the semester when Johnson performed voodoo to get all those good reviews?\nIf you want to learn, and you don't mind doing some work, this is the section for you (it's easy to find this one -- it's always the latest one at night)\nIf you already know everything (including what the other people in the class are thinking and why) it probably is not.\nWorkload:\n3 Short papers per semester (too short!  on hard topics! expect late nights revising!)\nmidterm and exam not too tough if you have the time to study the questions he gives out.\nan \"ignorance offering\" of something you don't understand about the text every day.  if you're arrogant enough to thing you understand everything about _any_ text this part might be very hard for you.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 12, 2005",
            "review_content": "\nPAJ is the devil.  I'm not sure what class these other people were in.  Maybe he performed some kind of voodoo magic at the end of the semester to convince his students to write flattering CULPA reviews.  It seemed to me that PAJ cares about his students' thoughts and opinions about as much as you care about the bum on the corner.  If you don't agree with his interpretation of the material in class, you're obviously stupid, but if you don't disagree with his interpretation in your papers, you're obviously stupid.  Believe me, it's a lose-lose situation.  Not only is PAJ the devil, but he is also pompus, pretentious, and egotistical.  Take, for instance, PAJ's view on Machiavelli.  PAJ believes, and I quote, that he is \"the only man who truely understands what Machiaveli was trying to say.\"  Right.  You and the 13,000 other people who have posted the same idea on the internet.  \nWorkload:\nignorance offings for every class...but usually people just bring in a quote they understand so that they look intelligent when they at first pretend not to understand the statement and then, after an hour and a half of listening to people talk just to hear the sound of their own voices, suddenly sees the light and is suddenly no longer ignorant.  who cares about the rest of the work.  these things are enough to make you want to kill yourself.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 08, 2005",
            "review_content": "\n     Platitudes aside, I tell you: take Johnson's CC section.  After hearing the complaints that are unleashed upon other professors, I can not help feeling fortunate.  Look, CC is the core of this school's curriculum; a sustained encounter with some of the most influential ideas of human history.  This can only be the life-changing experience it should be if the professor is a qualified guide.  Johnson has been teaching CC for about fifteen years, and his interpretations of texts were not only thorough, they were provocative.  His approach was to break each class into an hour of discussion, in which students offered three questions to the class, followed by an hour or so of his own commentary.  Now, when I say he was provocative, I mean that these \"lectures\" were something to look forward to.  They were never what you thought, always against the grain- try Aristophanes as a progressive socio-economic theorist- they presented genuinely new ways of looking at these books, of making them new.  And this is what he expected of students in return.  Our papers were judged both for thoroughness and creativity.  I will certainly remember CC as an invaluable experience.  I highly recommend others study with Johnson that they may feel the same.    \nWorkload:\nUsual CC reading load.  3-4 papers a semester.  Mid-term and final blue book essay exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 05, 2005",
            "review_content": "\nWell now, if Jacob had to wrestle on the mountain with God, then you will have to wrestle in the classroom with Peter Maximus Johnson for sure. Now, is that a good thing or a bad thing? Well, both. While often one must learn \"to write for the professor,\" or TA, it's not so easy here. \nJohnson will question your every move with an analytical eye that is near menacing in a cleverly hidden way: academic evaluation, especially in philosophy, can be quite subjective. Of course, if you do enough outside research you should realize that all interpretation is subjective anyway. But you might be careful about outside research. You in a bind here. On the one hand Peter Machiavelli Johnson wants you to stick only to the readings he assigns, and on the other he wants you to have something original to say. Older GS students - who are obligated to take his section ONLY - may find this troubling, which leads to a more important issue: remove your life experience and approach the texts without your persona, at least for the first semester. This will be hard, but you can do it. It's fun. Your identity is probably redundant and played out anyway, try a different one on for size, or just become each author as you go along without preying on young male youths as you work through the early Greeks. This professor is loaded and out of control, but refined with a PHD from Cornell. This is all very sensitive. This is an amazing teacher. He is hip, truly, and so knowledgeable on so many subjects, even outside of his domain, and most of his lectures are on point. The open discussion in the class is enriching even if some people feel they don't get enough of a chance to speak. \nJohnson has been accused of playing favorites, and maybe even pacing the discussion, but it's for a good cause. But he uses praise and blame a lot in class, and this is disturbing. Should you just laugh this stuff off? Well, if you don't take things personally you'll be fine. There is a hidden smug angst coiled up inside his mind. Maybe Freud, better yet Jung, might be able to coax it out of him. \nBut in the meantime you will get a Spartan run for your money in this class. The class is not treated like an intro class at all, be prepared for Bs of some sort unless you're a philosophy major. Frequent demeaning mention of Harvard is curious, a staunch disdain for the more conservative schools (Rawls) of modern philosophy. Now I could go on, but the point is that  as a GS student your only option is to get a lawyer to get out of this section. So the advice is to approach the class and your papers delicately, take your voice out, and find out what this guy wants. Temper your own ideas with has already been said by the authors. Follow the logic, then interpret. This class will open your mind if you let it, and the professor can help if you intermittently suspend your ego. The 15% of you who do all the readings will actually learn something. \nThe rest will complain about how hard it is, or that the teacher should be sympathetic to athletes. Go to class, don't miss any classes. He takes the time out of his daygig to come and help advance the minds of student and to continue his love of teaching. It's not for the short money, so show up out of respect and it will help your grades, otherwise absence will hurt them.\nWorkload:\nThe first semester will require medication to actually do all the readings. The second semester is tough but doable. Grading is varied depending on your ideas and proofs. Three papers, midterm, and final. The tests are pre-empted with a study guide of five questions (2 on the mid, 3 on the final). Sounds nice to have the questions a week in advance, doesn't it? Wrong. The questions are broad and because you will read 34 (thirty-four) books in two semesters, plus multiple documents, you will be hyper-stressed to actually be prepared for them while still being ready for your other classes. Oh, you can re-write your papers, which is awesome.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 12, 2005",
            "review_content": "\nProfessor Johnson is a talented instructor who obviously cares deeply about the course he's teaching.  His busy life outside the university can be a plus and a minus for students.  On the plus side, his \"day job\" in public policy at a major industry association means that when it comes to practical politics he can tell you things from direct experience that you're never going to learn from a 25-year-old preceptor in another CC section.  On the minus side, when he gets overwhelmed at work it can take him very nearly forever to get papers, tests, and grades back to his students, and that can be frustrating.\nHis engaging manner in class certainly keeps everyone interested; on the other hand, his tendency to tease his students clearly sometimes doesn't always go over well with the thin-skinned (see the review above from a student who's convinced that PJ has a pathological hatred of athletes, a suggestion I find almost hilarious: clue time, folks, PJ picks on *everyone* for *something* and that's half the fun!).  With written assignments, his style of feedback is much more like what you'd get from a demanding but busy boss in the workplace than the collaborative \"good work, here are a few ways to do it better\" style you often see from other humanities profs at Columbia: he is a moderately demanding grader who tells you where he wants to see you do better but not how -- figuring out _how_ to do better, always under his very tight length limit for papers, is your job.\nUnsurprisingly this seems to go over a lot better with the older students in his section (he usually teaches the one section open to GS students) than with those who haven't had a million times worse from their bosses ten times over in the real jobs they -- oops -- haven't had yet.  I think it is fair to say, though, from conversations I've had with others, that everyone manages to eke pretty decent grades out of him by the end of the semester; it helps that he allows essay rewrites and is a more lenient grader on exams than on homework.\nDon't expect to turn in a merely competent essay and get an A.  You will be pushed -- and, frankly, you should be grateful for it.\nThe bottom line: a very good instructor, with some minor quirks.  So much better than a lot of other CC instructors, it's really hard to express in a CULPA review.\nWorkload:\nThree essays a semester; most of the work is getting them as short as he wants them while not making an utter hash of his challenging essay topics (always several to pick from).  You'll read some things in full that other sections read in excerpt (Republic, Politics, maybe one or two others) so be prepared for some late nights -- the daily index card with a question makes it hard (not imposible) to fake it if you get caught short on time.  Midterm and final with questions handed out well in advance; the preparation for these is nervewracking but ultimately they are not very hard if you study.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 08, 2005",
            "review_content": "\nI have mixed feelings about this professor.  Although I believe I learned more from him than I would have in any other CC section, and highly doubt I would have been as interested in the material with another professor, I must warn ATHLETES.  He is not fond of the athletically inclined here at Columbia, and is not afraid of giving his opion about how athletics is negative aspect of the school and takes away from \"the academic community.\"  As a varsity athlete, he will pick on you (he did so to my teammates in previous years as well as to myself and fellow athlete-classmates) and question your intelligence (openly in front of the class) and he is unsympathetic if you have to miss even a single class due to an away game (or another athletics-related conflict).  If you are an in-season athlete (it might be easier if you're not in season), I would avoid this section.  The lectures are amazing, but it's almost not worth the trouble.\nWorkload:\naverage CC workload + an index card w/ a quote and a question per class (this got to be annoying to keep up with).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 18, 2004",
            "review_content": "\njust to echo whoever wrote the review_dated feb.2004 (because that person was obviously in my class) johnson is one of the greatest teachers at columbia...suffer the horrible time slot to take this guy. he will seriously open your mind to new ways of looking at old texts and you will be so amazed at how such crap could be so applicable. he does not feed you the standard liberal bullshit. damn i loved this class\nWorkload:\n3 short papers, lots of reading.\non the final and midterm he basically gives you the essay topics beforehand!\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 15, 2004",
            "review_content": "\nJohnson is the man. He's relaxed, has a real life outside of  \"academia,\" and fosters an atmopshere where everyone speaks, and is reciprocally engaged by his lectures. We had a midterm study session where he bought us food, and we all sat around his living room. Then watched some TV. He is one of those professors who is willing to help you, specifically, and makes you love philosophy while living a normal life. \nWorkload:\nnot too heavy for CC, but readings every class and 3, 3 page papers\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 12, 2002",
            "review_content": "\nI loved having professor Johnson for CC. He is very open to student opinions yet sheds some light on the readings with a 20-30 min lecture at the end of class. He has an amazing capacity to relate all the readings to things happening in everyday life and he is a funny guy with a great personality. He is very honest and truely cares about his students and teaching. He is friendly and someone you can relate to on a personal as well as academic level.\nWorkload:\nquestions on a flascard about the readings (everyday) and 4 2-3 page papers, along with a midterm and a final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 13, 2001",
            "review_content": "\nProfessor Johnson's CC class was enlightening, to say the least. Not from any single class have I not learned something that has been or potentially could be life-changing. The discussions are lively, well guided, and fully participatory, always followed by a well-structured lecture that never fails to inspire continued thinking and discussions until the end of the class. What further exemplifies his teaching excellence is his efforts to extend teaching to all life lessons. He brings in stories from his personal life that are not only relevant to the readings but also extend the teaching of CC to all aspects of one's life. Often do we find ourselves fully absorbed in his anecdotes, like the one about his conversation as a teenager with his parents about rights and duties over a candy bar, before returning to the text with a far better understanding of the concepts than our own experience could allow. Try to get into his section by all means.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nThe best professor I've ever encountered, making for a seriously life-changing experience in CC. Heavily discussion oriented, yet always found the right amount of time to deliver a perfectly formed, provocative closing lecture. I'd often fall asleep during discussion, only to wake up when his lecture began. Welcoming of students' opinions, rewarding unique and well thought out ones on papers. A very fair grader. Relates to his students as friends, colleagues, taking a genuine interest in their pursuits. You would do well to try to have him as your professor. I'm the only person I know who actually liked CC, let alone loved it, and I believe Peter Johnson is the reason why.\nWorkload:\nA short question/reaction notecard per class. 3-5 papers during a semester. Midterm and final exams, for which a list of possible questions was handed out beforehand.\n"
        }
    ]
}