{
    "prof_info": [
        {
            "prof_name": "Kozak Mariusz",
            "prof_id": 13029,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 19, 2017",
            "review_content": "\nTake this review with a grain of salt, because I only sat in on one class with Professor Kozak before dropping the class. Just wanted to note that the way Professor Kozak teaches Music Hum is with two tracks: One day each week, he focuses on music and its qualities (the way you might in most Music Hums); the other day, he talks about the socio-political ramifications of listening. This involves all sorts of identity politics, talking about why we privilege Western, classical music over other forms of music, and breaking down that prejudice.\nProfessor Kozak seems like a great teacher. His emphasis on the social and historical background, motivations, and consequences of different pieces seems fascinating, and I'm sure he'll teach that well. There's also no question that his politics line up with a particular strand that's extremely popular on campus. For that reason, many will see his class as a breath of fresh air, and a way to make music relevant to the world as a whole/activism/social justice. On the other hand, those looking for a traditional Music Hum experience where they'll actually learn the core elements of music (albeit with far less focus on the historical circumstances that gave rise to that music) will find that this class spends only half of its time - at best - on that subject.\nWorkload:\nA 2-3 page essay every two weeks linking the social/political consequences of music to the music you've heard in class and homework. Posts on Courseworks once/week. Some sort of midterm and final/final project.\n"
        },
        {
            "course_name": "V2318-V2319 Diatonic Harmony and Counterpoint",
            "review_date": "August 23, 2015",
            "review_content": "\nI had Kozak for two classes, Diatonic I and II, and I thought he was the man. He explains things very well, and takes his job very seriously. He can be a little difficult to approach, but he covers each concept thoroughly, and is always willing to take time to explain things one-on-one if need be.\nCompared to the other sections of Diatonic I and II, our class was way ahead of them by the end of the year––which is a really good thing if you're moving on to theory III & IV.\nIf you're willing to put in work, you should definitely take theory with him. If you find that he is too by-the-book for you, then you have plenty of other semesters of theory to try professors that are more your style.\nWorkload:\nHomeworks for every class. Nothing too crazy.\nMidterms like a normal class. Final project, not a test.\n"
        },
        {
            "course_name": "V2318 Diatonic Harmony and Counterpoint I",
            "review_date": "December 18, 2014",
            "review_content": "\nThis is the worst professor I have ever had at Columbia. If you don't want to read the rest of this review just take away one thing: DO NOT ANY CLASS WITH MARIUSZ KOZAK.\nKozak does not teach. He makes the class read the textbook and we come to class and he says \"any questions? no? lets do some exercises.\" He forces us to work in groups when its absolutely meaningless to, because you have to do a lot of figuring out yourself. You will learn NOTHING in this class because he's not doing this class to help you learn; he literally just wants you to work hard.\nI approached him once asking why he took points off my assignment/tests and his response was literally... \"I... I can't give you an answer.\" Seriously? You tell me my answer is wrong and you can't justify why your answer is right??\nThis class was a horror to take and every lesson was ridiculous and frustrating. Every class we would walk away feeling confused. Take my advice and NEVER take a class with this joke of a professor. You would have learnt more if you just read the textbook (it's not like we did anything more than that in his class, except he would confuse us more).\nWorkload:\nHomeworks and pre-homeworks every week\n2 midterms and a final\nParticipation\n"
        }
    ]
}