{
    "prof_info": [
        {
            "prof_name": "Justin Marshall",
            "prof_id": 1827,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Lab in Fiction Filmmaking",
            "review_date": "December 04, 2003",
            "review_content": "\nJustin is very very cool, and not simply because he's buying the class beer after the last day of class, nor because he has a bizarre, hilarious sense of humor that will leave you stifling huge guffaws of laughter in class, but simply because he loves teaching this class. This is one of those few classes at Columbia that was one of the most pleasurable activities all week. If you're a film major, and you're interested in making films (as opposed to writing film criticism), you should enjoy this class, but Justin is such a perceptive, intelligent, articulate instructor that this class absolutely shone. Not only does he know everything you would need to learn in this class, but he knows it like the back of his hand. Even any criticism he may have for your work is expressed out in such an overwhelmingly encouraging manner that it's hard not to thank him secretly for noticing all the little details that you spent so much atttention on while doing your exercises. While he is not afraid to point out your flaws if he thinks you did something wrong, he will make sure to make you laugh twice as hard in class if he thinks you need cheering up. Justin made this class a pleasure. He doesn't really believe in deadlines for the video exercises, so it's easy to get an extension for your work if you want, but exercise caution. I think it depends on what kind of person you are, if you really need deadlines to finish your work, you may find yourself trailing in this class, but if  you're a steady worker, you'll be fine. Justin is by far one of the best instructors I've had at Columbia.  \nWorkload:\nThe video exercises for this class are among the most fun you can have doing schoolwork for a grade. Watch out,  start your final film in time, or it'll come back and bite you in the ass when it's almost time for the project to be shown in class and you're still shooting footage.\n"
        }
    ]
}