{
    "prof_info": [
        {
            "prof_name": "Nathaniel Farrell",
            "prof_id": 2445,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "December 27, 2007",
            "review_content": "\nNathaniel made this class one of the most enjoyable English courses I've taken so far. He supplemented the (somewhat patchy) syllabus with well-chosen and manageable readings; he was extremely flexible about meeting outside of class, providing valuable feedback and suggestions that really did help with the papers. It's rare to find a professor that alters the class to fit the students' needs without weakening the academic demands, but Nathaniel does this. \nIf you take CRCW I would highly recommend his section.\nWorkload:\nCRCW reading (assigned by the lecturing professor), 3 short papers (1000-1300 words), weekly reading in addition to the lecture reading, a few short written responses.\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "December 27, 2007",
            "review_content": "\nNathaniel made this class one of the most enjoyable English courses I've taken so far. He supplemented the (somewhat patchy) syllabus with well-chosen and manageable readings; he was extremely flexible about meeting outside of class, providing valuable feedback and suggestions that really did help with the papers. It's rare to find a professor that alters the class to fit the students' needs without weakening the academic demands, but Nathaniel does this. \nIf you take CRCW I would highly recommend his section.\nWorkload:\nCRCW reading (assigned by the lecturing professor), 3 short papers (1000-1300 words), weekly reading in addition to the lecture reading, a few short written responses.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 27, 2005",
            "review_content": "\nNathaniel is a wonderful wonderful teacher and person.  He is a fair grader and puts SO much thought into his comments.  He may take longer to grade, but its truly worth it.  If you take time to read his comments and meet with him, then you will really do well and learn a lot.  He doesn't ask for much really, there are no needless assignments or unfair workload.  At the beginning there are some managable readings, and maybe one or two response paragraphs.  The emphasis, however, quickly is put on papers and drafts.  His draft process is very useful, because  it forces you to right much of the paper and revise it.  He is also very aware of time constraints and understands if you need an extension.  The final paper, the CCP, can seem very daunting, which he knows, so he gives an inordinarily long amount of time to research and revise it, which is unbelieveable generous.  I give him an A++\nWorkload:\nFour papers, occasional readings, no needless busywork.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 16, 2005",
            "review_content": "\nIf you love thinking about or living in the abstract, as Nate once claimed that he does, you will love Nate's class.  However, if you're more into concrete ideas, you will be bewildered and frustrated.     However, Nate is really open to just about anything you want to write, which is pretty awesome if you have a great idea.  But on the other hand, if you have trouble, Nate is more than willing to meet you for office hours...he is extremely extremely nice, and tries to accomodate to your schedule.  As long as you know what to ask him, he is more than helpful with your essays, though his comments are sometimes overwhelmingly long. \n  I actually looked forward to this class, and the class discussions were pretty insightful and fun. Although, there was often confusion as to what the assignments required...or even as to what the actual assignment was, but as long as you tell him so, he tries his best to make it clear. \n   Overall, Nate is a really intelligent guy and he knows what he is doing, and you'll have an awesome time if you enjoy thinking conceptually and don't mind the occasional confusions.\n \nWorkload:\nnot much at the beginning...couple readings here and there, but a whole shitload more as time progresses.  By the end you write 4 essays: which includes 2 rhetorical essays, a  ginormous research essay, and a creative essay\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 23, 2005",
            "review_content": "\nNathaniel Farrell is nice. He understands the common Columbia undergraduate, as he was one himself not too long ago. He also understands that he is the instructor and thus must try to keep an objective distance to be able to comment and edit the essays fairly. He is a fun guy, but I don't think he intends much to be, he wants the class to be more structured and intellectual, so most of the class ends up pretty much covertly laughing AT him.\nAlmost half the class is habitually late, which doesn't help much to make him happy. However, he seems to maintain a somewhat happy mood most of the time, even when a student is ridiculously late, condescending, or belligerent.\nWhen students question his opinion or his ideas or his assignment, he talks too much. The more he talked, the more his students became more and more confused, and some of the time it led to misunderstanding in assignments, which can cause contention after a rough draft has already been produced with much hard work. \nBut do not get me wrong, he was able to produce a cohesive environment for his students to bond in the ostensible torture that is the Core Curriculum. \nIn terms of him giving comments on papers, sometimes it's almost bewildering, sometimes it helps, but to what extent is unbelievably hard to comprehend.\nHe, however, listened to students' concerns and would push back deadlines if the class had a desire for it. He would also make assignments a bit more experimental, making it a much nicer experience of one of the more unnecessary core classes. \nOverall, with knowledge that this was his first semester of instruction, is a FINE teacher. Definitely a Fun time, if it was nothing else.\nWorkload:\na reading and response per class for the first half of the semester, some days none at all, and the rest of the semester completely bombards you with three essays: one that is a research paper, and the last as a short creative writing assignment.\n"
        }
    ]
}