{
    "prof_info": [
        {
            "prof_name": "John Matthews",
            "prof_id": 2960,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "American Foreign Policy",
            "review_date": "February 15, 2007",
            "review_content": "\nWorst. Class. Ever. Thank god Joe Parent, teaches the class now. I don't know if Matthews is still around but if he resurfaces in a classroom STAY AWAY. The other reviews have said it all. The man's dead-pan delivery can put anyone to sleep. For a relatively small lecture class Matthews made no attempt to integrate discussions into the weekly lecture. The readings were decent (standard foreign policy articles culled from JSTOR) but I have no idea how they figured into his lectures. Worse, the grading is totally arbitrary and YES, you will end up with a B unless you suck up to the TA who, incidentally, turns out to be the dude who got kicked out of the GSAS poli sci department and made a big fuss about it. Go figure.\nWorkload:\nHonestly, the class occupies such an insignificant position in my Columbia career that I don't remember. In any case, you can do the work, or you can not do it. You can go to the lecture or not go. It doesn't make a difference.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "August 29, 2006",
            "review_content": "\nThe class was a waste of time and I would recommend taking another professor. You do not learn much and it could hurt GPA. Other students enjoyed Gottlieb's AFP class but he\nno longer teaches at Columbia. Therefore, you are stuck with one choice. \nWorkload:\nFair. Midterm, Policy Analysis, Final. Don't be surprised if you get stuck with \"B\" in the class.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "August 12, 2006",
            "review_content": "\nI agree with the previous reviewer. Matthews is one of the worst Poli Sci lecturers I have ever had, right up there with Raymond Smith. Don't be tempted by the lure of the once-a-week class unless you're prepared to deal with 120 minutes of excruciating boredom.  \nWorkload:\nMidterm, final, readings that are a bitch to locate online and at the library. Grading seems random so be prepared to be slapped with a B.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "June 11, 2006",
            "review_content": "\nOh my god terrible terrible. This class was SUCH a waste of time. It is a disgrace how little I learned in a class about our own country's foreign policy from a man who is a leader within the corporate world. His 2hour once a week classes were boring, with a simple outline read out by him (essentially thats what it was) instead of a deep intellectual lecture. He would list the major issues about the topic discussed (such as Economic policy, American Empire), as if he were making a list of major topics highlighted by the newspapers in the past year. In between points within the outline he would pause for like 5 minutes to see if anyone had questions. It almost seemed like he was praying someone would speak up so he wouldnt have to talk. It seemed to me he is just doing to the class to say that he is a professor at Columbia. \nHis class relied on a ridiculous amount of readings for the bulk of  any intellectual stimulus. Many readings were not really relavent and others were impossible to find. I felt that he threw together a list and expected us to read all of it. \nHis class only consists of a midterm and final both of whihc are basically solely based on readings. With heavy reliance on a huge list of readings and a terrible lecture class that did not reinforece the readings or even connect with all of them, its hard to get a good grade in this class. So you watse your time, get frustrated, learn nothing, and hurt your GPA. \nSkip Matthews. Take Am foregn policy with the other professor who teaches it.  \nWorkload:\nmid term, final, optional policy paper (if you choose it, your midterm and final are weighted proportionally less)\n"
        }
    ]
}