{
    "prof_info": [
        {
            "prof_name": "Claudio Lomnitz",
            "prof_id": 3716,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Borders and Boundaries",
            "review_date": "January 14, 2015",
            "review_content": "\nI took his Borders and Boundaries seminar. I found the lectures to be dry; there were really no main points given and the content was extremely Mexico-centric. I also found it completely troubling that Lomnitz rarely wished to stray away from the assigned readings. Bottom line: I found it difficult to connect with the seemingly random texts and walked away with very little from this course.\nThere were also no expectations set on the course. My advice is to approach him and specifically ask him what he is looking for through the assigned readings and final paper. During office hours, we was not very approachable and I walked away with little - if any insight on how to tackle the assigned readings and the overall themes of the course (which were never really outlined during lectures).\nIt seemed to me like each week was a sort of \"guess\" what we might talk about for the week. In grad school, I felt like this teaching style was rather elementary.\nAlso, be sure to confirm the assigned readings each week. The bibliography on the syllabus was scant and students often showed up to class having read the wrong texts (some of the readings were in excess of 500 pages).\nI really had high hopes for this course - unfortunately, the only course that I've walked away feeling like I was worse off in the topic having taken the course. \nComments on paper were far from productive; commentary was sarcastic and not very helpful. Students lacking prior anthropology work should refrain from taking this professor. Students are assumed to have prior anthropological work - if not, Lomnitz does not seem to be concerned about 'teaching' or even discussing basic anthropology concepts. I recommend this course to grad students who have prior work in this field - this is not a course to take if you have been out of school for a few years. \nWorkload:\nHeavy. Students are expected to post each week after reading each texts. Some texts in excess of 400/500 pages. There was no overall arching themes in the course - readings were all random and some of them were a huge disappointment. \n"
        },
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "May 14, 2011",
            "review_content": "\nThe Good:\n1. Hilarious guy. If you like corny jokes, he's the professor for you.\n2. He's genuine and he's completely interested in what the class is studying, even if for him it's really basic anthro content.\n3. Approachable, intelligent and more than willing to take questions and spend the time necessary to answer them.\nThe Bad:\n1. The readings and whatever Lomnitz lectures on are COMPLETELY DIFFERENT. I think the only full book I read was at the very beginning of the semester, because after I realized that what we discuss in class and what we read at home or not the same, I had no motivation to do the readings. Instead, I skimmed all of the rest and did perfectly fine.\n2. He goes off on ridiculous tangents that are more frustrating than interesting.\n3. This girl next to me would chew gum with her mouth open really loudly. It was gross.\n4. He wasn't prepared for a few classes and it was obvious.\nWorkload:\nRead a full book a week (ie: skim a book a week)\nTake-home midterms and finals (do-able)\nPostings depending on your TA\n"
        },
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "May 08, 2011",
            "review_content": "\nThis is an intro anthro class, so don't get your hopes to high for a tightly organized straightforward lecture series. As an anthropology major, I enjoyed the class. The readings were well chosen and well organized and explained in Lomnitz's lectures. He always came to class with an interesting question to grapple with and explain through the reading and his own work. Lomnitz keeps the room entertained, often making jokes or dancing. He also was good at keeping the room involved even in a lecture in one of those hamilton lecture rooms. He was very responsive to questions and requests. Some people complained about him being disorganized, but I think his less linear lecture style is more honest and more able to reach the depth necessary to talk about ethnography. Lomnitz is really smart and straight forward, and I would love to take another class with him. \nWorkload:\nA book each week that you can skim sometimes, and a take home midterm and final that are pretty straightforward. \n"
        }
    ]
}