{
    "prof_info": [
        {
            "prof_name": "William Sharpe",
            "prof_id": 1560,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Walk This Way",
            "review_date": "April 26, 2016",
            "review_content": "\nI don't know that I would recommend this course, but I certainly wouldn't discourage students from taking it. I think the organization of the class is just more enjoyable for some students than others. It's a different type of classroom experience. I think some students would agree that more planned instruction/discussion would have been appreciated during class time. We always started class with just any comment from the class, but with the vague and open-ended topics regarding walking that were discussed, I think some students just weren't sure where to start sometimes. This meant that the same few people ended up talking most of the time. In any seminar class this is bound to happen, but I think because the discussions were given no direction at the beginning of class it happened even more in this class.\nThat being said, the workload was extremely light. I almost never did the readings and it didn't really matter. Anytime we turned anything in, Professor Sharpe always said it wasn't for a grade, that it \"was part of the process\" . . . I haven't gotten my grade yet so I don't know what that means.\nWorkload:\n12 Courseworks postings over the semester\nMidterm on an important walk\nFinal project that can be anything about walking\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "January 19, 2010",
            "review_content": "\nHe's super nice and dorky but the class is definitely a bit odd. Even though nothing is graded, everyone can't get A's so the A/A- distinction seems to be completely arbitrary. So if you do all the work you have a 50/50 chance of getting an A. Material is pretty interesting and class consists of in class discussions on readings most people don't do. I'd recommend this class for non english people needing to fulfill a requirement/english people wanting a GPA boost. All you do is weekly posts about ANYTHING victorian pretty much, even though most people base it on readings and an in class presentation with some people and a final project of sorts, none of which are graded. \nWorkload:\nweekly postings, projects, non graded\n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "June 07, 2009",
            "review_content": "\nPROFESSOR SHARPE IS MY HERO. I really, seriously want him to adopt me. \nI took Lit Crit with him to fulfill a req for the English major. I was dreading it, but because of Prof Sharpe I looked forward to it every week. \nHe lets you create your own syllabus as a class, and grade yourself as a student (within reason), and his grading system is based on effort rather than merit. So it's kinda like a \"create-your-own\" class. And it's awesome. We chose books to read so they were random, but all really good, and I learned SO MUCH in this class! He knows tons about literary theory, and actually, everything. By the end of the class we would ask him random questions 'cause we figured out he always knows the answer. Plus, if you go to him during office hours he's incredibly nice, helpful, and accomodating. He gave me a book to read and helped me with a paper from another class.\nTake this class with Sharpe! \nWorkload:\nThe reading depends on what your class decides . Other than that, you have to write one 500-word posting on the board every week, and do a final project of your choosing. The postings aren't graded -- your final grade is basically based on how MANY postings youve done, not how good they are. Easy and enjoyable A if you put in the effort. \n"
        },
        {
            "course_name": "Modern British & American Poetry",
            "review_date": "May 11, 2009",
            "review_content": "\nHe had the students lead the entire class.  Everyone in the room had to take a turn leading class discussion on a poet of their choice in one of three eras (modern, postwar, contemporary).  This was the only class I did not dread attending by the end of the semester.  I got to go in, interact with hot (and not-so-hot) Barnard girls, and say whatever I thought about the material at hand.  It was so relaxing.  \nI don't think I learned a ton about what makes poetry \"modern,\" though.  The theoretical part of the class really fell through since most of the students were amateurs.  That being said, I had absolutely zero exposure to poetry before this class and would likely have for the rest of my life had I not heard about this class and its ultra-easy grading rubric, which is explained below.  So kudos to him for making poetry accessible in what would otherwise be an extremely oppressive environment for a former Marine.\nWorkload:\n11 500-word postings on the discussion board, to be completed at will throughout the semester.  One final project which was basically whatever the hell you feel like, as long as you can explain how it relates to modern poetry.  His grading philosophy is based on effort, not merit (which he states very explicitly in the syllabus and in class).\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "January 12, 2007",
            "review_content": "\nProfessor Sharpe is an engaging professor who can make just about anything interesting. The only thing he cares about is ensuring that his students gain something from the class, rather than critically judging what students have to say. In fact, you are responsible for giving yourself a grade at the end of the course. If you can, definitely take a course with this professor.\nWorkload:\nLight. Weekly journal type postings responding to poetry or something that interests you, one group presentation and a final project of your choosing. \n"
        },
        {
            "course_name": "Modern British and American Poetry",
            "review_date": "November 23, 2003",
            "review_content": "\nI couldn't agree more with the last review. He's a brilliant guy and a great teacher, but he hands the class over to the students, most of whom don't know what they're talking about.\nWorkload:\n2 papers, and a final the class votes on (we just had to memorize poems and read them aloud)\n\n"
        },
        {
            "course_name": "Modern British and American Poetry",
            "review_date": "November 20, 2003",
            "review_content": "\na really great class.  it's not limited, so there are a lot of people, which can make discussion difficult.  sharpe encourages you to do your own thinking and creating- there is no syllabus, the class goes where it wants to go.  he is really intelligent, but does not talk a lot- which is sometimes ashame because you get stuck listening to not-so-\nintelligent classmates ramble.  oh well, no graded work and lots of good reading.  definately sign up.\nWorkload:\nweekly courseworks postings, have to lead one class, a final project- nothing is graded, your grade only depends on whether or not you do your work\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2003",
            "review_content": "\nSeriously, take this class with Will.  The papers could have been really dry (they are designed to teach you various argumentation techniques, e.g. comparison and contrast, cause and effect, etc.), yet Will somehow managed to make them fun (well, relatively).  Examples of assignments are Â“Write about someone you hated in High SchoolÂ” and Â“Examine the idea of family in American Beauty and The Royal Tenenbaums.Â”  Will is a tough graderÂ—heÂ’s really critical of your argumentÂ—but as a result you will learn to write logically sound prose.  Also, because he bases your final grade on your progress over the semester rather than the average of your paper grades, you can wholly focus on becoming a more effective writer (the goal of the class) without getting too hung up on grades.  Class can be funÂ—Will is an extremely bright, laid back, cool dude with a great sense of humorÂ—but as itÂ’s discussion based, it can also be extremely frustrating if you have stupid people in your class.  Overall, though, Will is a definite Â“gold nugget.Â”\nWorkload:\nStandard L&R;: 2 short papers/wk for first half, 1 longer paper /wk for second half.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2003",
            "review_content": "\nSeriously, take this class with Will.  The papers could have been really dry (they are designed to teach you various argumentation techniques, e.g. comparison and contrast, cause and effect, etc.), yet Will somehow managed to make them fun (well, relatively).  Examples of assignments are Â“Write about someone you hated in High SchoolÂ” and Â“Examine the idea of family in American Beauty and The Royal Tenenbaums.Â”  Will is a tough graderÂ—heÂ’s really critical of your argumentÂ—but as a result you will learn to write logically sound prose.  Also, because he bases your final grade on your progress over the semester rather than the average of your paper grades, you can wholly focus on becoming a more effective writer (the goal of the class) without getting too hung up on grades.  Class can be funÂ—Will is an extremely bright, laid back, cool dude with a great sense of humorÂ—but as itÂ’s discussion based, it can also be extremely frustrating if you have stupid people in your class.  Overall, though, Will is a definite Â“gold nugget.Â”\nWorkload:\nStandard L&R;: 2 short papers/wk for first half, 1 longer paper /wk for second half.\n"
        },
        {
            "course_name": "Modern British & American Poetry",
            "review_date": "April 25, 2003",
            "review_content": "\nGreat class. Prof. Sharpe is brilliant, head of the department, and clearly knows everything there is to know about poetry. He's fascinating, rolling off quotations and anecdotes in the \"One time Dylan Thomas said in a bar...\" This is a seminar, though, not a lecture, and it's always overcrowded making discussion occasionally painful. My only complaint? I wish Sharpe would lecture more. He seems to know everything, and while I appreciate that he wants to know what we think (he really does), I'm fascinated by the insight he provides every so occasionally.\nWorkload:\nLight, some daily class preparation (read poems), two papers, final project. Fun!\n"
        },
        {
            "course_name": "Victorian Poetry",
            "review_date": "April 18, 2003",
            "review_content": "\nWhile Sharpe oozes enthusiasm for poetry, he doesnt exactly ooze ability.  He'll spout some interesting facts and make connections to other pieces of literature, but he is seriously limited in his ability to talk about the interesting things going on in a poem.  And he's even worse at fostering discussion.  You'll leave every class wondering why he only skims the poems' surface and marvel at his complete disinterest in what the students have to say.  All in all, probably the worst English professor I've had in my 4 years here.  \nWorkload:\nAverage, a few papers\n"
        }
    ]
}