{
    "prof_info": [
        {
            "prof_name": "Leonard Matin",
            "prof_id": 1714,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Perception and Sensory Processes",
            "review_date": "December 20, 2004",
            "review_content": "\nIf you're looking for an easy course to fulfill your science requirement, DO NOT take this. I took this course expecting something at least relatively manageable.  I certainly expected that I'd get an A if I put in a decent amount of work, but the T/F section on the exams is just killer. Professor Matin says he's not trying to trick anyone (and I believe him), but the wording is often so abstruse and so unrelated to the textbook (he has a habit of using totally dissimilar terminology), that it's impossible to get them all even when you know the material. In fact, only one person out of fifteen (to my knowledge) got an A on the midterm.  \nOn the other hand, Matin is a genuinely kind man. If you're really interested in perception, I'm sure you'll be more than happy with him (the psych majors in the class really get into it).  If, however, it's not your bag, Matin's lectures might be a little difficult to sit through. And again, the class isn't easy. \nWorkload:\nLots of reading, all of which is necessary if you expect a fighting chance against the exams. 1 quiz, one midterm, one final. \n"
        },
        {
            "course_name": "Space Perception",
            "review_date": "November 18, 2004",
            "review_content": "\nThis seminar was really tiny, and that was a shame because Prof. Matin is wonderful.  Everything the other reviewers said and more.  Even though I had absolutely no background in the material,  this course ended up being fairly easy because of his patience and understanding.  At the beginning of the course, i exected the material to be really boring, but fortunately it turned out to be (mostly) fascinating. I still know a little more than i ever wanted to about hearing systems in owls, but I definitely reccommend this course to anyone with any interest in illusions, space perception,  psychology, or anything vaguely related to the topic.  Matin actually gets happy when people begin to understand things and is willing to put tons of effort into achieving that result.\nWorkload:\nOur class was small, so we had to do quite a few presentations each. The more people, the less work for each.  The reading looks intimidating at first, but the class periods can't cover everything so it slows down to a very manageable amount.  Its important to understand everything, so the material isn't rushed.\n"
        },
        {
            "course_name": "Perception and Sensory Processes",
            "review_date": "December 22, 2003",
            "review_content": "\nProfessor Matin is a really nice old man. He's friendly and kind, and wants his students to do well. On the other hand, he makes this difficult by delivering some of the most dull and incoherent lectures I've been privy to hear. If you're interested in vision and audition, this would probably be a decent class to take. If on the other hand, you're taking this for the science requirement, GO FOR SOMETHING EASIER. Seriously, this class is not worth wasting a semester of your time here. While Professor Matin is really nice and you end up liking him, the experience of attending classes and taking the exams was continuously excruciating. This is mostly due to the fact that material itself is pretty uninspiring. \nWorkload:\nOne preliminary quiz to indicate the level of questioning in later exams. also a midterm and final (cumulative). these seemed to get steadily more difficult, and the final was particularly hard. He does, however, implement a really generous curve, which can honestly resurrrect your otherwise miserable grade. \n"
        },
        {
            "course_name": "Perception and Sensory Processes",
            "review_date": "November 22, 2003",
            "review_content": "\nProf. Matin is your grandpa. He s extremely nice and approachable and an easy grader who-- seriously-- gets happy when he sees a student has done well on an exam.  The book for this class was very very good and clear. If we had to depend on his explanations, the class wouldn t have been as enjoyable. It s hard to explain: you can t get mad at him for not being able to explain the material well enough because he is so sweet, but at the same time he gets quite confused at times, and makes things more complicated, which is bad for you. Bottomline is, the class is very interesting, the book is great, so if you read it you re fine, and prof. Matin will not make your life harder in any way.\nWorkload:\nquite a bit of reading, and you have to know all the little details. 1 quiz (10% grade) 1 month into the semester to familiarize you with the format, 1 midterm (35% grade), final (55%). Exams have a large T/F section, some multiple choice, some \"match the columns\", short written responses and essay questions. He grades them pretty easily, and the curve is pretty good.  He also only gives you back a copy of your exam-- he keeps the originals so as to be able to better observe progress throughut the course, and original responses you might have had, and to treat you as more than a series of numbers (i quote here).\n"
        },
        {
            "course_name": "Seminar in Perception",
            "review_date": "July 16, 2003",
            "review_content": "\n  This class was basically 2 VERY small classes mushed together, one graduate, one ugrad.  the guy's incredibly smart and very interesting.\n  There was little or no background needed since he explained everything to us anyway and with the class so small, there was plenty of opportunity to ask questions (I had \"Mind, Brain, and Behavior\" as my prereq and only took this class to fulfill the science req).\n  I don't know if this class was a total fluke, b/c it certainly felt like I'd struck gold...he may run things a bit differently now...but for us, we basically sat around talking about frogs who were operated on to see upside-down and how astronauts pee in space....and we all got a big fat A.\nWorkload:\nvery very very light: a few articles a week from things like Scientific American, roughly 2 presentations each student for the entire semester.  again, this seemed so light, I don't know if he's changed things for the seminar\n"
        }
    ]
}