{
    "prof_info": [
        {
            "prof_name": "Nomaduma Masilela",
            "prof_id": 13272,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 20, 2017",
            "review_content": "\nI completely disagree with the previous review (from November 2016). I was in the same class, and I thought Nomaduma was an amazing instructor. She went above and beyond teaching us the standardized Art Humanities curriculum, especially when it came to questioning both the course and art history's acceptance of racism and sexism. She definitely knows what she is talking about and gave our class an insightful perspective into the masterpieces selected by the Core office. She also went to Columbia University for both undergrad and her graduate program so she understands what it's like to be a student here.\nI 100% would take her class again and recommend it to anyone looking for an intelligent and approachable teacher. Her assignments were very straightforward, and I really enjoyed working on the final project. I came into this course not knowing anything about Art History or even how to think about a piece of art. Nomaduma completely transformed my ability to both look at art and interrogate social institutions.\nWorkload:\nReading responses, two 3-4 page papers, one midterm, one final project, one final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 14, 2016",
            "review_content": "\nNomaduma is the WORST instructor I have ever had at Columbia. DO NOT take Art Hum with her - it would make you hate art history. IT IS SIMPLY A DISASTER.\nShe's a PhD student so she may not teach every semester, but I'm writing this review (this is the first review that I've ever written) because I'm genuinely disappointed in her class, and I don't want anybody who has the slightest interest in art history to take this utterly boring and unsubstantial class. She just doesn't know what she's talking about. I feel like I've learned more by going through the readings myself and looking up on wikipedia than going to her class.\nI have taken art history before and it really is an interesting subject, but Nomaduma is just ruining it for me. Sitting in her class is a real waste of my time. I'm so disappointed that I really wonder why Columbia lets her teach. Ughhh!!!!\nOh and she regularly cancels classes so we're always behind the schedule that she has set.\nIf you want to learn something about art history, DON'T TAKE HER CLASS. You would hate this class and deeply regret not having dropped it, as I now do.\nIf you just want to get through Art Hum to fulfill the requirement, ALSO DON'T TAKE HER CLASS. Find another instructor who can at least articulate her assignments instead of using language that's confusing to every student in the class!\n \nWorkload:\nWeekly reading responses; 2 papers; final project; midterm & final.\n(But she cannot even write/speak clearly about her assignments so I'm so confused about what she wants us to do.)\n"
        }
    ]
}