{
    "prof_info": [
        {
            "prof_name": "John DaPrato",
            "prof_id": 1485,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Public Speaking",
            "review_date": "May 11, 2004",
            "review_content": "\nMr. DaPrato is an excellent instructor.  He is funny and very genuine, and I really feel like I learned a great deal in his class.  Even if you think your public speaking skills are decent, Mr. DaPrato can make you even better.  You'll gain plenty of extemporaneous speaking experience in his class, which will be incredibly valuable to you later in life.  Mr. DaPrato is very nice and very helpful, and you WILL be a better speaker after taking his class!  I definitely recommend it.\nWorkload:\n6 speeches (one ungraded) on a variety of topics, midterm, final (based on the textbook)\n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "May 10, 2004",
            "review_content": "\nTENURE THIS MAN!!!!!! he is kind, professional, amiable, knows his shit, VASTLY improves your speechmaking skills, always encourages students to do their personal best, not a stickler for percentages and grades.  This class is the most interesting one I've take thus far at columbia.  You learn about current events and controversial issues through the speeches everyone makes (you choose your own speech topics in the categories of informative, persuasive, controversial, group speech) and your public speaking and rhetoric skills vastly improve.  For some reason  the speech department at columbia has shrunken over the years to the point where DaPrato is the only professor teaching the only course on public speaking.  I wish they'd make more publiuc speaking classes available because as this class teaches you, whether you want to go into business, marketing, pr, public policy, politics, law, journalism, whatever....the ability to speak publically at a high level is vital...because what's the point of filling our minds with all these great ideas and all this knowledge if we can't articulate them clearly, communicate these ideas, and influence or teach others about them?  If everything you learn at Columbia is like a big cup of orange juice, this course is the straw that enables you to actually get it in your mouth and savor the sweet juicy nectar without getting pulp stuck in your teeth.  \nWorkload:\nnot a lot at all and its actually homework that you look forward to doing.\n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "February 13, 2004",
            "review_content": "\nTake this class! This class was one of the best classes that I have ever taken. It was interesting, fun, and useful. The professor is fair and always gives useful feedback on all assignments. You also get feedback from classmates, which is helpful. This class is very refreshing and I looked forward to going everytime. Professor DaPrato is knowledgeable and a very fair grader. Furthermore, he is approachable and understanding. He will answer any question that you have and he will explain what you did right and wrong. This class covers interesting topics about public speaking and you get to speak about interesting issues in your speeches. Many times the class would have fun debates about a wide variety of issues. If you have the opportunity to take this class then take it. The class will definitely improve your public speaking skills.   \nWorkload:\nA number of speeches that you must prepare, midterm final. \n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "January 04, 2004",
            "review_content": "\nTake this class! Professor DaPrato is a great guy and a wonderful professor. His classes go by quickly and are really interesting and amusing. But more importantly, this is the most useful class you will ever take at Columbia. The skills that he teaches you will be invaluable for your future, whatever career you choose. He will teach you to not only be a great public speaker, but how to organize your thoughts clearly for other people, how to persuade and influence others through logical reasoning, how to present yourself, and how to impress anyone you come across (especially useful for job interviews). He is easy to talk to and will always take time outside of class to help you with your speeches or answer any questions you may have. This was one of the best classes I have ever taken at Columbia and I highly recommend it. \nWorkload:\nThe workload is not heavy at all. The speeches take time to prepare but you can always choose a topic that interests you and so the prep time goes by fast. The midterm and final are easy if you do the reading.\n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "August 10, 2003",
            "review_content": "\nTake this class!  Prof. Daprato is highly knowledgeable and presents students with challenging and entertaining course work.  If you regularly attend, occasionally participate, and make a genuine effort to improve your public speaking skills, you will be rewarded.  This is the perfect class to improve one thing that really matters in the work place!  If only it were part of the Core. . .     \n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "May 08, 2003",
            "review_content": "\n  The previous reviewer's appraisal is WAY off. Professor Daprato's class gives students the necessary skills, both in theory and in practice, to speak exceptionally well in public. He is very knowledgeable about speech, in fact, and the students in his class who work hard to prepare speeches and to listen to his lectures will learn a great deal.\n  The high quality of Professor Daprato's expertise is further evidenced by the fact that his students have swept the awards in the Curtis Prize speech competition in each of the last two years. Make no mistake about it - if you try, if you pay attention, and if you listen to Professor Daprato's constructive, learned critiques of your speech performances in his class, you WILL become a much better public speaker.\n"
        },
        {
            "course_name": "Speech",
            "review_date": "May 06, 2003",
            "review_content": "\nDaprato is a professor who only wants to hear HIS opinion, and things need to be done HIS way.  He talks more about his personal life than any speech topic... which can get boring at times. He's semi knowledgable and a bit odd. He plays favorites in class and tends to hold side conversations with those people for 15 minutes before he begins the class.  I didn't learn much in the realm of speech, but I do know a whole lot about his life.\nWorkload:\nFair. \n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "March 31, 2003",
            "review_content": "\nJohn DaPrato's Public Speaking course is a wonderful opportunity to learn how to deliver extemporaneous speeches effectively in front of a group. Throughout the semester, students are able to apply the lectures in order to improve weaknesses in their speeches. They also learn theories of public speaking by reading the Lucas text and studying for\nthe midterm and final. The constant feedback and practice in giving speeches helps to build confidence in a comfortable environment created by the instructor. Some of the speeches one learns how to deliver are: relating personal experiences, giving informative talks, and persuading the audience to believe new ideas. John DaPrato is an excellent instructor, and I recommend him highly to those who are interested in improving their oral communication skills.\n\n"
        },
        {
            "course_name": "Public Speaking",
            "review_date": "January 21, 2003",
            "review_content": "\nWelcome to the semi-interesting life of John Daprato.  He's nice, he's got a fun sense of humor, he's a bit strange, and by the end of the course you'll know more about him and the stories that make up his life experiences than you know about all your other professors combined.  Take it.  If you can speak fairly well in front of a group it will be an easy class.\nWorkload:\nA few speeches and very short (i.e. 30-50 true/false questions) midterm and final.  Neither the exams nor the speeches required much preparation and he's a generous grader with the speeches.\n"
        }
    ]
}