{
    "prof_info": [
        {
            "prof_name": "Klaus Lackner",
            "prof_id": 4341,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Alternative Energy Resources",
            "review_date": "January 25, 2013",
            "review_content": "\nI feel that the other review given to professor Lackner about this class is unfair and represents the annoying part of the class that think they are too cool to come for lectures and then find the exams \"ambiguous\" and \"pointless\" (well maybe if you actually paid attention to what was being taught you would understand whats going on). Yes the SIPA students do talk more but that should not be intimidating at all. This class is actually more difficult for SIPA students as it is much too technical for them and if you just took the initiative you could actively be a part of the discussion. The lectures are very interesting and Prof Lackner has a very interesting perspective on a lot of issues regarding contemporary energy policy and technology. There is a lot that can be learnt from taking this class both in lecture and if you involve yourself with even some of the extra material or just google the stuff that he talks about. Its a great starting point to delve into the many issues about energy usage.\nAlso Prof Lackners new format of watching lectures and learning basics on your own and using the class to focus on discussion and interesting case studies really works well and is much better than a man talking at the class for an hour and a half.\nIf youre interested in Energy and dont really know where to start its a good class for you.\nWorkload:\nThat being said this class is basically no work. Optional Homeworks and two take home exams that take as much time (if not less) as an average engineering problem set. You really cannot go wrong with that. I got an A+ in this class just by attending lectures, being engaged in the material and reading about interesting stuff presented and spending a solid 5 hours on each exam. I didnt even do any of the homeworks. \n"
        },
        {
            "course_name": "Alternative Energy Resources",
            "review_date": "December 25, 2009",
            "review_content": "\nWhat an annoying class. Seriously. \nI had to take this class for my EEE requirement, but it shouldn't be mandatory. I can't imagine anyone who would take this class for fun. The material is interesting and relevant but the lecturers are not very enthusiastic and there's really no reason to go to class. I found the material in the book (which you do not need for the course) more interesting. \nThere is no reason to go to this class, or take it at all unless you are REALLY interested in alternative energy and willing to listen to dry presentations. \nThe midterm and final are stupid. They give you around 5 problems that are completely ambiguous- the ones you think are easy end up being hard, and the ones you thought were hard were able to be solved easily. \nProfessor Walker is generally very unhelpful and I also found him to be rude. A big NO THANKS to ever taking one of his classes ever again. \nGenerally a very frustrating class. There are SIPA people who also take the class as well (I guess its both a 2000 level class and a 4000 level class)... which is all fine and dandy unless you end up with the one who was in my class who couldn't really shut up. I would advise against taking it, and if you have to take it for EEE... well then good luck to you... it's gonna be one unpredictable semester. \nWorkload:\nThere is homework- which is ungraded and will not help you with the midterm or the final. \nMidterm and Final- a bunch of bs, literally. You don't need to go to class, you just need to be really resourceful with wikipedia and hope you are guessing right. \n"
        }
    ]
}