{
    "prof_info": [
        {
            "prof_name": "Samuel Moyn",
            "prof_id": 1036,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "January 22, 2012",
            "review_content": "\nSam Moyn is a good argument for why professors under the age of 50 shouldn't get tenure. He's super-hyped but truly disappointing.\nHe's a decent lecturer but the structure of the class falls apart pretty quickly. He's willing to ask and answer questions in lecture but doesn't do enough to challenge students when they say inane or simply incorrect things. He tried very hard to be a personable, young, cool professor (\"Hi, I'm Sam\") but the minute you asked for help or even asked a question that front disappeared immediately.\nThere are certainly more boring lectures, but I've never taken a more disappointing class overall. Think twice.\nWorkload:\nA bunch of reading, two incredibly obtuse papers that essentially ask you to explain the entire thesis of the class, surprisingly tricky and hard final \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "January 14, 2012",
            "review_content": "\nSam is a great professor. His lectures were almost always engaging, even engaging enough to keep me awake at 9 a.m. He brought up great points and questions in his lectures and used a lot of helpful metaphors to clarify some of the denser, more academic language of the readings. He sometimes had to rush through parts of his lectures and skip entire pages of the powerpoint that seem like they would've been valuable to discuss, but that will always be difficult. The class was extremely interesting and eye-opening. It helped me approach human rights in a different way and provided a lot of context for understanding human rights. If you are at all interested in human rights, this is a great class to take. The only downside is that if you are a bleeding-heart humanitarian, you may come away feeling a bit disillusioned. Sam definitely presents the material in a somewhat critical way, but I think that that's a good thing and that it's one of the ways he gets you to really engage with these issues.  \nWorkload:\nFair amount of reading, but I didn't do a lot of it and still got an A (not to say it's an easy class, I think I just got a little lucky). Two papers (5-7 pp. and 7-9 pp) and a final (no midterm). The final wasn't too bad, IDs and an essay. Weekly discussion sections which were helpful to clarify the material.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nProfessor Moyn is quietly brilliant, so it may take you a class or two to realize that he is likely one the greatest professors you will have the pleasure of taking. Our Literature Humanities class was based primarily in discussion, relying on contributions from our class. Moyn nevertheless manages to infuse his fascinating and worldview-changing insights into every discussion. He leads the class in such a way that each and every person feels comfortable and does contribute to discussion. Our entire class was enamored of him and his class. He is also a genuinely great guy who invited us to numerous lunches and even to his home twice for dinner and a movie. That's all just icing on the cake that is his constantly engaging class, to use a terrible analogy. Samuel Moyn should absolutely have a gold nugget. Take a class with him if you can, you won't regret it.\nWorkload:\nTwo 5-7 page papers, midterm & final, lots of reading as per usual for Lit Hum, but he tries to make it as doable as possible\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nI cannot imagine a better professor than Samuel Moyn.  His lit hum class was an absolute joy, and I looked forward to it every day.  This seemed to be the general consensus of the class--we got together for lunch after every class and, for the entire time, talked about how much we all loved lit hum.  \nWith his brilliant insight, Sam will make you love every book you read.  He manages to share these insights while still keeping the class exciting and discussion-based.  \nSam removed Crime and Punishment and the Decameron from the syllabus so that we could have a chance to look more carefully at the books we did read, and with less of a time constraint.  He also added two Tolstoy stories and David Mitchell's \"The Cloud Atlas\" all of which were all awesome.    \nI would absolutely recommend that anyone try to take a class with this guy before graduating--it will completely change your college experience for the better. \nWorkload:\n2 5-7 page papers, weekly posts on an online discussion board. \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "April 29, 2010",
            "review_content": "\nProfessor Moyn, or Sam, as he will introduce himself, is a truly fantastic professor, and probably one of the best that I have had here at Columbia.  His lectures are engaging and interesting, and he does a nice job of inserting some humor in there as well to keep the energy in the classroom up.  He presents a lot of information in class, and some of the concepts that he brings up might be a little overwhelming.  (He's quite brilliant-- there were definitely words he used that I found myself heading to the dictionary to look up...)  This is definitely not an easy A.  The material is complex, and it will really force you to think way outside of the box.  You'll probably come away from the class with more questions than answers, but I think this is a good thing!\nHis powerpoints might not make a lot of sense on their own, so I definitely recommend going to all the classes and taking notes that correlate with the slides.  This will help in studying for the final exam and will also help when you are writing your papers.  Plus, it wasn't exactly a chore to go to this class.  I really enjoyed it and definitely came away from the experience feeling like I had been challenged intellectually.  Also, appreciate this reading list.  There is a lot of material, but it is manageable, and really interdisciplinary, which I think was a huge strength of the class overall.\nI'd definitely recommend this class to anyone with an interest in the history of human rights or the philosophy of ideas about morality/humanity/politics etc.  \nWorkload:\nThe workload for this class consists of weekly reading (not too too much but challenging at times), two papers (5-7 pg and then 7-10 pg), and a final exam.  There is also a weekly discussion section led by a TA.  Discussion sections are mandatory, unless you opt not to do one in which case your papers are weighted more heavily in your grade.  I'd recommend the section.  It gives you an opportunity to discuss some really interesting readings.  Also, the papers are challenging, so you might want to balance those with the discussion.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "April 26, 2010",
            "review_content": "\nI'm writing this review a little early, since we haven't taken the final yet or had a review...but I'd have to say that I recommend this class to people who are interested in human rights, philosophy, or especially law. It goes into a lot of theories about where the concept of human rights came from and how it has been applied over time. The reading may be philosophical and look a little dense at first, but if you read carefully and highlight the important points, the information you get from it can be very interesting.\nKeep in mind that this is an upper level class and the reading is pretty fast paced. There are a few books assigned on the syllabus, and in addition to reading the books there are about 2 or 3 printouts to read for each class day. The discussion section is optional (if you don't take it your papers count more in your grade) but it's very helpful in understanding the material. My TA (Michelle) was really cool and understanding of the students. Professor Moyn kept in touch with his TAs on what to discuss and what would be the most helpful to bring to discussion section.\nThe lectures are very easy to follow and interesting too. Even though it's a morning class, you won't fall asleep. The lecture material supplements the readings without being a useless summary. Professor Moyn uses slides and puts them up on courseworks the next day or so. For me, it was a little hard to copy the slides and listen to him at the same time so I would suggest to take notes on what he's saying and add that to the powerpoint from courseworks. \nOverall a really cool class where if you have the time, effort, and interest to put into it, you will actually learn something and get a new perspective about something relevant and important to the world (human rights).\nWorkload:\nA considerable amount of reading but nothing too thick. Weekly discussion sections where you are expected to know the material. Two doable papers during the semester (5-7pg and 7-9pg) about interesting topics (you get a lot of choices about what to write about) and a final exam (don't know the format yet)\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "November 03, 2007",
            "review_content": "\nThis is one of the best classes I've ever taken at Columbia. Moyn is relatable, interesting, intelligent, and clear in his lectures. Also, (although I have no idea how much this has to do with him, personally - )his TAs for the course were all kind of generally fabulous. I hated missing class even though it was a lecture and I didn't have to go at all. Furthermore, I LOVED the readings. I still refer to my marked-up coursepack all the time for other papers and general reading. I definitely encourage everyone to at LEAST shop this class - its very worth it. \nWorkload:\n2 papers that were intense but interesting so the work was worthwhile. The grading was tough - but only in the sense that they were looking to make sure you challenged yourself in the paper. If you did, you were fine. The final exam wasn't too bad either.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 15, 2007",
            "review_content": "\nI thought lit hum was very good but thanks to prof moyn CC gets even better. I had no background in political philosophy, had never read anything by plato or aristotle so I got so much out of this class, and professor moyn made it such an enjoyable and easy experience. Prof moyn is very clever but very humble. He always engages students in discussions, throwing in jokes with his dry sense of humor which you will appreciate. He allows students to talk a lot in class but never fails to get his point across and makes sure we all know what we are supposed to know even when discussions start getting out of hand. He sometimes even e-mails us after class if he thinks we haven't fully understood what the author's main argument is. He gives a good number of choice for paper topics and they are all interesting and thought-provoking. He gives long insightful comments to your papers which really helps you improve. He also gives summary sheets which helps you see the whole picture of the authors through time clearly. If you get him for CC you're so lucky. I'm really sad he's not teaching it this spring semester. \nWorkload:\na lot of reading as expected of a CC class. 2 longer papers or 3 shorter ones. about 6 easy quizzes on the assigned readings. midterm and final, both pretty easy.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 30, 2006",
            "review_content": "\nOkay, obviously the man is brilliant. Although he may appear modest when he neglects to tell your class he is a genius, he is quite cocky. People in the class tried to be nice to him and get to know him, and every single time he just pretty much ignored them and acted like he had something better to do than reciprocate. He let discussion get out of control to the point where some people were talking more than Moyn during his class. Even though I never really talked to him or had a personally bad experience with him, I thought his attitude and unwillingness to help students improve was a real turnoff. \nI wouldn't have taken his class in hindsight. Not that it was a miserable time, but you could stand to improve as a student if you shopped elsewhere. \nWorkload:\na little extra reading. 2, 6-7 pg papers or 3, 4-5 pg papers. bad paper topics. harsh grader. midterm, final decently straightforward. \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "January 11, 2006",
            "review_content": "\nI loved both this class and this professor.  In my four years at Columbia, I have taken a number of interesting courses, but few have made me think as hard as this one, both inside the class and out.  Professor Moyn takes the near-sacred idea of human rights and forces you to consider them as more than just ideals that we all do or should strive to make a reality.  Prof. Moyn himself is an entertaining lecturer, without being a showman.  He has a dry sense of humor that makes even the dullest material seem interesting.  In addition, he manages to impart tons of information without ever losing focus of his main points.  This class is not easy (don't take it just because you like human rights), but it is well worth it.\nWorkload:\nTwo papers (5-7 and 7-9 I think).  Optional discussion section that I would recommend, especially if Amit is TAing again.  A final that is hard but nowhere near as difficult as other reviewers have implied.  Pretty typical amount of reading for a history class.  Unlike the last reviewer, I loved all the readings;  they can be difficult, but if you take time with them they are extremely thought-provoking.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "January 09, 2006",
            "review_content": "\nSamuel Moyn is an amazing professor, a great guy who is extremely friendly and very knowldgeable and willing to work with his students. Now, I probbaly don't have the proper perspective, since I took Historical Origins of Human Rights, a junior-level class (3000 level), as a first-semester freshman. \nHowever, I thought the class was amazing, though EXTREMELY difficult. If you are interested in the important topic of human rights, I would highly recommend this class, but WAIT until at least your sophomore year, and probably junior year. Discussion sections, a lot of them (8) are offered but not required, but it would be extremely foolish not to. This class has a ton of reading, a mix of history and philosophy, some of which is ridiculously difficult. For TAs, I had Amit and he was excellent, April and Giuliana seemed good as well, Sergei not so good. Also, ignore the guy who said people cry during the final-it's not that bad and part of it is open-note.\nWorkload:\nLOTS of reading, much of which is extremely difficult, and most of which you should do. Also a 5 page paper, 7 page paper (both essays, not research papers), and a final.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "December 30, 2005",
            "review_content": "\nYou would be hard pressed to find a better prepared or more engaging teacher at Columbia.  Great course but that is largely a matter of opinion or interest.  Regardless, Prof Moyn is an excellent teacher--available to students, stupidly smart, fair, funny, organized, pushes people just hard enough, and is very hands on with the TA's so you never feel like your time is being wasted in discussion.  The other reviews on workload were correct.  The philosophy presented was invaluable in interpreting historical events.  Hands down. Amazing professor.  Great course.  \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "December 18, 2005",
            "review_content": "\nFirst I will agree with the other reviewers in that Moyn is a great lecturer, he's entertaining and exceptionally brilliant.  I did enjoy going to class, but I absolutely hated most of the readings.  They were dry and uninteresting, and had little to do with the final, if anything.  The concepts and his views on the readings are what will be tested and you have no way of knowing them unless you attend lecture.  My advice is go to class, read the readings for the question you choose to write your papers on, you will have 10+ options, and attend each and every lecture, and take notes.  I can't say I recommend the course.  He's a great teacher, with great ideas, but the readings are boring, and the final was stressful.  He and the four TA's wandered around during the whole test, he graded half of the exams while he was walking around. A little red pen and people looking over your shoulder made for a tense environment.\nWorkload:\n2 papers, fairly graded, wide topic range, moderately difficult final\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "December 15, 2005",
            "review_content": "\nA fascinating class. Lots of readings but mostly interesting and eye-opening.  Lectures usually interesting and worth going to; Professor Moyn definitely knows his stuff and always has good critical remarks to make.  This class is a must if you're interested in human rights or the history of ideas/emotions. \nWorkload:\nreadings, optional discussion section that's a great way to discuss (especially if your TA is April).  2 papers with wide range of topics, semi-difficult final. \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "December 14, 2005",
            "review_content": "\nAs someone who is also currently in the class, I feel that I must respond to the reviewer below.  I know that not everyone is as happy in the class as I am, but I also know that there are several people who love the class as much as I do.  This is probably the best class I have taken so far at Columbia or Barnard (I'm a sophomore), and Moyn is by far my favorite professor.  He is quite simply brilliant; as an added plus, he is funny and also genuinely interested in hearing students' opinions.  Perhaps the class would be less interesting for someone who has studied a great deal of historiography, but for my part, it has changed the way I think about history.  I would also advise that the class includes about as much philosophy as hard history, and someone who's much more interested in history than philosophy may find that the latter detracts from the course.  For me, however, it was a nice blend and succeeded in making history more than the unrelated series of facts that I've found it to be in other history classes.\nWorkload:\nNot bad, but it's important that you ACTUALLY DO IT.  Do the readings: they will be on the final, and Moyn's in-class summaries aren't a substitute.  Also, he talks pretty fast and it's difficult to take notes, so I reccomend bringing a computer to class if you can.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "November 14, 2005",
            "review_content": "\nOk, so I am taking this class at the moment, but since it is pre-registration time, I felt that I should write a review. \nFirstly, something must be said: this class, despite the overly enthusiastic reviews that you will undoubtedly read, is just not that special. Yes, Moyn is on occasion pretty funny. But that is not reason enough to take this class. \nThe material is not that exciting. Sure, some of it is very interesting, and I have actually enjoyed writing the papers, but for the most part, the only reason the course is bearable is because section is a valuable opportunity to talk out the material. This is because, in my section at least, we are weeks behind the lectures, so you end up reading for the section only, and lecture is an outrageously boring power point presentation sprinkled with cute jokes from Moyn. Bottom line: unless you really get off on history/human rights, don't bother. And this is, in my opinion, a truthful account (not a bitter retaliation), because as of now, I am doing really well.\nWorkload:\nReading: varies class to class. Mandatory reading for section is usually less because the TA assigns what she/\nhe want to go over. Two papers: one 5 pgs, one 7 pgs. My TA sent my section the grade breakdown for the first paper, and the majority was in the B range. No midterm. \nThe final is purportedly tear-inducing, but thanks to CULPA (Yeah CULPA!!!!) Moyn says he will make it easier: Closed book IDs, open book essay. Final and class curved. \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "February 05, 2005",
            "review_content": "\nProfessor Moyn was generous with his time and guidance to students preparing for the final exam, including extra office hours and exam reviews. Having attended a review session, I find the previous reviewer's complaints about the final exam misleading to readers.   Firstly, we learned about the general requirements for the exam more than a month before it took place.  The comments about its difficulty are unfair to the professor because they wrongly suggest that he produced  an unreasonably difficult final test that would wring students' brains.  I attended all the classes, read, thought, wrote and studied, and I felt I could have been even more thorough, but even so, I found the exam acceptable.  Maybe the lesson to be learned in all this, is not to assume what you know, but to avail yourself of all opportunities preparing for a test, like the review sessions, and to seek out the teacher to assure yourself about requirements and how you might perform in a test.  Ask the questions.  You might not get a satisfactory answer from some profs.  So, given the outstanding attitude and professionalism of this teacher, as other reviewers testify, you would get some response.  Also, the class is unique, and the selection of readings and the thought behind it is remarkable.  Finally, does it stand to reason that someone dedicated to the study of the origins of human rights, that deals in depth with human compassion, would enjoy tormenting students?  Altogether, with the course, the experience of this prof is a gift not to be underrated.\nWorkload:\nReadings, optional discussion group.  One short 5-page, one 10-page research paper from selection of topics.  Keep up with the reading and notes.  Final reasonable if keep up with the course.  \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "December 29, 2004",
            "review_content": "\nThis was a really interesting class, Prof. Moyn lead us through the twists and turns that make up the intellectual history of human rights in a very well organized and understandable fashion. He had a very tight grasp of his subject and seemed to welcome questions and comments despite the large size of this lecture. Having said that... the final was a horror. I have never taking a final where it honestly seemed as if all the ids were put there to make you cry.  I studied the main historical points and ideas very thoroughly and still had to guess on quite of few of them and you know what? People really did cry at this final, they looked at the paper and cried.  I would recommend finding a way to look into the subject without taking the professor.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "October 16, 2004",
            "review_content": "\nEspecially if you are studying human rights, take this\nclass for its fascinating and sometimes surprising\nperspectives into these rarely visited aspects of human\nrights. This course can be a great experience, and\nprovide you with a powerful background when dealing\nwith human rights in future.  Your able guide has\nprepared a wealth of readings, guest speakers and\nnotes - the syllabus and notes are on the professorÂ’s\nwebsite.  I agree with the other reviewers that Prof.\nMoyn is brilliant, kind and a great professor.  If you are\ninterested, you will be inspired to work hard and the\nprof is supportive and will reward you appropriately.\nAlso, there was some flexibility in preparing the second\npaper to include our special interests.  Prof. Moyn is not\none of those teachers who assumes that because you\nare in a class, you have nothing worthwhile to say.  He\nreally welcomes his students, and even used some of\nthe big class budget (for 127 students) to host those of\nus interested to meet with him at very nice dinners.  Again, he is very interested, and interesting.\nWorkload:\nWorkload:  Readings, one 5-page, then 10-page essayto be logical and well-written.  The final was not hard ifyou kept up with the class and notes, and you werethinking about the subject.  It's a good idea to learn themain points of the readings and notes as you go along,since these may be tested on the final, and it will saveyou review time later.  There are two tracks: one withweekly discussion workshops, and one without. Thelatter divides more points between the essays.  Discussion groups take more time, but they are morefun and you have another opportunity to clarify,exchange views, etc.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 31, 2004",
            "review_content": "\nIf you get Sammy for CC, welcome to Core Curriculum heaven. Although I did not enjoy most of the readings, I think Professor Moyn is one of the best teachers I've ever had. His great, [ultra]dry sense of humor and zero-bullshit attitude made our whole class love him. He encourages discussion and debate--and gets it, even at 9 am. The best thing about him is his explanation of seemingly incomprehensible philosophical texts (think Kant); he'll give you great handouts and diagrams that will make your friends in other CC sections incredibly jealous. He's a very smart man and a truly talented young professor. You'll find yourself working hard just to get one of his few great compliments, in class or on a paper.\nWorkload:\nLike his attitude, his test are no-bullshit: paragraph answers, and not essays, are what's required.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 30, 2004",
            "review_content": "\nProf Moyn, or Sam for the more informal is a true intellectual and a teacher who helped me solidify my understanding and facility with argumentation in both my speaking and writing. Given that CC is a seminar-style class, most of the onus is on the students to discuss the pertinent issues at hand for the work at hand. This is not an easy task and Sam does not tolerate mediocrity when it comes to discussion. Sometimes he will interject ideas, but most likely he will ask your \"opinions\" on certain ideas. Truly a teacher who encourages creativity and new viewpoints, he almost always didn't completely agree with my opinions or views on the written assignments but still gave me great marks if I had written a coherent argument. He can be intimidating, writing terse emails without introduction or closing, and hardly ever smiles. However, after a few weeks, you'll begin to realize that if you put effort in, he's always willing to help [he's quite addicted to AIM and gives great help with reading and writing]. Overall, a superb professor, one who loves ideas surrounding culture, society, intellectualism, and history in general, one who will make you rethink the way you think about thought.\nWorkload:\nIntense but worthwhile. Same reading requirements as most other sections, but has some interesting additional readings that are more down his line of research [Jewish intellectualism]. Number of papers a term varies, somewhere between 2-5 depending on the lengths [never more than 8 pp]. Has exams, which are more factual based to see if you kept up with the readings and discussion in class.\n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "May 17, 2004",
            "review_content": "\nThis was a fascinating class.  Professor Moyn pieces together the history of human rights using a broad range of material, and in the process makes you rethink the idea of human rights as a whole.  Beyond being really interesting, this was the best organized class I've ever taken.  An outline of the lecture is posted online before each lecture, so you can print them out and easily keep track of all the information presented.  \nWorkload:\n5 page paper, 10 page paper, final, lots of reading that isn't  absolutely necessary, but definitely worthwhile \n"
        },
        {
            "course_name": "Historical Origins of Human Rights",
            "review_date": "April 19, 2004",
            "review_content": "\nAn amazing class. Prof Moyne isn't the most entertaining or charismatic of lecturers but he is so incredibly intelligent and interesting that he makes you see things in a completely new way. He really knows his stuff. You learn to really think critically about human rights. I'm so glad I took this course.\nWorkload:\nnot too bad, lot's of reading and 2 papers and a final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 10, 2003",
            "review_content": "\nI love this guy. Not only does he show you that you didn't completely grasp the reading you did the night before that you thought you understood, but he explains the texts comprehensively and in relation to all the other texts read 'til that point. He also hands out these extra readings that are absolutely great and a lot of times more interesting than the required texts. Like the other person stated, Moyn's great because he wants you to digest the readings to create your own philosophy. I had such a great time in that class and I think a lot of the other people did too. One thing though, you should definitely try to do the readings on time; he gets irritated if the discussion starts to wane and didn't try to hide it by the end of the semester. He can also tell if you really didn't do the reading or didn't finish the readings even if you think he can't. I thought CC was going to be another core class to trudge through but it turned out to be one of the best classes I've taken so far. I had him for two semester and thought the second was more enjoyable (he picks great readings to end with), so if you have him first semester, stick with him for the second. Also, he has a great sense of humor, an essential for CC. \nWorkload:\na moderate amount of reading, weekly discussion postings (easy), three 5 page papers or five 3 page papers with an absurd amount of topics to choose from, or you can create your own topics, midterm and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 07, 2003",
            "review_content": "\nMoyn is one of the most brilliant guys I have ever met.  Forget what that bitter guy/gal said about him last year - he's a great lecturer, he guides class discussion wonderfully, and he knows the material so well, it's impressive.  He gives these great outlines for most of the books we've read - so if reading the book confused you, and SparkNotes didn't really help, his outlines are there to save the day.  He has a great grasp on the material and has a strong ability to pass this understanding onto you.  You will definitely walk out of each class with a lot more knowledge about the book - and about the world - than when you first walked in.  More importantly, however, CC for Moyn appears to be more than a lecture: he seems to really want the class to get something more out of the books than what they're about.  He really wants each student to think hard about the world, what changes need to be made - create his/her own philosophy.  (Oh, and he claims to be neutral, but personally, I think he's into that whole individualism/self-creativity idea advanced by Kant, Mill, Tocqueville, Nietzsche, & Unger.)  If you want to get more out of CC than just plain knowledge, take Moyn's class.  It'll take your mind to some pretty extreme places.  Without a doubt, it was one of my favourite classes this year.\nWorkload:\nNot bad (unless you intend on reading EVERY single reading he gives out; he likes to give extras.)  The reading selection is excellent.  You have a choice of either 5 short papers or 3 long papers.  Midterm & final.  Class participation is important.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 23, 2003",
            "review_content": "\nProf Moyn is a great professor.  You can tell he knows what he's lecturing about, and he advances very interesting discussions.  You'll enjoy his class.\nWorkload:\npretty light, 3 papers, short midterm, straight forward, highly values class participation\n"
        },
        {
            "course_name": "European Intellectual History II",
            "review_date": "February 19, 2003",
            "review_content": "\nSuch an amazingly great class. The readings were mainly novels, plays, and\nphilosophy in the late 19th and early 20th centuries. It changed my idea of\nwhat history is -- not just wars and economics but also ideas and\naspirations about existence in society. The professor also added paintings\nand music to the lectures, especially in the beginning. He is not the most\ncharismatic lecturer, but he prepares really carefully (putting outlines on\nthe web) and speaks clearly about interesting topics. I have some\ncriticisms. The first half of the course was much better than the second\nhalf. There was mandatory section, which didn't need to happen every week.\nThe final exam was too abstract. But all in all, this class changed the way\nI think and I'd recommend it to anyone interested in an advanced version of ArtHum\nLit Hum and CC put together.\n\nWorkload:\nTwo papers, a final, and a report on a museum visit\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 25, 2002",
            "review_content": "\nSammy's awesome. He has a great sense of humor which often gets overshadowed by his brainy database of knowledge regarding... everything. Classes vary according to subject matter and class participation. His teaching style may appear to seem dry, but afterwards you'll realize you'll know a lot more than your friends in other CC classes. He is extremely understanding about late papers and grades fairly easily. But really the best thing about this guy is that he doesn't care about the \"school\" aspect of the class- he just wants you to walk away from your dreary \"ikea boy\" lifestyle and begin to glimpse at the world from the perspectives of some of the course authors. Note: if you're one of those people who likes to hear themselves talk, Sammy will not.\nWorkload:\neasy\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 25, 2002",
            "review_content": "\nSam has every degree known to man. He is a bottomless pit of paper topics. He comes up with them like it's a bodily function. The wide variety means you'll find something you like. He's young, recycles clothing fairly frequently, quintessential nerd. Still, he has a really good sense of humor, and if you watch him, you can catch him rolling his eyes at people sometimes. He claims he gets lonely during office hours, and i don't know if anyone goes to see him. He's interesting to talk to, though, and he taught the Bible better than any professor I've ever had. Discussion gets slow sometimes, but that's because people don't read and generally don't care. Other than that, he is very directed, and he has this little page of notes with his argument for the day, and he thinks in numbered lists, so he tells his argument in various numbered lists and asks you to agree or disagree. Most people take the fifth. \nWorkload:\nopt for the three five page papers. midterm (more like a quiz) and a final, and he's telling us everything that's on it, i believe. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 24, 2002",
            "review_content": "\nSammy's friggin smart, regardless of anything. He was always organized and always knew exactly what he wanted to get across to the class, though this was hard because not many people read. I think the main problem with the class was that people just weren't all that interested in the topics, but I definitely feel like I walked away with a lot more from this class than most other sophomores. I'd recommend him...and not just for the A.\nWorkload:\nStandard reading for CC... Writing: choice of 3 5-pagers or 5 3-pagers\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 23, 2002",
            "review_content": "\nIf you get Sam, say hello to a mostly easy A, if you don't mind being bored to tears for two hours. I hate this class. I hate it. In the beginning, Sam was mildly amusing, but he makes a habit of asking us if we read, not being surprised that we didn't, and alternatingly getting semi-pissed (he walked out once) and just trudging along. There's a lot of trudging involved in this class. He seems to think we're stupid because we're so disinterested, and he makes no effort to show that he is any more interested than we are. He sometimes asks seemingly rhetorical questions, with really obvious answers, but he expects us to answer them. Weird, yes. This class is his chore as much as it is ours, and it shows. He wielded his power on the midterm by using a quotation from a source online that he said we wouldn't focus on very much, and that we never discussed in class. It would have been okay if his midterm was longer than six questions. The mean was 70.4, and some people think, under the circumstances, that's a pretty good accomplishment when only five people got the damned question right. Discussion moves painfully slow, and you will find yourself counting down the minutes. \nWorkload:\nthree five page papers or five three page papers, midterm and final. \n"
        }
    ]
}