{
    "prof_info": [
        {
            "prof_name": "Alexandra Helprin",
            "prof_id": 11502,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 08, 2013",
            "review_content": "\nBoth reviewers below me are spot on, especially the third paragraph of the August 13th review. I don't usually write these, but I just randomly thought about Ms. Helprin again, cried a little, and decided to share my experience.\nI walked in thinking the class would be a cakewalk - standard two papers, a museum visit, a midterm, a final, and hopefully an A. I ended with a B+ and a lot of white hairs.\nBefore the paper deadlines, I submitted drafts to Ms. Helprin and thought I made some pretty significant changes each time. Not only does she expect you to send in drafts a week in advance, but she ends up giving you extremely unhelpful, vague comments that leave you more confused than when you started. I'll admit, she did happily give paper extensions, but that would honestly just drag on the agony. Expect to spend hours of brainstorming for her ridiculously difficult comparison prompts, write incredibly well-thought-out papers, rewrite them completely with little direction, and get a grade that leaves you feeling hopeless about ever improving your ability to analyze art.\nArt Hum is not supposed to be this difficult. Do yourself a favor and switch out of her class.\nWorkload:\nStandard Art Hum, but so much more difficult. Also, you won't get an A.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 13, 2013",
            "review_content": "\nI agree completely with the last reviewer. While I am not one of \"those guys\" with an above 4.0 GPA, I have taken humanities classes in the arts where the Professor tells everyone that he has never before given an A+, and I get an A+. My point is, I like to think I know a little bit about writing academic essays. \nFor the final paper I wrote about one of my very favorite artists and pieces, and thought it was one of the very best short essays I had ever written in my time here at Columbia. But, lo and behold, what do I get: an A-. You know, I'm not someone who regularly complains about A-'s, but this just killed me. Completely unexpected and demoralizing when you are so very passionated about a subject.\nOn top of this, \"Professor\" Helprin is one of those stereotypical humanities teachers who just gets so giddy when you mention the words \"Power\" (a la Foucault) and \"Colonialism\". She also doesn't mind when students basically turn to ad-hominem arguments during class conversations (e.g., someone calls someone else a \"Neo-Nazi\", \"Fascist\", \"Racist\"), as long as its followed by something vaguely reminiscent of a post-modern defense of Pop Art. \nSometimes Columbia can be a horrible place.  \nWorkload:\nDoesn't matter, you won't get an A.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 10, 2013",
            "review_content": "\nBefore I begin to write this review, I want to mention about my previous GPA. \nYes, I am one of those guys with above 4.0 GPA.  \nSimply avoid her with all your effort. First, I originally registered in Prof. Fucci's class but Columbia substituted Prof. Fucci to her for some reason. To be honest, her class is a very interactive. She tries to encourage everyone to participate, and tries to listen everyone's comment very carefully. But that's all.\nThe point is, we are not paying tons of money to Columbia, to have conversation on art with a random phd student. Normally, she couldn't give any clear answer to students. Whatever the students ask, she goes \"well... I don't know.\" ........ \nHer grading is super random and clearly unfair. Many people fixed their essays more than couple of times, she still refused to give an A, and she normally gives really underestimated grade for the participation as well. She tries to deducted every possible score from your grade. \nOnce again, avoid her, especially if you are on the track for premed, law-school and MBA . She is an obstacle for your great dream.\n\nWorkload:\n2 papers (15%, 25%) (Never fairly graded), mid, final (15%, 20%) (both of them are analogies. ridiculously hard and unfairly graded), participation (20% something, you can't never have full score).   \n"
        }
    ]
}