{
    "prof_info": [
        {
            "prof_name": "Fabrizio Spagnolo",
            "prof_id": 13641,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 07, 2021",
            "review_content": "\nWhen I first read his other reviews I freaked out. I started taking the class and I was like dang ok, he's kinda crass but he's energetic and tries to engage you, not so bad.\nThen, I straight up failed the midterm, F+, class average was B+ and yet I still got an A in this class because I talked to him. I went to his office hours every week, had him read over the one writing assignment I did, triple freaking checked my weekly packet or whatever before I turned it in. Like all in all, it wasn't minimal effort (I actually had to try) but it wasn't too bad.\nIf you show him that you're trying and that you care, if you actually form some semblance of a relationship with him you will be rewarded!! He was so impressed with my progress and hard work after I messed up that he has offered to write me letters of rec and keep me on his radar for lab work.\nNot the easiest section but you will get through it. \nWorkload:\nHarder than other sections, he actually does grade the weekly packets for accuracy\nWriting assignment\nMidterm\nFinal\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 28, 2019",
            "review_content": "\nA really nice guy!! Entertaining and energetic. Lots of people complained about his grading, but it’s honestly very effort-based, as long as you write a lot you’ll do fine. Bases his discussions on what we’re having trouble with, which is nice, and he’s knowledgeable and helpful. Go to the midterm/final reviews, they’re really helpful. They curve FroSci grades at the end to try to make the different discussion teachers’ grading equal, so don’t worry if you’re not doing too good, your grade will almost certainly rise. \nWorkload:\nWeekly written homeworks, one newspaper style article (easy), one required museum visit, and some very easy SmartSparrows (online statistics reviews)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 24, 2018",
            "review_content": "\nThis class is literally GPA suicide. Don’t expect an easy A. He is a good instructor but grades harshly. The homeworks are not graded based on completion but rather heavily on accuracy and they are extremely time-consuming. My friends in other sections had a much easier time. He is a good instructor and you will learn but you will have to put in a ton of work to receive an A, in my opinion, more work than is normally dedicated to a typical core class. \nWorkload:\nTypical fro sci weekly homeworks graded harshly(he will never give you a check-plus no matter how hard you try). Smart sparrows, a term project, midterm and final graded harshly.\n"
        }
    ]
}