{
    "prof_info": [
        {
            "prof_name": "Jennifer Miller",
            "prof_id": 9574,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Young Adult Novel",
            "review_date": "September 23, 2014",
            "review_content": "\nJennifer is a very hard grader. In her YA seminar, we were required to read each student's stories and write critiques for them, even though it was a seminar and not a workshop class. Besides this, she didn't bother to collect copies of the critiques which meant that some students didn't do them (I myself didn't receive a few), or didn't do them properly. So for those students who put the time and effort into their critiques, they were not rewarded.\nDespite having to workshop students plus write critiques, the bulk of our grade was for our own stories, and like I said, she marks hard! So with the bulk of that grade being for your own stories, you'd better write a NY times bestselling piece to get a good grade overall for the class! With all the hard work and effort I put into her class, I would have received an A in any other class had I done the same amount of work. Well I didn't get an A in her class. \nSo most of the work is done for the other students' benefits and less for your own benefit, but yet your time deprived story is worth more than anything else in terms of grade. She rarely lectured in the class, and almost everything I learnt was from critiquing the other students.\nIn terms of her personality, she is not the friendliest person around, and even though she smiles sometimes, she strikes me as not genuine. But that's just my opinion.\nBottom line: only take her class if you're a great writer and don't need to learn anything so that you wouldn't have to worry about your grade and can spend all your time focusing on other people's work.\nWorkload:\nRead stories, write critiques and active participation - can't remember %. Submit first 2 chapters over the course of the semester (around 10 pgs. each) - 30% ea. Final portfolio - edit and resubmit the first chapter. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 23, 2012",
            "review_content": "\nShe was probably one of the worst writing teachers I've ever met.Granted, I didn't come out of her class with a terrible grade but she couldn't even motivate the students in our class to participate. She would constantly call out people who were just fidgeting to ask them if they were on their cell phone, and then say with a not-so-sincere smile, \"oh you know me, I'm just asking because it's my pet peeve.\" She was so enthusiastic about teaching but her teaching methods were difficult for the class to accept or be interested in because it wasn't reflecting the type of essays we had to learn how to write, but rather how she thought we should right, through her experience as writer and a journalist(which she mentions several several several times through out the course). Even if you made the corrections, you could not ensure your grade would improve from your draft. Homework is barely reviewed with any enthusiasm in class but the minute she realizes someone hasn't completed it, she throws the biggest fuss. class not recommended at all.\nWorkload:\n3 essays, part of the grade is left up to her discretion, solid class to get a B, if you want any higher, try sucking up to her or being the one person that's actively engaging in conversation with her. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 24, 2010",
            "review_content": "\nI completely disagree with the past reviews of Jen. They in fact were extremely detrimental to me at first, because I went in thinking that her class was going to be hell. It was far from that. She was enthusiastic, insightful, and incredibly passionate about our class, and she worked extremely hard to help each and everyone of us improve. In no way was she unfair or unnecessarily tough, and in fact, I would say she was extremely fair and just in her grading. She was great with meeting outside of class, and she was great with email correspondence and such. Yes she is a tough grader, but she wasn't unfair. She always gave good insight to help you improve on the next paper\nShe was awesome, and she made every single class enjoyable. I had her class 6 to 730 at night twice a week, and even with such an awful time, I always looked forward to the class. She gets everyone involved, and really values what everyone says. She is tough, but really amazing. She helped me a ton, and although only a freshman, she was by far, my favorite teacher so far. TAKE HER CLASS\nWorkload:\ntypical three essays, ranging from 4-9 pages, homework assignments each night, but they arent graded, and there is no homework grade. Just put some effort into them and you will be fine. Workload was similar to other classes, but 4th and final essay that most classes have isnt even assigned in this class. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 18, 2010",
            "review_content": "\nLiterally, Jennifer Miller is the WORST university writing teacher you could possibly get. If you end up in her section, SWITCH OUT. I worked my ass off in that class - literally, spent hours writing/editing her papers and to no avail. First of all, Jen told us at the beginning of the year that we were going to \"break free from the confines of academic writing.\" Um, hello, this is supposed to be UNIVERSITY WRITING. We are supposed to be practicing writing FOR A UNIVERSITY - IE ACADEMIC WRITING. So instead of having clear, concise papers with THESIS STATEMENTS, we had these stream of consciousness-esque papers with THESIS QUESTIONS. I went to the writing center for my research paper and my editor asked me why I had posed a thesis question - I told her that my UW teacher had required it. She frowned and said that thesis questions are incredibly weak and that she couldn't believe there was a writing teacher out there who would emphasize thesis questions. \nAlso, Jen told us at the end of the year that \"grades didn't matter\" and that, while we ALL had IMPROVED, our improvement would NOT be reflected in our grades.  Honestly, if she had just told me up front that an A was unattainable, I would not have killed myself all year. I ended up barely making an A- but for the amount of work I put in, it was not worth it at all. This class is frustrating, annoying, and above all, worthless. I felt my writing weaken throughout the semester. None of my other professors would accept a paper written in the style Miller advocated so I have literally forced myself to forget everything I was \"taught\" in that class. \nOne of the worst things about the class is how misleading Jen's comments were.  She would write at the end of every draft, \"This is so close to being a terrific paper and your argument is so sophisticated... Great job! Can't wait for the next draft!\" And then she would completely slam you on your final paper, even though you adopted her changes AND tried to make the paper the best it could possibly be. Honestly, I couldn't take another second of that class. It's incredibly incredibly frustrating - and just fyi, Miller will call you out on your poor writing in class, so just be prepared. She will literally read one of your sentences aloud and tell you in front of everyone how bad it was.\nIn short, do NOT take this class. It is the worst decision you could possibly make.\nWorkload:\n3 papers (lens, conversation, research) and one \"letter to her prospective students.\" You can work your ass off to try and make an A-. If you slack off, chances are you'll make a B+ or B. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 16, 2010",
            "review_content": "\nOn the first day of class Jen scared me a little, all gleaming smile and eager eyes, but after a few days I realized she was like that because she actually cared about us. She offered fasinating essays for us to read, and in the course of discussion drew out deeper, more complex ideas about the text from each of us. Through individual conferences, quick email responses, and regular check-ins about the effectiveness and interest level of the homework she made sure we were involved. All the same, Jen's class was hardly easy. With a background in both journalism and fiction, she has a critical eye that can be frustrating, but that forced me to consider larger, more complex issues, and the editorial, conversational approach to essay-writing produced more refined, nuanced pieces. Her class helped me think far more clearly and analytically, but moreover, it was fun. We held debates with students taking on the personas and opinions of various writers we'd been reading, and loud defenses of essays in order to determine which one would be our next focus. I honestly looked forward to this class every week. Jen is sharp, witty, kind, helpful, and very funny. Ask her to play the banjo for you!\nWorkload:\nThree essays, ranging from 5-10 pages; always a reading, essay outline, or question set between classes. Still, all the work is actually beneficial and forces meaningful thought. If you don't like an assignment, tell her and she might actually do something about it!\n"
        }
    ]
}