{
    "prof_info": [
        {
            "prof_name": "Peter Bearman",
            "prof_id": 286,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "The Social World",
            "review_date": "January 08, 2015",
            "review_content": "\nThis class was not difficult, but an unnecessary amount of work for a basic sociology course. Bearman always said that he needed to give us assignments to generate grade variance, but the amount of work we were assigned at the end of the semester did way more that that. (see below for workload section). Bearman came in and simply read word for word off of his lecture notes which were posted for us online before the final (even his jokes and tangents were written down on the lecture notes). The TAs were fine- not great not particularly terrible. I thought Adam (the head TA) contributed too much during discussion to the point that he was just talking back and forth with Bearman about things not relevant to class discussion, taking up students' time for no reason. \nThe material was interesting- I do feel like I have an understanding of basic sociological principles and why we act the way we do.  \nThere are 1-2 reading for every class. You don't always have to do them, but there are quizzes (5 throughout the semester) =. These quizzes are very easy, 1 question to see if you did the reading or not, but if you go to lecture, Bearman usually announces a \"pop\" quiz for the following class, so do the reading then. His lectures do a pretty good job of covering the readings\nWorkload:\n1-2 readings per class (3 books towards the end), 5 pop quizzes (a joke), 3 assignments, 1 GIANT paper/group project that takes up the second half of the semester, 1 in class final, 1 take home final (essays)\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 25, 2011",
            "review_content": "\nThis class was at 9a.m. and it was not fun. For most of the classes, I either took a nap, didn't go, or played around on my phone (no laptops/electronics). I was considering a sociology major, I'm rethinking it and not taking any sociology classes next semester. \nBearman knows his stuff, and he's a pretty interesting guy, but I didn't find the class intriguing enough to stay awake or pay attention, especially since the TAs took notes and then put them online (and the notes were from what I gather as word-for-word of the lecture as possible). As the semester got busier and busier, I invested less and less time in the class (in terms of reading and going to class). The reading itself is pretty interesting but can be dense at times, plus there's a lot of it and the syllabus was pretty confusing as to what we should have read for what class, so I stopped trying to do the reading sometime in the middle of the semester. It could be my fault that I didn't get a lot out of the class, but I was having higher expectations based on the reviews and that Bearman is supposed to be a pretty cool and very smart guy. It seemed, however, that he didn't really care about the class at all, so it's pretty strange that he's taking some time off to reevaluate/improve his teaching methods.\nThe final exam was painful -- take home, 15 multiple choice, 5 (pick 5 out of 8) short answer (re assigned at the beginning of the semester (based on availability time wise) and I thought it was pretty fair.  \nWorkload:\ngrade broken down as follows:\n8% x 3 assignments = 24%\n2% x 5 random pop quizzes, drop lowest = 8%\n4% x 2 final project preparation forms = 8%\nfinal project = 20% \nfinal exam = 40%\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "November 18, 2011",
            "review_content": "\nThis is not an easy class. That said, it is completely manageable and possible to do well. However, the bi-weekly readings and \"fun\" assignments are often somewhat painful to go through as they are completely open-ended with no real guidance. \nThe TAs are very helpful though and hold optional office hours every week. Go to the office hours! Despite the large size of this class, there are no discussion sections. So if you are unclear or have questions, go to your TA, please don't be one of those annoying students (usually girls in the front row) who constantly ask inane questions.\nBearman is witty enough to be entertaining at points, but the material is largely dry (we spent most of September on why people commit suicide). \nDefinitely the last sociology class I'll be taking.\nWorkload:\nMeh. 50-100 pages/week, a couple of books, 5 pop quizzes, several short assignments, one ridiculous project, 3 day take home final.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "November 14, 2011",
            "review_content": "\nPeter Bearman is the epitome of what you would expect a college professor to be. He's absolutely brilliant, a casual but cool dresser and has this spiky hair that never seems to be totally flattened on his head. He also has the most blunt and unenthusiastic sense of humor you can possibly imagine (and glasses that are always breaking.) He'll joke about how one is supposed to acquire drugs by networking, and he loves bringing up the fact that Columbia is an elite university. (It's not in an arrogant way-it's actually hilarious.)\nThis is a pretty interesting class, coming from someone who didn't actually know what sociology was before she took this class. It is important to note that it is not a survey course, teaching you the basic concepts of sociology; it is rather a study of the methodology used to study sociology. When each method is covered, however, it is coupled with sociological concepts.\nSometimes, class can be boring, especially since the TA's take notes and post them on Courseworks for you-so if you're one of those people who has to take notes to pay attention, I recommend taking notes anyway. But if you're interested in working hard and learning a tremendous amount about sociology, you should take it. Bearman is a chiller, but it isn't a joke class in which you can get away with not doing any work. \n(for Barnard students-it fulfills SOC perfectly)\nWorkload:\nBi-weekly readings that can be very long and sometimes difficult to get to. You sort of have to do them, though because every so often, there are pop quizzes. If you work it out with a group of friends, you can manage to split up the readings and then brief each other before class in case of a quiz.\nNo midterm, rather 2 smallish papers not longer than 3-4 pages, a huge hands on research project that can be done in groups if you'd like and an open book take-home final exam over the course of a few days.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "January 04, 2011",
            "review_content": "\nThis class is interesting.  The material is interesting and engaging yet I failed to see an overall theme in the material presented in class.  It seemed like isolated topics instead of a cohesive class-so I can't say I have an amazing understanding into sociology as a discipline.  That said, the TAs took notes for you so there was no pressure on you to listen or take notes.  Most of my friends spent the class half listening and half reading the paper/playing games on their phones.  Though many people failed to show up to class at all.  There are mini pop quizzes so he can grade you on participation but it seemed like only a few people bothered doing the reading every night.  DO it when you think there will be a quiz and just skim enough so you can BS because that seemed to be okay. There were 2 mini soc projects that didn't seem to have too much direction but ended up not being a big deal - assuming you have a good TA. Mine sucked so Bearman, nicely, ended up rereading and regrading my papers when he disagreed with the TA's grade.  There is also a final project and a take home final.  The project also does not have too much direction and requires a lot of work but the TA can help you and my group ended up doing really well.  I advise working in small groups bc he recommends group work yet then says that the more people, the more you have to do.  The take home final isn't bad because you have all of the notes from the TAs.\nIf TA Alix Rule is still there - go to her for help with everything bc she is amazingggggg and extremely helpful!  Especially when Bearman is vague when explaining assignments.\nIn the end, class wasn't too bad.  Def take with friends because between the lectures and project, you will def have a lot of time to hang out and chill with each other.\nOh and please don't be one of those annoying kids in the front who raises their hand every second.  Nobody really cares about your personal life and what you have to say. When the teacher begins to look irritated when you raise your hand and he has to call on you - take a hint!\nWorkload:\n5 pop quizzes, 2 small assignments, 1 final project, 1 take home final\ncan't tell you how the grading went because it is already into January and our grades are still not up......\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "January 01, 2011",
            "review_content": "\nThe review that talks about this class being quality chill time is really wrong. Okay, yeah, Bearman is really intelligent and funny, and it's true that there are 5 easy quizzes. But you do have to do the reading. I did it, and I got a 100 average for the quizzes - other people didn't because they didn't read. It's a lot of work, especially for an intro soc. course. The project is a ton of work to do, too (that is, if you want to do well). And the final was take home and took a long time. \nI regretted taking the course a lot during the semester and I even considered PDFing it, but now that I look back I'm glad I took it. The material was really interesting, and it did get me to think about the world and social relationships differently. I'm pretty sure this was because I put a lot of time into actually doing the reading and the project. So if you are a lazy ass, like the person who called it quality chill time, maybe this isn't for you. But it is Columbia, and it is college, so suck it up and do the work. It will cause some headaches at some points (especially if the TA system isn't cleaned up and they never get organized). But just take the class. It was worth it in the end. \nWorkload:\nReading for each class, 5 pop quizzes (one of the grades gets dropped), 2 smaller assignments, one big project done in a group, and a very long take home final. \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 24, 2010",
            "review_content": "\nThis class was mediocre. Bearman is funny for sure, and the material is interesting. My problem throughout the semester was Bearman's effort to turn the 100+ person lecture into a discussion. In my time at Columbia, I have learned that there should never, ever be a discussion class with more than 30 people, but most professors don't know that. Listening to the same four people spit out answers to Bearman's hypothetical questions (sometimes without even waiting to be called on) just to hear their own voice was excruciating. I was very interested in what Bearman had to say. However, I was not in the least interested in what these few people had to say. \nMaybe my class was an aberration, but if every Social World section is this way, I can't in good conscience recommend it. The research project is a LOT of work, and the class is extremely disorganized. The TAs told us they would take notes and discouraged us from taking our own and then a bunch of lectures were missing from their notes when it came time to take the final. Plus it's at 9am. After October I almost never went because I couldn't control my urge to strangle all the people who sat in the front row and engaged in conversation with Bearman right during his lecture. I mean, come on.\nWorkload:\n5 really easy quizzes (one of the 5 is dropped), research project, take home final which literally took me 11 hours to complete\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 21, 2010",
            "review_content": "\nPeter Bearman is the man. There is no other way to put it. He rocks life and this class was some good, clean fun. Best part is that you never have to take notes (or, really, even pay attention a little bit) because he has the TAs take notes and post them online later because he wants you to participate and stuff. Unbelievable. Even better, there's no midterm, one project, a bunch of pop quizzes (which I discovered you can just BS blindly and still get a 5 of 5), two smaller projects, and a take-home final. I'd recommend taking the class with a bunch of friends because it's quality chill time. If you're taking this to be a sociology major, I'm not sure how much sociology I learned, but if you're taking it as a random elective, it rocks. Do it. Bearman is the best.\nWorkload:\n5 quizzes (drops one), 2 small paper/projects, 1 big project, take-home final. There's reading but just about no one does it. Maybe skim it before class when you think there will be a quiz so you have material to BS with.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "January 21, 2010",
            "review_content": "\nWhat an absolutely brilliant man and fantastic professor.  Professor Bearman is also funny, engaging, insightful, and understanding.  He takes a completely fresh and unique approach to teaching an intro level sociology course.  He never bothered teaching stale subjects like the history of the field or various subdivisions within the field.  Instead, he was preoccupied with getting us to think like sociologists.  His TAs were also great (especially Olivia) and they did us the oh so helpful favor of posting detailed notes from every class online.  The class was never overwhelming or too hard.  It was clear he cared more about us learning than getting good grades, but he also made it super easy to do well in the class.  The majority of assignments ranged from 3 to 5 points and they drop the lowest quiz (which are all 3 points).  The grading was fair and there was always a chance to bring your grade up.  I would recommend this class to anyone.  He is by far the best professor I've had at Barnard or Columbia!\nWorkload:\nLots of reading (you can get away with not doing most of it though), a few 5 point assignments, a couple 3 point occasionally actually pop-quizzes, a huge final research project (you can work in a group though), and a take-home mostly multiple-choice final.  Everything is graded fairly, nothing was too tough.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "January 09, 2010",
            "review_content": "\nProfessor Bearman is a brilliant professor. He teaches very well and has very interesting things to talk about. He is funny and witty and will keep you focused and interested throughout his lectures. The lectures were enjoyable and the material chosen by him, especially the books for this course were all very interesting to read. It's a great introductory Sociology course and I highly recommend taking it with this Professor. \nOne downside is that the grading is done by the TAs so your grades will really depend on what your TA is like. My TA, Roz, was a harsh grader.\nThe second downside of this course was that we had Multiple choice quizzes in class throughout the semester, but when we got our take home final, it consisted of essays. We had not written essays at all in this class before, so that was difficult. We should have had some practice of writing essays in the class before the final exam.\nWorkload:\nAverage\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "January 06, 2010",
            "review_content": "\nI really liked Bearman.  He makes a giant lecture feel like a discussion section.  I thought that the class was great too.  Instead of focusing exclusively on numbers or social theory or methodology, it touched on all aspects of sociology and gave me a good view of the field in general... which at the end Bearman says really isn't a single field at all.\nThe readings were interesting.  I though I could have gotten by without doing them, but I did them all.  They were very interesting and a pretty diverse.  There are a few times when you have to read a whole book all at once, so I would suggest planning ahead and coming up with a way to tackle it.\nThe final was a take-home, which I though was kind of hard, other than that there were a few quizes, mostly based on class discussion and the lectures rather than the readings.\nWorkload:\nVery manageable and fun. \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 18, 2009",
            "review_content": "\nLike the previous reviewer, Bearman is certainly quite approachable and funny (quite blunt in his humor). Definitely go to his office hours and bounce ideas off. He managed to pull off a decent discussion with a 40-50 person class. He'd pose an interesting question, solicit answers and write them on the board - he'd digest badly worded, half-thought-out comments and produce perfectly sociologically technical insights, making you feel like your comment was quite smart. \nReally, he's just a very intelligent, creative guy (you have to keep up with his deft speed as he moves from point to point). He randomly thought of a way to reproduce the pattern of socioeconomic inequality in the US through a game of flipping pennies. Around 2001, he organized his entire class to do fieldwork on a sociological report on Doormen, which was published. \nHe's a bit of a idiosyncratic person. This intro class covered a motley of topics, not your usual sociology fare: suicide, education, religion, labor, and freedom/constraint (in context of collective action in totalitarianism). They didn't all jive together but he managed to pull out key sociological insights.\n\nWorkload:\nThe beauty of this class, and i'm not sure if he'll teach it the same way, is that the TAs took lecture notes for us, there was no discussion section, and the final was take-home. To be honest, I did 60% of the reading and slept through 20% of the lectures (9am class). As a result? I bombed a reading quiz, but did adequate or fine in the rest. The take-home final tested understanding of concepts, which I appreciated; I just read through all the lectures notes that were compiled in order to answer it, and they were largely sufficient. The projects and assignments he gives us are fun and are largely not really connected to the readings, meaning once again, you don't really have to read all the readings extensively (he goes over them decently well in lecture). \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 14, 2009",
            "review_content": "\nProf. Bearman is really cool and witty. He was also very personable and didn't mind sharing stories of how his wife kept him from wearing the same pants everyday, or of his experience in granting a security officer the \"gift of autonomy.\" At the same time, he's very laid back and approachable. He was never arrogant, and encouraged students to share their ideas. The readings were also interesting; I now know how to produce Nazis, and that kindergarten students are taught to walk during fire drills so that their teachers can conveniently run around them. I also liked the matter-of-factness of some of the articles - who ever knew the word \"ghetto\" was a technical term (and I'm not talking about Jewish ghettos)? (FYI see: Social Class and Teacher Expectations: The Self-fulfilling Prophecy in Ghetto Education by Ray Rist). But on a serious note, the course was a great introduction to sociology. Prof. Bearman is very knowledgeable. The class was a little unorganized at times, but what class isn't? And I'm not sure if this helps, but you can think of Prof. Bearman as Charlie; he had 3 Angels. Actually they were TAs, and only one of them was any good, but you get the picture.\nWorkload:\nNot bad at all. We had three assignments just to get our hands wet. About six mini quizzes during the whole semester, but if you paid attention during the previous class and take the readings seriously, you should do fine. No midterm, but a final paper (2000 words) on a sociological problem of your choice. And the final exam (really the first and only exam) was take-home.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "June 25, 2006",
            "review_content": "\nI really enjoyed this class.  I think Bearman is bright and thought provoking.  I found myself looking forward to class even though it was at 9am.  As stated by previous reviewers, the exchange is a bit loose, however I found every discussion intersting.  I am usually a frantic note taker, however I discovered at the end of the semester that I did not have extensive notes on the class rather I just sat, listened and learned a ton.  The T.A. he brought along was super cool and always willing to help out.  The workload was not bad at all and as long as you followed the directions, the assignments were easy to complete and I thought the grading was more than fair.  In addition to this, Bearman has a great sense of humor (although at times it is a bit warped and twisted) He makes funny, quirky jokes that keeps the class rolling and there is never a dull moment.  I absolutely recommend this class.  \nWorkload:\nWeekly memos (which were usually a one page review of a sociology study) Three book reports (3-5 pages each).  A final paper (which is a study on anything you want).  \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "October 30, 2002",
            "review_content": "\nBearman is a brilliant teacher, I loved his class. He makes insightful, complex, witty and otherwise critically interesting arguments about all facets of social interaction,and refuses to reduce concepts to simplicities or examples. He is well versed in many areas of social theory, but instead of throwing them in your face, he tries to draw these ideas (in their full strength and weakness) out in class discussions. Some of the best discussions involved the above criticised \"tangential ideas\", but as off topic as they might have been, they were satisfying and just as interesting as what we were 'supposed' to be talking about (its a survey course anyway, why all the fuss?!) . The class operates on the astoundingly simple notion that thinking very critically and very specifically about things in a certain way (Evaluation of Evidence!) can lead to interesting ideas. On the other hand, those students who dont understand this approach feel frustrated by the looseness of the exchange. I could practically hear some students going \"Huh?!\" as they looked at each other, during some class discussions. Too bad, but if the class is not for you, its not for you. One or two days should let you know.\nWorkload:\nSee other reviews. You get to read some of the most interesting and important research and theory in the field, to date.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "August 31, 2002",
            "review_content": "\nProfessor Bearman comes across, at first, very charming and engaging. However, he will spend the rest of the semester going on tangents that have nothing to do with anything. Even though he brings along 2 TA's, you hardly ever get any guidance from the 3 of them about the projects. You never really know how you're doing in the class and never really get a grasp on what the point is. Stay away if you're not a sociolgy major\nWorkload:\nWeekly readings, 3 small projects, a book review, and one major project (no help on any of the work)\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "May 11, 2002",
            "review_content": "\nThis was possibly the worst class I have taken at Columbia. There was absolutely no point to ever going to class, because nothing substantial was covered. There were three analytical assignments, and a final paper which we could chose any topic we wanted. Absolutely no guidance was given for any of work, and the class leaned nothing about what sociology is. Bearman is the worst professor I have ever taken. You will learn absolutely nothing by taking his class. \nWorkload:\nThree shorter projects, one critical book review, and one longer final research project. Not necessary to do ANY of the readings because they didn't apply to anything discussed in class\n"
        },
        {
            "course_name": "V1205 Evaluation of Evidence",
            "review_date": "December 31, 1999",
            "review_content": "\nProbably the most likable and sharpest guy in the department for the things he's interested in. The class does not have traditional assignments. It's all based on collecting, manipulating, and digesting social science data. Lectures are fun and engaging, but suck if no one gets a fire lit under them. He's no BS-er, so come serious, even if not \"prepared\" for any session's reading; if you are truly interested in the material (which is interesting...lectures span on tangible topics in a student's life, like dating, and I dare say, probably in bad taste in light of the past year or two, suicide), then it will show, and that's what he really cares about. Some professors are picky about the material, and stodgy when it comes to idea generation. But Bearman is a versatile and open thinker. Some may not be prepared for anything other than orthodox lecturing approaches; others will eat it up. Intellectual adventures, welcome.\nWorkload:\n4 pratical assignments that require you to collect or create data and analyze it. End of the semester may be variable, but usually he allows you to pick between a couple of books for in-depth study. My class picked among three interesting books, one about the Holocaust, one about inner city gangs and race, and the last choice was the Salem witch hunts. No midterm, and the final is a data collection project of your own creation.... but, by his own admission, the final could be something wild and new.\n"
        }
    ]
}