{
    "prof_info": [
        {
            "prof_name": "Kathleen McKeown",
            "prof_id": 2142,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Natural Language Processing",
            "review_date": "March 12, 2009",
            "review_content": "\nShe did a good job of covering the material and explaining what she expected for the midterms.  About what you'd expect for this level class.  There was a curve.\nhttp://www1.cs.columbia.edu/~kathy/NLP/\nWorkload:\n3 projects (in perl or java), 1 homework and 2 standard exams.\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "January 15, 2006",
            "review_content": "\nA very good class and professor. Taking Artificial Intelligence with Professor Mckeown convinced me to pursue AI and computer science further. Very highly recommended.\nWorkload:\n1 midterm, 1 final (both reasonable), and a number of programming assignments that you can spend as much time on as you want to.\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "January 10, 2006",
            "review_content": "\nI took this course in the Spring of 2004 and found it challenging and useful. The course covered the requisite material thoroughly, and offered intriguing (and sometimes quite difficult) programming assignments. Other reviewers complain about the focus on 'boring algorithmic parts' and lack of attention to philosophical implications. This is both ironic and inaccurate on a number of counts. First, the early part of the course was dedicated to a thorough consideration of the difference between human-like and rational behavior; in addition, a number of readings were posted over the term that addressed just these issues. Second, this course is offered in a computer science department; the capacity of computer scientists to have impact on scientific or philosophical problems is founded in the algorithmic details. Glossing over this material would cheat serious students who are willing to do the work. I enjoyed the course and still discuss and apply the material I learned.\nWorkload:\nHeavy, but consistent with other upper-level courses required for a Ph.D. in computer science.\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "April 25, 2005",
            "review_content": "\nProf McKeown is a nice lady. Let's say that first.\nShe's a pretty lousy professor, though. It's hard to tell whether she's just bored with the material, or doesn't know how to make it interesting, or just doesn't care. In any event, her classes consist of a series of slides that are pretty much straight from the textbook, and a lecture delivered in monotone. She seems actively disinterested in any of the interesting intellectual, scientific, or philosophical implications of the material, and instead grinds through the most boring algorithmic parts, yet without enough detail or mathematical sophistication to make it worthwhile.\nAvoid if possible.\nWorkload:\nFair. A few projects that can will take as much work as you give them.\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "July 23, 2004",
            "review_content": "\nA very nice professor who cares enough to learn everyones name in the relatively large class. \nBut I don't think she was born to teach. She is very well prepared in that she has everything on powerpoint, but she's not so great at answering questions that aren't in the powerpoint plan. She's also rather bad at coming up with good test questions, asking students to go through every step of an algorithm that is easy for computers, but painfully tedius for humans, and making that worth almost half the midterm. (And giving a full blue book for it).\nThe subject is fascinating, and if no one else is teaching it, I still highly recommend taking it. Kathleen Mckeown is a great professor if you want a friend and a nice office hours buddy, is knowledgeable and cares, but just isn't a born teacher.\nWorkload:\n3 or 4 programming assignments, 1 very large one. midterm, final. Most of your time will be spent on the programming, but at least I found that to be the best part. You make some pretty damn cool stuff. \n"
        }
    ]
}