{
    "prof_info": [
        {
            "prof_name": "Charles Armstrong",
            "prof_id": 1775,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 21, 2016",
            "review_content": "\nProfessor Armstrong is an absolutely wonderful professor who cares deeply about his students. I have had some of the most interesting and thought-provoking discussions in his CC class and he made a good-faith effort in bringing in alternative viewpoints from non-Western cultures. The only downside is that I believe I would have got more from this class had it been more rigorous. \nWorkload:\nStandard workload: coursework post before each class, a midterm, a final, and two 6-page essays\n"
        },
        {
            "course_name": "The History of Modern Korea",
            "review_date": "June 10, 2011",
            "review_content": "\nArmstrong's strength lies singlehandedly in his lectures. As a (relatively) young professor and still a brilliant historian, Charles' lectures certainly keep you engaged and combine both the trite factual aspect of history with a youthful dynamism. He also seems to have a large propensity towards film and other popular media, and he will show you various clips relevant to the topic at hand. If you are interested in social history, or the development of Korean (or Asian in general) society, Armstrong is superb in painting a comprehensive picture of historical development.\nAs a person I felt he was not so approachable, but if you ask him a question he will provide a satisfactory answer. It was also difficult to meet him outside of class considering his busy schedule, but if you have a question concerning the essay or any background knowledge, do not pass by the opportunity to go see him.\nWorkload:\n10-page essay, midterm, final - easy\n"
        },
        {
            "course_name": "Asia-Pacific Wars 1931-1975",
            "review_date": "February 01, 2009",
            "review_content": "\nIt has been well over a year since I took Prof. Armstrong's course, which at first I was very \"meh\" about, and I still use a lot of what I learned in that class in other history courses. If you have any interest in military history, any of the wars covered (World War II, Korean War, Vietnam War(s), and the Cambodian genocide), or Asian history, I highly recommend this class. My only regret is that I did not spend as much time on this class as it deserved. I rushed my final paper and skimmed most of the readings. If you do take this class, it deserves attention. The class does have a lot of reading but all of it is well chosen and interesting when you take the time to do it.\nProfessor Armstrong is really underrated; as one of the reviewers noted below he seems a bit dry (although he does have a sense of humor) and unapproachable but the depth of his knowledge and his ability to pack a LOT of information into one lecture is really wonderful. This man has more information in his pinky finger than most of the other professors in the History Department combined. He was also very quick to offer personal anecdotes about his time in Korea and Japan and personal photos from his visit to North Korea, which was very insightful. He is an interesting man who is passionate about his work and I regret not speaking to him more than once the whole semester.\nHe also offers an expanded look on each of the wars discussed. Instead of just focusing on Japanese militarism, he lectured a lot about racism and propaganda on both sides. For our Vietnam unit, he brought in two guest lecturers including Marilyn Young, who wrote one of the histories we read. Furthermore, he used video and music A LOT which really added to the class. Although the class was predominantly students who specialized in US history, it would be a really interesting class for anyone who is interested in modern, world history.\nWorkload:\n100-150 pages of reading a week, a weekly coursework posting, discussion section, one large research paper (10-15 pages), a midterm (a map, IDs, and two essays) and a final exam (IDs and three essays I think)\n"
        },
        {
            "course_name": "Asia-Pacific Wars 1931-1975",
            "review_date": "March 07, 2008",
            "review_content": "\nAt the beginning of this class, I felt ambivalent towards both Charles and the material. However, I came to realize that Charles is a damn good lecturer, he packs a lot in a single session and covers everything you need to know. And now that the class is over, I also realized that I learned a lot from him. This class was a little more work than other history lectures, but you don't necessarily have to do all of it. Overall, I would recommend it if you're interested in any of these wars, time period or Asian history.\nWorkload:\n100 pages a week, weekly responses on courseworks, a midterm and final with ids and essays, and a 10-15 page paper on topic of your choice.\n"
        },
        {
            "course_name": "Asia-Pacific Wars 1931-1975",
            "review_date": "January 01, 2005",
            "review_content": "\nThe first day, I thought this class was going to be awful.  Prof. Armstrong, as one reviewer noted, does not project his voice very well.  However, once you take the time to listen in a bit, you realize that even though he cannot project much, this does not mean that he is not a good speaker.  He has a really great sense of humor, and his lectures are always fascinating.  After a while, I entirely forgot that he was not projecting much; honestly, he is never difficult to hear.  The subject matter is also really fascinating.  My one complaint would be that he uses a LOT of movies (although I think this was exacerbated in my class by a few unexpected trips / absences).  Aside from that, great professor and great class!\nWorkload:\nA fair amount of reading-- maybe 6 or 7 (give or take a few)fairly dense history books?-- and one film.  Two 6-8 page papers, midterm, and final.  Nothing too outrageously difficult if you do all (or at least most) of the reading and come to the lectures.  All grading is done by the TAs.\n"
        },
        {
            "course_name": "Asia-Pacific Wars 1931-1975",
            "review_date": "April 10, 2004",
            "review_content": "\nProfessor Armstrong is an amazing professor. He taught this course for the first time last fall and I am truely pleased to have taken it. His lectures are interesting and the assigned reading is good also. While having to watch movies for the course is rather annoying, this movies are great, and you also do not have to go to all of them. The workload is fair: a midterm, final, and a term paper on anything you please. Take this course, and any other course offered by Professor Armstrong\nWorkload:\nMidterm, Final, Term Paper\n"
        },
        {
            "course_name": "Introduction to East Asian Civilizations: Korea",
            "review_date": "February 16, 2004",
            "review_content": "\nNice guy for sure, definitely knows his stuff, but the combination of the awful acoustics of the room and his inability to project his voice, as well as the completely uninteresting material of the first part of the class make it difficult to stay awake, much less pay attention in lectures. It's not really essential to go to lectures anyway, except right before the tests, when he gives out a review sheet.\nAs for discussion sections, both terms he started the first class by saying how he was going to set one up, looking around the room, and commenting, \"Wow, we have more people here than expected...\" So the only discussion is on courseworks. It's required but not graded. There's a midterm, final, and 8-10 page paper (10-15 I think for Modern). He does try to make some of the classes interesting with films and guests, and the modern section of intro is much more pleasant, though still a little dry. Overall, probably a good choice for Major Cultures.\nWorkload:\nIntro: Midterm and final (mine wasn't cumulative), pretty fair. Paper, graded by TAs leniently. Weekly posting on courseworks. Not all of the reading is completely necessary.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilizations: Korea",
            "review_date": "January 19, 2004",
            "review_content": "\nCharles Armstrong is a pretty laid back professor. His biggest downside is that he does not project well when lecturing and does not seem too enthusiastic, but he definitely enjoys the material (at least the modern part) and is interested in talking about it. Korean Civ is a major cultures List A course, but unlike Japan or China, it does not have a discussion section (or didn't in Fall 2003); discussion is done through courseworks. I would guess that it's one of the easier List A's out there. Grading is usually handled by TA's who weren't the sharpest Korean historians and were generally easy-going like Armstrong. The readings for the course weren't too long, but a lot of them were devoted to a useless book of primary sources, so if you ignored those, there wasn't much at all (maybe 500 pages the whole semester). I think reading the main text, Korea: Old and New, and paying attention in lectures (sometimes difficult) is all you really need to do really well in this course. I thought the first half of the course wasn't too interesting, but as the semester progressed the material improved.\nWorkload:\nstandard to light reading load, one 8 page \"research\" paper (you could compare and contrast two books), weekly courseworks postings, midterm, final - tests straightforward.\n"
        },
        {
            "course_name": "Pacific-Asia Wars",
            "review_date": "January 18, 2004",
            "review_content": "\nHe's a good teacher, and the subject matter in this course was fascinating, so I'd definitely recommend it.  Until midterms the course focuses on Japan in World War II, its aggression in Asia and the Pacific, its diplomacy and internal political wrangling.  Then the course moves forward to the Korean War, then to the Vietnam War.  It's not a military history course, and it's not a social history course either, though it necessarily touches on each of those issues.  More than anything it's a study of diplomatic history.  His lectures were always informative and interesting enough, though he's not the best lecturer at Columbia.  (He's young, and sometimes he seemed a bit nervous in his role as professor, and like he's still learning how to do the job.)  He's at his best talking about the Korean War--Korea is his specialty.  He also regularly talked about current affairs, drawing conclusions and parallels from the conflicts we'd been studying and discussing their contemporary relevance, while warning us not to overgeneralize.  (In fact, on the final we could choose to write an essay detailing the advice we would give US policy-makers on any international issue(s) based on our \"expertise\" on the Pacific-Asia Wars.)  Prof. Armstrong is also a warm, easy-going guy who routinely opens his lectures to discussion and cracks somewhat dry, satirical jokes.  However, the one time I approached him to talk, he acted quite distracted--I wasn't sure if he was uninterested in what I was saying, ill-at-ease, or thought he had more urgent things to do, or some combination of the above.  He's also a movie fanatic, and tries to spread his enthusiasm to the class by showing lots of required films on the wars.  They were interesting but maybe not the best use of our time, all in all.  But it doesn't matter because it's truly unneccessary to watch them, if you really don't want to.  The readings were all very informative, though a few were a bit dry; the others were great all-around.\nWorkload:\nModerate.  Two texts on WWII, one on Korea and one on Vietnam, plus one short novel, for the entire semester.  Regular movie screenings if you want to go.  Midterm, final, which are very fair and graded in a pretty relaxed manner.  One paper based on a moderate amount of outside research, on basically any related topic, of about 15 pages.\n"
        },
        {
            "course_name": "Modern Korea, East Asian Civ Korea",
            "review_date": "November 15, 2003",
            "review_content": "\nI had him twice, thought he was very good. Sometimes his lectures can get boring, but he brings in really interesting guest speakers and mixes it up with some movies, to keep the classes interesting. Modern Korea was a really great course, content is really interesting. I'm not really into the non modern history of Korea so I thought the Civ course was a little slow for the first couple weeks. On the whole I thought he was a great professor, he has all these weird connections to important people so he has some pretty good stories to tell.\nWorkload:\nFairly easy, a pretty good amount of reading but you don't have to read it all (just read Cummings of you want to be really lazy) only one paper-8 pages. No discussion section, which is key--let's face it, discussion sections are a waste of our time.\n"
        }
    ]
}