{
    "prof_info": [
        {
            "prof_name": "Angie Heo",
            "prof_id": 3720,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "V3855",
            "review_date": "May 17, 2011",
            "review_content": "\nAngie is a wonderful seminar leader. She encourages questions and participation, and is willing to divert the class to talk about current events (hint: she loves Egypt!) and share her personal academic interests.  Because she is kind, this seminar was a comfortable space from day one.  If she felt herself losing everyone, she kind of said \"This isn't working is it?\" in her self-assured way and just ended class early.  Definitely a teacher you should take if you have the opportunity - you will learn alot about the subject (in this case, secularism) and learn to better engage with texts along the way.\nWorkload:\nWeekly 1-2 page reading responses (the reading varied between easy and very difficult but was always interesting), present 1 week on the reading, midterm 6-8 pager, final 8-10 page paper. Normal seminar workload but she is not a hard grader.\n"
        },
        {
            "course_name": "Politics of Sensibility / Sensory Order",
            "review_date": "February 11, 2010",
            "review_content": "\nThough I agree with the below reviews on Angie as someone who will really challenge you to think and has a great passion for the texts she teaches (for anthropology in general), I can also understand the negative reviews. I took a 5 person seminar with Angie, (Politics of Sensibility and the Sensory Order), and highly recommend it. A small seminar setting is where Angie really shines as a professor. However I can see how her style of back and forth discourse and her tendancy to latch on to a certain aspect of the text and explore it in depth would be detrimental to a large intro level course such as Interpretation of cultures. If you get the opportunity to take an upper level Anthropology seminar with Angie, however, I would strongly encourage it.\nWorkload:\n2 page response papers on 8 out of 12 readings, 8-12 page midterm, 12-15 page final research paper. Challenging readings, but she doesn't grade hard--she's just looking to see that you've thought through the texts and put them together in a comprehensive manner.\n"
        },
        {
            "course_name": "Anthropology of Religion and Society",
            "review_date": "November 17, 2009",
            "review_content": "\nI took her during her first semester teaching at Barnard.  Her enthusiasm for the material, and for Anthropology in general, made class very enjoyable.  The class was early, 9:10 I believe, yet I never found myself falling asleep because the discussions were interesting and each person in our group had ample time to speak.  Angie was very approachable and encouraging during office hours.  Her analysis of the texts gave me an advantage when they were assigned in other classes.  My only regret is not keeping my notes from her class, because they would have been very useful in other classes.  I plan on taking one more class with her to fulfill an elective, if possible.  \nWorkload:\nThe readings were a bit time consuming and they had to be done because the discussions focused in on the texts very closely.  The papers were challenging, but freedom to chose topics made them enjoyable.  \n"
        },
        {
            "course_name": "Politics of Sensibility / Sensory Order",
            "review_date": "October 29, 2009",
            "review_content": "\nAngie Heo is amazing to work with closely. I have only taken really small seminars with her (5 students+professor) and it has been so rewarding. I cannot speak to the larger classes, but in small seminars the conversation flows very freely. She will challenge you to think in different ways- be prepared to think hard and back up your ideas with very close references to the text. Her classes taught me how to read more closely than I ever had, a very valuable skill when it is so easy to skim readings and get by in school with A's. She is very open to creative thinking, as long as it is grounded in the readings. She is not a professor who will humor your tangential philosophical ponderings. \nI enjoy her classes, but can't imagine taking them as a freshman or sophomore. \nAnd her enthusiasm is real- she loves working with her students\nWorkload:\nDifficult, which it should be if you are taking classes at this level. This class feels more like a grad seminar than undergrad. 2 page responses on 7 of the 10 or 11 weeks- 2 in-class short presentations, an 8 page midterm, and a 12-15 page final paper. Its not bad because the material is very enjoyable.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "September 09, 2009",
            "review_content": "\nAngie Heo is extremely nice and sort of endearing, but she does a horrible job of explaining things. The only way I managed to understand anything in this course was by looking up concepts on Wikipedia (and being surprised at the clear and succinct explanations I could find, in contrast to her rather jumbled and extended ones). Additionally, she wanted the class of about 50 to \"feel like a discussion\" and so a lot of class time was wasted sitting around awkwardly until someone made an attempt at responding to her obtuse questions and prompts. That said, the exams were not very difficult, especially if you do a little research while studying (...Wikipedia) and a lot of the reading assignments were fascinating. There was a rather difficult final paper--we had to read one of two ethnographies and then write 10 or so pages about it in relation to the course (\"analytic summary\"). Perhaps the ethnography I chose was just the more difficult one (A Space on The Side of the Road, if she continues using the same two books), but I felt that her class did very little to prepare me for the ideas and vocabulary presented in the book and thus the paper was difficult to write (but I ended up with an A in the course, so maybe she wasn't expecting much or maybe everyone else had similar issues). All in all, I would suggest taking this course, but with a different professor if possible. \nWorkload:\nRelatively easy midterm and final, a short response paper, and the final book essay. Participation was weighted more heavily than usual (25%, I think).\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 05, 2009",
            "review_content": "\nProfessor Heo attempts to teach some of the more complex points of anthro and fails miserably at achieving clarity despite tedious repetition. Interpretation of Culture focused mostly on the history of the discipline and didn't give a sense of what the field is currently like. I left the class feeling as though I had a loose sense of what some of the obscure anthro jargon means, but nothing much else. Heo is well-meaning and quite nice, but really doesn't make the lectures understandable. That said, however, if you repeat back on exams exactly what she said in lecture even though you don't understand what she is talking about, you will get an A. \nWorkload:\nMedium reading load. Midterm, final, 2 papers. Some postings on discussion board. \n"
        },
        {
            "course_name": "Ethnographies of the Middle East",
            "review_date": "May 20, 2009",
            "review_content": "\nThis seminar was one of the most disappointing classes I have taken so far here.  I want to say that Angie Heo is nice and/or well meaning, but despite this, it translates to a seminar atmosphere that is at best insipid and at worst excruciatingly frustrating.  She will interrupt at will to make space for her own opinions and quickly cut down views she disagrees with, creating an atmosphere extremely inconducive to discussion.  This might be the kind of classroom culture you would expect, and put up with from a veteran scholar-with-complex, who nevertheless manages to impart both interest and knowledge.  Unfortunately, her views were disorganized and at times incoherent, and it was difficult to accord her much academic respect.  \nWorst was the patronizing insistence that the content of the text be slowly regurgitated for the better part of an hour, instead of tracing its themes and ideas and actually discussing them or advancing new ideas and views .  The result -  a class that felt more like a resented language drill session than an upper level seminar in which the majority of people had solid fieldwork and/or a backing in both anthropology and the Middle East.  To her credit, she makes herself extremely available outside of class and seems quite engaged and excited, even earnest.  The texts read are a mixed bag, but a solid and useful set with regards to the region.  Her research interests are fascinating too - though after this semester I can safely say I'll be avoiding her courses in the future.\n\nWorkload:\nFairly standard if heavy - a dense book a week and courseworks postings, a seminar presentation, midterm paper, final research paper and final presentation [the last two compromise ~40% of your grade].  Very anal about hard copy deadlines and will grade down accordingly.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 06, 2009",
            "review_content": "\nAngie Heo is a great, enthusiastic professor who really feels passionate about anthropology. Although her lectures might get a little disorganized at times, she does try to present the material clearly and thoroughly. She does try to provoke class discussion, and is truly interested in what the class has to say. Most of the readings are very thought-provoking, and interesting. The books on the syllabus are great reads. She always encourages students to come to her office hours to talk about anything about anthropology. \nWorkload:\nThere is a lot of weekly reading, but most aren't hard to get through. 2 small papers, 1 big paper, 1 midterm, 1 final\n"
        }
    ]
}