{
    "prof_info": [
        {
            "prof_name": "Debra Minkoff",
            "prof_id": 2812,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Modern American Social Movements",
            "review_date": "March 27, 2012",
            "review_content": "\nThis class in Social Movements could have been so fantastic.  It's such a passionate subject, and the readings were excellent.  I'm just disenchanted by how little Professor Minkoff seemed to care about the subject matter and her students.  It really is a shame, considering she is the chair of the department.  There were several students she just seemed to despise, and one of them (who was very bright) eventually dropped the course about mid way through.  She just has that I'm superior and there is nothing you can do attitude about it. I don't appreciate that when I'm sincerely trying to learn.  I expect  Barnard/Columbia to have engaging  rather than condescending instructors, especially at these prices.   Because of this class, I will probably change majors.  \nWorkload:\nLots of reading, mostly very good McAdam in particular.  Midterm was ID's and pick an essay. Final Exam, Paper.  The TA had a bit to much say about grading.  Not a class to take if you need an A. \n"
        },
        {
            "course_name": "Social Movements",
            "review_date": "January 19, 2010",
            "review_content": "\nI must agree with the negative reviews of this class and the instructor.  I found Minkoff's style to be off-putting at best.  Although the readings were wonderful, the lectures did not reflect the richness of the texts.  Of most importance, however, is the fact that Minkoff is not qualified to evaluate students regardless of her standing in the department. Some top students did poorly, and some students who could barely form a sentence received superior grades.  As a result of the less than stellar teaching and evaluation, my interest in sociology in general, and social movements in specific, has been greatly diminished.  \nWorkload:\nSomewhat heavy, but you can do it all, and it won't make a difference. Some not so great students did very will, and some exceptional students did poorly. \n"
        },
        {
            "course_name": "Social Movements",
            "review_date": "July 05, 2009",
            "review_content": "\nI took Social Movements last fall, and was greatly disappointed by this class.  I found this instructor to be rather pompous, the TA (who was from NYU) not particularly knowledgeable, and the whole experience rather demeaning.  As an older GS student, I lived through some of those social movements, and can tell you first hand, the information was inaccurate.  As a student with a near perfect GPA, I was also astounded at the subjective grading, especially since I know this material inside and out, and could have taught the class in a far more engaging manner.  Needless to say, I dropped this class half way through the semester with no regrets.  I did receive a \"what I say goes,\" type response from Minkoff after expressing disbelief in the TA's arbitrary grading system.  Her inability to  listen to valid concerns combined with her I'm the chief, judge, and excecutioner mentality (unfortunately she is the chair of the Sociology department at Barnard), made this a no win situation for this top student.  Being male also did not help.  However, if you are a rather dim witted pretty female, who knows how to kiss ass, you'll do just fine.  Fore me, I want my money back!\nWorkload:\nDoesn't matter how hard you work, if she don't like you, it don' matter\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "September 09, 2007",
            "review_content": "\nIf you like sarcastic people, you'll like Minkoff. She's not the most prepared teacher but if you raise good questions, the discussion can be interesting. She chooses interesting readings for the most part (most of which IS necessary, although you could get by with some skimming in the books she assigns). You should try to get on her good side by participating as much as possible. \nWorkload:\nAvg. amount of reading; fair enough grader.\n"
        },
        {
            "course_name": "Social Movements",
            "review_date": "May 12, 2006",
            "review_content": "\nProfessor Minkoff is very intelligent and incredibly knowlegable in her field. At the beginning of the course you will probably find her lectures dull. She is not the most inspired lecturer, and until you get some kind of handle on the material you won't see the point of going to class. But let me assure you that this class is fascinating, and Professor Minkoff does a wonderful job of pulling everything together at the end. The readings are informative and sometimes even fun, and the writing assignments are relevant, short, and enjoyable. \nWorkload:\nA fair amount of reading, most of it necessary. Two 4-5 page papers, midterm and final. If you do the reading and pay attention in class, the exams are a breeze.\n"
        },
        {
            "course_name": "Funding Social Change",
            "review_date": "January 13, 2006",
            "review_content": "\nI loved this course.  Prof. Minkoff is one of the most down to earth professors I have had.  She loves what she does and really gets excited about the material which makes it so much easier for us to get excited about it. It's one of those classes where you can just sit back discuss and take in information and you don't spend classes frantically taking notes...She is very approachable and really  takes the time to get to know each of her students.  The reading load is a bit heavy but the class only meets once a week and I would take this course over again- no regrets.  She got one of the best evaluations I have given.  HIGHLY RECOMMENDED. \nWorkload:\nlots of reading, a couple of books, data collection, powerpoint presentation, final paper, narrative paper\n"
        }
    ]
}