{
    "prof_info": [
        {
            "prof_name": "Deborah Martinsen",
            "prof_id": 624,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2013",
            "review_content": "\nProfessor Martinsen is a fantastic, dedicated teacher and kind individual. She makes class interesting with a good mix between lecture and discussion, but mostly discussion. She puts a lot of time into correcting papers, gives lots of good comments and genuinely wants her students to do well. She makes you meet with her to discuss paper topics and will always help you read over a draft. Her response assignments for every class might seem like a lot of work, but they prepare you for class discussion (especially if you didn't do all the reading) and exams. I remembered a lot of passage IDs because I had analyzed them for a response. In addition to being a great teacher, Professor Martinsen is a really fun individual with a ton of passion for Dostoevsky and just literature in general.\nWorkload:\nResponse for every class that she grades on a 10-point scale, but you can miss up to four in the semester. No reading quizzes. Two papers that are shorter than the papers in a lot of other classes. Standard midterm and final.\n"
        },
        {
            "course_name": "Narratives From Underground",
            "review_date": "April 19, 2009",
            "review_content": "\nAn AMAZING professor, especially in a seminar setting. She was extremely knowledgeable and interested in the subjects we explored, having studied and published articles on them herself. She is also multilingual with a background in Slavic studies, in addition to knowing the Core like the back of her hand. She is fun to talk to, and easy to meet with, as she is frequently in her office during school hours and doesn't mind if you just drop in. Professor Martinsen is certainly not lazy, and expects the same out of her students. During class, she takes notes herself and emails them as a lengthy summary later during the week. She also gives detailed comments on every written response we have to turn in. In short, she puts a lot into every class and expects you to put in even more (and deliver results) but is more than willing to push you along the way. Basically she is who I hope to be in 30 years- intelligent, articulate, and super elegant (thank god these reviews are anonymous). \nWorkload:\none to two medium-length books per week. one written response before each session, and a final 15 page paper. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 22, 2006",
            "review_content": "\n1at semester lit hum was not enjoyable. She doesn't know how to keep a discussion going. She has things she wants to cover and gets frustrated that no one says anything because no one else is interested in them. When she finally says something vaguely interesting and people start to talk, after a couple of minutes she'll interupt the conversation to make sure we \"cover grund.\" You FEEL that she is the director of the core and you FEEL that her way/her ideas are what goes in the class. The workload is bit heavier than most LitHum classes. Nightly writing assignment on each book that while a wide range of topics take someimes between 45 min- 1.5hours to do. Her midterm is much harder than most other classes and is graded very harshly. Her papers are not so bad - its possible to do well if you write them beforehand and go over them with her. She's very strict about language, and whiel this might be helpful in tightening up writing, its frustrating because this is not a writing class - its a lithum class. \nWorkload:\nnightly writeups (can miss 5), midterm, final, 2 five page papers\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2006",
            "review_content": "\nSupposedly she's tougher than most other Lit Hum teachers (which isn't surprising because she's the Director of the Core) but she knows her stuff and cares about both the material and the students. Class discussions really depend on what kind of students you have in your class, but she's usually enthusiastic and tries to engage as many people as possible. She doesn't encourage BS but she is willing to acknlowedge students when they make a good point. Sweet, caring, and funny one-on-one.\nWorkload:\nNightly written assignments, (but you can miss 5 without penalty). 2 5-page papers. Her midterm is tougher than any other I've heard of but it preps you well for the final. 1 presentation per student. Generally a fair grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2005",
            "review_content": "\nPerhaps it's my disdain for the first semester Lit Hum books, or the often droning on of clueless first semester freshmen, but Deborah Martinsen's Lit Hum class was less than enjoyable. Although extremely and undeniably intelligent, Dr. Martinsen seems to spit out the same general themes and ideas about every book. Sure, this may be because they ARE the same themes in every book, but this fact makes this class pretty monotonous. Dr. Martinsen is energetic and encouraging, but relying on student discussion so heavily usually makes every class pretty much the same.  Plus, she's a difficult grader, but she makes very thoughtful and helpful comments so it's worth it. Her class was a decent experience: nothing to boast about, but nothing particularly terrible.\nWorkload:\nA brief 1-2 page response every class, a final-format midterm, two papers (the first can be revised and regraded), standard lit hum final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 04, 2001",
            "review_content": "\nThe best most flexible, yet incredibly challenging teacher you will ever have. Really loves teaching and is interesting to watch in class as well.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 04, 2001",
            "review_content": "\nThe best most flexible, yet incredibly challenging teacher you will ever have. Really loves teaching and is interesting to watch in class as well.\n"
        }
    ]
}