{
    "prof_info": [
        {
            "prof_name": "Burton Budick",
            "prof_id": 1713,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "General Physics I",
            "review_date": "July 02, 2015",
            "review_content": "\nThere are alot of negative reviews on here for budick, many of which made me iniatially apprehensive about signing up for his course. This was also the first college couse I have taken as I just finished the class over the summer of my senior year in high school but quickly my concern was cast away and i became captivated with Budick's lectures. If you want to really learn physics budick is the way to go. He was easily one of the best and quirkiest teachers i have had and his stories and lectures made the class especially interesting and even hilarious at times. \nBudick is however very tough to understand sometimes and I highly reccommend that if you are to take this class that you read the lecture slides he posts on courseworks before class. It is also necessary at times to read ahead; the class moves incredibly fast and if you dont go ahead youll be stuck behind. Before each exam Budick posts a series of practice tests online with his answers in the back. Often his work is difficult to follow but if you spend the time struggling through on your own first it will really pay off when you have to take the actual test.\nIf you are taking this course to prepare for the mcat he does cover topics that may be on the test.\nI also highly reccommend that you consider taking the lab along with the lecture. Columbia has some amazing resources and it is well worth it to take advantage of them (it will also help you in the class).\nWorkload:\nThere is alot of homework for this class but it is not mandatory. It will help your grade though if you are stuck between letter grades, and it is good practice so you really sould do it if you can. The first week of class he pretty much told us flat out that if we want to do well this has to be the only thing we do for the remainder of the class. He reccommends that you spend an average of four hours a day studying and this is NOT an overstatement. Many of the concepts take time to understand and if you dont practice you will have difficulties. If you are a very fast learner it may be possible to have a job while taking his class but i would not suggest doing that.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 03, 2013",
            "review_content": "\nWhile some of the reviews on here are perhaps a tiny bit extreme, it became clear to me by the time we had the first midterm that Prof. Budick has some serious teaching deficiencies. I basically taught the entire course to myself, with the help of a study group and the grad students in the study room (note that about half the grad students are useless at explaining things and/or don't speak English; the other half are great). The worst thing about Budick is his complete and all consuming inability to gauge student understanding - he had no idea, at any point in the semester, including immediately before and after exams, what students did or did not understand. When answering questions, he often trips over his own words - he clearly understands the problem in his head, but is often unable to explain how he got from step A to step B to step C. Worse, sometimes he makes minor errors when going between steps (which he often does in his head) and then this results in a serious error by the time he gets to the solution. Often he'll respond to a student's question by pointing to the board and saying, \"well, that process occurred when we went from this step to this step\", but it isn't clear to anybody how he went from A to B. Sometimes the answers on his exam solutions sheets, which he gives you to prepare for exams, are just wrong. I have always been very good at math, and actually liked both Calc I and Calc II, but sometimes his math is pretty obscure - he uses a lot of somewhat complicated trigonometric identities and weird formulas or ideas that are not intuitive to those of use who don't spend every second of our lives doing math. If you plan on doing well in this class, you had better be able to rearrange the shit out of any equation with any number of variables.\nThis is the evening section, and it is mostly post-baccs and quite competitive. I got an A- and you better believe I worked my ass off for it. This is not easy to do if you are working full-time (which I was) and also taking chem. Just be prepared for a solid 15-20+ hours of work per week, unless you're some sort of freaky physics \"natural\".\nThe final for this class was easily the worst exam that has ever happened to me (I use the word \"happened\" because I truly felt as though I had no control over the situation - it was not something I felt particularly actively involved in). There are 10 questions, worth 20 points each, and you get 3 hours. I think I only answered 120 points worth of questions, and figured there was no way I could have gotten more than 95-100/200. The questions were painfully difficult. They are not straightforward, and while in no way did I expect this course to be easy, his exam questions were so hard that sometimes even the grad students (who grade the exams) couldn't figure them out. You must combine multiple concepts in very advanced ways. This is NOT just plugging things into formulas.\nI am trying extremely hard to switch professors for next semester, although that is tricky if you work full time during the day, since there are no other evening sections. \nProfessor Budick is, however, extremely good at telling stories. Just not at teaching physics.\nDO ALL OF THE HOMEWORKS. I am absolutely positive that my perfect homework completion rate was the only reason I got an A-.\n\nWorkload:\nWeekly optional homework assignments (one or sometimes two per chapter); Two midterms (one of ours was too hard, one was too easy); one final (insanely hard; demoralizing).\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "February 10, 2012",
            "review_content": "\nThere are a lot of older reviews that seem to be not too fond of old man Budick. I think he is fantastic. He really is an interesting lecturer who is one of the best I have ever had. A lot of people complain about him (\"do more problems, less stories\") but I think its his stories and his endearing personality that make him great. \nSome of his tests are challenging, but so are all the other teachers. My one complaint is that he gives you 4 \"practice exams\" which are real exams he has given in the past (and by \"past\" I mean the 1830's). These should be treated as \"practice problems\" more than \"practice exams\", because often they in no way resemble the test that he gives you. \nI transfered out of his section for the second semester, purely because I couldnt attend his class at that time anymore (715pm). If he taught a section during the day, I would have stayed in his class. My new teacher is great (parsons), but I miss Budick. I will probably never have someone as engaging as he is. He is very smart, funny, interesting, helpful if you go to see him, personable, and generally likeable. He is the only teacher I have ever had to seemed genuinely interested in our opinion of how the class was going. He had us submit critique cards after both tests, which he responded to in front of the whole class. That shows tremendous character and dedication, for someone who has been teaching something for 30 years in an ivy league environment to invite criticism from a group of twentysomethings, and then respond in a way that shows genuine concern. That alone made me respect him.  \nOn an odd note: most of the class is postbac's. In fact, there may not have been a single undergrad in my class this past fall. People argue about what that means, but take that for whatever it means to you. \nWorkload:\nNonexistent. You do only as much or as little you want to (which directly corresponds to what you get out of the class). Homework problem sets handed in for each chapter which do not count towards your grade. 2 midterms and a final. Midterms are 100 pts each, final is 200 each. He says that he usually makes somewhere around a 270/400 a B, but that obviously changes based on the year. Midterm averages are around a 70-80, and final exam average was about 135. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 27, 2009",
            "review_content": "\nA few things, so you know where I'm coming from:\n- I am not that smart (average at best)\n- I am not good at math (seriously, there is no engineer in me)\n- I am not good at solving problems.\n- The right hand rule made me cry.\n- I got an A in this class both semesters.\nProfessor Budick is not a terribly inspiring teacher, but this course could have been worse.  I appreciate his enthusiasm for the class and he really does care about the material, which is rare in any intro course.  That said, other reviewers are not wrong that his teaching strategies are pretty disorganized and can be incredibly confusing at times.  \nThis class is by no means a piece of cake, and you will have to work HARD, but I disagree with the reviews that say that it is impossible to do well in this class.  I have a hard time imagining that someone who hired tutors and studied every possible hour of the day (as reviewer: January '06 -- maybe he's changed since then, though) would do so poorly in this class.  This is what I did: I read every chapter and took notes before I went to lecture, I did every homework assignment and turned it in on time, I did every practice exam at least three times.  When I didn't understand something, I never simply looked at the solution. I had a tutor with whom I met once a week (this is free if you are postbac), and I made sure to ask every question I could.  \nThe trick to doing well in this class is to understand the problems backwards and forwards. He combines concepts on the exams, and it becomes tricky.  He is not a great professor because he doesn't really teach you how to approach the problems and break them down step by step.  However, if you do enough problems, you can acquire this skill yourself.  I didn't do many more problems than the ones that were assigned and the ones he gave us at the beginning of every class.  But this is a lot.  In the beginning of each semester the homeworks took me about 5-6 hours.  By the end of each semester I was down to about 2 hours (and don't give up towards the end of second semester, because the subject matter gets more complex, but the homework problems become insanely easy because he knows he is not going into enough depth to assign hard problems.  \nPeople have said that the actual exams are hundreds of times harder than the practice exams, but this isn't true either.  I do agree that the actual exams are harder, but I think that it is also harder because you don't have the security of checking your answers as soon as you finish the problems. \nEveryone is giving strategies to do well in this class, but no single formula is going to work for everyone.  Figure out which study habits work best for you.  The most important thing to do in this class, though, is to understand the concepts -- if you can do that, and then do problems over and over again, you will be able to get at least an 80 on the exams. \nWorkload:\nFirst semester is about 1 problem set per week, second semester is more like 2 problem sets per week, leave about 5 hours per problems set (they don't all take this long), also 2 midterms and a final.  Nothing is dropped.  Homework assignments are for \"effort\" and don't get graded, but if you have a 96% or better record, it will bump you up if you are at the top of your grade bracket.  I would do all the homeworks on time for this reason...it definitely helped my grade.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 23, 2008",
            "review_content": "review_content is for Physics F1201 (The evening General Physics class primarily taken by pre-meds).\nI personally cannot recommending taking Physics with Prof. Budick if you have other options (more than likely you will not, but if there are openings in Shaevitz's or Dodd's class I would highly recommend trying to get in).  I actually got a 4.0 in Budick's class but that had nothing to do with Budick.  His lectures generally always follow the same format:  derive and explain a few equations, give some anecdotes or go off on some tangents (no joke - sometimes his tangents can last for 15 minutes or so of your precious lecture time), then do some sample problems.  These are never helpful because Budick always does them in 5 seconds, rarely delving deeply into how to setup the problems or typical issues students encounter with such problems - he just goes straight to the solution.\nHow did I get an A?  I did all the assigned readings on schedule, submitted every homework on time (having done all the problems myself and reviewing even-numbered problems with friends - odd-numbered problems have answers in the back of the book), and I did every single other practice problems that was given to us - practice exams, practice finals, and so on.  I am a book learner so I didn't have much trouble learning from the book (and I had taken A LOT of math classes as an undergrad).\nIf you know you can learn technical/mathematical stuff from books, you'll probably be ok.  Just know that Budick himself won't be of much help.  He posts solutions to all the homeworks and practice exams that he gives out but they can be incredibly cryptic as, again, his solutions are never geared towards being a helpful resource to explain things to struggling students.  They are simply two-line solutions where half the math is done in Budick's head.  Nine times out of ten I had to spend more time figuring out how Budick got to his solution than I did figuring out the problem.\nHis midterms and finals are generally a notch of difficulty above the homeworks, but he does give you the practice exams (exams from previous years) so you will know what to expect at least in terms of level of difficulty.\nWorkload, for me, was around 7 hours a week.  The course generally moves at the pace of 2 chapters per week, with homeworks due for each chapter.  So most weeks you will be reading 2 chapters and doing 2 problem sets (6-7 problems from the back of the book).  My guess is that if you have difficulty with Physics, this time could even double, or more.  I'd say a 7 hour estimate would be on the low-end for most students.  \nIf you have no choice and have to take Budick - there's no reason to be frightened, you will just have to do pretty much all of the work to understand the material yourself.  Do all the readings, make sure you understand all the sample problems done throughout the chapter, DO EVERY PROBLEM YOURSELF (and do not just give a half-assed attempt and then go check the answer in the back).  Just FYI - a friend of mine would not keep up with their homeworks and before the test would just go over the answers to problems to make sure they understood them.  This friend did not do well and eventually dropped the class.  The key to doing well in this course (especially with Budick) is to really try every problem yourself and try and arrive at the answer yourself, not just look at the answer and \"understand how it's done.\"\nYou will probably see a bunch of reviews about how Budick is a nice guy.  I agree - he is a nice guy and you will probably initially be charmed by his demeanor.  In the end however, my opinion of him as a Physics instructor is that he is inadequate and does not appear to put very much time into the course or changing things to help those who struggle more.  (The Physics dept. in general at Columbia appears to be this way and seems very poorly run.  You'll see what I mean when you take physics lab).  Best of Luck.\nWorkload:\nUsually 2 chapters a week + 2 homework problem sets (for each chapter you have assigned homework of 6-7 problems from the end of the chapter).  Took me about 7 hours a week, sometimes less.  Near exams, I'd spend more time doing all the practice problems I could find.\nWe covered the first 20 chapters of the Jearl Walker Physics book (except 16 + 17 which I believe everyone skips 1st semester).  We smoked Shaevitz's class in terms of our pace.  I believe that they ended up having to rush through chapters 18-20 at the end of the semester.  \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 17, 2008",
            "review_content": "\nOnly read this review if you want the cold, nasty, and unrestrained truth about this professor. Eghm.......I like to call his class, \"Budick's funhouse\", because you never know what to expect, and you really never know what's going on. From the moment his vague, haughty syllabus lands in your hands, to every single lesson, to every single midterm, practice test, ect... .\nNow let me just give examples because they really speak for themselves. Budick slathers even the most simplest portions of the class with some pathetic attempt to appear eclectic, or something, it' s very sad. For instance, a little thing called potential energy, which is basically \"if I pick something up, it has more potential energy, because it's higher in the air\", arguably the simplest concept in the class. Professor Budick decides to call this \"energy by virtue of postion\" *ahhh can't you feel the haughty bullshit just float through the air*  Of what virtue would that be, the right and wrongs of postion? Does that postion donate to charity? No! This is just an unessary complication of a simple concept in a already inherently challenging subject. This is what you will deal with through the hard stuff as well and it's a miracle that everyone doesn't end up with flasks in the class, as there medical school GPA is threatened by Budick's fun house. Maybe this haughty BS will translate into very descriptive and detailed answers to the homework and practice test problems, where you can at least teach yourself.....Wrong!\nEither Zerox, or get a good hard look at your 5 page homework you put you precious time into, because it goes into some black hole where you never see it again. The grades began posting after say.....4 weeks, but you need the corrections back to refine your skills. \"Well some homework would have to have come back before the midterm right\"? Wrong! The first, and basically the second midterm were taken without geting any homework back. And Budick's famous practice test answers: I'm pretty sure he wrote these while he was off-roading his minivan (well he looks like he'd have a minivan). They are the most illegible (and this is coming from a chap with pretty bad handwriting) utterly god-awfully solutions I've ever seen in my life. The complexities of Microsoft word were to hard for him to grasp I suppose. \nNow the saddest part of all about this class, is the effect it starts taking on the crop of dedicated and ready to learn students in the class. It's similar to the effect of any desperate and hopeless situation, people start developing Coping mechanisms. \"Well I hear Budick get you ready for the MCATs better than anybody\", thats lovely, but last time I checked I signed up for Physics, not Physics for the MCATS. \"I think it's just that Physics is hard\" physics is a challenging subject, but the challenge in Budick's class is to overcome \"him\", so that you can get to the subject. In doing this you have to tear down miles of slithery BS in your notes. There is a surefire way to pay attention to this dark and insulting class however, and not because of his cheeky little jokes he victimizes you with, or his stories about some crap that will end on a mercy laugh inducing punch-line, but because it was like a burning train-wreck: it's awful, it's a tragedy, and you can't stop looking. \nIn conclusion, my suggestion, DO WHAT EVER YOU HAVE TO DO to get into another section, or do anything BUT take Budick's class. Many of the students who are post-bac's (meaning they've had at least 32 professors if my math is correct) and agree the Budick is thee most disturbingly awful professor to teach them. Many of my classmates, and myself as well, will forever remember this class as the biggest insult to academics and a dedicated student body that they have ever seen.........taught by an ego-maniac that could give a rat's *ss about anyone, learning anything. \nWorkload:\nWeekly homework that is used as a \"measure of effort.\" 2 midterms that will have about 2/5 questions that test you to the level the homework was at, the other 3 will be above the level   of the homework. The Final is the same, except 10 questions. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 17, 2008",
            "review_content": "\nOnly read this review if you want the cold, nasty, and unrestrained truth about this professor. Eghm.......I like to call his class, \"Budick's funhouse\", because you never know what to expect, and you really never know what's going on. From the moment his vague, haughty syllabus lands in your hands, to every single lesson, to every single midterm, practice test, ect... .\nNow let me just give examples because they really speak for themselves. Budick slathers even the most simplest portions of the class with some pathetic attempt to appear eclectic, or something, it' s very sad. For instance, a little thing called potential energy, which is basically \"if I pick something up, it has more potential energy, because it's higher in the air\", arguably the simplest concept in the class. Professor Budick decides to call this \"energy by virtue of postion\" *ahhh can't you feel the haughty bullshit just float through the air*  Of what virtue would that be, the right and wrongs of postion? Does that postion donate to charity? No! This is just an unessary complication of a simple concept in a already inherently challenging subject. This is what you will deal with through the hard stuff as well and it's a miracle that everyone doesn't end up with flasks in the class, as there medical school GPA is threatened by Budick's fun house. Maybe this haughty BS will translate into very descriptive and detailed answers to the homework and practice test problems, where you can at least teach yourself.....Wrong!\nEither Zerox, or get a good hard look at your 5 page homework you put you precious time into, because it goes into some black hole where you never see it again. The grades began posting after say.....4 weeks, but you need the corrections back to refine your skills. \"Well some homework would have to have come back before the midterm right\"? Wrong! The first, and basically the second midterm were taken without geting any homework back. And Budick's famous practice test answers: I'm pretty sure he wrote these while he was off-roading his minivan (well he looks like he'd have a minivan). They are the most illegible (and this is coming from a chap with pretty bad handwriting) utterly god-awfully solutions I've ever seen in my life. The complexities of Microsoft word were to hard for him to grasp I suppose. \nNow the saddest part of all about this class, is the effect it starts taking on the crop of dedicated and ready to learn students in the class. It's similar to the effect of any desperate and hopeless situation, people start developing Coping mechanisms. \"Well I hear Budick get you ready for the MCATs better than anybody\", thats lovely, but last time I checked I signed up for Physics, not Physics for the MCATS. \"I think it's just that Physics is hard\" physics is a challenging subject, but the challenge in Budick's class is to overcome \"him\", so that you can get to the subject. In doing this you have to tear down miles of slithery BS in your notes. There is a surefire way to pay attention to this dark and insulting class however, and not because of his cheeky little jokes he victimizes you with, or his stories about some crap that will end on a mercy laugh inducing punch-line, but because it was like a burning train-wreck: it's awful, it's a tragedy, and you can't stop looking. \nIn conclusion, my suggestion, DO WHAT EVER YOU HAVE TO DO to get into another section, or do anything BUT take Budick's class. Many of the students who are post-bac's (meaning they've had at least 32 professors if my math is correct) and agree the Budick is thee most disturbingly awful professor to teach them. Many of my classmates, and myself as well, will forever remember this class as the biggest insult to academics and a dedicated student body that they have ever seen.........taught by an ego-maniac that could give a rat's *ss about anyone, learning anything. \nWorkload:\nWeekly homework that is used as a \"measure of effort.\" 2 midterms that will have about 2/5 questions that test you to the level the homework was at, the other 3 will be above the level   of the homework. The Final is the same, except 10 questions. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "April 19, 2007",
            "review_content": "\nKeys to maximizing your grade for the time you put in for Prof. Budick's class.\n1) Try to make it to at least 90% of the lectures (He doesn't post them online either).  If you do this, you won't have to read the book.  I found this out late.  Use the book only to look up formulas, read some of the \"Touchstone\" examples when your stuck, and obviously to do the HW.\n2) Study Budick's solutions to HW.  If you don't do the HW, don't worry about it, just make sure you get the solutions and then go back and see how Budick does the problems.  I guarantee you that you will learn more from this method in 30-45 minutes per than if you bust your ass doing the HW for 5 hours by yourself.  This is especially true in the later part of the course, (after about chapter 12).  \n3)  When Budick hands out the practice exams, you should do them until it hurts.  My  advice is to write out each test at least 2, probably no more than 3 times.  There is no better way to study for the test.  If you do this, the formulas will become second nature (you won't waste a minute staring at the formula sheet).  More importantly, you will know the question that Budick takes from the practice exams cold.  If you get less than 25/25 on the question that Budick gives from the p exam, then you didn't study them enough, and you can't blame Budick for that.  If you have time, read through book questions and target the ones that look like something Budick might put on the test.  He DOES, at least second semester, put one question straight from the book HW on the tests.  There should really be no more than 10 HW problems that look like \"Budick test questions\"  so you should nail that question too.  \nFor the final, I wouldn't bother with the HW anymore.  There are so many practice exam questions (40) that I think the little time you have to study is best spent on that.  \nTake home message - Don't waste your time reading the book, do the practice exams again and again.\nFirst two means/medians (whatever he announces in class): 64, 55 (or so).  Follow these steps, and you should be able to beat these means pretty easily.\nFor those taking F1202, watch out, because 2/3 to 3/4 of the class switches to another professor and you're left with the 45 people who did well with Budick. \nfirst two means/medians: 77, 86.  These are hard to beat. \nIf I had it to do again, I might take Budick for F1201 and switch for 1202.  \nAbout Budick: very nice.  Good lecturer.  Smart guy.  Will give the class extra time on tests.  He is not sadistic, don't be scurred,  bud.  \nWorkload:\n10 hours a week at the most.  Maybe more in the week before an exam.  I put in about twice as much effort into Physics I as Gen Chem I.  If I followed these suggestions for the whole semester I probably would have saved myself alot more time for Calc and Chem.  Good luck.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 30, 2007",
            "review_content": "\nJust want to second that positive review. I was totally freaked out by some of the negative things people had to say about this guy. But I actually think he is an excellent teacher. He's challenging and moves quickly, but explains things really thoroughly and actually cares whether or not people get it. He makes a huge effort to teach well--he takes feedback, and actually listens. All the homework problems he assigns are odd so its easy enough to check the back of the book to make sure you get it. Anyway don't believe the hype, he's a good guy.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 24, 2007",
            "review_content": "\nI liked Professor Budick and thought that he was generally approachable and friendly. That said, his tests are very tricky and will be very difficult if you do not fully understand the material. He gave the class several opportunities to offer suggestions as to how he could improve his lectures -- some of which were implemented as the semester went on. \nLecturing Style:\nHe goes through the book at a rate of 1 chapter per class (this is the same regardless of professor) and takes the class through derivations of the new formulas and 2-3 sample problems. Although he sometimes breezes too quickly through the math, he did respond to requests to slow down. Budick also assigns \"next time\" problems from upcoming chapters which he will go through in the next class, if you are inclined to work ahead.\nTests:\nBudick's tests are very difficult...but they are not impossible. You need to know the material forwards and backwards because he will often combine multiple concepts into one problem. He will hand out practice tests about 2 weeks before the exams -- these tests are often (as other reviewers have said) much easier than the actual test will be. However, the topics covered from year to year will not change and the practice tests will give you a sense of what he will include. Budick also includes at least 1 problem from the previous exams on each test he gives (and occasionally one from the homework). But for the most part, expect the exam questions to be new.\nSuggestions:\n1. Get another physics book and do as many practice problems as possible before the exam. \n2. If you have questions, go to his office hours and ask him. He is very friendly and wants to help.\n3. You can read the book, but Budick will not test on anything that he did not discuss in lecture. If there are topics in the book that he did not cover, you will not be tested on them.\nWorkload:\nBudick assigns homework which is collected and graded for completion and spot-checked for accuracy. He keeps a tally of: a) the number of questions you attempted; and b) of the spot-checked questions, the number you got right. This information is apparently put to use if you have a borderline grade. After you turn in the homework, he will hand out his solutions to the problem set. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 19, 2007",
            "review_content": "\nI strongly, strongly disagree with the last two reviews.  Ok, he is a nice guy and isn't out to get you, but he is HARD.  Just because you do all the homework, practice exams, etc. does not mean you will get a decent or fair grade.  I worked harder in this class than any class ever and did not receive a good grade.  I did all the practice tests, had a tutor and everything, and still somehow did poorly.  When it comes right down to it the tests are MUCH more difficult than the practice tests (even though one of the questions is bound to be from them) and it is very hard to finish on time.  The final was excruciating and contained a lot of problems that were not emphasized on any of the practice tests (minus the two taken directly from the tests).  Also, there seemed to be a lot of grading problems- we were told we would receive partial credit if we at least wrote down formulas and showed work on the problem, however, in many cases no credit was given and there were discrepancies in the way the TA's graded the exams.  When the mean for all the exams is around 55%, something is clearly wrong.  All that said, I am taking him again this semester because you will learn a lot from him and will be extremely well prepared for whatever is to come.  So anyone who says you'll get an A if you just work hard is probably either just a physics genius or is lying.\nWorkload:\nWeekly (sometimes twice a week) problem sets.  Don't get behind, if you do it is a nightmare to catch up.  2 midterms, 4 questions each.  1 final, 10 questions.  \n"
        },
        {
            "course_name": "general physics",
            "review_date": "December 29, 2006",
            "review_content": "\nI disagree with a lot of these reviews. Well I agree that he's a nice guy who likes to joke during lectures. However, he doesn't ruin your grade. I got my grade today and it was pretty good so I'm saying this from direct experience. \nHe always has one or two problems on the midterm LITERALLY from the practice tests he gave you. So if you study the practice tests well you will do well on the midterms. He usually has about two new problems but they don't diverge too much from the previous exams. The exams aren't usually that hard, if you get the concepts from the previous exams. The homework I will admit can be quite a pain. The homework to do it properly actually takes more than an hour or two. The first few easy chapters can be done quickly but as the material gets harder it requires more time. He actually grades them so the homework gets really annoying as well. I never went to the recitation so I can't say much. \nTo prepare for his exams effectively do all the practice exams and know them all. They can be quite a burden since he like gives you about 3-4 at a time. But if you do them right, they will ensure you a good grade. This is a lot of work but I didn't find it necessary to study physics everyday. For like midterm I just studied for a day or two. \nHe isn't exactly the best lecturer in the sense that what he teaches isn't what is on the exams. Also he covers concepts very vaguely. The textbook isn't specific either so that doesn't help at all. But if you use his practice tests they will teach you all that you need. \nWorkload:\nhomework like literally every class (really annoying and is a pain), 2 midterms, one 3 hour final\nthe homework is pretty heavy but otherwise it was alright\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "June 02, 2006",
            "review_content": "\nI read the reviews about Prof. Budick and was terrified, absolutely terrified at the prospect of taking his class. (I didn't get a spot in Blair's...)  The other reviews are largely accurate--Budick is a very approachable, affable and entertaining professor and his exams become difficult unless you do a lot of problems.  What you have to realize though, is that Budick will not hold your hand in this class like Blair will.  If you're self-disciplined and have an ounce of pre-med drive, you'll do fine in this class.  The whole thing about the thousands of problems that await you and the potential of smart kids doing poorly in this class...um, that would be the case in any class if you didn't know how to study for it.  If you ask any Physics professor how to do better in physics, he/she will tell you to do more problems.  It's no different in this class.  \nAlso, if you're in Budick's class, I guarantee you will learn more (much more) than Blair's class and probably will understand it better for the MCATs.  So suck it up, do the work and get your A.  \nWorkload:\nWeekly prob. sets that are not counted as part of the grade (so...it's optional), 2 midterms, 1 final \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 04, 2006",
            "review_content": "\nLet me preface this review by saying that I did well in this course, so this is not coming from a biased source. I am not, in other words, just trying to get back at a teacher who gave me a bad grade.\nPhysics with professor Budick will literally ruin your semester unless you are A) a complete natural at physics and B) willing to work 6+ hours a day at only physics. I am not just saying this. I have seen very very smart people work very very hard and not do well in this class.\nAll in all professor Budick is a nice affable man. He tries to make class fun with amusing stories and experiments. \nHowever, his actual teaching style is extremely confusing. \nHe leactures on one chapter each class, which is 2 chapters a week, but yet he assigns very long homework assignments like once every .75 weeks so by the middle of the semester we are turning in homework for chapter 6 when he is lecturing on chapter 11. Professor Budick will spend literally hours explaning the derivations of formula's that you should only have to memorize and then speeds through complex problems. let me give you an example of one of these problems \"if the polar ice caps melted and the oceans rose 50 feet how much longer or shorter would a day be\" (this was a question from our final exam). \nThese exams are another issue. Professor Budick will give four practice exams a month prior to the test. these are actual axams that he gave lets say between ten and five years ago. but as you go through these exams, you realize that the difficulty level is increasing with each test. And even when you understand all of the questions in the practice test and all of the questions in the book, you will show up for the day of your test and see questions that are more difficult than any question you have ever seen before. In other words, there is literally nothing that you can do to prepair yourself for these questions. The kids that have a natural talent  and who want to work hard will do well and everybody else will walk out of the tests wanting to cry.\nI hope this has been helpful\nWorkload:\n35-70 hours a week\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 04, 2006",
            "review_content": "\nI don't even know where to begin with this teacher.  I'll start by saying that I've been at Columbia for almost two years and prior to this course the lowest grade I'd earned was an A-.  Then I made the mistake of registering for Professor Budick's section of Physics I.  His lectures are insufferable.  His stories were entertaining initially but as the semester wore on and I still had no grasp of the material I found him infuriating.  Do not go to class and expect him to clarify anything.  He will probably make things even more confusing since he can't teach to save his life.  He spends a ton of time on the most irrelevant details and no time explaining what you actually need to understand.  And you can't turn to the text for help because it's as unclear as he is.\nHe assigns homework weekly.  This seems very reasonable until you realize that you've just turned in Chapter 5 homework and on that same day Professor Budick will lecture on Chapter 9.  In addition, the assignments do not contribute to your grade so you can spend hours preparing them and get nothing for it.  The pace of the course is impossible and insane.  Our section covered 5 more chapters than the other one.\nBefore each test, Professor Budick handed out practice exams.  These consisted of tests from previous semesters and were much more difficult than anything we'd ever seen in our homework assignments.  But nothing could prepare me for the actual exams.  I studied for considerable amounts of time and still felt like I had no idea what was going on.  I left each test certain that I had failed it.  The final was absolutely ridiculous and was worth 50% of our grade.  Before the final, I had a B/B+ in this class.  I just got my semester grade yesterday and ended up with a C+ in this course.\nIt really doesn't matter how much you study for this class.  You will not be rewarded for hard work.  Professor Budick's class ruined my semester and my GPA.  I spent every waking moment worried about my physics grade.  I hired tutors.  I studied like crazy. None of it helped me.  I had friends in this class who had exactly the same experience.  Even my friends who did well in this class refused to register for Budick for Physics II.  Do not, under any circumstances, take this class.  It's not worth the pain and suffering.  If you don't decide to just give up after the first exam, you will study your ass off, worry incessantly, blow money on tutors and still not necessarily end up with a decent grade.\n"
        },
        {
            "course_name": "Physics I and II",
            "review_date": "April 13, 2005",
            "review_content": "\nI really like this professor.  I've read the other reviews and while I can't really disagree with a lot that is said, I really enjoyed the classes.\nWe covered a lot more material than Blair but if you want to get your money's worth and be better prepared for the MCAT then you should really try to learn some physics.  If your interested in the topic at all you won't be bored and you'll be challenged.  From what I've heard about Blair's class, I would have been bored because he goes very slowly.  Although I like that in his approach you don't need a calculator on the tests.\nIf I had to say something negative about Budick's class it's that you lose way too many point due to math erros than to conceptual erros.  Doing math under pressure is not fun.  But there's nothing more annoying than doing poorly on a test just because you didn't realize that you forget to change the sign in an equation.\nWorkload:\nNot too bad.  Practice practice practice practice the problems all during the semester.  That's the secret to doing well in this class.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "March 30, 2005",
            "review_content": "\nLet me first start off by saying that we, in Budick's class, resent all those who are in Blaer's class. While people in Blaer's class are receiving good grades with minimal effort, those in Budick's class slave for hours on end with problem sets that 1.) don't really affect your grade (i.e. you can get by without doing them) and  2.) don't really resemble the problems given on the tests. Physics is not easy and I don't agree with the review that if one takes this class seriously it would be a breeze. The amount of time you put in this class doesn't really translate into a good grade unless you really know your physics. Budick doesn't really dumb down the material. He goes off on derivations really quickly which is why his class is about 5 chapters ahead of other classes.  Budick is a nice and friendly man, and I don't believe he is a \"toughass\" when you ask him about your grades. What many people have a problem with is the pace of his class and overall difficulty of his tests. He does give practice exams and among those practice exams one question will be on the test so it is to your advantage to know the solutions. However in the end his class is just overbearing. If you have background in Physics, which there are several in the class, then I see how the class might seem easy, but for the rest of us who've had no exposure to the subject, it's torture. His class is not cake walk. This is the breakdown as to how many people have left his class: In a class of about 100 in the beginning of the year only about 70 were left after the first midterm when they realized that they didn't have the grade. In the beginning of the 2nd semester about 45 people were left. The lucky rest switched to Blaer's class.  By the time the first midterm of the 2nd Sem arrived less than 30 were left. About 2/3 of the original class gone. That should tell you something. I guess in the long run, his class will really help you prepare for the MCAT if you're pre-med but be prepared to work your ass off. \n\nWorkload:\nHomework sets: About once every week 8-16 hours (not collected. Study time about 15-20 hours a week.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "March 13, 2005",
            "review_content": "\nThe man is a nightmare.  His tests are just ridiculous.  DO NOT TAKE HIS CLASS!  Sell everything you own to get into Blaer or Tuts.  Professor Budick doesn't believe in teaching you the concepts.  The only thing that he's interested in is plowing through the textbook twice as fast as any other section and proving that he's enough of a hard-ass to be worthy of Columbia (strictly speaking, he's a \"professor\" at NYU and only an \"instructor\" here).  He'll give you his old exams from NYU which are a joke compared to the one he throws at the Columbia students.  That's because he knows Columbia is filled with heartless postbaccs and other ruthless premeds who he can sadistically abuse to his black heart's content.  There is no way to do well in his class unless you already know physics cold.  The texbook is horrible, and he teaches directly out of the textbook (what little he does teach).  He won't do a problem in class that even closely resembles the homework problems (a massive amount, due every class).  You won't be able to do the homework problems because they'll be the hardest problems you've seen yet--until the exam which makes the homework look easy.  Budick's philosophy is that the exam should be the hardest problems you've ever seen up until that point, which is a really ridiculous way to teach.    One problem on an exam didn't in any way resemble a homework or practice problem.  When the class kvetched about it, Budick's explanation was: \"There was a similar type problem located in the vicinity of an assigned homework problem.\" So in addition to the 30 or so problems due each class, you have to do all the rest in the chapter.  Of course, you cover 500+ pages of the text and have to know every practice problem, roughly  50 a chapter (about 2000 total).  One time a student complained that he was taking 5 hours to do the practice problems (so 10 hours/week) and Budicks explanation:  \"If you're only taking 5 hours to do a homework set, you should be TAing this course.  I reccomend 8 hours per set.\"  Because we all have 16 hours of extra time every week to do physics homework.  His E and M section is even worse, because he can't teach it.  All of us who still have him are screwed.  I'm dropping out of Columbia because of him.  I'm not paying this kind of money to suffer through some masochistic bs.  If you want to see a major ego in the last years of his decline, pithying for a post at Columbia and willing to destroy his students to do it,  take this class.   If you want to see a man practically peddling every last shred of dignity he has to sell out his students and make a career jump, take this class.  Otherwise do yourself a favor and take anyone, absolutely anyone else.\nWorkload:\n20+ hours/week and you'll still do lousy.  Your best bet is to go to another professor's lectures.  Honestly.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 30, 2004",
            "review_content": "\nVery straightforward and fair.   The tests and final  are very similar to the homework problems and the practice tests given out a few weeks beforehand.  The lectures are pretty average, meaning that the material gets covered in a dull fashion but is broken up with generally unrelated anecdotes. I only wish that we had an extra credit  problem on Budick's cat considering all the class time he spent talking about it.  Still, it is a very interesting, if not inspiring, class that that will both filfill your science requirement and give you a basic introduction to physics.  \nWorkload:\nLectures and homework are optional, which means the workload is whatever you want it to be.  Unfortunately, it met at 7:00 to 9:00 Tuesdays and Thursdays, which I rarely bothered to go and didn't see until too late why I should do the homework if I wouldn't be able to pass it in.  The book is comprehensive (but not clear), so as you could theoretically do fine by just reading the book, I found myself not doing any work and finally spending the weeks before tests in panicked, miserable cram sessions.  The class would have been a breeze were I to have had an ounce of self-discipline.  Fortunately, I found the curve to be VERY generous.  I took it for architecture so I didn't need to do the lab session.\n2 four-problem midterms and a ten-problem final exam\n\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "September 01, 2003",
            "review_content": "\nBurton is a friendly old man, and he teaches well, and straight out of the book. He seems really friendly and engaging, although don't try to ask him about your grade: he gets that question all the time, and his response is to be a toughass about it. He does not believe in generous curves, which doesn't help in a class full of post-bacs. Take Tuts if it's at all an option, even if you can't make it to lectures, you'll get a better grade without a doubt.\nWorkload:\nStandard: problem sets, midterms, finals...he always takes a question or two from the old exams, so make sure you know the solutions cold.\n"
        }
    ]
}