{
    "prof_info": [
        {
            "prof_name": "Elizabeth Bernstein",
            "prof_id": 1046,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Sociology of the Body",
            "review_date": "April 28, 2016",
            "review_content": "\nAfter reading the reviews below, I was super nervous about going into Bernstein's class, and almost decided not to take it.\nI am so glad I didn't listen to the comments below. I don't know what happened in that class, but my experience with Bernstein has been anything but monstrous or horrid. This class was amazing, and there hasn't been anything offered before that's remotely like it, and I sincerely hope they offer it again. Not only is Bernstein downright brilliant, she put together an amazing syllabus and facilitated amazing discussions. She managed to break down texts which were often more theoretical and dense than most sociology classes might assign, and explained them clearly and simply. She's also incredibly sweet, responsive to emails, helpful outside of class, and it was clear that she was just as invested in the class and the material we were studying as we were.\nI absolutely loved every bit of this class. It completely changed the way I think about sociology as a discipline, and the type of work that sociologists can do. You will want to work hard for this class, not just because Bernstein has high expectations, but because the readings are all absolutely amazing.\nWorkload:\nReading that can get dense and heavy, but Bernstein does a phenomenal job of breaking it down for you. Usually 150 or so pages a week, but it's a seminar so it seems pretty normal and consistent.\nWeekly responses, 1-2 pages double spaced. Due by noon the day before class. Annoying, but quick and relatively painless.\nTake-home midterm that's two 3-4 page essays based on readings for the class.\nFinal research paper, 10-12 pages on basically anything you want.\nParticipation -- it's a seminar. You get out of it what you put into it.\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "May 31, 2013",
            "review_content": "\nI took Prof Bernstein's Sociology of Gender lecture class this past fall (2012) and felt the need to review her, and it, after reading the reviews below. \nI really don't understand why everyone is hating on her so much... The class didn't blow my mind, but the lectures and readings were interesting, the assignments were pretty easy, the grading was fair, and the professor and TA's were completely pleasant. I had absolutely no issues with Bernstein or the TA's at all. \nI'm a Sociology major, so maybe I have a different take on Bernstein and her teaching style than Women's/Gender Studies majors, but I thought the class was really quite good! \nATTN people who are debating taking this lecture: go to the first few classes. That's exactly how the entire semester is. AKA pretty relaxed, easy, and mostly interesting. \nIt's not hard to get an A in this class and not have a complete meltdown about it. Go to class, take notes, and skim the readings. That's it. \nWorkload:\nThere's pretty heavy weekly reading, but you don't really need to do all of it. Just skim and get the gist for most of the stuff. There are also optional TA discussion sections, where they basically review all of the readings.\nTake-home midterm: do your own sociological investigation relating to recent readings. If you know how to write sosh papers, this assignment is EASY. If you don't ask the TA's. \nIn-class midterm: if you show up to class and skim the readings, this is no biggie.\nFinal exam: more annoying. but, again, if you went to class and skimmed the readings, you'll just have to review a bit and you'll be fine. \n\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "April 30, 2013",
            "review_content": "\nThis professor is a monster.  She is condescending, passive-aggressive, and unsympathetic.  You meet her three times and she re-introduces herself each time.  She laughs and smirks at people in class.  She doesn't want you to construct your own interpretation ever, she'll cut you off instead of hearing you out and explaining where she thinks you went wrong.  The work load fucking sucks, and if you don't do well on one of them you're kind of in trouble.  Don't take this class.  \nWorkload:\n50+ pages of reading a week, a take-home midterm with bullshit research, an in-class midterm, a final paper.\n"
        },
        {
            "course_name": "Sociology of Gender Roles",
            "review_date": "February 19, 2013",
            "review_content": "\nElizabeth Bernstein nearly caused me a nervous breakdown at the end of last semester.    She is power-hungry and a bully.  Furthermore, she does not correct students when they mis-gender a trans person during a discussion of a film or a text with transgendered characters, and I think that this is irresponsible of her as a professor and as the controller of the classroom.  If you want to do your own research and make students cry on the side, don't teach at Barnard.\nWorkload:\na bunch of readings, some of which are cool and all of which you can gain access to without taking this class.  one take home midterm, an in class midterm, and a take home final.  you need to do ethnographic research/an interview for the take home assignments.  \n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "January 15, 2013",
            "review_content": "\nProfessor Bernstein does not give a shit.  I thought at the beginning she was quirky and adorable the first month and a half of class, basically until right after the drop deadline, then she started doing the negative things people have already mentioned.  When I would share in class she would smirk at me and try to cut me off, it just became a chore to participate just for my grade.\nwhen discussing the Brandon Teena Story she was fishing for someone to say that Brandon's transition was exclusively for the social gain of being a man.  Somebody actually made that comment, and she was approving.  I almost fell out of my seat I was so mad.\nI took this class as my WGSS intro class and that was the worst decision of my life.  Sure some reviews say things along the line of \"this is a sociology class, and if you're not used to that way of thinking then don't take it because this class is so awesome and eye opening.\" And to that I say: that's a load of bullocks.  This class maintains the binary structure of gender and attempts to fit people of deviant gender identities into that binary.  THIS IS NOT A REVOLUTIONARY CLASS IT IS NORMATIVE.  WGSS MAJORS, DO NOT TAKE THIS CLASS IT WILL INFURIATE YOU BI-WEEKLY (even tri-weekly if you go to discussion section).\nYou can read the interesting things on the syllabus on your own time, do not take this class.  Do not take a class with Bernstein, she does not care about her students.\nWorkload:\nWhatever, elementary feminist readings, some books at the end were cool but overall nothing that special, radical, or cool.  2 midterms (one take home) and a take home final.  if you mess up any of them and don't go to every single discussion section you're fucked. \n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "December 22, 2012",
            "review_content": "\nStay away from this professor.  She does not care about students.  Her assignments are very complicated and if you are lucky enough to receive her as your grader instead of the TA for both of your papers, you are screwed.  Also, she does not take kindly to any perspective that elaborates upon or goes beyond the points discussed in lecture.  Other students found her engaging, and it is true that she is passionate about the topics she chooses.  However, when she says something like \"There are several ways to do this,\" she is lying.  If you don't know how to write a sociology paper and if you don't stick to exactly what was said in lecture, you are screwed.\nWorkload:\nOne take-home midterm, one in-class midterm late in the semester, and a final take-home exam\n"
        },
        {
            "course_name": "Sociology of Gender Roles",
            "review_date": "December 06, 2012",
            "review_content": "\nProfessor Bernstein is an engaging lecturer, and she presents some interesting theories about an interesting subject. She fostered a lot of new ideas for me that I really appreciated. However, she can be fairly condescending. She would outright laugh at some students' questions or commentary. To her credit though, she does allow for a lot of class participation and discussion. I would recommend Bernstein simply for her knowledge of what she teaches (which is extensive), but you should know what you're getting into, particularly the workload.\nWorkload:\nRoughly 80 pages of reading a week. Some of it was integral to your essays and to your understanding of lectures, other readings were entirely unnecessary. 1 take-home essay midterm, 1 in class midterm, 1 take home essay final. Bernstein expects more of her students than a lot are capable of (she wanted us to do a 10-page empirical essay, which required 6 hour-long interviews, in a week. She extended it to two weeks at the insistence of one of her favorite students).\n"
        },
        {
            "course_name": "Sociology of Sexuality",
            "review_date": "January 05, 2011",
            "review_content": "\nThis is an amazing course and Bernstein is a great professor. The readings for the course range from social theorists such as Freud and Foucault to more contemporary qualitative and quantitative sociology studies. The course follows a logical and chronological progression and ideas and readings build on each other. Bernstein is a great lecturer and does a good job integrating concepts, answering students' questions (even the students who seem to ask questions that were just answered), and providing real-life examples to explain difficult theories. Totally recommended to anyone with an interest in the topic (note: This is a *sociology* class. If you don't like the discipline of sociology, don't take the class! There were people in the class who just did not want to adapt a sociological perspective).\nWorkload:\nModerately heavy amount of reading, in-class midterm (short answer and essay questions), 8-10 page final empirical research paper, take-home final exam (essay questions). Overall a fair amount of work but super interesting material.\n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "May 31, 2009",
            "review_content": "\nThis isn't a class you can sit out on. Professor Bernstein very early on cut the class down to about 15 people so to keep the discussion open and participation ample. While the beginning of the course is pretty standard, by the time you get up to the 2000s the canon tends to end up being shaped by the instructor you have (as I understand it, there's little standardization in these kinds of courses in the WMST department). With that said, Prof. Bernstein ends up drawing from her own interests, and she ended up assigning a book that deals with the topic of migration and sex work--probably something you wouldn't expect from a canon course. She really makes it work, though, and although she doesn't really lecture that much, she moderates a thought-provoking discussion that is in the long run VERY worth it. I loved this class. Take it with her if you can.\nWorkload:\nReasonable. Section met once a week, with readings anywhere from 75-350 pages. Short 1-page responses due on Courseworks the night before class meetings. One short (7-8 page) paper, and one slightly longer (8-10 page) final paper.\n"
        },
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "January 29, 2009",
            "review_content": "\nI am not sure why Professor Bernstein is a professor.  She seems to have no interest in students.  She has been my adviser for two years and still does not remember my name.  She never remembers appointments.  If she wants to do her own research, she should do so without pretending to teach as well.\nWorkload:\nN/A\n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "June 10, 2008",
            "review_content": "\nI was really wary of Professor Bernstein because of her weak reviews, but I actually really enjoyed this class.  She isn't the most assertive professor or an amazing teacher, but she is nice and passionate about the subject at hand.  She chose some really interesting readings that really challenged my thoughts on the path of feminism and enhanced my understanding about the kind of work being done.  Moreover, the class atmosphere was great, with lots of smart, interested students exchanging ideas on a very elevated level.\nWorkload:\nweekly comment papers not graded, 1 presentation, and a 20 page research paper that ties class texts with further areas of research.\n"
        },
        {
            "course_name": "Sociology of Sexuality",
            "review_date": "May 30, 2008",
            "review_content": "\nElizabeth Bernstein is amazing.\nIn this class, which obviously covers very interesting material, you learn to examine the societal perception of sex from the beginning of American civilization to the present. Along the way you hear exciting guest lectures and watch entertaining and thought-provoking films. \nBut a reason as to why I liked Bernstein teaching this fascinating material is because she is perhaps one of the clearest lecturers I have ever had. She provides sign posts when directing her lecture into another sub-topic or reading so that you know what it is she will be discussing. This makes note-taking incredibly easy, and allows you to better digest her lecture. Since her midterms are ID's, reading is necessary. It is possible to divide the syllabus amongst other students in the class, however, since the readings are very compelling you'll want to read it on your own. I strongly recommend that anyone interested in sexuality, and anything else relating to the human's sexual capacities: prostitution, stripping, etc, you will want to take this class with Bernstein.\nWorkload:\nLight --- Weekly assigned readings and a midterm (in class) and take home final exam (2 essays). The readings take nothing but a couple hours to finish for a whole week so do as much of it as you can. If you go to lecture, you will do well.\n"
        },
        {
            "course_name": "Sociology of Gender Roles",
            "review_date": "November 16, 2006",
            "review_content": "\nI think this woman is evil. Really. My favorite illustration was when she silenced a student for disagreeing with her interpretation of a news story. Is that really the best way to foster intelligent class discussion? The class, however, is just what all of the other reviewers describe. It is a fascinating subject, the readings are good, and the assignments, though difficult, will force you to produce something you are really proud of. It's just a shame that you have to deal with this cold, pretentious, and monotonous professor to reap the benefits. \n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "January 06, 2005",
            "review_content": "\nIt's a very interesting course, but there are some things to keep in mind. She's very quirky in class, which I liked, but I don't think it's for everyone. Most of the lectures are read straight from her prepared notes which was sometimes hard. I found that she was hard to reach outside of class and even when she was able to pin down for an appointment, she always seemed busy with other stuff. One of the TA's, Randa, was fabulous. So helpful and excessible outside of class. Discussions with her were really informative and helped to simplify complex material covered by Prof. Bernstein in lectures.\nWorkload:\nThe work load was manageable, except for the final project. She gave 2 weeks to complete our own empirical research which consisted of interviews.\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "January 04, 2005",
            "review_content": "\nBe forewarned, a lot of this class is crackpot theory along the lines of \"all sex is rape\" and \"all men are the oppressors.\" Kinda upholds the Barnard stereotype, I have to admit. That being said, Professor Bernstein did a good job of presenting material that could easily be overwhelming. You will learn about issues you never know existed - when I signed up for this class, I didn't expect to be studying how transgendered prostitutes view their sexuality, but hey, I learned something new.\nI didn't really like her lecture style - she seemed to read everything from notes, and monotonously at that. Still, she was straightforward, no BS. I would also recommend the TA Randa Serhan - you'll get a lot out of her discussion section.\nWork consists of a paper, a midterm late in the semester, and a final project. Very easy - so much of this theory is way out in left field that you can easily form your own opinions and conclusions.  On the downside: She only gave us two weeks to organize and complete a ridiculously demanding final project involving interviews, which I thought was unrealistic for that time frame. \nOh yeah, and this class is really not for the squeamish or conservative. If you keep an open mind, you will get a lot from this course. Also, Sociology of Gender has what must be the best required reading ever - an article called, \"Looking for My Penis: The Eroticized Asian in Gay Video Porn.\"\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "December 31, 2004",
            "review_content": "\nProfessor Elizabeth Bernstein (Sociology of Gender--BC) is an amazing instructor. She knows her material and presents an interesting/alternative way of addressing gender issues within contemporary society. In addition, she obviously has a passion for her field and supports the opinions of her students (she doesn't force you to agree with her). \nNow that all the good shit is out of the way; let me stop with the sugar coating. She can be horrible about getting back with you on issues that you bring up to her outside of class. She has office hours, but I don't know what for. You can hardly catch up with her. She always has a million and one things she's involved with in addition to the course she instructs. Lastly ---but sure as hell not least---, she does not really grade any of the projects or assignments you turn in in the class. Like all \"TOO BUSY\" college professors, she passes all of your hard work down to her incompetent TAs. And worst of all, there is little support from her for students who have a problem with the grading of the TAs. I speak from personal experience.\nIf you want to be challenged and enjoy lecture, this is your class. However, outside of the classroom Bernstein has been known to perform a disappearing act. She is too busy to be bothered with your grievances---no matter how legitimate. Nonetheless, I do not regret taking Sociology of Gender at BC. I would recommend this class to anyone---just beware of these things I've mentioned. Now you know. I hopes this info helps some of you. \n"
        },
        {
            "course_name": "Sociology of Sexuality, Junior Colloquium",
            "review_date": "April 12, 2004",
            "review_content": "\nProf Bernstein, while maybe a little awkward, is actually quite a nice person.  I recommend taking a seminar with her rather than a lecture.  In larger classes, she presents material somewhat slowly and rather undynamically.  However, when in a small class oriented towards discussion, she is a good facilitator, providing clear contructions of authors' arguments and interesting interpretations of them.  Also, if you come prepared with questions, you will really benefit from her thorough knowledge of the material and willingness to guide you through difficult stuff.  She's also a fairly easy grader.\nWorkload:\nIn-class midterm (a cinch if you paid attention in lecture), final paper, take-home final\nJunior Colloquium- weekly 1-page response papers, 3 short papers\n"
        },
        {
            "course_name": "too many",
            "review_date": "December 15, 2003",
            "review_content": "\nProfessor Bernstein was one of my favorite professors, but after two classes with her and not to mention being her advisee on my thesis, I am quite fed up. I realize that she requires you to agree with her ALL THE TIME. Also, she is unapproachable and cold. She is very knowledgable but this does not come across at all in class with her, or in a discussion. \nWorkload:\nDecent. \n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "December 09, 2003",
            "review_content": "\nProfessor Elizabeth Bernstein is by far the worst educator that I have ever encountered. I thought that Sociology of Gender would be an informative and interesting class about the ways in which the issue of gender pervades our society. However, the class was utterly dull and consisted of Professor Bernstein reciting verbatim from reading assignments in a monotone voice. She gave her sociological research utmost importance and seemed to enjoy pounding it into each student's head that men are useless creatures. Professor Bernstein was always condescending, unapproachable, and dismissive. She in no way made the class enjoyable. Her assignments were utterly ridiculous especially the final take-home examination which was tedious, long, and difficult to do in only two weeks time. Even other professors with whom I discussed the project thought that it was ludicrous. Also, your grade suffers if you do not frame your agruments exactly as she would. If you want to get anywhere in this course, agreeing with Professor Bernstein is a must if you wish to survive. If you have nothing better to do with your time thatn to do drawn out take-home examinations, agree with the preposterous claims of a woman who hasn't discovered colors other than black, and enjoy having personal propaganda implanted into your brain then this is the course for you. If you are a free thinker who prefers not to be spoonfed and patronized then try your luck elsewhere.\nWorkload:\nDaily readings that are interesting but regurgitated in class, one take home midterm in the form of a 6-8 page paper, one in class midterm consisting of  essays and term identification (you lose major points here if you don't agree with her particular opinions), and one take home final based on original, empirical research done over two weeks in the form of an 11 page paper\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "May 15, 2003",
            "review_content": "\nDon't take a class with her if you can avoid it.  Unfortunately I had to for a major requirement.  This lady pretty much doesn't teach at all and relies on student's often shitty presentations, sitting there nodding insightfully.  She's so boring, going to a two hour class with maybe fifteen students was actually painful.  If a student doesn't get something right, she makes it clear that she's not right, but won't necessarily make clear what is right.  She just sucks.  She's not nice, she's not approachable during office hours, always on her way to a meeting, constantly rushing you.  You don't know what she's looking for in the papers at all, totally arbitrary grading.  I probably regret being a sociology major most because of this woman.\nWorkload:\n5- 6 pg paper, 8-10 pg paper.  A lot of weekly reading.  A lot (A LOT) of insighful participation on the readings.\n"
        },
        {
            "course_name": "Sociology of Sexuality",
            "review_date": "April 22, 2003",
            "review_content": "\nCourse material is fascinating... Bernstein's concise, clear, and her only problem is thinking that her class is too stupid to follow her into deeper analysis of theory(which i wish she would have done!)... also, she does that typical academia thing of rewording the same idea fifty times with showy sociological rhetoric.  but besides this, i found the class to be extremely interesting, with great readings (especially on psychoanalysis and feminism) and some fun movies.  its a great introduction to sociology, because you will learn to examine many theories through the lens of sociology (and you wont have to take that stupid \"imagination\" class or whatever)...  and who doesn't like a class about sex? \nWorkload:\neasy midterm (just take copious notes, know readings), take home final, final paper based on own sociological research (but no library research)...pretty easy, skim readings\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "December 09, 2002",
            "review_content": "\nWithout a doubt, Bernstein's lectures are slower than any I've ever heard before. She pauses for an eternity at least every few sentences - during which I considered napping. Instead of elaborating on her points, she just made them with very serious, almost self-important emphasis - like she was trying to silently tell us, \"everything I say is so important, I shall pause and let it sink in, and let you scribble down my every word.\" The lectures also tend to draw almost exclusively from the readings, so if you did your reading, the lectures are slow *and* useless. Sometimes she does lecture about things not covered in the readings, but when I used some of this material on a midterm, she didn't like it. The midterm questions are also not particularly relevant to the readings. If you already know any gender theory, you have to really stretch to apply the readings to the questions she asks. You'd think that you could avoid her lecture problem by just doing the readings and not going to class, but no - she takes attendance! In a large lecture class. Stay away from this, even if you love the subject. *Especially* if you love the subject. She makes it boring. The only good thing are the readings, which are interesting and well-chosen. And she occasionally has videos or guest lecturers, which is a wonderful change of pace.\nWorkload:\nAbout average.\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "May 13, 2002",
            "review_content": "\nIf you're looking for an extremely easy class that's actually interesting, take Sociology of Gender. Prof. Bernstein is a really nice teacher, very approachable and seems genuinely interested in her students. She does, however, teach as though the students are 13 which can be very frusterating if you're interested in the material and actually looking for an analytical look at the material. That said, if you just want a class with very light reading which the teacher regurgitates verbatim- this is the one. As another review said, Bernstein tends to let the class digress into mindless, repetitive comments, and she definitely doesn't push students to think very hard about the material. The grading on the midterms was easy, and she lets you bring a page of notes into the final. You could just as easily have learned the entire course by simply doing the reading on your own, but if you want to get easy credits then take the class.\nWorkload:\n2 take home midterms, 8-10 pages graded ridiculously easy by a TA, and an in class final\n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "May 10, 2002",
            "review_content": "\nProfessor Bernstein is wonderful. She is a very warm, passionate person who is just as interested in her student's ideas, as those who are published, and even her own. The course is very interesting, and while some of the readings are a little heavy, she was sure to elucidate any difficult points in class so that we all had a clear understanding. The assignments were interesting and thought provoking. My only complaint is that she takes attendance in a class of easily 50 people, it is sort of juvenile. Come on, we're not in high school.\nWorkload:\n2 take home midterms (each consisted of 2 papers of about 5 pages each... for a total of 4 papers) Final examination in class... haven't taken it yet, but seems quite reasonable.\n"
        },
        {
            "course_name": "Sociology of Sexuality",
            "review_date": "May 01, 2002",
            "review_content": "\nThe readings for this class were great. Always engaging and interesting, however Bernstein was not. Her lectures tend to dumb things down, and the class discussion degenerates into \"This one time my sister's boyfriend met this gay guy at a bar and was like...\" You know what I am talking about. While many classes are prone to people sharing irrelevant personal information, many teachers try to stop it. She does not. I felt that she did little to encourage high level analysis of the texts, so lectures and class discussions were usually disappointing. However, she does bring in speakers who give different readings on things. Class participation is encouraged, though in my class at least it was decidedly dull. She will call on random people. \nWorkload:\nThere is the usual amount of reading somewhere in the neighborhood of 50-100 pages a week. Certainly not a ridiculous amount. A take home midterm, a final ethnographic research paper, and a final exam. \n"
        },
        {
            "course_name": "Sociology of Gender",
            "review_date": "April 28, 2002",
            "review_content": "\nProf. Bernstein is very knowledgeable. However, her voice will put you into a deep slumber. The course material is interesting, but it is strongly advised to keep up with the encyclopedic reading list. In general, it is an interesting class. She is extremely liberal, however...so watch out for that. Oh- and she expects participation. If people do not volunteer their opinion in class, she randomly chooses you from the roll book. It is difficult to pretend you're not there. (Not if someone knows you, obviously). \nWorkload:\n2 midterm papers which are take home (8-10 pages) and an in class final with identifications from the readings as well as two essays. \n"
        }
    ]
}