{
    "prof_info": [
        {
            "prof_name": "Rajiv Sethi",
            "prof_id": 73,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Financial Economics",
            "review_date": "May 22, 2014",
            "review_content": "\nAwesome professor -- Sethi obviously knows his shit. As other reviewers have mentioned, I think Sethi probably does more conceptual stuff than Davidson (not that I know, since I didn't take her class, obviously), but I think that makes the class more interesting and when you know the theory behind the financial instruments discussed it makes doing the problems more intuitive as well. As such, Sethi stressed intuition when studying for exams, not plug in chug math, so I thought the exam problems could get difficult (you lost a lot of points for not understanding the \"why\" behind things) but overall I learned a ton in this class. \nLectures were great -- this is one of few Econ classes I've taken where I think attending lecture is imperative to doing well, and Sethi is obviously really into the material, very engaging, you will want to go to lecture (except that it was in Milbank which was a long ass walk, so I didn't actually want to go, but you'll want to be there, is what I mean). The transition between one lecture to the next is seamless, and he does a brief review of the last lecture every class which I thought was really helpful because then you can actually see how each topic is connected to the next. He also in the first lecture did a pretty good job of laying out the plan for the whole semester which I found really helpful. \nProblem sets were useful for applying lecture concepts and preparation for exams. They could get difficult but it was really satisfying to finish them and feel like you understood the material better. Grad level TAs were helpful, the undergrad TA was pretty useless... she didn't know how to answer any of the midterm questions during OH. Grading on the problem sets was generally fair, if not a bit sloppily done. Midterm was good prep for final, so it's nice that the midterm was only worth 20% and the final worth 50%, since then you get a basic feel for the structure of the exams. Exams were generally fair (see above on intuition), but the curve was pretty hard in my opinion ... this class was not heavily curved, and the average on the midterm was (in my opinion) a lot higher than expected. Grading on the midterm was kind of harsh (not tons of partial credit given). The midterm was a huge time crunch (I barely finished), but then the final wasn't at all (I finished in like an hour and a half, then spent the next hour going back, checking work, trying to figure out the parts I didn't get), which was bizarre. \nOverall, great class, I really learned a lot and Sethi is a great prof. Only complaint I have is that he's fairly unapproachable. He was unwilling to reschedule any exams, midterm or final, also not great about responding to emails... insisted that we post any questions we have on the CW discussion board that probably only 15 students ever looked at, and wouldn't respond to questions via email. He's not mean, just strict and unfriendly.\nWorkload:\nbi-weekly problem sets, making a total of 6 (or maybe 7, can't remember) - 30%\nmidterm - 20%\ncumulative final - 50% \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 02, 2012",
            "review_content": "\nA fantastic professor who does an amazing job of explaining concepts to his students. Though he can rush through things at times, he always makes sure to pause and make sure that everybody is following. If not, he is more than happy to go back and clarify. \nHis course covers a lot of topics and is a great way to build a solid conceptual understanding of these topics. His lecture slides do NOT cover everything he will go over in class, so you will benefit greatly by printing them and writing on them in class.\nThe workload is extremely manageable for the class and does a good job of reinforcing asking you to apply the concepts taught in class to solve the problems.\nDefinitely would recommend attending lectures if you take this course.\nHW 30% \nMT 20% fair\nFinal 50% cumulative\n\nWorkload:\nBi-weekly HW of ~5 questions\n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 24, 2011",
            "review_content": "\nProfessor Sethi was a pretty good teacher, able to fully explain the details of various financial instruments and markets. His lectures were always interesting and very detailed, even more so than his lecture notes online, so if you didn't go to class, you missed out, which would be the biggest problem with his class (it was at 9AM in Barnard).\nIf you're looking to understand finance, take Financial Econ with Sethi; he'll explain everything, making sure it's crystal clear, and if you even have further questions about finance, he's willing to answer them as well to your understanding (someone asked about swaps, which were not covered in the syllabus, but Sethi still gave a detailed answer).\nAnother issue with this class though would be the TAs; I feel like most of the problem sets were graded rather harshly and unfairly (I lost points multiple times because I didn't explain my answers, when the questions never asked to explain, and even when the answers didn't have an explanation...).\nWorkload:\nVery light:\nBi-weekly problem sets, seemingly easy if you go to class and understand, but the TAs (this year at least) looked for any opportunity to take off points (and a lot of them at that)\nMidterm, pretty easy and similar to problem sets and testing the application of the concepts with one true/false section testing understanding of concepts, and one question about mutual funds/etfs that had to do with outside reading that I didn't do..\nFinal, fairly simple and standard questions, does not require much studying if you understand the concepts\n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 17, 2011",
            "review_content": "\nOne of the best classes I have ever taken at Columbia or Barnard.  Professor Sethi is a good lecturer, very organized, and strikes a good balance between theoretical and applied.  He uses both the board (for more theoretical derivations) and his powerpoint slides/information from the internet and even showed a news clip from MSNBC (I think it was) once (for the applied aspect).  I learned quite a bit about portfolio selection, arbitrage, and finance from this class.  He also managed to hold students' attention for most of the 75 minutes and his class was quite fully attended.\nWorkload:\n6 problem sets (30%) - demanding and challenging but fair.  If you take the time to really do them, you will understand the material much better and be much readier for the final \nMidterm (20%) - very straightforward, fair, and not that challenging\nFinal (50%) - cumulative and really tests your knowledge of the material.  If you go to lecture, take notes, do the problem sets, and study, you should have no problems getting an A, or at the very least, an A-.\n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 14, 2011",
            "review_content": "\nSethi's Financial Econ is one of the best classes I have taken at Columbia. I'd say that if you're looking for an Econ elective and can't decide, look no further. This course is practical and useful, and not like other overly-theoretical and often vague econ courses. My suggestion would be to attend every lecture and focus more on understanding than just taking notes, because most of the stuff he writes on the board will be there on the slides too. The structured finance reading assignment was particularly interesting to me. The highlight of the first part of the course is the Portfolio allocation theories, and for the second part it is arbitrage. Overall, an excellent use of Monday and Wednesday mornings.\n\nWorkload:\n6 Problem Sets due bi-weekly and graded rather harshly due to the questions' objective nature. Midterm is fair, and easy if you had been attending lectures. Final is cumulative, and tests all aspects of the course in one way or the other. \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "April 29, 2011",
            "review_content": "\nSethi's class is a must for anyone interested in Financial markets. It provides a sound foundation in most of the concepts which you should know if you want to go in this industry, but will also please those who are more academically-driven. This class is fairly mathematical and deals with a lot of concepts which can seem abstract - for more applied finance, you should consider Corporate Finance.\nSethi is a very good instructor and his slides are basically all you need. Print them and go to class. He sometimes gives more examples and goes deeper into certain concepts, but the core of the class really is in those slides. The first lectures are extremely descriptive and will be boring to anyone with basic knowledge of finance, especially all those who read the technical guides for banking interviews. After that, the course becomes much more analytical. It is overall a quite demanding class, but definitely worth it. \nWorkload:\n6 Problem sets which were quite complex and demand a lot of time. Graded rather harshly. One midterm, quite easy and fairly graded, and one final. \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "January 05, 2011",
            "review_content": "\nTaking Financial Economics with Prof. Sethi was one of the best course decisions I have made at Columbia. Prof. Sethi is clear and organized. There were no surprises, no BS. If you print out the slides, go to class and do the problem sets, you will do well and learn the material surprisingly well.\nProf. Sethi is a great teacher, and very intelligent, but he expects a lot of his students. Similar to Gulati and Elmes, this class is difficult but 100% worth it. Even if you are not intending to head to Wall St, definitely consider taking Financial Econ with Sethi. You'll learn a lot and have a basic understanding for finance that will come in handy later on. \nHint: Sethi posts the slides before the class. Print them out and write on them as he goes through the lecture. The slides have the basic info, but he says a lot in class as well. They won't made as much sense if you don't write notes on them as he goes along. \nWorkload:\nProblem sets, midterm and final. Go to class and it won't be that bad. \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 18, 2010",
            "review_content": "\nAfter a few lectures, you realize that most of the people in the class have aspirations of Wall St. For these people (and I knew a few), the lectures were always attended, the book was read in sync with the lecture notes, and office hours were regularly attended. These students probably shared some previous knowledge of assets and arbitrage etc., and I'm guessing did pretty well for themselves in the class.\nNow, I was not one of those students, so my review will reflect that to some degree. I am an econ major, but am not that interested in pursuing a career in finance post-grad. I took the class because finance was still something I thought might be interesting, and most importantly, I figured would be more mathematical than analytical. After completing the course, I would say that the class dealt with 'numbers' less than I thought it would (not necessarily bad), and stressed hypothetical situations/analysis. \nLecture: Sethi's lectures are very structured, and are all accompanied with lecture notes that are posted online (he may not always refer to them in lecture, but they will be posted). These notes contain 95% of what you will need to know for the class, meaning that the many \"fresh faces\" to show up for the final exam were not likely in any disadvantage. Sethi speaks quickly but clearly, with a slight Indian accent that is easy to understand. I think he does a good job of keeping the class as involved as possible, and does so by carrying out \"experiments,\" by asking the class to offer their own ideas/reasons, and even facilitating a debate. I was not someone who was interested in debating the merits of Goldman Sachs or structured finance, but that didn't affect anything in the end. Those who do participate in these activities are more likely to get a 5/5 on the participation aspect of the grade (5% of final grade... I got 4/5 w/o doing any of the extras), but that's the only benefit I saw. Overall, not a terrible pace to each class.\nParticipation: Very minor part of grade, but an easy one to fulfill. Based on 2 readings/posts and if you do a class presentation. Do the posts, get 4/5. Do all 3, get 5/5. Maybe you can get 5/5 by just doing the posts and other stuff... I'm only speaking from my own P.O.V.\nProblem Sets: There are only 5 (due bi-weekly), which is a huge bonus to this class. Each of the PS's took me between 2/3.5 hours to complete, and ranged from straight-forward to downright confusing (...maybe they were just hard). I felt that the easier ones were those that were more mathematical, with the harder ones requiring much more internalizing and research through the slides/book/elsewhere. These were fairly graded, as one might expect when the answers are pretty objective.\nMidterm: Took the class period to complete (1:15). Was 4 equally weighted questions, all could be studied for via the slides. 2 involved math, 1 t/f based on concepts, 1 analysis based on concepts.\nFinal: He allows the entire 3 hrs, but I feel that a lot of people are finished before that. I was done in 2:30, and I'd say that a little less than half the class still remained. The final was 6 questions, similarly structured to the midterm in that there was a mix of questions that tested pretty much every aspect of the course (some more directly than others). \n---\nSethi tells the class on day 1 that he assumes that no one in the class has any prior knowledge of finance, asset markets, etc., and he does a pretty good job of teaching with this in mind. I didn't read the book once, and I don't think that really hurt too much. Attending lecture and studying the lecture notes he provides online is enough to get by in the class. Those who really pour themselves into attending office hours, reading ahead, and understanding the material are going to be those that end up in the A range.\nWorkload:\nPercentages: 5% Participation, 20% PSets, 25% Midterm, 50% Final\n^Descriptions all provided above.\nFor an idea of the curve, I ended up with a calculated grade of 69.92% and was given a B. \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 15, 2010",
            "review_content": "\nIf I am not dazzled by the final, i should be right to say that rajiv was proctoring it with an ipad, quite a tech fashion guy you can see, but what the he** he was doing with ipad in final(?)\nHis slides are really good, making the textbook become useless. the textbooks are good for solving some homework problems though as they often share simlarity. His lectures are not very interesting, just going over slides. I think it is just easier to learn from the slides than his lectures. If i did not have a class at 9, i probably would skip his 10:35 class. as someone who attended every lecture, i saw lots of unfamiliar faces in midterm and finals, you can expect the attendance rate.\nTests are of very liberal arts, much less quantitative than my other econ classes taken in Columbia. most questions require \"explain\" only. ironically, most materials are just maths, equations that produces non-arbitrage condition. it could be more practical to be more quantitative.  SEAS students are crippled in this class. But i like this class for there are only 5 problem sets. and the problem sets are more interesting as you are really doing the math about financial econ. final is cumulative. from my experience on his midterm and final, you can just disregard those examples covered by notes and practice tests. sethi knows everyone knows those stuff well. he would always test what you ignored or what you have not seen. \n\nWorkload:\n5 problem sets, only the second is hard. others are easy, can be done within 3 hours. counts participation, wont get full credit unless you volunteered to give a presentation. cumulative final. \n"
        },
        {
            "course_name": "Environmental and Natural Resource Economics",
            "review_date": "February 03, 2004",
            "review_content": "\nvery smart professor, interesting lectures, but he is really intense and moves really fast--no nonsense teaching style. great powerpoints will guide you through the fast-paces lectures, though. covers many interesting topics, but it's not easy stuff, so you have to stay on top of readings and go to class to do well on problem sets and exams. he's helpful in responding to emails and questions posted on courseworks.\nWorkload:\n4 problem sets (time consuming and strictly graded), midterm, final, class participation (in courseworks and in-class discussions). nothing unreasonable, grading is fair, but exams and problem sets are by no means easy. you'll learn a lot, but you'll work for your grade.\n"
        },
        {
            "course_name": "Environmental and Natural Resource Economics",
            "review_date": "January 23, 2004",
            "review_content": "\nProf Sethi is a really organized, knowledgeable, and engaging.  He was really great at exposing us to various aspects of environmental economics.  The course was filled with so many interesting and stimulating topics.  Prof Sethi has PowerPoint slides as a guide for every lecture so that you're sure you won't be lost during class.  Some previous reviews have written that he is unaccomodating, and from my experience, that is far from true.  He responds *extremely* quickly to emails, and he is very open and helpful during office hours.  For our final review, he stayed an hour past his office hours to answer questions.  He is fair, and you always get the grade you deserve.  If you go to lecture and understand the material he teaches, you will do well.  Just don't think that simply reading the PowerPoint slides will give you an A b/c they are there to supplement (not substitute) his very enjoyable and engaging lectures.  Take his class, you won't be disappointed.\nWorkload:\nReasonable:  4 problem sets, midterm, final, 4 discussion board postings.  The readings are very light.  Grading is very fair.\n"
        },
        {
            "course_name": "Environmental and Natural Resource Economics",
            "review_date": "January 20, 2004",
            "review_content": "\nOK, apparently according to earlier reviewers he did not do a good job at intermediate macro, but this must be because it is just beneath the level at which he really shines.  I can't say what his other classes are like, but for Environmental Econ Sethi is hands-down, an EXCELLENT professor.  For example, even he admits that his Financial Econ class is still \"under construction\", but he has been teaching Environmental Econ for quite some time and has it absolutely polished.  He is very clear and very organized and cares a lot about helping all of his students to understand the material in class. Overall, i would HIGHLY RECOMMEND this class as Sethi does an excellent job with it.  I promise you it will be a very enjoyable experience even if you didn't have a previous interest in Environmental Econ.\nWorkload:\nin about 5 of the classes, half of the class period is devoted to discussion  of pretty good articles.  you can also post comments online about the articles if you want to help your class participation grade.  there are 4 PSets of 4 or 5 questions each, definitely manageable.  the midterm and final are no gimmes but have no surprises either.  basically, go to class and do the problem sets, study some for the tests, and you'll be fine.  \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 05, 2004",
            "review_content": "\nI took Prof Sethi for intro and intermediate.  He was good for intro and well. . . not so good for intermediate.  I understand many people in the class were econ majors and could grasp the material easily, but I also know that many were not.  Prof Sethi spoke very quickly and rushed through most of the in depth curriculum.  All his power point slides were posted online and accessable before the class but were highly incomprehensible.  Prof Sethi was unaccessable and as previously stated, he was the first one out of the class room on most days.  Good thing about the class though, fairly decent curve.  On the midterm an ~20/ 50  was a C.   \nWorkload:\n6 problem sets (my advice: check them over with someone before handing in) 1 midterm and 1 final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 04, 2004",
            "review_content": "\nI agree with the previous review. Sethi is unaccomodating and i took this class solely for the rave reviews of the professor. I went to office hours once and Sethi was most unhelpful and unapproachable. That deterred me from going again because although polite, he was cold and it seemed to be a task for him to answer my questions.  Although his lectures are well-organized, he speaks too quickly and wastes valuable time answering questions from students that do not effect the rest of the class and as a result, rushes through the second half of the lecture. Basically, i did not find him to be a good professor, sure he can teach but when you do not understand a concept, he is not all that welcoming to explain it to you.\nWorkload:\n6 Problem Sets which get difficult as the course goes on, Manageable Midterm, very difficult final. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 02, 2004",
            "review_content": "\nI was thoroughly disappointed by this course. As the first reviewer asserted, Sethi's lectures were incomprehensible b/c he spoke so fast (this guy never pauses to breathe) and rushed through the material. It was impossible to ask him questions after class b/c he was always the first one to leave the classroom! The problemset questions were manageable, but they were certainly nothing like the ones presented on the midterm or the final. Neither Sethi nor the TA were very helpful in preparing us for either tests. However, if you post questions on the messageboard on courseworks, Sethi is very good about replying back. \nWorkload:\n6 problemsets, 1 midterm and 1 final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 23, 2003",
            "review_content": "\nI honestly do not know who the other people who reviewed Rajiv Sethi are, but they must be ajdadkdk to think that he is a good professor.  Sethi is very inacessible, he talks to fast, and is always very thin on his patience.  He has great lecturer outlines, but its not really of use when no one in the class really grasps the concept, is it?  The book is a waste of time, he doesn't follow it much.  Have you ever walked out of class absolutely retaining nothing from the class, well that is Sethi for you.  HE IS ALSO VERY UNACCOMADATING.  This class was a BIG BIG disappointment (maybe its because he just got tenure).  The midterm is okay, but the final is really hard and worth 50% of your grade.  Advice: Take this class at Columbia, the curve will be much better.  Macro has hard enough concepts...really don't need a pretentious/impatient professor to make it worse...\nWorkload:\n6 Problem Sets...doableMidterm...not bad, not easy, but not badFinal...hard as hell \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "August 14, 2003",
            "review_content": "\nHe is a good professor. His lectures are well organized, clear and cohesive. He responds to e-mails rapidly and is always there if you need his help. At times, his lectures could be boring, but in general he is good. Overall, I would recommend him and would take another class with him.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "June 29, 2003",
            "review_content": "\nProf. Sethi was amazing!!! I have never seen a teacher so dedicated to his students and wanting them to excel. Take advantage of his office hours and of his message board on courseworks!! Economics is a very important subject to understand for all aspect of your life and Prof. Sethi makes it so interesting and makes you want to understand. I highly reccomend him!!\nWorkload:\nNot bad: 6 problem sets (if you have any problems just ask him for help!), 1 midterm, 1 final. (He focuses on his class notes)\n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 19, 2003",
            "review_content": "\nExcellent professor [though a litlle on the anal side]. The thing I liked the best about him was that he presented everything in a real coherent manner. Even the problem sets were incredibly clear unlike most econ classes. While the first half of the class was excellently taught, the second half after the mid term was a bit of a drag. He was a little too repetitive on the options part, and the material got a bit boring. But on the whole you will learn a lot from this class and its no pushover.  \nWorkload:\nDecent amount of work -- not too much though. 6 problem sets so one every 2 weeks. Tests were relatively straightforward and very fair grading. \n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "May 17, 2003",
            "review_content": "\nProf. Sethi's class is very organized and he presents the material in a clear and understandably way. All lectures are put online as powerpoint slides so you don't have to take extensive notes in class. Prof. Sethi is very approachable and welcome to questions. The problem sets due every other week makes the class easier to handle in terms of work.\nWorkload:\n6 problem sets (due every other week), midterm and final. \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "March 19, 2003",
            "review_content": "\nRajiv was a great professor!! I really reccommend this course whether you're interested in econ or not because Rajiv makes it so interesting and enjoyable. He's sooo cute!! His teaching style is very systematic and everything he covers is in the book too. He's very organized and clear. for the second half of the course he applies everything you've learned to  real life situtauions that have happened in the world, which makes it very interesting. After this course you'll feel like a much more informed voter and participant in society. Yuo'll be able to pick up the NY Times business section and understand what it's saying. It's a great lecture! He has a bit of an accent but it's really not bad at all. \nWorkload:\n6 problem sets. not too bad. everything was covered in lecture and the book. midterm and final. Also not so bad. he focuses on lecture notes.\n"
        },
        {
            "course_name": "Economics of the Environment",
            "review_date": "September 04, 2002",
            "review_content": "\nSethi is an excellent professor who is open to meeting with students about any problems with the class. He is organized, clear, and presents the information in an interesting manner. A note on the first reviewer for Sethi: why would you assume that all Barnard classes are an easy A? Please get off your high horse and actually take some classes before you make such sweeping assumptions.\nWorkload:\nmanagable, with challenging exams.\n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "December 31, 1999",
            "review_content": "\nA good introduction to the financial markets. Prof Sethi is genuinely interested in the subject and more importantly, interested in imparting his knowledge to the students. Don't worry about his English--he has an accent but he's very understandable. Expect a standard curve as this is a large class.\nWorkload:\nweekly problem sets, midterm, final.\n"
        },
        {
            "course_name": "Financial Economics",
            "review_date": "December 31, 1999",
            "review_content": "\nAlthough this class is offered by Barnard, expect to find all the hardcore Economics majors from Columbia in this class. Yes, it's a Barnard class, but it's no easy A since it's mainly Columbia students. That said, this class is a very good introduction to those who may want to work on Wall Street or in finance. Prof Sethi does a good job of stripping away the glamour and details by presenting a clear picture of finance and the financial markets. A good econ elective to take, in my opinion.\nWorkload:\nproblem sets, midterm, final\n"
        }
    ]
}