{
    "prof_info": [
        {
            "prof_name": "Jerry McManus",
            "prof_id": 4359,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "V2100 The Climate System",
            "review_date": "October 27, 2016",
            "review_content": "\nThis class was a lot different than I expected going in. While I was excited for the class, about 3 weeks in I realized it wasn't what I wanted. The labs are very computer based and the hands on part are remedial at best. I felt the entire lab section of this class was not very interesting and was heavily math-based. The class felt like I was taking another math class, but gave entirely new formulas that were given very little context on how to use. If you are a sus dev major and not a math person, I would not recommend taking this class. Sobel's lectures were interesting but packed in so much it's very difficult to retain anything specific.\nWorkload:\nhigh, a math-related questions due Tuesday and lab reports due Wednesday. \n"
        },
        {
            "course_name": "Earth's Environment System: Climate",
            "review_date": "January 08, 2015",
            "review_content": "\nThis class is amazing. It's a lot of work and takes up a ton of time but McManus and Shaw are both the kindest and most caring professors I have ever had. The two are willing to meet with any student at any time, which is hard for them because they split their time between Morningside and Lamont. I don't consider myself a science person and at times the material got a bit tricky, but McManus and Shaw are always willing to explain something over and over again. Overall though the material isn't too bad and the professors are amazing. \nThe labs take up a lot of time, but overall the TAs are fair and are also always willing to explain the material or why they took off points somewhere\nGO TO OFFICE HOURS. Can't stress that enough. Don't take this class if you don't have time to devote to office hours and asking questions outside of class. \nWorkload:\n11 labs, 8 hw assignments, midterm (a little tricky), final (very easy)\n"
        },
        {
            "course_name": "The Earth System: Climate",
            "review_date": "September 21, 2014",
            "review_content": "\nI took this class first semester of my freshman year and it changed the way I think about the earth. We learned about how and why our weather patterns exist, why there are deserts where they are, and how the ocean is acidifying due to global climate change. No prior knowledge is assumed. Only algebra is required. Professor Shaw teaches the first half of the semester, and she is fantastic. Her lecture style is geared so we really  understand the material, and she reviews key concepts from the last lecture at the beginning of the next day so you know what to study. Professor McManus is even better, though! He's a super sweet guy who just really loves talking about the oceans, and his office hours are very relaxed. They both really want you to succeed. The lab portion is well integrated and actually illustrates concepts from class. \n10/10 would recommend. \nWorkload:\nHomework is completely doable - just a few (2-5) problems/week. The tests are easy if you study - no tricky material. Lab can be tedious, but it's all done on the computer, so you can do it from your bed - you don't have to stay in lab period if you don't want to. But the TA's are really helpful if you do. \n"
        },
        {
            "course_name": "Earth's Environment System: Climate",
            "review_date": "December 23, 2011",
            "review_content": "\nJerry McManus is seriously the nicest professor I have ever encountered here at Columbia. He is so willing to help his students and genuinely wants to see them all do well. He teaches the second portion of the Climate class (the first professor is great too). He sometimes is a bit sidetracked/hard to follow, but if you ask him questions, he is great with clarification. Also go to his office hours! He will sit with you through every single question you have and make sure you're understanding everything. He is very understand and overall a great teacher. Climate overall can be a difficult class because it requires a good amount of memorization, but if you attend lecture, it's relatively simple to follow.\nWorkload:\nNot bad - 8 HWs (very simple, a few problems - 10%), a midterm (30%), final (40%) and labs (20%). Some readings that are not required, but are very helpful.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 05, 2011",
            "review_content": "\nHe was the BEST Frontiers of Science professor I could possibly have gotten.  He is a modest and sweet guy with a genuine care for all of his students.  He gives weekly quizzes and thoroughly goes over the WIAs so that all of his students understand exactly what's going on.  Furthermore, he gives us snacks weekly!  he really does everything in his power to make sure Frontiers is not the boring and pointless class that everyone dreads going to.  I genuinely enjoyed going to his class, due to his lighthearted teaching style and pleasant class environment.  Also, our class had a very high average on the midterm (second highest out of all the sections).  He is an easy but very fair grader, and even if science isn't your forte, you can do well in his class.  LOVE THIS MAN.\nWorkload:\nweekly quizzes and WIAs due at time of discussion section, coursewide midterm and final\n"
        },
        {
            "course_name": "Earth's Environment System: Climate",
            "review_date": "December 30, 2010",
            "review_content": "\nThis class has to be my biggest disappointment at Columbia thus far.  The class was, at times, pathetically redundant with the Frontiers of Science curriculum, which itself was often pathetically redundant.  The class's makeup also seemed to be averse to learning Environmental Science itself, as most students were either Sustainable Development Majors or were there for the Science Requirement.  Thirty minutes of a class were once spent on explaining why the seasons occur, and amazingly several members of the class were still confused.  The subject matter was tragically interesting - the first half of the semester, taught by Jason Smerdon, dealt with Atmospheric Circulation and Weather Systems.  Although at times he came off as shallow, Smerdon was extremely charismatic and held the class's attention quite well.  The second half of the semester was taught by McManus, and although he came off as more intelligent than Smerdon, his lectures sometimes rambled and his class notes were not helpful with studying, consisting mostly of pictures and scanned scribblings.  His lectures focused on Deep Ocean Currents but also spent way too much time on the same 3 ideas about Climate Change.  \nI would have liked to call this an \"easy\" class due to its sparse and repetitive subject matter but this was not an \"easy\" class.  Even if you pay attention and take notes in class, and even if you read the optional readings from the textbook, I still cannot say you're going to get an A in this class.  The weekly labs were a shitshow.  The TAs came disastrously unprepared to labs, which as the semester progressed often required downloading glitchy software that the TAs did not understand how to use and also failed to tell us to download in advance.  Most labs consisted of inputting data into Excel and making graphs over and over again.  It did not matter if you understood the subject matter (which was often a painfully basic grasp of Climate Change), but a few formatting errors in Microsoft Excel or Word could cost you one or two letter grades.  The TAs often didn't respond to emails sent regarding formatting yet penalized students harshly on formatting when grading labs.  Their grasps of labs' actual content were also maddening, and they were often bitter and angry when politely challenged.  If these people are on the front lines of environmental change and study, we are fucked.\nIt is seriously unfortunate that this class is a requirement for an EESC degree, as this completely turned me off to the entire department\nWorkload:\nextremely redundant and painful weekly labs worth 30% of grade, P/F homeworks worth 10%, 30% midterm, 30% final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 09, 2010",
            "review_content": "\nHe was absolutely wonderful. Genuinely a nice man who wants his students to understand as much of the material as possible. Discussions were boring, but that is to be expected in frontiers. He will help you out as much as he can, offering office hours and a review for the final. He was lenient with grading and gave students as much credit as was merited. He was enthusiastic and encouraging. I got really lucky with him, considering how many horror stories I've heard about other sections. If you do the WIAs, skim the readings/lectures, and go to class, you should be fine. I never went to lecture and managed to do well on the homework, quizzes, and midterm. Take him if you can, you won't regret it and this class won't be too much of a downer.\nWorkload:\nweekly WIAs as is standard; weekly quizzes; course-wide midterm; course-wide final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 09, 2010",
            "review_content": "\nProf. McManus really carried my experience with FroSci and made it as bearable as it could be. He's amazingly coherent, interested in engaging humanities people, and (best of all?) an easy grader.  He will look for ways to give you points on the tests and encourage clarifying discussion in class. A word of advice to future classes: if he gives you the option of taking quizzes every week in discussion, take it. Between the weekly quizzes and going over the homeworks in class (again, I would recommend doing this, given the option), your retention will soar. Aside from the problems associated with the course as a whole, if Jerry McManus is your FroSci section leader, I feel you really don't have anything to complain about.\nWorkload:\nStandardized; although he expects much less of the \"labs\" in section\n"
        }
    ]
}