{
    "prof_info": [
        {
            "prof_name": "Mary Putnam",
            "prof_id": 11077,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "December 27, 2010",
            "review_content": "\nPutnam is a decent professor. Not extremely engaging, but tries to make the material interesting (this is coming from someone who is not inherently interested in the subject matter at all).... but the work is HARD! it's minimal (like 8 problem sets and a midterm and final), but you have to know what's what on the tests! If you're not going to do the reading, and if you're not good at science, getting above a C isn't a guarantee. That said, it was a semi-enjoyable class and i dont regret taking it to fulfill the science req. \nWorkload:\nproblem sets, midterm, final, yada yada\n"
        },
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "December 22, 2010",
            "review_content": "\nThis class was a lot of fun, and would be a great way for to fill a science requirement or dabbled in astronomy. Professor Putnam brought us through Special and General Relativity, galaxy formation, and the Big Bang, with discussion of dark matter, dark energy, etc. in there, too. It was a pretty conceptual class, with almost no math involved. Sometimes Professor Putnam told us about ongoing research being done on certain things we were talking about. \nExam reviews were fun, too. Professor Putnam used a Who Wants to Be a Millionaire program to make a game out of the review, with students picked out of a hat playing for prizes including candy, a Luke Skywalker action figure, and bonus points on a homework. \nIf you are looking for a more rigorous understanding of astronomy, I suggest you jump right to the astrophysics I and II courses. This is definitely an introduction. Nonetheless, you learn a lot and it's all pretty interesting.\nProfessor Putnam herself is not the most engaging lecturer, but she's not bad, by any means. Most people kept coming to lecture, and Professor Putnam tried her best to keep it interesting by showing movie clips and NASA photos and making sci-fi references/jokes (for instance, when discussing wormholes, she described the way faster than light travel is achieved in the Star Wars, Star Trek, and Battlestar Galactica universes).\nWorkload:\nTiny. An easy and short problem set every two weeks or so, a midterm and a final, both mostly multiple choice with some short answer. The textbook is good but entirely unnecessary.\n"
        }
    ]
}