{
    "prof_info": [
        {
            "prof_name": "Emma Lieber",
            "prof_id": 9679,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Literature and Revolution (20th Century Lit)",
            "review_date": "April 21, 2013",
            "review_content": "\nYou should probably disregard the review below me, it's unnecessarily harsh, and sounds more like a personal vendetta than a constructive review. This review is for Emma's Lit and Revolution class in Slavic Studies.\n1. Emma Lieber is an unbelievably caring person. If you put in the time and effort into her class, you'll get out of it exactly what you want--strong discussions, a venue for your ideas, and a spring board for higher engagement with the text.\n2. She is a \"harsh grader\" by Columbia's standards in that she doesn't inflate your grade. So while the person below me believes that their High School English teacher would have given them an A+ on their paper, Emma is not going to fluff you up, and isn't going to to give you a grade your paper doesn't deserve. If you can't write the paper grammatically and structurally at a college level, even if you have a stellar argument, then you're not going to get that A- you so desperately wanted to coast on. That said, Emma is ALWAYS available to meet up with you, even if it's outside her office hours. She gives great feedback, and wants to help you write the best paper you can write. Again, if you put in the time and effort, you have an amazing resource in Emma Lieber.\n3. I agree, however, that discussions in class can be led by students a little too much at times, but that's her style, and it has it's own pros and cons. In our Lit and Revolution class she actually does have a lecture portion, which I find super helpful, and which is where a great amount of our conversations develop from, so that provides a good amount of structure for the class. I haven't ever found myself bored with the conversations happening in class or feeling that they are too student led. \n4. Despite the one negative review on this thread, please please please take Emma's classes! She's a heartfelt teacher, always looks out for her students, and is an amazing person. Put in the hard work yourself, and you'll get the results you want.\nWorkload:\n1 final paper; reading every week.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 26, 2013",
            "review_content": "\nProfessor Lieber was an interesting professor for Literature Humanities Semester I. In my opinion, she is not as \"excellent\" as previous commenters say, but she was also not terrible.\nFirst, Professor Lieber is a very nice woman. She is a caring person and encourages everyone to meet with her before papers. She conducts discussions with moderate, but lacking skill. Despite her attempts, there were still very many awkward gaps during our discussions. Our class was at 9 AM and I think she needs to take greater initiative to get her students to think more critically during discussion. In my opinion, Professor Lieber didn't really contribute anything significant to my understanding of the literature. She allows students to discuss any topic, even if that includes the morality of having sex with one's mother (yes someone was arguing that such is not a bad thing). Professor Lieber could greatly enhance her class by incorporating a smaller lecture component in each discussion. Of course after taking one semester with her, I'm not sure if she has ANY real knowledge about these texts. In one meeting wit her, she told me that she did not \"remember\" the specific passage from which I decided to write my paper. I wanted to tell her: \"HELLO you assigned the reading so you should at least remember the details of this scenario\". I then received a B on that paper. I find it ironic that she finds her self able to grade my paper after being unclear about the subject matter.\nThis brings me to my second qualm about Professor Lieber. She is a very harsh grader. I thought Lit Hum's purpose was to increase my literary analysis skills and enhance my knowledge of these texts. Rather than grade me on my knowledge and innovation, Professor Lieber grades me on HOW I write my paper. Most of the comments on my papers were stylistic. I never received above a B+ on a paper because she always found a problem in the way I expressed my argument, but not  actually about a problem in my argument. This is NOT Uwriting. What is more frustrating is that when she hands papers back, she provides very few comments. She will find one error, explode upon that and randomly assigns a letter grade. \nI'd advise future students to meet with her but I doubt that will greatly affect your performance. I met before and after my papers and she often gave blank looks and answers, with no real explanation or helpful insight. I met with her before my 3rd and final paper, and she told me that I had \"great ideas\" and then she didn't contribute anything to my paper though I kept asking her for advice and ideas to strengthen my argument. \nMy biggest gripe with Lieber's grading is the timeliness. I went into the final, not knowing 65% of my grade because she doesn't release your grade for participating (20%), your grade for the final paper (another 20%), or the final exam (25% of grade). I do not attribute any part of my good performance on the course-wide final to Emma Lieber's teaching. \nOh, and she will randomly pick a favorite for discussion. She has ONE favorite, so start ass-kissing. \nIf you're reading this, I hope you don't get Lieber for Lit Hum. She will only frustrate you. I head of other students in my class who didn't participate at all get As or A-s which makes no sense. I was one of the top 5 participators and I received a B+ in the end. Thank you for rewarding me Emma? The worst is when you students who dont read anything in your class and other classes are getting your grade. \nConclusion: STAY AWAY FROM EMMA. \nWorkload:\nStandard Lit Hum. 3 papers. 1 Midterm. 1 Final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 06, 2010",
            "review_content": "\nIf you get Emma Lieber as your LitHum professor, you have been very lucky. She has made LitHum one of my favourite classes this year, simply because she is so lovely.  Not only is she willing to listen and facilitate student-led discussions, but she also contributes revelatory points that prevent class from becoming a free-for-all.  She is a fan of crazy, abstract diagrams, but these incomprehensible drawings always denote some profound structural or thematic idea.  If you follow what she says, you'll reach a new understanding of the books.\nEmma really values what each student has to say, and will summarise each person's contribution to make ideas clearer for the class.  She regularly invites students to start the discussion by pointing out what they found interesting, and this has led to some great conversations over the course of the year.  She is passionate about the class and all the texts (especially Dostoyevsky) and genuinely cares for her students.  She is one of the few professors I would consider talking to if I was finding things difficult, and it is the free environment of her classroom that engenders that.  \nThe work load is standard LitHum and she will meet with everyone before papers. There are minimal reading responses due the night before each class, which can be as detailed or short as you like.  She can also be convinced to alter due dates if she deems it necessary. Midterms and Finals are really easy, provided you have done the reading.\nEvery class I've had with Emma has been engaging and fun, and there is not a single one that goes by in which I have not laughed out loud.  LitHum with her is the perfect example of acadamia existing in a healthy, happy environment.\nIf I get a chance to take another class with Emma during my time at Columbia I will, as I doubt I'll find a professor as endearing or personable as she is again.\n\nWorkload:\nStandard.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2010",
            "review_content": "\nEmma Lieber is a wonderful grad student and Lit Hum teacher. She focuses on the students, and what we find interesting and captivating about the books we read. Though she doesn't leave it all up to us - she always has her own ideas and thoughts to share with the class that get developed through further discussion. She finds a great balance between thoughtful discussion and having fun as well!\nEmma's not a lecturer, her class thrives on the discussions that she initiates and that the students continue, which works out to be an amazing experience. She's excellent at grading papers and giving constructive feedback, and she's also always available and willing to help with essays. My writing has certainly improved because of her help and feedback. \nIf you get Emma as your Lit Hum teacher, consider yourself lucky! She's a wonderful person and a wonderful teacher!\nWorkload:\nApprox. 3 essays, 1 midterm, 1 coursewide final, moderate readings, short response due by email before every class\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 20, 2009",
            "review_content": "\nEmma Lieber was a great person to have as a LitHum professor. Vibrant and interesting, she led interesting discussions, which let the class develop its own ideas. She provided great background information on each of the works, and let us develop the discussion, so that we could discuss the issues that we found the most interesting, not just what she though deserved to be talked about. Her interjections into the discussion were always helpful and constructive, and brought up new points that the class had not come up with yet. \nIf you are looking for a class in which you are going to have knowledge forced down your throat, this is not it; Emma lets the students do the talking, and discuss issues ranging from Platonic Forms in The Symposium to phallic images in Lysistrata.\nOverall, a fun, fascinating LitHum class!\nWorkload:\n3 essays, reasonably graded. Midterm, which was essentially a shorter final, was helpful for preparing for the final. You have to submit a short reading response every night. Normal LitHum reading, nothing dropped, nothing added.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 15, 2009",
            "review_content": "\nEmma Lieber is the best instructor I have ever had. She is a young, vibrant grad student who is extremely open to the possibility that her reading of a text is not necessarily the best or most authoritative. Her analyses of the texts we read in Lit Hum is astounding, and she always brings incredibly insightful ideas to the table. While the class usually stays on topic of its own volition (because the discussions are so compelling), she is not afraid to let us go off on a tangent or crack jokes (especially when we read \"Lysistrata\"). She is a very fair grader, gives exquisite writing advice, and will not hesitate to meet with a student outside of class to discuss a paper before it is due. Her critiques of my papers have improved not only the way I write, but the way I read and analyze texts. Emma has made me want to go to graduate school at Columbia and teach a Lit Hum course. \nWorkload:\nMedium reading load, 1-paragraph reading response before each class, 3 4-to-5-page essays, medium difficulty midterm and final.\n"
        }
    ]
}