{
    "prof_info": [
        {
            "prof_name": "James Harrigan",
            "prof_id": 3087,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "International Trade",
            "review_date": "January 18, 2007",
            "review_content": "\nI guess I have to disagree with what other reviewers comment about Harrigan below. Surely he is well prepared and knowledgeable in the field, I really found him not so interested and by all means too rigid in terms of handing in homeworks and taking notes and be late and so forth. In the first 2 weeks, I knew more than 10 people dropped out simply because they couldn't stand his dry humor and rigidity. I had to take this class with my schedule but I so regretted this afterwards. The problem sets were long and required much more numerical interpretations than his lecture notes (which were all theory). Each problem set took me and my teammate at least 5 hours to finish and double check. I think those who really stayed at the end of the class were his real fans and thus wrote such good reviews for him.\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "January 15, 2007",
            "review_content": "\nTake this class! You learn so many things in such a painless way. Professor Harrigan presents it all to you in such an organized manner. Take good notes because he doesn't post his powerpoint online. I found that annoying at the beginning, but I became really thankful that he doesn't simply let us print out his lecture slides, because i am never once behind in this class and it really forces me to always go to class. Writing his lectures down really forces you to always think as he teaches. Professor Harrigan is also a really nice approachable guy. As a junior, I haven't taken too many econ electives, but I really hope all other electives are as good as this one. \nWorkload:\nMedium. about 1 problem set per week, a midterm and a final which could be tricky but he gave practice exams which are almost identical to the actual exams.\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "January 05, 2007",
            "review_content": "\nThe good: Great class for anyone interested in trade; very structured lectures; rarely boring because he uses enough real world evidence and stimulates questions; he goes over models in detail; TAs were very good\nThe bad: Harrigan can be very rigid sometimes; homeworks are due before class starts so if you're late you lose those points forever; hhomeworks are hard so be prepared to spend 4-5 hours on them every week;\nBottomline: The best elective I've taken so far\nWorkload:\n4-5 hour HW every week; 1 midterm; 1 final (non-cumulative)\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "December 20, 2006",
            "review_content": "\nIf you are looking for a great class in International Trade I think James Harrigan is the man to take this course from.\nFirst of all one of the things you need to believe that what any professor tells you about economics is the real world relevance, especially in a subject like International Trade and Prof. Harrigan is from the New York Fed. It doesn't get more real life example of an International Trade policy maker than this. \nProf. Harrigan comes in everyday with his slides and makes small jokes and remarks about how many people he knows closely in the international trade arena, and he knows almost everyone - smart guy eh, and delivers a solid class. He is concise in the number of slides he puts up there and I have never been bored in this class. Looking back at this term I think this is one of the few classes at Columbia that I never got bored in for even 2 minutes.\nYou have to be on your toes as you take notes because Prof Harrigan doesn't post the lecture slides on courseworks. Thus TAKE NOTES/ GO TO CLASSES.\nHe curves to a B, and the grading is very fair so far. There is one midterm, weekly homeworks, 10 in total and one final exam.\nHomeworks are 4-5 questions each and takes about 2 hours at most if you took notes in class. Go to the office hours of the TA's and they will solve similar questions or at least explain where you need help with.\nMidterm and Final same format. 10 multiple choice, 5 short essay questions, adding upto 100 points. Each multiple choice is 5 points and short essays are 10 points each.\nFair grading.Great class. Great Lecturer. Hope he makes more visits to Columbia.\nWorkload:\nWeekly Homework, takes about 2 hours, one Midterm and a final. Midterm and Final are similar in format, as explained above. \nLess work than Prof Elmes' class and even less work than Prof Xavier's class, in terms of homeworks. \n"
        }
    ]
}