{
    "prof_info": [
        {
            "prof_name": "Giancarlo Visconti",
            "prof_id": 12798,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 02, 2014",
            "review_content": "\nI came into this class with extremely high expectations based on culpa reviews, but found myself extremely dissatisfied in a number of different ways. \n(1) If El-Ghobashy is a \"genuinely nice\" person as other reviewers have said, it really did not come across in her class. Instead, her demeanor was invariably condescending and just flat-out annoying. Constant reminders about how she was \"going to teach us how to think\" and about how we should or should not take notes were honestly just ridiculous. I think El-Ghobashy really epitomizes the self-aggrandizing academic...if that doesn't bother you, then pay no heed to this point, but I really found it incredibly annoying.\n(2) I think the first complaint about the way she handled lectures really carried over into all other parts of the class. The main assignment, the \"research design,\" is basically just a fake research paper, and the reason she assigns the dumb thing instead of an actual paper is because she doesn't think you're smart enough/competent enough to actually write a research paper. Then, on the first draft of the assignment, she only gave an A-range grade to one person in the entire class of 150 students clearly just to make the point that we need to pay attention to her class (I mean, really, who does that? High school teachers maybe?). She actually graded my first draft, and I swear she didn't even read the whole thing...so much for her \"detailed comments\" bs. This assignment really just made me super frustrated, although granted I've taken several polisci classes before... but even if you haven't, the only way you learn how to do research is by DOING IT, not by doing some pseudo research assignment. \nI'm still glad that I took Intro to comparative with her instead of kasara, because I've heard Kasara is actually terrible. But if you don't have to take it for major requirements, I would highly consider just passing on it and taking a better comparative class like Latin American Politics or Politics in Russia or literally anything else. \nA few other points:\n- class was well-organized, deadlines/syllabus were clear.   \n- she is kind of a ramble-y lecturer. She is engaging body-language-wise, but she often goes off for 20 minutes talking about something that could be said in 2. She acts like the stuff she's saying is so nuanced, interesting, and unexpected, when it's really not very complicated at all. Also, slides did not really go in any logical order, and she constantly confused herself about where she was in the presentation. \n- One other thing about her lecture-style which I found incredibly annoying was how she tried to get so much class participation in a huge lecture. This is just dumb. Nobody in the class wants to hear their peer who didn't even do the reading talk! As much as I found her annoying, at least she actually knows the material and is worth listening to. I know this is kinda mean, but it really got annoying honestly. That's what section is for (although I admit it's still painful there too). \n- sections are PAINFUL. half of the people never talk and just pray that you don't get one of those people in your section that can't articulate anything but likes talking. My TA, Giancarlo Visconti, is awesome, though, so if you can take it with him, definitely do. \n- Haven't gotten any final grades back yet, but it's definitely possible to get an A in the class. \nWorkload:\nOverall very standard. readings normal for polisci. tests not bad. super annoying (but not hard) research design. \n"
        },
        {
            "course_name": "Latin American Politics",
            "review_date": "January 01, 2014",
            "review_content": "\nLatin American Politics with Professor Murillo was a blast. \nDespite the fact that we were locked up in a windowless basement in Mudd, it was a great class. \nThe lectures were clearly organized and presented, and Professor Murillo was great fun to be around. She really really knows her stuff, and so every lecture was a scramble to write down as much as we possibly could while she zoomed off talking about neoliberal reforms in seven different Latin American countries at once. Every now and then we'd put on a film, all of which were interesting and entertaining. \nThe real star of the class however was the TA Giancarlo, who was really loved by everyone as far as I could tell. He ran a mandatory section once a week which really clarified all of the material. The sections were like classes in themselves, and were straightforward, clear, and really prepared us all for the tests. \nThe work load was manageable. We had something in the region of 50-100 pages of reading a week of generally very dense political science literature - it was amongst the densest I have done for any class, but it was all mostly interesting. There was one 2-page and very straightforward essay, and a midterm and a final, which were also straightforward.\nPay attention to the lectures, and do as many readings as you can. The way to ace this class is just to follow instructions. If you follow the instructions properly for the 2-page paper, you will recieve full marks. If you pay attention in section, you will be able to work out pretty much exactly what will be on the midterm and final, and will be able to prepare accordingly. \nIf you're into comparative politics and/or latin america, and you don't mind the occasional incomprehensibly dense statistical analysis of Argentinian union politics in September of 1953, then you'll be sure to enjoy this class. \nWorkload:\nNot too bad. \nOne very short and easy paper - just follow the instructions and you will get full marks. \nOne midterm with predictable questions based on what Giancarlo focuses on in section\nOne final with similarly predictable questions based on what you do in section. \nI worked moderately hard and got about a 98 which ended up being an A. My study-buddy got a 100 and an A+ for a similar amount of work. Work out what will be on the tests before you take them, and you will get full marks. \n"
        }
    ]
}