{
    "prof_info": [
        {
            "prof_name": "Zayd Dohrn",
            "prof_id": 2852,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 16, 2009",
            "review_content": "\nZayd was hands down the best teacher I've had at Columbia. He is smart but never arrogant. He encourages student participation but is not afraid to say so if he disagrees with your opinion. He is witty and funny but never seems like he's pulling one-liners out of a bag of jokes he's used over and over (think of some of your lecturers who think they're stand-up comedians instead of teachers). \nFurthermore, Zayd is a really interesting person outside of class. He is a playwright (and was recently featured in NYT arts section) and a generally warm, nice guy.\nTAKE THIS GUY'S CLASS! You will definitely not regret it.\nWorkload:\nNot too bad. Standard Lit-Hum assignments. Over the course of the year, I got a better Idea of how he graded and what he was looking for, which helped. Talk to him during his office hours. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 18, 2009",
            "review_content": "\nIf you can take Lit Hum with Zayd DO IT! He is a funny, young, intelligent, and engaging professor which is semi-hard to come by for Lit Hum. Despite being a grad student he is extremely knowledgeable about a large variety of topics specifically in the realms of drama. Also interesting is that his parents were part of the infamous Weatherman group at Columbia University: Bill Ayers. He also invites you to his plays too. Overall great teacher.\nWorkload:\n1st semester: 3 3 page papers, 1 page lit analysis, mid term and final. 2nd semester: 2 6 page papers mid term and final\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 15, 2006",
            "review_content": "\nZayd's was my very first class at Columbia...if only all my 9am classes were this engaging! While the essays the department requires are less than enthralling, Zayd made the time spent in class worthwhile. Discussing the articles became more than just an exercise for improving our writing--we had genuinely dynamic discussions and really got to know one another in the class. I do regret not getting to know Zayd early on in the course however...he has an amazingly unique background, and he's definately an instructor to keep in touch with.\nWorkload:\nActually a lot less than most UW classes I've heard of...little in class writing, and if there is any I don't recall it being collected.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 12, 2006",
            "review_content": "\nZayd is a young and exuberant professor. He offers a laid back hands on learning approach, and encourages participation from all his students. While he is a stickler for grading, and often pushes for drastic revising, he is a fair and understanding guy. Do take the time to speak with him individually and seek extra guidance for your papers, it will make a big difference come grade time. Also try and take the time to get to know Zayd, he happens to be an aspiring broadway playwrite, with several works under his belt, and an individual strongly dedicated to acadamia. Overall an excellant first year instructor, and good guy. \nWorkload:\nStandard for University writing, 4 essays, and minor writing responses to articles. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 09, 2006",
            "review_content": "\nTeachers like Zayd are the reason you go to Columbia.  His enthusiasm, intellect, and ability to drive discussion made University Writing the most intersting class during my first semester at college.  Zayd offers very helpful advice during workshopping sessions and is dedicated to improving your writing.  Put forth the effort for this class and you will get a lot out of it, but not only benefits to your writing.  Make sure you go to any of his plays if he has any being produced while you're taking his class.  The one I saw was about the Haymarket Square Riot in Chicago with a touch of Zayd's past thrown into the mix.  He is probably one of the most interesting people you will meet at Columbia, so get to know him.  While most people will bitch and moan about U writing consider yourself very lucky if you get Zayd.\nWorkload:\nUsual UW work- 4 progressions.\n"
        }
    ]
}