{
    "prof_info": [
        {
            "prof_name": "Antonius Dieker",
            "prof_id": 13329,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Probability for Engineers",
            "review_date": "December 30, 2016",
            "review_content": "\nHave to write this since my good ol' friend Ton doesn't have a review on here yet. Which is surprising, because everyone has something to say about him. \nTL;DR - in ~4 years of undergrad, this was the worst experience I've had with a professor.\nTD thinks he is so much better than he is. I think we heard about him meeting President Obama like 3 times during the semester. Also, he tried to introduce a video lecture-twist to the class which (mostly) everyone hated. Nobody showed up to class after that. But, coincidentally, he ran out of videos and was too lazy to keep making them. So we went back to normal lecture.\nLectures are okay- but listening to a man slouched over a god damn Microsoft Surface is painful at times. He fosters an overly intense environment in the classroom, especially during his exams (which are absurd). \"Nobody has every gotten a 100 on my exams\" he says (somebody did get a 100 on the second midterm). But during exams, he made students take off their hats, and went around and literally checked every pencil + eraser + water bottle he could find. I also heard a story about a girl who went to the first midterm sick, and as soon as he passed the exam out she passed out and had to be hospitalized (5 minutes after pencils hit the exam). TD gave her a 0 on the exam because she made the \"conscious decision\" to sit-in on the exam. Well, she did that because TD literally states in the first class that basically nothing will prevent you from taking his exams unless you or some family member dies. That day. Lighten up dude.\nP.S. Make sure you go to the classes after the class where he says \"the material for the final ends here\" because SURPRISE!!!! it doesn't end there. Yup. In a \"Probability for Engineers\" course, we were taught the invigorating concepts surrounding ASSET PRICING (what is this class called again? I realize it's in IEOR, but who the fuck cares about pricing assets, especially when it's taught after he tells US THAT EVERYTHING IN HIS ALREADY STALE COURSE PRIOR TO THAT CLASS WAS THE FINAL MATERIAL). \nWorkload:\nHa. The workload // problem sets in general suck. But, I'd suggest going to MIT OpenCourseWare and going here to the probability class that is taught by the professor that wrote TD's choice of course textbook: https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-041-probabilistic-systems-analysis-and-applied-probability-fall-2010/\nTD will try & tell you that all of his material is original, but it surely isn't. Bud, if you're reading this, Columbia SEAs is not MIT. Get a grip :D\n"
        },
        {
            "course_name": "Probability for Engineers",
            "review_date": "December 30, 2016",
            "review_content": "\nHave to write this since my good ol' friend Ton doesn't have a review on here yet. Which is surprising, because everyone has something to say about him. \nTL;DR - in ~4 years of undergrad, this was the worst experience I've had with a professor.\nTD thinks he is so much better than he is. I think we heard about him meeting President Obama like 3 times during the semester. Also, he tried to introduce a video lecture-twist to the class which (mostly) everyone hated. Nobody showed up to class after that. But, coincidentally, he ran out of videos and was too lazy to keep making them. So we went back to normal lecture.\nLectures are okay- but listening to a man slouched over a god damn Microsoft Surface is painful at times, especially when he is so full of himself (also just hate his condescending language and smirk). He fosters an overly intense environment in the classroom, especially during his exams (which are absurd). \"Nobody has every gotten a 100 on my exams\" he says (somebody did get a 100 on the second midterm, I hope TD went home and cried that day). But during exams, he made students take off their hats, and went around and literally checked every pencil + eraser + water bottle he could find. I think he has an array of trust issues). I also heard a story about a girl who went to the first midterm sick, and as soon as he passed the exam out she passed out and had to be hospitalized (5 minutes after pencils hit the exam). TD gave her a 0 on the exam because she made the \"conscious decision\" to sit-in on the exam. Well, she did that because TD literally states in the first class that basically nothing will prevent you from taking his exams unless you or some family member dies. That day. Lighten up dude. Have a heart. Understand that we are forced to take this class. Nobody cares (after the first time you tell us) that you met President Obama. \nP.S. Make sure you go to the classes after the class where he says \"the material for the final ends here\" because SURPRISE!!!! it doesn't end there. Yup. In a \"Probability for Engineers\" course, we were taught the invigorating concepts surrounding ASSET PRICING (what is this class called again? I realize it's in IEOR, but who the fuck cares about pricing assets, especially when it's taught after he tells US THAT EVERYTHING IN HIS ALREADY STALE COURSE PRIOR TO THAT CLASS WAS THE FINAL MATERIAL). \nWorkload:\nHa. The workload // problem sets in general suck. But, I'd suggest going to MIT OpenCourseWare and going here to the probability class that is taught by the professor that wrote TD's choice of course textbook: https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-041-probabilistic-systems-analysis-and-applied-probability-fall-2010/\nTD will try & tell you that all of his material is original, but it surely isn't. Bud, if you're reading this, Columbia SEAs is not MIT. Get a grip :D\n"
        },
        {
            "course_name": "Probability for Engineers",
            "review_date": "December 22, 2016",
            "review_content": "\nThis class is not easy. There is a LOT of material. In lecture, Professor Dieker goes through a number of concepts usually covering definitions and equations relevant to the material. There's usually a nice two minute break somewhere in lecture as well. However, when it comes time to do your homework you're going to wish you had more examples in your notes. The weekly homework assignments are usually around 10 problems in length. They're usually pretty difficult and are much more challenging than the material presented in class. Expect to spend a good amount of time on each assignment. \nThe two midterms are difficult. However, if you begin studying a decent amount of time in advance you'll be fine. Part of what makes the exams (and particularly the final) difficult is the sheer amount of memorization you're going to be required to do. Also be prepared to handle double integrals. Calculus is very much a pre-req for this class and you're going to be doing a lot of integrating. Brushing up on your series and sequences is also not a bad idea. \nIf you take this class, be prepared. It is challenging. \nWorkload:\nWeekly homework assignments (difficult). 2 midterms. 1 final. \n"
        }
    ]
}