{
    "prof_info": [
        {
            "prof_name": "Kimuli Kasara",
            "prof_id": 3144,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 02, 2016",
            "review_content": "\nDo not take this class.\nKasara is one of the worst professors I have had at this University. Her lecture slides are more helpful than actually listening to her, but unfortunately she posts them to courseworks weeks after the material has been introduced, sometimes mere days before an exam. She is disorganized, and you can tell she relies on her TA's to do most of her teaching for her. The lectures are too hard to follow, and her slides are chock full of the tiniest, faintest text. She is an extremely knowledgeable woman but she is simply not a good professor. And then she has the nerve to get offended when we don't show up to class. I'm upset I bought books for this class, it wasn't worth the money. Most things get summarized on the slides anyway. You can learn a lot from them, but there's no indication of which material will appear on the exam. There is just so much information to sift through that you won't even be tested on it's ridiculous. Also, like 2/3 TA's were unusually hard graders, so they were a really fun addition to an overall shitty class.\n\nWorkload:\nTOO MUCH WORK. She assigns a ton of reading, weekly discussion sections which are boring, and on top of it there are three exams and a paper. The exams themselves are awful, and most students are still in the room when she calls time. I think 5 essays in a 75 minute class plus ID's is a bit too much to ask, especially given the range of information we are expected to know. I feel as though the grades we get on our tests aren't truly representative of what we know because we rush so much it's easy to make mistakes or leave things out. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "March 10, 2015",
            "review_content": "\nKasara is definitely not the most clear of lecturers and she goes incredibly quickly through her slides which are often packed with text - I would sometimes just give up trying to copy things down because there was no way I would get it all. She mumbles and often seems a bit disengaged with the people in the room while she lectures, so if you can't handle that than this isn't the course for you.While she clearly knows what she is talking about she isn't great at communicating it. \nThat being said, I learned a ton in this course and overall I really enjoyed it. She has dense lectures and she often expects you to know about the situation or event that she is lecturing on, but if you have done the readings you will have a pretty good understanding and should be prepared. The reading is pretty textbook and dense, but it definitely helps you understand the course - you can often skim to find the key points and she will fill in the details in class. I thought that my TA held great discussion sections and was incredibly helpful - he went over anything we didn't understand and made sure to cover all of the tough topics in an engaging way. The TA's also hold review sessions before all of the exams which are really helpful. The exams required quite a bit of studying but if you have good notes and can determine the key concepts you should be fine (she also uploads all of her powerpoints online so you can review from there before exams). \nWorkload:\nWeekly reading of 2-3 long chapters and  a 20 page case study on a particular nation or an outside article, kind of dense but can easily skim for main points. \nThree exams throughout the semester, no real final. If you review her powerpoints they aren't that bad. Each had 5 IDs and a few short answer Qs and two of the exams had an extra credit short answer as well.  \nOne paper at the end of the course due during finals week, you have freedom to choose you topic so not too hard - TAs were very helpful and willing to discuss topics and ideas. \n\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 07, 2014",
            "review_content": "\nI really would not recommend taking this class.  Kasara assumes everyone knows everything about all of these political regimes, which is pretty unlikely considering its an intro class.  The reading was dry and annoying and way too long, and the weekly discussion sections did more hindrance than help.  Kasara often mumbled during lectures and did not explain the concepts clearly.  I assume you could do okay if you did all the readings, but considering they are so long it just doesn't seem worth it.\nWorkload:\nExcessive.  So much reading for the weekly discussion sections, three exams, an in class midterm, and an essay.\n"
        },
        {
            "course_name": "Contemporary African Politics",
            "review_date": "April 05, 2010",
            "review_content": "\nAlthough Prof. Kasara is not a natural lecturer, I learned more in her class than I have in any other class at columbia.  The course was incredibly challenging, but the readings and lectures were always interesting.  Although at times throughout the course I felt very confused and overwhelmed, by the end of the semester I realized that I had begun to truly understand some of the most difficult and challenging political issues plaguing Africa.  Prof. Kasara challenges you to think about complex and difficult issues.  If you work your butt off you will get a lot out of the class.    \nWorkload:\nTONS OF WORK \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 17, 2010",
            "review_content": "\nKasara means well, and it was her first time teaching, but that doesn't all the things wrong with this class.  There was a really large amount of dense reading, especially for an intro course, and she tried to cram tons of different topics into one semester.  She was also very disorganized, emailing the class about changes to the reading so often that it almost was more to figure out what to read than the reading itself.  The two 3-page papers unfortunately required large amounts of work because of how much extra research was necessary, and the topics were so broad (i.e. \"To what extent is Turkey a democracy?\") that it is nearly impossible to appropriately answer the question in the space allotted.  Because there was always something you didn't manage to include, points were inevitably lost and the 39 or 40/40 needed for an A was rarely attainable.  The grading system was a wreck, with Kasara applying various curves throughout the semester, and no one really ever knew where they stood.  Though the lectures were terrible, boring, and worthless, the topics were often interesting and the discussion sections (with much more interesting and involved TAs) were usually great.  The midterm and final were totally based on the readings, and were impossible to finish on time; the final had literally double the ID's, short answers, and essays than the final of another 3000-level poli sci course I took. \nWorkload:\n2 3-page papers that require way more work and time than they should, especially since they're only worth 15% each\nmidterm and cumulative final that were straightforward if you did and understood all the reading, but far too long\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 13, 2010",
            "review_content": "\nLECTURES:\nProfessor Kasara isn't a natural lecturer.  She stumbles and repeats herself and is generally somewhat confusing. However, she does cover interesting topics and tries to tie in theory with her own experience.  She posted powerpoint slides online, but they were only a skeleton of the lecture itself, don't rely on reading them and skipping class.  \nREADING:\nA ton.  I ended up with a two inch+ stack of double sided printouts. Most of it is pretty interesting, but it's hard to keep everything sorted in your head after a while.\nPAPERS:\nTwo short 3-4 pagers, which you have to cram a lot of material into.  It was hard to cover everything expected in that space.  You have to do some independent research, but don't sweat it.  TA's grade them and I thought the assignments were relatively easy although others disagreed.\nEXAMS:\nMidterm and Final were my big complaints.  The exams were long enough that it was hard to even finish in the time given, much less put serious thought into answers.  It was stated that the exams were to ensure you read and understood the readings and arguments, except there was so many often similar readings that it was impossible to really demonstrate your knowledge.  I studied a lot for both, and did worse than I thought I would.  There's just too much to keep straight in your head and regurgitate on paper in such a short time.\nGRADING:\nI though the grading criteria was strange.  Before the final she explained that 35% of the class would be getting As, 55% Bs, and the rest Cs.  This might be standard procedure for large classes, but it makes no sense to me.  Judging by the previous distributions (Prof. posted them after midterm and essays), this artificially raised the % of As.  How can you decide that 35% of the class will do well before the final is even taken?\nWorkload:\n2 short essays, hefty midterm and final.  Tons of readings.  mandatory weekly discussion, although you can miss a few.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 10, 2010",
            "review_content": "\nThis class was unnecessarily complicated for an introductory course. While the material is interesting, the manner in which Professor Kasara presents it makes it difficult. The midterm and final were a mix of IDs, short answers and essays --- basically for these you just needed to have a good grasp on all the readings and review the main concepts on the powerpoints she posts online. The papers were the most difficult part of the class. She asks you to answer 5-6 questions in 3 pages and each person has to do a different country. There is definitely extra research required. She tries hard but she lecturing does not come naturally to her and eventually many people just stopped going to class. I would recommend staying away from this course -- the work you put in probably wont be reflected in the grade you get and there are much easier ways to fulfill the requirement.\nWorkload:\ntons of weekly readings for discussions section. 2 papers - 15% each. midterm 25% and final 35%. \n"
        },
        {
            "course_name": "20th and 21st Century African American Artists",
            "review_date": "January 01, 2010",
            "review_content": "\nShe is simply a HORRIBLE lecturer.  Horrible-- the worst I've ever had (by FAR).  She closes her eyes the entire time that she speaks which is weird enough, but she also tends to stutter or have nervous speech habits that make it really horribly annoying and painful to listen to her.  It takes her years to finally spit out what she wants to say, but then when she finally gets going she speaks a thousand words a second and there is absolutely no way to take everything down.  She has no idea how to use powerpoint effectively-- some of her slides are literally covered in size 9 text and others have a completely unexplained photo on them.  She posts her lectures but unless you go and fruitlessly try to record what she says they're of little use.  It's REALLY annoying having to take notes to her speak because first she can't form a single word for 5 min and then suddenly a hundred come out and you have no idea what to write down.  She also really uselessly tries to get the class to participate and seems to be personally offended when nobody's done the readings yet or doesn't feel like raising your hand... \nThat being said the class isn't terribly hard and if you do the readings and go to your section, like somebody else said it's an easy A-.  The exams are REALLY long-- the midterm was so long that most people didn't finish and the final was only shorter because we all complained, but even then, it was something like 10 IDs, 2 short answers (which are actually quite long, 3 paragraphs each), then 2 more full essays.  Kind of painful.  \nHowever I would STRONGLY discourage anybody from taking this course.  It is too painful for an intro class and there are way better professors teaching it anyway.  \nWorkload:\nheavy reading every week, 2 short papers (max three pages), LONG midterm and LONG final\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 31, 2009",
            "review_content": "\nAn introductory course with complex readings and average lectures. Kasara makes clear powerpoints, but the readings are often dense and don't seem entirely appropriate for a 1500-level course. The information, however, is interesting and thought-provoking, and if you both attend section with any of the excellent TAs and work to complete all of the reading/teach yourself, you stand to gain a lot from this class. Not difficult to get a good grade, but note that Kasara will curve exams and papers in order to limit the number of students who get As in her class - a B is relatively easy to get, but an A will be somewhat difficult. \nWorkload:\nmidterm, final, two short papers -- the exams are very comprehensive but graded a little easier than either of the papers (on which you generally have to get perfect or just about perfect, i.e. 40/40 points or 39/40 points to get an A)\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 30, 2009",
            "review_content": "\nThis class was by far the worst I've taken in two years at Columbia and three at various other institutions. I'll just tick off the list of things that were clearly wrong, in my opinion, and we'll see what kind of a picture develops. First, she was barely ever on time for class, and also cancelled several classes without much (if any) warning. Second, she lectures off powerpoint slides, as mentioned below. What isn't mentioned below is that 75% of the slides are filled with random graphs of internet-downloadable data that you will not need to know. The other 25% will be densely packed with necessary terms and concepts, but since they are interspersed with the 75% useless filler slides, it's often hard to know which are which, and Professor Kasara offers no hints. Third, she speaks quietly and nervously, which I wouldn't mind except it seems to actually distract her and keep her analysis of the concepts both shallow and erratic. Fourth, to fill space and time, she often puts the most mundane questions to the class for discussion, and lets an awkward silence hang over the room until one or two of the same students answer. Often those two will have decided that sleeping was more valuable and therefore Professor Kasara will have to answer the question herself. Fifth, she did not follow the pace of the syllabus from which she expects you to have figured out what readings will be discussed in class. Often lectures would be two weeks ahead of the syllabus, while at other times we were a week behind. To fix this problem, readings were dropped left and right, and for the first time in my college experience a new, significantly altered syllabus was distributed towards the end of class. Now, all this may make you shrug and some decide to just take her class and learn from a good T.A. The following problems relate to that approach, which I and most of the rest of the class took.\nSixth, grading was incredibly arbitrary. The tests were too compact for the time given, leading to a generous curve which was never announced until long after the midterm was over. The reason was that more people ended up with a C and below and very few got A's. This same curve was then taken and used for the final, which was much easier due to the extended time period and ended up being a net loss for students. As a result of those two curves, I pretty much know the grade distribution of the class, and while it's a little harsh and b range heavy, the larger point is that it made up as the class went along based on an ever-changing and flawed set of procedures, a major mistake for a so-called political scientist to be making.. This leads to my seventh point: the T.A.'s complained as much as the students about not knowing what the rules were. If T.A.'s are known to be a bit arbitrary in their grading at times, try giving them carte blanche, or for a better metaphor, a loaded machine gun with no practice. They were left in a difficult position by the lack of any clear rules, and each reacted in their own way, which is natural. Some became more strict, others less so. Professor Kasara showed no signs of awareness of this or any other \"facts\" of college lecturing. There is much more to criticize here. She appears to have borrowed another professor's syllabus. That professor teaches here, and is supposed to be much better. It's a tease having his name scrawled across the front page of most readings. Those readings are quite interesting, but all very technical, even for political science. So expect to labor over them for hours upon hours each week if you hope to get anything out of this class. The last point I'll make is that even if the information did get through to you, as it did to me, through doing the painstaking readings of painstaking studies of different constitutions, electoral systems, etc., there was never any evidence that Professor Kasara was grading or influencing the grading of the papers, which is an unsettling though in a relatively steeply curved, lord-of-the-flies style class where even the T.A.'s have clearly lost all signs of hope. I would highly recommend the department disallow professor Kasara from teaching lectures on any fundamental topics until she has about fifteen years more experience.\n\nWorkload:\nMidterm, Final, two three-page papers. Lots of technical reading. Standard fare, but there are no clear signals as to how deeply you must understand it all. Kind of like the grey market economy.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 26, 2009",
            "review_content": "\nProf. Kasara was simply terrible. The problem  was that she didn't seem to know where to take the class. Although we understand that it was her first time teaching this class, throughout the entire semester there was no progress and the class just kept getting more and more boring.  The format of the class was basically staring at a power point presentation for 90 min (most of the times even less since she usually ran out of material), analyzing graphs and data from 1997, and fighting an uncontrollable need to sleep. The content of the class was fine, for some of us the TA's really made a difference since lectures were useless.\n\nWorkload:\nLots of reading between 80-120 pgs a week. Two 3-page papers (seems easy, but the problem is that they expect you to include and fit 300 pages worth of information plus your argument). Midterm  and final, both with an ID's portion, short answer and essay(s). Proportionally to the time available for both the midterm and final, they were extremely long and almost impossible to finish on time. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 13, 2009",
            "review_content": "\nThis class is an easy A-. You don't have to go to any of the lectures. Just do the reading,  go to sections, study for a couple hours and you should do well. I would actually suggest not going to lecture. She shows about 10 slides a class and rambles about most of them. She also this annoying tick that she won't look at students. I didn't this until a couple of weeks into the class, but she literally will not open her eyes to look at students. She lectures with her eyes closed. One day I went up to ask her a question, and she answered my question with her eyes closed! It is one of the weirdest things I've ever seen from a teacher. \nIf you are a go-getter, this class is not for you. This is not much to be learned in this class, and if you do want to learn, you won't be learning from Kimuli's lectures. If you are an athlete and like easy grades for a small amount of work, this is a class made for you. \nWorkload:\nTwo 3-page papers (pretty straight forward). One mid-term one final. Both of which can be crammed for. But, I would suggest doing the readings, they are will you will learn anything, if you learn anything in this class. \n"
        },
        {
            "course_name": "Contemporary African Politics",
            "review_date": "January 15, 2008",
            "review_content": "\nThis class was not easy, but it was not impossible either. Kimuli is really fair. If you do the work honestly and try to give her what she wants you should do well. Its kind of hard to figure out what she wants on the response papers, so go talk to her about it before you hand yours in. Also, form a group in class to study together, it will be really helpful for the midterm and final.\nWorkload:\nTons of reading, but it is interesting. You should def divide among classmates. We had a summary system and it worked well but you have to know your shit, so at least skim through the reading and have something intelligent to say for each class.2 Responses, an in class midterm and a 24hr  take home final which you will lose sleep on.  \n"
        },
        {
            "course_name": "Contemporary African Politics",
            "review_date": "March 28, 2007",
            "review_content": "\nLook, here's all that matters: Go to the first class, ask her if the final is going to be the same as last year, and if she says yes, get up and leave.  Don't wait til class is over.  Just leave.  Now, I know what you're thinking ... How can one day ruin an entire class? ... but you have no freaking clue how horrible this was.  This was the absolute worst idea I have ever heard of.  It was as if she said to herself, \"What's the worst possible assignment I can think of?  Oh, I know, how about three 3-pg essays where the students have to reference a dozen readings in 24 hours right in the middle of finals week.\"  Are you kidding me?  Does anyone think this is a good idea? \nNow, if this were a great class to begin with, which it wasn't (but I'll get to that), then maybe I could stomach a standard 8-10pg paper or something in 24 hours.  It would be painful but I could do it, and the entire class wouldn't be ruined.  But this thing was pure Charles Manson Brand (TM) insanity.  You want me to do what? Go through about 10,000 pages of reading to write three 3-page papers?  3 pages on how colonial legacies affected ALL OF AFRICA?  How does that possibly make sense to anyone?\nOk, now that I'm done ranting about the final (I would keep going, because it was so dumb that it's been 3 months and I am STILL legitimately pissed off when someone mentions this class), I can talk about the class, which presumably is what you care about because you did what I said at the beginning and the worst final ever is no longer in play (if this is the case, and you get a REAL final or something ... I hate you all, you lucky bastards).\nIf you don't already know a lot about African history and politics - which is insane because Africa is huge and has like 50 different countries with different histories - you probably will spend the entire time trying to figure out what the hell is going on because you have no idea who any of the people she is talking about are.  Oh, by the way, she provides you with no historical background.  At all.  To make matters worse, she doesn't choose to talk about certain countries, so your welath of knowledge had better be pretty damned good, because she seriously tried to impart more information than an encylopedia has, and did a pretty poor job of distilling it.\nOk, so after reading this, you probably think I hated this class, or got a bad grade, or hate the professor.  No, no, and no.  The actual stuff we learn is super freaking interesting.  It's just super freaking weird.  You will not learn events.  \"This is political science, not history!\" I was always reminded.  (Which, by the way, is complete crap; take Shannon O'Neil's Latin American Politics class for proof.)  You will learn theories about things either unbelieavably narrow (the social interactions of a few tribes in Eastern Uganda, for example) or unbelievably broad (AIDS).  This basically is another way of saying you will learn a butt load, and learn nothing, all at the same time.\nAs for the professor herself, she is an enigma.  She seemed totally FREAKED OUT about teaching. She closed her eyes every time she answered a question, which to me seemed really creepy.  I don't quite know how to explain it.  It was just creepy.  Her lecture style is mediocre at best.  It was organized, which was good, but powerpoint (read: boring) which was not so good.\nAfter all of this, here comes the kicker: it was essentially a grad class.  About half of the students were grad students, and there was no separation between undergrads and grads in terms of grading.  That's fair.  Riiiiiiiiggghhhttt.\nWorkload:\nA lot of reading, not so much that you want to kill yourself, but a lot.  In terms of assignments: it may seem like next to nothing - other than the worst final ever (as discussed previously) of course - but don't be fooled.  Fine, there is no midterm.  Instead, you have to write two 3-pg papers responding to AT LEAST 4 articles, one before spring break, one after.  This may sound nice, but it is almost as stupid as the final.  It actually is the same format as the final, which is only slightly less dumb than giving us only 24 hours to finish it.  How in the hell are you supposed to respond to roughly 100 pages comprising 4 different arguments in 3 pages?  It would take less than that to properly explain the arguments! Again, stupid.  Just like the final.\n"
        },
        {
            "course_name": "Contemporary American Literature",
            "review_date": "January 09, 2007",
            "review_content": "\nThis was Professor Kasara's first semester at Columbia and first time\nteaching a lecture class ever.  I think the anxiety and nerves clearly\nshowed as a result.  She was well prepared for lectures and had\nprintouts of the lecture slides (ugh powerpoints) for each class.  At\nthe beginning of the semester she did little but read the slides\nverbatim (with her eyes closed- nerves?, so she had them memorized I\nguess) but as time went on she was a bit better on her feet (but still\nkept her eyes closed...).  I think she can only get better.\n\nWorkload:\nThe workload was weird- typical amount of poli sci reading each week\nbut with a \"suggested reading\" section that was enormous for each\nclass.  It sucked because the final exam (worth 50% of your grade\nclearly wanted you to reference the suggested readings, but they had\nnever been required so...).  I'll back up- the grade break down: 15%\nparticipation in weekly discussion sections, 5% map quiz, 15%x 2=30%\nresponse papers (weak guidelines but harsh grading), and a 50% final\nexam give over 24 HOURS DURING THE WEEKEND BEFORE FINALS.  what a BAD\nidea. not only was it impossible questions like \"whats the future of\nafrica etc\" but 3 of them, 1000 words each in 24 hours.  I might not\nrecommend the class solely because of the brutal final- but hopefully\nshe'll rethink it before doing it again.\n\n"
        }
    ]
}