{
    "prof_info": [
        {
            "prof_name": "Mark Zurack",
            "prof_id": 4767,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Capital Markets & Investments",
            "review_date": "December 19, 2011",
            "review_content": "\nThis course is offered by the Business School and I was able to cross-register since there were some empty seats. In order to do so, you must be a senior, with some financial background (either through courseworks or internships), there must be some seats left in one of the many sections that are offered... The BSchool seems to avoid undergrads but it's possible to get into the course if the instructor vouches for you - Mark did it and I am really glad.\nCapital Markets is supposed to be the core course in finance for MBA students interested in taking upper-level electives, in both corporate and market finance. The point of the class is building a common foundation in the most important aspects of capital markets for all students. From an academic point of view, the class is not extremely hard, especially if you have already taking financial economics. The more quantitative/theoretical aspects are left out, so it's a great way to complement some of the theory seen in other econ courses. You will be dealing with very practical assignments, such as actually designing portfolios, option strategies, etc. Zurack is overall a good instructor, extremely available and open to any questions. He also organizes several conferences during the semesters with some pretty big names in finance, and if you're lucky you will be able to have lunch with some really well-known bankers. I definitely recommend this class to seniors who know they are heading in to finance. It is _not_ a corporate finance course, and it actually deals substantially with issues such as asset management and derivatives, but the point is that it provides you with an overall financial literacy. \nThe only problem with the course is that it's an MBA class. Students are older, have actual experience and another perspective on the subject. It's hard to get to know them, and class participation can be very awkward when everybody has work experience in finance - except for you. This was a bit painful sometimes, so if there is a section offered at SIPA (there was one this semester but I couldn't get in), I would recommend that over the standard bschool ones. \nWorkload:\nOne take-home midterm, seven medium-long group assignments that were sometimes obscure (i.e. not just easy applications of the concepts seen in class), one final project and presentation. Zurack also takes participation and attendance very seriously. \n"
        }
    ]
}