{
    "prof_info": [
        {
            "prof_name": "Christine Varnado",
            "prof_id": 3230,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 30, 2010",
            "review_content": "\n\nI'm not going to say that Christine Varnado is incompetent, but she is new to teaching an integral part of the Core, and it completely shows. Basically, as a teacher, she neither adequately knows the course material nor does she focus on the text. She depends on the students' response papers (that they do the night before on Courseworks). Sometimes it seems as if she does not do the reading herself, despite the fact that she overloaded her syllabus with optional readings. \nIn terms of conducting class, she has a tendency to ramble on and often use words that it seems like she does not know the meaning of. This misuse of language is also apparent in her badly written syllabus. She does not speak like an educated person, sometimes swearing for (bad) emphasis. For an English major, her rhetoric is not very effective. \nSome days, she does not talk at all and relies too heavily on one or two students to propel the class. Other days, she speaks over students and ignores their questions. There is constant reference to the text, but she does not have a particular focus on close reading. Her lesson plans for discussion range from good to very bad. Her opinions and observations on the text do no better than mediocre. \nHer enthusiasm is young (she's a graduate student in the English department), but her ways of thinking are extremely simple or outdated, often sounding like, \"What struck you as odd about the text? How did that make you feel?\" It's hard to believe that she is teaching at Columbia, where the students come from extremely diverse backgrounds. I am not saying that every student holds him- or herself to a higher standard of learning, but this professor provides no challenge.\nOn the bright side, it is easy enough to get an A if you consider yourself at least marginally active in reading the texts because she grades papers like a middle school teacher. Comments on the papers were a little lacking even though she is happy to offer you feedback on your paper topic (you choose your own). All her comments consist of questions, and all in all, after reading them, you don't feel that differently about your grade. \nShe also needs to improve her class plan because she changed the class syllabus a lot. That's probably something that she's going to learn as she teaches over time, though. \n\n\nWorkload:\nGrading is easy enough: 4 response papers, 2 papers (6-8 pages), midterm, final.\n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2007",
            "review_content": "\n\nif you find yourself in Christine's U.W. class this semester, consider yourself lucky. sure, she's a little kooky and on first glance, you may think she's a bit of a valley girl. but trust me, she knows her stuff. she manages to make the assignments more interesting than the other professors do, and although u.w. is unbearable in general, she makes it an entertaining experience at the least. there is a lot of reading and a lot of progressions, but my advice is not to skimp on the drafts. you'll do well in christine's class if you take all her advice, and you won't be able to get all of her advice if you have an incomplete or half-assed draft. \n\n\nWorkload:\ngeneral u.w. workload - hers is more bearable than any other professor's \n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 03, 2007",
            "review_content": "\n\nAn excellent instructor-- her grading is fair,  and her excitement for learning is infectious. Able to see the mechanics of a successful or poor essay, she is incisive about the writing process; nevertheless, she isn't picky. Writing is a process in this class: sometimes she will give back A papers that are covered with suggestions for improvement.\nHer homeworks are not very structured, and my class found this to be beneficial\n\n\nWorkload:\nThe usual\n\n"
        }
    ]
}