{
    "prof_info": [
        {
            "prof_name": "Eliza Johnson Ablovatski",
            "prof_id": 1579,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 04, 2003",
            "review_content": "\nAvoid her at any cost. Insecure, self-centered, arrogant, disorganized and petty. BORING. DIFFICULT. a diaster grad student with an evil streak.\nWorkload:\nresponse paper every week plus exams. Way too much\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 23, 2003",
            "review_content": "\nBefore starting CC, everyone told me I would love this class. Now, I'm dying for the semester to end. During the fall, I worked for CC and tried to do ALL of the excess reading she assigned. Yet by the end of the semester I realized that I wasn't getting anything out of the class. Eliza fails to lead class discussions and while I feel that she does know what she's talking about, she expects WAY too much out of us (exams, papers) considering that she doesn't explain the books that we read. \nNonetheless, the thing that bothered me most about this class was the fact that the majority of our classes started with a 1/2 hour of 'administrative' bullshit. She would tell us what CC movie was playing that week; we would discuss whether or not we wanted to have a discussion board; we would debate over what we wanted to use our CC money for....ah!  This drove everyone in the class crazy and by the end of the year, I feel as though we're all ready for it to be over, and have bonded together in this horrible experience.\nI will say, however, that she does care about the class. The only question I have is: what history classes does she teach?\nWorkload:\n15 response papers. Her midterm and final are ok, but her fall final was ridiculous (ie: explain the historical context of the books we read). I also don't think that anyone in the class really knows what she wants from our papers.\n"
        }
    ]
}