{
    "prof_info": [
        {
            "prof_name": "Vrinda Condillac",
            "prof_id": 3512,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 14, 2017",
            "review_content": "\nI didn’t enjoy this class, but other people did. Professor Condillac really likes her own ideas and tends to push them on her students, which really annoyed me. I am going to college to learn how to express my own ideas, not regurgitate my professor’s. Expect to write essays about what she thinks your saying (after barely skimming your paper) rather than what you actually want to write about. The people who enjoyed this class seemed to have ideas that were very similar to hers and were often in awe of her ideas. \nAlso, Professor Condillac tends to silence people by passing over what they say if she doesn’t think it matches with what she is saying. She doesn’t help people she disagrees with or doesn’t understand express their ideas, even though learning to express your ideas is the whole point of college, especially a women’s college. She also doesn’t give many comments on first drafts and takes a long time to give them back. \nOverall, if you don’t mind having to rewrite your essay to fit her ideas after every meeting with her, you will be fine. If you actually want to learn how to express your own ideas and be an independent thinker, maybe consider taking a different class. Either way, you will probably be fine grade wise; it’s more of a decision about how much you want to learn.\nWorkload:\nThree essays — First two are ~5-7 pages and worth 20% and the last one is a ~8-10 page research paper worth 40%\nParticipation and homework is worth 20%\nNightly reading (10-30 pages) and short analysis work that is mostly just for you since you don't get feed back on any of it\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 19, 2016",
            "review_content": "\nShe is simply one of the greatest English teachers I have ever had, and I have had a great English education.  She was always funny and engaging in class.  She made so much time to meet one on one with each student to improve all of our writing.  I honestly felt like she pushed me to the edge of my comfort zone with writing and made me a better person for it.  I can attribute so much of my success in writing to her.  Take any class she offers!!!!\nWorkload:\nExpect to really write!  You cannot bullshit a paper the night before.\n"
        },
        {
            "course_name": "university writing",
            "review_date": "December 09, 2013",
            "review_content": "\nAs the posts below suggest Vrinda is a great teacher except she keeps telling the class that she will finish grading our papers by a certain date and we never get it back on the date she declares. It is very stressful waiting for our grades to be released on a certain day and then it does not happen. It's been like this for every single assignment this semester. I don't know why she does this may be she just should not tell the class her personal goal for when she hopes to finish grading and surprise us when shes done.\n\nWorkload:\nU.W.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2013",
            "review_content": "\nThe other reviews regarding Vrinda are spot-on. She's a great professor: accessible, intelligent and interested. The work she gives out is never just busywork--it clearly all serves a purpose. If you're interested in doing well in the class, there's no reason you can't. She will help you, almost step-by-step, to improve your writing and mold your work into a good, solid paper.\nIf you want to get a good grade on a paper and don't, it's your own fault. She is fully available and very helpful in expressing to you exactly what she is looking for. There are no surprises with her grading.\nWorkload:\nRoughly 300-500 word assignments due nearly every class. Three major papers in the class (plus one minor paper) that compose your final grade. Not a great deal of reading; the emphasis is on the writing--and there is a lot of it (go figure). \n"
        },
        {
            "course_name": "university writing",
            "review_date": "January 16, 2013",
            "review_content": "\nHighly recommend Professor Vrinda Condillac for UW.  She chooses very interesting readings, is flexible in her schedule, is very approachable/reasonable, and makes great effort to give helpful feedback to writing assignments.  Although writing assignments can be tedious, they allow yourself to brainstorm your topics for each essay paper.  It can be time consuming, but the UW writing curriculum of 4 essays per semester requires it be so.  Professor Vrinda offers very creative ideas and helpful advice regarding how to pursue essay topics and methods to research.  She is also very informed on the current issues.  At times, she may be very rigid about your topic if she does not understand what you are trying to write about; however, if you communicate your ideas well to her, she will be extremely resourceful.  Her grading is very fair, at times lenient as long as you are making great efforts.  She requires the topic to be very clear and your arguments to follow consistently with the topics that are relevant.  Choose your topics wisely and ask yourself what you are really writing about, and you will benefit from the rigorous process.  \nWorkload:\nTypical - 4 graded essays, writing assignments designed for the writing process of those essays.  Time consuming, and sometimes stressful if you cannot decide your writing topics, but very necessary.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 20, 2008",
            "review_content": "\nIf you have Vrinda for university writing, you are luckier than most Columbia freshman. The infamous UW class is made tolerable because she holds interesting classroom discussions and allows for a broad spectrum of interpretation of texts. She is polite, professional, yet still down to earth. She is dedicated to teaching and very willing and flexible outside of class. The personal attention she gives to every student is unique and you should take advantage of it. Meeting with her is the best way to improve your writing and papers. It is often frustrating to have to continually tear up your papers through three drafts but her comments are very helpful and if you make her changes, you will succeed. \nWorkload:\nIts uni writing so don' t be too surprised. There are 3 major papers and 1 shorter one at the end of the semester. Participation in class and regular attendance will also help you achieve a better standing with her. The grading is fairly difficult but if you take time and make her suggested changes, it isn't too difficult to do well.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 10, 2008",
            "review_content": "\nVrinda does a great job explaining what possibly can be explained in University Writing.  My aversion to University Writing has far more to do with the course than with her.  She was always able to sustain interesting discussion and chose interesting articles to read and analyze in class.  She is always willing to meet with students, even if it means that she has to sacrifice an hour of her time per meeting for all 12 people in the class.  This personal attention and clarity helped make UWriting relatively bearable.  Her Indian-British accent definitely helped, too, though.\nWorkload:\nthe unescapably horrific Uwriting workload\n"
        }
    ]
}