{
    "prof_info": [
        {
            "prof_name": "Robert Neer",
            "prof_id": 8693,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Global History of the US Military",
            "review_date": "August 15, 2016",
            "review_content": "\nHe brought free coffee to every class. He gave away free books to whoever corrected his syllabus or slides, even if it's something minor like a date or just misspeaking. He took us on a field trip one class then bought us food and drinks afterwards.\nNow that I have your attention, let me tell you about how amazing Bob and his class really is.\nThe course itself deals with various conflicts that the US military was involved in, but it's not a class that delves into the nitty-gritty strategy and tactics of wars. There is some of that, but the class deals with more general ideas and big picture things, as well as non-military aspect of the military (society, culture, politics, etc). This made the class more interesting for me, but not everyone is going to feel that way, I think, and that's fine.\nIt's a summer class, so it's going to be 3 hours long. Beginning of the class, you go over the previous class, if any good questions came up and he couldn't answer it right away. Then a rundown on the reading assigned before, then a break at this point. After that, class discussion on either questions Bob prepared or any questions the students might have had while reading that week's books.\nThe professor is what really makes the class shine, however. He's an easy-going and friendly guy who makes you feel comfortable to talk in class, which is super important as a significant portion of the class relies on discussions among peers. The discussions don't feel very forced, where everyone feels like they have to say something so they can get a grade, but it also doesn't devolve into a free-for-all shouting match. The fact that Bob can maintain that kind of balance in an especially contentious environment (like Columbia can be) and controversial topics (especially as we get to more modern wars) is a testament to his ability to lead the class.\nOne thing I would put against him is his penchant for mentioning how he started his own business and worked in media, and so on. He can come across as a bit pretentious when he does that.\nHe also literally wrote the book on napalm, so feel free to ask him about that.\nFinally, dude looks pretty good, if you're into the salt-and-pepper, have-definitely-worked-in-finance kind of look.\nWorkload:\n~400 pages to read in a week, but his lectures and class summaries of the text can more or less replace any kind of reading.\n2 500-word summaries of an excerpt from a book assigned in class (you get to sign up for the book yourself and you might even have a partner to work with)\n1 2500-3000 word research paper, topic of your own choosing (as long as it's related to the US military)\n6 hours of class per week (it's the summer session, it's kinda the norm)\n1 hour midterm (2 essays), 3 hour final (8 \"identification\" of excerpts on theme, 2 short essays, 1 longer essay)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 01, 2014",
            "review_content": "\nBob is a living legend.\nIf you got him for CC go out right now and dance naked on the steps, cause you just got lucky.\nHe is one of the nicest, most caring, and brilliant people I've met at columbia. He really goes out of his way to help his students, not just with CC stuff, but with anything you ask him. I reached out to him several times for advice on classes / internships and he was always so willing to help.\nClasses:\nClasses are fun most of the time. He opens with a ~20 minute lecture with slides, explaining the context and the main points of the text. I found these to be really helpful in summarizing the main points, so you could participate in the discussion even if you haven't done every reading. \nThere's a 10 minute break, which helps you stay focused.\nHe also does a great job in leading class discussion, he loves different opinions and criticism/support for the text, just make sure you say something meaningful. He's never harsh, but he will kindly ask you to clarify if you say something stupid \nTrips:\nTrips are great, and you get to see some of the stuff we touch upon in class in a different settings, which is awesome. The highlight was when Bob took us to the rare books library, which doesn't sound all that interesting, but is actually awesome.\nThe good thing is that these trips are instead of classes. So it's not like Art Hum where you have to spend hours outside of class.\nGrading:\nSo I would definitely say that Bob is not an easy grader. He's a lawyer (well he's a legend at heart, but a lawyer by profession), he doesn't like bs, and doesn't want you to recite what's in the text. What he's looking for is for you to make a solid argument, base it on the main points of the texts, and give counter arguments. If you do that, and do it fast, you'll be good.\n*BUT: What he really wants from you, is to see you care about the class, and most importantly, participate. I got a B on the first paper, a B on the final, and still got an A in the class. I did well on the midterm and second paper, but it was mostly because I participated a lot and went to office hours / email etc. If you do that, and do fairly well on the tests and paper, you're good.\nFinal words:\nBob is the best, it's an amazing class, thank God (core office?) that you got him.\nWorkload:\nAverage CC workload.\nPosting for each class:\nYou have to post ~250 words on each text, which can be a bit of a pain if you have other stuff. \nMidterm: one hour, open text. \nThe problem is time, in that you have non of it. Bring in bullet points on the main ideas of the text and make your argument\nFinal: Same as midterm, but three hours. \nPapers: First is 1,500 words, the second is 2,500. Don't bs, and don't recite what's in the text. Just make an argument, and support it. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 22, 2013",
            "review_content": "\n I've noticed that several reviews of Robert Neer praise him for caring about his students, and, as evidence, cite the fact that he brings coffee everyday and arranges several field trips and class dinners.  I think it is great that Neer does these things for his students, but as a fellow Core instructor, I just want to point out that he cannot be using Core funding for these excursions.  \nCore instructors are reimbursed up to a maximum of something like $250 a semester for outside events.  As should be clear, that would cover coffee for 25 people for maybe three weeks, and there would be no money left over for trips to the Apollo, lunch catered by Thai Market, etc.  Obviously Neer is funding these perks out of his own pocket.  Again, I think that's swell, but I hope people don't presume that there is a strong connection between these outside events and an instructor caring about his students.  Many caring Core instructors would love to be able to take their students to the Intrepid Museum but simply cannot afford it.  \nWorkload:\nNot relevant \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 09, 2013",
            "review_content": "\nBob is one of the nicest and most approachable professors I have had so far- a genuinely nice guy, he takes the trouble to make CC a fun class. The class atmosphere is very relaxed, he starts with a ten-minute presentation where he breaks down the texts into a couple of slides, and throws in some interesting trivia and history about the philosophers. He's a History PhD, so that's his jam. Bob's CC class is almost 100 percent participation - and if you love to talk and argue, this is the class to be in. \nHe isn't as tough a grader as I thought: if you're regular about posting, participate now and then, and talk to him about your essays before writing them, you'll manage a good grade. Seems tougher on his midterm and final grades but cumulatively, class participation counts for a lot so your overall grade evens out. \nAside from academic stuff, Bob genuinely cares about his students- he took us to Faculty Lunch, brought us food from Thai Market, coffee every class, and organized field trips to Amateur Night at the Apollo and the Intrepid..Now there's good use of the Core Office's funding!  Definitely a CC section worth being in. \n\nWorkload:\nHeavier than some classes, but definitely manageable: bi-weekly online posting and group summaries of the texts. The summaries help a lot for prepping for midterms and finals.\nOne midterm and a final, no IDs and creative essay questions. It's a good way to apply CC to the real world.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 12, 2013",
            "review_content": "\nI completely agree with the previous review. Bob is an amazing professor and I would highly suggest taking CC with him. His class was certainly the best that I have taken at Columbia so far and most likely shall remain so. \nHe makes every class interesting and enjoyable, yes I was lucky that the other students in my section were great, but Bob very much promotes discussion, ideas and fun! If you are interested in the material this is the perfect class for you and will be extremely rewarding.\nEach class has around a ten minute presentation at the beginning and a five minute break for coffee. He also organizes lunches, running OH and will exchange classes for trips - we went to the Intrepid and Amateur Night at the Apollo among others. \nLastly, I agree that he is not a tough grader. He is very fair throughout the semester but nice when it comes to the overall grade. If you show that you are engaged and have put in effort you will do well. \nWorkload:\nAverage\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 23, 2013",
            "review_content": "\nI had Neer in the fall and i have to say his class is one of the best classes I've taken at Columbia. I felt the need to write a review because the other reviews don't give him much credit. \nfirst: Bob is not that tough of a grader... people need to remember that he's a lawyer and thus does not like flowery exhaustive prose like some teachers. on exams and essays get to the point, point out the main ideas, be concise and you'll do well. \nsecond: He's suuuper nice, and his classes are exciting. People need to realize that the students make or break the class. that being said, he puts in a lot of effort to make them fun, but if you have lame kids in your class then the class WILL be lame.\nthird: Participation is key. If you're quiet... dnt take the class. I got an A in the class and I didnt \"work my butt off\". I am not even an arts person! Participate, come to class interested, and go to his OH and you'll see that its pretty easy to get a good grade. In fact I was SHOCKED by my grade. I dont get A's. I think he grades ppl individually, as long as he sees youre trying YOUR best he'll give you a good grade \nhe brings coffee everyday, he takes ppl out on runs, lunch, trips. you wont find a cc teacher like him ... \nWorkload:\naverage \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 23, 2012",
            "review_content": "\nI have mixed feelings about Bob.\n\nOn one hand, he's hilarious and very nice and I never fall asleep during class (which is rare for me). He starts off every class with a powerpoint on the author we're reading, which is helpful. He also invites you to go running with him on Sunday, which although I've never done it, is awesome. \nHowever, I agree with the other reviewer in that he is a REALLY REALLY tough grader. I worked by butt off and ended up with a B+. \nThe midterms and finals are rough, but the best way to prepare is to review keypoints from all the books. There is really nothing else you can do to prepare. \nThe best way to improve your grade is to go to office hours and ask him to help you with your essays. He's always very willing and gave me a A on my last essay. \nWorkload:\nAverage. Take him if you want interesting discussions and are a good speed writer. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 20, 2011",
            "review_content": "\nBob was a good instructor. He tries to make CC as contemporary and student-based as possible, and he does a solid job. He gives a powerpoint at the beginning of each class. Throughout the semester, they've gotten longer (I've clocked the longest one at 50 minutes). He gives breaks in the middle of class which is nice, and also had a couple of fieldtrips (to the Morgan library and to the Cloisters). Those were especially great because they got us off campus.\nHis exams, however, are insane. The midterm was two essays in 1 hours, each using 4 different texts (so 8 different ones in total). The final was non-stop ferocious writing for 3 hours. He's also a really, really tough grader and takes forever to grade assignments (it took over 5 weeks for me to get my first essay back).\nOverall, if you want to get something out of CC and have discussions that aren't mind-numbingly boring, I'd go with Bob. If you don't want to work in  CC at all, don't take this class. You'll get a grade that reflects you did nothing. \nWorkload:\nAverage\n"
        }
    ]
}