{
    "prof_info": [
        {
            "prof_name": "Kathy Fewster",
            "prof_id": 9998,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "The Origins of Human Society",
            "review_date": "May 20, 2010",
            "review_content": "\nI took this class purely for the fun of it - I didn't need it to fulfill any core or major requirements. I found Prof. Fewster to be a funny and engaging lecturer; however, even this (and the cute-rabbit pictures she snuck into every lecture) couldn't save the course from being mind-numbingly boring in the last few weeks. When the course turned to examining agricultural practices in extreme detail, it was hard not to fall asleep. However, if that's your thing, you might really enjoy it.\nI was present for Prof. Fewster's hour-long talk about questions worth asking and questions NOT worth asking. I didn't, however, find it condescending at all. It actually came as a relief -- there had been a lot of, \"Well, when I used to baby-sit for one toddler last year in high school, I learned that ALL CHILDREN EVERYWHERE always behave in such-and-such a way...\" and unfounded, anecdotal, and barely-related commenting happening from students. Prof. Fewster effectively curbed these irritating and unproductive conversations.\nShe tried to keep assignments low-stress. While a lot of reading is assigned, it isn't necessary to do it. (You might want to books for reference material for your essays, though.) Two big papers and a take-home final (though there was some confusion with whether or not the final had been cancelled in the last several weeks of class.) All easy; all were graded really fairly.\nWorkload:\nLots of reading (that you don't actually need to do). Two papers. One take-home final exam.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 21, 2010",
            "review_content": "\nKathy Fewster is a visiting professor from Wales. At first she appears to be a charming and witty woman, who made each lecture as interesting and engaging as she can. Halfway into the semester, Professor Fewster blew our minds with a condescending lecture about how students should not ask questions in a lecture. Her passive aggression is unrivaled and unexpected. Less than two weeks before the end of the semester, Professor Fewster dropped the final and changed the syllabus. Students were surprised.\nThe class was inordinately stressful because of the ever-changing syllabus. Otherwise the course itself is interesting. It is divided into two parts, the first part covering the evolution of mankind, the second going over the origins of agriculture (which was significantly less exciting).\nWorkload:\n2 monster papers, each worth 50% (when they were supposed to be 25% each). She's nitpicky with grammar and contractions.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 20, 2009",
            "review_content": "\nThis class comprised two major units: human evolution and the rise of agriculture. The first half was human evolution from an archaeological perspective, but also with a lot of scientific evidence. Kathy doesn't really know anything about evolutionary biology, bless her heart, but she actually teaches this unit very well given her weak background in it. I was riveted because she made human evolution into a kind of grand story. She's also very funny; if you want proof, check out this Overheard in New York quote from her class (http://www.overheardinnewyork.com/archives/020696.html). I found her British mannerisms endearing. The second unit about agriculture, unfortunately, was very boring. I think the fact that she knows a lot about the subject made it even more boring, because she got very technical about things like food processing and fossilized plant pollen. I could barely stay awake during this part. Overall, if you're not an anthropology major and you're just interested in human prehistory, I'd say there are probably less boring ways to learn about it. Try the Evolutionary Biology of the Human Species department.\nWorkload:\nThere's a lot of reading every week, but you don't really need to do it if you go to lecture. There were two papers and a take-home final.\n"
        },
        {
            "course_name": "Hunter-Gatherers: Presents, Pasts and Possible Futures ",
            "review_date": "November 17, 2009",
            "review_content": "\nKathy is a visiting prof this year (2009-2010) from Wales. She is the most adorable person ever. A bumbling, yet extremely intelligent woman who tucks an adorable picture of a bunny into every lecture. Our Hunter-gatherers class was rather small for a lecture (10 people) but it was actually really fantastic because she has gotten to know us all and encourages questions, comments, and feedback before, during, and after the lecture. While she puts a lot of emphasis on archeology due to her background, she gives excellent insight into the fields of archeology as well as anthropology bases on her experiences working with some big academics. She studied the San of Botswana for her doctorate, so be prepared for a lot of African Hunter-Gatherer focus, but it is all very well presented and very interesting. Kathy is smart, extremely compassionate, and has a great accent and British mannerisms--take a class with her if you can!\nWorkload:\nHardly anything. there are some articles and book chapters (or even whole books) listed on the syllabus for each lecture, but they are more for your interest and great starting points for the research papers. Two 5-6 pg research papers, one Museum of Natural History Exhibit Critique. \n"
        }
    ]
}