{
    "prof_info": [
        {
            "prof_name": "Elisabeth Ladenson",
            "prof_id": 3254,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2017",
            "review_content": "\nDon't take her class. She doesn't take responsibility for screwing up your papers from her comments and odd essay topics. Her grading was also very intense and unforgiving. Agreed with a lot of the past comments, they are highly accurate. \nWorkload:\n2 weird ass essays that she tells you how to write in her style, but is so confusing that it's hard to understand her style and she screws you for it. 2 exams\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 08, 2016",
            "review_content": "\nSwitch out if you can. Professor Ladenson will explictly let you know that she is irritated by anything and everything that you do. She will ramble and lose track of what she is saying, not delving into any analysis of any sorts beyond asking students to reread passages of the texts to then go off on a tangent about some piece of literature she is familiar with. You will be on her good side by coming into the class having learned Greek and with knowledge of the gods and goddesses of Greek mythology. Her midterm destroyed me. She claimed to be encouraging me to come to her office hours. However, she purposely tended to find faults in whatever I discussed, or whatever I wrote in my papers. She never gave ideas to help improve the content of the paper, but only got irritated if you wrote not as \"normal people do.\" As a result, I, among others, was left clueless in how to improve. She looked for specificity, and never pitied anyone. I cried in her office hours more than I did over anything else my first semester at Columbia. And this is all coming from an English major. \nWorkload:\nIt's lit hum - do the readings. But if you don't sparknotes works anyways. Just not for the midterm. There are two papers - she grades extremely harshly (and you are not encouraged to improve since she will only pick out minuscule faults such as writing \"Yet, ..\" instead of removing the comma after yet, for instance.) Only one student received an A- on his first paper, and she called it \"fine.\" \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 23, 2011",
            "review_content": "\nAfter a hellish experience 1st semester I pulled an A- in this class but only because I did extremely well on the exams as she would still give me B's on the papers even if I had previously turned them in for review. I thought I would rough it another semester because I had gotten a good grade but the class is so painful I switched into a random section in January which was a good call. \nSpecifically, she has favorites. Don't take this class if you didn't attend Horace Mann for high school. For the first hour of class she would talk about herself- her thoughts, dreams, past. She's also quite scary. The next hour she allowed a few students to dominate the conversation in any way they wanted and honestly I never learned anything about the book, and I was one of those students who dominated the conversation. \nIn all honesty, I never read a book until the weekend before the exam and still participated and still got a good grade. \nWorkload:\n2 Papers and 2 exams each semester. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nThe bottom line of this class is it's about pure luck. Some people thoroughly enjoyed it and did well. Others, however, were brutally insulted by her on their papers and she never gave any feedback on how to improve. Professor Ladenson looks for a particular writing style in her papers and has no trouble completely bashing the papers that don't fit her standards. On the day our papers were returned, she immediately announced that our papers \"were crap\" and she felt like she was reading \"seventh grade special ed\" which she said wasn't her job, among other insults. By the end of the semester, about half of our class transferred out. Although I think it's important for teachers to let students know when they need to improve their writing, Professor Ladenson just told us we were horrible and didn't give us any feedback on how to improve. Once I realized I couldn't figure out how to please her, I decided to transfer out. My teacher in the spring semester returned my first paper with comments all over it, and a grade that was much more reasonable. Because of my new class, I was able to drastically improve as a writer, something I don't think I was able to accomplish at all my first semester. My advice is don't risk slaving away over a paper, trying to figure out if it will fit her criteria--your freshman year should be much less painful than that. Take a teacher who actually wants to help you grow as a student (i.e. not Elisabeth Ladenson). \nWorkload:\nTwo papers\nMidterm (consisted of 15 passage identifications,  ALL of of which we had to identify, an additional unreasonable component of her class)\nFinal\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nIf I had to use one word to describe Ladenson's class, it would be \"nightmarish.\"  Class discussions mainly involved her and her one or two favorites, leaving everyone else somewhat removed.  She also picked the most obscure paper topics, which seemed to be an attempt to make us learn to write by struggling and suffering.  All the while, she dictated exactly how we should write, asserting that we should not make any claims about the writing because, since we can't call them up and ask them, all attempts to look at the authors' intentions are futile.  Dull.    \nBoringness aside, I am still at a loss as to why she found making fun of and insulting her students to be beneficial to anyone. The highlight of the class was her telling us that our papers were all \"crap\" and that they sounded as if they came from a 7th grade special ed class.  Criticism was seemingly mean-spirited and never constructive or helpful.  Needless to say, more than half of the class switched out after first semester.  \nWorkload:\nTwo 6 page papers.  What you would expect.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 04, 2011",
            "review_content": "\nGreat class. Yes, she definitely has favorites and lets them interrupt her throughout class, which can be frustrating. But she clearly cares about Lit Hum and has great insight onto the books we read. She altered the syllabus, adding Paradise Lost and Lolita (awesome books), and removing Pride and Prejudice and most of Boccaccio. \nHighly recommend the class. Also, no pressure to participate, as long as you pay attention in class, take notes (or pretend to), and don't totally bullshit the two papers/semester. \nTake her class! \nWorkload:\ntwo papers/semester, really hard mid-term but she offers a few opportunities for extra credit.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 30, 2011",
            "review_content": "\nI disagree w/ the other reviewers. She tries to be clever, but is not. She's overly opinionated and postures as someone who cares and is knowledgable, when she's a dud. Maybe the other reviews were written by first year students. I'm looking back on the course as a more advanced student and I see how banal and shallow her class was. I made an A, thought the class was okay at the time, but have had so many more thoughtful and engaging profs since. It depresses me that I liked it at the time. \nWorkload:\nShe's easy, but it's still not worth it.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2009",
            "review_content": "\nProfessor Ladenson was fantastic. Although she borders on arrogance, she made lit hum very enjoyable and is a brilliant woman. She doesn't put up with any student slacking, which is helpful in promoting class discussion. however, she grades her papers quite difficultly and once she forms an opinion of you, she uses her biases to grade your work. \nWorkload:\n4 papers, 2 midterms, 2 finals \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2009",
            "review_content": "\nProfessor Ladenson is an incredible teacher. She made Lit. Hum fun to attend in the morning. Our discussions were very thought-provoking and we even learned a little French and Latin along the way. The conversations were even funny at times. If you want to sleep DON'T DO IT...she'll stop in the middle of a sentence and call you out. Also, cover your mouth when you're yawning or she'll catch you on that too. Most importantly, DON'T LEAVE YOUR CELL PHONE ON! If it rings you're screwed. I would definately recommnend this professor as long as your're willing to attend class and want to learn.\nWorkload:\nTwo papers, a midterm, and a final. The papers are kind of tough but if you do the reading the midterm should be fine and the final is standardized but I felt pretty prepared. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 08, 2008",
            "review_content": "\nProfessor Ladenson is great! She is extremely witty and insists on calling everyone Mr. and Ms. with their last names. She knows a lot about the texts and demands the same of her students. Her paper topics were challenging but interesting. The first one was simply 'imitation' and the second was a variety of choiced. The discussions were lively and spirited, and she made sure students did not just blab, if they did, she would ask us to stick to the texts and speak about the work, not some vague ideas in our heads. Do not pass the opportunity up to have her. \nWorkload:\nShe is a fair grader, I read everything and did very well. The midterm was challenging, with a mix of gimmes and a few harder one. Make sure to really READ the quotations given. Two papers graded fairly and Departmental final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 10, 2007",
            "review_content": "\nI'll keep this straightforward: TAKE LADENSON'S CLASS. This opinionated, black-wearing, eyebrow-raising French scholar will blow you away with her insight. Her discussions are genuine, enlightening, and fun. Her only down-side is a tendency to constantly sing the praises of her favorite novels, Madame Bovary and Lolita. As a person, Ladenson is direct, forthright, and highly intelligent. If she seems intimidating at first, it is only because she practically exudes intellect. Professor Ladenson is a fair grader-- more than fair if you proved yourself worthy in class discussions. Note to the wise: this lady commands respect. That means, no laptops unless you're fine with being exposed to constant mockery. And you had better believe that you WILL read... or else. But why wouldn't you want to? It's only the better for those insightful class discussions. Also, take advantage of office hours. Ladenson's an absolute delight.\nWorkload:\nChallenging midterm that is quite fine if you actually did the readings, standard 2 essays of varying lengths, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 15, 2007",
            "review_content": "\nProfessor Ladenson is an excellent, knowledgeable, funny, albeit challenging LitHum Instructor. The discussions are interesting and she provides good insight and historical background on the texts. Most importantly, her discussions are text-driven and student-led, so anyone who wants to participate can and does, as she makes the environment comfortable so that almost everyone talks. The midterm was difficult, but people who read did well it seemed. The papers were challenging, but there were only two, and the disaster that was this year's final was out of her hand. Take her if you can!\nWorkload:\nNormal for LitHum, one extra book (Lolita) which was worth it. She even cut back on Don Quixote a little bit. Tough midterm, but doable, papers graded fairly but the topics are challenging. \n"
        }
    ]
}