{
    "prof_info": [
        {
            "prof_name": "Avishek Ganguly",
            "prof_id": 2355,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 29, 2005",
            "review_content": "\nAvishek was really nice. He understands that university writing can be excruciatingly boring, and makes it interesting...by mostly having a class discussion on the essays we read for the class. I liked his selections: Said, Baldwin, Didion, Sontiag, Nussbaum and others. His principle area of interest is multicultural issues, or cultural/race/gender issues in general. Of course, the class discussion will greatly depend on your peers, but if you meet with Avishek to talk about your papers, you'll often end up talking about this issues and find that he's a very interesting and well-read guy. Papers-wise, university writing mainly consists of peer criticism/discussion and meeting individually w/ Avishek. \nHe's extremely flexible, and once met with me late at night (until past 10 pm) to accomodate my schedule. He is much more effective at transmitting feedback in a meeting than in his comments, so I strongly encourage you to meet with him because you will get additional valuable feedback, which is important because Avishek has decided to single-handedly fight grade inflation in the ivy league. \ni.e.: if you want to do well, you have to work very hard for it, and Avishek will not accept intellectual sloppiness in your work. U Writing could easily have been abysmal. Avishek makes it bareable on worst days and frankly enjoyable on the good ones. \nWorkload:\nstandard. there is a certain amount of busywork, but it is ungraded. papers otherwise are standard. You get 5 points (out of 100) just for turning in a first draft, so make sure you get these \"giveaway\" points.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 29, 2005",
            "review_content": "\nAvishek was really nice. He understands that university writing can be excruciatingly boring, and makes it interesting...by mostly having a class discussion on the essays we read for the class. I liked his selections: Said, Baldwin, Didion, Sontiag, Nussbaum and others. His principle area of interest is multicultural issues, or cultural/race/gender issues in general. Of course, the class discussion will greatly depend on your peers, but if you meet with Avishek to talk about your papers, you'll often end up talking about this issues and find that he's a very interesting and well-read guy. Papers-wise, university writing mainly consists of peer criticism/discussion and meeting individually w/ Avishek. \nHe's extremely flexible, and once met with me late at night (until past 10 pm) to accomodate my schedule. He is much more effective at transmitting feedback in a meeting than in his comments, so I strongly encourage you to meet with him because you will get additional valuable feedback, which is important because Avishek has decided to single-handedly fight grade inflation in the ivy league. \ni.e.: if you want to do well, you have to work very hard for it, and Avishek will not accept intellectual sloppiness in your work. U Writing could easily have been abysmal. Avishek makes it bareable on worst days and frankly enjoyable on the good ones. \nWorkload:\nstandard. there is a certain amount of busywork, but it is ungraded. papers otherwise are standard. You get 5 points (out of 100) just for turning in a first draft, so make sure you get these \"giveaway\" points.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 29, 2004",
            "review_content": "\nI took this course and because there were no bad reviews for this graduate student, so I figured all would be well.  This course is a very tough one in general, if you have a graduate student who loves to assign busy work, this class is probably for you.  The course calls for a lot of ungraded assignments, which you are required to do.  Some teachers ask for a page summary, Avishek will ask you for at least a 600 word paper all the way up to a 1200 word paper practically every class period, and this is all after reading sometimes a 40 page article.  We never received these assignments back, so we had no idea whether he even read them.  At the end of the course we were asked to write a retrospective essay.  More than half the class included fits of crying, chest pains, and extreme depression because of this class.  Its a very tricky atmosphere, in the beginning he passes himself off as a happy go lucky guy, you want to put your heart and soul into the class, and only once its too late, you realize he couldn't care less about the class.  The papers come back with one or two unhelpful comments, and he will never tell you how to raise the grade, ever, this was a common complaint.  If you are already a good writer and like to do busy work, take this class.  If you want to improve your writing, get into a different section.  If you have to have a bad grade on your transcript at least ask for something out of the class.\nWorkload:\nTypical graded requirements, plus ungraded assignments requiring 3-4 times the work other sections get away with\n"
        }
    ]
}