{
    "prof_info": [
        {
            "prof_name": "Andrew Schmidt",
            "prof_id": 5412,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Financial Accounting",
            "review_date": "December 10, 2010",
            "review_content": "\nAndrew Schmidt is one of the best Professors I've had (if not the best), and Financial Accounting is by far the best organized class I've taken. If you're at all interested in economics, finance, business, or investments (or anything along those lines), do yourself a favor and take this class. Below are some highlights:\nFirst, you don't need to buy an expensive textbook. All of the material is organized in extremely helpful handouts and posted to Courseworks long before it's reviewed in class so you can set your own pace if you want. Problem sets are the end of each handout, and there are 10 of them. The course packet, also posted at the beginning of the semester, contains sample midterm and final exams, so you can tell very early what the load is going to be like, identify weak areas, and generally plan ahead. This is amazingly valuable.\nSecond, Andrew is highly devoted to helping you succeed. If you email him, expect a fast reply. If you ask a question (either in or after class), expect a definite answer. Before the midterm, he actually did a \"no time limit\" review session (that is, he stayed until there no more questions) but he also taped it and posted a link to the video, and the slides, on the CBS website for anyone to access it again in case it's needed (or those who couldn't attend).\nThird, this class deals with stuff from the real world. You look at financial statements of real companies, examine real situations that happened, and comment on actual data. There are no \"theories\" or \"assumptions\" and it's all useful because you learn about a variety of companies that you might not have known before. In addition, Andrew spices things up by sometimes presenting findings from his past/current research, which is very interesting (especially if you're into company evaluation). I recommend looking at his research and working papers.\nFourth, the class is fun to be in. It's hard to believe that an accounting class can be fun, but Andrew makes it so: he's very funny, got a lot of experience and stories to share from his past, and I've never found myself bored -- unlike literally every economics class I've taken. At the beginning of the semester we put signs with our names, and he quickly engaged the class and got it involved. No awkward silences or unanswered questions when Andy shouts your name and asks a question, keeping the class always moving forward, never halting. He methodically goes over the topics, adjusts to time constraints and never goes beyond the allocated time, and helps bring the important points home.\nFinally, I should say that personally, I was amazed at how different this class was from everything else I've experienced at Columbia. I don't know if it's specifically Andrew or the general level at the business school, but taking it made me want to find out. I can't stress enough how useful this class has been and how valuable it was to me... Again, if you're looking to work in anything related to business, money, finance, investments, or whatnot, I'd say that no matter what your major is, consider this class to be in your own personal mandatory core. You won't regret it.\n\nWorkload:\n10 problem sets, a bit long but very helpful and graded based on effort (0/1/2). A quiz before almost every class (very easy, just looking up stuff in financial statements, no calculations needed). Midterm and final are \"glorified problem sets\" and basically present the same sort of questions, which is very fair.\n"
        }
    ]
}