{
    "prof_info": [
        {
            "prof_name": "Paul Duby",
            "prof_id": 1559,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Processing of Metals and Semiconductors",
            "review_date": "March 30, 2011",
            "review_content": "\nThe review of this class seem not to have changed in 8 years: adorable, lovable old man, boring as hell class.\nProfessor Duby is probably one of the kindest, most understanding and most intelligent professors I have had at Columbia.  This is not to say the class is in any way engaging or interesting.  It's mind-numbingly boring and just seems to drag on and on for an hour and a half.  The textbook, which Duby just sort of points to on the projector and mutters about in class, is not helpfully organized and does nothing to make the material covered any more enticing. The subject matter is dull to begin with, and is downright soporific when combined with Professor Duby's quiet monotone.  It's clear that Duby is crazy smart and surprisingly good at explaining things, but unless you're sitting about a foot from the blackboard he just begins to sound a bit like a constant buzz.  It was a bit sad because by the fourth week about 5 people showed up for every lecture in a class of about 12 and those who did attend were always late and either eating or fast asleep. \nHowever Prof. Duby honestly cares about his students and wants them to do well.  If you have trouble following him in class (I personally could not keep my eyes open), I would advise going to meet with him outside of class.  He was willing to meet with students whenever and is very understanding if you need help with homework or class material. He may chuckle at you for overthinking a \"simple\" problem, but its well worth it -- Duby seriously knows his shit (he's been teaching for what seems like an eternity - his uni is pd1), and is genuinely helpful and super easy to follow when meeting with him one on one.  \nAll in all, if you can manage to stay awake in his lectures (or decide to just chat with Duby outside of class), you will do well and have the chance to learn a lot from a brilliant and awesome professor who's been teaching this stuff nearly forever.\nWorkload:\nThe homeworks (which are due roughly every 2 weeks) can seem really confusing, and if you don't follow his reasoning in class, you won't be able to find answers in the book as he makes up the questions himself. They also did not seem to be graded really, he just marked on a check +/- basis. Regarding the midterm/final, they are open book, note, etc (he let people in our class use their computers), and those who did poorly on the midterm could do corrections and hand it in as a homework.  Final was more of the same, and he was very flexible with grading (basically he weighted either the midterm or final more heavily depending on your performance).\n"
        },
        {
            "course_name": "Thermodynamics, Kinetic Theory, and Statistical Mechanics",
            "review_date": "November 29, 2004",
            "review_content": "\nThis class demonstrates the risk of grading on a curve. Basically no one taking it took it seriously, so--gradewise--no one had to. I felt bad for Prof Duby, because the whole class had clearly given up on the course by  the second lecture. As an example of the grading, on the second midterm, everyone must have bombed, because we were reassigned it as a pset to boost the grade.\nIt doesn't help that the book is a piece of crap and that the questions tend to be ill posed\nWorkload:\nPSet every week (poorly worded questions, but easily graded)\n3 Midterms (probably easy, but the curve'll boost you either way)\n1 Final\n"
        },
        {
            "course_name": "Processing of Metals and Semiconductors",
            "review_date": "April 17, 2003",
            "review_content": "\nWhat an utterly lovable old man.  If you can get past the little tiny classes he teaches, and his numbing monotone, he's really a terrific and super intelligent professor.  He is very flexible in terms of bending the lecture towards your questions, rescheduling classes and tests, and not really caring when homework gets turned in.  His tests and homeworks can be really deceptive....he's a fan of asking indecipherable questions that inspire you to do pages of pages of hopeful calculations, and then chuckling at how you really should have know that a meager 3 lines of calculations (and about 6 assumptions you would never have thought of) will suffice.  It can be really vexing, but luckily he's a fair grader and gives a lot of credit if he thinks you knew what you were trying to do.  Plus he really weights everything well (if everyone does badly on a problem he just doesn't count it...if you do badly and your friend does great, he'll count your friend's and not yours...sounds weird, but it works).  He really knows his stuff and is pretty good at explaining confusing things....though sometimes he is very impatient and anticipates and thus answers questions that you weren't asking.  A class with Duby can be super duper dreadfully boring, but if you can steel your sleepiness against his dragging lectures, you may learn a whole lot, and also get some wisdom from a guy who has been doing engineering for damn near eternity.  And his name is Duby.  The joy it brings to just say Duby-duby-doo as you walk into the class should be good enough.\nWorkload:\nweekly-ish problems (just 1 or 2 that he makes up himself), a midterm, and a final\n"
        }
    ]
}