{
    "prof_info": [
        {
            "prof_name": "Glenn Cowan",
            "prof_id": 1618,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "May 19, 2004",
            "review_content": "\nHe's not a very good teacher, although he does try hard. The notes that he gives in class are somewhat useful, although the book gives about the same type of examples and a decent explanation. Unfortunately, he's really boring and there's little incentive to pay attention in class. The exams are much much harder than the practice tests and the hw. If you go to office hours you can usually get great help and in depth explanation, but lectures can pretty much be skipped if you're willing to study from the book.\nWorkload:\nLab every week which is a pain, small number of problems every week which are easy, three midterms one dropped, one final and one final project. The curve is not that good in this class\n"
        },
        {
            "course_name": "Intro to Electrical Engineering",
            "review_date": "May 05, 2004",
            "review_content": "\nGENERAL COMMENTS\nI've really been impressed by this class.  It's a very well taught course.  The lectures are clear (and funny at times) and well presented.  The course is well organized and well run overall.  It's really been excellent.  \nAlthough this is a subtle point, I've been impressed with the pedagogical tone of both the instructor (Glenn Cowan) and the TAs.  It's a little hard to get at, but for instance it made an impression on me at one point when the grading process for the exams was being discussed, and the emphasis in grading was on understanding the concepts, and making minor math errors was not penalized.  I may not be explaining this well, but what this represents to me is a sincere desire to *assist* the students in learning and help us along, as opposed to just evaluating our performance.  Maybe my example does not seem to really illustrate this clearly at all, but anyway my point is that the impression that I have had as a student is of a very supportive learning environment, and this impression has come across in multiple interactions with the TAs and instructor.  \nThe instructor has been quite responsive to feedback & suggestions from students.  Also, he has been careful about preventing cheating on exams, which I think is important for fairness.  He and the TAÂ’s have been very professional about how they have handled themselves throughout the course.  In particular the instructor has struck a nice balance of being very serious about the running of the course and at the same time made the course material enjoyable and fairly entertaining.  \nI think itÂ’s good that the course uses a textbook that isnÂ’t always coming out in new editions.  It makes it possible to save money by buying a used copy.  \nABOUT THE TA'S\nI've been quite impressed by all the TAs uniformly for this class.  They have been very helpful in the labs; and have also expressed an *attitude* of wanting to be helpful, that this is what they want to do.  I'm speaking about both the grad TAs and the undergrad TAs.  I've also had some electrical engineering questions outside of the lab material, and in particular Nebojsa went out of his way to find information about this for me.  \nIn particular, both Nebojsa and Brett have been very available and forthcoming with help in the labs.  Jerry and sometimes Scott have also worked at my lab session, and have been quite good.  Ali was not the TA for my lab, so I can't comment about him.  \nAbout the labs:  The equipment and materials that we have needed have always been available and in good condition.  I think this may be a sign that there is plentiful funding for equipment, but also I think that whoever has been in charge of organizing the equipment and supplies has done a really good job.  The additional information on the whiteboard during the labs has been helpful and sufficient.  \nWorkload:\nThe course did not seem hard to me, although I already knew some basic electricity before I took it.  \n"
        },
        {
            "course_name": "Intro to EE (1201)",
            "review_date": "May 12, 2003",
            "review_content": "\nGlenn is the greatest TA I've encountered.  He will help with the labs but do so in a way that makes you understand them.  When going to him for extra help he is extremely helpful.  Also, on the day when the prof was sick and Glenn lectured, he was an excellent lecturer.  Also just a great guy.  If he is the TA to a class of yours, utilize him.\n"
        }
    ]
}