{
    "prof_info": [
        {
            "prof_name": "Turkuler Isiksel",
            "prof_id": 11343,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2012",
            "review_content": "\nProfessor Isiksel is probably one of the most brilliant professors I have had at Columbia. She is extremely well versed in philosophy and political theory, is well traveled, and is quite  intimidating. She is a very sweet, gentle person concerned with the well being of her students. In fact, on several occasions, she ordered tea and cookies for class in order to make students feel more at ease and relaxed. Her discussions are very well organized, and she absolutely loves students participating in class and presenting their own opinions on every philosopher known to man. Overall, she is genuinely concerned with making sure all of her students mature academically and intellectually in her class. \nMost of her readings are manageable; however, she does not give enough time for students to write term papers. She gives students only a week to write 6-8 page papers which tend to be very detail oriented. She also conveniently assigns a ton of reading during those few precious days which if you are a science major coincide with about 3 midterms!\nGrading wise, she is one tough cookie! Warning: unless you are a humanities major with a wonderful understanding of philosophy and political theory, your GPA will take somewhat of a nose dive. She is an extremely tough grader, but that being said, she expects a lot out of her students. She even writes full page commentaries on each essay in order to guide students in the right direction for the next essay. Her midterm and final consist of IDs and essays. Be warned, her IDs are killer! Her essay questions are pretty standard and she is much more forgiving on in class essays than on take home essays.\nIf you are a humanities major, I would definitely recommend her. If you are a science major, I would not recommend her as CC professor unless you absolutely love philosophy and are slightly sadistic. My class unfortunately consisted of mainly humanities majors who loved discussing the nature of man and justice in the polis. For much of the class, I was somewhat lost. In fact, it was only after the final did I understand what Plato's definition of justice was thanks to my roommate who is a philosophy major! \nWorkload:\n- mostly  manageable reading\n- 2 essays\n- 1 midterm\n- 1 final\n- about 5 or 6 outlines/responses to readings (counts toward participation!)\n"
        }
    ]
}