{
    "prof_info": [
        {
            "prof_name": "Oleg Loktik",
            "prof_id": 1580,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Physics Lab",
            "review_date": "November 15, 2004",
            "review_content": "\nI completely disagree with the previous two reviews of Oleg.  I feel that he really cares that we fully understand what we are doing in the lab and he does grade fairly.  It generally took me close to the full 3 hours to finish the lab, but why shouldn't it - that is the time that the course is alotted - I was rarely was pressed for time even though I stayed the full 3 hours.  In addition, I rarely went to physics lab library to prepare - the maximum amount of times I went was 2 and it was only to glance at the experiment for a few minutes.  Furthermore, the TAs in the lab were very unhelpful as opposed to Oleg, who explained the concepts well in the lecture.  Overall I was very satisfied with Oleg and thought that I learned a lot from the course.\n"
        },
        {
            "course_name": "General Physics Lab I",
            "review_date": "November 15, 2004",
            "review_content": "\nI completely disagree with the previous reviews.  Oleg is a really nice guy who is willing to help you out in lab.  I have never been to lab office hrs, and I'm doing fine in the class.  \n"
        },
        {
            "course_name": "General Physics Lab I",
            "review_date": "November 15, 2004",
            "review_content": "\nOleg gives a lesson before lab and derives all formulas that you may need, he is available for your questions on how to conduct the experiement and how to calculate error.  As with most premed classes, there is a high level of competition, as he grades the labs based on the level of the class.  I can definitely vouch for the fact that he does not kick you out early, as I have struggled hard to get my lab in at the buzzer each week!\nWorkload:\nWeekly preparation of lab set up, reading of manual...NO OUTSIDE REPORTS!\n"
        },
        {
            "course_name": "Physics Lab",
            "review_date": "November 15, 2004",
            "review_content": "\nOleg is an excellent lab instructor.  He gave informative lectures before the lab that highlighted key points we needed to know throughout the lab.  He always answered all of our questions and was both knowledgeable and friendly.  He makes a boring lab as painless as possible.  The major frustrations (too long labs, poorly written instructions, etc...) with 1200 P. lab come from poor structuring of the course, not from the lab instructors.\n"
        },
        {
            "course_name": "physics lab 1200",
            "review_date": "April 25, 2003",
            "review_content": "\nif you get this man, run far far away.  You actually have to do hours of outside work for this 1 point class just to get a decent grade in his class.  his standards are ridiculous and he doesn't understand that only so much can be done in a 3 hour lab, especialyl when he spends 1 hour lecturing on crap. \n"
        }
    ]
}