{
    "prof_info": [
        {
            "prof_name": "Danielle Sussan",
            "prof_id": 13009,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Psych Research Methods Lab",
            "review_date": "June 13, 2017",
            "review_content": "\nSussan is the best! She genuinely cares about her students and doesn't want them to be too stressed. This class has a lot of seemingly pointless work on the syllabus and Sussan completely understands that and is reasonable about the class. She's approachable and gives great feedback. If you're deciding who to take for Psych, take her!!!\nWorkload:\nThree problem sets, a research paper, presentation\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 21, 2016",
            "review_content": "\n10/10 would recommend.  Sussan is like my favorite professor at Barnard, I've had her for 2 semesters now and she's great.  The workload is reasonable, the tests are straightforward and her lectures are super engaging and funny.  \nWorkload:\n2 exams, 1 final, discussion groups with write-ups and one 4 page paper at the end of the semester. Super chill.\n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 08, 2016",
            "review_content": "\nProfessor Sussan is one of the best professors at Barnard. She cares a lot about her students and her main goal is for them to succeed. If she could give an A to every student she would. The subject matter is interesting and she teaches it in a very clear manner. You should definitely take her class. You're guaranteed to learn a lot without any frustration and a rough workload. If you study for the tests you will be fine. \nWorkload:\n2 tests and a final. The tests are mostly multiple choice with a few short answers. The final is cumulative. Since the third part of the semester is spent in discussion groups the final is only on two thirds of the semester. The third part of the semester is spent in discussion groups. Afterwards you will have to write a paper about your topic and reflections on the discussion groups you attended. You are able to pick any topic you want. \n"
        },
        {
            "course_name": "Perception Lab",
            "review_date": "December 08, 2016",
            "review_content": "\nDanielle Sussan is one of the greatest lab instructors at Barnard College. Honestly, the perception course (not taught by her) is horrible so the lab was the only redeeming factor. The truth is that it is a very outdated lab and really needs some retouching but because of her approachability, excitement about the material and friendly disposition, the lab wasn't too bad at all. She wanted us all to get A's, made that really clear and actively tried to ensure that this happened. She is also extremely accommodating, something not often seen in lab instructors. Overall, not the best lab but one of the best instructors! \nWorkload:\nOne section of a lab report due each week. It's honestly not so bad and she really walks you through what you need to write each week. It's also really good practice for psych lab reports so if you're a psych major, I recommend taking her labs because her assignments definitely allow you to feel more confident in your skills. \n"
        },
        {
            "course_name": "Cognitive Psych Lab",
            "review_date": "May 16, 2016",
            "review_content": "\nProfessor Sussan is THE BEST!!!!!! She was apparently a high school teacher before coming to Barnard, so she really knows how to explain concepts so that everyone understands. She walks you thoroughly the different sections of a psych paper step-by-step, helps each group with their final project, responds to questions over email, and honestly tells you what to write in each report. Overall, she's a really great professor/person to be around! \nAs psych labs go at Barnard, I think this was a particularly good experience. I can't say that I learned much about stats or research design, but it was completely do-able and (as I said before) Professor Sussan is awesome.\nWorkload:\nEach week you do an experiment in lab and then write-up one section of a psych paper from the week before (intro, methods, results, etc...). At the end, you design your own experiment, test participants, and then write up a final paper. It definitely wasn't too much work. \n"
        },
        {
            "course_name": "Educational Psychology",
            "review_date": "December 19, 2014",
            "review_content": "\nSussan is a capable teacher. She runs this class like a standard lecture with PowerPoint slides. She is helpful and responds to emails generally quickly. The course material is not difficult, and the slides are posted on CourseWorks.\nTowards the end of the semester, she has students sign up for discussions in which students form groups to discuss a certain topic. The group leader is in charge of leading the discussion and providing articles related to the topic for the group members to discuss. The group leader has to write a 5-6 page paper discussing the articles and the results of the discussion. Everyone else has to write a paragraph summarizing and analyzing the discussion of the day. All in all, everyone has to be a group leader at some point and everyone has to be part of a discussion quite a few times.\nMy only complaint is that sometimes, the wording of the exams are not very clear. Frequently, there will be repeated questions or jumbled answer choices or ambiguous wording. Sussan will clarify these ambiguities, though.\nOverall, this was a very interesting class led by a competent teacher. Also not time-consuming at all. \nWorkload:\nDiscussion Paper\nEveryone has to participate in discussion groups for the last part of the semester. The paper consists of about five paragraphs, each one summarizing a discussion for a total of five discussions.\nGroup Leader Paper\nEveryone has to be a discussion leader at some point. This 5-6 paper analyzes the readings related to the chosen topic and the discussion of the day.\nMidterms\nThere are two of them, and they are cumulative. They are entirely based on the lecture notes (so nothing from the textbook - as Sussan will say, the textbook is optional). They are part multiple-choice, part short-answer.\nFinal\nEntirely based on lectures and cumulative. All multiple-choice.\n\n"
        }
    ]
}