{
    "prof_info": [
        {
            "prof_name": "Lisa Estreich",
            "prof_id": 4529,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "The Americas",
            "review_date": "March 22, 2010",
            "review_content": "\nI have her for first year english: The Americas. If you are debating taking this class and manage to know whether or not she is your professor: run away as fast as possible. \nNever before have I ever been so uninspired by my teacher. She assigns a VERY heavy reading/work load. This wouldn't be so bad if the classes didn't move at glacial speed. This causes everyone to be so unmotivated that when she actually does try to make up for lost time, no one is prepared. She is also very poor at seeing the subjective side of English as a subject. While she may be very good at forcing you to make a direct connection between the reading and your points, her interpretation almost always in the only interpretation. \nShe is very knowledgeable, but that is her tragic flaw. She tries to do too much, all the time. She'll bring in 20 page essays and add it to our 100-300 page reading assignments for the next class. She also tries to bring in other type of media, movies and computer presentations, which I admit are nice. However, I feel like often these come to the expense of the class. I find myself often lost in the reading, without any explanation. Even when I go to her office, I usually leave feeling no more reassured. I even asked a student who had her last semester if she had any tips for me. She told me that even after she went through the entire course, she has absolutely no idea what Estreich wants from her students. She is always disorganized which reflects in the class. \nWorkload:\nVERY heavy reading (expect at least 70-100 pages per class. Sometimes it will be less. Savor those moments). 2 (4-6 page) Papers (first/second drafts... although first drafts should be considered final drafts), 1 Research Paper (6-10 pages). \n"
        }
    ]
}