{
    "prof_info": [
        {
            "prof_name": "Gabrielle Popoff",
            "prof_id": 2529,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 12, 2005",
            "review_content": "\nElissa was an amazing instructor, if you get through her tough-guy persona on the first day. She is geniunely interested in teaching and seems eager to engage each of the students on a personal level and make them as interested in the material as she is.  In addition to being a great instructor she's a truly kind and interesting person. \nWorkload:\nThe workload is pretty light, and while workbook assignments are never interesting the essays ocassionally are and both are necessary to learn the language. For an hour or two a week you should be able to pull off an A and actually learn the language.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 11, 2005",
            "review_content": "\nElissa is an Italian literature grad student and is a great teacher.  The first day (the only day she speaks a lot of english) might give you the impression that she will be an anal bitch, but once she starts teaching in Italian you will realize that she is passionate both about her students and the language itself.  Despite her strict syllabus requirements and penalties, she is extremely understanding with lateness/forgotten homework/etc, and she lets you drop one quiz grade per semester (but if you have to go out of town during a quiz, she won't let you reschedule).  She's very easy to get in touch with, and puts a lot of extra review material and general fun italian information on courseworks.  Highly recommended if you are genuinely interested in italian\nWorkload:\nweekly quizzies, midterm, final oral exam and final exam.  Plenty of throwaway exercises during class, handful of homework exercises from the Prego workbook and listening lab.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 11, 2005",
            "review_content": "\nHaving never taken a language class at Columbia, I was nervous at first.  But at the very first day, I knew that Elissa was going to make this class fun and not something to stress about.  Elissa does make you work like any other professor, but she has a real gift in making any concept in Italian very easy to understand and the homework (i compiti) is never an overload.  Elissa does call on people as is expected, however, its not like a spotlight is on you as she calls on everyone equally.  You are expected to speak Italian most of or all the time. Yet, if you do break out into English, don't fear.  Elissa might respond back to you in Italian, but its not like you committed a carnal sin or anything.  As for Elissa, her amazing fluency (being from Pennsylvannia no less) does allow her to speak Italian the whole class, but sometimes she'll explain it in Italian and then explain what she said in English.  Or Elissa will just very briefly talk in English for fun, but she is funny no matter language she speaks in.  Trust me, if Elissa is still teaching (as she is writting her dissertation for her PhD), register with her!\nWorkload:\nThe workload is much less at night (actually I recommend it!).  On the one of the two days that you meet:  a couple pages of workbook or listening lab due; the other day quz; Course requirements: one 300 word composition; one easy reader story (very short and you watch a video of it after); oral presentation (Elissa gives you two choices: the department or her style-choose hers); midterm and final (like two quizes in one with listening comprehension)\n"
        }
    ]
}