{
    "prof_info": [
        {
            "prof_name": "Kathryn Johnston",
            "prof_id": 3971,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "C2002 Introduction to Astrophysics I",
            "review_date": "June 15, 2015",
            "review_content": "\nProfessor Johnston is one of the most enthusiastic teachers I have ever had, and is certainly a good fit for this intro class. She is extremely approachable and helpful, so do not hesitate to her ask questions or ask her for advice about the class material or anything else related to astrophysics. \nThe material can be confusing at times, but never too challenging, and Kathryn does an excellent job of breaking down the different topics and relating them to other parts of the course. Her lectures usually consist of Powerpoint presentations, with breaks here and there to write out proofs or do examples. This course is usually one of the first courses students take in astronomy, so it provides some background material and a basic understanding of concepts in astronomy that can often be used in the more advanced astrophysics classes. Kathryn's excitement about the different lecture topics often showed, which made the class more enjoyable. She does not drone on in a boring fashion, but rather keeps an upbeat sentiment when discussing everything. \nThe most disappointing feature of this class, though not a worrisome issue, was the grading. Kathryn was a very picky grader, so you might lose a point or two on each problem unless they are thoroughly thought out. Ultimately, this was for the better, and helped provide a deeper understanding of the material. The grading was not super harsh, but do not expect an effortless A either. \nWorkload:\n5 problem sets, 2-5 hours each, fair and designed to make you think.\n1 final group presentation. Kathryn assigned all the groups (of 3 students) a different scientific paper related to some topic covered during the semester. This was her first year doing this, so I'm  not sure if she will continue it or not.\n1 midterm, 1 final exam, both of which were also fair.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 12, 2009",
            "review_content": "\nIf you have taken science since 4th grade, frontiers is in the bag. A few vocab words for each section of the course (4 parts) and basic stats/bar graphs. I don't understand why the core is able to leave the humanities classes at an acceptable level, but feels that it must dumb down science. I was bored out of my mind most of the time. DON'T go to the lectures, it  is a waste of your monday morning, read the slides online or listen to podcast and fast forward. \nThe homework usualy took about an hour to hunt down the answers in the slides or do calculations--mostly BS anyway.\nP. Johnson was good because she actually knows sciences, and has a funny class. this was my least favorite class this semster due to the course, not her specifically.\ni hope that the administration will revamp frontiers significantly in the next year, as it is now, no one really learns anything, as far as i can tell, but my clas also had a few people who didn't know what the hell was going on, so i guess it's variable.\nit was easy to hold around a 97% in this class, due to grammar errors in the midterm essay.\nWorkload:\n4 three week sections each have three homeworks, one quiz and an in class somesuch.\nmidterm was on first two sections, final on all four. \n"
        },
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "January 19, 2009",
            "review_content": "\nI thought this was an absolutely delightful course! Professor Johnston is a cheerful, open and extremely friendly person who, at least in our class, was really good at engaging the class and lecturing engagingly. It would probably help a lot if you are naturally interested in galaxies, space, or physics, but in general this class wasn't too difficult. It is challenging, and I found myself having to go to see Professor Johnston on a number of occasions for homework help/talking about random interesting things. I didn't take the lab, so i have no idea what happened there, but in terms of this class i would definitely recommend it to anyone interested in astronomy. The only problem i had with this class was that we had to move on to different topics- aka i found everything fascinating.\n \nWorkload:\nseveral problem sets, midterm, final. the great thing about this class was that we only had homework every 2 weeks, when we had a problem set, and usually these could be tackled in an hour or two. very light daily work. \n"
        },
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "December 29, 2008",
            "review_content": "\nA great course and a great professor!  Professor Johnston was able to successfully engage the class in discussions and lectures about the universe, a topic which many people don't really know much about.  I can't recommend this course to people interested in the physics behind everything, though.  Take an astrophysics course you are one of these people.  But if you are even remotely interested in gaining an in-depth layman's understanding of the way galaxies are formed and how the universe is structured, definitely take this course!\nWorkload:\n6 problem sets, very easy.  Little to no math involved on most of them.  Very easy midterm and final.  Attend lecture, take notes if need be, and you have your A.\n"
        }
    ]
}