{
    "prof_info": [
        {
            "prof_name": "Ponisseril Somasundaran",
            "prof_id": 1857,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "E4252:  Intro to Surface & Colloid Chemistry",
            "review_date": "December 17, 2009",
            "review_content": "\nThe class appears to be fairly straightforward, but don't be fooled by appearances. The professor does cover everything in the text, which is written by himself. However, you'll note early on that some derivations or equations seem to appear out of nowhere, or are rather difficult to understand. Moreover, the said equations are often covered briefly or inadequately in class, so come homework or test time you may find it quite difficult to do. That being said, the homeworks consist of a few questions made by the professor but are worded vaguely or difficult to understand. As for professor himself, sometimes I wish he would stop joking around and not poke people and instead try to explain the subject matter better. I think if he was more serious and gave out examples so that we could practice instead of groping around in the dark trying to understand the homework, I would have done considerably better. The only good thing I can say is that our TA was quite knowledgeable, but by the time we had to submit homework or take a test it was often too little, too late.\nWorkload:\nWeekly problem sets consisting of 2-3 questions (vaguely worded), 1 test worth 15%, 1 test worth 25%, 3 labs (analysis only, experiment is done for you), final worth 40%\n"
        },
        {
            "course_name": "E4252:  Intro to Surface & Colloid Chemistry",
            "review_date": "December 15, 2003",
            "review_content": "\nThere are SSSOOOO many good things I can say about Professor Somasundaran.  First, he is one of the most entertaining professors that I have ever had.  He would make the corniest jokes and make the silliest comments.  I am not a morning person, but he makes me excited about going to his lectures.\nSecond, he is a very good lecturer.  Surface Chemistry isn't something easy to learn, but Professor makes analogies to his topics so that the class can understand what he's saying.  We only used his course packet (written by him) as our only text, and I learned a lot from it!\nLast but certain not least, he is also very caring towards his students.  He puts his students first before his other work.  I emailed him once asking to meet him for office hours around 2 PM, and he didn't get back to me until 11 PM.  He felt so bad that he gave me his number to call him if I needed help.  I didn't call him, but it shows me that he cares about the students a lot.\nWorkload:\nPretty easy:  weekly homework of 1 to 2 problems (very flexible on the HW deadline), 3 short written lab reports, two exams (based a lot on the hw), and a final.\n"
        }
    ]
}