{
    "prof_info": [
        {
            "prof_name": "Stathis Gourgouris",
            "prof_id": 1709,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Greece & the Modern Imagination",
            "review_date": "May 17, 2005",
            "review_content": "\nI have come to the conclusion that Stathis Gourgouris knows EVERYTHING... no really.  When I envision what a true scholar should be like, Gourgouris is that exactly.  He had us read a lot of scholarly stuff I doubt I would have ever read otherwise.  Now I can impress my friends at cocktail parties with what Adorno said of being German or of what Humboldt said about striving vs yearning.  Well, now.  He is also a very nice guy... laid-back... open-minded... even invited us over to his pad one class.\nWorkload:\nSometimes a lot of reading... sometimes not as much... two papers... \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 18, 2005",
            "review_content": "\nGod I love this guy!  Take his class only if you are willing to compromise your  need to learn in favor of an easier semester (than most) of cc.\nShowed up 5-10 minutes late every class, let us go a little early.  Isa really cool prof who knows the essentials and doesn't worry about the bullsh*t.  Fairly liberal grader, professes that grades don't matter that much to him: learn to love it!\nWorkload:\n2 Papers, midterm, final, slightly less reading than most cc.  Not a hard grader.\n"
        },
        {
            "course_name": "Intro to Literary Theory",
            "review_date": "August 15, 2003",
            "review_content": "\nGourgouris is an extremely well-rounded intellectual. He is fluent in many languages, and knowledgeable about many things, including all areas of literary theory,  political theory, modern and ancient philosophy, and music. He is a very friendly and likeable guy, and extremely willing to meet with students to discuss anything. As for Gougouris's teaching style, his lectures and discussions were usually very interesting. Instead of reading from a script, he improvised his lectures from a set of notes. So as you can imagine, the quality of the lectures varied. His lectures on Plato and Derrida were very good. \nHis approach to the class was probably unique (from what I could tell, comparing his syllabus to the syllabus of Bruce RobbinsÂ’ intro to Lit Theory class). We read many texts that inform lit theory, but don't necessarily fall under the domain of literary theory. For example, we read sections from Plato's _Republic_, Kant's \"Groundwork for the Metaphysics of MoralsÂ”,  Nietzsche's \"Untimely Meditation\" on history,  Kant's and Foucault's essays, both titled \"What is Englightenment?\" and an essay by Judith Butler about free speech and the Supreme Court. We did read some more straightforwardly theoretical texts, including selections from Freud's writings about art and literature, Benjamin's _Illuminations_ , AdornoÂ’s _Dialectic of Enlightenment_ and essays by Derrida and Paul de Man. On the negative side, these texts did not really form a coherent whole, that really gave me a sense of what literary theory was. On the positive side, each one of these texts was absolutely brilliant. This class had one of the best reading lists I have ever seen. I doubt that I would have gotten exposure to these texts in any other class, especially one with a more conventional approach to literary theory. \nSo again, one caveat: if you want to take this class to get an answer to the quesiton, \"what is literary theory?\" don't expect to walk away satisfied. But then again, you don't really need a whole semester-long class to answer that question for you. Just read Terry Eagleton's book. This class is not really a standard introductory course. It really caters more to graduate students than undergrads, though as an undergrad, I got a lot out of it. It is just a discussion of some very interesting theoretical readings about history, art, politics and literature. But as I said, the readings are all enlightening, unique, and memorable, and so is Gourgouris.\n\nWorkload:\nmedium sized readings. two papers for undergrads (the first 12 pages, the second 15 pages), apparently a generous grader\n"
        }
    ]
}