{
    "prof_info": [
        {
            "prof_name": "Rebecca Guy",
            "prof_id": 469,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Acting Naturalism",
            "review_date": "January 19, 2005",
            "review_content": "\nBecky Guy knows her stuff when it comes to acting.  When you were working on a scene, she was right there in it with you, and could almost immediately pinpoint where you needed to work.  She was brutally honest and got right to the point of the matter, when it came to scenework.  I enjoyed the class and the atmosphere she created, except when it came to class discussion.  I am of the school of thought that believes acting should be practiced, not discussed.  But more often than the class liked (we often dozed off), she would go on tangents of acting theory and ideas.  It never got us anywhere, and regardless of how many things she said that were quotable, they didn't make us better actors.  All in all, she's got the eye of a great director and instantly understands character, but if you're in it for just the acting, be prepared for a lot of nonsensical discussions of pretentious ideas on the \"craft\".\nWorkload:\nMemorization and rehearsal of lines outside of class.  She expects everyone to arrive on time, memorized, with props/costumes, ready to rehearse.  However, when it came to grading, I will agree with another reviewer that she graded based on personality, because the grades were arbitrarly given and completely uneven.\n"
        },
        {
            "course_name": "First Year Scene lab",
            "review_date": "December 27, 2004",
            "review_content": "\nShe knows her stuff, in my opinion but she thinks she's always at Julliard. She makes good points to the actors from time to time -- that is, when she acknowledges the actors she makes good points. She doesn't get very personal with her students, and then grades them on personality. \nWorkload:\nLots of rehearsing outside of class. Way too much work for one credit.\n"
        },
        {
            "course_name": "Advanced Acting Lab",
            "review_date": "December 31, 1999",
            "review_content": "\nBecky has a profound understanding of what an actor should do on the stage, and how to guide students to do that. She does not tolerate absense, lateness, ans under-preparedness. Becky taught me more about acting than I thought I could learn, and her intensity is what the class needed.\nWorkload:\nMust Learn lines and rehearse outside class.\n"
        }
    ]
}