{
    "prof_info": [
        {
            "prof_name": "Sharon Everson",
            "prof_id": 1409,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Archery",
            "review_date": "December 01, 2009",
            "review_content": "\nProf. Everson/Sharon is simply the greatest, cutest lady around!  She's always cheerful and encouraging and really wants to be sure that you're doing the best you can.  Her stories and other kind of off-topic comments added some quirky charm to the class.  She clearly has fun teaching archery and I think everyone has fun learning it from her.  She also incorporates themed shoots for various times of year- pumpkin shoot for Halloween and turkey shoot for Thanksgiving (don't worry no living this is harmed- they're made of posterboard).  Each of these special shoots is followed by a dramatic awards ceremony with prizes that only serves to add to the fun.  Definitely recommend this class!\nWorkload:\nIt's physed- what kind of work are you expecting?  Just know the nine steps and come to class properly attired and you'll be good to go!\n"
        },
        {
            "course_name": "Fencing",
            "review_date": "October 31, 2007",
            "review_content": "\nWhat a wonderful woman.  She is so talented and respected in her field.  She has taken time off to help with the Olympics before.  The Barnard fencing team is one of the best around, which is due to her instruction (I am sure).  \nLike any great mind, she is a little crazy.  Her crazy comes down to students jerking around in class.  Pay attention and try - you will be fine.  If you do something well, she makes you feel like a million bucks.  Especially if you do well enough to demonstrate.  What a pick-me-up!\nSometimes she runs a little over the allotted 50-minutes, but that's just because she wants everyone to understand the moves since every class is built on past principles.  Very straightforward instruction.\nIf nothing else, take this class because it is interesting.  Who else do you know learning how to fence for college credit?  It might score you points later in life.  \nWorkload:\n4-allowed absences.  Builds your torso, arms and legs.  Not much sweating involved.\n"
        },
        {
            "course_name": "Archery",
            "review_date": "May 27, 2007",
            "review_content": "\none of a kind class. fun. develops upper body strength. only cons: the repetitiveness of it, bracing bow, setting sight, shooting, retreiving, etc. but otherwise, i loved it. remember: wipe your shoes when you come in, wear sneakers, wear tight-ish clothes so that nothing gets snagged. oh, and you get to shoot at ballons and apples. lovely stress reliever.\nWorkload:\nit's gym. max. 4 absences, etc.\n"
        },
        {
            "course_name": "Archery",
            "review_date": "April 17, 2006",
            "review_content": "\nI guess archery's not for everyone, but it ought to be!  Any class where I get to shoot at turkeys to win turkeys (for Thanksgiving) or at pumpkins to win pumpkins (Halloween) gets brownie points in my book.  And, hey, we even got to shoot apples.  I really enjoyed how inventive she was- kept it interesting with mini-competitions and these little gimmick shoots. Sounds cheesy, i know, but it was a LOT of fun!  Great way to fulfill that PE requirement without doing too much in the way of work.  And hey, not that many people can say they know how to shoot a bow these days, right?\n"
        },
        {
            "course_name": "Fencing (w/foil)",
            "review_date": "December 29, 2004",
            "review_content": "\nFencing was a pretty decent workout, not total body but lots of fun (and where else are you going to get to take a fencing class ?!). Sharon is a very accomplished fencer and she makes sure that by the end of the class you feel competent enough to spar and possibly take it up on your own if you want.  No one is left out and everyone in the class improved by leaps and bounds.  I would definitely recommend taking either this and/or her Saber fencing class.\n"
        },
        {
            "course_name": "Archery",
            "review_date": "December 29, 2004",
            "review_content": "\nThis was and is the best gym class to take if you want to fulfill a requirement. Prof. Everson is a great teacher and the class is not hard at all, as long as you show up for it. Prof. Everson is laid back and only wants you to try your best, don't worry if you cannot shoot an arrow across the room. Plus, if you are having problems she is willing to stay the whole period with you if she has to. This was by far the best class for me, since 1. you do not have to wear any gym clothes (Jeans are acceptable, just make sure you have a plain shirt on!!). 2. There isn't any strenous gym activity. If you want an easy Pass take this course, you'll be sad when it ends.\n"
        },
        {
            "course_name": "Archery",
            "review_date": "December 07, 2004",
            "review_content": "\nThis is a fabulous class to fill the Barnard PE Requirement. It is easy, fun, and doesn't involve breaking a sweat. If you're looking for a workout, it's not the place to go, but it's definitely entertaining and Sharon is a really nice teacher. She's friendly and she brings candy and prizes on the holidays.. Overall just a very pleasant lady! \nWorkload:\nTo pass... just don't miss more than 4 classes. \n"
        },
        {
            "course_name": "Archery",
            "review_date": "January 21, 2004",
            "review_content": "\nShe takes archery a bit too seriously-- she made us learn commands like \"Stand down your arrows!\" which was hilarious.  I thoroughly enjoyed this class though because you do get to practice shooting arrows right from the beginning.  An easy P for sure and fun-- just be on time. \n"
        },
        {
            "course_name": "Archery",
            "review_date": "January 04, 2003",
            "review_content": "\nSweet woman and great class.  Good for those who know nothing about archery, because after this class you will definitely know how to handle a bow and arrow.  However, not really for the advance, because the speed of this class is super slow and can bore you to death.  Easy enough class if you show up to it, easy P.  \nWorkload:\nShow up to class\n"
        }
    ]
}