{
    "prof_info": [
        {
            "prof_name": "Christopher Durning",
            "prof_id": 2030,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "E3120 Transport Phenomena II",
            "review_date": "September 16, 2010",
            "review_content": "\nProf. Durning teaches like he is talking to a bunch of professors. I don't think he and a lot of other professors understand that undergraduate students have never seen this material before. Expect Durning to use ppt the entire time, going through hundreds of equations and explaining what each term physically means. Yeah, he sounds knowledgeable, but he simply cannot explain material at an undergraduate level. So the message: the material is very disorganized and your best chance of learning the material is via the book (which is not exactly an appealing source).\nAs for workload/grading. Apparently, Durning thinks a B- is average. I don't know, but this is just ridiculous to me. If the material is already so hard, why does he think a crappy grade is some kind of reward? There are two midterms and a lot of homework. The midterms are hit or miss. I wouldn't say the problems are too difficult, but they are pretty random (considering the disorganized class material). So the message: no soup for you.\nTo sum up: I feel bad for anyone who takes a class with Durning.\nWorkload:\n2 midterms, homework is given biweekly usually. There was also a project, which was downright stupid (I am not exaggerating).\n"
        },
        {
            "course_name": "Transport II",
            "review_date": "August 16, 2006",
            "review_content": "\nChemical Engineers cannot aviod taking Professor Durning. He knows the material very well and comes to class ready to teach. His lectures consist of him standing in front of a computer screen pointing to things. I was shocked how that you can teach a problem solving class like Transport with PPT (in his own handwritting which is terrible)...enjoy kids.\n"
        },
        {
            "course_name": "Principles of Thermodynamics",
            "review_date": "April 14, 2004",
            "review_content": "\nFor all ChemE's:  this class, along with Transport I, will kill your GPA first semester of junior year, at least in my experience.  Thermodynamics in general is just a tough subject, and Durning certainly doesn't make it any easier.  He is a fairly nice man, although sometimes he comes off as an a**hole, but he just cannot explain the concepts very well.  The midterm and final basically determine your grade in the class, and both are fairly difficult, but made even more difficult by his picky grading.  My advice is do all the reading, all the homework problems, and most of all, do the practice problems he recommends before the exams.  Many times they come up on the real exam, word for word!  Text:  ok, somewhat difficult to read.\nWorkload:\nMidterm, Final.  Problems sets nearly every week, which are just checked for completeness (but make sure you do them).  Average grade in the class probably less than a B.  \n"
        }
    ]
}