{
    "prof_info": [
        {
            "prof_name": "Oded Netzer",
            "prof_id": 2745,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Marketing",
            "review_date": "January 02, 2009",
            "review_content": "\nOded taught Intro to Marketing and it was a great class.  very interesting and definitely applicable to the real business world.\nhe gave a 10minute break in the middle of the 3hr class.\nthere were only 12 classes total including the final(in class), but there are good guest speakers, and it is definitely worth going to.\n4 homework assignments that can be done in no more than 1.5 hours.\ngrading is:\nparticipation - 20%\nfinal-35%\ngroup project- 30%\nhomework - 15%\nWorkload:\nnot massive\nfairly easy grader\n"
        },
        {
            "course_name": "Intro to Marketing",
            "review_date": "December 18, 2008",
            "review_content": "\nHe's a really awesome as a teacher and as a person; the type of prof. that you hope you get.  The material is fairly straightforward and he presents it in a clear and organized way.  He gives you PPT print outs at each class and all you have to do is take a few notes on it.  This will help you breeze thru the final and the project.  Go to class and participate too, he likes that.   \nWorkload:\n4 or 5 easy HW assignments, an open-book Final, one final group project (pick your group carefully and it's easy) \n"
        },
        {
            "course_name": "Intro to Marketing",
            "review_date": "December 22, 2006",
            "review_content": "\nNetzer is very kind and sweet--I don't think any other teacher could make a three hour block class go by any quicker.  The class does not cover any of the artistic or creative sides of marketing, but is very informative in terms of getting into a consumer's head.  I am not a business student by any means, but I had lots of fun analyzing commercials and marketing strategies.  Netzer keeps class dynamic by showing lots of video clips and encouraging lots of class participation.  He doesn't take attendance, but says that you do not get a participation grade for those days you are absent (if he even knows who you are).  It's a really fun class, and it was not tough at all to get an A.\nWorkload:\n4 assignments that were 2 pages long, a big group marketing project at the end, and a final\n"
        },
        {
            "course_name": "Intro to Marketing",
            "review_date": "April 02, 2006",
            "review_content": "\nFun class, Oded is a great teacher.  He clearly loves the material.  He is willing to help you out, both in the classwork and in life -- he invites guests who work in marketing and then invites  a bunch of students to meet them for lunch after class - great opportunity for networking.  3 hours once a week can get a little annoying, but the 10 minute break in the middle is nice.  Homework is fair, and the final was easy.  There is a major group project - but I actually enjoyed that alot.  Oded gave a good overview of marketing and made the class fun\nWorkload:\n4 homeworks (not too tough, usually creative), an easy final, a major written project + presentation\n"
        },
        {
            "course_name": "Intro to Marketing",
            "review_date": "December 22, 2005",
            "review_content": "\nI loved this course. Oded was interesting and considering it was a 3 hour course kept my attention. He allowed a 10 minute break during the course to grab food or something which was nice. He was entertaining and always had a advertisement or movie clip to show during class. He brought in a few people to talk to the class who work in marketing. Overall I loved the class and Oded and his Netzer Crunch.\nWorkload:\n4 homework assignments, weekly readings (not entirely neccesary - you'll go over them in class), group paper and presentation, open note/book final.\n"
        }
    ]
}