{
    "prof_info": [
        {
            "prof_name": "Yvonne Woon",
            "prof_id": 3494,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 07, 2010",
            "review_content": "\nMs. Woon is a very nice, intelligent, and understanding person. She is a graduate student herself, so she knows what its like to be a student in Columbia and tries to make the work easier for everyone. She is very helpful and is ready to answer all your questions and to sit down with you during office hours to help with your paper. It does not mean that you can get away with writing whatever in your papers and expect to get an A. You can do well if you spend enough time on your papers constructing a believable argument and defend it. You can always ask help if you need it. The grammar is not that important for her (although you do need to spell check!), what matters is how and what you argue about in your paper. I did take some college writing classes before, but I am not a native speaker, so my English is not perfect, but I ended up with an A+. So, I think you can do well in this class. The lectures (or I should probably say discussions) were interesting and thought provoking. I loved reading and discussing other students' essays, because many would come up with pretty brilliant ideas! You won't regret if you take her class.\nWorkload:\nUsually it's 4 papers, but the last one she made optional to us (so sweet of her!). Not too bad. You always have about 2 raw drafts to submit before the final drafts are due, which helps you to get a feedback from her and your classmates and improve your paper. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 04, 2009",
            "review_content": "\nTo summarize from the get-go: She's a great professor. I came into UW dreading the course because of horror stories I had heard about the class' boringness. Not to mention having quite a long commute to my class. But I ended up loving it; it turned out to be one of my favorite classes of the school year, if not my favorite. \nShe's a young professor. Funny and entertaining, but clearly knowledgeable about the subject matter. She actually interacts with the students rather than just preaching writing skills and assigning busy work, and her essay corrections are thorough and helpful. Although there were sometimes dull-but-helpful writing activities, she usually came up with ways to make the class much more entertaining than it should have been. One such example is a class where in preparation for an essay, we had to debate about the color purple. No, not about the book/play/musical, just the actual color. One side was given the task of arguing for purple as a color epitomizing good, while the other had to portray purple as a color of all things evil and sinister, such as prunes. Needless to say, it was goofy, but fun. And it was actually useful, who wudda thunk it?\n(By the way miss, if you read this, was that not wonderful usage of an exhibit? :P)\nAmazingly given the subject matter, I actually did learn to write better. A lot better I'd say. I feel like I was able to make a transition from a high school writing level to a university writing level, which in the end is what the class is all about(given the name, \"duh\" lol). It's just nice that I could actually have fun while at it.\n\nWorkload:\nNot bad. Usually just small writing assignments aside from the four major papers (the last one ended up being optional for us w00t). Just don't slack on your work too much or miss more classes than you should. It's rude, and you'll be afraid.\nVery afraid....\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 30, 2008",
            "review_content": "\nThe first article that Yvonne asked us to read was on monsters. This was an exceptional choice, as are her other reading materials. I've talked to people who have other instructors for university writing and by comparison I get the feeling that Yvonne is one instructor who really cares about the improvement of our writing, rather than if we decide to become english majors. She takes time to help with our work and so far, she's been a good teacher.\nWorkload:\n4 papers, not bad\n"
        }
    ]
}