{
    "prof_info": [
        {
            "prof_name": "Jonathan Reynolds",
            "prof_id": 3923,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Literature and Methods of Art History",
            "review_date": "December 11, 2016",
            "review_content": "\nThis was one of my favorite courses, if not my favorite, I've taken at Barnard. Reynolds seems genuinely interested in, and even affected by, students' views. He is not pretentious but will tell you when you're wrong. His passion for art history, no matter what period, seeps into every discussion. He pushes you to write succinctly and clearly. Not only did this class provide me with both in-depth and broad perspectives of the art historical field, but it also taught me to consolidate information, summarize, and debate with classmates. I also appreciated how he made weekly papers due on Mondays and graded them by class time on Tuesdays; this provided structure and forced us to be prepared for discussion. \nReynolds epitomizes the \"quirky professor\" stereotype in the most charming way possible. He also e-mails you back almost instantly and makes time for office hour meetings. \nWorkload:\n2 long papers, 1 short paper per week \n"
        },
        {
            "course_name": "Modern Japanese Architecture",
            "review_date": "April 29, 2013",
            "review_content": "\nI took Professor Reynolds' Modern Japanese Architecture just to fulfill a general requirement, and went into the class prepared to pass/fail since it sounded like an intense class with mainly architecture/art history majors--and this class had nothing to do with my major.  That said, in my four semesters at Columbia, I can definitively say that this class has been my absolute favorite.\nThis was a class where I actually looked forward to each lecture.  Not only is the material incredibly interesting, Reynolds' lectures will keep you interested for the entire hour and fifteen minutes. Sure, you can take a Facebook break every so often, but for basically the entire lecture, he will keep it interesting and keep you focused.  His snippets of wry, somewhat self-deprecating humor will make your day, and you will fall in love with this man.  His lectures are based not on textbook photos or internet sources, but from buildings that he has photographed himself, that he found fascinating or significant, and will tell you short anecdotes about his visit and experience at the building site.  I'm not an architecture major so there isn't much I can say about the class for other architecture students, but all the designs we studied were absolutely gorgeous and its history incredibly rich.  From the beginning of the semester to the end, we really do see the evolution of urban Japan from a more traditional setting to a hybrid of western and traditional culture, to finally, having a modern architectural tradition of its own.  Reynolds will lecture the class through its evolution in a historical context, tying and connecting each design and architect to the rest of the world, or to future movements and trends.  Reynolds is so invested and passionate about this subject that his enthusiasm is infectious and he will pull you in.\nI honestly cannot say enough good things about this man.  If you go to his office hours, he will devote as much time as he possibly can to talk about whatever topic you wish.  I went two days before an essay was due with only a vague outline of what to say, and yet he took me seriously and discussed the topic with me at length.  Also, it speaks volumes that, the one time I happened to sit next to a prospie in class, she took out a piece of paper and pen and jotted a few things down that Reynolds was lecturing about.  I was so genuinely interested in this class that I ended up not needing to pass/fail--this is a class where the amount of work you put in seems to justly reflect in the grade you get (which is sadly not something you can say about so many other classes and professors...)\nSO basically, if you're considering taking this class, DO IT. You will not regret it.\nWorkload:\n50-100 pages of reading each week (you should do it, but can totally get away with not doing it until the papers or midterm--it will make lectures all the more interesting though).  \n1 midterm--mainly IDs and paragraph answers, with several short essays.  You will definitely need to devote a lot of time into memorizing (but that's expected of any art history class), but as long as you keep up with the lectures and take in what he is saying, the actual material is not too hard--just historic context mainly.\n2 4-5 page papers--one on just the reading and lectures; second one on a building in NYC designed by a Japanese architect. It was either the New Museum or the addition to the MoMA for us.\nIn class final.\n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "December 31, 2011",
            "review_content": "\nProfessor Reynolds' knowledge of Japan & its culture is SPECTACULAR. That being said, the atmosphere of the class was sluggishly passive. A huge disappointment, considering how expansive the material can be. \nWhat startled me was how Professor Reynolds was \"too\" particular on what he will/ not put on the exams. This was partly due to numerous (and often overlapping) questions raised \"too\" frequently by the class because the IDs were giving off the wrong impression or something. Anyway, I felt like my curiosity was being stampeded by a mob of rhinoceros as he'd inject, \"By the way this will NOT be on your IDs in the exam.\" Passing the exam isn't the reason I took this course. On the other hand, if you can construct together the bits-an'-pieces from class material to form a good, big picture, the exam should be not a problem at all. Listen closely to try to craft an impression of the major figures, artists, events & techniques so that you could easily personify a new concept.\nAnother thing that bugged me was how monotonous the lectures were. After all, there were readings assigned (and they are Good). Why not delve deeper into class material on behalf of those articles? The slides & oral presentations were far too manifest compared to the discourse going on in the readings; I would have been FAR more intrigued if Professor Reynolds had used them as discussion-starters. He would merely nod towards some major ideas in the articles which I thought was a huge loss.\nAll in all, I wish Professor Reynolds didn't emphasize that whole little stormy dilemma going on there, the IDs & the exam, because it somehow worked to raise even MORE questions from the class on the exam..I was sick of hearing about the exam week after week, and sick of hearing the same questions as well.\nWorkload:\nIn-class Midterm/Final (with IDs), 2 papers assigned well beforehand (one will probably require a trip to the museum), assigned readings (not exactly required, but as I've mentioned, mostly very intriguing). \nThe textbook is expensive but quite good; it was full of thoughtful ideas when writing my first paper. The Midterm & Final exams are fun if you're on top of it, and probably get those \"very\" particular IDs done beforehand.\n"
        },
        {
            "course_name": "Japanese Photography",
            "review_date": "May 31, 2011",
            "review_content": "\nProfessor Reynolds is a really nice guy with a deep enthusiasm for Japanese culture and art, but unfortunately this isn't enough to make him a stimulating professor. He never really asks provocative questions, steers seminar conversations (his usual response to comments is \"uh huh\") or challenges the class in new or exciting ways. His favorite word is \"helpful\" and you will hear it used in a variety of ways throughout the semester, ie. \"was this reading helpful?\" \"i thought this image was very helpful..\" I believe that he has a lot of experience and knowledge about the subject matter; maybe if he gave his students a little more credit, stopped babying them, and let us bite into each lesson, the class wouldn't just feel like a 4-month-long snooze. \nWorkload:\nweekly one-page responses, final presentation and paper\n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "March 13, 2011",
            "review_content": "\nHe was a great professor - energetic, funny, exciting, knowledgeable, and some times wacky. I could feel his passion for the material as he talked about each artwork, and it really helped me learn the information. His voice is loud and booming, so I found it easy to follow him through lectures.\nThere's a lot of material that he covers, so I found it quite challenging come exam time to learn all of it--title, date, location, background, etc.\nIt's a good class, but there's work a decent amount of work involved.\nWorkload:\n1 midterm, 1 paper, 1 final\n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "January 05, 2011",
            "review_content": "\nWow, i could not agree more with the other reviewers. This class was one of the worst I've taken at Columbia. Granted, I'm not an art history major but I have taken a fair share of AHIS courses and this was by far the worst! My first complaint would be the ridiculously expensive books, one was $150, the other $65. The first of which was completely useless as it basically describes the pieces of art instead of providing the full historical background, which is what Reynolds expects on the exams. Then there's his lectures, which I found to be completely all over the place and unorganized. We were consistently two lectures behind in the syllabus and he would start new topics five minutes before class ended. By the end of the semester we were cramming two weeks on the syllabus into one class. Part of the problem was that the course took on way too much, painting to architecture to sculpture over the span of thousands of years. This made studying for the exams a nightmare as we were expected to know a ridiculous amount of ID's. The material he chose to test on the exam was also peculiar; he spent four entire lectures on Edo prints and not one of them was on the final exam. The grading was also pretty rough, he basically expected us to know the full history of Japan politically, economically as well. If you are not a Japanese history major or art history major, DO NOT TAKE this class! Last, the final exam was scheduled for three hours, yet Reynolds enforced specific time allotments for each portion of the exam, which forced us to rush. The exam lasted about two hours and at the end of the two hours he rushed us out of there even though technically we had another hour to continue writing and correct our essays. \nWorkload:\nHeavy. Lots of reading and TONS of studying before the exams. The paper assignment is doable though, it saved my grade. Exams are super hard and graded harshly.\n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "December 15, 2010",
            "review_content": "\nProfessor Reynolds is an excellent lecturer. He's so engaged and so fascinated with the material that you can't help but be captivated as well. During the lectures he gladly accepts questions and never gives write-off answers like, \"it's complicated.\" He also regularly will follow up an answer by suggesting further reading ext. We were always a class or so behind the syllabus, and too often 3/4 of the way through the period he would announce, \"and now for the topic of today's lecture...\" \nThe exams were fine. He's really generous and accepts dates that are up to 25 years off. There was less material during the first half of the semester than the second, but as long as you kept up with the reading you'd be fine. His handouts are also really helpful; they literally list every piece (with it's creator, location, and date) that could possibly be on the exam. They made studying a lot easier. \nI shopped this class on a whim and decided that I had take it before the end of the first lecture. The material was so fascinating and Reynolds was such a great lecturer, I can't recommend him or the class highly enough. \nStory Time. \nThere was one paper that was assigned, to go to the met and write on one of the sculptures or prints in the Japan wing. I stupidly put it off until the day before it was due, and realized that I didn't have the handout that detailed the actual assignment. The met was closing in a few hours so I emailed the TAs and went downtown figuring that I could just take a bunch of photos and then figure it out later that night. Five minutes later, I get an email back from one TA saying that he was out of town and didn't have the handout. After wandering around the Japan wing for ten or fifteen minutes (it had now been several hours since emailing the TAs) I gave up and emailed Professor Reynolds. It couldn't have been more than 5 or 10 minutes before he emailed me the pdf and wished me good luck finishing the paper. What I got from this experience was: 1) Smart phones are amazing, 2) Professor Reynolds is a lifesaver, and 3) Don't put off starting your research paper until the day before it's due. \nWorkload:\nMidterm, 5-7 page paper, & final.\nA fair amount of reading, but nothing unmanageable. \n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "December 13, 2010",
            "review_content": "\nReynolds is a really nice, earnest professor, and he made this class better than I expected it to be. Although he coughed and wheezed his way through most of the classes (not his fault, admittedly), he was otherwise fairly entertaining to listen to and easy to understand. His lectures are clear and organized despite the fact that we fell behind the syllabus by about 2 days.\nMy one complaint is that his midterm exam (haven't taken the final yet, so I can't say much about that right now) was astonishingly easy at first glance, but was graded fairly harshly. Memorization of all the sculptures/buildings/prints/paintings and their dates isn't enough--you need to really understand the context and time period they're from and convey this understanding on the exam despite the fact that Reynolds only gives you about 10 minutes max. per essay question. \nFortunately, the papers are graded more leniently than the exams, so there's opportunity to compensate for a slightly lower midterm grade.\nIn summary, anyone looking for an easy global core course who doesn't know much about art history and the structure of art history courses probably shouldn't take this class. However, students with an interest in art can get something out of this class without overworking themselves, and can expect a decent grade.\n\nWorkload:\nA 3-5 page paper on an artwork at the Met, a midterm, a final, and ~25-50 pages of reading for each class. I tried to not do the reading, but Reynolds thinks his assigned essays and textbook chapters (which are mostly quite boring) are crucial. Hearing him say \"You should REALLY do the readings\" about a hundred times over the course of the semester did start to grate on me... but it did make me finally do the reading, and that paid off when exam time came around.\n"
        },
        {
            "course_name": "Arts of Japan",
            "review_date": "December 10, 2010",
            "review_content": "\nI really liked this guy.  He's knowledgable and enthusastic..  He gives you a taste of a variety of Japanese\nart forms over the centuries.  (He even does a little on calligraphy, gardens and tea ceremony, in addition to\nthe usual painting, scuplture and architecture. )   All in all, I found it a very enjoyable way to spend a hour and a quarter\ntwo afternoons a week.  Two caveats, though:  First, his speciality is architecture, and he devotes a fair amount\nof time to traditional Japanese buildings in this course, which I consider a plus.  However, the trade off is less\ntime for painting and scuplture.  Ideally you would take Reynolds' version of Arts of Japan and then the course\non Japanese Painting, and you will have been exposed to a lot of great art and interesting reading.  Second,\ndon't be misled by his jolly stage presence into thinking that he doesn't expect you to master the material from\nlectures and reading.  He wants you to enjoy the art, but he's serious about the scholarship.\nWorkload:\nAverage.  Midterm, final and a paper based on a musuem vist.  The main textbook is more worthy than fascinating,\nbut i'm told there's nothing better available.  As I mentioned above, don't think you can skip lectures or readings and\ndo well.\n"
        }
    ]
}