{
    "prof_info": [
        {
            "prof_name": "Abosede George",
            "prof_id": 3323,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "African History 1700-Present",
            "review_date": "May 14, 2013",
            "review_content": "\nFirst and foremost: Prof. George is an incredibly nice and easygoing professor. Her lectures are generally interesting and she conveys the material well. She often doesn't use time particularly efficiently (e.g. spending a lot of time on relatively tangential matters, dedicating a whole class to \"review\" mid-semester in which we basically replicated a discussion section with the whole class, etc.)\nThat being said, this is not a particularly \"rigorous\" history class, for better or worse. This is rather evident from the very title: it's such a broad subject that necessarily Prof. George picks and chooses specific topics she'd like to talk about, resulting in a very broad, introductory-level course in modern African history. Surprisingly, there also isn't very much reading, so again you aren't getting a whole lot of information. Assignments are minimal (see below), so you also don't write that much. \nFor these reasons, this is a fantastic course if you want a relatively easy and light course which will allow you to fit stories to names and have a general overlook of modern African history. If all you're looking for is to fulfill a requirement or something, this is a good choice. \nI would not, on the other hand, recommend this to more solid history buffs who are looking for a challenging, intensively informative or generally in-depth history course. They may well be disappointed.  \nMy TA was Sam Daly, a fantastic TA whom I highly recommend. Exactly what you want from a TA in a history class: very accessible, good at leading debate, knowledgeable. \nWorkload:\nVery light for a history course. \n1) Weekly readings, often less than 20-30 pages (with one exceptional week in which we read a full 200-page book, but even that was very doable as it was a light book). Section posting (in my section, you could pretty much post anything of any length).\nParticipation = 20%\n2) Two map quizzes, first one substantially harder than the second (the second was just a modern-day map of Africa in which you had to name the states). \nMap Quizzes = 10% of your grade for each one. \n3)One 3-5 page paper (there were supposed to be two but she made the second one optional mid-way through). I wrote about a movie we watched; again, very relaxed class.\nPaper/papers = 20%. \n4) Midterm and final, identical structure: she gives you list of IDs to know, plus an essay question in which the questions are known in advance. You need to memorize some years, otherwise as straightforward as it sounds. There's a review with student presentations on the IDs.\nMidterm = 20%.\nFinal = 20%.\n5) Extra credit: yes, there are extra credit assignments (also on the map quizzes and even the final), up to 6 extra points on your final grade. Just write a 2 page response on some Africa-related event, for 3 extra points each. \n\n"
        },
        {
            "course_name": "Introduction to African Studies",
            "review_date": "December 17, 2012",
            "review_content": "\nProfessor George is young, energetic, and a very good lecturer. I took this class to fulfill the global core/diversity requirement. I was initially a bit worried about the sheer amount of reading that was required as well as the \"two absences will result in a failing grade\" policy, but I stuck it out. The readings were, for the most part, interesting, and Dr. George makes sure that differing views are presented in each section. It's VERY important to READ THE THINGS IN THE ORDER THEY ARE LISTED ON THE SYLLABUS. She never tells you that, but I found that in a series of three readings, the first two will represent two different views and the last will represent a compromise between or a synthesis of the first two. That's KEY in understanding how to engage with the readings in this class.\nParticipation is a full 25% of the grade. If you have something to say: say it. There is also a museum trip and a paper, a map quiz (she provides any number of resources to help with this), a midterm (one page of handwritten notes is allowed) and a final (also one page of notes). The midterm was all essay questions. The final involved IDs and essay questions. This class is not \"easy\" by any stretch of the imagination, but it will challenge your ideas about Africa and give you a tiny insight into a part of the world that is largely neglected and misunderstood.\nWorkload:\nHeavy reading: you'd better do it and be prepared to discuss it. Trip to the Met and response paper. Map Quiz. Exams hinge heavily on reading comprehension, but possible essay questions are given in advance and notes--two sided sheet, handwritten--are allowed, so don't blow it. \n"
        },
        {
            "course_name": "African History 1700-Present",
            "review_date": "June 14, 2010",
            "review_content": "\nThis is the perfect class for History majors that want to fulfill their Asia/Africa requirement.\nI came into this class with limited background in African History. I got an A+ in the class because I did the following things:\n1. I went to every discussion section and almost every lecture (There's a sign in sheet and you only get 3 absences total if you want perfect participation points)\n2. I took notes on my computer (Lots of key terms/concepts on the final and being able to just search my files for the names made studying a breeze.) I did alright on the midterm final but got an A+ because...\n3. I did the extra credit (All you have to do is do a 1-2 page write up about an African History \"event\" you went to. You can do up to 3 and get up to 9 points on your grade total)\n4. I only watched one of the four movies we were assigned and wrote a halfway decent paper on that.\nThe class is a lot like a High School history class. But unlike a US or European version, it's not like many of us have taken a class on African History so it should still be interesting.\nProf George is great for a class like this. She's passionate about the subject, but also really enjoys went people call her out on stuff that doesn't make any sense and encourages discussion. Take this class if you want to learn about a new subject and get a good grade with relative ease.\nWorkload:\n20% 2 Map quizzes (Yes Map quizzes, look over a map for 30 minutes)\n20% Midterm (Got to bring a one page cheat sheet)\n30% Two 3 page response papers (I got points off for my first one being over 3 pages)\n10% participation (Just go and you'll get 10/10)\n20% Final (No cheat sheet, but given IDs a week before)\n"
        },
        {
            "course_name": "African History 1700-Present",
            "review_date": "April 14, 2010",
            "review_content": "\nThis was one of the best classes I took in my entire college career. \nProfessor George is young, attractive, intelligent and engaging. She hasn't been teaching for long but she definitely knows her stuff. Her lectures are pretty straightforward (seriously just bring a tape recorder, listen and enjoy). You can tell she is actively engaged in African history, she is always supplementing the course with interesting films, clips,etc. I wish I could take  a class with her again in a few years. I know she will be phenomenal!\nI may have gotten lucky but we had a good sized VERY DIVERSE class and I feel like everyone brought something to the table. Discussions were interesting and I was always learning something new from my classmates.\nThe workload is very reasonable and seems less than it is to me because the reading is fascinating and thought provoking. We have two short response papers , 2 map quizzes, a midterm and a final. Everything is very straightforward, we are given plenty of notice and the TA's are okay. We can also attend events and write responses to them for extra credit!\n(I wish the Professor George did the actual grading though because shes more concerned with concepts and contents than writing style)\nIn conclusion, I would recommend this class to everyone no matter what social or academic background. You don't just learn about Africa, you learn about the world!\nWorkload:\nreasonable and engaging!\n"
        },
        {
            "course_name": "African History 1700-Present",
            "review_date": "April 22, 2009",
            "review_content": "\nI really enjoyed this class. The only reason I took it originally was because it fit in my class and I found the topic interesting, but after taking this class I decided to major in Africana Studies and I have been incredibly happy with the decision. Professor George was a great lecturer and would talk to us after class if people stuck around even for like ten minutes (mind you, this wasn't office hours). I took another class of hers the next semester and was equally happy and she seems to have improved even more as a professor since then. \nI learned a lot from this class and came out seeing the world in a more nuanced and engaged way. Almost wish I could take it again just to see what I would get out of it a second time around.\nWorkload:\nReadings were interesting and engaging and I always felt like the readings were engaging, thought-provoking, and challenging but not in an overwhelming way. The midterm required some studying (don't they all?) but she graded it fairly. The quiz dates were given in advance and gave us lots of time to study it. I also had a great sectional in this class and my TA was engaging, thoughtful, challenging, and supportive and it was always worth it going to the sectional. \nOverall, workload about the same of other intro classes but more engaging and worthwhile than the average intro class.\n"
        },
        {
            "course_name": "Intro to African Studies",
            "review_date": "April 22, 2009",
            "review_content": "\nI loved this class. It was challenging and had great readings. The professor blends historical/fact-based readings really well with different types of literary readings based in historical concepts, events, and movements we talk about. I came out of the class feeling much better read, having learned a lot, engaging with old ideas in new and exciting ways, but not overwhelmed or exhausted from the course. I also went up to Prof George multiple times after class to talk about things we'd talked about and she would offer really great insights and was always receptive to talking. She also wrote me a great recommendation to a very competitive program I got to and helped me get accepted! \nOverall I definitely recommend George and this class.\nWorkload:\nMedium. Some times there was a higher amount of reading but it wasn't unmanageable by any means. Often when there was a larger reading assignment it was pretty light and really interesting/engaging literary stuff like a popular novel. Some other people talked about this class as if the reading were ridiculous but I think some of the reviews may have been recent high school grads who weren't used to college yet (not to delegitimize their opinions, but college is really different than high school and can surprise people)\n"
        },
        {
            "course_name": "Introduction to African Studies",
            "review_date": "February 02, 2009",
            "review_content": "\nWay too much reading and her grading style was sporadic and very random. That being said it is very interesting and she is extremely personable and engaging.\nWorkload:\nheavy :(\n"
        },
        {
            "course_name": "Intro to African Studies",
            "review_date": "July 26, 2008",
            "review_content": "\n(Fall 2007) This was George's first semester teaching, so there were a lot of kinks in the class. She completely switched up the style (lecture to discussion) mid-way through the semester and it was very apparent that she didn't know where she was going with the class overall.  A paper assignment (which she made up last minute) consisted of scanning ALL newspaper articles for a year of one publication for any mention of Zaire/Congo and then writing about what the coverage/lack thereof meant. It was completely mundane.  Despite the flaws in the class, which I imagine could be worked out with experience, George was just incredibly unlikable.  I went to office hours a few times with clarification questions and she has the distinct ability to make you seem like a complete idiot in discussion. Maybe she just didn't like me personally, but then that is just another reason I will never be taking a class with her again. \nWorkload:\nLoads of irrelevant reading, three papers, geography test of Africa, final. \n"
        },
        {
            "course_name": "African History 1700-Present",
            "review_date": "April 22, 2008",
            "review_content": "\nI was a little worried about taking this class after looking at the only review she has.  I have to say I'm not a huge fan of the way that she lectures, it's a little slow and kind of allows your mind to wander.  Other than that I really enjoyed this class.  Don't get me wrong, it was definitely a lot of work.  At least several hours of reading for each class plus a 3 page response paper every week is no piece of cake.  She is also a fan of the map quizzes.  But I never felt like learning all of this information was useless even if she did not actually ask questions about all of it.  Overall I really enjoyed this class, and it really isn't hard to do well.  Just read and study hard!\nWorkload:\n1 midterm that you really need to study quite a bit for (I mean you're covering a lot of information so this is granted), weekly 3 page response papers, reading every night, 1 final\n"
        },
        {
            "course_name": "Introduction to African Studies",
            "review_date": "December 10, 2007",
            "review_content": "\nSo she's right out of grad school, so I should give her the benefit of the doubt, but, seriously. Hardest/worst class this semester. You can totally tell that she really had no idea what was going on. She constantly changed the syllabus, cancelled our first paper (a blessing, but really, it's probably because she couldn't think of a topic), and expected WAY too much from us. I took the class because I knew NOTHING about African studies/history. I felt totally out of place in the class and totally lost. The readings (ridiculous) were way too advanced for the class and often times irrelevant. The structure of the class was intended to be a lecture, which it sometimes was, but she turned it into a more discussion based course, probably because she didn't know what to do some days. \nbut I can't be terribly mean; she's really nice and many times understanding. she'll go over paper drafts (although sometimes lazily) and once when we complained about the impossible amount of reading, she lessened it a little. \nI'd say give her time to get her act together; once she stops floundering, she'll probably be an excellent professor.\nall in all, however, don't take the class.\n\nWorkload:\ninsane/pointless. too much reading. sometimes 100pgs a class, sometimes entire books for one class. three essays, all made up at the last minute, 6-8pgs, not too bad. no midterm, final made up like, last class and covered irrelevant material/things I had to wikipedia because they were never covered in class.\n"
        }
    ]
}