{
    "prof_info": [
        {
            "prof_name": "Lindsay Piechnik",
            "prof_id": 3267,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Math",
            "review_date": "July 13, 2013",
            "review_content": "\nThis professor was awesome.  I had not taken math in many years (the highest level I had done in high school was pre-calculus)  so I was in need of a refresher before entering pre-calculus and then calculus in the fall.\nNot only was she entertaining, but she taught a very thorough class.  Nothing felt \"rushed\" despite the fact that the whole 6 week session is rushed.  She times out the class well, and creates a collaborative class room with well managed participation so no single person's \"issue\" would overwhelm the lesson.  I personally found her sarcastic tone to be hilarious, and I appreciated when she would call me out for being \"WRONG.\"  She did not entertain \"short-cuts,\" preferring that we understand \"why.\"  I left feeling a little bummed about my high school math education--I swear I didn't learn HALF of this...they just let me slide by with A's through rote memorization. \nYes, the course is non-credit--but I feel it is definitely worth it.  If you can at all afford it, are not lazy, and want to do well in your future classes, swallow your pride and enroll in \"basic math.\" The first few lectures left me questioning if I had made the right choice (the syllabus covers everything starting from the beginning) but you will be thanking yourself when you get into pre-calc and you are able to hit the ground running instead of re-learning concepts or wasting time reviewing rusty skills. This is especially true if you are taking pre-calculus during 6 week summer session. The way I see it, you can suffer and stress (and probably do worse than you would otherwise) in future classes, or just do the review offered in this course. Your major options and overall GPA earnings will expand.  \nAnd again, having Professor Piechnik at the helm will make the whole experience much less torturous.  \n\nWorkload:\nWe had a reasonable amount of homework, went over a chapter a day, had in class quizzes, a midterm, a final, and a small presentation.  No busy work--just drills.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 27, 2009",
            "review_content": "\nProfessor Piechnik is a very good Calculus professor.  She is very clear in explaining the concepts and is lively enough to keep you awake and interested.  The course material covers very basic limits through the applications of integrals.  Weekly homeworks from the textbook helped reinforce concepts and a few pop quizes thrown in throughout the course makes sure you know the material.  There are two midterms and a final.  If you keep up and understand the material, it is pretty easy to do well.  The tests are not meant to trick you, but rather to make sure you know the materials.  If you don't understand the material, she holds several office hours and extra help opprotunities.  Overall, Piechnik a very good teacher who is organized, clear, and truly wants to see her students succeed.  \nWorkload:\nApprox. 10 homework problems due at the beginning of each class.  \nGrade\n*20% homework\n*20% quizes\n*20% midterm 1\n*20% midterm 2\n*20% final\n"
        },
        {
            "course_name": "Basic Math",
            "review_date": "August 04, 2009",
            "review_content": "\nLindsay is an excellent teacher. Her approach is organized and methodical. She speaks and writes clearly. Her charisma will keep you awake through a long class period. She is personable, genuine, and supportive of her students.\nWorkload:\nCondensed summer course covered a large amount of material in a short time frame. Lots of homework prepares you well for the exam and for Pre-calculus.\n"
        },
        {
            "course_name": "Basic Math",
            "review_date": "July 06, 2009",
            "review_content": "\nFor any Columbia students whose majors require Math specifically Calculus and whom haven't been in a Math class in a few years or bombed the Math placement exam, this class is required. Unfortunately the  2 credits don't count towards your degree so you have to bite the bullet and pay for this pass/fail class.\nNow onto the class itslef... Lindsay turned out to be a pretty good teacher. I didn't like her or her sarcastic sometimes cynical- and condescending-sounding remarks and gestures during the first couple of classes. She's a PHd student and clearly didn't have lengthy teaching experience. However after the first week, she proved to be more helpful than harmful. She'll answer questions regarding the previous night's homework before she begins the lesson for the day and always informs us ahead of time of her office hours before and after class when she's available to help. During the midterm exam she brought us little brown paper bags with goodies in them because she mentioned a past experience of failing an exam and finding that after taking it again, the process of opening up a piece of candy or snack help her relax and even remember the math processes a little better. How sweet!\nShe even did the same thing for the final exam. \nSo moreover I will say that she was helpful and committed to helping the class gain understanding of all the processes she taught. Her attitude could take some fine tuning but after the first week or so it softens a lot. I took this class in the summer so we met Monday through Thursday for an hour and a half for 6 weeks.\nWorkload:\nHomework every night due at the beginning of class, random quizzes once or twice a week (we had 9 in total), a midterm and a final\n"
        },
        {
            "course_name": "Basic Math",
            "review_date": "November 11, 2007",
            "review_content": "\nLindsay is a great teacher, with an excellent, clear cut method of teaching.  She genuinely cares about the success of her students.  She makes makes math methodical and understandable.  If you have the chance to take her class, do it!\nWorkload:\nSummer class so HW that was due every day, but if you did the homework, tests should be pretty straightforward.  VERY FAIR.\n"
        }
    ]
}