{
    "prof_info": [
        {
            "prof_name": "Anna Frajlich-Zajac",
            "prof_id": 2091,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Mickiewicz",
            "review_date": "April 02, 2014",
            "review_content": "\nProfessor Frajlich is one of the best teachers I've ever had in Columbia. I have already taken a couple of her literature classes in the past few years, and I greatly enjoyed all of them. Like the previous reviewers said, she is very knowledgeable and passionate about Polish Literature, so her lectures are very interesting. There is quite a long list of readings for her classes, but it's very manageable. She is also very helpful and understanding. \nThere are no exams in this class which is great. You'll need to write two essays, and your grade will be pretty much based on these papers plus weekly postings on the courseworks and/or in class participation in discussions. \nWhether you're looking to satisfy your literature requirement, or you're just trying to find an interesting elective course, look no further :) \nWorkload:\nWeekly postings, participation in discussion, two essays\n"
        },
        {
            "course_name": "Best Sellers of Polish Prose",
            "review_date": "May 03, 2005",
            "review_content": "\nThe class had a very intersting reading list, and I enjoyed all of the books we covered. Professor Zajac did a lot of research about the period, authors, and scholarship on all the books we covered. She was very open to our own impressions and opinions.  Overall this was a very good class for anyone interested in Polish literature, or in literature of the 1930s.\nWorkload:\nRead a book per week or two, submit a journal entry about each book covered, 4-5 after class movie screenings, a 10-15 page final paper on a topic of your choice.\n"
        },
        {
            "course_name": "Mickiewicz",
            "review_date": "May 14, 2004",
            "review_content": "\nI remember someone making fun of this class (or at least it's name) in the Spec. They obviously never took it, since both the class and Professor Zajac are great. First for the prof- she's very well read and into her stuff. Mickiewicz is prolly her favorite writer, so this is a great class for her to teach. She is very lentient and forgiving of things like not doing readings up to speed, lateness, absence, etc. She treats everyone like the adults we are, and wishes more people would share their ideas in class (not pompous just -for-participation-credit ideas like some people in CC mind you - REAL ideas hehe). Now for the class - Mickiewicz is a great writer of the romanitic period. Outside of Poland and slavic-studies, he is not well known, and it is a shame. He was well-loved and respected by many, like Pushkin, who was his life-time friend. I enjoyed doing the reading for this class, which is a first for me. It is really interesting to see romanticism from a different, more eastern perspective. The link between nationalism/national consciousness and Mickiewicz's works is also really pretty cool to study. \nWorkload:\nPoems, a novel, a play, and an epic - well spaced out. One or two film screenings. In-class presentation (10-15 min) about a side topic (easy). Final (2 essays, some IDs), and final paper (5-10 pages, she helps a lot). \n"
        }
    ]
}