{
    "prof_info": [
        {
            "prof_name": "Cary O'Brien",
            "prof_id": 1155,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "19th-Century Novel In Europe",
            "review_date": "January 10, 2004",
            "review_content": "\nBy chance, Cary ended up grading both my papers and was an enormous help. While others in this class walked away irritated with B's for no apparent reason, I spent some time with Cary after he graded my first one and before I submitted the second, and he took considerable time highlighting for me the technique and content that make up an A English paper. For a novice sophomore, that kind of help is crucial. The class was great and the methodology I took away from it even greater.\nWorkload:\n2 papers and a take home final (time consuming, to say the least)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 03, 2003",
            "review_content": "\nHe loves hearing himself talk.  We actually had a quiz that included a question regarding his favorite pool hall in the city.  His teaching ability is not on any kind of impressive, or even acceptable, level - yet if one already knows how to write he acknowledges it and grades accordingly.  Not too bad, although don't skip class because that is the one thing that will upset him.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 06, 2002",
            "review_content": "\nCary is one of the best teachers I've had so far at Columbia. He makes class discussions interesting, and creates a real sense of comraderie among the class. The first 20 minutes of every class is spent discussing random topics having nothing to do with writing, such as his plans to go to law school (after getting his PhD, yikes!), rap music, and the show \"Law and Order\" Make sure you find out what his two dogs' names are, b/c he'll probably put it on the final as extra credit. Oh, and also, don't worry if he decides on a whim to give everyone D's. He'll joke a lot about getting Fs (or in reality a C- b/c Columbia doesnt have the guts to fail anyone in first year writing) but in reality he's a pretty fair grader. Learn the formula he wants for each paper, work hard, attempt to do something clever or original with your writing and you'll be rewarded. Highly recomended.\nWorkload:\nUsual L&R; workload.\n"
        }
    ]
}