{
    "prof_info": [
        {
            "prof_name": "Mark Seto",
            "prof_id": 5605,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2010",
            "review_content": "\nI don't think there are enough words to describe Mark Seto's awesomeness. Honestly, I was one of those people who didn't expect to do too well in Music Hum. I had no background in the material, and my understanding of the basics is still mediocre at best. But Mark understands this. He understands that this is a basic course that everyone is expected to pass, and so, he treats it with lightheartedness. Obviously some people are more informed on the material, and this led to interesting discussions, but people also said a lot of dumb things. He always took these well, though, and actually managed to try to make some sense of them. Aside from that, he also contributed historical perspectives and always raised interesting and complex ideas that added to the discussions. He's really funny, and like the previous writer mentions, well dressed.\nSeriously, this man can do no wrong. He's too kind, and well, I'd gush more about him but just want to make this nice and simple: take his class, if you can. \nWorkload:\nEasy. Short, typical readings/listening; two concert reports; a few writing assignments (like two); midterm/final. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 29, 2009",
            "review_content": "\nMark is the man. How to describe him? Hmmm. . . If I were to host a swanky cocktail party, Mark would be at the top of my invite list. Not because he's a snob (he's definitely not!), but rather because he's incredibly refined/sophisticated, pleasant, and would probably get along with virtually anyone. It was almost irritating how he came to class every session impeccably dressed and prepared. He's clearly a seasoned Music Hum instructor and I was always amazed at how diplomatically he handled the ridiculously stupid comments some people made in class. While I may seem a little bitter about how perfect a human being Mark seems to be, I nonetheless feel guilty writing this because he is sooooooo nice and i had such a great time in his class! Music hum is frustratingly basic for anyone that knows anything at all about classical music, but Mark made the best of it. It's a broad survey course so we couldn't go very in depth, but Mark did an absolutely fantastic job highlighting the important (and interesting) points, comparisons/contrasts between composers and genres, etc. I learned so much from him and he also made class fun with well chosen jokes and the occasional simpsons reference! Definitely recommend!\nWorkload:\n2 concert reports, in class midterm and final, occasional (very) short listening/written assignments graded on check/check plus basis, class participation is important!\n"
        }
    ]
}