{
    "prof_info": [
        {
            "prof_name": "Peter Park",
            "prof_id": 2217,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry Lecture Fall 2005",
            "review_date": "January 19, 2005",
            "review_content": "\nI hereby swear to solemnly take any class Peter Park TAs- even if it is urban street polo on rollerblading horses because I am certain that he would be able to teach it to me.  I was failing Orgo and B'ed it at the end only because Peter Park helped me through zen email assistance and cheerleading pound the means of the last two exams.  I would marry the dude If I could-- his handouts are terrific, he holds extra office hours before exams (EVEN ON WEEKENDS). HE WILL ANSWER YOUR QUESTIONS IN THE MIDDLE OF THE NIGHT WHEN YOU SEND DESPERATION EMAILS.  Don't be stupid and take another orgo class and pay some tutor $50 an hour to help you- take any class Peter ta's and reap the benefits of having him as your tutor.\n\nWorkload:\nhard quizzes! study study study.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "January 03, 2005",
            "review_content": "\nPeter is the single greatest TA in any university in any country.  Period.  I cannot express enough adulation for him.  His lectures are clear, his handouts are great, he makes himself available to his students all the time, and he has more patience than anyone.  If he is TA'ing any class, TAKE THE CLASS, just for him.   He's worth it!\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 28, 2004",
            "review_content": "\nPeter was truly remarkable.  I have never seen a TA work as hard as he did.  The guy took notes on his Tablet PC then posted them online for the class.  He drafted comprehensive review documents summarizing reactions, concepts and gave out sample problems.  He didn't have to do any of that.  The guy cares, plain and simple, and is more than generous with his time, scheduling additional office hours he wasn't required to.  He lobbied Katz to move back an exam (successfully) because he felt the class hadn't had enough time to prepare.  He made so few errors that it was noteworthy during a review session for the Final that he actually made a small mistake - we all thought, hey, this guy's human after all!  He taught far more than his fair share of class pre-exam review sessions and was extremely capable.  Truly a star TA.  I've seen none better.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 26, 2004",
            "review_content": "\nHe was the greatest TA ever.  He helped us through everything.  Plus, he had very nice handwriting.  His notes were thorough and clear.  He did the most work of all the TAs.  I think he's even better than Prof. Katz.  One day, he will become a great teacher.\nWorkload:\nhard quizzes\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 22, 2004",
            "review_content": "\nPeter is the sweetest TA you could find for orgo.  He is helpful, smart, and has a good sense of humor.  Not only did he give us answers to difficult homework problems during his office hours, he also took computerized notes on his laptop in lecture.  And boy I must say the guy writes like a computer font.  The notes he takes are so great that it really makes your notes pale in comparison.  In the end I just printed them off courseworks and threw my notebook away somewhere in the corner.   As for his recitation he turns what the professors says into things that make sense by giving us excellent handouts on the topics taught in class. His lectures are brief, concise and to the point, which is something I canÂ’t say for Professor Katz.  He even held extra office hours on Saturdays to help us do our hw.  From what I can tell, he really does want his students to do well and learn the subject.  He is one of the best TAs in the chemistry dept, I only wished he would TA for Orgo II.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "November 16, 2004",
            "review_content": "\nIf you take Orgo, please please please do yourself a favor and choose Peter as your TA.  He is wonderful- he answers questions quickly, holds extra office hours when you need it, and knows what you will have problems with even before you know it.  His handouts are awesome, he explains things clearly- usually the smartest TAs aren't always the best ones- but by golly, Peter is both smart and terrific- highly highly highly recommend him.\n"
        }
    ]
}