{
    "prof_info": [
        {
            "prof_name": "George Edwards",
            "prof_id": 1350,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "May 07, 2003",
            "review_content": "\nOnce you figure him out, you'll come to realize that you can get more out of his course than you might have initially thought.  He is a rather shy fellow, so sometimes conversations are a little awkward.  However, he is quite obviously a brilliant man who knows countless interesting facts about whatever score you hand him, so go to class and participate in discussions about the music you're analyzing.  You WILL become better at analysis.  There's no work involved in this course, so simply sit back, let him play each piece for you a couple hundred times, and appreciate the music (and the course itself) for what it is.  \nWorkload:\nWe did one Schubert-style waltz and a final project consisting of whatever we wanted to do.  Very light.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint I ",
            "review_date": "April 29, 2003",
            "review_content": "\nI like George.  He is a very nice guy despite his absent-mindedness.  Once he started writing on the dry-erase board with a big black permanent marker, and when he couldn't erase what he had written said \"Oh, it wont erase!\" and kept on writing.  He is the director of undergraduate studies, but not too much help... Luckily the music major is pretty straightforward in terms of requirements.  Class can be fun, it can also be boring.  You could say that about almost every course at CU... as for grading, well, he is a composer, so if you knock off a final assignment (like a Goldberg variation) without putting much feeling into it he'll most likely be aware and grade you down.   \nWorkload:\nnot much at all...\n"
        },
        {
            "course_name": "V3321-V3322 Chromatic Harmony and Counterpoint",
            "review_date": "January 28, 2003",
            "review_content": "\nI have to correct what I said before about the class being an easy A. I said that before I got my grade. As it turned out, most of the class ended up in the B range. God only knows how he figured out the grades.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "December 15, 2002",
            "review_content": "\nI don't know if it would be fair to call Edwards a bad teacher, as he made no attempt at teaching the entire semester. (You can't judge that which doesn't exist!) After a diagnostic test that the class didn't do so hot on, he gave us this bizarre lecture about how we should have been practicing our counterpoint every day over the summer. We then proceeded to spend the rest of the semester reviewing stuff from Diatonic. What this meant was that we would spend the entire class doing exercises--stuff that one would think would be, oh, I don't know, homework--while he and the TA walked around and checked them. Then one day we broke from that mold and discussed a Bach piece, he would literally stand there for 20 minutes waiting for someone to talk rather than guide the discussion. Oh, and best of all, he canceled class for the entire last month of the semester (!!!) so we could work on our final projects. This would lead one to believe that the final project was very difficult. One would be sadly mistaken. You had the choice of either a composition or an analysis. The composition was just writing a new Goldberg variation, something anyone who's been through Diatonic could do in a couple of hours. As for the analysis... well, when he handed it out in class, he said simply, \"analyze this piece.\" But when I went to his office hours and asked him what exactly it was he wanted us to do, he seemed unable to provide me with any guidance. \"Well, do you want a paper?\" \"Yes, you could write a paper.\" (awkward pause) \"Um, OK, thanks, Prof. Edwards.\" This class is a pathetic, bewildering waste of tuition money. Edwards is the adviser for the department, so it's not a good idea to switch out midyear unless you have a scheduling conflict--so TAKE CURRIER BOTH SEMESTERS. On the upside, Edwards is the nicest guy in the world, always available to meet with students, and if you're looking for an easy A, they don't come any easier...but damn, I feel ripped off.\nWorkload:\nZilch. \"Homeworks\" were just revising what we'd already done in class and making it look pretty.\n"
        }
    ]
}