{
    "prof_info": [
        {
            "prof_name": "Ronald Gregg",
            "prof_id": 13515,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Queer Cinema",
            "review_date": "October 16, 2019",
            "review_content": "\nReally amazing seminar. Ronald Gregg is a great discussion facilitator and always comes to class with detailed notes to share. The films on the syllabus were carefully curated and super interesting. The workload in terms of readings are average. There are three papers, all of which are 5-7 pages each. He’s very personable and dedicates a lot of time towards the class and students. I highly recommend taking a class with him. \nWorkload:\n^see review\n"
        },
        {
            "course_name": "Blockbuster (Intro to Genre Study)",
            "review_date": "January 05, 2018",
            "review_content": "\nThis class was an absolute joke and by far the fluffiest/BS class I've EVER taken throughout my entire educational history. \nGregg is a professor that unfortunately does not belong at an institution at Columbia. He has no clue how to deliver a good lecture. His lecture style is just him standing behind the podium and reading off his lengthy notes non-stop... & his visual aid (PowerPoint) barely has any points on it to complement what he is saying. It was thus so easy to not catch what he was saying once you missed a little halfway. You will definitely see tons of people doing their own stuff during the lecture (that is if they even come in the first place). Also, I'd like to point out that sometimes what he is lecturing on feels so forced - e.g. he makes it seem like the majority of the films produced post 9/11 were because of 9/11; how certain films are feminist films even when they really aren't. In other words, I feel that he tried to force drawing observations from the films even when the link between them is really, really weak. Attendance for class is taken occasionally. \nThis class also had a mandatory discussion session ran by TAs (for undergrads). The discussion session was even worse - there was no agenda for the discussion session other than to discuss about the film watched during most weeks. The discussion session was maybe about 5 minutes legit and the other 55 minutes stretched out BS. It's very common for my classmates to skip the discussion session (even when it is graded - 20%!). I remembered like half skipped the 2nd discussion session. The census among peers is that it is an ABSOLUTELY-A-WASTE-OF-TIME-I-PROMISE-YOU! Never had more meaningless discussion sessions. I'd bet that no one would even attend it if it wasn't graded. Sorry that I'm kinda repeating my point but if what I've said doesn't tell you the quality of the discussion session, I don't know what will. Just hope that you have a good TA to make it bearable.\nTL;DR: do NOT take this class unless you want the fluffiest ever possible class with an incompetent but very nice and approachable Professor. I can guarantee you that you won't learn as much (if any at all) as what you think you'll. Blockbuster is not Gregg's speciality. His speciality: LGBT-related. Maybe his LGBT film class/other classes are better taught, idk.\nWorkload:\nMuch lighter than other 3 credits courses\n2 Papers (25% each): 5-7 pages (double-spaced) for each paper. Instructions for papers were given about just 5 days for the first one & probably about 1.5 weeks (after complains about the timeliness of the first) in advance for the second one IIRC. The papers have nothing to do with what was taught in class. They are more like research papers. Need to reference course readings for just the 2nd paper.\n1 Final (30%): 3 essay questions in about 3hrs - related to what's \"taught\" in class/discussed in the discussion section. Referencing course readings expected - the more, the better. Open book/notes. Use laptop to type essays out.\nDiscussion (20%): The more BS you can talk about, the better. Absolutely waste of time. \nTAs (for undergrads) have 100% control over your grade. They grade everything. So if your TA sucks, good luck.\n"
        }
    ]
}