{
    "prof_info": [
        {
            "prof_name": "Monica Miller",
            "prof_id": 841,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "April 15, 2010",
            "review_content": "\nAs someone who is fascinated by post-Modern lit, I found this class to be a godsend. But, even without a particular interest in the period, something to consider is that every author on the reading list (Pynchon, Didion, Morrison, Bellow, and Nabokov, etc)  shaped the contemporary American literary canon in innumerable ways, and, as a result, will be discussed in most other Lit classes. With that in mind, I would recommend this course to anyone remotely interested in a full immersion into the American social and literary climate of the post-war era, enjoying some of the most iconic works in recent history, and generally becoming a more educated person.\nProfessor Miller is priceless, pure and simple. Why she is not a \"gold nugget\" professor, I have no idea. Her ability to integrate the works into the social framework of the era, facilitate her students immersion into the text and develop a passion for it is something that is incredibly rare to find in English professors both at Barnard and Columbia. Additionally, she makes the themes of the literary movements pertinent to today by discussing the legacy of each work in literary and pop culture today. Also, she is genuinely one of those professors that inspires exploration of the works as they pertain to other fields and other artistic mediums. She also adds spice to lecture by adding a rare witty personal anecdote that actually serves as a nice break from the discussion, without jumping into a tangent like some of her colleagues seem to find an insatiable desire to do on a frequent basis. Also, the note some other rater had about her reading from lecture notes was not applicable to my class, and I find it hard to imagine that a woman as accomplished and brilliant as Professor Miller would ever rely on a lecture outline. \nBasically: TAKE IT. If you're an English major, you'll get a new perspective on the these vital texts. If you're not, you'll have a more in-depth understanding of why these texts matter both in the literary world and the world at large. \nWorkload:\nTwo 5-7 pg papers, one final. \n"
        },
        {
            "course_name": "Black Stereotypes -- Senior Seminar",
            "review_date": "June 30, 2004",
            "review_content": "\nInstructor Miller is extremely intelligent, and knows how to camouflage her true feelings about her students.  Basically, she is fake.  Once you get on her bad side (for whatever hallucinatory reason she imagines-you will never know why), be prepared for her eye rolling and blatant staring while in a class.  \nBarnard is chock full of professors who present extremely thought-provoking material and innovative ideas; however, Ms. Miller does not cut it; her self-consciousness is a tell-tale sign that she is very aware of her intellectual inferiority amongst masterminds.  Most of the ideas she presents to undergraduates have been published even before her time--needless to say, she underestimates her students.  And if you happen to have more brilliant ideas than Miller, you will surely be penalized.  \nAt times she tries to conjure up ideas of her own, but students usually get lost and confused by the 50 dollar words she uses in an attempt to mask the shallowness of her concepts.  Mind you, she would admit that even she doesn't understand what she's tried to explain.\nIn this particular class, most of the material selected was mediocre.  At times class discussions were manifestations of her own identity crisis, thusly the course was comprised mostly of books on \"passing\" and biracial issues.\nOne great thing about the class was that it attracted many wonderful students, and because of this fact alone, discussions were terrific.  \nIf you are looking for a Professor (not an Assistant Professor--as she is), who is unbiased and handles students and material fairly, might I suggest Professor Robert Hanning's 'Race and Racism' course.  You will not be disappointed, and your grades will not suffer because of the instructor's personal distress.\nWorkload:\n1presentation, 2 papers, 1 term paper, 7 to 8 novels, supplemental material that is often not discussed in class\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "May 01, 2004",
            "review_content": "\nI love Monica.  So much.\nShe is a ridiculously intelligent and genuinely compassionate.  I always looked forward to class and it saddens me that she is taking some time off.  When she returns (Spring 2006 I believe), I'll take anything she is associated with.  She's that good.  Classes were challenging (in a good way), engaging, and enlightening.  Everything I thought college would be (minus the beer and stuff...)\nWorkload:\nthree papers (about 5 pages each), reading,....not bad at all\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "April 05, 2004",
            "review_content": "\nProfessor Miller is one of the best professors of English at this university.  Her passion for the subject is evident with each lecture; her deep knowledge of the texts is clear by each of her articulate discourses.  Outside of class, Professor Miller is always willing to meet with students, either to discuss course-related subjects or other, more general, topics.  \nI highly recommend her lecture(s) and seminars.  The course material she selects for each  course are interesting and engaging; the assignments are fair and provide ground for further development of text-interpretation or creative space for deep analysis.  They are definitely courses worth taking--with a great professor.   \nWorkload:\nFair for an English course.  2 papers, online postings, and a final exam.  Course assignments are graded by a TA and Professor Miller. \n"
        },
        {
            "course_name": "The Americas",
            "review_date": "November 09, 2003",
            "review_content": "\nMonica Miller is not only brilliant, but she is kind, a fair grader, and a sympathetic listener. She's one smart cookie and a total badass, in my opinion. I loved this seminar, and I hear her lectures are great, too.\nI've spent many an office hour bothering Prof. Miller for help with various papers and also just to discuss the books we read in class---she's always patient and willing to help. So go to her office hours, people, and take her classes. This one is a jewel.\n\nWorkload:\nmoderate; she is not necessarily an easy grader but she does take into account how hard you're trying even if you're not a literary nerd\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "November 24, 2002",
            "review_content": "\nProf. Miller is very personable, evidently intelligent, and extremely articulate. Her class, however, consists of listening to her read from a long (albeit very well-written) set of lecture notes from which she doesn't deviate and sometimes doesn't even really look up. The class has a great reading list if you're into postmodern lit (Ellison, Nabokov, Morrison) but I came out feeling like, for all the articulate phrases I had taken down in lecture, the treatment of the novels was somewhat cursory. Still, however, a class IÂ’d recommend. \nWorkload:\nnot too bad.. weekly readings, two 4 pg. essays and one 8 pg. essay, final\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "November 24, 2002",
            "review_content": "\nProf. Miller is very personable, evidently intelligent, and extremely articulate. Her class, however, consists of listening to her read from a long (albeit very well-written) set of lecture notes from which she doesn't deviate and sometimes doesn't even really look up. The class has a great reading list if you're into postmodern lit (Ellison, Nabokov, Morrison) but I came out feeling like, for all the articulate phrases I had taken down in lecture, the treatment of the novels was somewhat cursory. Still, however, a class IÂ’d recommend. \nWorkload:\nnot too bad.. weekly readings, two 4 pg. essays and one 8 pg. essay, final\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "November 22, 2002",
            "review_content": "\nAMAZING READING LIST! (who the hell did the previous review???) Bellow, Ellison, Nabokov, Morrison....and on. Professor Miller is incredibly warm in person and highly approachable. Class is very organized. Miller is receptive to participation. Altogether, very enjoyable class. Definately recommended (if nothing else, a chance to learn about these award winning and influential novels). Why wouldn't you take this class?\nWorkload:\ntwo short papers (3-4pp) and one longer paper (8-10pp) and final\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "December 16, 2001",
            "review_content": "\nShe's really really nice but the reading stinks and her lectures are very confusing and vague a lot of the time. \nWorkload:\n2 papers, a midterm and a final\n"
        }
    ]
}