{
    "prof_info": [
        {
            "prof_name": "Wei Shang",
            "prof_id": 1004,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "September 11, 2005",
            "review_content": "\nThis is one of the best courses I have taken at Columbia. Prof. Shang is very friendly and approachable. In a big class of 25 people he made sure everybody understood the material and had a chance to speak up. Also he was always well prepared and raised a lot of provoking questions in class.\nReadings are of reasonal amount, given it is a 4 credit course. If you have done most readings and understand the main concepts, it should not be hard to get a good grade. Prof. Shang accepts new ideas and different perspectives, which makes this class more interesting than other EALAC ones. \nI had some personal matters last semester which made me absent from a couple of classes. Prof. Shang literrally approached me and sent me his kind concerns - this is definitely the most caring teacher I have seen at Columbia and I do recommend students to take this course with him!\nWorkload:\nweekly posting, 2 papers, 1 oral final. readings are not short but there is only 1 class per week so it is affordable.\n"
        },
        {
            "course_name": "East Asian Texts",
            "review_date": "May 24, 2005",
            "review_content": "\nReally nice guy.  Reasonable reading assignments.  Fosters low-key classroom atmosphere.   Not the best at fasciliating discussion, but pretty good.  Had some really interesting things to say.  \nWorkload:\nweekly readings (manageable) and courseworks postings; one 10min presentation of reading;  2 papers (4-6pgs; 6-8pgs); oral final (15min presentation, 15min discussion)\n"
        },
        {
            "course_name": "East Asian Colloquium - 3400",
            "review_date": "May 02, 2005",
            "review_content": "\nVery nice, very approachable and intelligent professor.  The class itself was a little dull, mostly due to lack of good conversation from the students, but he always did his best to discuss the texts and ask questions to stimulate the class.  I took this class for the major cultures requirement, and I was definitely pleased to have had professor Shang. \nWorkload:\n2 brief papers, weekly response postings, oral final\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "March 27, 2002",
            "review_content": "\nVery nice guy and always receptive to student opinions. From what I can tell this is one of the best Major Text sections; the professor runs discussions well and the readings are assigned in a realistic manner. This may be the only section that does not foist 700 pages of the Tale of Genji on all of the students as one week's reading. Generally a good experience; if you are going to take Major Texts and don't want just straight lectures, try for this section.\nWorkload:\ntwo papers, in class presentation, midterm, final \"presentation\" (you just go and discuss a topic with the professor and the TA for 15 minutes during reading week, it helps a lot if you have done the readings).\n"
        }
    ]
}