{
    "prof_info": [
        {
            "prof_name": "Miklos Gyulassy",
            "prof_id": 749,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "May 10, 2013",
            "review_content": "\nProf. Gyulassy is completely unintelligible. His lectures are disorganized, he skips steps so much that calculations are impossible to follow, he uses metaphors that only he understands (\"bookkeeping tools\"), and there's no sense of what the big picture is in most of the lectures. His answers to student questions are not helpful; sometimes he states some more things he doesn't explain, usually he just avoids the question. My friend and I understood nothing from him, and managed to learn some QM by reading textbooks/papers and talking to the TA, Andrej Ficnar, who was very helpful and approachable.\nThat being said, I did appreciate his choice of topics and materials. He covered some of the standard QM, such as path integrals or approximation methods. But he also went into some more exotic topics, like the Wigner formulation of QM, decoherence and path integrals with topological constraints. These were really interesting and challenging topics that, as far as I know, you don't usually get to cover in QM classes. He provided great references - some compilations of notes written by various people, but also some research papers, such as the one in which Zurek first discussed decoherence.\nIn the end, you do learn a lot if you work hard - but you could learn it much more efficiently if Prof. Gyulassy were able to explain the concepts in class.\nWorkload:\nVery heavy; if, like me, you're an undergraduate taking the class, be prepared to spend up to 25 hrs/week on the (almost) weekly problem sets. This includes the time you need to read to catch up with the unintelligible lectures, and the time it takes to figure out what the poorly worded questions actually ask. One in-class open notes midterm, and one 7-hour take-home final. I didn't really like the concept of the 7-hour final. It doesn't feel like a take-home, where you can afford breaks; you just work for 7 hours straight.\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "October 17, 2003",
            "review_content": "\nProfessor Miklos Gyulassy is the strongest and most transparent lecturer in the department.  He is also very gracious to let an undergrad sit in on his\nclass.  \nWorkload:\nreally hard, really interesting\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "November 11, 2001",
            "review_content": "\nAvoid this man like the plague. He has never taught undergrads before, and makes his lack of respect for students completely apparent. A very intimidating guy, Miklos claims he is approachable, but he has such disdain for students who don't understand, that there's no point. The material he teaches is very far beyond what anyone has seen in prior physics classes, not because it's actually that complex, but because he refuses to use math that anyone knows how to do. Remember everything you learned how to do with sin and cos to solve wave problems, forget it all...he teaches by the Euler method. Unfortunately, the textbook does not, nor do any other textbooks, so after he flies throught incomprehensible lectures and you don't get it, you're totally screwed. The physics help room is at a loss, and the TA for the class thinks you belong on the ground with your nose in the dirt if you don't understand what is happening. After numerous complaints by students to deans, the work and teaching style got a little better, but this is still a really hard class and Miklos doesn't really give a shit if he lectures to you and you learn it, or if he just gets to talk for awhile. The only saving grace is that everyone is generally lost, so the curves are terrifically low.\nWorkload:\nWeekly problem sets, varying difficulty. He creates some impossible ones himself but others are from the book and relatively easy. He does tell you which problems will be graded. 2 midterms and a final. May or may not be open book, but it's not like the book even covers the material, so it doesn't really matter.\n"
        }
    ]
}