{
    "prof_info": [
        {
            "prof_name": "Chen Wu",
            "prof_id": 12830,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "September 13, 2014",
            "review_content": "\nWu Laoshi is just starting out as a professor in Intermediate Chinese and had been a TA for discussion sections for quite a while. Her powerpoints are straightforward for the most part, but she often stumbles in explaining grammar points. I think she's still adapting to American culture and there were some cringeworthy sessions that took place over the semester. We spent a full class watching her favorite movie (shown without a rape warning and it contained graphic content including molestation of a minor) Farewell, My Concubine and sat through an awkward 5-minute Youtube video of her favorite contemporary Chinese song. There was another WTF moment when one of the verbal practice prompts was to create dialogue between a patient and plastic surgeon and to present it to the class in Mandarin. There was a cartoon illustration that our dialogue needed to correspond with and I'm sure that she got a bit upset after figuring out that the activity was incredibly awkward and objectifying of women's bodies. \nA common theme with her verbal practice prompts was dating and she somehow manages to discuss boyfriend/girlfriend dynamics and aspects of attractiveness during each class. I thought it was kind of juvenile and overdone in Elementary Chinese. \nOverall, she's really nice and generous during her office hours. In class, she creates some cute moments but her confidence conspicuously wavers. I found my section to be rather slow in responding to points, but breaking off into groups really helped facilitate learning and steadily kept my attention. I hope to God that she figures out how to best appropriate her verbal practices/powerpoint slides, because it is painful to see her innocently try to simultaneously entertain and teach. I think if she sticks to one, sitting in this class would be a lot less awkward and a whole lot easier. \nWorkload:\nQuizzes everyday, journals collected each Thursday. Weird extra credit system, but sure... I guess it worked out for me. \n"
        },
        {
            "course_name": "Intermediate Chinese N",
            "review_date": "May 05, 2014",
            "review_content": "\nIf you don't take at least one semester of Chinese with Wu Laoshi then you are seriously missing out. She is a new professor, which is why she doesn't have any reviews yet, but she totally hit the ground running, already standing out as an amazing instructor in a department full of amazing instructors. I don't think there is a single student in our class this semester who doesn't adore this woman. She has a wonderful personality and a great sense of humor, showing up to class every day full of energy and smiles. She is great at engaging with students, but is also surprisingly challenging at the same time. While most Chinese teachers tend to ask fairly straightforward questions in class to get you to practice your vocab, Wu Laoshi has this habit of asking randomly deep philosophical questions that make you go \"lolwut,\" but then you realize you can actually answer them if you think about it for a bit. You also get to find out some cool stuff about your classmates just from the answers they give to her questions. She is also superhumanly well organized, and is the only Chinese professor I've ever had that keeps an up-to-date Gradebook on Courseworks, which doesn't sound so impressive until you take into account the fact that we get quizzes almost every single day and journals/homeworks every week. Her English is also quite good, which is a bonus when it comes to explaining some of the subtler points of the grammar structures, something that she does very well.\nWhile Wu Laoshi is extremely nice, she is also not a pushover, and tends to stick to her policies regarding absences and late work unless you give her a really good reason to excuse you from them. She is also slightly more challenging than other Chinese professors I've had in terms of the questions she asks on her quizzes and exams, but her grading is also fairly lenient so this tends to balance out. After all, when she hits you with a massive sentence on the sentence quiz that uses every single bloody word you had to memorize yesterday, the upside is that if you forget one of them, you don't get that many points taken off.\nAll in all, Wu Laoshi is a fantastic instructor and a true gem of the Chinese department. In fact, the only bad thing about her is that she's not teaching Advance Chinese next year.\nWorkload:\nStandard workload for a Chinese class.\n"
        },
        {
            "course_name": "Intermediate Chinese N",
            "review_date": "January 21, 2014",
            "review_content": "\nChen Wu is just the nicest Chinese teacher I've ever had. Not only did she have a good handle on English, but she was also very able to use it to explain the confusing grammar points that the sub-par Columbia textbook tossed at us in buckets. Furthermore, she held an amazing handle on our class while still allowing a lighthearted attitude and an incredible, usually hilarious back-and-forth between her and her most...outgoing...of students. Her incredible attitude kept the silly amount of quizzes bearable. Couldn't recommend her enough.\nWorkload:\n2-3 quizzes per week. Sometimes there will be 50 characters to memorize and one day to do it, and usually we are quizzed on things we have not yet gone over, so preparing is a lot of extra, confusing work. 1-2 homeworks per week. A journal entry due every Thursday. 3 tests plus the final (which is basically just another test on the final chapters). One short oral presentation. One final, longer, oral presentation with a powerpoint. 3 (?) or maybe 4 (or 2, for that matter) typed essays that are related to, but separate from the journal. Dont forget to go to the drill session, as attendance matters. Every day there is a sort-of melange of homework, writings and quizzes, so be prepared to forget one of the 3 things due that day and scramble to do it (succinctly) during class. This is a lot of work, but it isn't that bad once you get used to huge character cramming sessions.\n"
        }
    ]
}