{
    "prof_info": [
        {
            "prof_name": "Mark Buchan",
            "prof_id": 3501,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2008",
            "review_content": "\nMark is absolutely fantastic. Class is entertaining and fun, he makes a lot of the very dull material quite interesting. He is very specific about what he wants, and rewards effort. If you work on your rewrites, show interest and listen to his advice, your final grade will be good despite the fact that he is not at all averse to dumping down some B-'s and strong criticisms in the papers.\nGreat, get him if you can. My best professor till date.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 11, 2008",
            "review_content": "\nMark was a great LitHum professor. While the essays were definitely longer than most other classes, it is worth it just to hear this guy speak. He's funny engaging and passionate. He knows his stuff too, was writing a book on the Iliad and had written one on the Odyssey when I took him. He also grades the essays kind of hard, proclaiming the first day that \"none of you can write.\" He does not grade the midterm as harshly. Trust me, when everyone else is complaining about how sitting through 2 hours of LitHum twice a week is painful, you will take satisfaction disagreeing because you have Mark, even with the longer and more harshly graded essays.\nWorkload:\n2 Papers 8-10 pages (originally 12-15 until we convinced him to trim the requirment)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 09, 2008",
            "review_content": "\nMark Buchan is one of the many Classics professors who also teach Lit Hum, and I would venture to say that he is also one of the best.  He's a scholar of Homer, so he opens the year with a series of classes on the Iliad that are nothing short of religious experiences.  The classes on the Odyssey are equally amazing.  It goes slightly downhill from there, but only because Homer is basically the cornerstone of the entire Lit Hum experience; he still does a wonderful job of making Herodotus and Thucydides interesting, and they're supposedly the two most boring authors on the entire Lit Hum syllabus.  Class discussions feel just right: Buchan encourages (and yes, even compels) every student to speak up, but he won't hesitate to call you out if you say something irrelevant or wrong.  Most remarkable of all is his sheer enthusiasm for the material.  This man obviously loves literature more than anything else in the world, and his love is infectious.  Truly one of the best teachers I have ever had.\nWorkload:\nBuchan offers a lot, but he also demands a lot.  You might be able to get away with not doing the reading two or three times, but he does expect you to keep up.  He assigns 2 papers (8-10 pages each) and grades them quite harshly; there is a good chance that you will get a C on one of them.  The midterm is very thorough, but he's quite clear about what he wants; it just takes a bit of work.  Final is the same as all the Lit Hum classes, although he probably grades it a bit more harshly than others.\n"
        }
    ]
}