{
    "prof_info": [
        {
            "prof_name": "Mary Cregan",
            "prof_id": 629,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Victorian Novel",
            "review_date": "March 31, 2010",
            "review_content": "\nProfessor Cregan is adorable!  She's nice, approachable, and a good lecturer.  She is good at balancing lectures and discussions.  This class is meant to be a lecture.  So, although she always gets her lecture in, she always opens up space for student participation too.  The discussion part is sometimes hard to follow, but her lectures are always on-point and interesting.  I definitely recommend this class with her. Sometimes the reading is dry, but her lectures always help me to appreciate the books and see them in a new light.\nSome English classes are too student-discussion centered, and some are too professor-rambled centered.  But, like I said, this class definitely strikes a balance.\nI also like that she is open to student suggestions.  She always takes into consideration whether or not her assignments are too much.  For example, there was one time when she revised the syllabus just to give us an extra session to discuss a book.  Most professors forget that students have other classes.\nSo, if you enjoy reading and good insight on the readings, then take this class!\nWorkload:\nA lot of reading, but it's worth it! 2-3 weeks per book.  Victorian novels are long.\na midterm, a final, a 7-8 page paper, 3 coursework discussion posts, 10 journal entries.\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "April 24, 2009",
            "review_content": "\nProf. Cregan is a great professor. She has a beautiful, throaty voice (doesn't seem to be relevant but when she reads passages aloud it actually makes you want to listen). She explains the novels very well, is interested in what students have to say, and will definitely tell the class any really great points that were made in the courseworks postings. She is a fair grader and is looking for students to enjoy and learn the literature rather than just work for a grade. She is approachable and willing to meet with students for advice on papers or to talk about ideas, etc. I would definitely recommend taking a course with her.\nAs for the class, the syllabus is amazing if you're interested in modern literature and don't mind reading somewhat difficult works. The books become a bit more difficult as the semester progresses so if you do the reading you should be well-prepared.\nWorkload:\n3 courseworks responses (not long), midterm (rather specific, extra credit was given), final, paper, and 1 book/ 3 classes. \n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "December 27, 2006",
            "review_content": "\nMary Cregan is:\n1) An approachable, unintimidating professor\n2) A fair grader\n3) Supportive of other people's opinions during discussion, and if she isn't, she counters that opinion in a manner that leaves your dignity intact\n4) Reads and responds to weekly postings\n5)Gives papers back on time with constructive feedback (she's also more than willing to talk to you if you feel that her grading is unfair)\n6) All-around,highly recommend.\nDo plan on taking this woman's seminar if you want to learn how to write and thoughtfully respond to criticism and apply theory to texts. \nWorkload:\nWeekly 1-2 pg. online postings and a short response to another student's posting; 5 essays (4 essays and 1 rewrite of a poor-fairing essay); no midterms or finals.\n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "December 17, 2005",
            "review_content": "\nI love Prof. Cregan. She is very intelligent as well as kind hearted and seems to have a reasonable understanding of grading based on students' capabilities. Consider yourself lucky if you get a chance to take her class.\nWorkload:\n3 papers (it was originally 4), weekly responses on courseworks (kind of annoying, but not bad), a lot of reading.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 29, 2004",
            "review_content": "\nI LOVED this class. It was my favorite one during my first semester, hands down. At first, Professor Cregan seems very mild-mannered and soft-spoken, but underneath that lurks a very vivacious and fun-loving person. A lot of the class also depends on the people who are in it and the people who contribute to the discussion. So, if you take her class, be sure to voice your opinion, even if you don't think it's \"right.\" She is very accepting of other points of view and loves when people \"read against the grain\" in papers and provide their own interpretations. The draft system on papers is very helpful, especially if you do not self-edit. She gives a check, check-plus, or check-minus and writes a ton of comments so you know how much revision you need to do. On top of that, she schedules individual conferences to discuss what you want or need to do with your paper and dedicates class time to discuss how to write a good paper. She is extremely helpful, always quick when responding to emails, and very good about giving extensions. I would recommend this class to anyone who likes to be creative in their papers and who wants to just take a really good English class.\nWorkload:\n3 essays (2 5-7 pages, 1 8-10 page research essay), 2 peer revisions, and a few reading response papers (1-2 pages). For each essay, there is an ungraded first draft, and you have to write a prospectus and annotated bibliography for the research paper.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 02, 2004",
            "review_content": "\nProfessor Cregan is awesome! I learned so much from her, and she did so much to make our class a warm and inviting place. This was a great class with an engaging and passionate professor.\nWorkload:\nNot bad at all ... 2 graded essays (both of which required full rough drafts), one research essay, several reading responses\n"
        },
        {
            "course_name": "Women and Culture Seminar and First Year English",
            "review_date": "May 08, 2003",
            "review_content": "\nI really enjoyed my year with Mary Cregan.  She is sweet, very fair, and suprisingly liberal.  She laughs at jokes and honestly seems to care about how her students are doing in the class.  Your experience in class will depend on the other people in your class.  If no one participates there can be awkward silences and it may become boring.  However, on the whole she was a good professor.  It was not an excessive amount of work and she is lenient with due dates and very helpful if you are having problems with your writing.  Her class is very laid back and every once in awhile she will suprise you with a joke about sex or some other funny anecdote.\nWorkload:\nEnglish:  two 4-6 page papers with rewrites, a couple page long reader responses, the prospectus and annotated bibliography for the final paper, and the 8-10 pg final paper and rewrite.\n* however, the rewrites are ungraded so not really a big deal and the readers responses can be handed in whenever you choose (for most the last day of class)\nSeminar:  2 4-6 page papers with rewrites, one 4-6 page paper\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 19, 2003",
            "review_content": "\nThis a a great women!  She helped me to become a decent writer.  She is a patient person and she works with you on due dates.  Most of the readings were very interesting...some days the class seems to drag...but overall a good class\nWorkload:\n4 Responses, 2 essays, and 1 research paper\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "May 06, 2001",
            "review_content": "\nSuch a nice lady! Charming and stylish. Very fair grader. She's the kind of professor who looks kind of conservative and arrogant, but she's open to all sorts of comments and jokes and laughs heartily at them. Her class can be a bit boring at times, but she won't penalize you if you hand in your work late or need to revise your final paper after the due date. For those of you who are English majors and need to take critical writing, Mary Cregan is a high recommendation.\nWorkload:\nWeekly response papers, 4 papers, 1 comprehensive final paper (8 pages).\n"
        }
    ]
}