{
    "prof_info": [
        {
            "prof_name": "Dylan Thurston",
            "prof_id": 2651,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "May 13, 2011",
            "review_content": "\nNam's a very smart, entertaining and eccentric guy. He's highly competent and super knowledgeable about the material that we're learning. As previous reviewers have indicated, yes, he peppers his lectures with corny jokes, analogies, and many, many anecdotes (that are relevant to calculus 50% of the time). I didn't find myself bored at any of his lectures. The minute you start to feel drowsy, odds are you'll hear Nam say something either very funny or totally wacky and the whole class starts laughing. He's also a very friendly and approachable (albeit, he's sort of \"out there\") guy who's usually willing to help his students. Do keep in mind that he frequently responds to questions by making up elaborate analogies on the spot, which, like his anecdotes, don't always make complete sense to others. But he's helpful...most of the time.\nI found Nam's Calculus III section to be a \"math for non-math majors\" type of class. He takes complicated and abstract concepts and presents them to the class in a extremely simple and straight-forward way. He's very clear about what's on his tests, which are usually fairly straight-forward and don't involve too much tedious computation. \nWhile Nam's section is probably the most straight-forward of the Calc III sections offered at Columbia, that's not to say that there aren't some very difficult problems (usually proofs) on his exams that may require you to see a \"trick.\" Here's the good news regarding the more challenging questions on Nam's exams: 1) A good number of the trickier problems and proofs on Nam's exams have been covered in class before (I would HIGHLY recommend you go to his lectures since Nam doesn't really follow the Stewart text very much and tends to put lecture material not covered in Stewart on his texts), 2) Nam allows cheat sheets on his tests, 3) The midterms and finals usually have a 15 point bonus at the end. The bonuses are sometimes surprisingly easy (extra 10-15 points at your disposal?)\nIf you're a possible math major who's interested in the theoretical aspects of multivariate calculus, this may not be the class for you. If you're fulfilling a science major / econ / pre med Calculus III requirement and want the most straight-forward Calc III section (and an entertainingly wacky math professor), THIS IS THE SECTION TO GET INTO.\nDid I find this class to be mathematically enlightening? No.\nAs a science major, did I find this class to be a fairly straight-forward way to ace a math requirement? Yes. \n\nWorkload:\n1st midterm average 75-80 range; 2nd midterm average 75-80 range; Final exam average 65-70 range. \n\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 26, 2010",
            "review_content": "\nI came into my freshman year of college considering a math major.  Unfortunately, after this class, I have decided NOT to pursue that.  I'm not sure if its the material or the teaching.  First, let me say that he is a very nice guy.  If you need help, he will be more than happy to help out by going over a problem or seeing you in office hours.  However, both of these outlets are not of much help if you don't understand what the hell he is saying.  He knows his math well, but we don't, and he is not very good at translating complex math into terms that are understandable to the people who are first learning it.  He seems to assume that we know what he is talking about and he moves quickly through new material.  He uses projector slides for his lessons, which are organized, but it makes the lesson go faster than it should be for it to be understood.  Basically, in this class, you either get it or you don't.  If you don't get it, it will be hard for you to understand his attempt at teaching it to you.  I relied on the textbook the entire semester to understand what was going on, and when it came to the last 3 weeks where the material could not be found in the text book, I was pretty screwed.  He really does try very very hard to make this class inspiring and understandable, but his effort falls short due to his mumbling,  his easily distracted nature, and his niceness which is typically taken advantage of by kids who only show up to class for the exams.  His problem sets are also pretty long, annoying, and detailed.  However, they are mainly from the textbook.  Also, he likes topography and making pictures of surfaces using his fancy computer program way too much.  Not good.\nWorkload:\nabout 10-11 problem sets, 2 midterms, 1 exhausting final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 24, 2010",
            "review_content": "\nFirst off, Dylan Paul Thurston is a really nice guy.  He is approachable, understanding, and open to suggestions.  He caters to students' needs and will go out of his way to help students understand what he's teaching (by building models, changing the way he writes on the board, etc.).  He teaches with a powerpoint and prints out the slides for note-taking. He gets an A+ for effort.\nHowever, he is not the world's greatest teacher.  He really knows what he's talking about and seems to forget occasionally that his students may not.  He's terrific at math, but he often breezes through challenging concepts and new material.  He is also not the world's greatest public speaker.  He stumbles over words and is easily flustered by the slightest distractions.  He is inappropriately quiet at times, and his delivery is completely uninteresting.  In addition, he seems to be slightly nervous around women.\nIf you're looking for an exciting teacher with great delivery and clear explanations, Thurston is not the guy for you.  However, if you're looking for a teacher who will put effort into you personally, he is.  Just make sure to approach him with your concerns and a smile.\nSummary:  smart, not a natural at teaching, mumbles, afraid of women, but a really nice guy.\nOverall: B-\nWorkload:\nAround ten tedious and time-consuming problem sets mostly comprised of problems from the book; two reasonable midterms.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 28, 2009",
            "review_content": "\nI took this course 3 years ago and remember it as the primary reason I decided not to do a math major. I used to love math, but somehow this class sucked all the fun out of it. I don't know, maybe it was because it was my first big math lecture, maybe it was the fact that Prof. Thurston talked to the blackboard and was much more interested in topology than a few hapless freshmen and sophomores in calc 3, maybe it was because I never made a move on my study buddy, or maybe I just don't really like university-level math. In retrospect, it was fair enough. Midterm and final reasonable, unbearably tedious problem sets that were nevertheless straight out of the textbook, no complex proofs or anything inappropriate for the level. Just totally uninspiring. It was a while before I took linear algebra and started liking math again.\nWorkload:\nLong and annoying problem sets, fair midterm(s?) and final\n"
        },
        {
            "course_name": "Barnard First Year Seminar: Symmetry",
            "review_date": "July 12, 2007",
            "review_content": "\nDylan Thurston can't be blamed for trying but this class was a major bust. He's a very shy, nervous guy and all the girls in the class seemed not to have known what discussing symmetry meant. He's a math prof. and so was very interested in starting off with those basic assumtions about symmetry. I guess most in the class thought that was belitting and gave up from there on out. Could have been interesting if people where willing to thing conceptually and Professor Thurston had a more forceful hand when it came to leading discussion.\nWorkload:\nminimal\n"
        },
        {
            "course_name": "Modern Analysis I",
            "review_date": "July 06, 2006",
            "review_content": "\nAnother one of those smart-guy-horrible-teacher types. The way he explains concepts and proofs may be intuitive to him, but are usually inaccessible to most of the students in class (except for those who already know the material). On top of that, it is difficult to follow both his speech pattern and his boardwork. He stutters a lot; his boardwork is as broken as his speech. And even further on top of that, he doesn't hand out any of Gallagher's old lecture notes. The book roughly  matches his own curriculum at best. This is a great course to take, but just not with him.\nWorkload:\nNot too many problem sets, a midterm, a lit-review type paper, and a final. All are usually challenging.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 23, 2006",
            "review_content": "\nIf you can stand a constant droning, go ahead and take his class. If you really want to learn and feel semi-engaged during class, choose another teacher. Thurston mumbles a lot and writes illegibly on the board. Most of what he teaches in class can be learned from the book and what isn't in the book will not be on the midterms or finals. \nWorkload:\n10 problem sets (half from book which counts for very little, half from him which sometimes take a while to do if you want full credit), 2 midterms, 1 final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 12, 2006",
            "review_content": "\nAwesome professor.  A little boring, but he really knows his stuff.  Problem sets were not too hard neither were the midterms.  Best part is: he speaks english.  You will certainly learn alot in his class.  \nWorkload:\nProblem sets every week, two midterms, final.  Standard to easy. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 25, 2006",
            "review_content": "\nThe majority of this class is taken up with his nervous noises and words like \"um\" which he could easily say 20 times in once sentence. Dylan is very difficult to follow unless you're a major math mind. Sure he speaks english, but I'll agree with two of these other reviews, english does not make you understandable. If you speak with him, he is by no means mean, but if you ask for an extension on your problem sets, expect to get one, just don't expect to get full marks, he'll still take 5 off. His miderms aren't overly hard (they certainly are if you don't study like myself). I have yet to take his final but I'm sure it will be similar, just longer. There are mostly smart people in Calc 3 so be carefully if you expect a huge curve. The average on our midterms have been between 41-43. He said there will be \"some kind of curve\" but who knows what that means. Major points of this review, very tough to follow even with the easy subjects. He speaks english but doesn't actually explain anything he's writing down, he just reads what he's writing. Use the text, it's useful for this class and because the topics aren't too hard you can mostly teach it to yourself but it takes time. Only take this class if it's a must, just make sure you put the work in.\nWorkload:\n10 problem sets. A bit much if you ask me but they're not terribly time consuming. Get a jump start and do them on Sunday or something. 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 09, 2006",
            "review_content": "\nI disagree with \"the most amazing teacher\" ever.  I'm pretty good at math, and did well in the previous calc sequence courses, but this guy blew me right out of the water.  I couldn't understand this guy.  I learned almost everything from the book.  He also stutters a lot when he talks in class, and especially when he answers questions.  So he is one of the few who does speak English.  That does not mean he is understandable.  If you wanna do well in this class, simply read the book.  It worked for me.  I have to admit, though, he's very friendly with office hours and adds more when he thinks people need it most.  He is also a little flexible, and cares about what the class things somewhat in terms of when the midterms will be, when homework's due, etc.  However, it is precisely this that is his weakness.  Sometimes he is very disorganized, and you will find that his practice midterms aren't too insync with the actual final, and he won't even post the answers until the day before the midterms and final.\nThe problem with this class was too many smart people.  The average for our two midterms was a 40/50.  So, warning, if you get stuck with a bunch of students who go to class and participate, it means they are either very  hard workers or extremely smart, so make sure to do everything, and understand everything.\nWorkload:\nNot too bad. 10 problem sets total throughout semester, (homework=20%).  Two midterms (20% each) (easy if you know the material well, but don't count on the practice ones to help you prepare, the actual things are much harder).  And one final (40%)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 18, 2005",
            "review_content": "\nI completely disagree with the previous review. Maybe it is because I was blessed with truly amazing math teachers last year at Columbia, but I think Thurston is awful.  It is true that unlike most math profs he speaks English. But just speaking English does not translate to a great teacher. Thurston is perhaps the most nervous man I have ever met(the amount of material he could cover in each class would probably double if he could cut out all the nervous stuttering) and while he seems extremely intelligent, he has trouble explaining things to people who aren't of his math level.  Often times in class it is very difficult to follow what he is explaining and if you ask, sometimes he doesn't know the answer and actually has suggested you ask a classmate for the answer instead. Overall, he does seem like a nice guy and I really think he wants people to do well, but at least for me, I think he is one of the worst teachers I have had. Going to his office hours for help is frustrating since you can spend a half hour with him and he will barely provide you with any help before he has to rush off somewhere. This class has been a very frustrating experience for me after acing Calc 1 and 2 with no problems. I have trouble believing that I am struggling in this class solely due to my own abilitiy if I generally find math enjoyable and easy. Calc 3 is supposed to be one of the easier classes in the calc sequence and in my experience, I would say that is not so.. Also, he is very psuedo-organized. On the surface he appears organized but he really isn't. He doesn't post problem sets until a couple days before they are due even though he promises to give them out a week before they are due. Often times he states the sections from the text we will be reviewing for the next class, only to read those sections and have him discuss something completely different. \nWorkload:\nnot that much. problem sets are pretty short. two midterms and a final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 13, 2005",
            "review_content": "\nAMAZING.  By far your best bet for Calc III.  First, he is UNDERSTANDABLE.  Sure, just like any math guy, he has some barriers with explaining things, but with english as HIS FIRST LANGUAGE, he is probably your best bet just for that reason alone.  Secondly, he is a sweet man who is always willing to help you out, arrange review sections, and give you practice problems/midterms.  Lastly, his tests are EASY.  Trust me, I am a Calc kid by no means, and I was able to get through it problem free.  Not to mention, he is also a brilliant mathematician well on his way to coming out with some famous ridiculous theory, so go with him.  Trust me.\nWorkload:\nShort weekly problem sets, two midterms (both with sample midterms and both EASY), final.\n"
        }
    ]
}