{
    "prof_info": [
        {
            "prof_name": "Premilla Nadasen",
            "prof_id": 12896,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Poverty, Race, and Gender in the U.S.",
            "review_date": "June 13, 2016",
            "review_content": "\nThis is an amazing class if you want to seriously understand the intersection of different identities and poverty!! Nadasen isn't my favorite lecturer; she speaks quite quickly, and will say important dates and pieces of information needed for the final without pausing and indicating they are important pieces of information. The midterm and final are tough; you need to have read the material and understand what's going on in the class. I had a horrible TA so be careful, as the TA is the one that grades the papers. Oh yeah, we have to write fake biographies for someone in a specific time period, which is surprisingly difficult (a lot of research). Overall, the class is a serious difficult workload, but totally worth it\nWorkload:\nMidterm: one essay, multiple identifications (2-3 paragraphs)\nFinal: two essays, multiple identifications (2-3 paragraphs)\nTwo essays: minimum 6 pages\n"
        },
        {
            "course_name": "American Civilization Since the Civil War",
            "review_date": "May 14, 2015",
            "review_content": "\nProfessor Nadasen is an excellent lecturer and given the topic, it seems difficult to make a history lecture riveting, she did manage to make the topics interesting. She does however maintain a very liberal political point of view, which she does not attempt to hide, and it is evident in her lectures. I did enjoy this class and would recommend it to anyone looking to take an introductory American history course.\n\nWorkload:\nWeekly readings that ranged from 20 to 50 pages; 2 x 5-7 page papers (these will creep up on you so be proactive); Mid-term and Final consisted of 4 IDs and 1-2 essays (out of 10 total to prepare for each)\n"
        },
        {
            "course_name": "Maids and Madams: Nannies, Maids, and Care Workers in a Global Economy.",
            "review_date": "June 03, 2014",
            "review_content": "\nI had a very poor experience with Prof. Nadasen, and from my discussions with a few other classmates, I was not the only one. I dislike Nadasen not only as a professor, but also as a human being. This class is designed as a seminar, and so it relies on doing (most or all of)the reading. If you do not do the reading, or even if you do just a cursory scan, Nadasen will pick up on that and make a point of calling on you or passive aggressively go around the room and ask everyone in the class why they didn't do the reading or aren't speaking. I guess that really goes beyond just passive aggression, but whatever. \nI understand that this course is a seminar, but in my personal taste, I prefer seminars where a teacher speaks about the material for a chunk of time (20-30 minutes or even a little more...it is a 2 hour class), and the rest of the class is discussion based. In the six or so seminars I've taken in the past, this is the way they were set up. This is not the case in Nadasen's course, who assigns each week's readings to one student (or pair of students if you like), and are thus responsible for writing a list of discussion questions and sort of leading the class that day. Nadasen provides a slice of insight maybe every 15-20 minutes in the form of a brief comment. She is not an active participant in the conversation/doesn't frame the conversation/doesn't really provide any depth of knowledge, of which she has a lot. She basically just sits there most of the time, which makes me wonder why are you getting paid? I appreciate when professors let students share their thoughts in a seminar--that is what it's for, after all-but I like to have a deeper framework to learn from, which a professor can give that readings just can't. \nThis class also had a semester-long research paper.The course requires a graded literature review and two ungraded drafts that are peer and writing-fellow reviewed (it is a writing fellow course). Though not formally graded, turning in the drafts goes to participation. It should be mentioned that Nadasen does not look over your drafts at all--it is just a classmate and the writing fellow, though she frequently mentions how she is always willing to look things over. THIS IS NOT TRUE. \nWhen working on my literature review, I was having trouble locating sources to write about that fit within my topic, though I saw a research librarian, a writing fellow, and put in no less than several hours looking. When I reached out to Prof. Nadasen, she was reluctant to help at all, and just kept saying \"it depends what kind of a framework you're setting up,\" even though I explained my topic to her in depth. She was hesitant to even suggest a book to look at. She also said during the first or second class that \"she researches for no one but herself\" (makes sense, if not a weird thing to say). This is pretty much her philosophy as a professor. While I truly do not expect hand-holding, I do expect my professor to be a resource for answering questions, especially when I've exhausted other outlets and since the class is a seminar, not a big, largely anonymous lecture. Don't expect Professor Nadasen to be a resource for anything other than stress.  \nA final note about the paper (15 pages), Nadasen seems to look at the assignment as a mini-thesis of sorts (only one person in the class was a history major, though this is history course). My paper was interviewed based, and from my relatively substantial experience performing in-depth interviews, just two can present enough data for a ten page paper, and so I decided to interview three people, especially since I was combining this research with another source of primary info and scholarship. Nadasen hoped I would be able to find, interview, and write about 10 RESPONDENTS?!?\nNadasen was, as a person, extremely unpleasant. She would often do this thing where she would pretend to care about her students (she doesn't need to care, I don't expect her to, but then don't pretend either) and in the same breath as asking how we're doing, are we getting enough sleep, etc she would add...because the papers you've just turned in were sloppy and haphazard. Any indication of caring would be sandwiched with passive aggression. \nNadasen's availability outside of class: Bad. She had I believe one or two office hours on Mon afternoons, during which I worked off campus. When I tried to meet on other days, she was not free. Because she lives in West Chester, she wasn't around except on the two days she was teaching (Mondays and Wednesdays) and rarely had any time to meet Wednesday. In fact, most days she could not meet before OR after class on Wed (because she left to go home right away). \nThough I put in countless hours of work for this class, I found it extremely hard to make a B+. I know of no one who received even an A-, though I'm sure a few people did, maybe ever better than that. Coupled with other personal negative encounters with Nadasen (at one point, I had to contact my class dean), and her disinterest in teaching,  I would not recommend this course, though the reading was at least usually interesting, especially some of the books (there are a LOT of books to buy).  \nWorkload:\n15% Litreview_contente review_content, 40% Research Paper, 15% Reading Journal, 15% Presentation of  Readings, 15% participation (Includes two rough drafts of paper, regular attendance *can't miss more than two classes*)  A lot of components, something is usually due every two or three weeks. \n"
        },
        {
            "course_name": "Poverty, Race, and Gender in the U.S.",
            "review_date": "May 26, 2014",
            "review_content": "\nPoverty, Race, and Gender in the U.S. was probably one of my favorite classes I've taken at either Barnard or CU. Professor Nadasen not only demonstrates mastery of the material but teaches in a way that is passionate and engaging. She analyses both history and contemporary issues through various lenses of social theory, and, in turn, encourages discussion within the classroom. In addition, she has the unique ability to boldly disagree with you without making you feel stupid for your (perhaps) uninformed opinion. The only public shaming in this class comes when people don't do the readings, and even then Prof. Nadasen only exerts passive-aggression. I would highly recommend this class to anyone interested in the subject matter and enjoys discussion/lecture mixed classes. \nWorkload:\nDaily readings that are mandatory both for the tests and in-class discussions, two 6-8 page creative writing-style essays, a midterm, and a final\n"
        },
        {
            "course_name": "Poverty, Race, and Gender in the U.S.",
            "review_date": "May 06, 2014",
            "review_content": "\nProfessor Nadasen is an incredible professor. She's clearly brilliant and knows how to pick lecture topics that contribute to greater themes and offer new ideas, instead of  regurgitating readings. It is 100% necessary to come to every class, and you will miss out if you don't. The midterms and final questions require citations from lecture and readings, so having typed notes will serve to your advantage immensely. I came to class genuinely excited to hear what she would have to say, and was actually disappointed one day when it had to be cancelled because of snow. Even though the class drew students from a wide range of history instruction and knowledge, I always felt challenged but not overwhelmed. She stimulated discussion extremely well, and drew off of what students said. She's not a professor who responds with a mere \"mmhmm\" or \"interesting\" to students' comments, but instead challenges them to question their own logic and stereotypes and interact with the material on a real level. In terms of grading, it was all done by a TA, and I heard the range of essay grades was a lot of Bs and Cs, but midterm and finals were very high so it evens out. I really cannot give a higher recommendation to her and I'm really just so happy I took her class.\nWorkload:\n45-85 pages of reading per week, the first half of the semester on the heavier end, and the second half on the lighter end\n15% attendance/participation\n15% each for two 6-8 page creative papers in each half of the semester\nMidterm with pre-released questions- 25%\nFinal with pre-released questions- 30%\n"
        }
    ]
}