{
    "prof_info": [
        {
            "prof_name": "Branden Joseph",
            "prof_id": 3200,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 25, 2015",
            "review_content": "\nProfessor Joseph is one of the best professors I've ever had, especially considering I was extremely worried about taking Art Hum since I am not particularly interested in the field, but he really made the class enjoyable. Readings were quite minimal, no final, and most of the classes I actually enjoyed. He made it about historical references just as much as the actual analyzing. He's one of the most knowledgable professors I've ever had and respects when people put in work into a class. He even made me appreciate (some) value in Warhol and those artists which I previously thought were a waste of time.\nWorkload:\nVery reasonable -- not midterm and final. 5 papers which he will help you with and a cool final project to design an exhibit.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 17, 2012",
            "review_content": "\nIf you get Prof. Joseph, you are in good hands for Art Hum. The class is pretty easy and really interesting. He follows the standard Art Hum syllabus (this year he's director of the program) from the Parthenon to Warhol but his lectures are what make the class unique. He emphasized the elements of artistic styles like most sections do but tended to contextualize them in their social/historical context. Examples: how Impressionism's voyeuristic depiction of women related to the growth of bourgeois urban space in Paris or how the Parthenon enshrined notions of Athenian greatness through contrast to 'the Other.' He involves the class a lot though too in discussions, so it's not just him lecturing. There is a reading required every week more or less but you can skim them. \nWhat really made this class nice, though, was the grading format. There was no midterm or final exam but instead four papers on different pieces of art at NY museums. Because of this, you can just listen in class and not worry about remembering the name and year of every painting, and use the skills gained in class to write the papers. \nWorkload:\nPretty light. No exams. Three 2-3 page analyses of artwork in NY (one classical sculpture, one 18th century European painting, one painting by a woman artist) and  final 5-7 page paper on another piece of art of our choosing. A few readings and short responses along the way. \n"
        },
        {
            "course_name": "Neo-Dada and Pop Art",
            "review_date": "December 22, 2010",
            "review_content": "\nAre Professor Joseph's lectures great? Yes. Are they hella filled with information and satisfyingly fast-paced? Yes. Does he tie together the dense, sometimes unintelligible readings masterfully? Yes. Will he make you feel totally justified, for two hours every week, for sitting in the dark, watching Jack Smith blow up balloons? Yes. Was I crushing on him pretty much the whole time? Yes.\nBUT. None of that is any reason to put the professor on a pedestal and get all bugged out about how he's a \"rock star,\" a \"luminary,\" a \"bent-necked, dress-shirted silver fox,\" etc. He's just a non-octagenarian in an art history department full of adherents to the old school, that's all. He's chill. Take the class. He won't even notice you if you're undergrad, so there's no point in being intimidated. Just don't be late, he gets pretty touchy about that.\nWorkload:\nUndergrad: a take-home midterm of short essays, a non-research paper of under ten pages, and an incredibly easy open-note final that was like a blessing from God. Tons of reading, but it's usually interesting.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "September 07, 2008",
            "review_content": "\nBranden Joseph is one of the most brilliant and captivating teachers I have ever had. I took his course Spring 08 and ti was absolutely spectacular. Granted, I am an art history major, but I had absolutely no idea and barely any previous knowledge about 20th century art.  \nNot only was the course material interesting, but the reading, which seems like a lot at first, was quite relevant and adds a lot to the course. I agree with the previous review that Branden Joseph is a rockstar and he knows is but that title is well deserved. He has written a lot about 20th century art and really knows his stuff. The course lectures do get repetitive at times but it is more so to reiterate the things you need to know and by the end of the semester you can bang out theories and information like no other. I recommend doing the reading because the midterm and final essay are both centered around what we read but you do discuss the reading in your discussion sections and Branden Joseph both analyzes and comments heavily on the main texts. Speak up during discussion sections as a majority of your grade is based on class discussion and your TA's can be a big aid when grading your final research paper.  I recommend this course 100% to any one interested in 20th century art as it is a great basis for getting not the major art movements and a chance to have Branden Joseph as a teacher. \nWorkload:\nThere are no assignments just weekly readign which can be a lot at times but especially read the online ones about Greenberg, Rosenberg and the major art critics because that is what your essay on the final and midterm will be about. There is a final paper that's 10 pages and if you have any problems the TA's are very helpful and it's pretty easy. Overall not too much of a workload just the readings which aren't too bad. \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "September 04, 2007",
            "review_content": "\nThe previous review certainly doesn't reflect Professor Joseph's reputation in the art history department nor does it speak very accurately about his lecture style in classes that are actually taught exclusively by him.\nAs evident by the ridiculous number of people, grads and undergrads, that turn out for his lectures, Branden Joseph is a ROCKSTAR, and he knows it.  Quite arrogant but with the intelligence and accomplishments to back it up (he's THE Rauschenberg guy and the heir-apparent to such luminaries as Krauss, Bois, and Buchloh ), his theory-filled lectures are dynamic, fascinating, and often quite funny.  Many of the readings he assigns are his own work, yet rather than simply summarize, he aggressively tackles the readings with his own insights and forceful opinions. In person, he is intimidating and knows it, freely calling you out if you don't know your shit.  No coddling sensitivity here (but do you really need that from a lecture course?), just youthful haughty brilliance that, yes, is completely worth your tuition money.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "August 18, 2007",
            "review_content": "\nThe class started out promising: Professor Joseph, rising hotshot in the Kraussian world of art history, gave a sweeping review of the art world's trends from the end of the nineteenth century to the beginning of the twentieth. It was an impressive narrative that drew on theory from Benjamin, Freud and Greenberg and seemed very promising. The class on Picasso and semiotics was particularly breathtaking. But somewhere around Pop Art he started repeating himself over and over again and it seemed to me he had a sizeable chip on his shoulder about having to teach a century's worth art at an impossible pace to undergraduates. He's a talented writer and has a formidable mind for visual analysis--too bad he did so little of it and read so often from his notes. Given that his field is contemporary art, he devoted probably more time than was actually due to the really whack world of post-modern art (and even had a class on post-post modernism). \nThere was an army of TAs and your impression of the class/final grade depended a lot on your participation in section and of course the quality of your TA, which was decidedly mixed across the board. Joseph himself was in my opinion not receptive to student questions and comments and was even hostile during office hours. Overall, a mixed review. \nWorkload:\nMidterm and final exam, one 10-page essay. Reading pretty light\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "April 16, 2007",
            "review_content": "\nThis guy was one of the lecturers for our Intro. to Art History class at Barnard. What a joke. \"I know I'm not explaining Cubism very well for you here...but you'll just have to trust me...well, anyway, you can't really explain cubism anyway, you just have to puzzle it out...\" WTF? I think that a professor of art history at Columbia should, at the very least, be able to give students some indication of what a major topic in the history of art might be about. And, hey, thanks for basing your entire lecture on the Krauss essays we were assigned in other classes! And, yeah, we've already read them although they weren't assigned by you. Patronizing and simplistic.\n"
        }
    ]
}