{
    "prof_info": [
        {
            "prof_name": "Jenny Bouboullé",
            "prof_id": 12977,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 01, 2015",
            "review_content": "\nWorse teacher I have ever had. If you see that you have Jenny Boulboulle for CC, DROP OUT IMMEDIATELY. Switch sections, even if the only available section is with a very hard teacher at an 8:40am class.... To stay in Jenny Boulboulle's class is to learn nothing at all, thus wasting 100 dollars an hour for 4 hours a week being bored out of your mind by a \"teacher\" who does the reading at the same time as her students....Jenny Boulboulle is thoroughly unprepared to teach - not only CC because she hasn't read or understands the texts - but she cannot teach, period. She is even less capable of leading a class discussion, because she simply does not know what she is talking about. When students contribute a comment to the discussion, Jenny Boulboulle stares back at the student with blank, uncomprehending eyes, and then without a single word of acknowledgment of the comment, points to the next raised hand she sees. And so on, for the entire 2 hours. \nNot only is class incredibly dull, Jenny Boulboulle consistently demonstrates her belief that CC is the ONE AND ONLY class that each of her students take...she has no regard for course load, piles on reading and assignments over school breaks like Spring Break and Winter Break. She gives egregiously inconsistent examinations and requirements for papers and assignments...on one paper, she only wants completion grade (and won't hand back the papers until several months later, no exaggeration)... on the midterm exam, she out of the f**king blue decides that in a half page \"quote close-reading,\" she wants us actually to reference other authors from the last semester, and touch on all general themes and ideas of the entire book - opposite from what everyone has learned thus far to entail \"quote close-reading\". \nI could go on for days about why you must avoid Jenny Boulboulle at all costs. Save yourself the feeling of slowly withering away for 2 grueling hours with an incompetent teacher twice a week, only to be slammed with ridiculous expectations of reading material and \"take home midterm\" exams that take over 10 hours to complete... only for her to flippantly declare in class (read: not on paper, but to the whole class, because she cannot take the time to write valuable comments/explanations as to why you received a B- on an exam you spent a full week and 2 all-nighters on and was incredibly proud of). No explanation at all - and when a student asked for her reasoning, she straight up looked at the student and then IGNORED HER QUESTION. \nPlease, save yourself. Or better yet, Columbia: don't impose terrible teachers on your students. We work way to hard to come here to get teachers that wouldn't have been coherent or experienced enough to be hired at my public elementary school. \nWorkload:\n15 minute podcasts (which are useless and related to the course material only by a THREAD)\ntoo many pages of reading (the number of pages varies depending on the writing style of the author)\nridiculous exams with outrageous, and unexplained/un-established (before AND after) expectations and rubrics\nan extra 3+ hours (fall semester it was a required 6 extra hours) outside of class time DURING READING WEEK (because she doesn't understand what reading week is/that CC is not our only class) to listen to other students' presentations. \n\n"
        }
    ]
}