{
    "prof_info": [
        {
            "prof_name": "Michelle Morris",
            "prof_id": 2671,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 30, 2006",
            "review_content": "\nUgh!  Michelle, Michelle, Michelle.  There is good news and bad news.  You should take her course.  She is pretty straightforward about her expectations, it's easy if you study adequately, and she'll meet with you 1-1 and be helpful.   Lecture, however, will make you want to shoot yourself.  She asks really dumb questions and then when nobody wants to be the fool to answer them, she thinks we don't know the answers, so she just asks worse questions.  She moved at a VERY slow pace and we did not even finish the syllabus.  We spent 4 classes on the Parthenon and half a class on Jackson Pollock.  She seems very nervous and not in control of herself, she laughs nervously and paces back and forth in class.  She also freaks out when her technology isn't working perfectly.  All in all it's an ok way to get the requirement out of the way, but the tradeoff for an easy class is a BORING class.\nWorkload:\nmidterm, final (easy, expectations made clear).  3 papers (graded toughly, but as long as she knows you work hard on them, you'll be fine)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 18, 2005",
            "review_content": "\nMichelle is a by-the-book Art Hum instructor. Class discussions were stimulating and she was very kind and a moderate grader. \nWorkload:\n4 papers (lowest grade dropped) midterm, final.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 29, 2005",
            "review_content": "\nMichelle is sweet and new at teaching, she pretty much sticks to the art hum syllabus which can be  illuminating at times.  She is a fair grader and really appreciates participation- she has a tendency to laugh at her own jokes ;)\nWorkload:\n3 out of 4 papers short (4-5 double spaced pages), a quiz, a midterm, and a final with ID's  and comparisons.\n"
        }
    ]
}