{
    "prof_info": [
        {
            "prof_name": "Ghazzal Dabiri",
            "prof_id": 5583,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Persian I",
            "review_date": "January 02, 2011",
            "review_content": "\nThe class starts pretty manageably but gets rather hard after mid-semester. You'll definitely get a hang of the written language if you practice enough and do the homework. Ghazzal is sweet deep down, but likes to seem like a hard ass. But to some students in the class, she *is* a hard ass. \nRight before the final, she basically told us we had to know Chapter 9 and 10 (although she told us to know the Vocab earlier on), the way it unfolded was just abominable. The amount of new material -- not just vocab -- but actual grammar, was rather unfair as I saw many students suffer because of it. I don't think she gives out A+s, since I had ~98 average score and got an A. It's a smaller department and thus probably a little more subjective / BS. Some people who clearly didn't do as well got As. It's how much effort you \"look\" like you're putting in, I guess. \nOverall, she's a good pedagogue. Tells it like it is and is straightforward. You'll have to try to decipher her handwriting sometimes, but it's her way of pushing you to read carefully and it'll only benefit you in the end. Most of the heritage speakers can't read or write, so don't worry about them making you look bad. They speak and understand relatively well, of course. But then again, most of it is more formal Persian which they don't commonly use. In other words, you'll be fine if you've never said a word in Persian before.\nWorkload:\n3-4 quizzes. HW every lesson. Hard final.\n"
        },
        {
            "course_name": "Elementary Persian I",
            "review_date": "June 27, 2010",
            "review_content": "\nDr. Dabiri is a very dedicated instructor, but there were a lot of structural problems with her class. It only met twice a week, which is really unusual for a language class and meant that each class session was a bit too long to be as useful as one might hope. We spent the first hour with a grammar book learning how to translate back and forth between English and Persian and then we took a break and reconvened to spend an hour reading dialogs to each other out of a book that we didn't use for anything else. We never practiced forming new sentences or having simple conversations; we just read canned phrases to each other for an hour every Monday and Wednesday.\nEveryone in the class did seem to get a handle on reading the script and translating basic sentences, neither of which is an easy thing to do or teach. But nobody (with the exception of the native speakers who were there to learn how to read and write) walked out of that classroom with the ability to express a simple thought in Persian. We may as well have been learning Latin instead of living language.\nWorkload:\nA light amount of homework and really basic tests. There was a lot of busywork, though.\n"
        }
    ]
}