{
    "prof_info": [
        {
            "prof_name": "Shelly Fredman",
            "prof_id": 4532,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Essay Writing",
            "review_date": "November 11, 2013",
            "review_content": "\nThis class used to be called Essay Writing - I believe it's now called The Art of the Essay.\nThe singular best course I've taken the Columbia system. Shelly will not only teach you how to write better papers, but also how to consider your emotions and daily life occurrences in creative ways. I learned to write in ways I have never even considered before: one such technique, which she informally calls \"juggling balls,\" works by carrying a metaphor from one anecdote to another and using the two to develop a common theme. She'll teach you these writing methods through example though - no lecturing on a blackboard. All techniques and stylistic methods that Shelly teaches she'll teach by pointing out specific usages in an the example reading, and then working with you to use them in your own writing. \nTake a look at Jo Ann Beard's \"The Fourth State of Matter\" via Google. She teaches you to write like that. \nThe course is seminar style, with approximately 15 students. You'll get to know your classmates (and Shelly) incredibly well due to the personal nature of the essays, and you'll become really close friends who help each other improve. Class meets once a week, which is a pity, because I wouldn't have minded if it met more often.\nDisclaimer: I'm a biochemistry major, and have no extensive background in writing. I still loved this class more than anything else - it's simply that amazing. Take this class. You won't regret it. \n\nWorkload:\nFour papers, two of which you will workshop. For workshops, you read every paper by your class and provide commentary - Shelly will encourage you by example to write really extensive feedback, which is exhausting, but also incredibly helpful. Objectively, I think this class was probably a lot of work, but it didn't feel like it when I was writing. \nShelly assigns two short essays (about 30 minutes to read) per class. On the non-writing weeks, the work is pretty light. \n"
        },
        {
            "course_name": "First-Year English (Workshop): Legacy of the Mediterranean I",
            "review_date": "November 02, 2011",
            "review_content": "\nGreat Professor! Was not disappointed at all to have her as my professor. She's very friendly, funny, and humble. She is willing to meet with students after class to discuss about their essay. Professor Fredman really knows what she's talking about. Although her class meets 3 times a week I thought it was worth it. Her class really improved my writing skills. She is very easy-going and lenient, you can always email her if you have any questions. Usually for the essay she assigns us to write a rough draft first and she not only edits the paper but also give us a predicted grade. So that was fantastic because you know what she expects from you and you can correct it on your final draft. During class you pretty much discuss about the readings or else peer-edit your essays. It was a fun class!  \nWorkload:\nNot that much. We read about one book per two weeks and we dont have to read all of it eg. the Odyssey or Dante. We only read 10 chapters out of the 35 or so. There are 2 essays about the readings we do and it can be on any topic (4-6 pages double space) and 1 big research paper (6-8 pages double space). \n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "September 28, 2009",
            "review_content": "\nShelly Fredman is a great professor. She's willing to change her syllabus to the student's needs and she's always willing to help you after class. About one essay per month, maybe two at most not a lot at all. She is very friendly, open minded, discusses her daughter who is a first year in college just like all of us in First Year English. \nWorkload:\nAbout 1 book per week, one to two essays per month \n"
        }
    ]
}