{
    "prof_info": [
        {
            "prof_name": "Diedi Hu",
            "prof_id": 11070,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "General Physics Lab I",
            "review_date": "December 15, 2010",
            "review_content": "\nThough Diedi Hu in her gray and pink argyle cardigan is possibly the sweetest and most demure person I've ever stepped on, the language barrier did come to be a problem at many a point throughout the class. Diedi is clearly a competent well informed person, but it was hard to draw that out from her. My lab group would try and try to have her explain concepts or practical aspects of the lab, until part of the way through the semester we realized it was better to do it all on our own and not wait for Diedi's semi-comprehensible help.\nThis isn't to say Diedi isn't a great person or decent instructor. She fed us any formulas we needed to derived in her instruction period before the class and went over the concepts of the lab already explained in the lab packet. It was thus really up to the student to decide if they wanted to do any prep work - I personally did just so I could be on top of what needed to be done. Towards the beginning of the semester Diedi allowed me to stay late on the already late class to complete it, but the last few labs which got easier I was readily out only an hour and a half later thanks to my lab partners.\nDiedi is a sweet person, kind to the mild jokes we throw her way about the lab - but at the end of the day she knows she grades your labs. And significant digits count. Ridiculously. \nWorkload:\nA typical Physics Lab. Barely any prep work prior to class - Diedi goes over all the information in class, though it's suggested (and I would suggest) you read through it to know what the hell you have to do. For the two derivations required throughout the semester - Diedi fed us the first one, but checked to see if we had done the second one at home. \nLabs are otherwise entirely done in class and handed in at the end. \n"
        }
    ]
}