{
    "prof_info": [
        {
            "prof_name": "Rachel Schwerin",
            "prof_id": 13213,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "UWriting",
            "review_date": "July 18, 2016",
            "review_content": "\nWhen I first found out I was placed in the American Studies session, I immediately attempted to switch because I have never had any interest in the subject. After countless hours of negotiation, I eventually failed and mentally prepared myself for the worst. What made me feel worse was that Ms. Schwerin seemed to be very strict and serious in the first class.\nHowever, Ms. Schwerin turned out to be a fantastic teacher and made my UWriting experience a completely positive one. She lead class discussions incredibly well and always posed intellectually stimulating questions that really drove me to think deeply about the materials we read. Since she has a background in art, she incorporated art into the American Studies context, which significantly rendered the class more enjoyable. Sure some readings were rather dry, but time always passed by pretty quickly in class. Ms. Schwerin was also super patient and always made herself available whenever I had questions or needed revision advices. I remember one time I emailed her about a part in the reading that I didn't quite understand, and her response was literally like an essay; it not only clarified my original confusion, but also helped me to gain a deeper understanding of the text. At the end of the course, I definitely felt I became a better writer and actually for the first time started enjoying writing.\nIf you put in the work and show her your genuine effort, you'll be fine even if you are not a fantastic writer. It's all about how much you improve.\nWorkload:\nTypical UWriting workload with lots of reading\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 30, 2016",
            "review_content": "\nI learned how to properly revise and articulate myself on a sentence-by-sentence basis. The handouts were extremely helpful, and I won't ever throw them away. I have applied skills learned in this class throughout other classes already throughout this semester.\nThe course is extremely beneficial in its selected readings, and how to evaluate what is necessary in a research essay and what isn't in terms of the radical revising tactics. This course is extremely strong in that you build strong connections with your teacher as you are in a class with around 13 other individuals. The teacher brought in outside sources that we had read as actual voices in the classroom, which was strongly advantageous-- ie Susan Rosenberg came into our class and discussed her book, An American Radical, openly and honestly.\nMs. Schwerin gave me the most feedback I've received in college thus far. She was always available to meet outside of class about difficult concepts or on paper ideas and extremely accessible through email. This was my favorite class this semester. She generated lots of class discussion about random topics as well as connections through other sections of the course. Her timeliness of even the longest assignments was efficient. What you get out of this course entirely depends on the work that you put in outside of class. Her selected readings were always pleasant. Feel both blessed and lucky if you get Ms. Schwerin for UW. \n\nWorkload:\nHeavy, but all worth it for Schwerin\n"
        }
    ]
}