{
    "prof_info": [
        {
            "prof_name": "Alexandra Cirone",
            "prof_id": 10995,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 08, 2011",
            "review_content": "\nThe other reviewers generally have it right when it comes to Professor Huber's abilities as a lecturer - he is on the whole painfully dry, uninteresting, disorganized and unable to engage students, and reads off his own notes for most of the lectures (with the exception of a couple when we learned about the median voter theorem/party politics that were actually interesting). It was so easy to just fall asleep during lecture, especially as the lecture slides by Professor Huber were just as disorganized as his teaching, with numerous spelling errors and no real attempt at clarity of explanation, which made them very difficult to revise from and review concepts unless you paid extremely close attention in class. There is no denying, however, that the material covered in class was very interesting and compelling - I very much liked the first half of the semester's work on concepts of democracy, though it is also true that many of the readings were way too long, and seemed unnecessarily so, especially as some of them weren't even discussed. It was virtually impossible to have done all of the weekly readings by the midterm/final (at least if you really wanted to have a thorough understanding of content). My other gripe, which may seem strange, is that I felt that the final did not adequately cover all the material we learnt, perhaps because the breadth of the course material was just so wide. \nThis class's ONLY saving grace is Ali (the TA), who is absolutely FANTASTIC. She is the complete opposite of Huber - lively, engaging, energetic, able to stimulate discussion and keep them interesting, and organized. She was competent, responsible and knowledgeable, and always comes to section prepared with her own summaries of all the week's readings (pretty remarkable when you consider how many there were). Most importantly, she clearly cared very much about students, and was always willing to help us out outside of class (whether it was with papers, reviewing them after we got them back, or revising for the exams). I honestly think this class was only made bearable by her and her hard work, especially as she made a lot of the concepts we learnt a lot easier to understand (a far cry from the other TAs, whose sections I also went for).\nOn the whole, an interesting class that is worth taking (based on the material), but I'd stay clear from Huber's class; you'd be better off with another professor. Take his class only if you have Ali as a TA. \nWorkload:\n2 three-page papers (one before and one after the midterm, both worth 20%), one midterm (worth 25%, with IDs, short answers based on readings and one long essay), one final (worth 35%, with IDs, calculations, and two short essays).\n"
        }
    ]
}