{
    "prof_info": [
        {
            "prof_name": "David Vela-Vick",
            "prof_id": 10394,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "January 28, 2012",
            "review_content": "\nI had Prof. Vela-Vick for Calc 1.  I took Calc 1 in high school, and expected this class to be a nice review over what I had learned before (READ: easy A). Vela-Vick seemed to almost over-simplify terms and concepts, but after getting used to his teaching style - he labels everything that he deems important as \"definition\" or \"theorum\" or \"tip\" and occasionally even states \"this is very, very important\". He is not very approachable in office hours (semi-standoffish), but is overall a friendly person.  Sit in the front of the class - he can be pretty soft-spoken at times.  Vela-Vick gives practice exams before the test (posts about a week before the exam), and then posts the answers (with work!) about 2-4 days before the exam itself.  The practice exams were very indicative of the actual tests, with maybe one or two problems thrown in from WebAssign or the homework. I found the midterms to be very fair, and are extremely do-able with some studying beforehand.\nWorkload:\n2 midterm exams (20% each), 4-5 WebAssign problems and ~15 bookwork homework problems a week (20% of grade, drops lowest WebAssign and homework), and 1 final (40%)\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "October 15, 2011",
            "review_content": "\nProfessor Vela-Vick is a really cool, down to earth and strait forward guy. Taking my first math course at Columbia certainly was nerve wrecking (Calculus 1), but after experiencing his teaching style my concerns were put to rest. He's very smart but yet is able to relate/communicate effectively to those of us who aren't mathematicians. He goes over concepts/examples in class, and our homework is nearly identical with a few difficult questions that just make you think for a while (at least for me). He gives a practice exam right before the test which is probably 80% similar to the actual test, the remaining 20% comes from 1 or 2 questions he chose from the homework. If you study the homework/in class examples/ practice test you're in great shape. I'm only half way through his class so I can't comment on the other midterm or final, but I'm assuming this all applies.\nTaking his class and doing well ensures you have a very very very good understanding of the subject. \nWorkload:\nHomework (fair amount of problem sets which are graded, weekly web-assign), 2 mid terms and 1 final. It's worth while to spend time on the homework, writing out everything neatly so you learn the material and you get the most points possible (homework points are basically free points, right?). \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 19, 2011",
            "review_content": "\nHe is a very soft spoken, timid professor (and actually kind of adorable). In class, he tends to rush over things and assume you know the material; however, if you've taken Calc 2 or something like it before, you'll probably find the class easy. The exams are not difficult (the problem sets are way harder) and he's very generous with giving out a practice exam right before. It can be frustrating because his lectures are often not very organized - frequently he makes mistakes in the examples. Overall, he isn't God awful, but it's not a guaranteed A by any means. At best, a sufficient review of calc 2 for seasoned people. Since lectures are not necessarily that demanding, it's a chill class for those who are mathematically inclined and want to skip a few without feeling like you've missed anything. Chances are, you probably didn't. \nWorkload:\n1 problem set a week (10%), some of the problems are mad hard and the grading is not very generous. 2 midterms(20% each), 1 final (40%), 10% \"participation\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 13, 2011",
            "review_content": "\nFirst, he goes by Shea, his middle name.\nShea was an excellent teacher for Calc II. I took Calc BC in high school, so I was very comfortable with about 2/3 of the material, but I definitely needed some review. Shea went over things in a very logical fashion in class, and his notes were extremely clear. He would always label things as \"idea,\" \"theorem,\" \"definition,\" \"example,\" and even \"Pro-Tip.\" He was very good at answering questions and clearing up misunderstandings. He took every question seriously and never talked down to students who were having a hard time. \nFor exams, he provided a sheet with common trig identities, derivatives, and integrals (both of which included trig functions), which prevented students from memorizing things for no reason. He gave out the formula sheet before the exam so we would know what we would have at our disposal during exams. The formula sheet was the same for the whole course.\nFor both midterms and the final, he provided practice exams that were supposed to be about the same as the exams in length, difficulty, and sort of problem, though he specified that just because a topic did not appear on a practice test did not mean it would not be on the exam. I noticed on one of these practice exams that he had just taken problems from the book, but that it essentially what his tests were like so there was no harm in that. The exams were similar to the homework, with no curveball questions that try to trick you.\nHe did move pretty quickly through some of the material, but I think if you do the homework and go to office hours (I never went, but based on his personality and behavior in class I imagine they would be quite helpful) if you need to you should be okay. I recommend him.\n\nWorkload:\nWeekly problem sets covering usually 2 or 3 sections of the textbook, 2 midterms, final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 11, 2011",
            "review_content": "\nHorrible instructor. Do not take this instructor if you care about your grades. Does not reward hard work, although he gives long and difficult HW. Prevaricated about grading (said there was a participation grade which he shifted and twisted on: unclear how he assessed this). Seemed to be a petty person and combative with students' legitimate inquiries about scoring and assessments; although encouraged classroom participation. If expecting solid grades, take a more reasonable instructor, who accounts for the overall quality of classroom instruction, participation, consistent progress and industry. He seemed to wing through the class. Did not realize that providing practice midterms to students would help the class, until a student suggested it. He only provided a practice exam a day or 2 before the exam, and subsequently posted only answers and no explanation to the problems. Did not post any solutions to the HW, or exams after grading (unlike other diligent instructors); his lame excuse was that answers to his problems would be distributed everywhere (how petty, and endemic of lazy instructors).\nWorkload:\nHeavy, about 20 or more long problems a week (right till the exam week). HW: 20%; \n2 midterms: 20% each, final: 40%. Dubious participation grade??? Smacks of bias/unfairness.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 01, 2011",
            "review_content": "\nProfessor Vela-Vick, who goes by his middle name, Shea, is a great choice for Calculus II. Shea mostly lectured from the textbook, but usually did a good job of distilling the technical language into simpler terms. The material was sometimes difficult, but he always took time to stop and answer everyone's questions and was never dismissive or condescending when people were slow to understand concepts.\nAdmittedly, things moved fast (especially towards the end of the semester with Taylor and Maclaurin Series) but Shea was always very helpful and approachable during office hours. He scheduled extra office hours for the weeks leading up to finals and was always willing to schedule another meeting time if regular hours didn't work for you. In addition, he's a very nice guy who cares a lot about his students, and he will tell you interesting/funny math stories if you talk to him. During the final, he brought lifesaver candies for the class because he had heard of a \"statistical correlation between peppermint consumption and test performance.\"\nThe weekly problem sets were moderately difficult, but the two midterms and final were easier than the homework and practice tests he gave. At any rate, if you stay on top of your work and go to office hours for those difficult problems, you'll be fine.\nWorkload:\nWeekly problem sets 20% (mostly even problems, moderate difficulty), Midterms 20% each, Final 40%.\n"
        }
    ]
}