{
    "prof_info": [
        {
            "prof_name": "Bradley Abrams",
            "prof_id": 2050,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "East Central Europe in the 19th Century",
            "review_date": "June 19, 2005",
            "review_content": "\nThis class deals largely with the Hapsburg Empire in the 19th Century, with some emphasis (somewhere from 10-20% of the class) focusing on Poland. I love this stuff, so this class was very interesting to me and Iloved it (this could be said of any class someone enjoyed I suppose), but Brad definitely presents the information well - detailed, clearly, interestingly, and often, quite funnily. Lectures are PACKED with information though, and this is where the majority of the information on your tests comes from, so it would be wise to go and learn it. \nThe most annoying part of this class is the required, weekly discussion section. I felt like it was somewhat of a waste of time - we reviewed what we went over in class (but, if you were in class, then, who cares?), and we discussed the reading (that was interesting). The reading selection for this class was mixed - there's A LOT of it, and it ranges in quality. Some of it is dry and unbearable, but enough of it is informative (the textbooks, for instance) or even just great (Radetzky March). The paper also required a lot of research, but was interesting. If you're interested in this period or region even just a little bit, take this class. I really liked it. \nWorkload:\nWell, a lot. Aforementioned weekly discussion section (my TA required us to e-mail him 3 questions about the reading for each meeting), a midterm, a 9-11 page final paper, and a final, similar to the midterm, with a 2500 word, pain-in-the-ass take home component. A lot, but not impossible. \n"
        },
        {
            "course_name": "East/Central European History",
            "review_date": "January 21, 2005",
            "review_content": "\nBrad is an awesome professor.  His lectures are interesting and engaging, and he is always well prepared and well organized.  A HUGE AMOUNT OF READING, and you have to take not of the most mundane details in order to do well on the exams.  But if you're a history buff, and into this region, it's definitely worth it.  I can't decide if it was worth it for me or not - it was very enjoyable and I learned a lot, but it was just for fun and I got only a mediocre grade.\nWorkload:\nA couple of easy quizes, in-class midterm with a take home component, final, paper, 3 films.\n"
        },
        {
            "course_name": "East Central European Intellectuals and Communists 1945-1989",
            "review_date": "January 03, 2005",
            "review_content": "\nI agree wholeheartedly with the previous reviewer. Although the subject was fascinating and the reading list excellent, I often felt in over my head in terms of the historical context of the material. The class description claims that no prior knowledge of the subject is necessary, but understanding more about the context of the works we read would certainly have allowed for more dynamic discussions and a better seminar experience. That said, Abrams is an engaging professor whose passion for the subject and entertaining presentation of the material kept me excited about the class.\nWorkload:\nApproximately one book per week and a 20-page research paper\n"
        },
        {
            "course_name": "East Central European Intellectuals and Communists 1945-1989",
            "review_date": "November 23, 2004",
            "review_content": "\nTo me, this class is like taking East European CC. If you like political theory and you liked CC, then you'll love this class. Great readings, and the course load isn't even that heavy. Abrams is very, very knowledgeable, and it's fascinating to hear about his research in East Central Europe. That said, the weakness of this class is the fact that only one student had previously taken a class on Eastern European history and many of us felt as though we didn't really know the history behind the books we were discussing. I would definitely recommend taking this class if you know the basics of East Central European history, or if you are willing to do some outside reading (which is possible since the class readings aren't that heavy). All in all, very interesting topic, great prof. and reasonable workload. I would also like to add that Abrams is great outside of the class too- very helpful and encouraging, and really cares about his students. \nWorkload:\n50% class participation (including leading discussion one day) and 50% final 25-pg paper on topic of your choice. relatively light reading for a seminar.\n"
        },
        {
            "course_name": "Senior Thesis in Non-US Topic",
            "review_date": "April 27, 2004",
            "review_content": "\nBrad is fantastic - I couldn't have asked for more in a thesis seminar instructor. First, he kept it simple - no stupid, distracting assignments that didn't contribute to our work. Second, he's smart, critical, and engaged. Third, he's incredibly invested in students, as well as social with them. And he'll go to bat for you if you've earned it.\nWorkload:\nUm...senior thesis. It's hard.\n"
        }
    ]
}