{
    "prof_info": [
        {
            "prof_name": "Ariel Bernstein",
            "prof_id": 13202,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Organizational Psychology",
            "review_date": "May 03, 2017",
            "review_content": "\nProfessor Bernstein CARES. He cares about what he teaches and how he teaches it. He also genuinely cares that you learn something in his class both about the field of organizational psychology and about yourself . He cares about being a good teacher and often provides opportunity for his students to give him feedback throughout the semester. He also cares about being a fair grader and provides extra credit opportunities and give students who have attended every lecture 5 points of extra credit, which allows the work of those who go the extra mile to be recognized. Most of all, he cares about his students and the experience that they have in his classroom.\nI personally think that teachers who care are the best teachers - and therefore it is no surprise that Professor Bernstein's class on organizational psychology was one of the best I've ever taken at Columbia/ Barnard.\nWorkload:\nA midterm, final paper, final presentation, weekly readings, 4 reflective practices and a few group assignments.\nThis seems like a lot but it really isn't that bad because assignments are interesting and often self-relevant.\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 28, 2017",
            "review_content": "\nThe topic is beyond interesting, but the delivery is what makes this a must-take class. You will be using concepts you learn from this class in your everyday life and it will help you combat biases you'll run into in the future. Ariel is the perfect conduit to bring you the information and you will find yourself enjoying the hell out of classes.\nThere is a reason a lottery system is required at the beginning of the semester. Take the course. \nWorkload:\nDigestible and interesting readings every class, midterm, a few group projects, final paper and final presentation. \n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "May 24, 2016",
            "review_content": "\nAriel is one of the best professors that I have had at Barnard/Columbia. He covers information thoroughly and in a manner that is interactive and helps you retain the information. He seems to genuinely care about students and the subject material. My only complaint is that we had covered more information as I found I/O psychology very interesting. \nWorkload:\nreadings every week, group assignments (2-3), midterm exam, final paper\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "May 17, 2016",
            "review_content": "\nProfessor Bernstein is great! He does a nice job of balancing between lectures and discussions. He is not only receptive to feedback but genuinely encourages it on a regular basis, using the continue-start-stop notecards. He tries to make the learning material as relevant as possible to graduating seniors, and so you leave the classroom feeling like you've learned more about yourself and how you work with others. He is a really fair instructor in that he provides detailed feedback on assignments and provides sufficient time for completing assignments. Overall, he seems to care a lot about his students!\nWorkload:\na couple short readings before each class, a group paper written mostly in class, midterm, a final paper, and a group presentation. overall not too bad. \n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "May 04, 2016",
            "review_content": "\nAriel is a gem. He is patient, funny, smart, intentional, and engaging. He wants class to be enjoyable and wants students to learn. He clearly is passionate about Organizational/Industrial Psychology, and he knows a ton about it.\nAriel is like a how-to book for what every professor should do. He invites feedback, makes us work in groups, has us give each other anonymous feedback to our team members, and gives us unique and varied assignments. This course is a psychology must-take.\nIf you do not get into this course at first (enrollment is strictly capped and it's very popular), email him and ask to be held on a list for the next semester. If he continues this policy, it is completely reliable and he is super responsible about it.\nThis course will force you to think critically about organizations and institutions with which you have come in contact in the best way. It will also force you to think about your own strengths in a very useful way, as well as the ways in which you work in a team.\nDefinitely take this class.\nWorkload:\nTotally reasonable.\n4 short reflections throughout the semester\n1 midterm (fair, not too hard) on the first half of the semester\n1 group case project as part of the midterm\n1 final group presentation\n1 final paper (6-8 pages), independent\noptional extra credit\nweekly readings - textbook not necessary to read (Ariel will tell you this); definitely read the articles for the purpose of assignments and class discussions\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 28, 2016",
            "review_content": "\nHands down, one of my top 3 favorite classes I've taken in college, maybe even my absolute favorite. Professor Bernstein really makes the class into a personal journey for every student, allowing you to take a learning orientation (focusing on what you learn and take away from the class) as opposed to a performance orientation (getting a good grade in the class). Your grade is a reflection of your effort and dedication. Above any other class, I truly felt like what I put into the class, I more than got out of it. You get a group for projects throughout the semester, but this experience was unlike any other I've ever had in a positive way. Groups are made based on individual evaluations that put people who complement each other together, so we were able to work together in the highest capacity I've ever seen in a group dynamic. They were the best group-project experiences I've ever had.\nThroughout the course, he encourages you and gives assignments that help you reflect on yourself, your progress, learn about who you are, and what you're strengths and weaknesses are. He holds himself to the same high standards that he holds his students, and keeps everything as fair as possible. Rather than rely on only course evaluations at the end of the semester to improve himself and the class, he takes the time to give students the opportunity to anonymously give him feedback and constructive criticism. This way, the every facet of the class improves while you're there (instead of just benefitting the next semester's class) and becomes tailored to what's best for the students. If you can get into this class, take it. I learned so much about myself-- things that I'll take with me, wherever I go, for the rest of my life. Best thing I could've done senior year.\nAlso he's probably one of the hottest professors I've ever had. Definitely payed attention because I liked the course material, but I gotta say it didn't hurt that he's easy on the eyes. (Sorry ladies, he's married!)\nWorkload:\nThe following might seem like a lot, but I one of those people who complains about workload all the time and even I thought it wasn't bad at all. Readings/TedTalks for every class, but they're all really interesting! In class midterms exam, approx bi-monthly surveys, monthly \"reflections in practice\" to help you better digest the material as it apples to you, 2 group case memorandums, individual case analysis. \n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 26, 2016",
            "review_content": "\nAriel is an incredibly down-to-earth and self-aware professor who really takes the time to get to know his students. He loves feedback to tailor the class to student needs. The class usually starts out with 5-8 minutes spent on an attendance question (really easy questions like what's your favorite place to visit, or a person you would want to work with, etc.). These are light-hearted questions that allow him to get to know students better as well foster a friendly atmosphere inside the classroom.\nHe has a powerpoint ready for each lecture and really encourages students to ask questions throughout the class as well as foster discussion with classmates. We usually have to read 1-2 articles or watch a short video for each class. However, these readings and videos are super interesting so it doesn't take long at all. \nDuring some classes, we break off into groups to do small in-class tasks which has relevance to the day's lecture topic. Also, we're assigned groups to work with for our case analysis and end-of-semester presentations. The groups aren't made completely random; he asks students to complete a team role inventory form so groups are balanced in terms of different working styles and group contributions.\nCourse Topics\na) Introduction to Industrial/Organizational Psychology \nb) The Individual in the Organization \nc) The Group in the Organization \nd) The Organization as a Whole \nOverall, organizational psychology is a very interesting field and I wish I got to major in something like this during college. The topics are very relevant for graduating seniors in terms of  understanding dynamics in the workplace, teamwork, and leadership. Ariel is also super fun and presented the material that made coming to class worth it. Our class was at 6pm 2x week but no one ever fell asleep and remained super engaged (definitely a hallmark of success for an evening class). \n\nWorkload:\nGroup Case Analysis \nMid Term Exam \nIndividual Case Analysis (Paper) \nGroup Case Presentation \nReflections in Practice \nTeam Contribution / 360 scores \nAttendance \nEverything is pretty easy as long as you follow the material/concepts in class and incorporate them into the work you hand in. \n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 26, 2016",
            "review_content": "\nAriel is an absolutely amazing professor! This is one of those classes that keeps your attention and always seems to fly by. The class is interesting and all the information is presented in an easy to digest manner. Ariel is very interested in creating an open environment in the classroom and is always transparent with students. He brings in real life examples to demonstrate topics, as well as welcomes any questions students may have. I could not recommend this class and professor enough! This was definitely one of the best classes I have taken at Barnard!!!\nWorkload:\nVery reasonable! A lot of podcasts and news articles, all very interesting and usually easy to read. It is very necessary to do the reading the first half of the class because there is a midterm. The second half is less necessary, but they interesting discussed in class discussions. \n- Midterm (strait forward, as long as you go to class and do readings and review you will make an A)\n- Group Case Study Paper (given time in class, and only requires a few hours outside of class)\n- Group Case Study Presentation\n- Individual Case Study Paper\n- 3-5 short reflection papers\n- GIVES EXTRA CREDIT\n"
        },
        {
            "course_name": "Organizational Psychology",
            "review_date": "April 25, 2016",
            "review_content": "\nAriel is fantastic. He is very open about having students ask questions to foster a great classroom conversation.I recommend his class for sure. Everyone said you had to take it with Mateo Cruz but I am not let down at all by Ariel. He is a great teacher who is engaging and knowledgable. I loved his transparency and funny humor (usually regarding his dog Maximus who is rumored to attend our last class).\nTake this class! =] \nWorkload:\nYou should actually do the assigned readings because there is usually a conversation about them in class. Several reflections (2-4 pages) which are very interesting and eye opening to complete. Some group work (2 papers and a presentation) as well. \n"
        }
    ]
}