{
    "prof_info": [
        {
            "prof_name": "Neni Panourgia",
            "prof_id": 591,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 14, 2011",
            "review_content": "\nI took her during spring semester for CC only because my darling CC professor from fall was leaving to Africa to write a book.  Anyway to sum things up, you will love her or hate her.  I hated her.  First of all there are no papers or even a midterm.  It is just participation and a take home final (that you don't know is a take home final until the last day of class).  If you're really comfortable being very talkative in class and you have a good hold on the texts *just* from reading them then you are absolutely golden.  However, if you're like me, and need some illumination about the reading then you're SOL.  I did not understand half the things this lady said--and not because of her accent--but because she would use the most convoluted and garbled phrasing.  She would go on explaining Hegel's dialectic forever, just to backtrack and say no actually never mind I meant this way.  She explained Freud's id, ego, an superego completely WRONG.  She never appeared to have much of a lesson plan, so while the class might have been engaged in some really interesting conversation, you had no idea what was relevant and should be jotted down in your notes especially since we could get stuck on completely irrelevant tangents for more than half the class. Naturally this left you with completely useless notes by the time you got to the final.\nThe whole no papers or midterm things really bothered me because her expectations about what constitutes appropriate participation are so ambiguous, and she does not give you any personal feedback until the middle of the semester and even then efforts to improve go unnoticed.  She does have an alternate assignment which I switched to where you can write so called 1-2 page response papers every week, but honestly I don't think she even read them since she never returned a single one of them or ever gave me any feedback whatsoever.\nNow for the take home final, it was open book, open notes, \"open internet,\" and you could take \"3 hours or use all 12 days,\" but it was the same thing as with the participation portion: her expectations were completely unclear.  Something you would complete in 3 hours would look a lot different than something you took 2 weeks to complete, but either way  I don't think she even read the finals just like I don't think she read the response papers tbh but just gave you a grade based on how much she liked you, aka \"participation.\"  \nFinally, while some conversations were interesting, she said a lot of things (some of which I found racist) that I took offense to and I never had a teacher, especially at such a prestigious university, ever make me feel so uncomfortable and marginalized in my whole life. \nWorkload:\nNo papers, no midterm, just 50% participation and 50% final.  We didn't read a lot of the things other sections did i.e. we did not touch even a single feminist writing.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 31, 2011",
            "review_content": "\nOutstanding. Panourgia is an incredible intellectual with a sharp wit and a truly caring approach to her class. Although she is definitely a little eccentric, her goal is that you learn how philosophical thought has developed and the connections between each author, rather than a staid knowledge of facts. \nThe class has changed substantially from reviews below. Now, the grade is 50% participation and 50% final: no midterm, no essays. Do not be intimidated by this. In fact, revel in it, as you won't be slaving away on essays but rather learning a tremendous amount in the easiest way possible. The final is take home, but %50 of it is quote IDs (you are encouraged to use the internet as a resource) and you can attempt up to 370 essay points (so potentially end up with a mark of 370/100). \nThe class is basically graded on a scale of A+ to A-.\n\nWorkload:\n50% participation, 50% take home final. Absurdly light. \n"
        },
        {
            "course_name": "Urban Guerrillas",
            "review_date": "April 24, 2011",
            "review_content": "\nI consider myself to be a very liberal person - maybe not by Columbia standards, but certainly by normal American standards.  That said, Urban Guerrillas was the most offensively, stupefyingly leftist course that I have ever taken.  The professor and a majority of the class will openly advocate for violence and terrorism in the name of overthrowing some nondescript, nebulous, Capitalist/Zionist/Fascist conspiracy to control the world.\nAnother reviewer said that students simply need to keep an open mind.  I really wish the professor was able to keep an open mind.  After raising objections to her arguments in the first three weeks and subsequently being insulted and attacked by the prof and other students, I was shamed into keeping my mouth shut for the rest of the semester.\nThis is not an Anthropology class.  This is an ideological circle-j@#k.  If you protested the return of ROTC because the military is a tool of Capitalist oppression, this class is probably for you.  All others stay away.\nWorkload:\nLots of reading.  Some of it quite interesting.  Light papers.\n"
        },
        {
            "course_name": "Fluent Bodies",
            "review_date": "September 08, 2009",
            "review_content": "\nthis class, for the most part, was decent. neni's accent is a little thick, but you can get used to it after a while. my main problem was not necessarily the professor, but the fact that sometimes the discussion would get a little out of hand. maybe it was just the people, or neni's lack of direction sometimes. as an anthro major, though, i found the readings very interesting and worth while, for the most part. also, our TA brian was amazing. i found myself meeting with him more than neni, mostly because she sometimes comes off as cold in office hours. \nWorkload:\npretty light for an anthro seminar. oral midterm, where you just talk with her and the TA with two other students for about 15 minutes. then a 15pg final paper on a topic of your own choice using some of the material (technically a research paper, although a little more open-ended; basically what you wanted to make of it). weekly movies that aren't mandatory, and about 100-150pgs of reading a week.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 19, 2009",
            "review_content": "\nThis has to be one of the worst classes I have yet to take at Columbia. If it had not been for the AMAZING TA i had, i wuld not have done well. Panourgia was always late for class, takes role EVERDAY taking up even more time, and MAYBE talks about the reading for 20 min. She tries to get people to speak up in class but soimetimes you dont even know what she is asking beacuse of her thick accent. I do not recommend this class at all\nWorkload:\nINSANE amount of reading. Have to buy 10-12 books (of which u honestly dont have to read for the midterm or final, as long as you get Sonia as your TA) and its open notes for midterm and final. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 18, 2008",
            "review_content": "\nProfessor Panourgia's Interpretation of Culture class was great. The readings were fascinating, providing a great survey of anthropological thought over the last century. She was an amazingly engaging professor, asking difficult philosophical and ethical questions that left us confused, which I believe is a good thing, because it meant we were thinking. The lectures involved us responding to her discussion questions, and while she let some people ramble, her overall goal was to promote discussion among the students, rather than merely lecturing on the material. For me this format worked but I know many found it frustrating because we often did not fully cover the readings. However, she usually stayed after class to answer or discuss material with students. My only real problem with Professor Panourgia was her inability to give directions. Simple logistical questions were answered in lengthy complicated ways. If you can get past her complex theoretical vocabulary and her scattered style, this class is wonderful. \nWorkload:\nmedium reading load (usually a book and a few articles a week, about 200 pgs a week, although it varies), reasonably easy final and midterm (open notes), kinship chart and report (4-6 pgs) \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 10, 2008",
            "review_content": "\nShe is such a sweet woman and such a knowledgeable professor that I almost feel guilty saying anything negative.  However, despite her high status in the world of anthropology, the syncopated rhythm in the way she speaks and the anthropology jargon she uses to fill her lectures makes the class difficult to understand. In fact, I am confident that I would not understand what the class was about had it not been for my fabulous TA.  Her lectures were very cryptic.  She had a knack for engaging students in lecture but was always too nice to cut them off when they were speaking way too incorrectly for way too long, leaving students scratching their heads saying, \"That girl is STILL speaking?\"  The class is interesting once you figure out what it's trying to say, but that clarity does not come from Professor Panourgia.  We spent at least two lectures going over what she meant by \"kinship chart\" (the one assignment we're given apart from the midterm and the final).  Still, we were unable to decipher the aims of the assignment.  A lovely and brilliant woman, yes, but a clear lecturer she is not.\nWorkload:\nkinship chart (basically a family tree) with 3-5 page analysis, midterm, final, lots of reading (12 books and >10 articles) but you don't need to read any of them although I would recommend reading what you can because they are interesting\n"
        },
        {
            "course_name": "Urban Guerrillas",
            "review_date": "March 04, 2006",
            "review_content": "\nNeni is absolutely inspiring and engaging, UG was one of the best classes i've taken here. Even for those who may think that they're lateral thinkers, Neni opens up new perspectives and new ideas. \nHowever, moderate liberals and conservatives beware...the class is about tactics that various leftists movements took after all. generally discussions in class (on issues like class, education, revolution & political despair) will take an ultra-liberal turn, and if you aren't willing to examine the disposition of the outlaw or consider the validity in some radical ideology, you'll just find this class a frustrating waste of your time.\nWorkload:\nHeavy (but for the most part interesting) reading; film viewings outside of class. Two papers, one short film response, but she's an easy grader.  Neni also brings in several fantastic guest speakers.\n"
        },
        {
            "course_name": "Fluent Bodies",
            "review_date": "January 22, 2006",
            "review_content": "\nNeni is one of the best professors in the Anthro Dept. I've taken 2 seminars with her and was planning on taking a third but the schedule did not work out. Neni cares about her students and isn't afraid to say some controversial things. The readings are always great. I especially enjoyed Urban Guerillas because she obviously really cared about the class and brought in movies and special guest speakers. The reading is always manageable too (50-100 pages a week). I only wish that she was a little better at keeping the class on topic. Neni is a brilliant lecturer but most of the class becomes a free-for-all with students discussing whatever current events interest them most.  \nWorkload:\n50-100 pgs. of reading a week, two papers (one 6 pgs. one 12 pgs.). Fair grader.\n"
        },
        {
            "course_name": "Exiles/Enclosures/Dystopias",
            "review_date": "January 06, 2006",
            "review_content": "\nWhile Professor Panourgia is a joy to talk to during office hours, she did not run this graduate seminar very well at all.  The readings were quite interesting, but the professor failed to effectively stimulate discussion.  She lectured non-stop on topics that were often unrelated to the readings.  While her digressions were sometimes interesting, I often came away from class without ever having a chance to discuss the (often quite dense) theoretical readings we were assigned.  Granted, sometimes interesting discussions would unfold when students interrupted her constant digressions, but these incidents were rare, and generally only included one or two students in the class.  \nProfessor Panourgia might be quite interesting to listen to in an undergraduate lecture course, but I would not recommend her to graduate students interested in seminar discussion.\nWorkload:\nrelatively light reading for a grad class, 1 seminar paper\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "June 07, 2005",
            "review_content": "\nPanourgia is a very good teacher. She is kind, interesting, and helpful. She was sick a lot last semester so we ended up missing a bit of class...also because of the strikes.\nOur TA was horrible and an evil grader. Discussion sections were extremely boring but were only held after we watched videos. Videos were interesting sometimes, but usually not. HOwever, Panourgia would grade the same material and they would discuss the grade given. After Panourgia it would usually be raised.\nOverall, the class is eye-opening just in terms of the world and what not. But the material is not that interesting. A couple of the books were though, and I'm sure other people would enjoy the class more than I would.\nWorkload:\nA kinship chart; an observation report; an ethnography report; midterm; final\n"
        },
        {
            "course_name": "Culture of Oedipus",
            "review_date": "April 26, 2005",
            "review_content": "\nProf. Panourgia is brilliant. I can understand why the other reviewers find her disorganized. You might call it disorganized, but in the ideal academic world, it's an open forum. She is incredibly respectful of her students and the general power dynamic between professors and students. She doesn't want to dole out a grade and call it a day. Your thoughts matter to her, as long as they're constructive. True, we didn't follow the syllabus. It became, \"Uh, I don't have Adorno in my frontal lobe, so this book is hard.\" \"Oh, I thought you did. Read some of Dialectic of Enlightenment for next week.\" Anyway, not enough good things to say about her. Anyone who starts off a sentence with, \"Back in my Communist youth in Athens,\" is probably worth taking a class with, right? Right. \nWorkload:\na ton of reading, one 15-page paper\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 10, 2005",
            "review_content": "\nDo not take this class. The teachers spent the first 6 classes (after which I could not take it anymore and had to drop it) discussing various ways to think about anthropology while using gigantic probably nonexistent words and not actually getting into the \"meat\" of things or saying anything interesting about a specific culture. My high school anthropology teacher was better than this. And I'm sorry, but her voice is pretty obnoxious, which does not help the situation.\nWorkload:\nPretty easy I guess. Also not very interesting.\n"
        },
        {
            "course_name": "Fluent Bodies",
            "review_date": "January 13, 2005",
            "review_content": "\nI admit I had no idea what kind of class this would turn out to be, but I have to say that this was the class I talked about outside of class more than any other.  The readings were mostly interesting; one of my favorite assignments was the strange yet illuminating combination of Hegel and Susie Bright.  We cover a variety of topics, many of which are disturbing, such as female genital operations, ritual torture, Abu Ghraib, and kamikazee pilots, but these were also the most interesting classes.  Yes, the discussions were often misguided (ahem, the last class), and I would hope that next time around Professor Panourgia would do a better job of directing the discussion (especially cutting off overly-talkative people).  Panourgia is very intelligent and expects you to remember CC readings.  Yes, she makes you buy her book, but I really enjoyed reading it.  I thought her grading was fair, though I admit it would be difficult to anticipate since there are no earlier assignments.  All in all, I enjoyed the class; it wasn't perfect, but it was nice to cover unusual topics that are also relevant to current events.\nWorkload:\nTake home midterm, Final Paper, in-class participation.\n"
        },
        {
            "course_name": "Fluent Bodies",
            "review_date": "January 05, 2005",
            "review_content": "\nNeni Panourgia is the most disorganized, pompous, and unsuccessful professor (instructor) I have ever encountered.  Not only is she completely eurocentric in her views, but she is defensive toward her students' comments, disagreeing with them any chance she gets.  One gets the sense that she is competitive with her students, never encouraging an alternative perspective.  Moreover, she never comes to class prepared: she even \"lost\" some of her books, coming to class empty-handed, with no agenda whatsoever.  While the readings were very interesting, they were never explored in class or in papers.  In fact, the only assignments were a written midterm (based on material that was not explored in class), a final paper on \"anything,\" and \"class participation (dumb student questions took up the whole class).  Despite the fact that it was a seminar, she demanded that we email the \"TA,\" not her, if we had a question.  And last but not least, her grading style is atrocious, irrational, and blatantly unfair.  Based on her \"laid-back\" facade (and the course material), I thought I'd give her course a try.  Unfortunately, you'll have no way to gage your progress until far after the midterm period.  Be forewarned: your learning nor your ideas are of any interest to this inept instructor (who, by the way, will make you buy her book).  I have found the anthro department on a whole to be filled with wonderful professors, and this is NOT one of them.  \nWorkload:\nA lot of reading that is not discussed in depth.  Midterm paper that is graded by late November, and a final paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 02, 2003",
            "review_content": "\nProf. Panourgia is the best professor I have ever had. The disparging and innacurate reviews of her that have been posted by other students in my class are entirely false. Professor Panourgia deeply cares about her students. She is happy, intelligent, and full of life. She listens to her students ideas, allows them to voice their opinions, and challenges you to look at your thoughts in a different light. She is not the rigid, robutic, aloof intellectual that most Columbia students seem to prefer. Those students in the class who were disenchanted with her teaching methods only felt so because they were unwilling to look at Hume, Locke, and Hobbes outside the world of academia. Prof. Panourgia brings the world of academia and the outside world together. If you want a kind, brillant, caring, wonderful professor take this class. If not stick to the rigid, boring, aloof professors that some of the students in my class seemed to prefer. Take this class and you will learn more then you ever thought possible for a CC class and make a friend for life in Prof. Panourgia. \nWorkload:\nMidterm, Final, and 2-3 papers a semester.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 08, 2003",
            "review_content": "\nthe 2 of us have been trying to think of an effective way of summarizing neni's teaching style, but we've gotten way too caught up in anecdotes about how asinine the class has been. neni's a very sweet woman - that's true, but she is a completely incompetent professor. not only that, but she thinks she's superb, which makes it impossible to argue her mistakes. \nas a point of clarification, she DID point out the Jewish people and gay people in class, but it's no surprise that people didn't pick up on it because it was a complete non-sequitur to the topic at hand - like the majority of what she says.\nit is an understatement to say that she's unorganized; she is completely unprepared every single class. she welcomes distraction and gets caught up in minute details, like spending 30 minutes talking about where Dubois may have gotten his undergraduate education. the list goes on....\n1. she picks completely random passages from works and reads them in their entirety.\n2. every political text relates to some arbitrary incident in her life.\n3. mathematicity is not a word. and none of us know greek, so there's no need to give the greek equivalent of every word. \nAn often heard sentence construction: \"Freud locates his arguments at the nexus of the beginning of the foundation of the conceptualization of the understanding of the polis, the social as conceptually fundamental.\"\nAnd, for the record, just because she can name-drop with the best of them doesn't mean that she (a) knows the first thing about the theorist-du-jour she's citing; or (b) that she is capable of tying him/her in any meaningful way to the text that we're ostensibly reading.  For that matter, you never can tell whether or when SHE's read them ... \nWorkload:\nminimal ... but proportional to the amount it's possible to learn from her so-called lectures.  all prompts for papers were almost identical, and all required about half a class's worth of clarification.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 21, 2003",
            "review_content": "\nSo there are good and bad reviews of Neni, and here's why...\nIf you are anal retentive and want \"Here is Descartes.  Descartes said A, B, C.  He is famous because of X.  For cultural literacy, know these 3 quotes,\" do not take Neni.  You will hate her.  As previous reviewers mentioned, we skimmed (if that) Aquinas, Hume, Mill, and Wollstonecraft, and completely skipped Woolf and More.\nIf you want a professor who will do more than teach you the texts, who will make you fucking LOVE to read socio-philosophical texts, take her class point blank.  She will discuss the texts in-depth, revealing embedden gems of wisdom (trite, i know).  She will name drop Althusser, Derrida, Adorno, Bauer, Feuerbach, and other hidden suggestions for further reading.  She knows Marx and Freud as well as anybody, and she casts a new light on many of the readings.  This summer (and for the rest of my life) I will continue to read CC-type texts.  Because of you Neni.  Thanks.\nSo take your pick.  You be the judge. \nWorkload:\nas far as CC goes, nothing..2-3 papers and a midterm and final per semester.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 01, 2003",
            "review_content": "\ni have to speak out against the last reviewer, who is most likely in my class.  in some respects he/she is right, in that professor panourgia can at times be disorganized, but she only expects from her classmates as much effort as she gives.  the heartless reviewer failed to mention that her 2 weeks of absence first semester were to visit her terminally ill father in Greece, and the 2 weeks that she missed this semester were because she was herself very ill--i remember the first class she came to after her sickness, she was still so ill that she was literally shaking in her seat, but still held class for the whole two hours.  she did NOT point out all the jews and gays in the class.  that is pure fabrication--she is simply too sweet to do such an ugly thing as that.  It is true that her and her husband have the same format for exams, but i distinctly remember during the final, when we were all horrified when we saw texts on the test that we hadn't read, we told her, and she acknowledged her mistake, and told us we only had to write about what we had read.  overall, as i wrote in a previous review of Professor Panourgia, she is an EXCELLENT teacher--class is lively, always a debate.\np.s. i may not share her opinion in good cinema, but that has no bearing on her ability as a professor.  if the previous reviewer failed to notice, this is CUL of Professor Ability.  \nWorkload:\nvery light.  papers are 2-3 pages.  easy midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 11, 2003",
            "review_content": "\nOk, so I wrote a positive review at the end of 1st semester.  I take it back.  Sure she is knowledgeable, but you cover far fewer texts than you should.  She missed about 2 weeks of class 1st semester, and another 2 this semester.  We barely did Hume, Mill, and Wollestonecraft, she cut Frederick Douglass and Sojourner Truth from her syllabus, and didn't even attempt to cover Virginia Woolfe.  Oh, and get this.  She decided not to teach the Federalist Papers.  Instead, we spent an entire day on the US Constitution.  She argues that the Bill of Rights is the first 15 (as opposed to 10) amendments, and then proceeded to point out all the Jews and gays in the class and tell them that their rights were suspended during the Third Reich.  Relevance please?  Oh, and I turned my Kant paper in over a month ago.  Did I get it back?  Yeah right.  And one last thing.  She didn't even write the final last semester; her husband did.  Maybe that's why she included Thomas More, who she told us not to even buy, and St. Thomas, who she also passed over, on the ID section of the exam.  If you are stuck with her, at least she is easy, nice, and cooks a mean Greek-style chicken.\nWorkload:\nThis semester was even lighter.  Two short papers, a midterm on the movie Pleasantville (open book, open notes, in class), and a final.  Direct quote:  \"I would put Pleasantville in the top 3 movies of all time.\"  What are the other 2, Kant and Hegel porn?\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 10, 2003",
            "review_content": "\nYou wouldn't know it, but she's written a book about...well, just about everything. She's somewhat scatter brained on the surface, but dig deeper and rock solid ideas will emerge. Her reading selections are esoteric at best, but make some sense in the end. Arguments with her can reach the point of absurdity at times, but its all in good fun. Besides, if you want a standard approach to these books, read the \"critical\" introductions. And everything about her cooking is absolutely true.\nWorkload:\nReading ranges from titanic to insignificant, but more of the latter. two to three papers, midterm, final, all breezy if you have some brain matter left.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 15, 2002",
            "review_content": "\nSo she's a little disorganized at times.  So she skipped Thomas Aquinas and barely touched on the Qu'ran.  So she assigned bizarre portions of St. Augustine.  Still, she's fine.  At first I was a little skeptical, but Neni knows her shiznit.  Sure her papers and exams lack focus and she throws out a Greek word at every opportunity, but she is very knowledgeable.  Hell, go to her house for the end of the semester dinner...you won't be sorry.  Her cooking is the bomb, and she will rock your world with uzo and merlot.  If you are looking for a very methodological teacher, look elsewhere, perhaps her husband.  However, if you want someone who just wants to discuss texts without dwelling on bullshit overviews, she's your woman.  You be the judge.\nWorkload:\nThree 2-3 page papers, a midterm, and a final.  Why she puts bizarre true/false questions on the exams is beyond me, but if you get less than a B, you have issues.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 25, 2002",
            "review_content": "\nA gem. What this woman says, write down, remember, and think about. She is engaging, caring, knows how to express her thoughts, and how to help students refine and articulate theirs. If you can, get into her class and enjoy the ride. I looked forward to class every time.\nWorkload:\nReasonable- lots of reading, including supplementary but very pertinent reserve reading, but it's worth it for the three 2-3 page papers and easy midterm.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 27, 2002",
            "review_content": "\nFabulous. Cares about her students, incredibly interesting, infinitely accessible. She has her opinions and you know what they are, but she won't shove them down your throat - she genuinely wants to know what you have to say. Very easy going, and a terrific cook. Not the class to take, though, if you don't want to care enough to show up - she's a stickler about attendance, and after a certain number of absences she will dock your grade. She also really cares that you participate, so while you don't have to read everything, it's a good idea to at least do some reading. My only real complaint was that she didn't shut down people in the class who were interested in talking just to listen to themlseves. But she's absolutely worth taking, a professor that believes in the core and makes it work.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 19, 2002",
            "review_content": "\nProf. Panourgia's CC class is really a relaxed, really cool atmosphere to discuss anything and everything about the texts. She is really sweet and very energetic (she got into Hegel so much,she was beaming). The response papers are really flexible and allow you to write on any topic relating to the readings. Highly, highly recommended.\nWorkload:\nOptional Response Papers, fair midterm and take home final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 22, 2001",
            "review_content": "\nAwesome professor! She knows her stuff, leads good discussions, and has a great class dinner at her apartment.\nWorkload:\nOnly one midterm paper, and a take home final. Hard to beat that. Most of the grade is class participation.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 09, 2001",
            "review_content": "\nVery sweet, patient professor, very smart, if a little daffy at times. You can get away with a lot in her CC class, but discussions can get very interesting, and it's worth doing the work (as I realized with 3 weeks remaining in the semester). She's on top of the material and the atmosphere in class is definitely more engaging than that of a lot of other core courses.\nWorkload:\nLight: no midterm, take-home final, standard CC readings. There is one group project, due in the middle of the semester, that takes a lot of work, but that's it, I think. \n"
        }
    ]
}