{
    "prof_info": [
        {
            "prof_name": "Jessica Maratsos",
            "prof_id": 3949,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 08, 2012",
            "review_content": "\nJessica was really cool! I think what's best about her is that she really understands the purpose of this class and does a great job at adapting the material to our subpar level of understanding of art while still keeping it interesting. I also loved her dry sense of humour which made classes go by really quickly. She's very willing to talk to you outside of class if there is anything that you are interested in and want more information on. If you get her as an instructor you should definitely stay in her section.\nShe uploads all her lecture slides online, but they only consist of the images themselves so you should take notes of what you think is important, but since the class is more about gaining a sense of how to evaluate the properties of artworks and compare them to each other than about details, it's usually fine if you just pay attention. \nWorkload:\n3 written responses, one paper and one presentation - all of these require about the same amount\nMidterm and take-home final - they were both pretty general, not too nitty gritty, so you don't really have to study. If you just go to class and learn from what you do there you will be more than fine. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 08, 2010",
            "review_content": "\nJessica was an awesome Art Hum instructor. She was fairly laid-back, and acknowledged that most of the students in the class weren't going to be studying art history in the future. She treated the course accordingly. Many students walked into the class with absolutely no interest in the subject, and Jessica managed to make it somewhat interesting for all of us. She has a sarcastic sense of humor that makes an otherwise somewhat (but necessarily) rudimentary curriculum enjoyable. She was also highly open to questions, and responded to e-mail promptly. She even threw us a mini-party at the end of the course for which she baked us cookies!\nOverall, I'd highly recommend her as an instructor if you're looking for a laid-back, informal, but informative learning atmosphere.\nNote: I recommend googling her and then teasing her about whatever's out there; this was a running joke throughout the course.\nWorkload:\nTwo one page reading responses, two papers, a midterm, and a take home final consisting of two 4-5 page essays. Lots of reading, but it isn't *really* required (or even expected, I suspect). Not terrible.\n"
        }
    ]
}