{
    "prof_info": [
        {
            "prof_name": "Natasha Davis",
            "prof_id": 12720,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Archaeology and Africa",
            "review_date": "December 02, 2013",
            "review_content": "\nThis is, without a doubt, the worst class I have ever taken at Columbia.\nFirst of all: the class tries to cover too much. No one-semester, undergraduate course can begin to cover even one segment of the African continent, never mind the entire history of the entire continent as a whole. Also, expect to be disappointed by your fellow Columbians: until I took this course (I am a junior), I was under the general impression that all Columbians are at least educated enough to understand that Africa is not a country. How wrong I was. Given that this is a core class that anyone can take, I do understand that many of the students don't have a working knowledge of either archaeology or the African continent. That said, this class really doesn't teach them a different way to think about material, but rather to parrot very simplistic cliches while fully maintaining their ignorance about non-American, non-European cultures. Some of the comments made in this class were just beyond belief.\nHere are some of my personal favorites:\n\"But, like, black people can be racist too.\"\n\"I think Africa needs more cities and, like, buildings. What do you guys think Africa needs?\"\n\"This Spanish king spoke with a lisp and then, like, all the other people started talking with a lisp too. Because they, like, wanted to copy him. Africans do that too.\"\n\"Identity is based on DNA, not history.\"\n\"This African society was clearly capitalist because they have wealth\"\n\"Maybe one reason Westerners misrepresent Africa is because they don't know how to deal with all the primitive societies.\"\nTo a South African girl: \"I don't know anything about you or your personal history or whatever. But clearly African Americans are more African than you... I mean, you don't even have like African DNA in you. Also your ancestors CHOSE to move to Africa, and, like, African Americans were slaves. So how can you say you're African? I mean, like, no offense, but you're white.\"\nfrom [TA] Mark: \"I mean, how many African Americans are even IN this class?! Let them take it up.\" (and later, turning to two students of color:) \"what do you guys, as the most African-American out of all of us, think? ...haha, I mean, if I can call you that.\" (followed by uncomfortable silence and shocked expressions)\nfrom [TA] Natasha: \"99.9% of you guys are wrong\" (in reference to an assignment we had been expected to complete with few to no guidelines whatsoever)...\"you're all useless academics who never get anything done.\"\n...and many, many more that I neglected to write down.\nDon't get me wrong -- Professor Crossland is great. She's funny and intelligent and it was genuinely a privilege to be taught by her. That said, the structure of the class is ALL wrong. She jumped from topic to topic willy-nilly and each class was slightly less coherent than the last. No, Zoe is not the real problem with this class. The real problem is the TAs.\nMark is a terrible TA. Not only is he rude and unresponsive to students, he is unclear and unfocused and belittles the opinions of students (and the students themselves) which do not entirely conform to his very particular (but somehow also very vague) views about Africa. In fact, he goes so far as to demonstrate the exact opposite attitude towards Africans (and humans in general) that is repeatedly emphasized by Zoe in this class. He embarrasses those who try to express a different viewpoint to a self-righteous, patronizing attitude of \"We Westerners need to help these poor Africans.\" (sidenote: your average human being understands that Africans are people. This class does not seem to understand that. Instead, it looks on them as pawns in the power of the West; as excuses to discuss changing western -- whatever THAT means -- viewpoints on vague topics like \"identity\".) He humiliated a girl in my discussion section by grilling her about every aspect of her past to try and racially categorize her, and then proceeded to make the comments mentioned above to the \"most African-American\" girls.\nWhile still slightly more effective than Mark, Natasha is by no means a good TA. She is extremely biased and yet routinely criticizes students for their perceived biases; she can be catty and downright rude in class (often picking on individuals and calling them out for their \"wrong\" opinions); and she does not respond well to well-meaning criticism of the class and its structure (like \"maybe we can accept by this point in the semester that we're all looking at things with our 'western bias'\"). She plays favorites.\nIn short, the only saving grace in this class is Zoe. My only criticism of her is that she is too forgiving of some of the ludicrously closed-minded comments made by students in the class... in other words, she's just too nice. The assignments were lots of fun and really contributed to my knowledge of the topic.\nAs for the workload: there are 3+ dense readings per week, none of which are really related to the lectures. I would say don't read them, but you kind of have to as the final is based on them. There's a 10 page midterm research paper which was actually great fun (you have to research an African object at the Met and rewrite the Met's outdated label for that object), plus two map-of-Africa quizzes which were genuinely useful in my understanding of the continent. To be frank, I only learnt anything in this class because of the quizzes and the paper.\nTLDR version: we <3 Zoe but this class, mostly thanks to the TAs, engenders racist, closed-minded, self-righteous viewpoints and celebrates the one-sided, the black-and-white, and the binary.\nWorkload:\n(Not even the point.)\n3+ dense anthropology texts a week, which are discussed in lecture\n10 page midterm research paper (that was fun)\n1 topographical quiz on Africa (major features)\n1 political quiz on Africa (countries and capitals)\nfinal based on classes and facts from readings; \"answer 3 out of the following 9 questions\"\n"
        }
    ]
}