{
    "prof_info": [
        {
            "prof_name": "Frederik Paerels",
            "prof_id": 1411,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Astrophysics I",
            "review_date": "January 08, 2015",
            "review_content": "\nIf you're interested, at ALL, in astronomy or astrophysics - Frits is your man.\nProfessor Paerels brought everything in this class down to a very, very, very digestible level. At times, it seemed like a lot of his lectures were oversimplified (and sometimes this was true), but at the end of the day he made sure everyone had a functional knowledge of the astrophysical topics at hand. And if you had any astronomy related question - it didn't have to be related to the coursework - he was always ready to talk it out. Sometimes, half a lecture would just go by in question-and-answer sessions with Frits. That got annoying at times, but it's also a testament to how well he can take high-level astro concepts and bring them down to a first-year undergraduate level.\nAs for this class specifically, it was pretty easy. The problem sets are designed to walk you through each step with very minimal math required between each part - it was a little simplistic at times, but hey, it definitely made sure everyone was working towards the right thing. Additionally, he really emphasized understanding the physical meaning of results we obtained by calculation - \"what does this number mean in the real world?\" We had a midterm and final. The midterm was in-class and was open-everything (as such, it was slightly more difficult than the PSets or the final; this was the only graded portion of the class in which I lost points). The final was take home and basically just another PSet. This was a pretty fun class and I'd definitely take another class with Frits if I had the chance.\nWorkload:\n5 PSets, approximately every other week, pretty easy. In-class midterm, slightly more difficult, but open-book, open-computer, etc. Take-home final, basically another pset. Not too bad.\n"
        },
        {
            "course_name": "Introduction to Astrophysics I",
            "review_date": "November 16, 2011",
            "review_content": "\nFritz is probably one of the best professors anyone potentially interested in astronomy/astrophysics/physics can meet.\nThe class would often be about answering our questions about the universe whether related to the current material or not (make sure to ask him about the expansion of the universe to see the face he makes,) and felt more like a professional level class then any other intro class I have ever taken.\nThe hw's guide you through themselves and are fairly easy, yet you actually get to figure out mathematically amazing processes and relations about stars. These derivations only exist in old papers and so it is hard/impossible to look them up, but the question asks you step by step what to do.\nThe midterm was take home and more like a slightly more challenging pset then a midterm. We figured out the approximately how close protons get to each other in the core of mainsequence stars through some simplifying assumptions.\nThough the class does require knowledge of basic calculus, and is definitely not for those who are not interested in science.\n\nWorkload:\na pset every other week, problems are asked step by step so the questions guide you through to the answer.\ntake home midterm\nA slightly challenging take home final just like the psets and midterm.\n"
        },
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "June 07, 2010",
            "review_content": "\nTo any BC student looking to fulfill the math requirement: Take. This. Class. Yes, it's a ton of math that seems insanely overwhelming to those of us who can barely multiply, but Frits is *so* nice and *so* helpful, that you'll never worry about asking for help. More importantly, his midterm and final are completely open note, meaning that as long as you organize your notes and problem sets before the exam, you're likely to find the answers to the questions right in your notebook. No need to spend hours studying the night before! Seriously...take this class. You'll reduce your stress level, and you'll actually learn something! \nWorkload:\nNot bad. 4-5 problem sets, with about a week to complete each one. One midterm, one final. Problem sets took me about an hour to complete (looking things up online helped a LOT), and I barely studied for the exams, and I ended up with a B+. \n"
        },
        {
            "course_name": "Galaxies and Cosmology",
            "review_date": "May 09, 2010",
            "review_content": "\nFrits is great! He is willing to help you with anything all you have to do is ask. He's easy going and approachable and not a stuck up asshole like some other professors are across both schools. He views his students as people far more then some other professors. I felt like I was respected and my lack of math knowledged and struggling was taken into consideration. He is a wonderful person and its been a pleasure having him as a professor! \nPlease be advised if you are not good in MATH do NOT take this class. Despite how easy it may seem the concepts involve math that can be challenging. \nWorkload:\n3-4 problem sets, midterm, and a final \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 28, 2006",
            "review_content": "\nFrits Paerels led a really easy and relaxed Frontiers of Science discussion section.  Yes, most people will find this class incredibly boring but I personally didn't find it that bad.  After all, discussion is only once a week and if you pay attention during lecture you will learn something no matter how good you already are at science.  Anyway, Frits is an extremely kind, helpful man who assigned little homework and was extremely generous with grading.  However, his discussion section is not particularly informative and I never really felt that the lectures were significantly clearer after going through discussion (this may be because the lectures are already quite clear).\nWorkload:\nI don't remember exactly how many but only around 7 weekly individual assignments were given throughout the whole semester and these were quite easy/took little time.  There was also a small amount of reading which was not something to be stressed over.  All the work is graded quite easily but I'm not sure if Paerels gives A+ so even if you're expecting that grade, don't count on it.\n"
        },
        {
            "course_name": "Stars, Galaxies, and Cosmologies",
            "review_date": "April 20, 2006",
            "review_content": "\nFrits is a really cute guy, and the course is easy--it is a good class for anyone who wants to get a quick, easy background is some major topics in astronomy. Frits is also very helpful and approachable, the only thing is he speaks a little quietly, so make sure to sit in the front!\nWorkload:\nLight. 5 problem sets, midterm and final, all pretty easy. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "April 22, 2005",
            "review_content": "\nI don't know what the past reviewer is talking about.  This class is made for non-math people.  I got a 1 (1!) on the Calculus BC exam, did not study for the midterm or finals, and came out with an A.  Fritz is great person and always willing to help out if you do run into any math-related difficuly.  All and all a great way to get rid of one semester of the science requirement with little effort.\nWorkload:\neasy.  5 problems sets; drop the lowest grade.  open book midterm AND final. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 17, 2005",
            "review_content": "\nFritz rules.... He's a good guy who wants you to succeed and get a good grade in the class.  The problem sets can be hard, and you don't get much in the way of partial credit but he drops the lowest so it'll all work out in the end.  Some lectures are interesing, some are not but all are optional no reason to go every week just drop in to make sure you're not too lost.\nWorkload:\n5 problem sets (lowest dropped), 1 Midterm, 1 Final (both are easier than the problem sets and both are open book).\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 17, 2005",
            "review_content": "\nOk, Fritz is a really nice guy. Given. The subject itself, if your not a math person STAY AWAY. If your looking for an easy course STAY AWAY. Although hes a generous grader, his lectures leave alot to be desired. He has a low voice and a very indirect, vague way of explaining material.However, if math is your thing, formulas, planetary data, all that relativity mumbo jumbo, go for it. Paerels is really cool. \nWorkload:\nUm....problem sets every week, easy midterm, ok final. Not awful.\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 09, 2005",
            "review_content": "\nThis class seems to have something for everyone. If you're just filling the requirement, you can download the lectures online and get by fine. But if you become interested in the subject, as I did, it can be a really great class. \nWorkload:\nMidterm, Final, and 5 problem sets which are somewhat challenging but Frits is great about answering questions and helping you out. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "January 03, 2005",
            "review_content": "\nI highly recommend taking any class with fritz! He really knows what heÂ’s talking about, (if you bother attending the lectures). His lectures are available on courseworks, and skimming through them once prepares you for the problem sets and tests. I wouldnÂ’t recommend closely studying the textbook. You should get an A without working too hard if you have a basic knowledge of physics. There is no curve on the tests but they are easy and entirely open everything: notebook, textbook, even computer! He drops one of the five problem sets, but if you go to him or any of the TAs for help they will practically do the problems for you. Definitely take this class to get out of a science requirement. Fritz is the sweetest teacher and a great guy!\nWorkload:\nMidterm, Final (you have the option of taking it at home), five prob sets (lowest is dropped)\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 08, 2004",
            "review_content": "\nFritz couldn't be any nicer! He is a wonderful person, but his class is beyond boring! I have to admit most of the class is there simply to fulfil their science requirement, but he does not teach this class as if it is an introductory one. The text of the book and his lectures have nothing to do with what the problem sets or midterm, and im assuming final will be about. In short, very nice guy, but not so interesting as a teacher! (most days about 1/4 of the class shows up to his lectures)\nWorkload:\nNot so bad! Five problem sets (you can work in groups and he drops the lowest grade, also, the TAs and Fritz love to meet with you and \"give\" you the answers. \nMidterm (just ask him, and he will practicaly tell you how to do a problem) Final\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "November 17, 2004",
            "review_content": "\nthis class is absolutely perfect for non science maors who want to get a fairly easy A-- sadly, i really have not learned anything, bc you really dont need to go to class (at any given time, only about 1/4 of the clas shpows up)- the problems sets are not easy, but you work in a gorup-- and you can go to him anytime and hell basically give you the answers-- hes awesome- he wants alll the students to do well, so he'll help you out as best he can (also on the midterm! which was open book, open notes, open anything)\nWorkload:\n5 problem sets, midterm final\n"
        },
        {
            "course_name": "Introduction to Astrophysics I",
            "review_date": "January 15, 2004",
            "review_content": "\nI cant say enough good things about Frits. His lectures are very interesting, and he is the nicest guy ever.  He is always willing to help you out with a problem you are having trouble with, and will spend hours helping you out if you need it.  He cares more about you learning the concepts and using your brain than memorizing equations.  \nWorkload:\nabout 6 problem sets, open book midterm and final.\n"
        },
        {
            "course_name": "Stars and Atoms",
            "review_date": "May 10, 2003",
            "review_content": "\nfrits is my main man. for non-science majors who wanna hear about cool astronomy stuff, or math/science people who want and unbelievably easy A, i highly recomend frits's these classes.  class is really fun, i went even though i didn't really have to. frits is a cool, guy, he tells you about his own research projects, which are really interesting, and is always eager to chitchat outside of class about astronomy or anything. he curved stuff so that it was impossible to get below a B, so even the people who weren't strong in science did well. \nWorkload:\nsooo easy. 4 bullshit hws, open notes midterm and final, both really easy.\n"
        },
        {
            "course_name": "Introduction to Astrophysics I",
            "review_date": "January 06, 2003",
            "review_content": "\nI LOVE FRITS!!!!!  He is such an awesome professor and one of the best professors I have had at Columbia University.  He is an excellent lecturer and often while discussing a theory, he usually tells interesting facts related to either how the scientist discovered a theory or present experiments occuring.  I always looked forward to his lectures and barely missed any classes.  He is very friendly and I enjoyed speaking to him during office hours.  Every students who I know that has taken Frits absolutely loves him.  \nWorkload:\nabout 5 problem sets, 1 midterm, final\n"
        }
    ]
}