{
    "prof_info": [
        {
            "prof_name": "Sarah Demeuse",
            "prof_id": 2321,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2006",
            "review_content": "\nSarah is a great professor to have as a first-year; like an earlier reviewer said, she won't change your life with the quality of her instruction (even though she's a fine teacher), but she does a good job with this course. She always prepared extensively, often providing (optional) outside pieces regarding a book's historical or literary context, and so she was prepared to discuss almost any aspect of the work at hand. The discussions went all over the place, but she made sure we covered all the major stylistic and plot points that would show up on mid-terms and finals. She provided study guides for the exams, and there were no surprises or tricks that might have caused people to do badly. Sarah is also a fair grader when it comes to papers. She's willing to accept any argument as long as you can back it up with specific examples that make sense, and she will reward attention to detail and structure. Her feedback weren't too extensive, but she was always ready to discuss a grade if anyone needed clarification. All in all, she's very likeable and dedicated to making the course an enjoyable experience, even if some of the texts are a little dry. She's also pretty funny, in a quirky European way. \nWorkload:\nThe standard reading list for LitHum, which is a bit much (but you don't have to read everything). She didn't include any extra books, which was nice. Two papers per semester, one 3-page and one 6-page. Five paragraph-length online postings about whatever you want. Very reasonable, especially in comparison to other LitHum profs.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 28, 2005",
            "review_content": "\nI'm certainly glad to have had her as a first year student. Although she doesn't always life altering insight into the books and college experience, I found her pleasant and understanding. She tries to create a comfortable discussion atmosphere that I think everyone appreciated. On special occasions she even brought in breakfast for the 9AM class. She's still a new professor developping her teaching stlye, but her love of the ciriculum and enthusiasm makes the class well worth while. Deffinitly take her class if you have the chance. \nWorkload:\nAlot of reading, postings, managable writing assignments, but No quizzes, and most everything is sparknoteable\n"
        },
        {
            "course_name": "Madrid and Barcelona as Literary Myths",
            "review_date": "March 08, 2005",
            "review_content": "\nI found the negative review of this class to be completely misleading.  The workload for the course was not absurd at all; in fact, it was quite manageable.  The exams and papers were entirely straightforward.  It is worth noting that the majority of the class struggled to express themselves in Spanish and also had trouble understanding the basic vocabulary of the texts we were reading.  I got the sense that many students were in over their heads and might have benefited from a few more advanced level language classes before moving into a literature course.  It was a shame that most of class time was taken up by Professor Demeuse having to clarify and explain the simple plots of the books, especially since she is a highly intelligent woman who was eager to teach us a lot.  I enjoyed how she incorporated all types of literature, from literary theory to works from classic Spanish authors to very modern novels.  Professor Demeuse is actually an incredibly warm person; I believe some students mistook her shyness for being unhelpful.  I was in contact with her a lot outside of class and was so impressed with her caring nature, enthusiasm, and flexibility.  I really wanted to take more classes with her but wasnÂ’t able to because of scheduling conflicts.  I think Professor Demeuse did a wonderful job for her first semester.  She is going to get better and better the more she teaches.  \nWorkload:\n2 reasonable papers, interesting reading assignments, and a cumulative exam; all easy if you do the work (which isn't bad.)\n"
        },
        {
            "course_name": "Madrid/Barcelona",
            "review_date": "January 25, 2005",
            "review_content": "\nProf. Demeuse's class is a very sweet lady who, more then anything, needs a little more mileage in the \"prof\" position.  She is sweet, professional, and sensitive to her students comments in class as well as their struggles with the language.  The quantity of material per class is not as \"exorbitant\" as other reviewers might claim.  She just needs to pay closer attention to how much material should be assigned per class (The mon/wed comment mentioned by the other reviewer is right on.).  All in all she has the potential to be a really fantastic professor...just give her some time...\nWorkload:\n10 minute presentation, 2 papers, final exam\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2005",
            "review_content": "\nI realize it was her first semester, but she was aweful. She failed to excite the class, and then blamed our lack of interest on the fact that the class was at 9AM on Monday. In addition it became painfully obvious that she was following someone else's ideas for the class discusion. I know that Lit Hum is a Core Class and has a strict syllabus, but her discusions were completely dry and elementary. Whenever a student would try to dig deeper into the texts than she had planned, Prof. \nDemeuse would either disagree with them completely without providing any valid arguement for why the student was wrong, or she would ignore their comments entirely. On the other hand, when a student had no idea what they were talking about, she didn't have to guts to say they were wrong. Sarah makes Lit Hum a disappointing waste of time. Yes, she's a fairly generous grader, but it doesn't make up for her incompetence in class. She is also extremely inadequate when you meet her outside of class. Avoid Sarah, and try to find a professor with a better reputation and more experience.\nWorkload:\nNightly readings, 5 papers (increasing in length from 1 paragraph to 5 pages), midterm, final\n"
        },
        {
            "course_name": "Madrid and Barcelona as Literary Myths",
            "review_date": "January 03, 2005",
            "review_content": "\nI was utterly disappointed by this class.  The readings are absurd in length and the professor had no idea how to schedule them so that we would read the longer assignments from wednesday to monday, and not the other way around.  She was very rigid and unhelpful in conferences and I did not appreciate her not using any of the mid-semester feedback we gave her.  This class should be great but the most I learned was from the research I did for my 10-minute presentation.  She gives too much background on uninteresting subjects and is unwilling to change the focus of the class based on student interest.  There were way too many texts focusing on the \"rural\" to give us a point of comparison with the urban texts, and I don't think anyone who has never been to Madrid or Barcelona would get anything out of this class at all.\nWorkload:\nABSURD.  Ridiculous amounts of reading, 2 papers and a presentation, but you'll never finish the reading even if you care to.\n"
        },
        {
            "course_name": "Madrid and Barcelona as Literary Myths",
            "review_date": "January 02, 2005",
            "review_content": "\nSarah Demeuse is a friendly, approachable professor that takes her class very seriously.  She is receptive to student insight, and strikes an excellent balance of casualness and professionalism.  She does, however, assign an exorbinant amount of reading, which was almost impossible to complete.  Be prepared to work hard and still not be able to finish every assignment.\nWorkload:\nHeavy---a great deal of reading for every class.  Two 5-7 page papers, a presentation, and a cumulative final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 01, 2005",
            "review_content": "\nProf Demeuse is a good, not incredible teacher. She is very sweet and available out of class. The discussions in my opinion did tend to veer off track sometimes, as she seemed reluctant to stop a student even when he or she had nothing valuable to add. Then again, this is her first time teaching the course, so she may improve with this. She is also a pretty fair grader and gave us several short essays before we had to write anything significant to ease us in, which was very nice. All in all a good teacher to have, but nothing extraordinary.\nWorkload:\nshort posts before almost every class (nothing really),  \"papers\" (only one of significant length really), midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 25, 2004",
            "review_content": "\nI love Professor Demeuse.  We had a 9 AM class and she always came bubbly, dressed nicely, and ready to discuss.  This was her first year teaching the course and I think she did an admirable job.  The class was a discussion, but she always made sure the discussion did not diverge too far off course.  The text was always analyzed and discussions were pointed.  I really enjoyed the class and Sarah is such a great professor: she made herself available for help on papers and would return a paper within a week (most of the time with a very generous grade).\nPray for Sarah.  She's not a life-altering professor, but she's very nice to have.\nWorkload:\nSeveral essays, biweekly discussion postings, readings (obviously), midterm, final.\n"
        }
    ]
}