{
    "prof_info": [
        {
            "prof_name": "Robert Erikson",
            "prof_id": 898,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Voting and American Politics",
            "review_date": "January 09, 2017",
            "review_content": "\nThis class was relatively easy. Just as FYI the class is all about voter behavior and polling, not American politics generally. Not all of the reading was necessary with much of the important stuff coming from Erikson's text book. All of the exam questions will basically come from the powerpoints in class. Nothing super exciting about the class, but I did love Professor Erikson. He's very sweet and talks about the material in understandable terms. Taking this class during the 2016 election was also super interesting and I liked that Professor Erikson incorporated daily news into our study of polling data. Also he brought NATE SILVER to talk to us one day so that rocked. Overall an easy class, a little dry at times, but worth taking. \nWorkload:\nOne final paper, midterm, and final. Readings, but just due before the exams not really weekly. Fairly light for a Columbia class. \n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "December 18, 2012",
            "review_content": "\nWhy Erikson doesn't have a gold or silver nugget is beyond me. HIs class on voting and public opinion is fascinating and this man is brilliant. the problem was that our class seemed not to care or appreciate the legend that was lecturing us twice a week, and therefore, like i suspect happened with past reviews have a negative attitude and just don't care. If you like politics, are willing to actually care and listen to his lectures (which make the class worth it and are filled with his subtle yet hilarious humor) then take this class. Take this class if you're actually going to respect Dr. Erikson and contribute, because he really deserves it. My TA (Vanessa) was also awesome, she was always available to help, worked with us on the final paper and is an expert on the shift from the third to fourth party system.  The workload is also whatever you're willing to put into it. If you do the readings, they don't take up too much time and they synthesize everything learned in class and more. If you let this class teach you, you'll leave looking at public opinion and the american electorate totally differently. Maybe i had such a positive experience because it was during the presidential election, but regardless, i think I would love this class anyways and felt honored to learn with Erikson. \nWorkload:\nManageable. Readings are interesting and you can get through them without too time. Midterm/Final/Paper. All fair, but you'll get the grade according to the work you put into it (like any other class I suppose)\n"
        },
        {
            "course_name": "American Politics Seminar: Elections and Representation",
            "review_date": "May 16, 2010",
            "review_content": "\nAny political science seminar that you take with Erikson will be awesome--if you are laid back and have a sense of humour. Professor Erikson is a secret genius--you'll read about him everywhere. However, his seminar is hilarious and so is he. He will make jokes about the more comical members of the class and he loves all and everything corny. I seriously love this guy. Yes, his powerpoints are dull and worthless. Yes, you might have to do some bullshit book report. But Erikson is a more than fair grader and the discussions in his class can be pretty fun because he loves to talk about current events and lets you go off on whatever tangents you want. \nIf you are someone who loves to study and loves to learn, then this class isn't for you. If you prefer to party and play sports (like me) take this class. You don't have to do any of the reading (okay, maybe a little when you have to write a discussion paper). \nErikson is awesome, chill, and doesn't give a fuck (can I say fuck on this website?). Don't take his lecture class, you'll get shitty TAs. Take the seminar and become BFFs with this dude. He rocks.\nWorkload:\nA couple \"thought\" papers on the weeks reading (like 3 for the whole term). The final paper, and a presentation that you can make five minutes before. If you turn all of these things in (they can even be late and he won't care) you'll get a good grade. He definitely is awesome because he cares more about you learning and discussing that trying to screw over your GPA. Do the basic work and you'll get at least a B. Probably a B+. or maybe an A- or A if he thinks your smart. I consider myself semi-retarded and I got an A-. \n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "January 17, 2010",
            "review_content": "\nErikson knows everything possible about the subject and is a nice guy, but the class is really really boring.  Not only is it early, but his voice is monotonous and his lectures and slides and usually worthless.  The midterm and final are entirely based on the reading, but since the reading isn't necessary for class every session, its easy to fall behind. The material can be interesting, covering topics like party identification and electoral history.  In addition to the midterm and final, there's also a paper that can be either a statistical analysis of exit polls (since we learn nothing about such statistics in class, not sure why this is an option...), a comparative book review, or another topic.\nWorkload:\naround 50-120 pages of reading per session- often dry and very hard to get through\nMidterm with ID's and an essay- no surprises if you do the reading; if not, you will fail\nFinal       \"                     \"                           \"                      \"                      \"          \"\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "December 24, 2009",
            "review_content": "\nThis class is pretty much what the name says, and not much more.  You learn about the history and function of voting in America.  \nI can't say that I expected the class to be riveting, especially at 9am, and it really wasn't.  I found the lectures I attended to be snoozefests, but also worthless.  There is nothing that you need to learn from the lectures that you couldn't learn from the reading.  And by reading, I mean Erikson's book.  His book is good, in fact the only worthwhile book you're required to read.  The other books give you unnecessary background about the history of American politics.  If you know this stuff, then you're fine and you can skip it all.  Looking back, I would like to suggest not attending any class except for the review sessions, but there is a ridiculous participation requirement for a lecture class.  There is no way that you can actually participate, but you sure as hell better be sitting there pretending to pay attention or you'll be docked 5% on your final grade.  \nSo the class is average and on the boring side, but not bad.  But the TA for this last year was terrible.  She was way to strict when grading papers and the final.  Stuff like giving you a B for using too many decimal places on a graph, when she admits your entire paper was well written and constructed. \nBut overall, I would recommend this class if you want to know more about the theory and practice of voting.  It might not be the most in depth class, but probably good enough on the undergraduate side. \nWorkload:\nReadings for every class.  (Not necessary for class, but it's a lot so it's best not to let it pile up too much)\nMidterm (IDs plus essay)\nProject (On the syllabus it claims that the project is the final... not so...    You can write a book review or do a statistical analysis project)\nFinal (Same as midterm)\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "December 17, 2009",
            "review_content": "\nHere's the truth about this class I'll agree that Erikson's lecture style involves the use of an enormous number of repetitive graphs, and that class participation is very low. Comments regarding the workload/difficulty, however, are dramatically off. Reading varies from 20 pages a class to 100 pages a class. Sorry if that's too much reading for you, but maybe you should reconsider getting your education at Columbia. The finals are highly predictable and test material covered in class. The grading is very fair and reflective of the effort put into the final. Bottom line: if you want to learn in this class, you can learn however much you want. If you go in with the attitude--I don't want to do any reading! Waah. You won't learn anything.\nWorkload:\n1 midterm. IDs, 2 essays. Difficulty level: 4/10\n1 paper, either a comparative book review or a statistics project. Other special topics may be generated on an individual basis.\n1 final. IDs, 2 essays. Difficulty level: 4/10\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "December 13, 2009",
            "review_content": "\nProfessor Erikson lacks the kind of enthusiasm and energy that is required if you to inspire students, or, at least, motivate them to care about the course material.  If you have any basic understanding of how the electorate in this country behaves (i.e. most of America is dumb, apathetic, and does not care about voting, or that more educated people tend to vote more liberal) then this course will teach you nothing new.  The only mildly interesting aspect of this course were the all too brief sections where we studied the history of elections or particular political movements (such as McCarthyism).  Perhaps this was a failure on my part, but I came into this class expecting to learn why Americans vote in particular patterns and why our electoral system functions the way it does, but all we did was analyze voting trends at 9:00 in the morning while Erikson tried desperately to solicit class participation. Erikson is clearly a big shot when it comes to data interpretation (as his books, which is the main text for the class, is quick to point out), but he is much more of a lab rat than a qualified and charismatic teacher.  This class did teach me about the 'sci' side of the poli-sci major which is nice because now I know I will never be a poli-sci major.  If you are really into statistical analysis and know what STATA is then take the class, but if you want some serious political debate and discussion about our electoral system or why Americans vote the way they do, stay away.\nWorkload:\nThe class is also not as easy as it sounds.  There is a heavy amount of very dense reading, and there is no way to tell what will be on the midterm or the final.  The paper project is very doable (and, from what I hear, actually interesting for a few students), but requires more time than a 3 credit course should.\n1 midterm-fair questions, but graded by a TA which would be fine, if you knew her expectations. No one knew her expectations.\n1 paper-either a 10 page book review, or a 6 page statistical analysis paper\n1 final\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "January 14, 2009",
            "review_content": "\nRobert Erikson is a man who knows his stuff. Unfortunately though, enthusiasm doesn't match his wealth of knowledge; Erikson's voice will put you to sleep, and his slides will prove meaningless. There is a heavy workload as far as the reading goes-- expected for a poli sci major, and you will quickly have to decide what material is necessary and what isn't. There's also a lot of overlap in content among the books Erikson assigns so throwing material out will be easy. The exams were never a surprise, but the grading certainly was. The TA's assigned to the class were unnecessarily harsh. The poster below is right: Erikson never gave any additional points when you proved his TA's didn't know how to grade. I would say not to take the class simply because the TA's spoil everything.\nWorkload:\nMidterm, Final, 10-15 pp. Paper.\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "December 15, 2008",
            "review_content": "\nHe is smart....actually brilliant! However, not my type of Professor. We didnt really learn anything in class, and basically if you read the slides you were fine. If you read the readings too then you were really set, however, there was a good amount of reading so I gave that up early. The TA's were pretty tough graders and he didn't give me any extra points despite pointing out that the TA was in fact wrong in grading me so harshly. It is an alright class, you can get a B without doing much at all.\nWorkload:\nmidterm, final, 10-15 page paper, weekly readings\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "April 13, 2008",
            "review_content": "\nHe really isn't that bad - his slides are really useless since he just rambles on and most of it are graphs, even though they never appear on the midterm or final. The course load is relatively easy if you just read the books he assigns. You know what is necessary and what isn't after looking at the books so choose wisely. TAs are not much help - he is kind of incoherent during lecture BUT he is a really nice guy if you go to him during office hours. He means really well and is easy going. The paper in the end was fun and easy. If you put some effort into it, you'll do well.\nWorkload:\nReading every week. Standard midterm/final (no surprises).\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "April 13, 2008",
            "review_content": "\nGeneral review_content of Professor: If you can't do boring graphs at 9 a.m., don't take this class. It's more Poli-Sci/Stats than Political Science, and his voice is perfect for falling asleep to. I was waiting for the point where it would hopefully start to pick up and become interesting, that point never came. \nWorkload:\nMidterm, term paper, final. All reasonable, but you'll need to know some Statistics for the term paper. No one did the readings, since his entire lecture was straight out of the book.\n"
        },
        {
            "course_name": "American Politics Seminar: Previewing the 2004 Election",
            "review_date": "May 13, 2004",
            "review_content": "\nI suspect that you will not have to worry about this class being on the schedule again; but in reality it's not like we really did any previewing.  Erikson might just be the country's leading scholar on voting in America (he came up with the \"sophomore surge\" idea), but he doesn't show it.  This class quickly became: review the previous week in politics, which was fun, and then was half an hour talking about reading that no one did, or just doing something completely random.  This class could have been fantastic--we could have each taken a battleground state, and predicted how we felt the election might go there, or we could have tackled something as a class, but we ended up doing random, shitty research project.  I'm not so happy.\nWorkload:\nObnoxious small 4-5 page papers throughout the semester that you think are just for fun, then come back with letter grades on them.  15-25 page research paper.\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "February 27, 2003",
            "review_content": "\nErikson is a very funny, and strange, guy.  He mumbles and goes off on tangents, but what funny tangents they are.  For example, it is not uncommon for him to say something like (or exactly like)  \"All of the protestant fundamentalists, while living in their trailer park homes...\"  The class itself is somewhat informative, but not too serious.  If you are looking for a pretty easy, enjoyable pol sci class, take this one!  There is a good amount of reading, but the midterm and the final are almost all class notes.\nWorkload:\nFair amount of reading, but you don't have to do a lot of it.  3 short critiques, 1 5 page project, east midterm and final.\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "February 16, 2003",
            "review_content": "\nAdmittedly, Professor Erikson is not every student's cup of tea.  He tends to mumble and frequently goes off on tangents, which for the student who likes to sit in the back, take notes, take the tests, and not say a word all semester doesn't provide much incentive to take the course.  However, despite being billed as a lecture course, this class tends to be small; consequently Erikson runs it with a heavy emphasis on student discussion.  Because of this, his tangential lecturing style results in in-depth discussion of the material and makes for interesting class sessions provided that students participate.  Plus, the reading list and assignments are informative and enjoyable.  If electoral politics is your thing and you engage yourself with the material, you'll get a lot out of this course.\nWorkload:\nModerate.  Weekly readings, three article critiques of 3-5 pages each, one data analysis project (3-5 pages of text and an additional 2 of supporting graphs and tables), midterm, non-cumulative final.\n"
        },
        {
            "course_name": "Voting and American Politics",
            "review_date": "January 18, 2002",
            "review_content": "\nUnbelievably boring. Highly unrecommended. The times that I went to class, I left with my notebook completely empty. His lectures didn't make much sense or seem to relate to anything. Everything I learned from this class was from the reading, and strictly for the exam.\nWorkload:\nALOT of readings, three short papers, one large paper, midterm and final\n"
        }
    ]
}