{
    "prof_info": [
        {
            "prof_name": "Conrad Schirokauer",
            "prof_id": 862,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "December 15, 2016",
            "review_content": "\nOverall, Connie's class was a blast. I saw some people falling asleep here and there, but everyone loved him. You really need to love to read translated old Chinese philosophical texts and need to remember a bunch of Chinese and Japanese people's names which may be a bit difficult for some people. You would sometimes need to speak louder so he can actually hear you, unless your TA is super nice and repeats what you said to him. Even though his lectures go really off-topic sometimes and not consistent, he is everybody's favorite grandpa!\nWorkload:\n4 quizzes spread out over the whole semester + 2 very manageable essays, but you never know what he likes or what he doesn't like. Weekly discussion board posts\n"
        },
        {
            "course_name": "Colloquium on Major Texts - East Asia",
            "review_date": "April 09, 2014",
            "review_content": "\nLooking back at my time as an undergraduate at Columbia, Conrad Schirokauer was one of my favorite professors. While I was initially wary of his class (he is quite old and can sometimes be a little bit hard to follow), I am so glad that I stayed in his Asian Hum section.  \nSchirokauer is both an excellent teacher and an absolutely wonderful person who cares a lot about each and every one of his students. I've had a lot of professors at Columbia who, like Schirokauer, possess an encyclopedic knowledge of their subject area. But I feel that few of them, however brilliant they are, can rival Schirokauer's passion for working with undergraduates. \nSchirokauer's love for teaching is genuine; he truly wants to get to know each of his pupils at a personal level. (He is retired and has quite a bit of time to spend on his students, so you should definitely take the opportunity to meet with him one-on-one.) Even though I took his class several years ago (and am not particularly interested in things EALAC), I still drop by Schirokauer's office occasionally to chat with him, and our conversations sometimes go on for hours. He is remarkably generous with his time and has been a terrific personal mentor for me during my time at Columbia.\nWorkload:\nTotally reasonable. Weekly discussion board posts. Two essays. Oral final. \n"
        },
        {
            "course_name": "Colloquium on Major Texts - East Asia",
            "review_date": "December 23, 2011",
            "review_content": "\nI loved this class.\nI found Schirokauer's Asian Hum section to be surprisingly engaging, and I thoroughly enjoyed it. Keep in mind Schirokauer's age: He's very old, and it causes him to stutter and speak slowly and deliberately, and he has a tendency to ramble and talk on and on and on. I guess if you're not interested in the course content or are sleep deprived, there's a risk of falling asleep in the class. However, that wasn't the case with my Asian Hum experience.  Schirokauer has an encyclopedic knowledge of the course material, and while he's one of those old people who can talk on and on and on, he also tries very hard to stimulate class discussion and relate to the class on a personal level -- despite the age gap. In most cases, he's fairly good at it. Some of the discussion topics can be a little borderline wacky (e.g., If Dogen and Genji could somehow meet, what might they say to each other? Why should we/should we not make you compose poetry instead of taking a final exam?). Most people in the class are interested in the course material, and it allows for some interesting discussions throughout the semester. Plus, Schirokauer is very funny and has a sort of clumsy/cute old person demeanor that I found to be very endearing. (\"Oh dear...when are they going to be coming out with the next genius phone?\")\nSchirokauer genuinely cares about his students. For instance, on the first day of class, he gives out index cards and asks everyone to write down their name, year, interests, and major. It appears that he proceeds to memorize what everyone writes on their cards. For instance, if you indicated that you're studying history, he would, on occasion, call on you during class discussions, prefacing he wants to hear the perspective of a \"history major.\" Schirokauer's dedication to his students also shows in how available he makes himself for his students. It's not necessarily uncommon that chats between Schirokauer and his students, transcending Q&A; regarding the course material to chats about philosophy and life, to last on the order of hours; the professor genuinely wants to know his students. \nThe Asian Hum reading list is a little daunting for a global core/intro EALAC class, and I was a little wary of it when I signed up for it. I have to admit that I didn't have time to read every single text assigned, and I think a lot of my classmates didn't either. However, before each class, Schirokauer poses discussion questions on Courseworks that you need to write a response to. Usually these questions become the foundation of the class discussion, and it gives you an idea of what (and what not) to focus on in the readings. \nIf you're considering Asian Hum as a global core requirement, I highly recommend taking this class with CC. There are a lot of thematic parallels between the Asian Hum and CC reading lists, and Schirokauer, cognizant that a large chunk of the class has/is taking CC and Lit Hum, encourages broad thematic discussions on Asian Hum readings in tandem with various Core texts. It made for many really interesting discussions in class (e.g., Nietzsche and Neo-Confucianism, Augustine and Genji, Locke/Hobbes and Mencius/Xunzi). \n \nWorkload:\nShouldn't be too hard to manage an A, especially if you're interested in the course material. Participation and weekly discussion posts (45%). Two papers (15% each). Oral final (25%); the final is basically a chat with Schirokauer and the TA. \n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "May 17, 2009",
            "review_content": "\nProfessor Schirokauer is a nice old man and, having written one of the textbooks that we study out of, he definitely knows his stuff.  One thing about this class is that it covers ALL of East Asian \"topics\" from the earliest writings to the present time.  Furthermore, it covers China, Japan, Korea, and (less so) Vietnam.  With all this material, it is impossible for him to go over everything in class, so the readings are where you learn the most in terms of breadth.  In class, Prof Schirokauer tends to focus on a few of the readings and ties them together with more depth.\nSince I am in seas and do not know what others might consider this reading load, but I'm going to estimate that there are around 30-40 pages of reading each class and it took me about 4 or 5 hours to finish (to do it all).  The readings came from two main sources: the textbook and the compilation of primary sources.  However, to participate in class, it's only really necessary to do the primary source readings.\nHere's the breakdown of grade: participation (a web posting every couple weeks + class discussion) [about 30%], two papers [about 10% each], five quizzes [about 5% each], and a final [about 25%].\nThe papers are 5-7 pages each and you can write about basically anything.  The quizzes are 4 out of 8 questions and can be very random, but if you pay attention in class, you should be able to answer at least the four that you need to.  Keep in mind that the quizzes have very limited time, so just stick to the main themes/ideas.  For the final, he gives you a list of questions beforehand and takes the final's questions (2 short essay, 1 long essay) from that.\nIn terms of grading, it's difficult to do stellar (A to A+), but it's not too difficult to pull of something okay (B to A-).  I myself got an A-\nYou learn a lot, so I would recommend this class if you have the time to spend on it.\nWorkload:\n30-40 pages of textbook reading per class, two papers, five quizzes, and a final.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "April 16, 2007",
            "review_content": "\nI highly recommend this course. Schirokauer is an extremely knowledgeable and extremely friendly professor. I also found him to be rather quirky (in a good way). The course is taught more like a seminar than a lecture (one of the reasons I opted for this, rather than the China/Japan/Korea 80+ people courses). I am personally very interested in the material, so I never found a second of the class to be boring. There is a good balance of East Asian thought and philosophy and history. Schirokauer does a good job of engaging the class, though some may complain that he does catch people off guard when he calls on you with a confusingly-worded question (a valid complaint, but it happens to everyone). \nDefinitely one of the better courses I've taken here, both for the subject material and the professor. \nWorkload:\nOn the light/moderate side. Very manageable reading (he admitted he shrunk the assignments from his earlier years), 5 short quizzes (which are NOT as \"random\" or bizarre as people are making them out to be--if you did the reading, you'll be fine), one 8-10 paged research paper, and an easy final (short answers and essay--he also gives out the questions beforehand). \n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "December 30, 2004",
            "review_content": "\nProf. Schirokauer is very nice and extremely knowledgeable, and I learned a lot from this course.  He insists on making the class a discussion, however, and this normally wouldn't be a negative aspect, but I found that he did not lead the discussion very well.  Sometimes he would ask questions about works or authors that we weren't asked to read, and sometimes his questions were cryptic (they could be either complex, with no correct answer, or very simple and somewhat irrelevant...the result was that the class was reluctant to answer even simple questions, thinking they might be more difficult than meets the eye.  Schirokauer would assume we hadn't done the reading, and discussion would move painfully slowly).  The structure of the course was also somewhat unhelpful.  The material covers a wide range of topics (philosophy, art, history, etc.), and to make sure we remembered everything, Schirokauer had five tests in addition to a paper and a final.  Personally, I would rather have had a few papers than the five tests; they were very difficult to study for, with approx. 6 questions per test, on topics or facts that were largely unpredictable because of the wide range of material that had to be studied.  I learned a lot more writing the paper than studying for the tests.  \nThat said, I did learn a lot, and Schirokauer was helpful when I had questions, and he was always available outside of class and very approachable.  Also, despite the difficulty of the tests, he's a pretty lenient grader.\nWorkload:\nThe reading is very manageable; it was just a drag having to do it all over again to study for each of the five tests he gives.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "December 09, 2004",
            "review_content": "\nThe class was good because he expected a lot out of us. Which is good because it means he has faith that we are capable of doing it. Though, you really have to be able to keep on top of your sh*t. I worked very hard and I am still a bit worried about my grade. Which I feel is unfair on his part. \nWorkload:\nsometimes I felt he was trying to do his own experimental ancient chinese examination system on us. Think a constant trickle of work like water torture but not enough to make you go mad. \n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "November 22, 2004",
            "review_content": "\nTrue, this class is small like the CC and lit hum classes.  However, taking this class is the equivalent of taking a history class, CC, AND lit hum all in the same semester.  For each major eastern Asian civilization, the readings encompass history, philosophy, AND culture.  The philosophy is DEFINITELY NOT a survey: you are expected to really understand Neo-Confucianism, just knowing its definition is not enough.  You learn a lot, but unless you are genuinely interested in the material the class will be a miserable experience.  Professor Schirokauer is very kind, and he is extremely knowledgeable, but beware, he is not afraid to tell you that you are completely wrong.  He is funny, but sometimes he just goes on and on and it's difficult to keep up.  \nWorkload:\nTONS of reading, weekly bulletin board postings, 5 ultra random quizzes (impossible to study for, just make sure you understand the concepts cold), 8-10 page term paper on your chosen topic, final...Schirokauer is a very ideological man, sometimes that translates into tough grading.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "November 13, 2004",
            "review_content": "\nThis was one of the best classes I have taken at Columbia.  First of all, it is small, more like a CC or Lit Hum class than a lecture class.  It is also discussion-based:  instead of lecturing on and on, like other EALAC professors do, he involves the entire class, and seems genuinely interested in what you have to say.  He's also full of funny stories.  The difficult part of the class is the breadth of the material:  there is a lot of reading (on par with CC or Lit Hum), and it covers an immense amount of material.  (This adds variety to the class though, because the more random readings are really pretty interesting).  If you do the reading, you'll have a great time in this class.  If you don't, you'll probably be lost.\nWorkload:\nOne research paper on your own topic, and five ID quizes, based on recent reading. \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "February 03, 2004",
            "review_content": "\nExtremely nice, knowledgeable, if a bit forgetful old man.  He may not know when class is held or how many kids he has, but he definitely knows East Asian history.  The class is run as a seminar, a bit disorganized at times, but an overall very interesting experience.  There's a lot of reading per class, but it's not necessary to do it all--just read the Brief History.  It's probably more important to remember how to spell his name correctly for your quizzes/papers, so you don't incur any point deduction.  \nWorkload:\nWeekly bulletin board postings.  5 quizzes (not easy) that cover random material--but it's the imagination you put into the answers that count.  For the mega-random quizzes, you obviously can't study everything, but there's always a question or two on the most recent readings.  8-10 page term paper on any topic.   Questions to the final are given out ahead of time.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "January 19, 2004",
            "review_content": "\nGreat Professor and great readings!  He does both class discussion and lecture style teaching.  He's relaxed and funny and he really knows his stuff.  Sometimes he goes into his quirky-mode and tends to digress.  A lot of prep work for class ie, discussion boards, and a couple of very short \"response\" papers (if you could call it that).  Don't take this class just for the hell of it or for credit b/c it covers A LOT of material and requires serious commitment.  You will be miserable if you are not genuinely interested in this stuff.  Most of the readings are interesting with only a handful that are drop-dead boring.  Some people say that just reading the Brief History will give you a good idea of what's going on in the course.  \nWorkload:\nLots and lots of reading, six tests (short but serious, some are pre-assigned), one final, one final paper, and once or twice a month you have to post a short comment on a discussion board.  He is a fair to generous grader.\n"
        },
        {
            "course_name": "Introduction to Major Topics in Asian Civilizations: East Asia",
            "review_date": "December 21, 2001",
            "review_content": "\nGreat professor! Although sometimes the class was boring, the overall experience was great, b/c he made it like a discussion class for the whole sem. It wasn't structured like a lecture or a class-room, which made the class a little more interesting. Although he does tend to pick on people, I think he is still a great professor. I would suggest him to anyone as a teacher, and people should definitely take the class. Thanks.\nWorkload:\nIt's okay, not too much, I mean, if you didn't read for the class it was still okay. However, one of my friends read everything, so she was a little overwhelmed by the class. I suggest not reading too much and still you'll be able to do well in class discussions, however, study groups would work better for Exams, b/c the exams are pre-assigned and the questions are also pre-assigned. Lots expected, but people still liked it.\n"
        }
    ]
}