{
    "prof_info": [
        {
            "prof_name": "Hannah Gurman",
            "prof_id": 2552,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "First Year English: The Americas",
            "review_date": "January 11, 2009",
            "review_content": "\nThe reading in this class is very interesting. Professor Gurman is definitely a very educated and grounded woman. She is easy to approach, and the main intent of this class is to improve your writing skills. The majority of the class is focused on analysis of \"American\" literature and the writing process. She is not a very easy grader -- but with hard work and determination, you might be able to get an A on some essays. You need to be persistent with taking her advice and boosting the multiple drafts of your essay to the next level in order to be successful in her class. \nWorkload:\nReading every night, Multiple essays (multiple drafts of them), Research Paper (8-10 pages)\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "March 21, 2008",
            "review_content": "\nI felt compelled to correct the previous review. Hannah is very clear about grading; in no way does she mislead (and if one needs to argue with a professor about a grade, any grade, let alone one in the *introduction* to a major, a re-evaluation of self is in order...).\nMoving on. I like Hannah a lot. She is very kind and conciliatory but a little sharpness would probably serve her better. In discussion, she rarely challenges points, even those that are just wrong, and on papers she's complimentary when harshness would be more instructive. She introduces you to the major with a warm, bosomy embrace, when perhaps a brisk slap in the face would better reflect the realities of (the good) English seminars--for which this class is a prerequisite. \nMy criticism, really, is of this course (reintroduced just this year), not Hannah. You receive seminar credit (4 credits), though you only meet 3 hrs. a week and write 3000 words (!) for the entire class. You can also get away with only reading 250 pages of stuff the entire term (a short novel, a play, a poem). It's a total mis-representation of the major, which is reading-heavy, writing-heavy, and discussion-heavy.\nWorkload:\nThree 1000-word papers. \n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "February 11, 2008",
            "review_content": "\nHannah has this annoying policy where she undergrades on all the essays to try to make you work harder, and then she gives you a higher overall grade at the end.  And of course you dont know this during the course and are frustrated that you're getting bad grades on good essays, and you're worried about your final grade.  Also, if you agrue a grade with her, she will change it.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 26, 2006",
            "review_content": "\nI agree with the previous reviewer.  Hannah is one of the nicest people at Columbia.  The course isn't exactly the greatest, but she was able to really help me with my writing.  Just remember to show up for class and say a few things to get your class participation grade up.  I recommend her if you must take the class.\nWorkload:\n2 essays 1500-2000 words, CCP essay 2000-2500 words, and the occasional smaller assignments.  This is the same amount of work required from every UW prof.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 20, 2005",
            "review_content": "\nHannah is one of the nicest teachers I've met here. At least she cares about you learning english. She'll give you a really high grade, as long as you agree with her ideas. But she allows rewrites as many times as you want, so really it makes the class so easy.\nBecareful though. She appears to not care about attendance and participation in class, but she will make it affect your grade at the very end. \nI recommend her though, because of the rewrites and the fact that you will learn how to write after taking a class with her. \nWorkload:\nNormal amount. Short weekly essays, about 500 words. Readings around 20 pages. 4 longer essays. \n"
        }
    ]
}