{
    "prof_info": [
        {
            "prof_name": "John Parsons",
            "prof_id": 357,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "August 22, 2015",
            "review_content": "\nProfessor Parsons is a refreshingly straightforward and engaging professor.  His lectures are clearly given, and his expectations are both reasonable and comprehensible.  Exam averages tend to be relatively high -- a testament to his clear expectations and goals -- meaning that this is not a class for those obsessed with curves.  If you work hard, pay attention, attend EVERY lecture (he does not always follow the textbook, often has his own style for solving problems, and does not post lecture notes), and seek out help when you need it, you will do well in the class.\nThis is not a class for those who want to dive deep into Physics (i.e. get a conceptual understanding of concepts).  Parsons tends to present a topic, tell you how to solve a specific type of problem on that topic, and expect you to essentially memorize the procedure and apply it to a general, but predictable, format of problems.  Essentially, I know 'Parsons Physics' but I cannot necessarily apply that knowledge to novel problems.  With that said, Physics serves a pretty utilitarian function for Pre-Meds, and Parsons gets this.\nFinally, I should add that he is a really cool guy, and at the top of his field.  If anything, the class is worth it because of the opportunity you have to be in the presence of one of the greats.  His office hours are, again, utilitarian, but he is a really interesting Physicist and it is a real treat when he shares some of his current work with the class at the end of the semester.\nWorkload:\nMinimal.  Just do the suggested problem sets (a few hours a week) and redo them before the exam.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "May 17, 2014",
            "review_content": "\nProfessor Parsons is outstanding.  His lectures are clear and organized, and he is very open about what he considers fair game for tests.  He devotes a great deal of time to his students, from office hours to email replies.  This was incredibly helpful during reading period, when he held an extra office hour AND a finals review session.  He does an excellent job of completely addressing questions/problems, and is quick to note when certain material is interesting, but too complex to be acceptable for a test question.  Lecture attendance is a must, as his tests are based heavily on his notes and explanations, which are all chalkboard, not electronic.  Only one practice test (before the first midterm), but once you get used to his testing style, you can certainly do well by reviewing his notes and the assigned homework problems.\nWorkload:\nThree midterms, the lowest of which is dropped.  The two that stick comprise 30% each of your final grade.  The final makes up the other 40%.  Weekly (ungraded) homework assignments that are excellent review for the midterms.\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "September 04, 2012",
            "review_content": "\nProfessor Parsons is great! He does some fun demonstrations before lecture and is a really lively lecturer.  \nHe only gave us one practice midterm for the first midterm, and you were sort of left to guess for the final two.  However, as the previous reviews have mentioned, definitely study from his notes!  He takes examples from notes and puts them on exams often, as well as problems from the problem sets, so do those too.\nHe is pretty big into the calculus derivations and proofs of physics concepts and they are often included on exams, so if you are fuzzy on the calculus, I would recommend going with another prof who does not put calc on exams.\n I'm definitely not the physics person, but managed to pull off an A- putting in a lot of extra time, but what saved me is figuring out how to study for his exams (from both notes AND problem sets), which means going to lecture is a definite must. \nWorkload:\n3 midterms, 1 final.  problem sets not handed in.  optional recitation.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "June 01, 2010",
            "review_content": "\nParsons is a great physics professor! I feel lucky that I was able to take is class this semester. His tests are hard but fair, and not based on endless computations meant to test your calculator skills. They make you think. Just a side note though, some of the older reviews say that there's no calculators on the test. That's not true in Phsyics 2 - some test questions require calculators, but at least half the questions on every test don't. You can use a graphing calculator, so you may want to throw some formulas on there, since his formula sheet is very sparse.\nParson's lectures are clear, he writes well on the blackboard and he's sometimes even funny. I enjoyed physics lecture, and I'm hardly a mathmo. I wish he'd been around first semester as well.\n\nWorkload:\nweekly problem sets, not handed in. 3 midterms loosely based on the homework, drop one. One hard cumulative final, without much repetition from the midterms. \n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "April 09, 2010",
            "review_content": "\nDr. Parsons is hands-down the BEST possible lecturer for physics II. The material is boring to most, but his witty remarks make the lectures bearable. His lectures are always organized and his exams are fair if you are able to do the homework; there are few to no surprises. Definitely take advantage of his office hours - he will go over any homework problems and is very good at explaining further what you might have missed in class.\nE+M is tough to teach yourself from the textbook, in my opinion, which is why having an excellent professor makes the difference! \n\nWorkload:\n3 midterms, drop the lowest. Psets not handed in. \n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 22, 2008",
            "review_content": "\nParsons honestly loves the textbook. His lectures come directly out of the book; therefore, if you read the chapters and do the sample problems within the chapter (and actually understand those sample problems) you have a good chance of doing well in this class. Still, I think attending his class is helpful. He speaks more clearly than any professor I know, and can occasionally be funny (in an awkward kind of way, I guess).\nThe exams are pretty tough, but they are tough for everyone. There was 4 questions on each midterm, and 8-9 on the final (usually didn't have any numbers involved; only variables). The mean (about a B+) is pretty low, and the curve is pretty high. Generally, he picks questions that come directly out of his notes (sometimes without changing anything!). This is why attending class can save you a lot of time studying. Be warned, though, that attending class is by no means enough to get you at or above the mean. You really need to read the textbook (as painful as it can be because the material is INCREDIBLY condensed). Also, the TA was very helpful when it came to understanding the concepts, especially when the book was unclear. Take advantage of this situation, despite how boring and annoying it is coming in early for class etc. This will put you ahead of most students, guaranteed. \nOverall, Prof. Parsons knows his stuff. But that does not mean he is in the business of ensuring that you know yours. Know the textbook and look over the examples that he talks about in class and you should do fairly well, considering his huge curve.\nWorkload:\nProblem sets per week of about 10 problems. They can be easy, but are usually fairly challenging, even compared to his exams. \n2 midterms and 1 pretty hard final. Whatever was on the midterms generally won't appear on the final. So, study closely the material that WAS NOT tested before the final. Still, everything in this course is pretty much related, so studying one thing kind of helps you all around. This class is definitely possible to get an A, but you have to have a plan. Just follow what I said and you will be fine.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "April 27, 2008",
            "review_content": "\nThe first semester is mechanics; the second E&M.; \nProfessor Parsons is very nice and is fairly approachable (although honestly you will probably never need to talk to him personally). His lectures are straightforward and follow the textbook closely enough that it is easy to miss class if necessary.  Unfortunately his voice has a monotone, droning quality that can put people to sleep. \nThere were two midterms each semester which had problems similar to the homework but using only variables instead of numbers, so no calculators were allowed (this is a good thing because using a calculator wastes a lot of time). The averages on midterms were very low because the class was filled with SEAS freshmen who are weak at physics (I believe this is the lowest level of physics SEAS students can take). This is also good, because if you take this class with a strong physics background it is very easy to do well. My only complaint is that the problem sets were too long.\nWorkload:\nOne problem set from the textbook every week. They were generally about 8 problems in length, some of which could have many different parts. These took a long time, especially second semester. To make things worse, many students seemed to have access to a solutions manual. \nFrankly, homework for a class like this should not take more than one hour, but it almost always did.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "February 25, 2008",
            "review_content": "\nProfessor Parsons knows what he is doing and does a good job explaining the materials and concepts to the class, although he can get boring at times and his lectures are pretty much right out of the book. He is funny at times but his monotone voice will drown some into sleep. His midterms are of moderate difficulty and he curves generously. Definitely take this class if you've had no previous experience with Calculus-based physics or AP Physics.  \nWorkload:\nProblem Sets are 10 questions and weekly. 2 Midterms and 1 final. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 06, 2008",
            "review_content": "\nLectures are boring, demonstrations are not very helpful. It was a big lecture class because everyone looked at culpa and took this course. The class is filled with people who have never seen any calculus before and a larger amount of people who have gotten 5s on AP physics and chose to take a class to pad their GPA at the expense of all those in the middle. Homeworks are problem based, plug in solutions, while tests are method based with all variables, not very well correlated at all. \nTake 1600 physics its open book and calculator active unlike this class. \nWorkload:\nminimal, a weekly 10 problem set, 2 midterms and a fair final. Decent curve.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 20, 2007",
            "review_content": "\nI seem to be the only one on CULPA with this opinion, but I really did not like Parsons' class.  He knows what he's doing, but sometimes I felt like I would leave class and still not understand how to do the homework problems. When he explains a concept, though, he will go ahead and do at least two examples of it, so as to show you how it works in multiple contexts.  He tries to be funny, but I rarely found any of his jokes to be amusing.  He does demonstrations in class which are useful only in that they show you that the concept proves true in theory.\nHis exams are difficult in my opinion.  If you do well, though, it really shows that you know the material, because the tests are done all in variables and constants given by letters instead of being numerical problems.\nI thought the problem sets were sometimes difficult, too, but that generally coincided with when I did not go to class--you definitely should go to lecture to do well in this class.\nWorkload:\nWeekly problem sets of 10-15 problems, two midterms, and a final\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 22, 2006",
            "review_content": "\nThis was a great teacher for a great class. Parsons has a wonderful sense of humor, sometimes has the entire class erupting in laughter. He's also explains things well, in a way that everyone can easily understand. Definitley take this class if you want to have an enjoyable physics course.\nWorkload:\nWorkload is fine, about 10 problems a week, it's easily doable. Also, assuming you know the material, midterms and final should be a breeze, the problems on them are not overly complicated.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 20, 2006",
            "review_content": "\nOk, I'll attempt giving a little info about Parsons that hasnt been repetitively mentioned by the other thousand reviewers. He maintains a subtle humor that keeps the class interesting, if you pay attention (sometimes hard to do since it is in a big lecture hall). My semester, the choice for physics teacher was Parsons or Miller, and everyone i know in either class agreed Parsons was the more interesting teacher. do your work, beat the average for an A- and above (approx), you'll do fine\nWorkload:\nweekly problem sets, two midterms and a final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 18, 2006",
            "review_content": "\nParsons is a great professor.  He is excellent at explaining how concepts work or how to go about a problem, because he tells you WHY to take certain steps. The derivations of equations are understandably boring.  Overall, I would say get Parsons if you have the option.\nWorkload:\nWeekly problem sets of medium difficulty.  Expect to spend between two and three hours on a set.  Two midterms (the first was easy, the second hard) and a final of medium difficulty.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 24, 2005",
            "review_content": "\nOK- so i think the reason he is reviewed so well on here is because of the curve at the end of the class. I got at least a standard deviation below average on both midterms and presumably did just as poorly on the final (very little/no studying- yeah, i kinda gave up) and got a B- in the class. \nLectures not particularly interesting, he is nice and funny, but this class (1601) is probably not for you unless you really are interested in taking a physics class with the smarter freshmen engineers. Do not take it just to satisfy your physics requirement if you're not interested in physics.\nWorkload:\n2 midterms and a final, weekly problem sets which aren't too hard, especially if you attend recitation. Very very generous curve, but exams are difficult, you must really understand material covered in order to transition from hw -> exam.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 23, 2005",
            "review_content": "\nOh lecture classes. Okay, this was a really interesting class, and Professor John Parsons taught it very efficiently and cleverly, but I can't really remembering him explaining anything. It seems like the lectures are only valuable if you've already read the textbook. As a result I had to drink like five cups of coffee to get through through every one of Parsons's interesting efficient clever etc classes, maybe it was a ventilation issue. Watch out cause Red Bull already banned in europe. \nWorkload:\nhard\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 02, 2005",
            "review_content": "\nI disagree with all the positive reviews of Professor Parsons' instruction.  Parson's lectures largely duplicated the textbook - the conceptual examples he used were often exactly the same as those in the book.  The lectures themselves were unhelpful - some of them were occupied by long algebraic proofs for various formulas which could convince you that the formula was accurate but told you nothing about what it signified or how it could be applied.  By far the most frustrating part of the course was the section on special relativity.  Professor Parsons knows the material well, and when he solves problems he used certain tricks and shortcuts that he has learned from experience.  But he doesn't point out the tricks and teach them in such a way that a student can reapply them.  As a result, one finds themselves copying off the board but not absorbing any useful strategy for future problem solving.  The lectures therefore just decary into a lot of algebra - hardly what a physics course should be!\nA final note: The book is terrible!  It is poorly written, does not provide effective examples, does not have a good solutions manual - in short has nothing one should expect from a physics textbook.  A real contrast to Stewarts Calc. Book! \nWorkload:\nNot bad.  Weekly problem sets to be handed in.  But not graded the week of a midterm!  Tests difficult but good curve.  I got an A-.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 29, 2004",
            "review_content": "\nHe was very good. The problem sets were free easy points. Theres a huge curve for the midterms and hes a very clear and straight forward lecturer. \nDefinatly take 1601 freshman year and not 1401.\nWorkload:\nOne problem set a week, quick and relativley painless. Three midterms and one final\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 25, 2004",
            "review_content": "\nParsons is very clear when he is teaching and everything is pretty much straight forward, very easy to understand.   However, they can get a tad bit boring. He doesn't go very fast and it's easy to fall asleep. Lucklily, the class room has many boards so if you fall asleep for 15 minutes it's not too difficult to catch up with the notes because things aren't erased quickly. He has no problem answering questions and knows physics pretty well. The problem sets aren't too long or too difficult, answers are basically given away at recitation if you choose to go.  Tests aren't easy but there is a curve. If you know the material you will do fine.\nWorkload:\nGrade is 20% homework, two midterms worth 15% each, and the final worth 50%. The homework is one assigment per week and it is usually about 8-10 problems a few easy ones and a few difficult ones, doesn't take too long. Overall not a time consuming class\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 23, 2004",
            "review_content": "\nProfessor Parsons teaches an extremely intresting physics class. He comes up with great demonstrations, however his informative and clear teaching will hold your attention and the demos are just a  bonus. His tests are fair, and are well balanced.\nWorkload:\nWeekly homework sets, 2 midterms and a final. (Moderate difficulty)\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 21, 2004",
            "review_content": "\nParsons is an amazing physics teacher!!! If you have the oportunity to take his course, do so.  He makes physics really easy and his tests are straight forward if you know your stuff.  He's also quite entertaining in lecture.\nWorkload:\nOne problem set a week with 10problems.  Most of them are quite easy though somewhat time consuming.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 21, 2004",
            "review_content": "\nProfessor Parsons is amazing!!! He knows the stuff well and expalains it well, keeps your interest from first moment till last, willingly answers questions. He has a very nice sense of humor, you just can't fall asleep in that class.\nWorkload:\nReasonable: a problem set every week, two midterms, one final\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 21, 2004",
            "review_content": "\nProfessor Parsons is amazing.  Do yourself a favor and take him if you want to get anything out of physics 1601.  His lectures are clear and logical, his examples are well done, and he can be very funny at times too.  Very approachable and always willing to help out.  You won't need to ever open up the book as he explains the material much better than the book anyway.  A+\nWorkload:\nProblem set a week and two midterms.  The midterms can be rough but well worth it.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 18, 2004",
            "review_content": "\nA great guy! He has a very loud and clear voice, and very well organized lectures. He also has a sense of humor that isn't nerdy. He is very nice and approachable and will work hard to make himself available to help students, so go to him for help, don't delay. TAKE PARSONS FOR PHYSICS.\nWorkload:\nOne problem set a week, doable, just go to recitation or the physics help room, two midterms and a final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "August 16, 2003",
            "review_content": "\n﻿John Parsons is amazing.  He does everything right.  He has a loud, clear, unaccented voice which he uses to explain in a very understandable way each concept he wants the class to know.  HeÂ’s even humorous.  I donÂ’t think you can find much better.  His lectures are interesting and the notes are very helpful.  The only time I opened the book was to read the homework problems; otherwise itÂ’s entirely unnecessary as he usually provides a better explanation than the text does. \nTake his class if you can, itÂ’s a treat.\nWorkload:\nWeekly problem sets, 2 midterms, and a final (exams are curved).\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 28, 2003",
            "review_content": "\nParson's teaching can be summed up in one word: WOW!  He is an amazing lecturer and pretty much knows everything there is to know about the material.  Attending class is critical since the material is often complex or poorly covered in the text.  That's not a problem though, you WILL WANT TO ATTEND CLASS.  If you attend you will walk out of each class feeling like you know exactly what the professor is talking about.  He is a great teacher, funny, and very flexible--if you make contact with him once in a while.\nWorkload:\nWeekly problem sets-- you might want to consider a study group for these: they are tough...really tough.  2 Midterms and 1 Final (cumulative).  His exams are killer but the curve usually makes up for a bad raw score. Overall, a great course!\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 22, 2003",
            "review_content": "\nParsons is an incredible physics teacher.  He's got a sharp sense of humor that keeps his class awake and attentive.  He's got this booming voice (guaranteed audible to a deaf man at 500 yards) that lets you sit in the back of the class and still understand every word.  Most importantly, though, his ability to organize and teach a lecture is really spectacular - several people I know switched in from the lower-level course (the 1400s) and found it *easier*.  The only downside is that he's hard to get a hold of if you need extra help, and unresponsive over email - but hey, nobody's perfect.  \nWorkload:\nweekly problem sets (~2 hrs each), 2 midterms, final.  Not that bad a workload if physics \"clicks\" for you.  Class was heavily curved.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 20, 2003",
            "review_content": "\nProfessor Parsons is the best professor I have ever had.  He is very knowledgeable, and he delivers this knowledge to his students in a very effective manner.  He is very approachable, and he encourages all of his students to attend his office hours.  His responses to email are prompt, some within 5 minutes.  Although the material and class is somewhat challenging, he explains it very well.  I would definitely recommend taking this professor.  Even though you don't enjoy the material, he will definitely bring it to life. \nWorkload:\nThe homework reflects the questions on the 2 midterms on the final.  Very fair grader\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 02, 2003",
            "review_content": "\nDefinetly a challening professor. Both tests and homework are hard. there is a big curve so as long as you do better than the curve you're set for an A. \nWorkload:\n2 midterms and Final. All about the same difficulty. Weekly homework-difficult but there is a recitation.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 24, 2002",
            "review_content": "\nGreat lecturer, explains every concept very clearly with illustrated examples. Witty and funny, he makes the class interesting and even fun at times. Assigned problems are difficult as are midterms and finals. Only take this class if you are willing to work your butt off and breathe physics for the semester. \nWorkload:\nLong problem set every two weeks, 2 midterms, final\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 06, 2002",
            "review_content": "\nHe was an amazing proffessor! You're in for some great laughs and some very engaging lectures. Everything is very tangible and accecible in the lecture. Plenty of examples and plenty of explanation. Don't get me wrong - he's tough. You still have to read the book to really know what the heck you are doing on tests and homework - though because of Prof Parsons you now know what the heck the book is saying. He's an amazing lecturer...if you pay attention!Otherwise you will be talking about E=((pc)^2+(mc)^2))^(1/2) and how that relates to people traveling on skateboards that go significant fractions of the speed of light before you even knew you were relativley lost. Plus you might miss his ever so subtle and clever wit! I wouldn't reccomend missing too many lectures either for the sake of the exams and your homework. So if you see this guy's name next to the course you want to take...BY ALL MEANS TAKE HIM!!! He's tough, but its fair, and you will absolutley fall in love with whatever material he presents! He was without a doubt one of the best proffessors I have ever had - he made me enjoy physics despite the workload and my grades!!!\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 31, 1999",
            "review_content": "\nOne of the best lecturers and best physics professors I have ever seen. He magically explains everything almost incomprehensible in physics. A great class for all of your physics lovers.\nWorkload:\nLOTS and LOTS of work. don't expect an easy A; you are going to have to WORK. But don't be surprised if you can't do half of the problem sets, most people can't.\n"
        }
    ]
}