{
    "prof_info": [
        {
            "prof_name": "Paul Strohm",
            "prof_id": 1778,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 27, 2007",
            "review_content": "\nProf. Strohm's class was not great, to say the least.  He usually rambled on about random things which had no association with the texts.  He was a hard grader, but if he likes you - you'll do fine.  Midterm was difficult but doesn't count if you do better on the final (which about 99% of people do).  Try to switch out of his class if you can, or you'll just have to wait a semester and switch after break (which about 3/4 of my class did).  \nWorkload:\n4 two-page essays, one midterm, standard final (no postings)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 09, 2007",
            "review_content": "\nAt all costs, avoid this man's class. He is well-meaning but ultimately not the sharpest tool in the shed. He refuses to go into any depth with the readings, preferring instead to read passage after passage without any substantive discussion about WHY these passages are important or what they could possibly have to do with one another. He does not prepare for class, and is often unable to answer simple questions about the books and authors. If you're looking for a professor who can offer some insight over and above what you yourself were able to draw from the readings, look elsewhere. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 08, 2007",
            "review_content": "\nPaul Strohm is my favorite professor at Columbia so far. He really enjoys the material we read. He understands that the class asks students to read a lot of material in a short time so Paul Strohm shortens some of the required reading in exchange for indepth and intense discussion of what was read. His papers are very short and precise require you to work hand in hand with a specific part of a certain text. \nParticipate in class and read the passages he assigns and you'll enjoy the class.\nWorkload:\n4 two to three page papers about specific passages of certain texts. He models his midterm after the final but drops the midterm grade if you improve on you final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 17, 2006",
            "review_content": "\nPual Strohm is a nice guy with a very unique teaching method.  He is very approachable and will always help with problems and questions.  He likes to run class based off of what his students bring to class along with his own questions about the readings.  In terms of academic history, he is well deserving of the title professor.\nHowever, Professor Strohm is not perfect, and by no means fits my personal learning style.  Although some see the fact that he reads the books along with you a good thing, to me it is kind of a problem.  Although he might know the history behind Chaucer well, when it comes to greek history, biblical studies, or pretty much anything buy midevil literature, Strohm falls short.  His analysis is often shallow and one sided.  The worst part about his teaching is his monotonous voice.  Having the class right after lunch, I was hard pressed to stay awake.  If you are looking for an enthusiastic, young, vibrant teacher, Strohm isn't really for you.  However, if you  like to sit, relax, and hear a lecture/summary about what you read, stay with him.\nWorkload:\nVERY EASY. 3-4 2 page papers. no quizes or courseworks. unless you are a strong reader, you will find the final rather hard.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 17, 2006",
            "review_content": "\nPual Strohm is a nice guy with a very unique teaching method.  He is very approachable and will always help with problems and questions.  He likes to run class based off of what his students bring to class along with his own questions about the readings.  In terms of academic history, he is well deserving of the title professor.\nHowever, Professor Strohm is not perfect, and by no means fits my personal learning style.  Although some see the fact that he reads the books along with you a good thing, to me it is kind of a problem.  Although he might know the history behind Chaucer well, when it comes to greek history, biblical studies, or pretty much anything buy midevil literature, Strohm falls short.  His analysis is often shallow and one sided.  The worst part about his teaching is his monotonous voice.  Having the class right after lunch, I was hard pressed to stay awake.  If you are looking for an enthusiastic, young, vibrant teacher, Strohm isn't really for you.  However, if you  like to sit, relax, and hear a lecture/summary about what you read, stay with him.\nWorkload:\nVERY EASY. 3-4 2 page papers. no quizes or courseworks. unless you are a strong reader, you will find the final rather hard.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 10, 2005",
            "review_content": "\nProfessor Strohm seems perfect on paper. Former chair of Medieval Literature at Cambridge, he is a relatively new Columbia acquisition who teaches only Chaucer and, unluckily for my class, Lit Hum. Strohm has the best intentions in the world, and was genuinely excited about teaching this class. But this excitement did not manifest itself in preparation for class. Instead of reading the books in advance so that he could more deftly guide us through the course, he read each assignment with us. Some of the books he'd read before, some he had not. He spent large portions of the class discussing the meaning of passages that only he found ambiguous -- passages that he would have understood had he read the rest of the assignment more carefully. Strohm showed little interest in digging deep into the works we read, rarely helping us to find themes, explore symbols, or understand the true significance of the literature. He performed lengthy passage analysis, and was always delighted when he found similar passages in, for example, the Illiad and the Aenied. Classes were profoundly dull and almost entirely useless. \n"
        },
        {
            "course_name": "The Road Movie",
            "review_date": "February 22, 2005",
            "review_content": "\nThis was one of the best classes I've ever taken.  In fact, It's the only class in which I've done every single bit of assigned work, and done it with joy, because Prof strohm didn't overload us with work, and all assignments were very manageable and enjoyable.  \nThis was an english class in which we studied books and movies that had the main characters being on the road as the main theme.  Some of the gems we got to study included On The Road, Candide, The Unfortunate Traveler, Natural Born Killers, Sullivan's Travels, Thelma and Louise, Badlands, and O Brother Where Art Thou.  Professor strohm was refreshingly down to earth when it came to his teaching style and what he wanted us to get out of the class.  He is definately not one of those professors who expects you to have some smarmy over-the-top never been said before analysis, rather opting for interpretations of both the movies and books from which you actually learn something insightful and interesting.  Indeed, there were some snooty film majors who felt that the class lacked in depth, but this was not a film class that delved into the technical aspects of film, but rather a class that evolved around the theme of the road.  \nI would definately reccomend this class.  Prof Strohm even invited us to his apartment after the last class and cooked dinner for us.  He is the kind of Professor that genuinely wants you to learn something and genuinely cares about his students.  \nWorkload:\nvery maneagable.  final paper took some time, but otherwise he assigned a series of short papers instead of a few long ones so it was not sttessful at all.  In all, every aspect of the class was a joy.  Very fair and reasonable grader too, always encouraging improvement and welcoming you to come to his office hours.  \n"
        },
        {
            "course_name": "The Road Movie",
            "review_date": "December 20, 2004",
            "review_content": "\nThis class was pretty atypical for the English department: a film class in a lit department taught by a professor who specializes in Chaucer and medieval literature - about as far away as one can get from movies. Still, Prof. Strohm clearly knows a lot about film (having taught it at Oxford in addition to Chaucer) and has a passion for it. Unfortunately, that didn't always translate well into intellectually analyzing films. A lot of the film majors in our class were really bored by the surface-level analysis that we did, and I can't exactly blame them - Strohm didn't teach much theory, which made any intellectual discussion of the films we viewed (which ranged from Sullivan's Travels to Easy Rider to Thelma and Louise) sort of fruitless, with discussions devolving more into \"I liked this film because it had nice colors\" rather than any critical engagement. The texts we read as \"intros\" to road movies (The Unfortunate Traveller, Candide, Huck Finn, On the Road) were interesting, but we stopped reading 1/3 of the way through the semester (either a plus or a minus, I guess). Prof. Strohm is wonderfully nice and definitely interested and engaging, but there are certainly better seminars - and better film classes - to take.\nWorkload:\nNot bad: a 10-15 minute presentation on one book and one movie, a five page midterm paper, and a 15 page final paper. Screenings once a week at night, in addition to regular class. Talking in discussion is definitely a good idea (as with all seminars, really). Prof. Strohm is a fair grader and willing to discuss paper ideas and viewpoints. \n"
        },
        {
            "course_name": "The Canterbury Tales",
            "review_date": "September 02, 2004",
            "review_content": "\nProfessor Strohm, built like a walking stick and twice as sprighty, is as entertaining and intelligent as the professors come at Columbia. While not exactly a Renaissance character in terms of his English interests, the man *knows* Chaucer. His fascination with Middle English, Chaucer, and the individual context of each Canterbury Tale during his smiley, boucy lectures is permanently infectious. Strohm is very receptive to student commentary during his lectures but also allows the silent, brooding students to keep their solitary confines in the back of the class undisturbed. If you have even the slightest interest in The Canterbury Tales, take this class with no one other than Professor Strohm. He is like Tigger in that not only is he bouncy, trouncy, flouncy, pouncy, and fun-fun-fun-fun-fun, but quite possibly the best thing about Strohm is that he is the only one. Irreplaceable. \nWorkload:\nYou're reading nearly the entirety of The Canterbury Tales in actual Middle English, my friends. It is daunting at first, but with a few weeks of practice the language will be second nature, which is a muy le awesome feeling. About 1500 lines per week. Two fairly graded papers (3-5 p, 5-8 p) and NO midterm or final!  \n"
        },
        {
            "course_name": "The Canterbury Tales",
            "review_date": "August 14, 2004",
            "review_content": "\nStrohm really is a very nice guy, and his class is a great way to handle the English major pre-1800 req.  There is not a great deal of work aside from reading, which on most occassions could take less than an hour or so to get through.  He encouraged us to use interlinear translations online, which made the reading speed by and become intelligible.  Most importantly the class wasn't too intimidating, he's very sensitive to students' fear of Middle English and will hold your hand through the whole process.  He genuinely wants people to like the class and Chaucer, so he's very patient and encouraging.  Overall it was a good, not-too-intense introduction to Chaucer.\nWorkload:\nReading, weekly reading quizzes (very fair, not bad at all), and a paper or two\n"
        },
        {
            "course_name": "Chaucer Seminar",
            "review_date": "November 16, 2003",
            "review_content": "\nIf you've looked up PS' bio, you might be pretty impressed right now.  I don't know if being the chair of the English Faculty at Oxford is actually a big deal, but I know that being an american appointed to the JRR Tolkein chair of Middle English is pretty much like a Austrian being elected governor of the largest state in the nation.  It's a big deal.  That said, I'm still not entirely sure how he got that post.  He is a really sweet guy, but his analysis is less than insightful too often.  I think his importance in the Chaucer world (which is unquestionable) is due to his historical work, and not his analytical skills.  He does make it a pleasant class, though.  Certainly Chaucer is awesome if you give it some time.  Unless you are looking for some crazy deep insights into the literature, you shouldn't be disappointed by Strohm's class.  Oh, and don't be intimidated by the language--ME is easy once you've done it for a few weeks.\nWorkload:\nNot bad.  About 1500 lines of Chaucer a week once you get comfortable with the language.  Three very short papers and one final paper (12-15 pgs.)\n"
        }
    ]
}