{
    "prof_info": [
        {
            "prof_name": "Stephanie O'Rourke",
            "prof_id": 9452,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "March 29, 2015",
            "review_content": "\nI had O'Rourke for art hum last summer. Despite the short time-frame, she managed to make it an intellectually engaging and relatively painless experience. If you get her, do not switch out! She's obviously sort of brilliant but also engaging and actually quite funny. I went into the class with some serious skepticism and found to my surprise that it was so much more interesting and complicated than I would have guessed. By the end, I was definitely that annoying guy who puts his hand up to answer every question. If you have to sit through three straight hours of art hum, you would be hard-pressed to find a better instructor to do it with. She knows a ton, but still wants to hear what you think about things. The readings were a nice mix of contemporary and historical sources. I especially appreciated the emphasis on visual analysis and critical thinking over rote memorization. It was the best core class I've taken yet, and probably one of the best I've ever taken at Columbia. In sum: great instructor, fair grading, enjoyable experience. \nWorkload:\nJust do the reading and put in the effort in class and you will do well. The work load is totally reasonable. I didn't end up needing an extension but a friend of mine did and said she was very humane about it.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 29, 2011",
            "review_content": "\nThis class is how art hum should be. Chill, non-intrusive, and yet thought-provoking and informative. O'Rourke runs class in an organized manner, and rarely straight-up lectures. Instead, her class is very much discussion based. She never shuts down ideas, and is careful to add context without asserting her own opinions too strongly. The result: twice a week, you sit in class, stare at art, and talk about it with a resident expert.\nShe requires very little memorization on tests, as her aim for the class was to develop formal analytical skills. The papers she assigned were actually fun to write, each requiring you to explore the art scene of the city in some way on your own terms.\nSo if you find yourself signed up for this section, do not fear, for you have found a good one. Easy in a good way, and one that I think I'll miss.\n\nWorkload:\nTwo Essays (3-4 and \"6-ish\"), two museum visits (one optional) that are both enjoyable, midterm, (take-home) final. There are readings due every class that you are expected to know for the tests, but they aren't long and she goes over the main points in class. The tests consist of sets of two-artwork comparisons. You're expected to know what you're talking about, mention a few of the readings and maybe some concepts and vocabulary introduced in class, but she provides the date, the names of the artworks, and the artists.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 25, 2011",
            "review_content": "\nStephanie was a fantastic Art Hum instructor. She was passionate about the material and could clearly articulate important points about each work of art/artist or movement in a succinct, understandable way. Yet she never let her insight into the material hamper class discussion; she was arguably more interested in hearing what the class had to say than lecture for the entire class period (which is probably why class participation counts for a whopping 25% of your grade). Class was hardly ever boring, either--she has a skill for stimulating discussion and making you genuinely interested in whatever material we're studying. In sum, she's extremely approachable, at times cheeky, and overall a reasonable and great instructor. Consider yourself lucky if you have her!\nWorkload:\nSo much reasonable than most other Art Hum sections: weekly readings, two papers (one short, one long), midterm, and take-home final. Her midterm and final consist of NO specific memorization and simply a series of comparisons for which she gives you the artists and dates. Everything was reasonably graded.\n"
        }
    ]
}