{
    "prof_info": [
        {
            "prof_name": "Michael Hill",
            "prof_id": 4134,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Transport Phenomena I",
            "review_date": "September 02, 2010",
            "review_content": "\nThis class was mostly interesting but the lectures could be quite dry. Most of Professor Hill's lectures were spent deriving formulas, which seemed like a waste of time. \nMake sure you go to class or get the notes from someone reliable when you can't make it. The book was kind of useful, but mostly really difficult to shove through; at least lecture made it easier to digest. \nHomeworks were the most awful part of this course as they took up a LOT of time, and didn't add any value. I never felt like I learned anything from the homework because it was mostly pages and pages and pages of algebra... I felt like the class had so much potential, but most of it was lost.\nProfessor Hill, though, I have to say, was extremely enthusiastic about teaching and really takes his job seriously. He's not like most other Columbia professors who only care about their research and regard their students as useless. \nProfessor Pacheco, while extremely nice, is a little tough to understand sometimes and might not have been the best teacher. It was her first semester, so that makes sense. To compensate, she did give really good handouts which we were allowed to bring to exams.\nI would also suggest participating in this class and asking questions whenever you don't understand.\nTreat the recitation section as mandatory. Make sure you don't schedule a class during that time. The professors basically treat it as lecture/review and go through slightly different stuff sometimes.\nBoth professors are extremely nice and really really care about their students. Their teaching style could use a little work. If you're a chemical engineer, you have no choice but to take this class, but at least you can know what to expect.\nGood luck!\nWorkload:\nHomework (~5-8 hours worth of work) every week\nCanceled the group project\n2 Midterms (open-book, open-notes)\n1 Final (open-book, open-notes)\n"
        }
    ]
}