{
    "prof_info": [
        {
            "prof_name": "Cristian Virdol",
            "prof_id": 3150,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "May 13, 2010",
            "review_content": "\nVirdol is hilarious. He's such a terrible teacher, it's entertaining. He comes in late, and he goes ridiculously fast through the material. In the latter half of the semester, he often dismisses class within 30 minutes. If you're going to class, bring an iPod to keep you entertained.\nThe HW load is really good; 6-8 problems. He gives practice tests, which are usually the exams he gave the year before. They look exactly like the actually exam.\nDon't go to class.\nLearn and memorize the practice stuff.\n\"Shamelessly grovel for points.\" (as a previous reviewer said)\nWorkload:\n11 HWs of short length\n2 Exams\n1 Final\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "May 07, 2010",
            "review_content": "\nProfessor Virdol is far by one of the worst teachers I've had at Columbia. So bad, it was actually kind of entertaining. Professor Virdol clearly abhors teaching. He often came in late (he did squeeze his office hour in between classes), burned through explanations and examples with little more than \"So you've got dis guy... and den you get dis guy... And den you get dis guy.\" He once went through two book sections in 30 seconds. He's got horrible handwriting, e.g. a \"t\" looks like a \"+\", which both look like a \"Ïˆ\". I found his lectures marginally helpful in doing the work. He never looks around to see if there are questions while he's lecturing, and has no intention of answering any even if he does see a hand go up. And at the end of class, he tries to burn out the door without staying to answer questions.\nHOWEVER, the workload isn't too bad. He assigns problems sets of about 6-8 problems a week, 2 from each section he covers. The homework problems he assigns are fairly representative of what you can expect on a test. Additionally, he gives practice exams that are very representative of what you will see on his exams. He goes through them in class (in my opinion, the most entertaining classes are the exam reviews: he burns through problems, skipping a lot of steps, and finishes the exam in about 45 minutes).\nBottom line: Virdol's a horrible lecturer, but the class could be worse. You can skip lectures and be fine.\nWorkload:\n12 problem sets, 6-8 problems each. 20% total.\n2 midterms, 20% each.\n1 final, 40% each.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "May 06, 2010",
            "review_content": "\nProf. Virdol was a horrible teacher. Perhaps it was the pacing of the class, but I cannot say that I learned anything due to what I was taught in class. Prof. Virdol would come in, quickly rush through the material for the day, and then give up and leave class after half an hour, saying that the textbook was too short for us. During exams, he would hand out the tests and then sit down, put his iPhone headphones in his ears, and then watch a movie and giggle to himself noticeably. Prof. Virdol would rarely finish solving an equation; he would instead go halfway through and then tell us that we could solve the rest ourselves. His examples did no elucidate the material, he could communicate the material to us effectively, and he could not answer questions satisfactorily. Midway through a lecture or question, he would stare at the board with his hand on his chin, thinking of how to solve the problem or what to say. This indicated that he had not prepared satisfactorily for the lecture, even if he did have notes.\nThe grading process in this class was also impossible to understand. His exams were far harder than the material he attempted to teach in class, and his practice exams were nowhere near similar to the real exams. Homeworks were originally graded on a 100 point scale, but after the second midterm, were graded on a 10-point scale at most, with the value of the homeworks decreasing until they reached 6 points or less each. The homework was somewhat helpful in practicing the material, but the large amounts of graphing that we were made to do were never asked of us on the exams. The textbook, Elementary Differential Equations and Boundary Value Problems by William E. Boyce and Richard C. DiPrima, is a decent book. It helped in learning the material, but even then, it seems to teach by examples and does not give straightforward explanations of how to tackle the different methods for approaching differential equations. However, the textbook was far better in teaching the material than Prof. Virdol ever was.\nI would never recommend Prof. Virdol as a professor, not in a hundred years. No one deserves that sort of misery.\nWorkload:\n11 Homework assignments, one assigned every week. Each assignment consists of anywhere from 5-10 problems and takes on average 2-3 hours. Two midterms and a final. Practice exams given and partial solutions given in class. Initial homeworks are graded on a 100-point scale, while later homeworks are worth no more than 5-10 points. Final grade is determined by final (40%), midterms (20% each) and homework (20%). \n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 30, 2009",
            "review_content": "\nI agree with most previous reviews: Virdol is a terrible teacher. \nI disagree with most previous reviews: Virdol is not an excellent mathematician.\nHe doesn't seem to know his stuff at all. He often finds himself not knowing how to proceed in a problem, and during one of the classes actually said \"To calculate this integral, you need to use a trick. What it is, I don't know.\" This was about a question on the practice final; slightly unnerving if you're student in such a class. He mumbles away for an hour and fifteen, occasionally flashing a wry smile that really he has no reason to. \nFortunately, doing well in his class is the simplest formula ever.\nGo over all the practice exams given before any particular exam. Midterm 1 was almost exactly the same as Practice Midterm 1, same with Midterm 2, and the final was a mix of the two practice midterms and the practice final.\n\nWorkload:\nWeekly assignments. Ranging from a couple of hours worth of work to around 4-5 hours.\nTwo midterms. Straight \nOne final. Again, straight from the practice exams.\n\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 28, 2009",
            "review_content": "\nBe prepared to self study the subject the whole entire semester. Virdol is a good mathematician and picked an excellent textbook for you to study from. There is no point in going to his lectures because he just mumbles incoherently into the board and it is better for you to stumble through the HW problems. The only classes worth going to are the review classes before the midterms and final. If you understand the practice midterm and finals then you are golden for the class. \nTo summarize, in order to do well in the class you only need to do three things: \n1) Do the HW, skip classes\n2) Memorize the practice midterms/finals\n3) Shameless go beg him for points on the midterm/final you just failed during OH right after you get your test back (sucks for you if you failed the final though). \nWorkload:\nWeekly problem set. Really easy in the beginning, gets ridiculous toward the end. \n2 Midterm, each worth 20%, 1 final. All based on practice midterm/final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 12, 2009",
            "review_content": "\nProfessor Virdol is not a good teacher. He is funny, laughs to himself a lot. His handwriting is almost impossible to decipher the first few weeks (ask well as his accent) but if you go to class regularly then you will understand it. I do not recommend taking his class if you have not taken Calculus in high school. If you are one of those who got a 4 on the AP Calc BC test or a 5 on the AP Calc AB test then this professor is the one for you. He doesn't teach and as long as you do the homework well then you'll be fine. The final was hard but great curve. The homework questions are usually pretty easy but there are some annoying intricate ones as well. Webworks is annoying. \nWorkload:\nabout 25 problems due every week. Two midterms (pretty easy). One Final\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "May 26, 2008",
            "review_content": "\nVirdol is a mathematician, not a teacher.  He is brilliant as the former, dismal as the latter.  I love math, but found this class an ordeal of the highest order.  He completely failed to cover the basic concepts behind differential equations; rather, he churned through the mechanics of solutions.  I found myself having to use MIT's excellent OCW (Open CourseWare) videos of the 2003 lecture series by Professor Arthur Mattuck.\nI strongly recommend avoiding this professor if possible.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 23, 2008",
            "review_content": "\nHe can't teach at all. AVOID HIM AT ALL COST! Even if you think you know Calculus, you'd still struggle through the course. The average grade of the first midterm was below 60 out of 100. You would have needed to have taken CALCULUS three times before taking this course in order to pass with a C+ or higher. And he can't pronounce half the mathematical terms. It takes you five minutes to figure out what he's saying half the time.\nThere are two midterms and one final that is worth 40 percent.\nWorkload:\nWeekly webwork and weekly problem sets\nWebwork were more annoying and harder than the problem sets. The HW problems that are assigned will not help you in the end with the Final or the Midterms.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "June 07, 2007",
            "review_content": "\nBrilliant mathematician but terrible professor.  I only went to class 5 times and 2 of them were to take midterms. The few classes I did attend were confusing as he does not explain each step clearly and just makes big jumps in the examples he writes on the board without explaining the necessary logic in figuring those steps out. That said, the course is moderately difficult but with a friend and the solution guide the problem sets are manageable. I learned this subject completely from the book and with the practice midterms and final he posts a couple classes before I got an A- in the class. The practice tests are very similar to the actual tests so learn those cold and you should be fine for the test.\nWorkload:\nWeekly problem sets (1.5-2.5 hours), 2 midterms (Relatively Easy), Final (Moderate)\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "January 16, 2007",
            "review_content": "\nHe is an alright guy but not the most talented of professors.  You will pretty much be teaching yourself all the material.  \nWorkload:\n10 hw problems a week.  (Usual is 3 problems for most ODE classes)  If you want to do well on these hw's they take a really long time.  Two midterms and a final.  Puts in difficult questions in order to have a spread of A's B's and C's in the class.  Look for someone more experienced if you can.  \n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "January 15, 2007",
            "review_content": "\nVirdol is new to Columbia and still learning the ropes of how things work. He is a fairly decent instructor but the homeworks can be very long. We had a very small class in the fall so grading was tough. Its pretty standard with 2 midterms and a final. ODE is a drag and you need to do the problems on your own so going to class isn't all that helpful. He is fairly accesible and posts problems that are the same on both the 7th and 8th editions of the textbook (so you can save money buying the earlier edition)\nWorkload:\n2 midterms (harder 2nd one), final and long problem sets weekly (10 mandatory questions)\n"
        }
    ]
}