{
    "prof_info": [
        {
            "prof_name": "Pamela Smith",
            "prof_id": 2719,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Daily Life in Pre-Modern Europe",
            "review_date": "May 08, 2011",
            "review_content": "\nBuckets of reading, buckets of writing, but the readings were generally fascinating and you got to adapt the essay subjects to your own interests, so they were totally bearable. Smith is extremely knowledgeable and completely willing to admit when she doesn't know stuff. You have to lead at least one discussion section, but you get to pick which one. One of the essays is on a local museum exhibit, so it does take time for going off-campus and finding scholarly material on curatorial stuff, but I thought it was a good time.\nWorkload:\nThree essays (3, 6, and 9 pages), a gazillion books.\n"
        },
        {
            "course_name": "Alchemy, Magic, Science",
            "review_date": "January 18, 2011",
            "review_content": "\nThis class was one of the best I've taken at Columbia. Professor Smith's lectures are clear, engaging and lively and made me actually look forward to a morning class! \nThis course has a significant though not insane amount of reading.  Because you are given a good amount of choice as far as what to write about for the midterm paper and the final, you can definitely get away with some skimming if you need to.  While some of the reading is dry, the texts that are are really the exception.  I found most of the reading really interesting, and even though I'm not a history major I found it pretty accessible.  \n If you have any interest in epistemology or the history of science I'd recommend this course highly.  It manages to be both fun and intellectually rigorous.  Don't be scared off by the previous reviews; I'm glad I wasn't!\n\nWorkload:\nOne 8 page research paper, an in class final, a one page essay, 10 courseworks postings.  Grading is rigorous (this is NOT an easy A class, but if you work you can get an A), once a week section.\n"
        },
        {
            "course_name": "Withcraft In Early Modern Europe",
            "review_date": "December 27, 2005",
            "review_content": "\nDo not take this class. I took it because it was the only seminar open, and I wanted to skip it every week. I love European history, but this class was so boring. The material is bland, repetative, and unnecessary. I learned absolutely nothing, and Professor Smith just makes everyone sit around in groups discussing reading that most people don't do, on account of its boring-ness. She is new to CU, so maybe she is just getting into the swing of things, but until she does-don't torture yourself with this every Tuesday morning. It just isn't worth it. She writes meaningless things on the bored and speaks in a monotone. \nWorkload:\nmoderate-reading (that is long and repetative), 2 term papers (very hard grader, eventually she gets used to your writing, but she's really hard on the way you citation and will take off 2 grades for it)\n"
        },
        {
            "course_name": "Withcraft In Early Modern Europe",
            "review_date": "December 16, 2005",
            "review_content": "\nHere's the deal:  she's a visiting professor teaching European History for the 2005-2006 school year.  While the titles of her seminars sound interesting and have potential, CLASS IS PAINFULLY BORING.  Furthermore, she is a harsh grader.  It appears to me that she either likes your paper or she doesn't, (ie: A+ or B-) there is no medium.  Goodluck!\nWorkload:\nWeekly reading and summaries; 10 page paper; 15 page paper\n"
        }
    ]
}