{
    "prof_info": [
        {
            "prof_name": "Mark Berger",
            "prof_id": 10578,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 25, 2014",
            "review_content": "\nI don't think I could form any kind of strong opinion about Mark after having taken CC with him. He's a nice guy and there's no question that his genuine passion is for philosophy, which is often made clear when he says things like \"Alright. So. Let's get started. We have a loooot to talk about. I typed up twenty pages of single spaced notes for today.\" Although at first this made me think there might be long, drawn out lectures ahead, I'm glad to say we never had any of that. He just really did have a lot to talk about.\nA lot of the time, he taught by drawing very large flow charts, which I think was a thoughtful attempt to clarify what he was saying, but it ended up making everything more confusing. I found that if you copy down in your notes what he writes on the board, it's sort of difficult to make sense of all the arrows and bubbles and things later on when studying for the midterm or final.\nWhen he disagreed with a comment someone made, he usually said \"we want to be careful about saying that [----] is [----],\" or \"that's actually a really big question for [rousseau/plato/berlin..etc].\" He usually then provided a cut and dry rebuttal to the comment, which turned the class into more of a series of \"Q and A\" sessions with a few individual students than seminar conversation. Perhaps that's the nature of philosophy, and to be fair, that's where his background lies, but I think CC in particular is an opportunity to do more than decide whether or not we agree with each text, acknowledge our 21st century bias, and then move on. One time he planned a group activity for the lesson on the bill of rights, and that did a much better job of getting interesting discussion going. \nOverall, I think he's still refining his teaching technique right now, but it seems like he's on the right track.\nWorkload:\nStandard. No real incentive to read because there's no quizzes. Two papers, a midterm and a final. The final was not cumulative, but just on the stuff we learned since the midterm.\n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "June 19, 2012",
            "review_content": "\nI highly recommend this course/professor/TA.\nFirst: the professor. Morrison is one of the nicest, smartest professors I have had so far at Columbia. He's very approachable, and if you have any questions at all you can meet with him in his office hours. He makes lots of endearing jokes (which aren't always funny. but that's why they're awesome). Also, he's so enthusiastic about everything! He really loves what he's doing, especially when we get to Spinoza (which is his favorite). \nnext: the TAs. I had Mark as a TA and he is FANTASTIC. his discussion sections were really interesting. He's so smart and explains even the toughest concepts in a way that everyone will understand. He's a very very fair grader- he wants you to do well! Meet with him in office hours to go over the paper topics and fine tune your arguments.Also the day he lectured the class confirmed that he will make an amazing professor one day.\nand finally: the class. It wasn't an easy A class. You can definitely do it, but if you go to lecture/don't read or read/don't go to lecture you'll have to work a lot harder to get that A. Trust me, trust me, it's worth it to do both. The material is interesting, and the lectures are enjoyable. It's a good way to get introduced to philosophy, or John is a great professor to have when you are finishing up your philosophy major requirements. \nWorkload:\nNot too much reading, but some of it's dense (i mean, what do you expect, it's philosophy!) You can get away with not doing the reading if you go to class, but to get everything out of the course you should do both. \n3 one page papers (single spaced, pretty much just translating a philosophers idea into clear/concise sentences) \n1 four page final paper comparing the ideas of several philosophers\nmidterm and final with 20-30 short answers (final is NOT cumulative! very doable!)\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "November 27, 2010",
            "review_content": "\nMark is everything a TA should be: brilliant, accessible, engaging, available, and he truly cares about his students. He is extremely knowledgeable, and can answer any questions about the material, but he does so in such a straight-forward way that really distinguishes him from other philosophy TAs. His only goal seems to be that his students really really understand the material. Even when people ask silly questions- and it's philosophy, so people do ask silly questions, Mark addresses them comprehensibly. As a result, people feel really comfortable asking questions in recitation, and recitation is for that reason really enjoyable and educational. Furthermore, Mark makes himself really available to his students. He responds to emails, and if you can't make his office hours, he hold office hours at another time, just so you can meet with him. In short, Mark is absolutely fabulous, and any philosophy student would be so lucky to be in his section. \nWorkload:\nN/A\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "May 16, 2010",
            "review_content": "\nI've had Mark as my TA for two semesters now, and I really hope that I have him again for a philosophy class next semester! He's honestly a really devoted, awesome TA - and this is only his second semester as one! I can say for both classes that he was really accessible and approachable, and, like the previous reviewer said, almost always added more office hours - especially around the midterm or exams. And if you couldn't make his hours for certain weeks he was more than happy to make an appointment with you. His feedback on papers have always been really helpful, and he never seemed to mind answering even the silliest of questions, and seemed to genuinely care about the students understanding the material!\nWorkload:\nn/a\n"
        },
        {
            "course_name": "History of Philosophy II: Aquinas to Kant",
            "review_date": "May 07, 2010",
            "review_content": "\nMark is a fantastic TA.  I'd never had a philosophy class before, so (surprise, surprise) my first paper sucked.  I didn't realize that beforehand, of course.  I have always been good at writing the creative writing / English class types essays, so I was surprised when I got a C+ on my first History of Philosophy paper.  Okay, surprised.. maybe a little angry.  \nBut when I stormed into Mark's office hours ready to defend the honor of my paper, it turned out that he was very understanding and glad to take the time to explain how a philosopher paper is supposed to be written.  And I did take a lot of his time.  He offered extra office hours just about every other week (extra meaning 4 hours total - more than I've ever seen offered by a professor of TA before), and though I was in there often he never minded.  He was also really good at explaining the material, which was not always clear from the class lectures (and usually the papers topics weren't covered in class).  All in all, he's probably the best TA I've had so far!\nWorkload:\n.\n"
        }
    ]
}