{
    "prof_info": [
        {
            "prof_name": "Wendy Waterman",
            "prof_id": 3385,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Acting the Song",
            "review_date": "May 04, 2016",
            "review_content": "\nActing the Song is perfect for singers/actors who are looking to expand their repertoire. I highly do not recommend this course to acting or singing novices-- it requires you to get up in front of the entire class and perform a solo song with an accompanist. You must learn the song on your own, so music reading ability is highly recommended. Wendy is an interesting teacher– she cares deeply about each of her students and does not prioritize anyone despite discrepancies in talent or commitment to the class. Wendy not only exposed me to a wide variety of musical theater that I have never experienced, but she helped me develop my belting voice which I have been struggling to unleash for the past few years. Her song selection is sometimes questionable, and she has zero regard for time-- she could spend 45-60 minutes on one student if permitted to. That being said, she also teaches at Juilliard, therefore is very knowledgeable about the performing arts world. She clearly wants her Columbia/Barnard students to succeed, even if we are not her conservatory students.\nWorkload:\nYou are expected to come to class with your music fully memorized. She also requires that you listen to a new musical each week and write a quick journal entry about it (aka the perfect homework for any musical theater aficionado).\n"
        },
        {
            "course_name": "Acting the Song",
            "review_date": "September 26, 2010",
            "review_content": "\nActing the Song is good for your soul. Whatever the rest of your schedule is like, this class will be an oasis. Wendy is *the real deal* and a testament to the fact that truly talented people are generous and supportive of others. Wendy provides highly personalized attention to each student and sets the tone for a collaborative, almost utopian learning environment. \nIn this class, you will be exposed to dozens of musical theater songs you probably didn't know, add a handful of them to your repertoire, get to know the other students, grow as a performer, and receive lots and lots of attention from a Juilliard professor who is also a wonderful person. \nI don't think Wendy is ever hard-pressed to fill this class, and there's usually a waiting list to get in, but go try and be in it! You will love it and you will learn.\nWorkload:\nLearn three or four songs over the course of the semester, and some very manageable writing--no papers. Just journal-like.\n"
        },
        {
            "course_name": "Acting the Song",
            "review_date": "January 25, 2008",
            "review_content": "\nWendy is the best teacher in the theater department at Columbia. Do whatever you have to to take a class with her. She will help you to do things you never thought you could do on stage. She is simply a fantastic teacher, knows so much about voice, and has an amazing ability to bring out the best in her students.\n"
        }
    ]
}