{
    "prof_info": [
        {
            "prof_name": "Catherine Williams",
            "prof_id": 10399,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "June 22, 2011",
            "review_content": "\nCatherine Williams is probably the best math professor I've had at Columbia. If you're in SEAS like myself and you have the choice of taking the math department linear algebra with her I would take that opportunity. I can't speak to which course is more difficult, but I've heard bad things about other linear algebra sections in both the math and applied math departments, which some of my classmates found to be painful, and certainly far from enjoyable experiences. Not so with Catherine Williams. I mean the fact that she speaks English clearly and fluently already makes her a cut above the rest for a science/math professor, but moreover the clarity in her proofs and explanations is second to none. Tests aren't easy, but generously curved, she's helpful in office hours and she'll bother to remember your name if you show up, which is a nice touch for a large lecture. I also agree with the other reviewer who mentioned that she's not exactly an eyesore either. \nWorkload:\nSome difficult problem sets, on which you'll always lose some points, but don't sweat since it's the same for everyone. Some difficult, but manageable extra credit opportunities. 2 Midterms, both easy to beat the curve if you study. One difficult, heavily curved final. \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "June 13, 2011",
            "review_content": "\nI loved Catherine's class!\nI've been into math through high school and college, but this was my first time taking linear algebra. Catherine was by far the best teacher I've had at Columbia so far. Her lessons were clear, and she was very helpful during office hours. Compared to other sections, I felt like her class was indeed harder, but put in the effort, and it'll be worth it. The exams were challenging, but she grades generously at the end.\nWorkload:\nWeekly problem set, taking around 2~3 hours.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 06, 2011",
            "review_content": "\nI thought Catherine was an awesome prof! After being turned off math from a bad experience first semester of Freshmen year, I now wish I had majored in it. Partly I think this is because the material was pretty cool, and Catherine will never fail to point out how neat some of the theorems and proofs are (I agree!). But it sure helped that she was genuinely enthusiastic about linear algebra and tried to get us excited as well. She always stayed behind to entertain whatever questions, scheduling problems or vague mathematical ruminations we had. I thought it was incredibly nice of her to try and remember all our names.\nCatherine is really good at explaining abstract concepts and won't shy away from attempting an intuitive explanation or non-intuitive ideas. I'm a senior this year, and this is my first CULPA review. I just felt compelled to write one because I really think she's a star instructor.\nWorkload:\nHer lectures and board work are very well organized. I barely had to use the textbook. It's true that sometimes the homework problems were laborious and difficult, but I thought the more abstract questions really helped us understand the material in the end.\nComing into the class I didn't plan to work that hard: this was my sixth class and I thought--pretty much correctly--that I could learn most everything from the lectures. But I ended up studying for this class the most during finals because Catherine inspired in me an admittedly perverse interest in linear algebra. Also, it's hard to slack off when she really wanted us to do well.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 26, 2010",
            "review_content": "\nCatherine was by far the best math teacher I've had at Columbia. Her lectures were extremely easy to follow, she made a fairly drab class pretty lively with her ebullient personality, and since I'm a non-math major guy, most importantly, she's quite good looking.\nCatherine really cared about her students and made herself available often for office hours, and one thing that really stuck in my mind was that she made an effort to memorize all of the students' names, even though it was a 100 person lecture. \nI don't know if she's tenured and will be teaching again, but she should be- her linear algebra class was my favorite class of the semester, mostly because of her teaching style.\nWorkload:\nWeekly problem sets that got pretty difficult (based mostly around theory), two midterms and a final that didn't throw any curveballs\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 23, 2010",
            "review_content": "\nZOMG Catherine is amazing! Her lectures are really well structured and easy to follow. She does cover a lot of ground in a short time though, so its easy to miss major things.  \nShe also brings a level of enthusiasm to her lectures that is rare for a math class, and it helped keep my attention from wandering during class. \nI got the feeling Prof. Williams wanted us to have a really solid conceptual appreciation of the math. Homeworks and exam problems tended to be 1. tough 2. reliant on knowledge of the theory. You won't get very far by just knowing how to do the cookbook algorithms for problems.\nShe's also very helpful discussing concepts or tough hw problems (lots of these) in office hours, which meant they tended to be overrun, but that's not her fault. \nShe's also really nice, will remember you by name for the entire semester, and when her phone accidentally went off on the first day of class, the ringtone was the Star Wars cantina song! *heart*\n\nWorkload:\nWeekly Psets, two midterms, final. A few easy problems coupled with some toughies. \n"
        }
    ]
}