{
    "prof_info": [
        {
            "prof_name": "Sonya Chung",
            "prof_id": 10209,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Fiction Workshop",
            "review_date": "April 29, 2012",
            "review_content": "\nWow, Sonya does not have enough reviews, so I'd like to throw in a couple words.\nShe is a really great workshop guide. Even though I can't see myself wanting to talk to her much outside of class and her personality is intense, her input is incredibly astute and helpful.\nOut of all the creative writing professors I've worked with, she was the one who was most able to understand a writer's vision of a project and how to critique the intended goals. Everyone aims at this, but many professors let their opinions on writing get in the way. Sonya was very strict about avoiding this.\nAs someone who writes fantasy, this made the class a much more healthy environment to deal with sharing a different genre with the class. Her input helped shape the discourse in a really constructive way, and I ended up getting a lot of knowledge about my own writing and goals over the duration of the course.\nWorkload:\nThree stories to turn in, some stories she hands out every so often, comments on all student stories (3 a week), and a portfolio with one or two revised stories. She gave extra credit if you revised two stories, and extra credit if you gave a presentation on a story you liked at some point in the semester.\n"
        },
        {
            "course_name": "Approaches to the Short Story",
            "review_date": "May 08, 2011",
            "review_content": "\nSonya Chung is by far one of the best teachers I've had at Columbia. The reading she assigns is a truly varied cross section of modern literary short stories, and she really knows her stuff. She's able to provide insightful comments on the reading and get students to think about it in ways they might not have otherwise. She's also a careful reader of student work. I don't think I've ever gotten more helpful feedback on my writing than I did in her class.\nSonya is tough and she will not let you get away with anything. If you're trying to coast and looking for an easy A, do not take this class. Things must be handed in on time in hard copy form, you may not be more than five minutes late to class (two lates are counted as an absence), you may not have more than one absence or it will affect your grade (she will never excuse more than one absence), and if you haven't done the reading very, very closely, she will know about it, because you will bomb her weekly quiz (Sparknotes will not help you here).\nIf you really care about your creative writing and want it to improve, this class is well worth the challenge. Sonya doesn't give busy work. You will benefit from every ounce of effort you put in.\nWorkload:\nRoughly 80 pages of reading/week (but varies), weekly quizzes on the reading, three short writing assignments (1,200 words), and one final writing assignment (3,500-5,000 word story)\n"
        }
    ]
}