{
    "prof_info": [
        {
            "prof_name": "Adam Gregerman",
            "prof_id": 2176,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 21, 2006",
            "review_content": "\nHe is a decent guy, and you can tell he means well, but he's not a great teacher.  We rarely ever discussed more than the first 100 pages of each book because we wasted time on unimportant details.  Any confussions about the books were never settled, and the discussion was always surface level and rarely ever interesting.  He isn't too tough on the grading, though he is VERY inconsistent on the papers, and he is very approachable, but he makes the class too hard to be an easy A, yet too banal to motivate you to work hard and care about the material.\nWorkload:\nPost on courseworks once a week-easy but a pain in the ass, about 15 pages of writing in either two or three papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2006",
            "review_content": "\nI think Gregerman is great. Sometimes class was hard to get through (it was 9AM and we were tired... it's a ton of reading... etc), but Gregerman really cared about the class and tried his best to make it interesting. He always replied to emails in a timely fashion and his answers to emailed questions were helpful. He's approachable, understanding, and responsive to students' needs (for example, he is generous about giving paper extensions when necessary). He was also a fair grader. The \"instructor's choice\" books that he added to the syllabus were well-picked and enjoyable to read. His expertise is the Bible, but he is knowledgeable about all the books on the syllabus. Overall, it wasn't an easy class for me, but I felt fortunate to have Gregerman because he made it a good experience. (Plus I think it's really cool that he is raising a service dog and he brought the dog to class on the last day! :-))\nWorkload:\nApproximately two 7 page papers or three 5 papers, weekly courseworks postings, midterm, final, class participation\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 18, 2006",
            "review_content": "\nHe's probably the nicest prof you'll ever have...he's earnest, and generally cares about both the course and his students. While it's evident that he really does spend a lot of time reading every SINGLE word of your papers, some of the corrections are nit-picky and difficult to understand. He tends to devote too much class time on each point he wants to discuss, resulting in a somewhat boring, redundant conversation amongst the same few individuals. Also, compared with other Lithum profs, he's VERY anal about attendance, even making his students indicate whether they are tardy on the attendance sheet. Overall I enjoyed having him as a professor because he fostered such a comfortable environment in the class, but I feel as though if he had been a more experienced teacher who knew which topics were the most important, I could have gotten more from the discussions and the texts. \nWorkload:\nMore instructors' choice texts than any other profs I've heard of, and also Courseworks postings. We tend to move more quickly than other classes do.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 13, 2006",
            "review_content": "\nI will try my best not to have this review resemble the previous post too much, but I do agree very much with the points made in the last post. \nMr. Gregerman is a nice guy and tries very hard to be friendly and approachable. As the last poster said, he tries hard to get everyone to talk in class. In one early class, Mr. Gregerman brought in some food, and we spent the entire two hours getting to know each other. Although a nice gesture, I was also impatient -- we only had so little time to discuss a work, and one valuable class had been taken up. There were other times in the semester when I felt similarly, usually due to the slow pace of our discussions. \nThe class discussions rarely, rarely contributed anything new to my understanding of the text. Most of the times I felt we only scratched the surface of a work -- we discussed the plot, the characters, and many of the more \"surface\" elements of a work, but did not probe deeper. Mr. Gregerman also had a way of dismissing ideas (perhaps not even intentionally) if it was not the answer he was looking for (if he had asked a question), or if he did not find it interesting.  \nFinally, I agree with the last poster about his poor feedback on papers. Although I did well on my papers, I was always left confused about why I received my grade. He never offered constructive criticism, and I felt that he would bring up completely random (and seemingly unwarranted) points -- both critical and noncritical -- about my paper. \nOverall, I feel that Mr. Gregerman lacked a passion for teaching the course; he was nice, he meant well, he tried to keep us all engaged with a few questions he tossed out each class, but the class itself lacked vitality. I was especially disappointed by the Bible unit which I was expecting great things from, as that is his area of expertise. Perhaps the fact that it was 9AM is more to blame, but I will once again echo the sentiments of the last poster: if you are really looking to get the most out of LitHum, you can do better.\nWorkload:\nNot bad. Standard reading, 1 midterm, 1 final, and 3 papers. Post on Courseworks once a week. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2006",
            "review_content": "\nI really don't know what to say about Prof. Gregerman; he has to be the most enigmatic teacher I've ever had.\nHe's a very nice guy, don't get me wrong. He makes himself accessible if you have a question and he's happy to clarify anything for you should you need it. He's also very organized and efficient. Mr. Gregerman tries hard to get everyone to talk in class, and he spent much time during the first few classes in making everyone feel comfortable. He also encourages people to bring food into class, in an attempt to keep us awake. \nHe does have many flaws, though. For one, he doesn't give good feedback on papers at all. He scribbles comments all over your paper and writes an incoherent paragraph (i.e., a couple of sentences) at the end, leaving you confused about your grade. In addition, he's very dry and class usually crawls at a snail's pace. Sometimes he comes into class with one or two points that HE wants to get across, so most of the 2 hrs. will deal with that. Other times, he really pushes discussion of 1-2 questions, but sometimes it doesn't get anywhere.\nThere are many times when I leave class and don't feel like I'm getting anything out of the books. Class discussion doesn't probe into the \"deep\" issues; instead, we talk about the broad issues in the most general way possible. (But the class is at 9 AM, so...)\nHe's a decent guy, but you could do better.\nWorkload:\nUsual reading/midterm/final + 3 papers. He does expect us to post to Courseworks every Monday or Wednesday, depending on our last name. Somewhat tough grader, though.\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "June 15, 2005",
            "review_content": "\nReally good!  Can't speak for anything else, but he really knows his Bible.  He's very nice, very enthusiastic, and really does have some fascinating insights into the topic.  He's one of the most interesting grad. student teachers I've had.  He's extremely friendly and tolerant of endless questions, and happy even to answer the annoying ones.  Highly recommended!\nWorkload:\nReasonable -- it was a summer course so a little compressed.  Short response papers for every class and reading ranging from 60-150 pages per session.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 22, 2005",
            "review_content": "\nWorst part of my first semester of college.  He did not make Lit. Hum. enjoyable at all.  The text is interesting, for the most part, but Mr. Gregerman was so boring it made it difficult to stay awake in his class.  He did not add his input very often and assumed you knew what he was thinking.  We are not mind readers nor scholars on ancient Greek culture.  If you get this teacher, transfer out if possible, and if you cannot, good luck with the semester and hope to transfer out next semester. \nWorkload:\nLots of Reading. Presentations (1 per semester) mini essays for every other class and bigger essays. midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 01, 2005",
            "review_content": "\nIt is clear that Gregerman is an organized teacher, but ultimately, he was not very effective at leading an interesting class from which students gained new insights into western literature.  There were some subjects that he was passionate about, which led to interesting and engaged discussions.  Generally, however, I did not take much away from class and felt that Gregerman was not involved in prompting relevant discussions in class.  There was a lot of extra work as well, which took away from getting at the more difficult and interesting aspects of the literature.  Daily quizzes, lot's of reading, short essays, etc. took away from discussing the books in depth.  More often than not the class was dominated by students answeing Gregerman's questions which were usually focused on pointless details, instead of relevant information.  Gregerman is flexible when it comes to extensions and questions.  However, I found it hard to approach him and found that when I asked him questions regarding essays, homework, etc. that he was not particularly helpful.  At the end of the semester, however, Gregerman made it clear that he will be making changes for next semester.  Ultimately, not a very engaging class.\nWorkload:\nDaily quizzes, short essays, long essays, midterm, in-class presentations (1 per semester) and a final.  The work for this semester took up a lot of time, but in the end I did not feel that I gained much from the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 13, 2004",
            "review_content": "\nYeah, this guy is good, he just takes what he does very seriously.  He's always organized and puts alot of effort into class.  That means that you'll do more than most classes of Lit Hum, as far as reading quizes every day and mini essays.  Still, he's an all around real nice guy, real friendly, and you'll learn alot.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 09, 2004",
            "review_content": "\nWORKLOAD INTENSE.  He's a PhD candidate over at the JTS, so he knows what he's talking about...in terms of the Bible.  Other than that, he readily admits that he isn't an expert on the readings but that doesn't mean he's unprepared.  He has some good insights and he makes sure that the discussion doesn't drift too far from the main topic.  I feel that sometimes the discussions in the class are on banal topics as opposed to some of the deeper, more philosophically interesting topics, but I also seem to be the only one in the class who cares about such things.  All in all, a pretty good instructor.\nWorkload:\nBe prepared to do a reading quiz every day, a one page response paper every week, multiple essays, and you'll be making at least one ten minute presentation on one of the texts for the entire class.  None of my friends in Lit Hum right now have this much work.  It's a bit, so stay on top of it and you'll be fine.\n"
        }
    ]
}