{
    "prof_info": [
        {
            "prof_name": "Adam Marcus",
            "prof_id": 6630,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Special Topics: Patterns & Structures ",
            "review_date": "September 09, 2012",
            "review_content": "\nThis is a review for Special Topics: Parametric Design. However, I cannot select that course through CULPA. Adam was a good professor. He picked good manageable readings and seemed genuinely interested in our lab work.. However, he offered very little feedback: no midterm grades or comments and a final grade with no explanation. It was frustrating, and honestly came off as a bit lazy. surprising for a guy who was always available via email to help with grasshopper definitions.\nWorkload:\nYou were expected to familiarize yourself quickly with grasshopper, but Adam was understanding. Reading was light.\n"
        },
        {
            "course_name": "Special Topics: Patterns & Structures ",
            "review_date": "December 20, 2010",
            "review_content": "\nWhile I didn't take Adam's Parametric Design class, which is rumored by students from last year to be superior, I still found this class immensely enjoyable. The readings for the weekly seminars are well-picked and engaging, and though discussion lagged most days (due to either tiredness or unpreparedness on the part of most of the class), he encouraged decent discussion without ever taking over completely. There were always two to three presenters for each week's readings and firm presentations, which also helped to move the discussion beyond bullet-point summary. Adam's professional experience at Marble Fairbanks, as well as his background as an Art History major and a recent GSAPP-grad, gives him a fresh take on contemporary theory, and he's a great resource for pitching ideas for other papers/studio projects, etc. \nThe weekly studio portion of the class in the DAL was where some in the class had complaints. Frustrations with learning Rhino and Grasshopper are inevitable with any class like this, and I think that most of the associated complaints--about not having enough tutorials or workshops or introduction--were just whining, not a legitimate concern of the class. What was more problematic, I thought, was having two camps of experience--the kids who had taken a Parametric Design who were well versed in the software, and those who hadn't. While I'm pretty sure that Adam didn't hold us all to the same standards, it still felt frustrating that the experienced kids could either put in much less time into the course or make much more complex definitions right from the start. \nBesides this, I think the studio portion was well run. Both midterm and final were relatively flexible to whatever vision we had, and Adam provided a lot of in-class and out of class support to help us with both technical and creative aspects. The final project, which we worked on for the second half of the semester, was preceded by ample desk crit time to develop our ideas. While the class ended at 8, these crits often continued until 9, 10, 11 pm, so those who signed up late on the sheet had to be prepared to be in class for twice as long. Cutting logistics were also highly problematic, and I know that people had some issues with the TA's who ran the lasercutter for us. \nSome people definitely left the class disappointed, but I think that this was mostly either due to: a) lack of software comprehension (from not putting in the time, or being super slow to comprehend), or b) to the more general jaded mentality of architecture majors, especially those who had had Adam before, and were friendly and familiar enough with him to not feel like they needed to push themselves to excel. \nIf you take this class, use Adam as a resource: he's extremely friendly, relaxed, and smart (though a tough grader). And push yourself to make good work, not just screw around in the DAL for four hours on youtube and then bitch on your tumblr about how many all-nighters you've pulled the week of crit. \nWorkload:\nTwo-week midterm project, half-semester final project, weekly readings, one reading presentation and one firm presentation. Tough grader for some people (though not for others--his favorites usually get graded higher regardless if they've been lazy). \n"
        }
    ]
}