{
    "prof_info": [
        {
            "prof_name": "Elizabeth Ouyang",
            "prof_id": 2387,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Comparative Constitutional Challenges Affecting African, Latino and Asian Americans",
            "review_date": "November 14, 2016",
            "review_content": "\nThis class was awesome. Originally for some stupid reason I thought it was a global core class so that's why I signed up, but I ended up staying in it even though it has absolutely no relation to my major because it was so awesome. I really enjoyed the readings and I hate doing any of the readings for normal classes like lit hum or CC. If you're interested in human rights, immigration rights, minority rights this is the class for you. \nOuyang is so cool and has done some seriously badass work in her time. She is the smallest little woman but knows her shit so well and is so passionate about her work. The class is very cool and fulfilling and an easy B\nWorkload:\nweekly readings with no paper or anything to prove you read, just class discussion. In class midterm essay. A couple random assignments. Final is a group project\n"
        },
        {
            "course_name": "Comparative Constitutional Challenges Affecting African, Latino and Asian Americans",
            "review_date": "November 14, 2014",
            "review_content": "\nThis course is an awesome take for anyone interested in criminal justice, community organizing, immigration, or pretty much any field that has intersections with the law and race & ethnicity. In any given class you'll be discussing multiple federal cases in depth but OuYang is more interested in the forest than the trees. She wants you to have a good understanding of the legal reasoning behind the case, of course but wants you to put it in the context of the history of race & ethnicity in America (past & present) and its relationship to the constitution and courts. She's a strong believer in the power of community organizing and often says that even if a lawyer's legal reasoning is correct (that they have an \"ace in the hole\" so to speak) it is difficult to achieve major victories without the force of public opinion. As an immigration and disabilities lawyer herself (not to mention the President of the Organization of Chinese Americans - NY) she can point to numerous examples of this happening in practice.\nAll in all the readings are enjoyable and the discussions are engaging. If law and its relationship to social justice interest you this is a course you should take. \nWorkload:\nReadings can be dense but pretty enjoyable if you enjoy reading SCOTUS cases. Assignments and readings are definitely manageable too.\n"
        },
        {
            "course_name": "Comparitive Study of Constitutional Challenges",
            "review_date": "July 05, 2010",
            "review_content": "\nThis class was pretty awesome. You are unlikely to meet a more engaging and passionate person than Prof OuYang. She's a practicing civil rights and immigration attorney and has worked on a lot of important cases so she knows a ton. She is clearly really passionate about her work but cares just as much about her students and teaching. Our class took place in the middle of the Qing Wu affair, involving a legal immigrant who was in deportation proceedings (look up the case!), so we got a behind-the-scenes look at how civil rights law works (and doesn't work) in reality. \nThere's one \"textbook\" which is basically a compilation of historical excerpts, court decisions, and contemporary articles. The course is pretty comprehensive, beginning with slavery and the resulting laws and decisions (ie Dred Scott) and ending with post-9/11 policies regarding immigration, racial profiling, etc. She expects students to read the cases carefully. \nOnly downsides: The class was a little dry sometimes. There's definitely some room for discussion but this is not an open forum for philosophers; Prof OuYang is looking for answers to specific questions about the cases. We all learned a lot but it got a little long sometimes (especially since she usually held us at least 20 minutes past the 2 hour seminar) \nBut really--take this class. If you're like me, this class will change you. It will make you want to be an activist. \nWorkload:\nMedium. Weekly reading assignment (50-75 pgs, including very dense Supreme Court decisions). In-class midterm (short legal explanations and interpretations, essay), final project (10 page paper and hour-long group presentation). \n"
        },
        {
            "course_name": "Comparitive Study of Constitutional Challenges",
            "review_date": "September 01, 2007",
            "review_content": "\ni agree with all of the other reviews.  best professor at columbia, great person, best class i have ever taken.  i wish she taught more classes!  i learned more in this class than in the rest of my 4 years at columbia.  \n"
        },
        {
            "course_name": "Constitutional Challenges",
            "review_date": "July 19, 2007",
            "review_content": "\nSimply the best professor I've ever had the pleasure to have.  I would literally leave class shaking with passion, and have to collect myself before doing anything else.  She's a powerful civil rights attorney, which is obvious just from her lectures, where she crescendos to a shout about constitutional injustices throughout American history, beginning with questions of slavery and ending with civil rights violations post 9/11.  We even got the opportunity to see her defend a client in the courtroom who was trying to attain legal resident status.  She brings in amazing guest speakers, who really add to the discussion of the topic at hand (like when discussing prisoners' rights and the prison industrial complex, and brings in a formerly incarcerated friend who describes his ordeal).  She will win you over in the first 2 weeks (though the first class is a little awkward; hold out if you're just shopping).  The only bad thing about the class is that it's the only one she teaches at CU; I would take any class this woman teaches.\nWorkload:\nYes, there is a lot of Supreme Court reading, but as you catch her passion for the subject, it feels less and less like work.  i would often do the readings right after class, while I was still all worked up.  A short paper on a community event (which she gives you ample time and opportunity to complete), and a final 8-10 paper and presentation, which you complete as a group\n"
        },
        {
            "course_name": "Comparative Constitutional Challenges Affecting African, Latino and Asian Americans",
            "review_date": "May 06, 2005",
            "review_content": "\nAMAZING CLASS WITH AN AMAZING PROFESSOR!  Not only is she currently practicing civil rights law, but almost every person in this class said it was their best at CU so far.  It's great for reading landmark Supreme Court cases and getting used to legalese, etc.  If you are at all thinking about law school, especially with intent to go into something along the lines of civil rights law, this is a must-take class.  I wish she taught more classes here!\nWorkload:\nReading can be really heavy (Supreme Court cases) but it's easier once you get used to it; in-class midterm; letter to your representative; attending a community event, final project (incl a 10 page paper).  All well worth it!  This class makes you want to work!\n"
        },
        {
            "course_name": "Comparitive Study of Constitutional Challenges",
            "review_date": "January 02, 2005",
            "review_content": "\nProfessor OuYang is a great teacher who dares to explore the real problems that go on in the United States.  It is hard to believe that our country is the land of the free after taking this class but you also get the feeling that you can do something about it.  OuYang is a civil rights attorney and has first hand accounts of abuse of the constitution against minorities.  She forces students to understand court cases and decisions and read between the lines.  \nWorkload:\nfairly light load of reading.  Letter to a representative, midterm, community assignment, oral presentations, 10 page final paper.\n"
        },
        {
            "course_name": "Constitutional Challenges Facing Minorities",
            "review_date": "January 02, 2005",
            "review_content": "\nOverall I thought the course was great. Ouyang, who happens to be a civil rights attorney, really managed to bring up the major ways that the constitution and those in power shortchanged different minorities (Asians, African, and Latino Americans, and more recently those of Arab descent). However, I was a bit disappointed because the class was not taught in a seminar-style. In other words, most of the time she picked on people to read certain paragraphs of documents and that was considered participation. Also, any opinions of citizenship and immigration that were even remotely conservative were attacked. In addition, there are often no clear guidelines about the assignments, which is confusing. But all of these flaws can easily be forgiven. Ouyang is a really well-meaning person and her interest in civil rights for everyone is truly infectious. She also puts past struggles side-by-side with more modern problems on the issues, which is really cool. \nWorkload:\nReading that is often on the heavy side. Many supreme court judgments that can be very dense, along with secondary sources and newspaper articles. A 3 pg paper about a community event that you had to go to. 8-10 pg. paper and group presentation on issue about race/citizenship. [You really need to bust your chops and do EXACTLY what she tells you on this one]. We also had to do a 2 pg mock draft letter to a senator about the proposed military draft and other random short assignments. \n"
        }
    ]
}