{
    "prof_info": [
        {
            "prof_name": "Marwa Elshakry",
            "prof_id": 10305,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 17, 2012",
            "review_content": "\nMarwa is a philosophy buff. This is where her strength lies as an instructor: She knows her stuff, and by the end of a two-hour class you'll understand way more about Kant or Heidigger than you thought you could in so little time. However, in emphasizing the philosophy, she doesn't focus on the contemporary aspect. There is great potential in this class for discussions in relation to current events, e.g. what would Kant have to say about marriage equality, etc... She never seemed to want to take the discussion to this level. \nTo her credit, though, Marwa did as much as she could it seemed with discussion. Maybe two people in our class did the reading, and maybe five even opened the books. You could tell how hard it was for her to try to engage us. She stopped lecturing and started student-led class structure to try to change this. It didn't really work, but I understand why she didn't want to talk at us for two hours. This would have been great if it had been effective, but at the same time it was a shame not to get to absorb her brilliance for two hours twice a week (and yes, she is absolutely brilliant, and totally unassuming about it).\nUnfortunately, CC was overall a mediocre experience. This had mostly to do with our class; their was little Marwa could do to make it enjoyable (i.e. it's not her job to make us care, just to light the spark of discussion, and she tried many ways to do this). Marwwa herself is delightful, reasonable, and for a CC instructor assigns very little work. If you want an easy A in CC (i.e. just do the reading, show up to class, do very little else), then she's great. Also, if you want to learna bout the philosophy, this is who you want as an instructor. If you want a class with a more contemporary spin, I'd pick a different section.\nWorkload:\nLight for CC. 60-80 pages of reading in between classes. 2 papers (5 and 7 pages). A midterm and a final - both incredibly straightforward. One discussion leader assignment. 10 posts for the whole semester, your choice when.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 03, 2011",
            "review_content": "\nMarwa is a wonderful professor and person.  DEFINITELY take CC with her if you can.  She has a very interesting science and history of science background which brought an interesting spin to our conversations.  This was her first year teaching the course and next year she may connect our philosophical questions even more to relevant scientific issues.  In addition, one of the things that makes her a great teacher is her ability to take anyone's contribution and tie it into the broader discussion, or rework it into another question.  This prevented forced and dead-end discussions and also had the effect of making every contribution seem valuable which encouraged participation.  Participation was also facilitated by the required online discussion posts (1 a week but more encouraged) which were a good forum for your thoughts and could then be called upon in-class.  The reading load was very manageable and with papers she often had both traditional prompts and some creative/artistic ones to choose from.  In the spring she invited us over to her beautiful apartment for breakfast.  All in all, she is really nice and really really smart.  As someone who had absolutely dreaded the idea of CC, I was surprised to discover that in the end it was one of my most enjoyable classes.  \nWorkload:\nWeekly online discussion posts. Length of readings were fair. 2 papers (5 page and 7 page).\n"
        }
    ]
}