{
    "prof_info": [
        {
            "prof_name": "Timothy Halpin-Healy",
            "prof_id": 735,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Waves, Optics & Quantum Physics",
            "review_date": "January 10, 2005",
            "review_content": "\nYou'll probably hear bad things about him, and he does expect a lot with labs and homework sets.  However, at least in my experience, lab has pretty fun experiments and the TA (Becky Grossman, if she's still doing it) is great.  Sometimes the lectures and hw problems seemed unconnected, but if you thought about it you could see the relations.  You'll probably be bored to tears by this class if you don't like physics, but if you do it's worthwhile and ends up being useful, even if you're not a physics major.  I like it, overall.\nWorkload:\nToo much for what we really took away from the class, and also totally up and down.  I think there were 4 or 5 problem sets.  They caused panic the night before they were due, but no one really worked on them during the rest of the 2-3 weeks we had to do them.  If you're organized it's no problem, and as physics classes go it's totally fine and managable.\n"
        },
        {
            "course_name": "Waves, Optics & Quantum Physics",
            "review_date": "November 20, 2002",
            "review_content": "\nIf there is one fault with this man, it is that he cares too much. He is one of the most dedicated teachers I have ever met. I like his colored chalk because it is nice to have topics color-coaded, I think it is easier to understand an already difficult subject, He is fair and always there if you need help. The man actually gave me his home phone number during fall break so that I could contact him if I had questions about a take home midterm that he had assigned (the class scheduled the exam for fall break by the way). He loves physics and he loves to teach so I think he is great and if you work hard you can do very well. He does not care what the scores are you get, what he really cares about is if you understand the material\nWorkload:\nProblem sets every week and one midterm and a final. Normal for this level of physics classes.\n"
        },
        {
            "course_name": "Optics, Electricity and Magnetism",
            "review_date": "April 18, 2002",
            "review_content": "\nAvoid his class if possible. He might be a nice, intelligent man, but he has no conception of how to teach. He spends the class writing out complete sentences on the board and drawing pretty pictures with lots of colored chalk. Art school drop-out? There is no recitation but he expects you to go to office hours at least once a week. If you get the chance, take the Columbia physics sequence and spare yourself the pain.\nWorkload:\nlengthy problem sets every week or two, 2 exams and a final. weekly labs take a lot of time as well\n"
        },
        {
            "course_name": "General Physics II",
            "review_date": "November 08, 2001",
            "review_content": "\nI think Prof. Halpin-Healy only teaches this course during the summer and that's a good thing. The class really sucks. His lectures frequently run over and he expects immediate comprehension of ideas within the class period. Much of what is covered in class is irrelevant for the exams. Material on the exams is difficult and usually unlike that from the text problems. The upside is that most people can pull a B without really learning too much (except perhaps that physics is a horrible, stressful thing).\nWorkload:\n3 exams, including the final... no grades are dropped\n"
        }
    ]
}