{
    "prof_info": [
        {
            "prof_name": "Scott Harold",
            "prof_id": 1888,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Chinese Politics",
            "review_date": "February 03, 2008",
            "review_content": "\nExcellent professor. Knowledgeable and engaging. It was his first semester teaching, so the reading got out of hand toward the end of the semester. But overall, it was one of the most rewarding courses I've taken at Columbia.\nWorkload:\nHeavy, especially if you're like me and didn't have any background in the subject. Make sure you take a discussion section -- the TAs help you figure out which readings you actually need to do.\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 05, 2008",
            "review_content": "\nA wonderful and engaging class!! Professor Harold is a young professor whose interest and passion for China shine in this course while he remains incredibly approachable and open to questions. I thoroughly enjoyed Professor Harold's Chinese Politics class which discusses China's political history since the Qing Dynasty up to the political issues which the country grapples with today.  While the first half of the class can seem more like a history lesson of the Chinese Communist Revolution, Professor Harold really picks up steam after the midterm and logically builds upon everything you've already learned.  You will be fascinated by the dimensions and dynamics of Chinese politics as you learn about contemporary issues such as HIV/AIDS, the environment, and Muslim separatism.\nBe aware that the class does take dedication.  There are four in-class quizzes based upon the readings, a 16-18 page take home midterm, a book review, and an in-class final.  Readings can be plentiful and repetitive at times, so reading the introductions and conclusions of book chapters can be better than nothing at times.  Some of the books chosen for the first half of the course could be very technical and dense while journal articles for the second half were often quite similar to each other.  Just learn how to prioritize and unless Professor Harold changes the form of the midterm, set aside a week to do it or risk not getting it in on time.  \nIf you can stay on top of the work, you will find the class incredibly rewarding.  I definitely recommend it! \nWorkload:\nheavy but doable: 4 quizzes, 16-18 page take-home midterm, 6-8 page book review, in class final where you will use all three hours, approximately 225 pages of reading per week. \n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "December 23, 2003",
            "review_content": "\nExcellent TA. Knows his stuff minus the snottiness of some TAs. Its evident from his well-done sections and well-organized reviews of class material that he didnt forget how to be a person while in grad school. About the Prof: good, but dont bring a notebook--it will do you no good--just sit and listen.  \n \n\nWorkload:\ntake home mt and a final. 75 pages a week. \n"
        }
    ]
}