{
    "prof_info": [
        {
            "prof_name": "Dessislava Vendova",
            "prof_id": 12817,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Buddhism: East Asian",
            "review_date": "January 19, 2015",
            "review_content": "\nI completely disagree with the previous post about Dessi as a TA for the Intro to East Asian Buddhism course.\nDessi clearly worked very hard as a TA, what with holding extra recitations, going over quizzes and exams meticulously in order to grade them properly and emailing us very helpful, supplemental material that she prepared especially for us. She was always willing to help and to clarify things as long as you make the effort to seek her assistance. She is demanding, but just because she wanted us to succeed and learn. Dessi is a very knowledgeable, kind and helpful TA. \nWorkload:\nManageable.\n"
        },
        {
            "course_name": "Buddhism: East Asian",
            "review_date": "January 11, 2014",
            "review_content": "\nSummary: Buddhism with Como is pretty easy, interesting, and fun. It's a great class to take to fulfill the global core requirement. Avoid TA Dessi.\nPro tip: show up to every class and take notes. Getting notes from a friend might suffice, but you'll probably get confused because the concepts get somewhat complex as he goes on, plus they build on each other.\nComo is funny and a fantastic lecturer. I came away from his lectures with a solid (very general and pretty novice, but nonetheless kinda legit) understanding of the basics of Indian, Chinese and Japanese Buddhism.\nAvoid TA Dessi. Seriously. Her bark is worse than her bite (grading), but she's just a pain to deal with during the semester. I've heard some other TA's are good: Jay, Su-Jung, maybe another.\nWorkload:\n-readings (you don't really need to do them, just browse the ones that they say will be important for the midterm & final)\n-midterm (20% i think)\n-3 small quizzes (3% each)\n-final exam (30% i think)\n-final paper (40% i think)\n"
        }
    ]
}