{
    "prof_info": [
        {
            "prof_name": "Zuoliang Hou",
            "prof_id": 2271,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "May 18, 2009",
            "review_content": "\nProfessor Hou is a great math teacher.  After having taken classes with him over the course of 3 years, he is one teacher that I can rely on.  His lecturing style may be quick but each lecture is very clear.  He breaks things down and explains concepts thoroughly, plus he draws really awesome pictures/graphs to go with almost everything.  He seems very conscious of his English skills, but he speaks clearly albeit with a slight accent.  On the board he is not only legible (which, in the math department is hard to find) but he writes nice and big and always steps away for you to copy down the notes.  Although he may make a few mistakes during class, he doesn't make many (always double check with the textbook).  His courses are the few math classes where I studied more often from my notes than from the textbook.\nFor all of the courses, he has a different strategy for grade breakdown, but it never strays too far from a standard h/w-midterm-massive final mold.  His course website always is up-to-date with assignments, assignment solutions, and dates of tests/exams.  He usually posts practice midterm(s) and final with solutions and gives a little review of topics before each.\nHe may seem kinda awkward, that is because he is.  Thus, he may seem unapproachable, but do not fear, you can usually find him napping/wearing awesome slippers in his office during office hours because nobody goes.  He has office hours twice a week (for A+O an additional problem session on fridays) and he is always happy to explain things if you just ask! \nThe bottom line: he covers material in a timely fashion, and he is organized.  If you want to actually learn some math and not just stumble through a course, Hou is the man.  It is totally possible to get a good grade in the course if you put the necessary effort in, and I would say the grading in the courses is consistently fair (curved to a B/B+ avg).  If you have the opportunity, take Hou. (his vast collection of sweater-vests is also a plus)\nWorkload:\nanalysis+optimization:\n25% homework (12 psets, lowest dropped, doable)\n15% quizzes (20 minutes long, every other week, lowest dropped)\n20% midterm (only 1 midterm, not horrifically difficult, he likes to ask T/F)\n40% final (a doozy indeed, usually more difficult than the midterm.  wasn't completely cumulative, focused on the more difficult stuff at the end.  can definitely destroy a grade, maybe because his exams always seem to land on the last thursday of exam week...)\nlinear:\n20% homework (11 psets, lowest dropped)\n20% midterms (2 midterms)\n40% final\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 28, 2009",
            "review_content": "\nBy-the-book (literally), fair, and utterly unremarkable professor. Mind you I'm writing this review more than a year after the course, but it was really quite ordinary, about what you'd expect from a large lecture where you do the problem sets, take the tests, and you're done. I got the tools I needed for more advanced classes and I have no complaints.\nProblem sets were weekly with one dropped, entirely fair. Lectures were boring when I went and followed the textbook almost to the letter. Professor Hou's English was fine, and he's nice enough.\nAs I recall, the midterms were much easier than the final, which incorporated some not-in-the-textbook material introduced in the last lecture, which I didn't attend. Oops.\nWorkload:\n11 p-sets, 2 midterms, 1 final.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "January 02, 2009",
            "review_content": "\nThis is the first semester I take with Prof. Hou.  t has been my best experience in the math department. he is really great.  As a previous reviewer points out, he is the most straightforward Prof you'll find in the dept.  Also, he is very nice and approachable.  I am not particularly great in math, and furthermore when i took this class, i had so much going on, still i was able to do better because his lectures were so clear, and he was very helpful.  \ni would absolutely recommend him to another student, as I think he is the clearest professor i've had.  he does a good job in teaching, and he tests on what he teaches, no funky business.  I wished i'd taken calc III or IV with him because i would know what those classes are actually about.  instead i took those classes with terrible professors that were obsessed with making us learn stuff that wasn't even on the book, as a result i actually ended up learning this stuff in another class that wasn't math.  \nBriefly, my suggestion if you happen to be wondering about any of Prof. Hou's class is that you should absolutely give it a try.\n\nWorkload:\nWeekly PS\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 18, 2008",
            "review_content": "\nOh my goodness, DDDDD: is the only accurate representation of this class/ professor. Hou zooms through the lectures without pausing to see whether we understand or not (which I, even as a math major, often didn't) and if someone asks him a question he acts annoyed.\nI remember one time he was going over solutions to a practice midterm, and JUST barely finished before class was over. Then, he proceeded to tell us, \"Well, I had time to finish all the problems on the practice midterm, so you guys should have time to finish the midterm too.\" ...Wait, what? No, Zuoliang Hou. No.\nWorkload:\nHomework/ week, each taking a few hours. 2 midterms (easy, HARD) and a final (surprisingly not that bad.)\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 19, 2007",
            "review_content": "\nI've taken two other semesters with Prof. Hou (Calc III and IV) and I expected no less from him this semester.  I've reviewed him before and again I must say he is as straightforward as you could possibly want from the Math department.  He follows the text, but will extend to more challenging material even though it won't be on the exams.  He emphasizes what will be on the exams, which are primarily drawn from the homework.  He is very nice and extremely approachable, and is also very knowledgeable.  Even though many people say to take Linear Algebra through the Applied Math dept. for various reasons, if you still want the theory and a good instructor, go with Hou.\nWorkload:\nFine.  11 problem sets; he drops the lowest.  They are not hard, in general, although some problems will be difficult.  They are good practice for the exams, which will contain similar and harder questions.  The first midterm is not bad, the second is a good deal harder and the final is somewhere in between.   If you go to the lectures and do the homework (read the text!), you're fine.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 11, 2007",
            "review_content": "\nDr. Hou offered an ideal Calc III experience, for the first fifteen weeks or so of his class.  When I alighted in the basement of the Math building at 9 AM for his first lecture, I was charmed by the clarity of his presentation and by his accent, which adds rather than detracts from the class.  After conquering the first few problem sets, I stopped going to lecture, but was able to score reasonably well on the problem sets (which he either gives you a grade or an exemption from if you turn in reasonably late) and exceptionally well on both the midterms because Dr. Hou's expectations were so transparent.  \nWith the confidence of James Cook on the Big Island of Hawaii, I sailed into the final on three hours of sleep, having spent the last night packing my boxes and wishing my floor would stop playing Mario Kart so I could go to bed, sat down next to a shifty, distracting TA, and found myself completely overwhelmed by a test that was significantly harder than either of the midterms.  I handed my test in with a modicum of confidence, thinking maybe a particularly voluptuous curve would save me from Captain Cook's fate, but two days later, I was rewarded for my sloth with a very gentlemanly grade, thus fucking up my entire semester academically and making me look like a quantitative doofus to future employers.  Ah, what could have been.\nWorkload:\nEminently maneagable.  You can go to lecture or not, but find a way to turn in your homeworks.  Study for the final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 17, 2007",
            "review_content": "\nFirst off, don't even bother with calc II unless your major requires it. No matter how strong a math student you think you are, Calc II will be very difficult, no doubt about it. Taking this class with Hou does not make this any better. Hou does not speak english very well, and has little sympathy for his students. He teaches at a very fast pace, and gets very irritated when students ask a lot of questions. Eventually I decided to stop going to this class because it made me feel horrible about myself. It is not a stretch to say that his class inspires low self confidence. Very few people in my class seemed to actually understood anything that went on, and many lived at the math help room. \nWorkload:\nproblem sets and webwork every week, two very very difficult midterms, and one brutal final which is cumulative.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2007",
            "review_content": "\nMany students find the content of Calculus II to be difficult, so difficulty understanding the material is probably due at least in part to the nature of the material.  I found Prof. Hou a good, fair professor.  He was neither exceptionally good nor exceptionally bad.\nProf. Hou was thorough during his lectures in that he covered example problems of varying difficulty (easy to introduce the topic, difficult when reviewing for an upcoming midterm or final).  Some other reviewers have commented on his tendency to leave a problem undone and to tell the class to \"finish it on your own.\"  I did not think this occurred frequently.  In addition, because of the number and variety of problems we covered during class, he probably couldn't have finished every intricate problem during class.  He did provide many opportunities for office hours (some said he was condescending during office hours; I never found him so, so if you're having trouble, don't be afraid to talk to him).\nI did not have a problem with Prof. Hou's accent, but the problem in communication was that he did not know how much more he knew than did the class.  He's a very bright guy, and at times (especially toward the end of the semester with sequences, series and the rest), his explanations were non-intuitive and confusing.\nThere was a very generous curve, and Prof. Hou's grading in general is very fair or lenient.  He's definitely a choice to consider, and he's a nice person.\nWorkload:\nVery manageable - 1 problem set/week for a total of 11 (lowest grade dropped); 2 midterms (1st is easier than the 2nd due to the content: 1st covers integration, 2nd covers sequences and series), 1 final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 15, 2006",
            "review_content": "\nI only took the course as a refresher to Calc II thinking I would go in and get an easy A.  If you are thinking the same, don't take Hou.  He has an adorable accent, but other than that I recommend staying away.  \nHe tends to skip over things he thinks we should know when doing examples or, better yet, pulls a random number while saying \"I choose this number because I know it works.\"  I've had worse math teachers and he is still understandable and fairly easy to follow, he just doesn't exactly make it that easy on us.\nHe also isnt very approachable.  The language barrier certainly has something to do with it but in my opinion he just doesn't give off a friendly air.  For example when he went over a midterm and people asked questions about it, he seemed visibly perturbed.\nAgain, if you are looking for an easy A, just bite the bullet and take Calc III.  If you have not yet taken Calc II then Hou isnt a BAD teacher, you just must be prepared to work.\nWorkload:\nStandard.  Weekly graded problem sets, WebWork, 2 midterms, final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 11, 2006",
            "review_content": "\nThis man is a genius, No question about it.  But despite the fact that he is a genius, I do not feel I learn much from going to the class.  I come out of class more confused than when I came in and sometimes I feel like he cannot explain things fully.  Some quotes from him are \"Don't ask how I got that, I just know it\" , \"No more examples you would not understand anyway.\" , \"As you can see the Answer is very complicated so you can do it on your own\" and \"Well, you can't actually finish the problem so forget what I just taught you\".  Basically I would advise not taking the class with him unless you are very good at teaching yourself from a book and are Very VERY proficient in calculus.  Besides lectures he gives a lot of partial credit and is truly a brilliant nice guy, just not a very good professor.\nWorkload:\n2 problem sets a week (on of which is Webwork online and one of which is a regular problem set), two midterms and a final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2006",
            "review_content": "\nOf all the classes I took, this one is hardest to evaluate.  First off, the class itself is VERY tough, so don't go into it expecting it to be otherwise.  Professor Hou is a relatively young instructor, he just finished his Ph.D from MIT.  So clearly he's brilliant.  He is amiable, wants his students to learn/do well, and has a extraordinary grasp on his subject.  However, he likes highly theoretical aspects of math, and this is somewhat reflected in his teaching style.  He forgets sometimes that he's teaching undergrads, and that not everyone has his level of mathematical knowledge.  His speech is a bit accented still, but nothing that actually causes problems.  He does not put proofs on his exams, which is a huge blessing.  His problem sets however are quite difficult, and sometimes feel they have little to do with what shows up on the exam.  Although he is a good instructor, and will become better I believe the more he teaches, I'd steer clear of this math class if you can, especially if you aren't a math major.  If you are a math major, you'll probably love it.\nWorkload:\nSteep\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 13, 2006",
            "review_content": "\nZuoliang is a great teacher and really looks out for his students.  I personally was falling into the great Satan of laziness and homework-neglecting and Zuoliang was still able to find mercy in the crevices of the walls of his office during office hours.  That's all there is to it.  Just do the easy homeworks in groups, go once in a while during office hours, and work with the man: his ability to give bad grades is about just as bad as his english.  Oh, and the english: don't even bother going to class - I just read the textbook and the study guide for Stewart (a must have!) and got more out of that than the class itself.  \nWorkload:\nweekly problem-set of 5 questions, 2 easy midterms and easy final.  Working knowledge of Chinese helpful.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 10, 2006",
            "review_content": "\nProfessor Hou's Calc III class is tough yet very fair.  The pace is fairly quick and students may become lost if they do not read over the material before class.  This said, the class follows the textbook exactly and many of the homework problems may be found in the text or solution manual.  It really pays to attend class since Professor Hou goes through a good deal of very helpful example problems.  \nThe problem sets are usually difficult but you have all week to work on them so they shouldn't present too much of a problem.  The midterms were easier than the problem sets but they still required an understanding of the material, rather than mere memorization of formulas.  Make sure you keep all of your psets and midterms.  The final is comprehensive and fair, and Professor Hou provides very nice review materials.\nOverall, Professor Hou is a very fair grader and an enthusiastic teacher.  He is very conscious of his accent, despite the fact that he is understandable. Professor Hou also makes an effort to answer any questions and to help students during office hours. He is a very decent professor overall.\nWorkload:\n11 problem sets (one is dropped), two midterms, one final.  All require an understanding of the materials in addition to memorization of formulas.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 02, 2006",
            "review_content": "\nHou is an extremely kind person who gives very fair midterms and a final that I found extremely easy.  However, he is not a very effective lecturer.  He is not confident in his ability to speak English and he often taught concepts with minimal explanation or examples. I feel I basically taught all the course material to myself by reading the textbook.  However, I did end up with an A+ in the course so his grading is obviously not too harsh.\nWorkload:\nThere are 11 problem sets (one is dropped) that are actually quite difficult and sometimes take several hours.  However, the midterms and final that account for 80 percent of the course grade are very fair and easy.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 01, 2006",
            "review_content": "\nHe is easy to understand and not terribly difficult.  He is the first math professor that I could understand at Columbia (he speaks clear english).  His tests are not difficult and he gives practice tests that mimick the real ones.  If you have to take Calc III, save urself and take it with this professor.\nWorkload:\nweekly problem sets, 2 midterms and final (not hard at all)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 20, 2005",
            "review_content": "\noh terter. the most entertaining professor of this year.\npretty good professor - he teaches the material pretty well, works straight out of the textbook.  you honestly could not go to class, because everything he does is from the book, and if it's not, he posts supplementary notes.\nbut not only do you get a good professor, but also entertainment as well! with precious gems such as \"terda\" \"kakurus\" and \"LAAgrange MurtiPRIers\" the class is great. his cool recovery from constantly tripping over the lectern in the corner is also a great source of humor.\ntake hou.\nWorkload:\nweekly problem sets that aren't too bad. 2 midterms + final. pretty reasonable & straightforward.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 24, 2005",
            "review_content": "\nDr. Hou is a really good teacher. He is very approachable, knowledgable. Overall, a rather nice fellow. He assigns a very doable problem set every week. His class is easy to follow.\nAlthough his pronunciation of tilda resembles an amphibious mutant ninja, he is a swell man. Take Calc III with this professor. He's real fly.\nWorkload:\nDoable Problem Set every week, Two Midterms (moderately hard, not impossible), Final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 17, 2005",
            "review_content": "\nZuoliang Hou is a thorough teacher, although he doesn't stray from the book at all. He's always willing to answer questions and help out. He's a very charming chap. If you are able to follow along in the lectures and do the homework, you should get an A.\nHowever, the real reason you absolutely must take Zuoliang Hou is not his teaching ability. Rather, it is his outrageously hilarious accent. It really sounds like something from a badly dubbed foreign film. The Calculus III experience was taken to another level when I heard him say \"tirdur\" or \"cyancoolis\" (you can guess what these words are)\nTake Zuoliang Hou, you will learn Calculus III and also pick up a great deal of material for your stand up comedy act. Big up Dr. Hou!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 05, 2005",
            "review_content": "\nIt's basically feast or famine, you either get the stuff that Hou teaches or not.  I did great in Calc II and then bombed Calc III, which says a lot.  Going to class helps somewhat, but doing his problem sets and practice tests helps the most.  Basically his tests are the hardest questions from the practice tests and problem sets, so if you decide to go to only a few classes, go to the ones that he shows you how to do the practice tests.  If you know how to do the practices, then you'll do fine.\nWorkload:\nProblem Sets every week, 3 midterms and a final  A slight curve that allows you to minimize the worst test score\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "June 16, 2005",
            "review_content": "\nZuoliang Hou is a good teacher. He grades very leniently, explains the material quite well, and is very accessible. And he grades the final the same day, so that people can argue for more points if they need them. Although he gave a couple of people the points they needed to pass, when I found the single point needed to earn an A+, he changed the curve. So up until the day after the final, I was quite enjoying the class.\nWorkload:\n11 Homeworks graded as 10, 2 midterms, and a Final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 10, 2005",
            "review_content": "\nHou is a great guy, very approachable, concerned about his students' needs, well organized and efficient.  But he ain't easy.  I call him \"the express train,\" because he's quick, efficient, and speedy in his lectures, so either you pay close attention or fall behind.  And the weekly problem sets are usually harder than anything you'll find in the book.  Exams aren't bad though, if you keep up with the homework and study.  Hou is the kind of professor who really forces you to learn the material.  Should you expect an easy A?  No.  But by the end of the class, you'll understand Calc 3 better than you understand why Raskolnikov killed those two women.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 03, 2005",
            "review_content": "\nLike another reviewer said, the negative reviews have no real basis. I've had Hou for a full year, and I really enjoyed the class (and I'm not a math major). His explanations are usually clear and understandable, despite the 9AM class time. There are two midterms: the first one is somewhat easier than the second. His reviews give a pretty good estimation of the actual test. Be prepared to think rather than just spit out formulas. No \"real\" HW, but weekly quizzes straight from the suggested problems. Just a tip: if there's one problem you can't seem to get right for hours, there's a 99% chance he will put it on the quiz (so find a friend!). \nListen to his lectures carefully, and you may be able to catch gems like \"verse visa\" and \"choose arbitrary\".\nWorkload:\nVery reasonable- 2 suggested psets per week (some problems take 2 minutes, others may take longer), not collected. Weekly quizzes directly from HW. 2 Midterms and cumulative final. nothing extraodinary. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "April 27, 2005",
            "review_content": "\nI took Hou for Calc 3 and Calc 4. I generally disagree with most of the negative statements about Hou thats written below me. He is a young MIT graduate who just started teaching here. He's extremely intelligent and a really nice guy. Of course there is a language barrier, and his spelling is off here and there but he doesnt mind stopping during lectures if you have questions. I have heard of some horrible stories about other math professors, but Hou is a fair man. Don't expect to breeze through this class, you will have to study and you will have to do your homework, but one great thing about Hou is NO WEBWORKS. \nFor both Calc 3 and Calc 4, I found that his first midterm was significantly easier than the second midterm, so you should probably do as best as you can on the first midterm. His miterms are fair, and his reviews do help. He will discuss the major topics that will be on the exams. He's a really nice guy, which is why I dont understand why all these people are hating on him. Most other math professors are terrible, which is why i decided to take Hou again for Calc 4. \n\nWorkload:\nFor calc 3: Weekly problem sets from text book (NO WEBWORKS), 2 midterms, 1 final\nFor calc 4: no problem sets due, but weekly quizzes (which are picked from the problem sets he assigns), 2 midterms, 1 final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 24, 2005",
            "review_content": "\nNeither excellent, nor awful. Does not speak clear English, but that is to be somewhat expected in the math dept. Sometimes book homeworks can be confusing. He's not too bad, but I wouldn't highly recommend him either.\nWorkload:\nWebworks, a few problems from the book, 2 midterms and a final. One quiz, but only used to bolster midterm grades.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 18, 2005",
            "review_content": "\nI've had teachers with accents before and they've been fine professors, so I don't think people can use his accent as an excuse (even though it is terribly thick).  I don't feel like he cared how his students did.  He came in every class and wrote on the board for the duration with minimum explanation.  As said in some of the other reviews, he often grew annoyed when students asked him a question, and merely repeated what he had just said, albeit in an angrier tone, often while repeatedly pointing to what he wrote on the board.  Maybe in this case his English is to blame; in one memorable instance he said something along the lines of  \"I'm sorry, my English isn't too good. If you have any questions, just refer to the book,\" and that is exactly what most of the class had to do throughout the course.  That's not the kind of quality I want out of a professor at Columbia.  I might have spent my time better reading a chapter of the book during every class rather than trying to learn from him.  I scored a 5 on the calc AB AP test, but his class made me forget that I was ever good in Math or that I ever enjoyed it.  I would highly recommend avoiding Hou if at all possible, and the overwhelming majority of people I knew in the class would suggest the same.\nWorkload:\nabout 4 problems from the text every week, along with webWork due every Thursday (sometimes 2 sets) which can be a real pain, 2 extremely difficult midterms, and an extremely difficult final with similar questions to the midterms\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 09, 2005",
            "review_content": "\nZuoliang Hou is clearly a very intelligent man who thoroughly understands the material that he is teaching. His problem is that he teaches as if  the class is as knowledgeable as he is, which means that he breezes through everything, failing to provide adequate explanation and examples. If one doesn't read the corresponding chapter in the textbook and fully understand it prior to coming to class, he or she will probably not understand the lecture. In my personal experience, the textbook was a far greater help than the instructor.\nIn addition to his failure to explain the material, he will get visibly upset when a student doesn't understand a concept. Questions in class are met with contempt and explanations that rehash something he just said. Since it clearly didn't get the point across the first time, repeating it isn't going to do any good.\nThe class has little to no idea how he arrives at a final grade. While we are given a rubrik, stating that 20% is homework, 40% is the two midterms, and 40% is the final, there are still many things left unexplained. Students are unaware how WebWork is factored into the homework grade, if at all. What's more concerning is how the midterms and the final are curved, which is never mentioned. If one were to ask him about a curve, he becomes defensive.\nAlso, he has a very thick accent and is just very hard to understand. This clearly isn't his fault, but it does limit his own ability to explain himself. This adds to the apparent frustration he displays over being asked questions, as I mentioned above.\nAvoid this instructor if at all possible. \nWorkload:\nVery light problem sets weekly, WebWork weekly, two difficult midterms (class average of just above 50%), challenging but doable final exam.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 03, 2005",
            "review_content": "\nProfessor Hou really knows his stuff, and really wants students to do well. For a non-native speaker, his English is actually better than he thinks it is, but he's very timid about his language skills. As a result, he usually isn't quite loud enough to be heard throughout the room.\nHis teaching is okay, but not great. He posts his notes after class, so that people can get away without writing down everything he puts on the board. If you do the homework, and use the book, you can probably follow along. He's also pretty good about helping students during office hours. You just have to be willing to reach out to him...\nWorkload:\n1 problem set per week. 2 midterms, 1 final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 29, 2004",
            "review_content": "\nGood class, well explained, straightfoward.  He knows and explains how the equations are derived and although it may seem a little boring he doesn't test on the derivations which is nice - if you are into that, pay attention and learn it, it can't hurt, but if not, you don't have to worry about being tested on it.  If you go to class, do the webwork a few days in advance of when it is due so you have time to go to the Math Help Room, do the homework (note: student solutions manual in Math Library very helpful) do some practice problems in the book and do every review problem he gives you, you will be fine. Plus, some of the questions on his tests are directly from the book or from the review problems.\nWorkload:\nHour and 1/2 Webwork per week, Hour homework per week, Three hours X 2 midterms, one final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 24, 2004",
            "review_content": "\nYes he does he have a pretty thick accent, but who doesn't have an accent in the math department. His classes were usually taught a very fast pace (often he was doing one problem, and youre still writing down the last problem). However, Professor Hou knows the material very very well. At first he might not appear that approachable, but it's just the fact that his english is not that good and he gets kinda frustrated when you don't understand him. He was always willing to explain difficult concepts during his office hours. Tests were pretty difficult, however, do-able. Overall, an average math professor and a pretty average class.  \nWorkload:\nWeekly problem sets (20%), two midterms (20% each), and a final (40%)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 23, 2004",
            "review_content": "\nNot a terrible teacher, but wouldn't be one I recommend.  He tends to block the board while he is writing the notes which makes you have to work double time to copy down what you need for the exams.  He also doesn't explain concepts too well, and is often baffled when you have a question.  The Calc III material is not TOO too difficult, as long as you are willing to go to class (although Hou does post his notes online, or at least tries to) and do the homework.  Overall mediocre teacher with a rather easy workload.\nWorkload:\nOne problem set a week (usually 5-10 problems, at least 3 or 4 of them really easy).Two Midterms, both count.One final, wasn't that bad.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 18, 2004",
            "review_content": "\nDo not take this man for calculus 2, in fact try to avoid cal 2 if possible, you do not want to suffer through its horrors, and this is coming from an seas student who loves math, but cal 2 is horrible, but if you must DO NOT TAKE ZOULUANG HOU\nWorkload:\nA couple problems a week, webwork from the depths of hell, 2 impossible midterms and a final that will make your head explode\n"
        }
    ]
}