{
    "prof_info": [
        {
            "prof_name": "Lianne Habinek",
            "prof_id": 3164,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 10, 2007",
            "review_content": "\nLianne is flexible with dates, but that's about the only thing going for her section.  We started with 8 students and went down to four.  There was lack of direction, too much repetition, and unnecessary requests like coming to class 10 minutes early or staying later than scheduled.  She was great when it came to deadlines and the need to miss class here and there, but overall the experience is mind-numbing.\nWorkload:\nA lot. Writing daily 300 to 500 words, 4 papers, hard grading.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 21, 2007",
            "review_content": "\nLianne comes across as shy, and terribly nice, but she's the real deal. I agree with the previous reviewer that she is pretty flexible with due dates, but do not push her! She can obviously tell when her good nature is being taken advantage of; at least one person in the class felt they could try their luck when it came to handing stuff in, and had the temerity to be shocked when Lianne wouldn't accept the assignment. \nA very fair grader, and incredibly knowledgeable - Lianne is very young, but shaping up to be a great teacher.\n\nWorkload:\nKeep up with the reading, hand everything in on time and you will be OK. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 17, 2007",
            "review_content": "\nA young, but very knowledgeable teacher.  She will give you extensive feedback on your writing, which helps a lot.  Very flexible with due dates, depending on how the class is moving.\nWorkload:\nInformal Homeworks and Class excercises, \"Lens\" Essay, \"Conversation\" Essay, Collaborative Project Research Presentation, Research Essay, & Final \"Retrospective\" Essay\n"
        }
    ]
}