{
    "prof_info": [
        {
            "prof_name": "Sandrine Larrive-Bass",
            "prof_id": 2500,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 17, 2016",
            "review_content": "\nI echo the review below. Sandrine was a great professor; her lectures were concise, discussions were productive and most importantly - expectations were clear. Yes, she is pretty dry (lights are turned off during class and you flip through images on most days) but, you also get do some fun things like visit museums and a cathedral. \nAnyways, if you need to take ArtHum and are looking for a professor, I would recommend taking this course - getting an A is extremely easy if you just show up to class.\nP.S. - there is a fair amount of reading (no need to do it all)! Skim through every other reading or so and you will be fine. None of the readings are tested on, but you want to make sure you have something to contribute to the class discussion here and there as participation counts, and she will jot peoples names down when the comment.\n\nWorkload:\nParticipation - 25%\nPaper - 25%\nMidterm - 25%\nFinal - 25%\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 01, 2016",
            "review_content": "\nProfessor Sandrine Larrive-Bass was one of the best professors I have met during my time at Columbia. She is extremely knowledgeable, passionate in her teachings, and always well-prepared with her spot-on powerpoints. She also encourages discussion, but not excessively - the mix between her lecture and discussion is just right. She also grades really fairly, no surprises, and what I like best about her is she simply is a really nice person who is very approachable for students. Her reading assignments are also very light, which makes sense since many Columbia students don't do those due to the length. Yet, she always assigned minimal amount of reading which basically made me do the reading all the time.\nLong story short, take her for Art Hum, highly recommend!\nWorkload:\nVery fair, nothing crazy. 2 Essays, 1 midterm, 1 final, all very predictable.\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "June 28, 2006",
            "review_content": "\nYou know what: if you love yourself, don't take this course.  Just don't do it to yourself.  And don't say I didn't warn you.  No, she really doesn't have a sense of humor.  None.  Sandrine, why so dry?  Why so serious?  It's just a clay pot.  Generally, I'd be able to handle all of the above.  It's just that there was no exciting theory to hook onto.  The manner in which we observe is more important than what we are observing.  Got it?  There was a lot of stating the obvious and memorizing dates.  So many dynasties.  Argh.      \nWorkload:\nIf you love memorization, this is the class for you, amigo!\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "November 13, 2005",
            "review_content": "\nThe class was pretty decent. Sandrine was extremely knowledgable and also just a nice person. There is not too much reading and it really consists of mostly pictures and diagrams. If you go to class and study the slides a fair amount you should do fine. There was a lot of information because the class covers the entire artistic traditions of 3 different cultures, but Sandrine did a pretty good job of presenting the information in an organized manner. The trips were also great. Also, as for the accent thing- yes, it is there- but seriously, it really was not an issue. \n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "September 08, 2005",
            "review_content": "\nHmmm. I'd say the review from 8 Sept. is on the money; the two earlier reviews (26 April, 5 Sept.) sound kind of spiteful, and I don't know why. This course really opened my eyes to a tradition I was completely unfamiliar with, and Sandrine is responsible for that. Yes, she teaches more like a European professor (who assumes that her role is not to \"entertain\" students and that they are all there to do serious learning--even if it's not the case), but, on the other hand, it's not that common in Europe to find someone who is so enthusiastic and dedicated to the subject matter and the students. She was *extremely* generous with time (office hours, excursions, explanations, etc.).\nThe only thing that you should be aware of is that she takes the approach of covering as much material as possible instead of the Art Hum half-dozen \"Great Works\" approach. This means less time for in-depth close readings of the art, but I'm sure she'd be happy to go into further depth during office hours. The advantage of her approach is that it gives you a panoramic view of many centuries of East Asian Art.\nMumbles? Never--unless you call her quiet voice at the Metropolitan Museum mumbling... More like she was trying to be respectful of the other visitors in the Museum. \nThere are senior professors at this university who've been here for years and years, and their teaching is absolutely deplorable. Sandrine is hardly in that camp. Her class was fascinating, and she's a great teacher, dedicated to her students. You'd be a fool not to take advantage of her vast knowledge. \nWorkload:\nTwo exams--midterm and final; two short papers analyzing objects at the Met\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "September 07, 2005",
            "review_content": "\nProf. Larrive-Bass was one of the best I have had at Columbia. She was thoughtful, patient and attentive. If you missed a lecture, or had trouble with a topic, she would review the entire lesson with you in office hours, or make another appointment to ensure that you understood the material. She offered to read your papers before you submitted them, and returned them within hours with in-depth comments. I personally availed of both aids--and learned a lot not only on the subject, but also on general history of the region and how to write a paper on a non-economics subject (IÂ’m an econ major). \nShe also finds hands-on things to do with the class to bring the subject matter to life. She brought in a copper Chinese work; she took us to see a tea-ceremony; we practiced calligraphy in class. Not many teachers take the time to care about the methods of teaching--but she does.\nYes, she has an accent. She's from France. But Columbia students aren't provincial, or they shouldn't be, and if they are, they should get used to the fact that the great teachers of the world do not all speak in flat mid-western accents. Grin, bear it, take this course, and take advantage of a great instructor.\nWorkload:\nTwo papers, mid-term and final. Study those pictures.\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "September 07, 2005",
            "review_content": "\nI think the last reviews are a little absurd (and they suspiciously seem written by the same person...). I took Sandrine's class last year and our class unanimously loved her. I am an art history major and I've taken classes with loads of the art history gliteratti - Krauss, Buchloh, Higgonet, Ballon... (the list goes on) and Sandrine - despite not yet being a professor - ranks as highly as any of these and is even better than some of them.  \nThe class is not by any means easy, but it is by no means impossible. In a school where getting an A sometimes is too easy, I felt I really earned my A for this class.\nSandrine's passion for the subject becomes infectious, and you really push yourself to learn and understand. \nFurthermore, I think one may be frustrated with her method because she does not have a simple-minded \"cause and effect\" attitutde towards art, instead she tries to make us understand art through a whole prism of different methods - philosophical, aesthetic, religious, social ... Her exams were notoriously hard, but very intellectually satisfying because she really forces you to think and engage with the texts. \nBASICALLY, I strongly suggest you to take her class! And at risk of sounding presumptuous, I've been taking art history classes for a long while and didn't think I could have been as blown away as I was. \n\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "September 04, 2005",
            "review_content": "\ni absolutely agree with the first review. i did really well in the class but it stunk -- which is totally a pity because i was excited to learn about east asian art. stay away and hope for a new professor. why? she is just god-awful boring -- complete monotone + lights off + french accent that is too heavy = snoozefest. a snoozefest which, by the way, you have to attend because she takes meticulous attendance.\nWorkload:\neasy but not worth it.\n"
        },
        {
            "course_name": "Art in China, Japan, and Korea",
            "review_date": "April 25, 2005",
            "review_content": "\nDon't take this class. She mumbles the whole time and she's sorta of obnoxious. I'm an Art History major, I'm probably going to do well, and it's just not worth the time.\nWorkload:\nEasy workload...2 short papers, a midterm and a final. Readings are not necessary to do well and not interesting at all.\n"
        }
    ]
}