{
    "prof_info": [
        {
            "prof_name": "Stephen Unger",
            "prof_id": 50,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "January 02, 2005",
            "review_content": "\nI disagree with most of the previous reviews -- Professor Unger is a wonderful professor, take his course (well, its required, but at least be happy about it).\nThat being said, the course is difficult, and Prof. Unger inflates his grades somewhat less than we Columbia students are used to. The problem sets can sometimes be difficult, but they are all doable if you have paid attention in class. CLASS ATTENDANCE IS NECESSARY -- Prof. Unger wrote the digital logic textbook, and it is completely incomprehensible. But he goes over the same material in class, with the same examples (hey, he wrote them), and when lecturing, is lucid. He has a habit of mishearing questions, and then answering them, but if you persevere, he has the patience to clear things up for you. He can also be a bit absentminded when assigning problemsets, so if a problem looks wrong, email him about it, because it might well be. But he's prompt at responding, and very reasonable.\nWorkload:\nWeekly problem sets that are sometimes quite difficult (and even when not, always time consuming), but these account for only 15% of the grade.\nOne midterm, one final. Both tests are much easier than the homeworks, testing only the basic basic stuff. Don't screw up the final though, it is 60% (this term he made it 70%) of your grade.\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "December 25, 2004",
            "review_content": "\nThis is a new class opened by the CSEE department and Prof. Unger is teaching it for the first time. It basically combines Digital Logic and Comp Org into one class. So the content is much more condensed and not as detailed as either of those 2 classes it intends to replace. \nProf. Unger uses his own textbook for the first half of the class (digital logic), and someone else's textbook for the second half (comp org). I must say, the first half is significantly easier than the second half, however, the midterm (which covers the first half) has a lot of detailed questions that require thorough understanding of the material. While the final (focusing on the second half) has mostly conceptual questions that only require a superficial understanding of the material, simply because the second half's material is much more difficult and he cannot go into much details.\nAs for Prof. Unger, his lectures are much more understandable and lucid when covering digital logic topics. When it comes to comp org, his lectures become rambling and explanations become difficult to understand. The homework sets after the midterm also become much more difficult. So be prepared to do a lot of your own reading on the second half of the semester. \nAs for tests, they are not as difficult as the homework questions, but questions still require significant thinking. But if you do all the homework questions by yourself and understand the solutions for the ones you cannot do, you should be fine on the tests.\nWorkload:\n1 weekly problem set ( 7 questions on average, a lot more difficult questions on comp org topics, do not expect to be able to do all of them)\n1 midterm, 1 final. Final is like 65-70% of your grade and focuses on the second half of the semester.  Not an easy A by any means, must put in hardwork.\n"
        },
        {
            "course_name": "Fundamentals of Computer Organization",
            "review_date": "September 15, 2004",
            "review_content": "\nThis guy is the reason that tenure should not exist.  He needs to be retired by the school as he gives questions on exams that were not covered in any readings, homeworks, or classes.  He is inappropriate in conversations outside of class, will not help you even if you beg, and grades unfairly on a C minus curve.  He forgets what he is talking about in mid sentence often which is probably why he puts things not covered on the exams.  If you want to destroy your GPA, learn nothing, and be insulted take this class.  Columbia needs to suggest to this guy who is older than my grandfather that he might want to head to Florida and stop torturing students with his dribble.\nWorkload:\nUnreasonable homeworks that even the TA's could not help with in many cases.\n"
        },
        {
            "course_name": "Fundamentals of Computer Organization",
            "review_date": "May 23, 2004",
            "review_content": "\nIf you have digital logic background and some comp org knowledge, you most likely will be ok. However, if that is not the case, don't take this class with this professor unless you have tons of time to teach yourself!\nThe first half of the semester he covers digital logic using his own notes and the small appendix on the book which is not sufficient to understand the depth of the subject.  After the midterm, he rushes through the entire book and once he finished, he goes back to cover more digital logic stuff.  He doesn't follow the book because he didn't write it.\nProf. Unger is very disorganized in his lectures and students are trying to understand what the hell he is talking about.  TA's were just too busy with their stuff and weren't helpful at all. \nThe subject itself is very interesting and challenging, you can a lot , but you are on your own.When hws or exams, make sure you understand what is he asking, you might know the answer, but don't quite understand what the hell the prof. is asking you.\nWorkload:\nmidterm 25 % final  60 %\nweekly hws 15%\nThe time you need to spend on this class will depend on your background of the subject.  You are better off reading the book and doing his own made up problems than going to class . Avoid the professor if you can. \n"
        },
        {
            "course_name": "Digital Logic",
            "review_date": "January 03, 2002",
            "review_content": "\nThis Prof. loves to give exams that include much material never seen in the hws. DONT listen to the TA's when they tell you that if you understand the hws you will do fine on the exams. Also, the Prof. doesn't really curve or if he does he curves to a C, which is the average grade in the class. Avoid this class if you can!\nWorkload:\nhomeworks are assigned every week, some of it is challanging, but no more than 4 to 5 hours each.\n"
        },
        {
            "course_name": "Sequential Logic Circuit",
            "review_date": "December 18, 2001",
            "review_content": "\nAfter taking twenty plus computer science classes, Prof. Unger is definitely one of the better lecturers in the CS department. If you have taken digital logic CS3823, this class won't be hard. First of all, the class meets once a week, and they are only 2 hrs long instead of the usual 3 hrs long classes. The course is basically a continuation of digital logic. He only teaches one chapter from the book that he wrote. Completing the homework sets will definitely prepare you for the tests. This class is relatively easier than digital logic and the grading is slightly better. Besides, it's a 6000 level class!\nWorkload:\nEvery week there is a problem set. One mid-term and a final.\n"
        },
        {
            "course_name": "Digital Logic",
            "review_date": "December 04, 2001",
            "review_content": "\nI don't like the fact that he uses his own text book for the course. The book is too condensed. You MUST go to his lectures...a lot of things that are not really explained well in the text he likes to cover in class. Plus, he teaches too slow in the beginning, and then in the end of the sem. he rushes things... overall he's a good teacher though, kinda tough on grades.\nWorkload:\ndecent amount.\n"
        },
        {
            "course_name": "Fundamentals of Computer Organization",
            "review_date": "December 31, 1999",
            "review_content": "\nOld-school and hard-core. Wrote the digital logic textbook. Expect a knowledgeable and sometimes-enthusiastic presentation of the material. He sneaks in a few jokes, aimed mostly at the tech-nerds crowd. He is from the days before grade inflation, so watch out for stingy final marks.\n"
        },
        {
            "course_name": "Fundamentals of Computer Organization",
            "review_date": "December 31, 1999",
            "review_content": "\nAnother hard grader, who is moderately fair; though everyone gawked at the test mean of 45 on the midterm, in the end he gave out as many A's as C's. The material is interesting, but his delivery is like counting sheep. He sure understands this stuff, though, and he is great at explaining things step by step. Oh, and he looks like a Binkley from Bloom County.\nWorkload:\nnot that much, but you have to work hard on it to get a good grade. Regular problem sets, Midterm and Final exams.\n"
        },
        {
            "course_name": "Digital Logic",
            "review_date": "December 31, 1999",
            "review_content": "\nHis tone in class is so boring that I'd rather be listening to an emergency broadcast test. The langauge he uses on his tests and in his book is so cryptic that an interpreter is sometimes needed. He is a very stingy grader, and generally unyielding to students suggestions and complaints.\nWorkload:\nHeavy. Lots of repition of problems that are not difficult, but very time consuming and annoyingly tedious. Tests are difficult.\n"
        },
        {
            "course_name": "Digital Logic",
            "review_date": "December 31, 1999",
            "review_content": "\nThe guy is old! He wrote the textbook, and has a webpage full of errata for it. Teaching style can be dull, and he mostly follows the text, which is good, because it's not always clear. Hearsay says he grades on a 'C' curve, so be prepared to work and still only get a B.\nWorkload:\nProblem sets every week, totally do-able. Midterm and final.\n"
        }
    ]
}