{
    "prof_info": [
        {
            "prof_name": "John Kuhn",
            "prof_id": 11287,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "February 21, 2015",
            "review_content": "\nJohn is a solid U-Writing professor, and I feel like my ability to articulate an argument and comprehend a heavy document greatly improved during the course of his class.  Sometimes the class can be boring, but John treats everybody like an adult and is able to present everything in a very understandable manner.  He is a fairly tough grader, but if you are a good writer you will be in good shape.\nWorkload:\n4 essays, 3 drafts for each, like every other U-writing class.  During times when you arent in the middle of writing something he will give you 20 pages of reading per class.  Overall, not bad.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 23, 2013",
            "review_content": "\nAlthough and outwardly nice person, John's classes were very boring and plagued by poorly led discussions. It felt like he never quite knew the right question to get a discussion going and he ended up answering most of the questions himself. His paper critique was fairly good but the essay topics were often poorly explained. Overall I found myself just answering a single question a day to get participation points and trying to keep my eyes open throughout the rest of class.\nWorkload:\nNormal U-writing stuff, did about 70% of the readings and was able to slide through.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 24, 2011",
            "review_content": "\nJohn Kuhn led a very good UWriting section.  To be honest, this class will probably never be the most interesting class anybody is taking.  Writing exercises just flat-out aren't that exciting.  But he made it pretty fun.\nHe comes to class enthusiastic every day, often carrying snacks since he knew many wouldn't have time for breakfast before a 9:10AM class.  He chose interesting readings for our exercises and essays, which made them as fun as they could possibly be.  He had well-coordinated exercises and listened well to student complaints, and did his best to make sure our writing skills were improving all through the semester.\nHis grading is definitely tough, but it always feels fair.  He always explains exactly why your essay wasn't up to an A standard, and how it can improve.\nHonestly, this course won't be a bucket of fun with anybody, but John Kuhn brings it as close as it will come.\nWorkload:\nSame as any other UWriting section, I believe.  4 essays ranging from 1500-3000 words, except the last one which was just a short and fun \"imitation\" of a genre.  Drafts due regularly.  Writing exercises after most classes, especially at the beginning of the semester.\n"
        }
    ]
}