{
    "prof_info": [
        {
            "prof_name": "Jack Norton",
            "prof_id": 2750,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Inorganic Chemistry",
            "review_date": "April 09, 2012",
            "review_content": "\nThe course was split in two, and a lower undergrad curve was given (which was not cool). The course is hard, especially if you're 3D challenged (since half the course deals with conformations and turns of molecules). While Professor Owen is an excellent teacher that deserves more praise for teaching than any other chem professor I've encountered over my time here, taking time out of his schedule to meet with students and further explain difficult topics (along with the T.A.), Professor Norton is a bit more disorganized and awkward to approach. Both of them are good teachers, but while Professor Owen sticks mostly to the book, Professor Norton sticks more to his notes and myriad handouts. It's not an easy class, as I have said, but you'll learn a lot and gain many chemistry skills that were missing in gen chem.\nWorkload:\nLots of problem sets that take a long time to complete (hence 4.5 credits), midterm, final\n"
        },
        {
            "course_name": "Advanced Inorganic Chemistry",
            "review_date": "January 11, 2012",
            "review_content": "\nTo be completely, truly honest, I'm not smart or disciplined enough to learn this material on my own.  However, thankfully, I had a lot of help, and I knew several people who were extraordinarily patient and kind enough to teach me and answer my countless stupid questions.  Quite frankly, the course isn't designed for intrepid explorers wanting to learn about inorganic chemistry for the first time, and especially not for undergraduates.  I think most of us managed to stumble through it, and I'm (sort of not really) proud of the grade I got, proof that I survived through the material and the, at times, poor teaching.  But the grade I got wasn't that great, even with the effort I put into the course.  I know that there will be others like me who think that they're invincible and reckless and relish the challenge of taking a grad school class.  (And I know that this class hasn't stopped my desire to learn more chemistry; quite the opposite.)  I just hope that you will register for this course with a huge grain of salt and I greatly recommend that you know nice people who do inorganic chemistry for a living, *especially* if Jack Norton is teaching the course, because asking them is what helped me the most in understanding the material. \nProf. Owen's part was difficult and frustrating, but it wasn't entirely his fault.  The material is hard, and one of the biggest flaws of this course is that it's for graduate students.  Everyone except for three or four undergraduate students will have taken some form of inorganic chemistry before.  They all know about character tables and Mulliken symbols and molecular orbitals, even if they don't remember a lot of it and even if the majority are organic chemists that don't live and breathe the stuff.  Even among the undergrads who I took the class with, three out of the seven of them had taken it prior.  The problem sets aren't that bad when you have a rudimentary understanding of how to do the problems and of the subject matter, but it's that rudimentary understanding that will take a lot of effort to obtain.  Group theory is rather abstract and mathematical, and there's a lot of tricky geometry hidden in inorganic chemistry.  \nOccasionally Prof. Owen would move quickly and be difficult to understand, but overall he was very clear and his blackboard notes are amazing.  Even when I forgot most of the stuff (I'm not a morning person and tend to get through 9 am classes half asleep, just copying what I see on the board), my class notes saved me.  The textbook is pretty good, but he diverges from the material by the time he gets to SALCs, and while it helps in one's understanding, it is the class notes and the problem sets that will prepare you best for his exams (though I only took one exam of his, so I'm not sure how good this advice is).  The best part about his half of the course was that, while he seems a little intimidating at times, he's super-friendly and he will go out of his way to help you if you ask for help.  A group of us once asked him for an appointment, and he stayed until almost 8 pm (three hours, I think) answering our questions and patiently guiding us through how to understand the material and do his problem sets.  It still fills me with amazement and gratitude when I think about how much time he gave us when we were in trouble.  \nMy major gripe is that I would have appreciated a practice midterm.  I don't understand why teachers of grad school classes don't follow the example of classes like Gen Chem and Physics, where the teacher will freely give the student old exams as practice, especially since the majority of our grade is the final exam and, especially for this course, we didn't have any midterms as preparation.  The same criticism I have of Professor Norton.  It's such a help... \nProfessor Norton's half ... was okay.  He's not a particularly good teacher.  He's bad at communicating clearly and succinctly (not that I am, either, but compared to Prof. Owen he's quite poor), doesn't have good blackboard notes, sometimes contradicts himself in lessons, has condescending habits (i.e. asking people if they know something specific, and then if someone does, having a conversation about it with them in the middle of teaching; he has pet students that he always calls on; he doesn't seem to understand the difficulty of the subject for undergrads), and his problems are worded badly at times.  Not to mention it's difficult to talk to him one on one. I found that the only way of reasonably dealing with his ridiculousness was just to laugh at it, because otherwise I would cry.  \nHowever, he does know his stuff, he brings up examples in class that are interesting even if his presentation of them is not very effective, and he likes the material.  I've had poor teachers who don't like what they teach, and it's awful--he's better than that, at least.  \nHis problem sets can range from doable to indecipherable and completely ridiculous.  There were way too many times when a group of us undergrads would laugh hysterically while trying to figure out how to answer the problems... Outside help saved my grades on problem sets, but not by much, since I had a TA who didn't seem to understand the concept of mercy.  \nHis final exam was somewhat horrible.  I remember one question where he asked us to copy from memory a catalytic cycle from a paper he handed out in class, and then explain some essential detail that, to be honest, I don't think he ever talked about himself.  (I still kick myself in the butt for not being proactive enough to ask someone before I took the test.) You pretty much have to memorize your class notes and the parts of papers that he talked about in class if you want a good grade.  The one positive of that test was that he brought coffee to the exam, which was a nice gesture of him (though I was so pumped up on adrenaline that I didn't need it).  And to be honest, while taking it, I was kind of happy about how much I actually knew of the material.  Even though I didn't do so well, it made me glad to think that I had gained something out of it, that I understand inorganic chemistry marginally better than before.  It's some crazy shit, and it was a hard semester trying to learn it, but I'm kind of glad I did it. \nThe problem one other reviewer mentioned about his organization on problem sets in Advanced Organic also happened in this class.  He assigned us a long, confusing problem set that covered things we didn't talk about in class, and didn't seem to understand that us undergrads had exams and papers in the interval.  It was okay for me, so maybe I'm complaining too much.. but it just seemed frustrating that he wasn't considerate and didn't understand how much harder it was for us undergrads who had to deal with four or five other classes at the same time, compared to graduate students with only one, or two if teaching.  Plus I'm pretty sure Prof. Norton didn't have a separate curve for undergrads, which in this class I have a feeling would have made a huge difference... \nI don't know if this sums up everything I have to say, but I hope it helps someone!\nWorkload:\nIt's 4.5 credits, and every credit does count... The problem sets take a long time and definitely need to be done with other people.  The exams are long.  If you have a half-half course, it will probably be problem sets every week or other week, plus one exam at the end of each half that acts as a final for that section.  \n"
        },
        {
            "course_name": "Advanced Organic Chemistry",
            "review_date": "December 20, 2011",
            "review_content": "\nI have no idea why this man has a silver nugget.  He is incredibly disorganized and frustratingly inconsiderate of his students, particularly undergraduates.  His lectures are all over the place and neither their point nor direction is ever clear.  He doesn't seem to understand questions well: a student asked him if we should use his notes as a guide to what to focus on in the textbook or if we should focus on his notes more or vice versa, and he spent a good five minutes rambling about something else before he finally accidentally answered the question. Moreover, he looked offended when the student persisted that he wasn't answering her question.  \nThe workload is pretty light: he didn't give us any exams before the final (we had already had 2 exams before he took over), there was some reading, and we were supposed to be 4 problem sets, which shrunk to 3 due to aforementioned disorganization -- one counted double.  \nI tolerated the second half of the Adv Orgo with Jack (the first half was taught by Professor Leighton and SO much clearer, easier to follow, though certainly more intense), but my gritted teeth have acquired a snarl behind them in the week or so.  On the last day of class, he assigned a third problem set (even after he met with some snark over assigning a problem set over Thanksgiving and accidentally making one due on the monday of fall break -- fortunately he corrected this).  He gave us \"plenty of time to do it\": a week, actually, with the final two days after.  This is technically a graduate course (though undergraduates are required to take one at some point for a major in chemistry), so for 2/3 the class composed of graduate students, this wasn't a problem; but one undergraduate had the courage to pipe up that as undergraduates, we have other exams to worry about, at which point Jack looked genuinely taken aback, as if he was either not expecting this or that someone would sass him.  I unfortunately became a case in this girl's point and had to ask for an extension, since in the span of time between when the problem set was posted and when it was due, I sat three exams and was assigned, wrote in its entirety and turned in an 18-page take-home.  I emailed both him and the TA about my situation, and the TA thankfully granted me some extra time to do it.  However, when I attended the review session a few hours after it was due, Jack made a pointed announcement at the start that he was unable to post the answer key yet because a student had been granted an extension.  He also made another disgruntled comment about it later in the session...\nTo his credit, Jack is personable, perhaps a sweetheart, and makes himself available to his students; the breaks half way through lectures are also appreciated (though only necessary because they move so slowly...).  However, these quaint quirks are outweighed by the borderline disastrous way he runs this class.\nWorkload:\n3 (4?) problem sets, some reading, a final\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "November 16, 2006",
            "review_content": "\nThis class was very easy, basically a review from highschool.  There doesn't seem to be a need to go to his lectures - about a 10% attendance rate thoughout the semester - because really, he follows the textbook pretty closely.  But, if there's something you don't understand, he's very nice during office hours.\nWorkload:\nWeekly quizzes during recitation, 3 midterms, 1 final.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 08, 2006",
            "review_content": "\nI was happy in Professor Norton's class. He doesn't really teach much in class that you can't get out of the book, but if you want to learn the material slowly, that's what he'll give you. I slept through a lot of the classes I went to. Actually I would fall to sleep, have a dream or two or three, then wake up and feel like I hadn't missed much, which was nice. \nTake the class. If you're good with chemistry the workload is light and if you're not, he's thorough and takes the lesson slowly.\nWorkload:\n\"Homeworks\" are assigned but not collected. Quizzes are given weekly in recitation. The top five contribute to 1/5th of you're grade. 3/5ths comes from three midterms. 2/5ths from the final. That's 6/5ths, so he drops the worst 1/5th.\n"
        },
        {
            "course_name": "Advanced Organic Chemistry Lab",
            "review_date": "December 23, 2005",
            "review_content": "\nJack is an amazing person.  The year I took Advanced Organic, four of the first year graduate students ended up choosing Jack as their doctoral advisor, not only because his research is interesting, but because he is genuinely a caring and considerate, sweet prof.  I've never taken Gen. Chem with him, but I imagine his cute personalisms will carry over.  His students often kindheartedly make fun of his shyness, his awkward hand gestures and his overall Jackness, but its because they love him.\nMost likely, he will get into some kinetics stuff (not sure what the GChem curriculum is), topics that he covers in his own research.  His lectures in Adv. Organic were always very well-organized, he lectured pretty close to the textbook, his problem sets were long and challenging of course, but that's to be expected.  His midterm followed his lectures/psets pretty closely, and he graded very fairly.\nMy main advice to frosh taking his GChem course: go see him!  If there's anything you don't understand, or if you're just looking to chat about the class, etc. shoot him an email.  I'm sure he'll reply.  He's probably very busy (I think he's pretty involved in the department) but he'll always make time for a student!\n"
        }
    ]
}