{
    "prof_info": [
        {
            "prof_name": "Maura Spiegel",
            "prof_id": 396,
            "total_reviews": 39
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Writing",
            "review_date": "December 13, 2016",
            "review_content": "\nOkay I took this class in spite of the bad reviews and truthfully Maura Spiegel is now my favorite teacher this year and someone I would honestly like to be friends with. The discussions we had in class were some of the most thought provoking and interesting and comfortable discussions I've had all year. \nShe also brought snacks every class and treated all of us so kindly. I'm not sure how approachable she is in her larger classes (we only had seven kids in our class) but she was very friendly and easy to talk to.\nShe's not the most organized but I loved that about her. Not every teacher should teach the same rigid, unpredictable way. But if you can't handle that teaching style, maybe think twice about it.\nThe workload is a little heavy but worth it. If you're someone who truly loves literature and appreciates it, take this class. Don't come looking for an easy A otherwise.\n\nWorkload:\nfour or five essays. Weekly online posts that aren't too long. A new book to read every few weeks (none were very long at all). \n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "January 04, 2011",
            "review_content": "\nI started out loving this class but I DO NOT feel that way now!  Spiegel is unorganized.  While the other sections were reading literary favorites and writing essays, we were discussing memory the ENTIRE semester.  We read books, articles, and watched movies about memory and history.  It seems to be her expertise which she then applies to every course that she teachers - whether it is this course or a film course, I have a feeling that the syllabi are very similar.  \nWe were supposed to have weekly courseworks postings but she stopped those because she kept forgetting to put up prompts and questions for us to discuss. She didn't assign us any essays to write until halfway through the semester so we had to rush in 3 essays instead of having them spread out thanks to Spiegel's unorganized and chaotic nature.\nAnd then is the grading.  It took her a VERY long time to give us our grades for the first paper.  We were graded harshly and everyone in the class said that they were surprised by her harsh and rather rude comments and grades.  This could partly be because it was our first grade all semester and she told us that we were all doing better than we ended up doing on the paper.  On the same note, I asked her if I should rewrite a draft of my essay and she said it was not necessary and that  I would do very well on the paper.  Well, she lied.  I did not do very well and it is not just that I have oddly high standards.  I did not improve from the paper before - instead she gave me the same grade slash the grade one portion of a grade higher (ex. B/B+ or B+/A-).  \nIn the end, I DO NOT recommend this class because I am unhappy with the way Professor Spiegel handled the structure of the course and the grading.  She was fake, unorganized, and unnecessarily harsh.  If she wants us to improve and learned from our past assignments, space them out throughout the semester and not squish them into the last two months.  \nWorkload:\nAbout a book or movie a week with the occasional article.  If you are smart and a good BSer, you can get away without completing a book or two.\nWeekly courseworks postings until she forgets to put up the question for too many weeks in a row\nEssays. We had 3 because she didn't assign us any until halfway through but I think she originially said she would assign 5.  They were other random written assignments on the syllabus that she did not assign us to do\n"
        },
        {
            "course_name": "20th Century British Literature 1950-Present",
            "review_date": "January 12, 2010",
            "review_content": "\nBoth Professor Spiegel and her British Lit class are difficult to describe, but I'll try: The syllabus, which consists of several films as well as novels, is a great one. It's hard not to like most of the works, and even if you hate one of them, it's easy to vent--in class, on CourseWorks, maybe even in a paper. \nProfessor Spiegel lectures with a rather quiet voice, laughs all the time about stuff that most people don't find funny, and does absolutely nothing that will help or hurt your final grade. She has absolutely nothing to do with it. You write two papers--one 5-7 page one halfway through the semester, one 10-12 page final due at the end. For both, you can choose just one book OR movie to write about, so...\nYou can NEVER come to lecture, NOT READ anything, NOT WATCH any of the films except for two, write your first paper about one movie, write your final about the second movie, turn them in, and get anywhere from a C- to an A for your final grade. Maybe the weekly CourseWorks posts (basically responses of 3-5 sentences on the works for the week) matter, but I doubt it. Even if they do, they take 5 minutes each, whether you know what you're talking about or not. The quality is not judged.\nProfessor Spiegel doesn't read the papers, either. Her TA does, so if you have a generous one, you're good. If he/she is harsh, you're probably screwed. You should base your decision on whether to take the class on the TA.\nWorkload:\nA bunch of novels and films you don't have to read/watch at all, weekly CourseWorks responses, one 5-7 page midterm paper, one 10-12 page final paper. All grades depend 100% on the TA.\n"
        },
        {
            "course_name": "Intro to American Studies",
            "review_date": "January 11, 2009",
            "review_content": "\nIntro to American Studies is an AMAZING, eye-opening course that everyone should take! The goal is to broadly address different themes of the American experience, combining history, politics, literature, and film. It really gives you new perpsectives on American life, and you learn to analyze elements of culture in new ways. \nThe class has about 40 people, but it runs like a seminar, and the profs are always asking for discussion (though often it stayed silent). Weekly discussion sections are very helpful and thought-provoking, and the TAs are extremely qualified and wonderful. Both professors are amazing and very friendly, especially Delbanco, whose lectures and questions are very profound and stimulating (he's also a very established scholar of American history/literature). \nThe reading is very heavy, but you really should do as much as you can. Your only grades are two big papers based on a topic of your choice, so you can definitely skip readings and get away with it, but you'll be lost in class and get much less out of the course. \nWorkload:\nTwo 7-10 page papers; reading that's heavy but mostly ungraded. \n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "January 10, 2008",
            "review_content": "\nProf. Spiegel is amazing.  Not only does she make difficult philosophical essays accessible, but she incorporates film, art, and other types of narrative with literature to fully explore different theories and ideas.  She is definitely a challenging professor, but worth the effort. I would highy, highly recommend taking this class from her.  \nWorkload:\nWe only had three five page essays and short weekly reading responses.  She is a fair grader, although a bit slow on returning things at times.  \n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "January 19, 2007",
            "review_content": "\nIt's completely understandable why Spiegel gets a wide spectrum of reviews.  She is a very smart woman, and cares greatly about both literature and her students, but her teaching style can be frustrating.  While her classes are billed as lectures, she attempts to conduct them like seminars, which generally results in the same talkative people (often auditors) making inane and arbitrary comments.  To Spiegel's credit, she can generally work these comments into her larger scheme for the class, and isn't hesitant to tell you when she disagrees with you.  Her \"lectures\" are pretty disorganized, but this seems a product of her syllabi.  The books she chooses are fantastic, and are not canonical works with years of previous scholarship, so she seems genuinely to be grappling with the texts, and expects her students to do the same.  \nShe is kind of spacey - for Brit Lit, we didn't receive our first papers back until a few weeks before the next paper was due, and didn't receieve our final grades until the next semester - but she is a fair grader and is eager to meet with you about the class or your papers.  She is also open to rewrites, which can be key in a two paper course.\nWorkload:\nSimilar for both Brit Lit and American Lit since 1945 - two papers usually (5-7 pages each), lots of readings and films, and occasional online postings.  Totally reasonable, especially when the books are so great.\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "June 07, 2006",
            "review_content": "\nBeing in Professor Spiegel's class is a life altering experience -- all for the better.  Instead of lecturing using line by line (or scene by scene) interpretations of a novel or film, Spiegel guides the class in how to open a narrative.  Once the story is opened she applies it to different sociological / philosophical areas in life.  Her lectures are clear, engaging, and thought provoking. Her thinking \"outside of the box\" approach to LIterature & Film is what makes her classes such enjoyable experiences.  I know that some reviewers dismiss her as being \"scattered\" or \"flighty,\" and honestly, I don't know why. I had Spiegel for two classes last fall, and she was well prepared for both classes. In addition, she gives freely of her time during office hours to help you with any paper concerns or questions you may have about her class. She is one of the nicest and caring professors that a student can hope to find in Columbia. \nWorkload:\nAm Lit: 2 papers (lengths vary)and a take-home midterm.Am Film Genres: 2 papers (lengths vary) and a final exam.\n"
        },
        {
            "course_name": "20th Century British Literature 1950-Present",
            "review_date": "May 06, 2006",
            "review_content": "\nconsider yourself very lucky if you have maura spiegel as a professor. she is a truly phenomenal woman: totally engaging, extremely intelligent with an uncanny insight into books and life, very fair and diplomatic, and she is freaking hilarious. it was such a pleasure taking a class with her--i would do it more often if only it would count towards my major.\nWorkload:\na lot of reading, but she allows the class to set the pace. \n"
        },
        {
            "course_name": "Intro to American Studies",
            "review_date": "April 17, 2006",
            "review_content": "\n\"Scatter-brained\" and \"kooky\" are certainly the best words to describe Speigel.  I took her Intro to American Studies class, and was a bit disappointed.  Her lectures don't seem to have any structure, and she often seems unprepared.  All of her classes are taught as open discussions, but with the class size being so large, this format doesn't seem to work as well.  Often she seems to go off into tangents, and sometimes it seems like you are hearing the same thing over and over again.  Also, she often seems to forget things on the syllabus, including our midterm.  (We wrote a paper, so I suppose she used that instead.)  All of this being said, however, she does seem like a friendly person, and I know several people who have enjoyed talking to her in office hours.       \nWorkload:\nModerate--if you think that the workload is too much, it's easy to persuade her to postpone the deadline.  In that way, she's very understanding.  American Studies had a lot of movie screenings (and not good movies) so you may want to keep that in mind.  Those tend to take up a big chunk of your evening.\n"
        },
        {
            "course_name": "Film Studies: American Film Genre",
            "review_date": "January 22, 2006",
            "review_content": "\nI loved this class! The people who are so upset about Prof. Spiegel are clearly the uptight types who base their entire identities on the grades the've learned to count on and predictable teaching styles and standards.  If you open your mind to her and what she is saying, you will see that even her most off the cuff joke is loaded with insight and perception about how the film or reading actually APPLIES to the world.\nYeah, she takes a really long time to grade, but responds to papers more thoughtfully and has higher expectations for her students' own thoughtfulness than any other professor I've had. \nI honestly believe that the people who get her have to be far smarter and more fun than the ones who can't see through a little scatteredness. Who cares about your dumb grade anyway? Are you here to learn or rack up points?\nWorkload:\naverage to light\n"
        },
        {
            "course_name": "Intro to American Studies AND American Lit since 1945",
            "review_date": "January 18, 2006",
            "review_content": "\nProfessor Spiegel is everything I had hoped a liberal arts education would be about.  In addition to the most solid syllabi EVER, her lectures are super informative and often pulled from many sources, including text, photography, film and whatever else happens to be on her mind (usually something cool in science, philosophy or current events).  She doesn't shy away from controversy, and teaches her courses with reverance for the material and her students.\nWhile some think her lectures are disorganized, she really tailors them to what she thinks the students find most interesting about the works.  The key to a good Spiegel class is participation.  While the syllabus lays out how much time she wants to spend with each text or topic, it seems like Spiegel comes to class with a very basic daily agenda.  Based on the direction of discussion or questions from students, Spiegel will often tailor her lecture to the points of most interest and the class will inevitably turn to discussion.  Does this lay a groundwork where one or two students can dominate the class?  Yea, but with such enjoyable texts and materials, there's no reason everyone in the class shouldn't be chomping at the bit to participate.  Plus, in one of my classes with her, the girl who kept steering the class was super smart, so it worked out for the best!\nSpiegel also does what I've found few lit professors prepared to do and takes an extra day with material if she feels like there's enough interest.  We did excise one reading from one of my classes with her, and re-worked what our assignments would be to compensate.\nThough her grades aren't always the first to come in (and, yes, she does take a while to grade), it's worth the effort to pick-up your papers and/or exams because they come with detailed comments.  So, her grades may take a while, but that's because she thoughtfully and fully reads and responds to each student's work.\nIf you go to class, do the readings (which are reasonable and usually very, very good), attend the film screenings (at least a few) and participate in class, you're papers will be very easy to write and the exams or take home materials will be fine.\n\nWorkload:\nTwo papers (5-7 pages) and a mid-term (which may or may not be take home . . . or cancelled)\n"
        },
        {
            "course_name": "Film Studies: American Film Genre",
            "review_date": "January 16, 2006",
            "review_content": "\nI found Spiegel to be incredibly delightful. She is very enthusiastic about the material, which always makes for an entertaining lecture. SheÂ’s such a cute, little strange lady. This is a fun class in general (Jaws and Rambo were on the syllabus) and I found the readings to be easy and interesting. However, sheÂ’s definitely scatterbrained (she was consistently late to classes), but I didnÂ’t find that to be a problem in terms of the lecture structure. IÂ’m going to be taking her intro to American Studies. If you like quirky/crazy professors, youÂ’ll just love her.\nWorkload:\nextremely reasonable (the workload turned out to be a lot lighter than suggested by the syllabus she gave us)\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "January 15, 2006",
            "review_content": "\nStay away from this professor at all costs.  It is the day before spring semester begins and we have STILL not received grades for this class, grades which were due to the registrar a month ago.  We got back one out of three assignments, so the feedback on our work was minimal.  The reading list was good but lectures were absolutely useless and everytime I went I immediately regretted it.  I can't add much more because most of the other reviews on the site are spot-on (it IS class that you will hate if you aren't a pretentious English major who is hell-bent on sharing your self-detemined brilliance with the world).  I hated this disorganized, flakey professor and you will too.  Our final papers were due December 14; it is now January 16 and with the help of two TA's she is still not able to even give us the courtesy of turning in grades.  AWFUL.\nWorkload:\nreasonable, about a book a week\n"
        },
        {
            "course_name": "Dickens",
            "review_date": "January 01, 2006",
            "review_content": "\nToo unorganized, and even at the INSANE schedule of reading she planned for us, she was unable to have enough of a lecture plan to cover the class time. I feel like she wasn't very interested in the class (although she obviously adores the material), and so there was a lot of downtime and also some pointless meanderings which a better professor would have put down.  \nThumbs down.\n\nWorkload:\n400 pages a week of dense, Victorian prose. Simply too much to keep up with. The papers were reasonably-lengthed, though. \n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "December 16, 2005",
            "review_content": "\nProfessor Spiegel is one of the best professors I've had in my time at the university. Brilliant, witty, funny, intellectual...she has it all. Take any course you can with her--she is brilliance incarnate!\nWorkload:\nA 5-6 page paper, a take home mid-term of about 4 pages, and a final paper of 5-7 pages.\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "December 10, 2005",
            "review_content": "\nI repent, I repent! I'm sorry that I ignored all of the previous reviews that warned me against taking this class. I thought, \"How bad could it be?\" The answer, dear reader, is AWFUL. As many have noted, the reading list is thought-provoking, but no syllabus is intriguing enough to make up for the deadening silence with which this too-large class greets the nonsensical, unenlightening and stream-of-consciousness monologues that pass for \"lectures\" every Monday and Wednesday night. I dreaded going to this class; I dreaded the incessant stream of emails from Professor Spiegel announcing the screenings of films that weren't listed on the syllabus and were *always* scheduled at inconvenient times; and, most of all, I hated how it felt almost anti-climactic to sit in the class, since I could have gotten just as much out of it by staying home, reading the books, and watching \"Arrested Development.\" This class is one of those fabled English classes which will make you hate literature--or, at the very least--discussing literature. Take another class to fulfill the American Lit requirement; this class is not worth suffering through for that. \nWorkload:\nApprox. 12 books, 3-4 film screenings, 2 5-7 page papers (the last one counts as the final), 1 4-page midterm\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "November 29, 2005",
            "review_content": "\nI agree with a majority of the reviews on this page. This class was truly an awful, unbearable experience for about 90% of the time. The books that we read were wonderful, but her lectures were useless and unorganized, bogged down with confusing terms and nonsensical tangents. I feel like the class is full of a bunch of English majors who are in love with hearing the sound of their own voice: discussions often degenerate into students attempting to intellectually masturbate all over the hall, while Prof. Speigel sits in the front and babbles incomprehensibly. You only meet the graders when they stand in front of the class to yell at you, and the paper topics are often ridculously convoluted and strange (\"How does Don DeLilo deconstruct 'the real?'\"  was probably my favorite topic this semester.) At first I thought I just wasn't intelligent enough to keep up in this class, or that I hadn't read enough theory, but it soon became clear that no one knew what the hell was going on either.\nIf I could have changed anything this semester, it would have been to take a different english class. In fact, it was the absolute terror over having to deal with Prof. Speigel as an AmStud professor next semester that convinced me to change my entire major, just so I would never have to deal with her again.\nWorkload:\n10-12 books (depending on how many she decides to drop along the way).\n2 papers (one 3-4pgs, the other 6-8), and a Take-Home Midterm (aprx 4 pages)\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "November 29, 2005",
            "review_content": "\nI agree with a majority of the reviews on this page. This class was truly an awful, unbearable experience for about 90% of the time. The books that we read were wonderful, but her lectures were useless and unorganized, bogged down with confusing terms and nonsensical tangents. I feel like the class is full of a bunch of English majors who are in love with hearing the sound of their own voice: discussions often degenerate into students attempting to intellectually masturbate all over the hall, while Prof. Speigel sits in the front and babbles incomprehensibly. You only meet the graders when they stand in front of the class to yell at you, and the paper topics are often ridculously convoluted and strange (\"How does Don DeLilo deconstruct 'the real?'\"  was probably my favorite topic this semester.) At first I thought I just wasn't intelligent enough to keep up in this class, or that I hadn't read enough theory, but it soon became clear that no one knew what the hell was going on either.\nIf I could have changed anything this semester, it would have been to take a different english class. In fact, it was the absolute terror over having to deal with Prof. Speigel as an AmStud professor next semester that convinced me to change my entire major, just so I would never have to deal with her again.\nWorkload:\n10-12 books (depending on how many she decides to drop along the way).\n2 papers (one 3-4pgs, the other 6-8), and a Take-Home Midterm (aprx 4 pages)\n"
        },
        {
            "course_name": "victorian lit, american fiction since 1945",
            "review_date": "May 11, 2005",
            "review_content": "\ni read in one of the other reviews that prof spiegel is a goddess and i agree.  she is one of the few professors that really helps you with your writing and besides that she is brilliant.  some of the reviews said her lectures weren't worthy of columbia or some other ridiculous comments.  i don't agree.  i thought she was terrific i just cringed at some of the stuff the students said.  but i have been with professors who don't encourage any discussion and that is way worse than cringing.\nWorkload:\nreasonable\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "January 18, 2005",
            "review_content": "\nGet the syllabus and get the hell out. The reading list is phenomenal, and the class is simply not worth one's time. \n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "January 12, 2005",
            "review_content": "\nI completely agree with the previous reviews. This class was awful. \nIt started great, and ended awful.  This was my first class with Maura, so I don't want to say stay away from her, but the readings were great, but the professor and the other kids in the class were unbearable.  \nWorkload:\n3 papers. 10 books. 5 movies. \n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "January 12, 2005",
            "review_content": "\nI completely agree with the previous reviews. This class was awful. \nIt started great, and ended awful.  This was my first class with Maura, so I don't want to say stay away from her, but the readings were great, but the professor and the other kids in the class were unbearable.  \nWorkload:\n3 papers. 10 books. 5 movies. \n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "January 07, 2005",
            "review_content": "\nThis class was valuable only for the reading/movie list, which gives you works you might not otherwise read. Classes, however, aren't so great. She didn't really have any points to make about the books. She would ramble for a while, and then ask the class what we thought, and out of a huge class only a few people would dominate the comments, which were equally disorganized since there wasn't anything to go off of. I really didn't learn anything, but saw some good movies and read some good books.\nWorkload:\nTwo papers, a take-home midterm\n"
        },
        {
            "course_name": "20th Century American Literature: American Fiction post-1945",
            "review_date": "January 01, 2005",
            "review_content": "\nThis class was so disappointing!  It started off great, then spiraled downhill so fast into another lame Barnard English class that you were left wondering what happened to the funny, good lecturer she was on the first day.  Maura Spiegel is a whack job.  She's disorganized (completely!) and doesn't know how to run a class efficiently.  I was left listening to the same stupid girls over and over saying how this part reminded them of when their grandmother died and then they read Moby Dick.  Avoid Spiegel at any cost, it's a waste of your time and tuition money since you won't get  a thing out of it.\nWorkload:\nModerate.  Lots of reading but there was a take home final, which is nice.  Two papers.\n"
        },
        {
            "course_name": "20th Century American Literature: American Fiction post-1945",
            "review_date": "January 01, 2005",
            "review_content": "\nThis class was so disappointing!  It started off great, then spiraled downhill so fast into another lame Barnard English class that you were left wondering what happened to the funny, good lecturer she was on the first day.  Maura Spiegel is a whack job.  She's disorganized (completely!) and doesn't know how to run a class efficiently.  I was left listening to the same stupid girls over and over saying how this part reminded them of when their grandmother died and then they read Moby Dick.  Avoid Spiegel at any cost, it's a waste of your time and tuition money since you won't get  a thing out of it.\nWorkload:\nModerate.  Lots of reading but there was a take home final, which is nice.  Two papers.\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "October 13, 2004",
            "review_content": "\nMaura Spiegel is the most wonderful teacher at this school. She is not only an interesting, provocative, and caring professor, but she also generates a warmth in her classroom comparable to no other English Professor at Columbia. She does not just teach books as relics with no relevance to contemporary soceity, but teaches them as tools in which one can understand themselves and their environment. If you come to this class having read all the books and prepared to think and not just be told what to think, then you will learn interesting new ways to examine the soceity around us.\nWorkload:\nTons of reading, but she is a easy grader. \n"
        },
        {
            "course_name": "British Literature 1950-Present",
            "review_date": "June 10, 2004",
            "review_content": "\nProf. Spiegel can seem a little spacey but all in all I thought the class was worth it. She picked a decent selection of literature, and if you're worried that \"British\" works are going to be all staid and stodgy then you're in for a surprise - we read covered the decline of empire and the traditional British society, sex and violence, race relations, all that. We had to see just as many movies outside of class as there were books (something I didn't expect), and that was a real crapshoot - some of the films were brilliant, others were unrelated to the books and utter wastes of time where I thought I'd run out of the room screaming. That being said, you could probably get by in this class only reading a couple of the books so long as you see some films.\nIn such a huge class there was a tendency for just a few people to dominate conversation. This is one of the easier English classes, and people knew it. Anglophiles like myself will pleased. On top of this, Maura is a genuinely nice person who will talk with you at length about any topic in British literature. She certainly knows her stuff, and I enjoyed her lecturing style - it kept me awake, which is something I can't say about all my professors.\nHOWEVER, A MAJOR POINT: It is now June 11, I handed in my final papers a month ago, and I have yet to see a grade. This bothers me, and I'm sure it's bothering the graduated seniors even more. Also, we never got around to reading any of the short stories on the syllabus, nor did we have a final novel (all of the possibilities she had originally presented looked very interesting, and so I was disappointed when we never read them).\n"
        },
        {
            "course_name": "Modern British Literature I",
            "review_date": "June 06, 2004",
            "review_content": "\nThis is the only review I've ever done on CULPA, and I'm writing it to spare others the aggravation of taking a class with this professor.  She is not professor material--certainly not Barnard/Columbia material, and probably not even high school material. Her \"lectures\" were the worst I've experienced in my 3 years of college, and her ability to foment interesting discussion was virtually non-existent. Furthermore, she took weeks to correct our midterms, and as of June 7th I've heard neither hide nor hare about our second papers (due mid/late April), final exams (early May), or final grades. Previous CULPA reviews warned me about her, but I ignored them; BIG MISTAKE. My intellectual development would have been much better served spending 3 credit hours per week huffing solvents instead of diligently attending her classes. They are a total waste of your money and time. The good news is that, like the large portion of the class that did so, you can safely skip every last one of her lectures and probably still do very well. But if you want to learn anything whatsoever, look elsewhere. My advice: if you see a class she's teaching that looks interesting, buy the books on the reading list (if she bothers to make one up). then don't take the class.\nWorkload:\nA book and a movie every week or so; 3 papers.\n"
        },
        {
            "course_name": "Senior Seminar: Man in the Crown, Woman in the Streets",
            "review_date": "April 22, 2004",
            "review_content": "\nWhile I love Professor Spiegel to death, and think the material might actually be interesting if I had the time to read the books and watch the films, this class is utterly pointless. Considering your grade is based on the 20-pg thesis you hand in at the end of the semester -- which doesn't have to include any of the material on the syllabus or about any of the themes on the syllabus -- heck, it doesn't even have to be a formal essay; she'll accept creative works, as well! -- there's no reason, no motivation to do any of the work in class. The result is a weekly two-hour waste of time where Professor Spiegel bubbles enthusiastically about whatever we were supposed to be discussing that week but, because no one does the work, very little discussion is stimulated. I blame the English department for allowing such a course  -- either require term papers on the material we looked at in class, or don't require seminars at all and allow students to turn in some sort of scholarly work at the end of the semester that they wish.\n"
        },
        {
            "course_name": "Politics and American Film",
            "review_date": "January 13, 2004",
            "review_content": "\nYou won't really learn much in this class, but if forces you to watch some of the best American movies ever made, which is enriching in itself. As far as a structured syllabus or any sort of pattern to the material, you won't find that here. Spiegel is fun to listen to though, and is easily approachable with help on the papers.\nWorkload:\n2 easy papers and a very easy final\n"
        },
        {
            "course_name": "Dickens seminar",
            "review_date": "December 15, 2003",
            "review_content": "\nIf you want to take a class on Dickens, take it with Prof. Spiegel. Her lectures are insightful (if a little chaotic), informative, and, perhaps most importantly, *hilarious.* She stimulated class discussion capably and was respectful of and responsive to student comments, though honestly the most enjoyable moments of this class were when we all just sit back and let Prof. Spiegel talk. This woman know Dickens' work inside and out, and loves it. I highly recommend any class taught by her with Dickens on the syllabus. \nWorkload:\nSubstantial: 6 enormous novels (700-900 pages/novel), in-class presentation, weekly postings, long paper (12 pp.+) at end of term\n"
        },
        {
            "course_name": "Victorian Literature 2003",
            "review_date": "July 06, 2003",
            "review_content": "\nProf. Spiegel is very qualified to teach Victorian Literature. She has written and edited various texts on subjects such as the history of breasts in literature and the \"Grim Reader\"- a collection of writings about death. Having said this, I cannot fail to mention the torture that I endured in this class. Some of the lectures were hastily prepared and many times rushed. Also, some of my fellow students did not help matters by pursuing a dead and mute point in the lecture. This wasted valuable time! She  had no control over these kids!\nAgain, a smart and funny person! But, if you take this class in the future, you must visit your nearest Starbucks before you walk through the door. Ask for the \"double expresso.\"\nWorkload:\nDickens, Eliot, Gaskell, Wilde, Bronte, etc...\n2 Papers and take-home final. You must read the texts carefully and attend the lectures. She does take attendance. Also, the exams are mostly graded by the TA. \n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "April 20, 2003",
            "review_content": "\n    before i begin, i should implicate myself as partly responsible for the terrible experience that was this class. if nothing else, i realized that victorian literature is not what i like. nineteenth-century in france and russia = yay. nineteenth-century in england = literary msg. thus the tedium of reading thousands of pages of moralistic conceit only compounded the general drudgery. i don't know what exactly it was--spiegel is plainly brilliant, and really cool--i swear she even quoted devo once--but yeah anyway it was not good. she doesn't lecture. nothing was ever put into context, and when she did lecture whatever relevancy she could lend to my own understanding was undermined by the disproportionate amount of class time spent listening to inane comments by fellow classmates. it was all just so horribly vague and dull. i think it might have actually even been possible for me to enjoy this class were it more structured. but alas it was not, and thus, it sucked.\nWorkload:\neight texts, ranging from pleasantly mind-numbing to brilliant to harrowingly bad. Bronte, Wilde, and Kipling are nice. Gaskell and Meredith are an abuse of the language. 5 pg paper, take-home exam, 8 pg paper\n"
        },
        {
            "course_name": "Victorian Literature",
            "review_date": "May 10, 2002",
            "review_content": "\nProfessor Spiegel is certainly an interesting lady--she comes into class 5-10 minutes late every day, chain smokes, and continually swears during her lectures. Her lectures are very thoughtful and interesting, and she raises some provocative questions about the texts. It is often very irritating that she tries to make the class a discussion, though--sometimes she'll ask a question, and either nobody will respond, or someone will feel the need to give a 20-minute oral summary of the senior thesis s/he plans to write about the book. When Professor Spiegel talks, though, it is usually rather interesting. She does do a good job of providing historical context for the books, and presenting various critical analyses. She also has very strong opinions, and is not very open to interpretations that are contrary to her own. The biggest problem with the class is the grading system. She had a graduate student \"reader\" who she did not introduce until the day we turned in our first paper (even then she never told us his name, and he never spoke to the class), and who was a very nitpicky and difficult grader. We turned in our take-home exams in mid-April, and they have yet to be returned, and Professor Spiegel has said that we will not be able to pick them up (or our papers, which we turned in a week ago) until after everyone leaves to go home for the summer. Basically, we have gotten 1 assignment back for the entire semester, and most of us will probably never see the comments on the other two assignments--I think that's inexcusable for a teacher. If you're willing to put up with this, though, take the class; the books she chooses are wonderful, and it is entertaining to listen to her discuss them.\nWorkload:\n2 papers (a 5-7 pg. and a 8-10 pg.) and a take-home exam, which consists of three 2 page essays.\n"
        },
        {
            "course_name": "Politics and American Film",
            "review_date": "February 12, 2002",
            "review_content": "\nThis class is listed as a 4000 level class, so it should be pretty advaced with mostly seniors and grad students. It isn't. Unless you want to hear a room full of 19 year olds holding forth on what they liked or didn't like about some movie, avoid this class at all costs. It is ALL class discussion, and Spiegel makes little or no effort to shut people up when they are wasting time. Typical student comment. \"Um. I thought is was really interesting how when the guy... um what was his name? Anyway, the guy, he went into the thing, and um, yeah, I thought that was really neat.\" Multiply this by 100, and you have a typical day in this class. To top it all of, the papers were graded by TAs who sounded like they hadn't even bothered to read what we had written. Avoid this class at all costs.\nWorkload:\nOn the plus side, you only really have to watch the movies to get at least an A-. The final was incredibly easy if you had just seen the movie -- not even recently. No reason to come to class ever.\n"
        },
        {
            "course_name": "Politics and American Film",
            "review_date": "October 17, 2001",
            "review_content": "\nGod, this class was awful. Forget just seeing the films. Why bother when all you need to see is 2 of them to write the 2 papers. And class is a complete waste of time. The course says it's a lecture, but it's not. Professor Spiegel stands at the front of the room and says, \"what did you guys think?\" and then nods at the resposnses while muttering a distracted, \"that's interesting.\" Honestly, it probably would have been just as informative (or maybe even moreso) if she hadn't been there at all. I know it was a lot better when I wasn't there. To top it all off, she rushed into class 5 minutes late every day, didn't hand out paper topics until days after she promised them and just generally gave the impression that she put NO effort into the class whatsoever. If you are looking to blow off your senior year, Politics and American Film is a good way to do it. If you actually want to learn something about film, then look elsewhere.\nWorkload:\n2 short papers that can easily be turned out in a couple of hours and a final with identifications questions that are incredibly easy if you've EITHER seen the movie OR been to the lecture on the subject. There's a pretty hefty coursepack, but no real reason to do the readings in it. Much lighter than your average English class.\n"
        },
        {
            "course_name": "BC1201 First-Year English; BC3260 The Victorian Age in Literature",
            "review_date": "August 13, 2001",
            "review_content": "\nProfessor Spiegel holds a wealth of knowledge but it takes getting to know her to appreciate all she knows and loves. She lectures passionately and gives life to the novels one reads in her class. I was blown away with the Dickens lectures. What's not to like about a professor who spends her free time writing a book about the Breast in literature?!\nWorkload:\nThree papers, one a take home, spread out enough that it feels as if there is no work at all. But watch out, the reading load for Victorian lit. is about 10 books all over 800 pages.\n"
        },
        {
            "course_name": "BC1201 First-Year English; BC3260 The Victorian Age in Literature",
            "review_date": "August 13, 2001",
            "review_content": "\nProfessor Spiegel holds a wealth of knowledge but it takes getting to know her to appreciate all she knows and loves. She lectures passionately and gives life to the novels one reads in her class. I was blown away with the Dickens lectures. What's not to like about a professor who spends her free time writing a book about the Breast in literature?!\nWorkload:\nThree papers, one a take home, spread out enough that it feels as if there is no work at all. But watch out, the reading load for Victorian lit. is about 10 books all over 800 pages.\n"
        },
        {
            "course_name": "Politics and American Film",
            "review_date": "December 31, 1999",
            "review_content": "\nI may have no taste, but Speigel did not impress me at all. I've heard the class is something of hobby horse for her, which makes sense, as its a film class in the English department. If you're looking for a laughably simple class where watching the majority of the films on the syllabus, reading four articles and attending zero classes should get you an A- or better, you've found it. But if you're looking to learn, be intellectually stimulated, not fidget endlessly in every lecture you mistakenly attend, then you will be disappointed. There is a steady exodus of students from every lecture, people who can't take it anymore. I have nothing against an easy class, but somehow an easy class where you learn almost nothing seems like a waste of however many thousands of dollars one spends here. She's a nice woman, but her class could be a lot better.\nWorkload:\nTwo papers (easy), a final (very easy). Two course packets, but just wait till the final and photocopy someone's, because she will tell you exactly which four articles show up on the exam.\n"
        }
    ]
}