{
    "prof_info": [
        {
            "prof_name": "Andrew Finegold",
            "prof_id": 3545,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 24, 2013",
            "review_content": "\nI agree with the previous reviewer. Andrew Finegold was unimpressive.  I enjoyed the readings and discussions amongst my peers but I didn't think Professor Finegold added to them in a meaningful way. He brought little enthusiasm to class, didn't connect very well with students (and seemed to make little effort to), and overall came across as someone who did what he had to as instructed by his department chair/higher ups but didn't go beyond that. And after having a Music Hum instructor who did go above and beyond--who really taught with passion, put herself out there for students, and added personal issues of interest to the curriculum, I realized just how underwhelming Professor Finegold was. He wasn't terrible and you could certainly do worse, but that's not really saying much. And in discussions with friends in the same class, it was clear I wasn't alone in not thinking this. \nWorkload:\nAverage for Art Hum: class participation, two papers, midterm, final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 10, 2011",
            "review_content": "\nI must say that I'm surprised to read more than 1 positive review of Andrew Finegold. Granted, he's certainly not terrible as an instructor. But he's very wooden and does little to make the class interesting or engaging. If you memorize slides and regurgitate the information back on tests you should be fine, but he brought little creativity or enthusiasm to lessons. Compared to friends in other sections who had equally little background in the subject, I got much less out of art hum with Andrew Finegold.\n\nWorkload:\nPretty standard: midterm, final, 2 papers. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 12, 2009",
            "review_content": "\nIf you get the chance to take Andrew's section, go ahead and do it. He's extremely nice, down to earth, and probably the most humble instructor I have ever had at Columbia. He values students input, and really gives people a chance to discuss. I could always tell that even if he had something to say, if a hand was raised, he would immediately call on that person to speak. Truly an outstanding man.\nIn terms of teaching, he is very knowledgeable of all of the readings, painters, architects, and even some of the background stories behind sculptures or other works. I enjoyed how he added several comparisons to the core artists, something that a lot of other sections don't really do.\nThe class itself is pretty straight forward. You need to memorize a lot of images, but its usually not that bad. Andrew grades pretty leniently, and always gives encouraging remarks on the papers. \nI learned a lot in this class, and it wasn't really that difficult. That pretty much sums up an amazing class.\nWorkload:\n3 papers (3-5 pages), 1 midterm, 1 final, a few short quizzes, and a lot of in class participation. Museum field trips are required (2 when I took it). They were awesome, though, so don't worry.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 19, 2009",
            "review_content": "\nUnless you want to be spoonfed art history that is boiled down to its bare essentials, do not take Art Hum with Professor Finegold! While he is a nice and approachable teacher, I find that he pitches the class level at a level far too low for anyone with any art history experience. While this makes for a comfortable and interesting class for people with no background, each two hour class quickly becomes pretty drab for anyone else. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 15, 2008",
            "review_content": "\nReally very straight forward and nice guy.  I have absolutely no background in art but he will tell you all you need to know for the papers and midterms.  Just take decent notes and the rest is memorization and regurgitation.\nWorkload:\n3 papers total 40%, 20% participation, 5% quizzes (there are like 2), 15% midterm, 20% final.\n"
        }
    ]
}