{
    "prof_info": [
        {
            "prof_name": "Perry Mehrling",
            "prof_id": 328,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 17, 2016",
            "review_content": "\nThe course is not bad, but be aware that Prof. Mehrling teaches his \"money view\" which is not well-known yet. It clearly goes beyond its goal of \"being abled to understand almost every financial article on the Financial Times\". You can feel though that the content taught still needs some development and refinement in comparison to standard economic/finance theory like IS-LM or CAPM.\nAttendance is not necessary, because the material provided online is very good.\n\nWorkload:\n3 extensive, but generously graded Problem Sets, a Midterm and a Final.\nThe amounts of (unnecessary) readings is insane, probably something around 1200 pages that are very complex and not really important to understand the theory but there are reading identifications in the exam.\nOverall grading is on a curve.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "October 12, 2016",
            "review_content": "\nThis class is terrible. Like another has posted, I don't understand how this man has a silver nugget. There is almost no structure to the class. There does not seem to be any purpose to it. Further, Mehrling seems to just be using the podium to 1) Sell his shitty books that nobody cares about and 2) feed his massive ego. Seriously, every single lecture somehow leads back to how he figured it all out in his second book he wrote.\nHis covered topics are based off of readings from the 1920s and 1930s, which is not by itself unreasonable for the field of economics, except that he is attempting to apply them to post recession central bank policy which is unprecedented in action. This just adds to the idea that, while no doubt incredibly intelligent, Mehrling just \"teaches\" this class to feed his ego.\nDon't take this class, there's nothing exciting to learn. Read some financial newspapers and Google terms you don't understand. The reduced stress and time commitment will yield the same stated goal of the class: \"To give you the ability to read and understand Financial Times\"\nWorkload:\nSemi-weekly problem sets that seem to have zero relationship to the material covered in lectures.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "October 12, 2016",
            "review_content": "\nThis class is terrible. Like another has posted, I don't understand how this man has a silver nugget. There is almost no structure to the class. There does not seem to be any purpose to it. Further, Mehrling seems to just be using the podium to 1) Sell his shitty books that nobody cares about and 2) feed his massive ego. Seriously, every single lecture somehow leads back to how he figured it all out in his second book he wrote.\nHis covered topics are based off of readings from the 1920s and 1930s, which is not by itself unreasonable for the field of economics, except that he is attempting to apply them to post recession central bank policy which is unprecedented in action. This just adds to the idea that, while no doubt incredibly intelligent, Mehrling just \"teaches\" this class to feed his ego.\nDon't take this class, there's nothing exciting to learn. Read some financial newspapers and Google terms you don't understand. The reduced stress and time commitment will yield the same stated goal of the class: \"To give you the ability to read and understand Financial Times\"\nWorkload:\nSemi-weekly problem sets that seem to have zero relationship to the material covered in lectures.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "November 16, 2013",
            "review_content": "\nThis is an awesome class. The professor is incredible and one of those that make you love going to class. All the lectures are uploaded online and you just watch them while looking at the notes that he posted as well. Honestly, I go to class just to talk about awesome current events and discuss them in depth and maybe clarify some questions about the lectures. If you go to class and watch his lectures, you will get something out of this class and enjoy it. The only thing is that he is in love with him self, which I think I would too if I were him. All in all, if you are interested in the monetary system and the fed this is the place to be. \nWorkload:\nFew problem sets maybe four. \nMidterm, final, and read one book to write about for the final 20%. \n\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 13, 2012",
            "review_content": "\nThis was one of the single best courses I took at Columbia because of its relevance to our modern financial markets. While some of the material was difficult, it is well explained and Mehrling goes to incredible lengths to publish deeply detailed lecture notes which explain the entirety of the course in depth. \nSome of his lectures and the readings are boring at times because it covers history or abstract ideas. However, in the beginning of the semester Mehrling recommends that you read this things not to memorize them, but to get a better idea of what is happening. He will not quiz you on insignificant details and prefers to see that you are bringing the entire course together. On the exams, you can get both of the identifications of authors wrong, so long as you are clear in establishing why the ideas are important. \nOn the topic of exams, they were doable and I made a few careless mistakes, but still did very well. The midterm was out of 45 points with three sections. The first was compare and contrasting of like terms. Here Mehrling gives you a pair of terms and you are to explain their relation, importance, and difference by using examples, balance sheets, etc. The second section works on the ideas you've learned and is usually an interpretation of modern events through the lens of the models used in the class. This ensures that you actually understand the models and the component parts, not just memorizing formulas. They are not particularly difficult models either. The final section are identifications (2) of the readings and the authors. The identification part is pretty irrelevant, but it is more to see how you connect it back to the course.\nThe problem sets for the class are difficult because they do focus more on the math side of things which you don't usually cover in class so you generally need a group of people. You can submit one problem set for up to four people and TAs are good about helping clarify things. Additionally, his lecture notes and the Stigum reading explains concepts more in depth.\nOverall this was a very good course and I enjoyed it thoroughly. If you put in the work, you will do well. However, many people didn't and so the average on the midterm was 27.5 out of 45. This is normal according to Mehrling and there is a curve which is rather generous. Still you do need to understand his approach which is rather visual (using balance sheets) but he explains it clearly. I would recommend this class to anyone who wants to learn about the financial world and learn to talk about the markets as well. It is tough if you don't work, but if you do, it becomes actually relatively easy.\nWorkload:\n4-5 problems sets: difficult, but manageable and count for relatively little. They are helpful in getting you to understand the concepts as applied to the real world.\nMidterm: 1) Term juxtaposition 2) Balance sheets and model application 3) identifications. Easy if you study, very tough if you don't. Go to lecture, go recitation, read the lecture notes to study and use common sense. Spell out everything you are doing clearly and you will do well or at least get a lot of point that you would have otherwise missed.\nFinal; same as above plus a book report. You are given a choice of books and then on the exam there is a choice of questions from the books to write an essay. You can bring the book in with you so this is easy if you prepare properly.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 25, 2009",
            "review_content": "\nProfessor Mehrling is one of those professors who leaves you with a feeling of disappointment, because you feel they -could- have been great, but were admittedly sub par. The quality of his lectures fluctuated wildly. Sometimes, they were so dull that half the auditorium was falling asleep and/or just not coming (after a particularly long segment in the 1st half of the semester) but sometimes they were fascinating. I went to every lecture and can tell you that most of the first half of the semester will be painful and dull, then the second half will be much more interesting with only the occasional extra-boring lecture. If the professor reads this, I would recommend that he critically evaluates the visible class responses to some of his lectures and revamps them so that the quality is more consistent.\nThe workload is heavy. There aren't a lot of problem sets, but when you get to studying for the midterm, you'll be buried in paper. Mehrling's midterm is -very- late in the semester, so not only was the overwhelming majority of the lectures on the exam, but also nearly all the outside readings, and the majority of the Stigum reading. A decent midterm grade requires mastering well over a thousand pages of very tough material. There is just so much of it that I felt confused as to what was relevant for the exam and what was not. The Final was similar but had the add-on of an essay on one of two books and didn't have that much extra material.\nMehrling is trying to teach a \"way of thinking.\" This is a very big goal and he doesn't really live up to it. Many people I spoke to felt that the class was a waste, and I can see why. We were so buried in material that we didn't really process anything and there was virtually no practical application to what we learned. This is not what students generally expect from a class called Money and Banking. \nI wanted to write this review before I got the grade, because I feel that if it was good, I would feel compelled to give a more positive review and vice versa. The grading on the midterm was alright - one of the TAs was nitpicky, the other was lenient, so it balanced out to something normal. The class is gigantic, so Professor Mehrling made the TAs grade everything.\nOverall, I would not recommend this class to anyone except a person with a very empty, light schedule. Don't be deceived by the first class - this course is not easy, not that consistently interesting, and bound to disappointed the majority. If none of this has deterred you, however, then good luck. \n\nWorkload:\n4 problem sets, weekly outside readings (LONG and only reviewed in recitation), weekly Stigum textbook readings (tough to read but occasionally helpful), Midterm that covers almost the whole semester, and final that covers only a bit more but includes an essay about a book (Mehrling gives two choices). Much heavier than it seems initially. \n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "July 26, 2008",
            "review_content": "\nI quite enjoyed this class. Mehrling was so excited to have a real life economic crisis going on while he was teaching this class.  He goes into really intricate detail sometimes, so the TA sessions help you grasp the big picture. If you put in the effort, this is not a complicated class. You don't even have to do all of the reading.  Pay attention to what he likes to say in class and make sure you understand those things because they will be on the test.  It is interesting material.  \nWorkload:\nProblem sets every two weeks. Midterm. Final which includes and in class essay on a supplemental reading.\n"
        },
        {
            "course_name": "Financing Democracy",
            "review_date": "June 10, 2008",
            "review_content": "\nThis was easily was favorite course in two years at Columbia. As an econ major this is a perfect class for anyone with any interest in finance and current events since this course covers different arguments concerning the financing for major political issues today such as healthcare, social security, and higher education.  I learned a lot and the workload was very manageable to the point that I was just able to enjoy the material presented without being bogged down with endless problem sets.  The class is set up as a lecture/seminar hybrid and Professor Mehrling really takes that to heart since the first class of the week he lectures on the topic of the week, and then the second class is taught by a group of 4 or 5 students as a presentation on the book selected for that week.  So there is one required book assigned per week but the only actual required work are the two presentations for the semester which each count 25% of your grade.  The last 50% goes to the 10-15 page term paper, which for me was not as stressful as other papers since I was already thoroughly interested and invested in my topic (using human capital contracts to finance higher education).  Overall, Professor Mehrling definately knows what he's talking about and I was fortunate to learn what he had to say about these hot financial topics.  Great course!\nWorkload:\n2 presentions with a group of 4-5 people (25% each), one 10-15 page term paper with presentation on it (50%).\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 21, 2007",
            "review_content": "\nWhat can I possibly say about Perry Mehrling? He is the among the worst professors I've ever taken at Columbia, which might explain why he's been an associate professor for over 16 years. Don't get me wrong: Mehrling is REALLY nice and wants to teach his course in a way that's easy to understand and in touch with the current situation. That's great but as a lecturer, he is shockingly unclear, no one learned anything (students were asking about basic concepts and definitions during the midterm review, like what is an FRA,) and he talks down to his students like they don't know anything about economics. Mehrling's lectures are comprised of the following format: discuss an article from the FT, which he loves (ok, interesting,) bring up some sweeping statement about money and/or banking that's so general that it's completely inarguable and use the latter hour to utterly confuse the class with simplistic terminology, abstract concepts that are never explained, endless balance sheets, and stupid diagrams. \nMehrling wants to teach an entire class using only balance sheets and no numbers but this is ridiculous: how can you teach students about an FRA or CIP without showing the formulas to compute them? The only formula Perry ever brought up in class and on the homework was WRONG, in that it wasn't time-adjusted so all the answers would turn out to have negative interest. I had to go to a Catalan economics website to get the right one. That, essentially, sums up Perry as a teacher. The mean on the admittedly easy midterm was 60%. 60%! The only saving grace of the class was that the books assigned (Stigum's Money Market and a choice between a book on hedge funds and one on global finance) were fantastic. I'm much the better for reading them.\nWorkload:\n4 problem sets, which are not that easy, midterm and final which are confusingly written but essentially simple to write; a LOT of reading.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 15, 2007",
            "review_content": "\nThe class was hard, but it was a very good class.  I think a lot of people thought it would be an easy class, but most were very supprised to find out they had no idea what the midterm was asking after missing the whole first half of the semester.\nUnlike some professors, Prof. Mehrling is interested in what takes place in the real world and could care less about academic theories that only work in the Economics Department.  His class is very focused on real life money and banking.  \nDoing all the readings is a good idea, but you can figure out which ones you really need to read.\nWorkload:\nsame as below\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 02, 2007",
            "review_content": "\nProf. Mehrling's class was great.  Highly conceptual and idea driven, no real number crunching, lots of writing.  If you want a class where you're doing a lot of math, not a good one.  If you want to understand how banking works in an innovative and updated way, go for this class.  Probably the best Econ class I've taken.  Mehrling is affable, easy-going, and his lecture notes are excellent.\nWorkload:\nvery reasonable, four problem sets due every two weeks (graded check minus, check, check plus), one midterm, one final of about the same length plus an in class essay on a supplementary reading for the final.  As long as you actually understand the material, the work is easy.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 01, 2007",
            "review_content": "\nI was very impressed with Professor Mehrling.  His knowledge of the Fed and the monetary system is unbelievable; I never thought I would learn so much about these topics as I did from him.  He did a good job of breaking down some very complicated material and made himself very available to answer student questions.  The outside readings were sometimes annoying and could have been covered more in class but ultimately were helpful in understanding the course material.  Recitations were not helpful or worth attending.\n \nWorkload:\n1 outside reading per week, midterm, final that includes an essay on a book.  Midterm was not too bad, final was more difficult.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "November 16, 2006",
            "review_content": "\nProf. Mehrling definitely knows his material inside out. He is also a good lecturer. He encourages questions and does the best he can to ensure that any ambiguities are cleared up. I would recommend this class because it provides a great understanding of the banking system and the Fed.\nWorkload:\nReading: a text which is not required, and so I never used it and supplementary articles which are required and you are tested on; 4 problem sets ( this was his first time giving problem sets so they weren't always clear, but graded very fairly); Midterm was a bit difficult, but graded fairly and final which includes an essay on a book we were also required to read.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "October 25, 2006",
            "review_content": "\nProfessor Mehrling is truly a nice guy, obviously veru capable of teaching the class and respond to question. There is a notion of \"ease off\", but the exams are rather difficult as opposed to what we actually learn in class. The reading assignments , although interesting are not reviewed in class and are hardly mention. Yet, the student have to reading identifications in the exams which is hard to follow with having a hint of where it would come from(the are not discussed, but with the TA). The information is disorgenized, so it's hard to follow up. The good point are that we do have very orgenized lecture notes posted which are in accord with the class lectures and the Mehrling which is, again, a good professor and approachable. If he would orgenize the information and direct it more towrds the exams the class would be more productive. \nWorkload:\nMidterm and Final exam. straight forward aside from the identifications of the readings. \n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 18, 2006",
            "review_content": "\nProf. Mehrling is simply excellent.  I don't know what some other students were talking about, but his lectures were interesting, engaging and informative.  The lecture notes were also excellent, and posted after every class.  The Stigum and Mishkin aren't really useful, as I seldom opened them, but the lecture notes were evry useful for studying for the midterm and final.  Overall a great class, I learned a lot.\nWorkload:\nPretty small, no problem sets, a decent amount of reading, although the textbook reading isn't really necessary.  The supplemental readings are necessary as we are tested on them.  One midterm, and a final which includes an essay on a book.\n"
        },
        {
            "course_name": "Topics in Money and Finance",
            "review_date": "May 07, 2005",
            "review_content": "\nThis is a great class. I recommend it to anyone interested in a career in banking. The readings are good, and he is fully engaged in the topics discussed. The class is small and the focus is on discussion. It certainly helped me with finance interviews. \nWorkload:\npresentations and final paper. Pretty easy workload\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "August 08, 2003",
            "review_content": "\nhe's a nice guy. BUT he cannot teach seminars for his life. i took his money and banking class. it was an experience. the material was pretty difficult but it was more memorization rather than ever encountering formulas or math. if you have an interest for econ. it's a good class to take. but make sure you're going to be able to sit through it all. if you don't like econ so much, you will get bored. as for his seminar class, he hadn't taught a seminar in a few years. he was unable to generate class discussion... but that was good because no one read the books anyways. the seminar books are many. it cost about $400 for all of them. but he says you don't need to buy them all. you just need to buy the ones for your presentation and seminar paper pretty much. suggestion-try to get your books for your presentation and paper on the same topic. it'll save you time and money.\nWorkload:\nseminar-2 presentations, one seminar paper and presentation on paper\nmoney and banking -midterm and final\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "February 01, 2003",
            "review_content": "\nMehrling is a really nice person and knows what he is talking about really well. The way he explained the topic (the diametric opposites) is very useful in understanding the course and applicable to most of it once you get the hang of it. The Stigum book is horrible, I did not read a page of it. Mishkin readings are not always very relevant though they are interesting and easy to read. Overall I think this was my favorite econ elective and helped me internalize concepts that I had memorized in micro/macro but did not quite have a feel for.\nWorkload:\nnot very heavy. lecture notes very useful. \n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 21, 2003",
            "review_content": "\nMerhling is a shockingly unclear speaker and writer; most of the class could not follow his lectures or the lecture notes he posted for us. The TAs were not helpful at all; one even admitted he hadn't done the reading and actually asked the students factual questions at a recitation so that we could fill him in on what he neglected to read. Even simple definitions and his beloved \"diametric opposites\" are never clearly stated. The textbooks are long and won't help on the exams or help you understand the lectures; only the supplemental course packet has interesting and useful content.\nWorkload:\nNot bad--no problem sets! Entire grade based on the 2 exams, which are short essay and definition format (hard but graded easily). The final also has a book review on an easy yet interesting book.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "January 08, 2003",
            "review_content": "\nI wish I hadn't taken Money and Banking.  This class is miserable - Professor Mehrling takes a broad topic which should be interesting, the workings of financial markets, and completely butchers it to death.  The format of the course is choppy on all levels - the textbooks are either useless (Mishkin) or dense and impossible (Stigum).  Add to that lectures which don't flow very well (if you even bother going, which you probably won't) and you have a class with 90% saying \"what is he talking about?\"  If you have any interest in economics - don't take this, unless you want to leave hating the subject.\nWorkload:\nNo problem sets (which turns out to be bad, besides the practice midterm you really have no idea what he's expecting). Midterm that is sort of fair, final that is overly difficult and doesn' t really test your understanding. \n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 25, 2002",
            "review_content": "\nThis course is great if you want to learn about the banking system. There are like 3 texts that he requires you to read. Don't waste your money and just photocopy the relevant materials as you will not be using the entirty of any of the books. There's a lot of reading. You have to do a book review on the final. He post's lecture notes online, which is helpful, but I would suggest actually going to lectures in person, with a large cup of coffee as it is very difficult to get through his boring lectures. The TAs hardly spoke English and some were awfully condescending. \nWorkload:\nLots of reading, most of which is supfleruous, a midterm and a final\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 08, 2002",
            "review_content": "\nExtraordinary. Mehrling's lectures are pure gold. He makes the subject fascinating by applying creative frameworks to every topic. The course is a little short on the technical analysis of transactions, but the theoretical understanding is very sound. The approach he takes is particularly effective because of the nature of the subject. If he just presented all the institutions in the banking system and said \"they exists, this is how they work\", it would be very confusing, and difficult to digest. Mehrling gives historical and analytical methods to view the banking system, and the result is a terrific course. Take if you're an econ major. If you're not, take it anyway. Macro and Micro are required, but they're not actually necessary. the class pretty much stands alone\nWorkload:\nLight. Most of the course is based on his lectures. go to lecture.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "October 29, 2002",
            "review_content": "\nWhoever wrote that this class is an easy A, and that the tests do not need much preparation DID NOT take the same course I did. If you are perpetually lost in class, you cannot expect to do well in the tests. This guys class was very interesting. It is a shame that his tests do not reflect what he actually teaches in the class. Having said that, if you manage to grasp the basic ideas in the end, it really gives you a good idea of how the banking system and financial markets work.\nWorkload:\nMidterm and final (challenging).\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Mehrling is a really cool guy, and I found his class to be a lot of fun. His stories and jokes are really good too. You should definitely take this as an econ elective if you're a major because this is one of the few good classes in the department.\n"
        },
        {
            "course_name": "Economics of Money and Banking",
            "review_date": "December 31, 1999",
            "review_content": "\nThis guy makes NO sense in class, and to really know what he's talking about you need to be a money market professional. That said, if you can tolerate being perpetually lost in class, he's not a boring lecturer, and it's a pretty easy A.\nWorkload:\nWhat workload? A midterm and a final, neither of which require much preparation.\n"
        }
    ]
}