{
    "prof_info": [
        {
            "prof_name": "Lynn Garafola",
            "prof_id": 1650,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Dance History ",
            "review_date": "September 03, 2013",
            "review_content": "\nLynn is a wonderful asset to the dance department and for anybody with the slightest interest in dance, she is THE person to study with.  She is knowledgeable and extremely accessible.  I do not understand how she finds the time to prepare for class in the manner she does.  She spends absolute ages reading and editing everything we write and is always willing to meet with students outside of class/office hours.  If you show any interest in the subject and that you take your work seriously, she can be the most wonderful teacher at the university.  Yes, is you are lazy and cannot write, she will tell you so.  But if you want to improve your writing and critical thinking there is no better person with whom to work.  \nWorkload:\nHigher than normal if you apply yourself\n"
        },
        {
            "course_name": "Balanchine/Music and Dance",
            "review_date": "June 05, 2007",
            "review_content": "\nLynn Garafola is a rare asset to the Barnard Dance Department and one that I treasure greatly.  Granted, she assigns a great deal of reading and viewing assignments and the research paper can be daunting after you have your first meeting with her (she gives you enough ideas for an dance anthology).  Like many professors at Columbia/Barnard she is brilliant, but expects a great deal of dedication from her students.  She has a knack for memorizing EXACT dates and other historical information and will not hesitate for a moment to correct you in class or in your papers (which will be returned to you in a timely manner but covered in copious amounts of red ink).  Her lectures might get disjointed at times, which I believe she knows, so she relies a great deal on participation to steer the class.  Be prepared to watch lots of videos thoroughly discuss them.  She favors students who are serious dancers who know dance terminology and history, but tries to cater her lecture to the greatest common denominator.\nThe ticket to getting that rare A?  Passion - you must be 100% dedicated to the quality and historical accuracy of your papers (and in-depth knowledge of the inner workings of the New York Performing Arts Library is a necessity. You will most likely spend all of your times researching there as the materials are non-circulating.) She excels at teaching the individual: the more meetings you have with her the better you work and the higher the grade.\nWorkload:\nPer class: reading (~50 pgs.) and watching (1-2 hours) ; 2-4 live performance reviews; misc. research assignments; 1 midterm (8-10 essay); and 1 final and/or research paper (15 pages minimum each)\n"
        },
        {
            "course_name": "Senior Seminar - 2007",
            "review_date": "February 27, 2007",
            "review_content": "\nProf. Garafola is unique. Consider yourself very lucky if you can take her class, and even more lucky if she happens to be your advisor. When you hand her a paper, she does brings it back filled with comments - those however, originate from her deep commitment to her students. Without a doubt, she has been my best professor at Columbia (or Barnard...). But more than that, i feel that her academic as well as personal input contributed immensly to my college expereinece.\nWonderful, beautiful, smart, genuine person!\nTake all that she gives you - she has so much to offer!\nWorkload:\nShe expects from her students only what she expects from herself - allot!!! Satisfying though...\n"
        },
        {
            "course_name": "History of Dance II",
            "review_date": "December 17, 2006",
            "review_content": "\nLynn deserves more credit than these CULPA reviews give her. She does expect a lot from her students, and the course requires a lot of work. If you're looking for an easy class, this isn't it. But if you are someone who is interested in the history of Western European dance (ie, the history of ballet and modern dance), and if you have a personal interest in concert dance, then this is a class that you must take in order to have a solid understanding of the dance world as it exists today. \nShe grades papers thoroughly and returned them in a timely manner -- our papers were done in a day or two and mine was covered in comments -- clearly, she read the essay before she decided on a grade. I found her accessible during office hours and very willing to go over potential paper topics with me -- she pulled books off her shelves to give me to help me in my research. This class made me want to become a dance major because I realized how much there is to know and that Lynn is the person who knows it inside and out. \nIf students don't like that she is an exacting editor, I don't know who their professors have been. No one wants their professor to notice typos in a footnote, but at least they are looking and they care about your precision. The professor is a compassionate, kind, caring, very very intelligent, accessible woman who has a lot to offer if you can manage to put your ego on hold for a semester.\n\nWorkload:\nTime-intensive take home midterm, 12-15 page paper, final exam. \n"
        },
        {
            "course_name": "First Year Seminar: Images of the Body",
            "review_date": "May 09, 2006",
            "review_content": "\nHonestly, I read the CULPA reviews before signing up for the seminar and thought to myself, \"She can't be that bad!\"  She was worse than I could have ever imagined.  If you decide to take a class with Lynn, be prepared to suck up big time on the first day of class and claim prior dance experience, since she will decide your grade on the first day.  There are plenty of interesting first year seminars offered each year, do not waste your time with Lynn.  Images of the Body offers a really interesting topic with great readings, but being in a classroom with this woman for 2.5 hours every week was the worst academic experience of my life.  As said in past reviews, she is an expert on dance history, and she knows it.  At many points it seemed like she was out to blatantly insult 16 first-years.  Either she would ask elementary-school questions (\"Ok girls, do you know what a run on sentence is?\") or reject any of our opinions that did not match something she read in a book.  Plus, many of her opinions tend to be simplistic.  Most of the class was reviewing plot summaries of books read, sometimes she would even ask what happened on a certain page of the book.  In terms of papers written in the class- the prompts hardly have anything to do with the readings which makes them very difficult, and once you write the paper she marks it up so much and writes in her ideas of what you should have said, so it is no longer your original work.  I don't know how a dance history class would be with Lynn, but in terms of first-year seminar, trust me, it's not worth the time or frustration.\nWorkload:\n1 Book or less every week, you don't have to read every one because the 4 papers are only on some of the books.  Very tough grader.\n"
        },
        {
            "course_name": "Dance History II",
            "review_date": "September 16, 2005",
            "review_content": "\nIt doesn't need to be stated again, since it's been said in almost every review so far, but hey, just for the heck of it: Lynn Garafola knows a ton about dance. There are few people who match her level of dance scholarship. This trait alone guarantees that you will learn alot, because she can throw so much information at you that you can't help but absorb some of it. Granted, she assigns more reading than it is actually feasable to do, but it's all worthwhile and she doesn't really check to see if you've done it. She is great at communicating ideas that she wants you to learn, but her teacher-to-student relationship is less than great for most people (though I found her to be very good). \n In class, she can sometimes be a little rough.  It's true, she doesn't pad anyone's ego--but what that really means is she doesn't let you say things that are stupid and get away with it. If the comment is simply not very good, she doesn't pretend it is. She could work and not making people feel stupid just because they make a stupid comment, but on the other hand, if more people took the stuff seriously, they wouldn't make stupid comments so often. And if you honestly make the attempt to talk to her outside of class, go to her office hours, she will try and help you understand what you need to do to do better in the class. But no matter what you do, she will always grade hard. It is honest grading, you can't argue that what she says is bad is not bad, but she is definitely on the tougher side.\nA lot of people who take the class, Dance History, think that because it's a dance course, it will be easy, when in fact it's as challenging as any other history course. So don't think of this as an easy-GPA-booster-relaxation class. If you keep that in mind, you should do fine.\nOverall, the course was great, and the instructor is very good (though clearly has her down points). \nWorkload:\nTons of reading, writing was reasonable, and final was ridiculously long, but i assume she adjusted her grading appropriately.\n"
        },
        {
            "course_name": "Dance History II",
            "review_date": "August 30, 2005",
            "review_content": "\nLet's start with the obvious. Lynn Garafola knows a plethora of factual information i.e. dates, terminology, timelines, etc. She is very well read and passionate about the subject matter. With credit given where its rightly due, I must move on to the important details that can make or break a professor's overall effectiveness. I believe that Lynn is a positively awful professor for the following reasons: \n1. She allows you to speak openly in class, but if your opinion is not perfectly in sync with her own, she makes you feel inferior. How is telling the professor what she wants to hear going to benefit the class from an intellectual standpoint?\n2. She is always quick to criticize your faults, but slow to recognize your potential. At the collegiate level we do not require babying, but human beings require at least some positive reinforcement to move forward in their work. \n3. She does not grade objectively. It doesn't matter how well you support your argument; if she doesn't like your central idea or your writing style, she'll penalize you. Severely.\n4. She creates an imaginary line between herself and the students. This line cannot be crossed or even approached. Her teaching style is elitist, pedantic, and purposely intimidating.\nOther students are entitled to their opinions, however, I stand behind these observations 100%. And just for the record, I am a dancer. \nWorkload:\nMost of the readings were worthwhile, but she assigned an excessive amount. We wrote a few papers, all of which were graded harshly. The midterm was take-home and the final exam was mostly memorization. \n"
        },
        {
            "course_name": "Contemporary Choreographers and Their Works",
            "review_date": "December 29, 2004",
            "review_content": "\nA pretty good class.  Professor Garafola clearly has a lot to offer, and her extensive knowledge really brought in a lot of insight.  She has some great stories too.  Some of the actual choreographers we covered were a little weird - this class isn't about strictly ballet or modern choreographers, but it was all pretty interesting.  If you don't have a background in dance though, I'm not sure how interesting the class would be.  The setting was nice - my class only had about 6 people in it.  Professor Garafola is nice, although sometimes she seemed a bit grumpy, especially when her videos didn't work.  And she's actually a bit of a hard grader.\nWorkload:\nA good amount of work.  Reading assignments and watching videos in the media center almost every night.  Two papers, a short oral presentation, and at the end of the semester you can choose either a take home final (mine consisted of 3 essays) or a final research paper.\n"
        },
        {
            "course_name": "Balanchine, Dance History",
            "review_date": "December 15, 2004",
            "review_content": "\nProfessor Garafola embodies the saying \"Train hard, fight easy.\" Although she is one of the toughest professors I have ever had, her standards go beyond what is expected of students in many graduate level history programs. If you get it right with her, you know your stuff. From writing style, to typos in footnotes and bibiographies, to quering sources and not relying on printed facts as accurate, garafola pushes students to think with accuracy. Although her standards are rigorous, Garafola also appreciates a creative and innovative approach to the work. She is not asking students to spit back the opinions she put forth in the classroom. Garafola really knows her stuff, and demands the highest standards in her class. Once it is done, the class is really worth the work!\nWorkload:\ngarafola expects graduate level work of her students. the reading is intense and the viewing assignments often seem impossible. Again, if you manage to get it all done, you'll be set well for future courses.\n"
        },
        {
            "course_name": "Dance History II",
            "review_date": "October 10, 2004",
            "review_content": "\nI, too, am not a dancer. I took this class simply to satisfy a requirement, hoping that it would be an interesting survey course, like Art History. It is true that Professor Garafola is very well-versed and highly knowledgable about her field. She certainly seems nice enough in class, but she takes herself way too seriously, as if she is the end-all and be-all and if you really don't think that Dance History is the MOST important thing in the world, boy do you have your priorities screwed up! \nDuring her office hours, she was also highly unprofessional by taking out her own issues on a student. She suddenly went off on a total tangent about the legitimacy of her profession and dance history in general. She is a ridiculously hard grader, nit-picking at EVERYTHING as if to really try to convince you that yes, it really is THAT important. \nShe assigns a lot of reading, accompanied by mandatory viewings of specific performances which you can get in the media center. If you are a commuter, this is the absolute worst, since you can't take any of the performances home with you or find them anywhere else besides for Barnard media center. Hence, you are stuck on campus for hours watching these performances. As for talking to her about it, she is not sympathetic at all: she doesn't care. Same goes for group projects. \nIf you're a dancer and happen to be one of her favorites, you'll probably love this class. Otherwise, it's sooo not worth it.\nWorkload:\nTake home midterm and final, watch performances, lots of reading, papers.\n"
        },
        {
            "course_name": "History of Dance Part II",
            "review_date": "May 03, 2004",
            "review_content": "\nI want to start off by saying that i am NOT a dancer. That having been said, this was sometimes a handicap in Garafola's class. While she is very sweet and has students from the class who are dancers demonstrate nearly every step, I would definitely have appreciated it more if I had any clue what I was talking about. \n      Professor Garafola really knows her stuff. She has been in the business for years, first as a dancer and then as a professor in its history. Classtime is spent listening to her read from a series of notes (which are very well written but EXTREMELY esoteric- the class does not really have a flow) and watching supplemental videos. Just show her you're trying and you'll be okay. \n        Just a caveat- Professor Garafola LOVES to hear herself talk. She cannot answer a question in less than essay-legnth, and always with very superfluous language. It was still an interesting class and I actually  learned a lot about Dance.\nWorkload:\nIf you try to keep up with the reading and videos, you'll get swamped. Just go to class, browse the readings, ask some questions and youll be fine. She is VERY VERY VERY picky with grammar on papers and tests; the midterm was pretty straightforward and the final was a series of essays. She REALLY likes those essays. \n"
        },
        {
            "course_name": "Exploring Dance",
            "review_date": "December 19, 2003",
            "review_content": "\nI thought this course, as well as the professor, was great. I had practically no experience in dance, and I took a lot from this course. However, I also think that if I had had some experience I could have taken even more, so it's a great course for beginners and advanced students alike.\nThis class is a lot smaller than her Dance in New York class (11 students compared to 35), so I didn't notice any of the \"playing favorites\" which pervades her other reviews. Lynn is extremely knowledgeable in her field, and I thought that made her very interesting to listen to when she went off on tangents. I guess I can see the other reviewers point of view; if you don't have a strong interest in dance, Garafola might not be a good professor for you. Not that you won't gain anything, but she teaches as if all her listerners are dance majors, so if you're not, you (like me) might not understand what she is talking about half the time. But that didn't keep me from learning a lot from her and the course, so I fully recommend her.\nAs a side note, I think it's true what they say about culpa: it's mostly only those who had strong feelings about the class posting reviews. So Garafola may not be great for everybody, but she is definitely not as bad as most of these reviews make her out to be.\nWorkload:\nHigher than it should be for a 3 point course, but not too bad. The final was riduculously long (10-13 pages), but very interesting.\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "December 11, 2003",
            "review_content": "\nI agree with the prior review: this class was an utter waste of time.  The performances themselves were highly worthwhile, but I doubt that the painfulness of the class made up for it; I had to consistently fight to stay awake.  Even students with fairly strong dance backgrounds who do not happen to be one of the professor's clear favorites are likely to find themselves feeling like they're listening in on someone else's private conversation.  If you want an \"in\" in the dance department, feel free to take this class, however for everyone else?   I recommend that you get the list of performances and go on your own.  Spare yourself the tedium or take it with another professor.\nWorkload:\nMore than one might expect: four relatively short papers and a lengthy take-home final.  There's reading, but I highly doubt that the majority of the class even bought the course pack...\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "December 07, 2003",
            "review_content": "\nThis course, which had the potential for being a very good class, was a total waste of my time.  Although I enjoyed the out of class performances, I took very little away from the class.  Professor Garafola has obvious favorites in the class, which often felt like a private conversation between her and the dancers in the class, leaving the majority of students completely left out.  Class had little structure- Professor Garafola enjoyed going off on tangents, and the lectures often seemed to have nothing to do with the reading. When she did follow some kind of lesson plan, she read straight off her notes in a voice that was so obviously forced and fake that I found it almost unbearable to listen to her. Although Professor Garafola is obviously knowledgeable about her field and has a lot of experience with it, she did a horrible job of imparting that knowledge upon her students. I would not recommend this class to anyone who's not a dancer- someone actually made a comment in class that \"you have to be a dancer to appreciate dance,\" and Professor Garafola nodded along. A lot of students LOVE Professor Garafola (and she really is a good person), but think very carefully before taking this class. Consult others who have taken it to see what they say, but in my book, it's not worth your time or the extra money it costs to take it.\nWorkload:\nWeekly reading assignments, four papers, and a tough take home final. \n"
        },
        {
            "course_name": "Dance History II",
            "review_date": "September 25, 2003",
            "review_content": "\nI learned a ton in this course.  Lynn has an impressive command of the material.  She does tend to read her notes as she lectures, which is a major drawback, but all in all the material was interesting and well presented.  I do not think any dance major should graduate without knowing this material.  I also became a better writer in this class.  My papers were covered in comments (mostly negative), but not stylistic discrepencies.  She is an editor and she knows her stuff.  Also, lectures are supplemented nicely with videos.\nWorkload:\nnormal for a history class, you can get away without doing a lot of reading\n"
        },
        {
            "course_name": "Dance History ",
            "review_date": "August 28, 2003",
            "review_content": "\nThe Columbia community is very fortunate to have Lynn working with its students.  Yes, she expects a lot, but she gives even more.  She is able to answer any question you may have, and if she has an extra ticket to a performance, it is not uncommon for her to invite one of her very dedicated students.  I would strongly reccomend any of her classes to both dancers and non-dancers.\n"
        },
        {
            "course_name": "Dance History II",
            "review_date": "August 04, 2003",
            "review_content": "\nI thought she was a very organized and extremely knowledgeable, and can answer any question you can think of.  She is very approachable.  She expects a lot, but is willing to work with you if you are having problems.  Overall, I think she's one of the best professors I've had here.\nWorkload:\nHigher than normal.  \n"
        },
        {
            "course_name": "History of Dance II: Renaissance to the Present",
            "review_date": "May 22, 2003",
            "review_content": "\nwhere do i even begin? i hated this course. it has nothing to do with the professor though, because i do think she is a very nice woman. yet, to be considered a good professor you have to be much more than nice. she wasnt helpful during her office hours, played favorites, had biases, and could not condense the material to a manageable level for her class. i truly felt like she graded not on the quality of the work but on how much she liked a student. i often thought she didnt even read our exams but just slapped on a grade. do not take this class unless you are a dance major and RUN from this woman. i did not learn anything i did not already know in this class. also, she rips your papers apart and then tells you that you cannot write. yep, she told me that i needed to work intensly on my writing--and im a published author. \nWorkload:\nnot bad. she assigns a lot of readings but you dont have to really do them because she summarizes it all in class. one midterm and a final, both are take home. one 6 page  paper and then a 12 page resarch paper. and then she just slaps a grade on you according to how much she likes you. \n"
        }
    ]
}