{
    "prof_info": [
        {
            "prof_name": "Jonathan Lawhead",
            "prof_id": 10609,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Metaphysics",
            "review_date": "May 07, 2012",
            "review_content": "\nIf you have a chance to take a section with Jon, you should take it.  He is without a doubt one of the best TA's in the philosophy department and is probably a better teacher than some of the professors.  I had him for metaphysics, the class wasn't my cup of tea, but jon did his best to make things interesting. His recitations were really free form, and he let us talk about pretty much whatever we wanted to. This could be kind of frustrating sometimes when we wandered off topic from the readings and material really far, but it was usually ok because Jon had interesting stuff to say about most of what we covered. He is obviously most well versed in the science related parts of philosophy, and he was a little weak in his presentation of the really historical or obscure stuff, but usually made up for it by helping us figure out the material together. If he didn't know the answer to a question, he would ask for help from the class and we would all talk about it until we figured out what the solution was together, which was really great. I learned more about how to actually be a philosopher in this class than in any other class. He seems to know a ton of stuff about a ton of things (especially physics and science), and his lectures were really great even though they were spontaneous (I think). His knowledge of science gave a nice contrast with the professor (Varzi's) really really abstract and disconnected musings on the subject. Don't get me wrong, I love Varzi too, the guy is really funny and approachable, but in a class like this it was nice to have someone to talk about the connection between metaphysics and science. Jon was great at answering questions in class and outside of class, and I learned the most out of trying to argue a point with him. He'll shoot down your ideas probably, but he does it in a way that doesn't seem mean or elitist, and you leave feeling like you have new ideas about the topic you were talking about. He probably wouldn't be that great for people who don't like to talk in class or like to argue, because he never calls on anyone. If people don't volunteer comments, he'll just keep talking (pretty much forever), but what he says is usually really interesting and he'll always listen to what students say and talk back to you. He gives you his own opinion on topics rather than just repeating what's in the book. Like other reviewers said he's really opinionated but it looks like he also really likes to argue about his opinions, so I always felt ok about bringing up objections to what he was saying. \nOh and he has great shoes.\nWorkload:\nMetaphysics was 2 take home midterms and a take home final. We were supposed to come to all the recitations too but I don't think he actually cared.\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "May 29, 2011",
            "review_content": "\nOh where to begin with metaphysics...\nThis class was hilarious, pointless, challenging, and useless all at the same time.  In fact, the only way that one can sum up the absurdity of this course is to look at the absurdity of the professor. Collins exhibits unexpected strengths and unexpected weaknesses. The most apparent thing about Collins is his utter lack of professionalism. This lack manifests itself in many way including but not limited to: the notable absence of any syllabus that actually tells you what you are going to learn in the course (for the trolls out there, know that there is a 'listing of readings and assignments' but it is updated as we go which means you never know where the course is headed), Collins' utter rejection of the idea that he needs to put any of the topics we discuss in context (i.e., so that you could see where a particular debate fits in to the larger field of philosophy), and the lack of a grading rubric, a set number of assignments, or a description of how much each assignment will affect one's grade. In my opinion, Columbia professors should be allowed to teach their classes as they wish provided they meet certain a criteria of professionalism which Collins simply does not possess nor demonstrates any desire in possessing. This unprofessionalism leads to all sorts of frustrations from not knowing how you are doing in the course to being bullied in class for offering an opinion that is wrong and (in Collins' opinion) stupid.\nSo now that we have gotten why you should not take this class out of the way, let me pander to those who really love Collins so that we can really understand why this professor is so contentious.\nDespite all of his unprofessionalism, Collins does do a tremendous job of stimulating debate. Be warned, however, that this is not meaningful debate. Collins likes to talk about what redness is or whether it is possible for two objects to be located in the same space. These questions are not interesting because they have no impact (or potential impact) on our world. Despite their lack of importance, the questions do have a way of teaching you to be a good critical thinker and a good debater. Collins is capable of describing a number of good argumentative techniques that will be genuinely helpful to you in the future. This is why some may enjoy Collins. If you can set aside the pointlessness of the class and the lack of professionalism and simply focus on perfecting one's argumentative skills, then you may enjoy this class.\n*breath*\nNow, on the other hand, Jon Lawhead is an absolute joy. The man was empathetic with the fact that we had to suffer through this joke of a class, he answered our questions in a clear, consistent, and comprehendible way, and he was totally approachable. Everything good in TA can be found in Jon, and I recommend that you try to be in his section anytime he is in a class.\nWorkload:\nOkay so this is probably useless because there is no way of saying whether this workload will be the same next time Collins teaches this class, and there is no way to say how much he weighted each of these things but here it goes:\n4 400 word assignments (he originally said there could be up to 7 of these) on questions that Collins thinks up after a given lecture of his choice\nMidterm\n5 page essay on either a question he gives or a topic of your choice if you are into that kind of thing\nFinal\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 27, 2010",
            "review_content": "\nJon is a great TA, as long as you can put up with his eccentric personality and ideas, and don't mind that he doesn't really look at you when he talks to you.  He knows a lot about lots of different things, but can be a little dogmatic about science and materialism.  If you have strong religious leanings, beware, but even when he's disagreeing with you he's always interesting and helpful.  He gave very funny lectures that were at least as good as the professors.  He responds to email instantaneously no matter when you send it.  I sent him a question at 2 in the morning the night before the paper was due, and got an answer back 10 minutes later.  He's obviously really intelligent, and seems to actually care about students even more than some of the professors.  After having him as a TA for two classes (Darwin and Methods and Problems) I can say that the best way to learn from him is to try to argue with him.  Highly recommended, and a nice guy.\nWorkload:\nDarwin: Midterm, paper, final\nMethods and problems: a few homeworks (that the professor seemed to forget about after a while), midterm, final, and short paper\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "September 28, 2010",
            "review_content": "\nJon is amazing!!  He is very very intelligent and has an excellent teaching style.  I would totally think that he is already a professor if told so.  His lectures were so much better then the lectures given by the actual professor of this class. If Jon was teaching a class as a professor I would definitely take his class as he has a natural talent for teaching.  He goes above and beyond for the students.  In this particular class he actually taught half of the class since the professor scheduled one class each month for Jon and in addition the professor was absent a few times. Jon held several review sections at different dates to accommodate students.   His lectures were very clear, rich and interesting.  It goes without saying that he is a highly recommended TA. \nWritten by a philosophy major.\n \nWorkload:\nMidterm and final.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "September 04, 2010",
            "review_content": "\nRemarkable TA for Bilgrami's M&P; course. His warm and caring personality juxtaposes well with the professor's cold exterior. Here we have someone who is actually passionate about the course material, who wants the students to understand and learn, who is not afraid of commuting from Queens or Brooklyn (or wherever it is) to lead an extra review session. In addition Jon is a fair grader, willing to work with students to help them achieve better. All in all a brilliant TA, clear, thoughtful, eloquent; he will go on to achieve great things.\nWorkload:\nMinimal. You can easily get by without the readings.\n"
        }
    ]
}