{
    "prof_info": [
        {
            "prof_name": "Stephen Lehman",
            "prof_id": 5606,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "April 11, 2011",
            "review_content": "\nHe has a dry sense of humor and is very knowledgeable about the subject. It seems like he's confined by the core class because most people in the class aren't there for music theory, something I think he could easily expound upon. So it is what it is, whether you'd prefer that extra challenge elsewhere or are happy with a class that teaches you the basic skills of understanding any musical composition without pretending that you're suddenly an expert.\nAttendance is important and lateness past 5 minutes counts as an absence.\nWorkload:\nA 3 page paper on any concert you see, a 5 or so page paper on a piece by an artist from the listenings along with peer-reviewed sources.\nMidterm and in-class final are the same- 'name that tune' for 10 selections from the assigned listening, just the who and why it's them.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 18, 2009",
            "review_content": "\nLehman is interesting and funny, but the class seems to fall a little short in many aspects.\nHe presents the bulk of the material clearly, and usually illustrates his points with snippets of music (or entire pieces). However, when music theory gets involved, as it necessarily does, he gives brief explanations that don't really help. He spends one quarter to one third of class time prompting discussions, which is where the class participation portion of the grade comes in, but the answers to his questions tend to be dominated by a few people that reveal themselves early on. The questions are usually either blindingly obvious (which makes them seem worthless to answer) or abstract (which creates the same problem). Feel free to give whatever thought pops into your head.\nHe has the course planned out in advance, with music assigned before every class. The listening is short and never dry, which is pleasant. Sometimes there are a few pages from a textbook or an article to read, and these are usually boring. Thankfully, there are very few reading assignments. The planned schedule fell out of sync with the actual classes around halfway into the term, and at the end of the term there were a few classes missing.\nAs for graded work, there are two tests and two concert reports. The tests are identical in format -- he chooses 10 pieces of music from the homework and plays a portion of each. After each one, you have to identify the composer and write a few lines about the piece of music (what kind of music is it, what musical technique it features, etc.) This sounds daunting considering the number of pieces there are, but he tends to pick the most memorable ones from the composers about whom he spoke at length in class, so it ends up being very easy.\nHe reveals more information about the concert reports as the class progresses. At first he just says that there are two of them, one of which has to be music in the style of the music studied in class, and the other can be any kind of music. The first concert report is simple: 3-4 pages (consider this a gift compared to most college writing assignments) about the basic aspects of the music as well as the concert experience. He will tell you to follow a handout that he gives early on - just keep including points from that handout and you'll be fine. If you hand it in late, you lose a third of a letter grade for every day late it is.\nThe second concert report is considerably different. Besides being 4-5 pages long, you need to include at least two sources, which you can obtain at the music library (this means that your 2nd concert should be some sort of \"classical\" music). You need to refer to the sources extensively in support of claims you make about the music. In addition, you need to obtain a copy of the music that was played at the concert, which most people forgot to do.\nAs a final note, always come to class, and make sure you show up on time. Lehman allows a 5-minute period after the class officially starts in which people can arrive, but he told us that after that period, no one would be allowed in (not that he actually kept this promise - he's just too nice to lock people out). Still, he looks down on lateness.\nWorkload:\n30% - class attendance and participation (make sure you answer questions in class as often as you can), 15% and 25% - two concert reports, 15% and 15% - midterm and final.\n"
        }
    ]
}