{
    "prof_info": [
        {
            "prof_name": "Valentino Tosatti",
            "prof_id": 9798,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IV",
            "review_date": "May 25, 2011",
            "review_content": "\nTosatti is an awesome professor. I took his Calc IV class at 9:10 am, which for most college students is way too early, but his class was well worth taking. He is really humorous and really enjoys teaching the material. His notes are extremely clear, and he is really able to clarify every theorem known to man for integrals. The class to some extent gets a bit frustrating just because there are so many integrals to deal with, but Tosatti is able to guide his students through all the muck that is surface and flux integrals with ease. Plus his Italian accent and mannerisms are so adorable that you almost forget you are in a math lecture :)\nWorkload:\n- Really reasonable workload\n- Weekly graded homework assignments (two hours per week)\n- two midterms\n- one final\n- the class is curved\n\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "April 07, 2011",
            "review_content": "\nThe bottom line is that if you're looking for an easy way to satisfy a requirement, this class will do the job. If you'd like to learn something beneficial for future courses, you won't get much except a review of Calculus I integration techniques. Tosatti is an extremely accomplished young assistant professor who makes it obvious that he could not care less about this class. While I'm sure his brilliant research is well beyond something as decrepit as Calculus IV, he's fairly obvious during lecture about his disdain for the material and our exceptionally shallow grasp of real math. Most lessons are condensed into plugging and chugging; the derivations as well physical significance/interpretation are glossed over. He seemed embarrassed to have to bring up Riemann sums. I think at one point he even said that \"If you don't understand it, just memorize it.\" I took Calculus III with a professor who developed each lecture in the way he found most conceptually rich and who could wring interesting proofs out of dot products, so this class perhaps looks particularly bad in comparison. In the end it was a \"waste of your time.\"\n\nWorkload:\nWeekly problem sets, exams with bloated averages.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 30, 2010",
            "review_content": "\nProfessor Tosatti was a great professor who really keeps your attention during lecture and who is always nice enough to help his students during office hours. His lectures are clear and he has a vibrant personality while teaching, often bringing laughter to the class through his quirky reactions and demeanor. He likes to use the words \"absurd\" and \"extremely important\" a lot in class, often to great comic effect. His tests are entirely on what he teaches in class, so when he writes something down as \"extremely important\" it actually is just that. I found his tests to be fair and if you go to office hours he will go through all of your questions and won't stop until you understand the material. Overall, he was my favorite professor this semester.\nWorkload:\nThere is a problem set each week which takes a few hours. There were 2 midterms and a final, all of which followed the lectures and the practice problems exactly.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 18, 2010",
            "review_content": "\nProfessor Tosatti is, in one word, amazing. He is the sweetest math professor you will ever have. I'll say that again: he is so, SO sweet. The way I describe him to my friends is that he's like a kid in a candy store. Or like a bunny bouncing around in a field of flowers. He's just always smiling and laughing at random things, and he is just such a nice guy. One time I went to office hours to ask him a question about the upcoming midterm. He answered my question and then proceeded to explain other things to me. I actually had to stop him from giving me too much information; he's just so eager to help!\nFor most math classes, the professors you will have are very dry, which makes for very boring lectures. Tosatti always makes the class laugh at least a couple of time every lecture because he is just so goofy (in a good way). As for his actual teaching skills, those are great as well! His notes are very clear and often times explain things MUCH better than the book. His class is one of those classes where you will actually benefit by coming to class, listening, and taking notes. Obviously, if you study the book, you can also do well. But Tosatti's notes are so great that you don't even need the book (except for the homework problems).\nI actually don't really have anything negative to say about Tosatti. Good, clear lectures? Check. Fair grader? Check. Nice and eager to help? Check. There's not much more you can ask for in a math professor. If you have to take Calculus with someone, make your life easier and take it with Tosatti!\nWorkload:\nStandard for a math class. Weekly homework (2 lowest dropped) worth 20%. Two midterms worth 20% each (both very fair in terms of difficulty). Final worth 40%.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 15, 2010",
            "review_content": "\nListen up folks, if you haven't heard of Tosatti, then you must live under a rock. He is the Justin Bieber of math teachers: a young, emerging superstar with a cult-like following, but withh talent. Anyone privileged enough to take his class will immediately fall in love with his boyish-charm, exotically-alluring accent and thorough teaching ethic. His problem sets are appropriate in difficulty to level of the course material and so are his tests. Moreover, Tosatti will listen to your concerns, take appropriate action to rectify any complaints and will demonstrate the sometimes abstract theorems of calc IV with concrete and clear examples. It was a great experience to take calculus four with Tosatti all because of his wonderful and amicable personality.\nWorkload:\nThe weekly standard, textbook-based problem sets as per usual in Calculus classes. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 12, 2010",
            "review_content": "\nAs far as math classes go, I think I got a lot out of this class. Calc IV is where you finally get some understanding of the application of the math, especially to physics. Tosatti was a great professor who taught pretty much straight from the book. There weren't any surprises on midterms, and as long as you do the homework and understand the practice midterms/final, you should have no problems doing well. I'd definitely recommend him over Friedman. A cramster account would be helpful too. I found that the best way to make sure I was getting the material was to check each homework problem on cramster after having finished it. \nWorkload:\nWeekly problem sets that took a couple hours each at most (20%), two midterms (some found the second to be more difficult, each 20%), and a final exam (40%). the final was actually more difficult than I was expecting, but the curve will probably be decent. \n"
        }
    ]
}