{
    "prof_info": [
        {
            "prof_name": "Jessica Stanton",
            "prof_id": 1794,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "August 12, 2005",
            "review_content": "\nUnfortunately, I wasn't able to attend her discussion sections due to scheduling conflict. From speaking to her in office hours and her comprehensive review sessions, it was evident that Jessica is an exceptional teacher who takes the extra step(s) to help her students understand dense material. If she's as conscientious a student as she is a teacher, she'll be fine in her chosen career path. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 19, 2004",
            "review_content": "\nI've got to agree with most of the reviews.  Jessica was a great TA.  Very helpful and accessible.  \nWorkload:\nParticipation in the discussions, of course.  Reading the assigned material would've been helpful, but she does go over it some in section.  If you're interested in the topic of the day, you can pretty much wing it.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 03, 2004",
            "review_content": "\nJessica was a truly great TA; I attribute my success in International Politics to her.  Her discussion sections were orderly, clear, and informative.  She went out of her way to assist us in writing papers, and created extra office hours towards the end of the semester.  She also gave very thorough, comprehensive comments when grading papers.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 08, 2003",
            "review_content": "\nI completely agree with the other review hereÂ—Jessica was the only thing that made Intro to IR bearable. Discussion sections included her spending a few minutes succinctly clarifying whatever the professor had confused in class, and then leading discussion in a way that both helped confused students get a good grasp on the issues and those with outside knowledge or strong opinions contribute in a productive way. She is great at synthesizing what people are saying and helping them sort out their own arguments, even on issues that arenÂ’t her specialty. On top of this, sheÂ’s incredibly nice and genuinely eager to help her studentsÂ—by far the best TA IÂ’ve had. Next time the Political Science Department needs to ask a PhD candidate to teach, it should be her!\nWorkload:\nAs a TA, she didn't pick the workload, but grades papers with a lot of helpful comments. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 01, 2003",
            "review_content": "\nJessica was a great TA -- always available, great at explaining things, and a really nice person to chat with. She definitely knew her stuff (she was able to field questions from some pretty educated students), and was a pretty soft grader with good explanations for her grades. If becoming a professor is what she aims for, she'll make a great one.\n"
        }
    ]
}