{
    "prof_info": [
        {
            "prof_name": "Gregory  Bryda",
            "prof_id": 13636,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "FYS",
            "review_date": "January 07, 2021",
            "review_content": "\nI loved this class! Professor Bryda is a great teacher that feels passionate about the content he teaches. We went over medieval mystics and art, which was more challenging for me, and then moved to modern mystics, which we went over abstract art. It is a discussion class and work is done outside of class. The writing load was very manageable and we had readings before every class that took about an hour. The essays were definitely challenging, but a great learning experience. Professor Bryda had office hours after every draft. I loved how it was pass/fail this year because it really took off the pressure. \nWorkload:\nthree 3 page essays, each essay has a draft, readings every night about an hour\n"
        },
        {
            "course_name": "Intro to Art History I",
            "review_date": "December 04, 2020",
            "review_content": "\nProfessor Bryda is an excellent teacher! He is super knowledgable and his curriculum for intro to art history is amazing. I took AP Art history and I was really annoyed I had to be in an intro class but it ended up being so worth it and I feel like I learned so much more beyond the AP curriculum. He adds really incredible readings from other academic areas that supplement studying art history in such a unique and creative way and it is overall a very fulfilling learning experience. On top of that he is so sweet and kind, a positive person who clearly loves his subject. \nHis canvas page is so organized too! He had the whole syllabus with readings and assignments easy to find and very clearly stated, which is a lot to ask of some other teachers... Also his paper assignments were very clear and fair. \nOverall, if you are interested in Art history and okay with working hard for a very fulfilling learning experience take it with professor Bryda!\nWorkload:\nA decent amount. about an hour of daily readings, a discussion group that meets once a week, 3 papers (2 formal analyses and 1 research), midterm and final that consisted of short questions, comparisons between works, and an essay. \n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "December 03, 2020",
            "review_content": "\nHorrible class to take with him, especially virtually. He rambles and no one ever knows the point of what he's saying. He is way too specific on what he wants in the midterm and my TA personally said he wants this to be a hard class to get an A in. (The TA herself is amazing though, I'm quite sure they all just want us to do well.) That being said, I don't think there are any other professor options for this class right now, but avoid if you can. \nWorkload:\nOk, readings and discussion sections but you don't really have to read to BS your way through. 3 papers 1 midterm 1 final. A- to A+ work in other classes will get a B or maybe A- depending on your TA\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "January 23, 2020",
            "review_content": "\nBryda is a nice guy, don't get me wrong. He seems like he has a light spirit about him and definitely is very passionate about art history. \nHOWEVER, that said, DO. NOT. TAKE. THIS. CLASS. WITH. HIM. \nAs a fourth year art history student, has already taken Intro II, and received a 5 on his/her AP AH exam, Bryda's course is needlessly pedantic. He requires memorization of the strangest grouping of works, is incredibly finicky when it comes to theory analysis, and overall is just too much of a hardo for an intro level class. \nWORST OF ALL...this guy cannot teach!!! He refuses to use PowerPoints for some reason and doesn't list the title of the works under the slides so figuring out what is what is a nightmare. What makes it worse is that objects are grouped by theme rather than culture or date, so you're constantly jumping back and forth between eras and countries! He also dwells on very minute ideas for much longer than needed, and is very redundant in his driving points (sometimes a good thing).\nI'm sure he has it more together in a northern renaissance class (his concentration), but when it comes to survey courses there is just too much material for him to handle. \nWorkload:\nDecent amount of reading and strange but easy assignments. Midterm and final are a small b*tch. Just very irksome when it comes to organizing notes. \n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "November 15, 2019",
            "review_content": "\nSome people worship Prof. Bryda, but I personally do NOT like him. People may say that he's engaging because he asks questions, but how am I supposed to take notes on the 20 minutes of questions that he posed to us on the first day of class?? He rambles a lot about an artwork, often describing its *beauty* and importance and then doesn't come to a conclusion (a lot like my papers, but I'm not a college professor). Also, he never posts the notes before class, so I'm often scrambling to look up pictures of the work to put in my notes. He also CONSTANTLY forgets to upload the Slide List(list of works that we will discuss in class), so sometimes I don't even get the name of an artwork until much later!! And the slide lists aren't even entirely on the midterm and final!!! He does take some out, which I appreciate, but often doesn't include some important info on that final list??? On the midterm, he asked  for dates but they weren't given in advance, so you gotta google!!! Khan Academy saved me in this class. There's really no alternative to Intro if you want to go more into Art History, so just brace yourselves folks. You're in it for the long haul. \nWorkload:\n2 midterms, weekly discussion section, 3 papers, 2+ visits to the Met (2 as a class, more by yourself???), at least 2 readings for each lecture (upwards of 40 pages)\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "December 26, 2018",
            "review_content": "\nProfessor Bryda is a great professor! He is funny and has a clear passion for what he is teaching. His lectures are interesting, and he explains each work of art in extensive detail. If you show up to lecture and do the readings, the midterm and final are fairly easy. This is a reading heavy class, but you really only have to do the starred readings for discussion sections (the essay on the final is chosen from those readings). However, Professor Bryda provides all the readings onlinre, so you don't have to buy any books for the class, which is nice. There are two required trips to the MET throughout the semester, and you have to visit the MET once on your own for the research paper. Overall this is an interesting class and fairly easy if you put in a reasonable amount of effort. \nWorkload:\n30 - 50+ pages of reading per class\nThree 3-5 page formal analysis papers\nOne 5-7 page research paper\nMidterm and Final Exam\n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "December 18, 2018",
            "review_content": "\nDO NOT TAKE THIS CLASS. Definitely the worst class I've taken here so far. I'm writing this instead of studying for the final because I'm filled with rage over how much this class sucked. Boring lectures where it's very hard to tell what's actually important. There's literally no direction on how to write an art history paper or anything like that, which feels weird for an intro-level class. I only took this class because the early stuff is relevant to my major but I thought maybe it would get me into art history and I was SO SO SO wrong. Only when I was studying for the final and searching art on Wikipedia did I realize that some of it could have actually been interesting had I had a different professor. BAD. \nWorkload:\npretty reasonable, readings and three essays \n"
        }
    ]
}