{
    "prof_info": [
        {
            "prof_name": "Arathi Menon",
            "prof_id": 12467,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Indian Art & Architecture",
            "review_date": "January 01, 2014",
            "review_content": "\nMasterpieces of Indian Art and Architecture (AHUM V3342) was a good class with a manageable work load and somewhat interesting course content. Take it if you need a Global Core which isn't too heavy, yet you still want to learn something sort of neat.\nDehejia is a good lecturer who is concise and straight forward in identifying important characteristics and theories about Indian architecture and paintings. She covers Buddhist, Hindu, Mughal, British and contemporary art in India over the course of the semester. The first half of the course has a lot of religion in it since it shapes the architecture of the period. The class isn't very interactive and pretty much just involves her putting up a PowerPoint presentation and talking about the art in the slides. It's very important that you take good notes on everything she says since it will be on the test. For the most part, the TAs were responsible for this class, not Dehejia.\nIn addition to the lecture, we had hour long discussion sections on Mondays (make sure this fits in your schedule, they're not flexible with the timings) about the topics covered in class and the readings for the week. Arathi Menon was my TA and will be teaching this class in the future I hear. She is nice, but strict and expects her students to actively take part in discussions and do the readings - no BS will help you here. The TAs graded both the exams and the papers. Grading on exams wasn't bad, it's not too hard to get an A. However, paper grading was pretty harsh - very few people got As.\nThe requirements to do well in this class are very straight forward. If you put in the required effort, you should do fine. Expect to do about 50 pages of reading a week. The reading is not too dense and is very similar to what's covered in class, so if you do after the lecture, it's not that bad. Exams ask for definitions and slide descriptions and essays. Slides of art and architecture seen in class are put up. You have to identify the site/piece, date and talk about the theories from the readings and class about it. The exams were mostly verbal diarrhea requiring you to just spill whatever information you memorized about the work. Your hand will definitely ache by the time you're done writing the tests. On the bright side, it's pretty easy to spew various facts on the slides she puts up. To do well on the exams, you must do the readings and pay attention to important points brought up by Dehejia and the TAs in class. I advise summarizing the readings as soon as you do them so you don't have to read them again right before the exam. If you're really lazy, you can manage to do all the readings about 2 days before the exam, but be warned, many of the books are on reserve at Avery, so you might not get the book at the last minute.\nDehejia covers most of the important theories in class. Pay attention to those in particular and look for them in the readings. Note them down as points, and make sure you mention them in your exam responses. Everything else is extra material which isn't as important.\nAll in all, this is a pretty decent class to fulfill the Global Core requirement. If you're an engineer, this is a good class. No vague BS nonsense, just straight forward facts. It's a guaranteed A if you do what is expected of you, which isn't much: about 2-3 hours of effort a week on average.\nWorkload:\nTwo 3 page papers on idols from the Met (15% each)\n1 midterm (30%)\n1 final (30%)\n10% participation in discussion sections\n"
        }
    ]
}