{
    "prof_info": [
        {
            "prof_name": "Ellis Avery",
            "prof_id": 1787,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style I",
            "review_date": "May 22, 2006",
            "review_content": "\nIf you love to write, take this class with this woman! She teaches something many young writers do not really: DISCIPLINE. If you take her, you will write every single day. \nAlthough the daily writing exercises are optional, she will have you pick a friend and write he/she a postcard every single day. Don't think you can get out of it; each week, you will have to type out 6/7 and hand them in. And this is worth it--at the end of the year, you will look back on them with pride. You will also write something larger pretty much weekly, with the largest project being your final piece. This class requires a lot of attention (often, I spent my entire Sunday afternoon working on it). Her grading style is anal, but sing the class is 90% effort, simply doing EVERYTHING and handing it in on time (from the postcards, to response paragraphs, to identifying say, the \"action\" of a chracter in a scene) will start you off with a pretty good grade. Put some effort in as well and you will be golden. Most of the classes are workshop style, and you will definitely be workshopped 3-4 times. In addition, every week you'll get feedback on whatever longer thing you wrote. Ellis Avery is simply wonderful...this was the first time anyone forced me to take my writing seriously, and to regard writing as a skill that must be honed through practice. Some of the readings she assigns are sull, but many are helpful, and if you listen to her and read well, you certainly will become a better reader and writer. Oh, and don't take this in tandem with LitHum, UWriting and a history class with a huge final paper as I did...\nWorkload:\nVery heavy. Daily, shorter writings. Longer weekly assignments. Feedback on several pieces every week. Often a thick-ish stack of reading. Occasional response paragraphs. Nitpicky assignments such as indentifying the use of something in one of your own pieces. Many assignments are fun. Longer project (play or short story) during the last 5-6 weeks (Do as much over spring break as possible!).\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "April 20, 2006",
            "review_content": "\nProf. Avery is a good writing proffesor. She comments on all the work she gets, even though she gets a lot of it every week, and is always willing to meet with students--she puts a lot of effort into the course. THe class itself basically consists of workshopping other peoples work, so that has less to do with her than the kids, but she keeps it organized and make sure everyone gets and equal amount of time to be workshoped. She is fair, and square, and grades very exactly--the only thing is that there is alot of work in this class, or at least I found it to be a lot of owrk. Usually there are two writing assignments per week plus required feedbacking of other students. But if you like writing, its not bad. \nWorkload:\nMedium-Heavy. Like I said above, about two writing assignments each week plus feedbacking others. One longer project at the ened which is challenging. \n"
        },
        {
            "course_name": "Structure and Style",
            "review_date": "December 11, 2005",
            "review_content": "\nThis was my favorite class of the semester! Ellis Avery is a fantastic writing instructor. Yes, it's true that you do more writing in this section than any of the other Structure and Style I classes but it's very much worth it. All the assignments are fun.  My favorite part of the class was the daily writing exercises we did. It may sound like a lot, but they don't have to take long. You can spend five minutes or an hour on each one. You will be impressed at the end with how much you have written and how much you have improved. Miss Avery is incredibly encouraging and very approachable and she creates a classroom environment that is the same way. If you are thinking of taking this class-- take it with Ellis Avery. She is the best!!\nWorkload:\ndaily writing exercises. small weekly assignments that include writing a theatrical scene, or piece of prose/fiction, or a poem and giving feedback to 2-3 people in the class and possibly some readings (they are helpful!). Final portfolio due at the end with a long play OR short story and two revised poems.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "November 21, 2005",
            "review_content": "\nThis was such an enjoyable class. Ms. Avery is kind and sweet, and she gives so much heartfelt encouragement along with in-depth, helpful comments that really help to improve your writing. At first she seemed a bit cold and even forboding, but I think it may have been her own nervousness as well as ours for those first few days of class. Once we all warmed up, she gets funny and personable and the class was helpful and even...fun (gasp!). She's a published writer (I think all the teachers probably are) and she uses her own experiences to give advice on how to write, create characters, the actual process of writing/being published, etc. Contrary to what the other reviewer wrote, I didn't find the workload to be bad at all. Yes, there is a daily writing assigment...but it's a total of about five minutes a day, and it actually turned out to be my favorite part of the class (and actually of my whole semester). She gives out readings but they are not dense or time-consuming, and it pays off in your writing if you read them. Ms. Avery's class definitely improved my writing and made me love writing even more than I already did.\nWorkload:\nDaily assignment (about 5 mins or less per day), small-ish weekly assignment (like a one-page dialogue or a two-page short story), semi-weekly readings (half hour to an hour at most), a longer fiction or drama peice that we worked on over a month, and two final poems\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "November 17, 2003",
            "review_content": "\nThe thing you'll first notice is that Professor Avery is one of the kindest people you'll ever meet.  I really enjoyed her as a person in and out of class.  However, i must warn: unless you intend for Structure and Style to dominate your life for the entire semester, for the love of God, AVOID THIS WOMAN.  I've talked to people from countless other sections of S&S; 1, and none of them do even CLOSE to the amount of work required by Prof. Avery.  But if your sole passion in life is to write, take her.  She's extremely devoted and a great instructor/encourager.  Yeah, she's a little hippyish and strange, but as i said extremely kind.  Whether or not you want to devote your entire semester to this course should determine whether or not you take in from Prof. Avery.\nWorkload:\nAssigned weekly (and collected in class as applicable): DAILY writing samples, at least 30 pages of photocopied reading, a 1-2 page annotation/evaluation of something you've read, and--depending on the part of the semester--at least two poems, a draft of your short story, or a draft of your play.\nFinal portfolio will contain: Final copies of countless poems of all forms, a final draft of your 10-15 page short story, a final draft of your 10-12 page play, and the collection of all of your FUN DAILY WRITING EXCERCISES!\n"
        }
    ]
}