{
    "prof_info": [
        {
            "prof_name": "Jennifer Offill",
            "prof_id": 6562,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "The Here and Now",
            "review_date": "January 28, 2013",
            "review_content": "\nOh just give this woman a gold nugget already! She's an absolute delight. Every class she comes in with some funny and inspirational story and something lovely to talk about. She's very funny, and her edits on my work were very helpful. I mean, she really is a believer in cutting out as much as you can, and leaving only the lines that are essential. I love her line edits and I love her. I don't care about the reviews that she's a little unorganized--I think she's gotten better over the years, and I really enjoyed her class. It's hard to say whether it's easy to get an A or not. I did well, but I did not know that I would until I got my grade. \n\nWorkload:\nThere's weekly readings (short stories she hands out in packets, so no books to buy) and a few short pieces of fiction. Usually under 10 pages. \n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "January 13, 2011",
            "review_content": "\nJenny is such a sweet, funny person, and boy does she know her stuff!  As a warning--you don't do as much writing as you would expect, and I do wish that we'd at least revised both stories (see Workload) and perhaps written a third.  The revisions seemed to be just because she didn't want to read any more, but the limit to two stories wasn't really her fault--for some reason, and most unfortunately, all creative writing classes only meet once a week.  However, despite coming out of this workshop with less writing than I would have liked, I definitely came out knowing HOW to write, which is more important, since it gives you a tool to do as much writing as you want in the future.  Each class was a workshop of other students' stories.  We read a couple of professional pieces--not enough; I think she should have assigned one or two a week, since they were fun, pertinent, and definitely helpful in seeing how the techniques she talked about were utilized.  Still, enjoyed every minute of the class.\nWorkload:\nNever thought I'd say this, but NOT ENOUGH work!\nTwo drafts of stories\nCritiques (one page each) of two or three other students' stories every week\nOccasionally a published story to read\n\"Final Portfolio\"--actually just a revision of one story\n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "September 02, 2009",
            "review_content": "\nThe other review here is pretty far off the mark (hence 3 disagrees and no agrees). Jenny is the worst teacher I've had in the Creative Writing Department at Columbia. It is true that she is disorganized, which seems to be par for the course with writing and nothing, in itself, to be held against her, but she is also condescending (but I was left baffled as to why), a bully pulpiter (if that's a word), and I often got the impression that a) she didn't read my submissions very carefully and b) she thought Columbia students sort of sucked. All in all, she was a bad, bad teacher in a department where I've had the best (read: most interesting and fun) teachers at Columbia. Avoid her.\nWorkload:\nnormal, 3 submissions + revision\n"
        },
        {
            "course_name": "Intermediate Fiction Workshop",
            "review_date": "April 21, 2009",
            "review_content": "\nJenny is a great teacher. I had her for both a writing seminar (Unhinged Narrator) and an intermediate fiction workshop, and both were really good experiences. She is laid back, smart, funny, and always has great stories to tell. Although she's a little disorganized and would sometimes run out of time, she always had insightful things to say. In our workshop, she always was willing to meet to talk about our writing one-on-one and she gave very good written feedback.\nWorkload:\nNot too much. For the seminar, it was a book a week, but great books. For the Workshop, three stories and one revision.\n"
        }
    ]
}