{
    "prof_info": [
        {
            "prof_name": "Maya Mikdashi",
            "prof_id": 3316,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "March 14, 2010",
            "review_content": "\nI think Maya was a lovely combination of laid back and on the ball. She has a great sense of humor and always kept the discussion interesting and fascinating. She is also extremely well-versed in anthropological theory and will make sure to outline the key points in the beginning of the discussion. She made an effort to include everyone in the discussion and we all came out feeling good about what we heard and what we said. I definitely learnt as much from discussion as I did from Mamdani's lectures.\nI found Maya to be a fantastic addition to a great class. \nWorkload:\nWeekly essay submissions that are good reviews of the readings. 2 papers (10 pages each).\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 11, 2008",
            "review_content": "\nMaya was a really wonderful T.A.--her comments were always really insightful, and she was very laid back.  She makes herself available to meet with students, and even though I usually do not prefer to meet with teachers, I found her very helpful.\nWorkload:\nWeekly readings and responses, 2 papers (8-10 pgs), 1 in-class presentation\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "October 31, 2007",
            "review_content": "\nI don't know why- maybe I have just been extremely lucky- but every Anthro TA that I have ever had at Columbia has just been phenomenal. Maya is the best yet. The sections are organized into discussion-based presentations. Maya does an excellent job of guiding the group presentations so that everyone in the class gets as much out of it as possible. She also really knows her stuff- don't be fooled by her tiny stature. Take her and your section very seriously. Its worth a third of your grade. Maya is always available and very easy to talk to. Try and get her as a TA if at all possible.\nWorkload:\nmedium-hard. Besides the two 8-page papers due for the class, there are 1-page responses due weekly for the section. Also, a 50 minute group presentation.\n"
        }
    ]
}