{
    "prof_info": [
        {
            "prof_name": "Lauren Robertson",
            "prof_id": 13675,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Surveillance of Women in Renaissance Drama",
            "review_date": "May 15, 2020",
            "review_content": "\nI can't recommend Professor Robertson enough. She's so passionate and excited about the teaching that she does that she made me excited about Shakespeare and his contemporaries, even though I didn't think I cared before this class. The class discussions were vibrant and lively, and actually stayed that way even over zoom which I never would have thought possible. She's also just a genuinely kind person. When everything went online, she canceled a paper, and has been really generous with extensions and modifying assignments since then. \nWorkload:\n3 papers (2 5-6 pages, 1 longer w/secondary sources) \n1 presentation based on a play\n1 play, 1 primary, 1 secondary source / week \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 20, 2020",
            "review_content": "\nReally engaging in class and truly cares about her students. Tough essay grader, but if you go to her office hours she'll sit with you and talk about your essay and offer great insight on how to improve it. If you go to office hours you will get an A on the essay usually. She has genuine excitement for the course!\nWorkload:\nweekly posts for books ~250 words, 2/3 essays, 1 midterm, 1 final. Usually goes with the standard lit hum format, rarely excludes quotes you might not have gone over. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 14, 2020",
            "review_content": "\nProfessor Robertson is a truly amazing professor, and I feel extremely lucky to be in her lit hum class for both semesters. She is passionate about the class and definitely knowledgable about the texts, but she always engages with students throughout the discussion and builds the class around our comments and opinions, which is what I think makes lit hum a truly amazing class. She is very supportive when it comes to major assignments, and I would highly recommend going to her office hours if you want to talk about an upcoming paper. Most importantly, Professor Robertson genuinely cares about the students, and I would definitely miss her next year.\nWorkload:\nReading, weekly discussion posts, 2 papers, 1 midterm, 1 final.\n"
        },
        {
            "course_name": "Renaissance Comedy",
            "review_date": "June 25, 2019",
            "review_content": "\nWhat an incredible and engaging professor who selects excellent secondary readings that expose you to diverse methodological approaches and who facilitates classroom discussions adroitly. A fabulous English class.\nWorkload:\nFun assignment; 5-6pp paper; 10-12pp final paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 15, 2019",
            "review_content": "\nProf. Robertson is amazing! She always leads engaging discussions and is very flexible. Would recommend! \nWorkload:\nWeekly readings, discussion posts, 1 midterm, 1 final, 3 papers. \n"
        }
    ]
}