{
    "prof_info": [
        {
            "prof_name": "Anne Hunnell",
            "prof_id": 9687,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 24, 2010",
            "review_content": "\nShe is very nice, knowledgeable, and an encouraging instructor.  Though she is relatively new to the realm of teaching (she is a grad student), she is a very promising professor and I am sure will keep improving (though she is already skilled.  I enjoyed the course.  It is your basic survey of western art, and her emphasis is not on needless memorization but formal analysis and building your knowledge of works so you can really appreciate art and speak with confidence about pieces.  Though I think her expectations and workload were a bit above the average, I think that's a good thing overall.  Her comments are well received and will help you beyond art hum, especially if you are studying a field in which attention to detail is of unparalleled importance.  If you have a chance to take a course with her, do it, I think she was generous with grades at the end.\nWorkload:\nResponses in your observational notebook which were assigned weekly for the first half of the course.  2 5 page papers, 1 on local architecture (Butler or Grant's Tomb, etc.) another on portraiture from the Frick.  We had a final presentation in small groups on the last class which was actually fun to do and a free A added into our average.  Also, attendance and participation matter, like in every Core course.  The main pieces of the course, in terms of grading, were a challenging midterm and final.  For both, emphasis was on analysis rather than memory (there were only 4 or 5 works you needed to fully identify), and identification was secondary to formal analysis.  The overall format of the midterm/final was 5 vocab words, two comparison sets (for which you need to identify artist, year, and the name of the work), one unknown piece, and a thematic essay, which is relatively broad.  For the thematic essay, on the midterm you needed to fully identify two works and write about how form meets function, and on the final, three works one building, one sculpture, and one painting and incorporate readings from the course to support your thesis.  Both exams were challenging, the average for the midterm I believe was an 83, but I think she curved both it and the final to find the CORE standard deviation.  I received an A in the course but really put in the work and went in to speak with her when I had questions.  She clarifies the material even better one on one, so don't hesitate to see her.  It seems she's always on campus doing work anyways so you might as well take advantage of her availability (it's rare for a professor to be so open for students to come in, so do it)!\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 31, 2009",
            "review_content": "\nArt Hum is a straightforward and enjoyable course to begin with, and Professor Hunnell made it engaging and manageable. I think it was her first time teaching the course, and occasionally it showed, but she is knowledgeable about the material and I expect her teaching will only improve in subsequent years. My only frustration was that she sometimes allowed class discussion of an artwork to meander, open-ended, for a little bit too long. If she had given the discussion more direction, and shared more of her knowledge, the class would have learned more. But this is a minor complaint, and overall she was a perfectly good teacher. The papers were very fairly graded and her comments were specific and helpful.\nWorkload:\nA midterm and final which require lots of memorization to do well but otherwise not difficult\nTwo 4-5 page papers\nReadings which I suspect most people don't do.\n"
        }
    ]
}