{
    "prof_info": [
        {
            "prof_name": "Luke Macinnis",
            "prof_id": 11978,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 17, 2015",
            "review_content": "\nLuke is the best. That is all there is to say. I was so happy to finally have a normal core professor. Class discussions are very relaxed and Luke is very understanding about our workload as Columbia students. Readings are extensive and you should try to get through some of them to actively participate in discussions because there is a significant participation grade. \n3 papers--1500 words, 0 stress, very good comments that are constructive and not demeaning\nParticipation grade--make 3 intelligent comments every class and you'll do fine\nFinal-- Luke will give you essay questions and a list of terms. Define all of the terms and plan the essay\nMidterm -- 10% of your grade, 2 quote id and explanations\n10 discussion posts t regret taking Luke for CC.\nWorkload:\nAs stated. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 15, 2015",
            "review_content": "\nHe picks favorites. Disproportionately chill teacher. Don't expect to learn anything but he probably won't give you lower than a B. I remember asking a kid in class who fervently quotes twitter and Dane Cook how he was doing in participation. He had an A. If you want a class that makes no sense, this is the one.\nWorkload:\nJust don't\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2015",
            "review_content": "\nCan't stress how awesome Luke is (echoing the person below me). He's relaxed and does a fantastic job incorporating class opinions as well as his own thoughtful reflection on the CC content. You could get away with avoiding the reading for the whole semester as he never put you on the spot and provides extremely specific study guides for the midterm and final. That being said, you'd do yourself a disservice since he does give a participation grade- but because the class often goes off on tangents related to philosophy/politics/contemporary world affairs, you could probably get away with talking during those segments.  \nLuke's the chill albeit geeky teacher you want to impress.  Go to office hours to talk about papers (which can be on the longer side) or just chit chat; essentially, you should befriend him! He's an incredibly smart, amiable guy and I'm a total fan girl in case that wasn't obvious already.\n\nWorkload:\n10 less than 200 word responses on texts of your choosing throughout the semester (graded on completion and v low pressure)\n2 papers (20% each with the option of turning in an outline that he critiques)\n1 midterm (on quotes covered in class)\n1 final (follow the study guide and class notes and you'll be golden)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 29, 2013",
            "review_content": "\nLuke strikes the perfect balance between being the homie (e.g. taking his classes to movies with the class budget as opposed to museums, giving generous study guides for all exams) and being a really insightful, obviously brilliant, and dedicated CC teacher who knows how to lead a good class discussion and teaches to both the people in the room who did the reading and those who did not.  Couldn't imagine having a better CC professor.\nWorkload:\n- 3 essays/semester, each 1500-3000 words.\n- 10 300 word reading responses/semester (with an opportunity to complete one before each class session). Graded on completion.\n- 1 presentation on a text (all the texts get divided up between the students at the beginning of the semester)\n"
        }
    ]
}