{
    "prof_info": [
        {
            "prof_name": "Irina Goia",
            "prof_id": 2541,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "September 06, 2007",
            "review_content": "\nI took this course in order to better prepare myself for calc1, but in my opinion this professor teaches extremely slow and has a really heavy accent. At her pace we only covered one section in one class.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 16, 2006",
            "review_content": "\nThe worst teacher I have ever had. Ex. Irina puts a problem on the board, then starts talking about another topic. Classmate: \"Um, Irina, could you explain how we do this problem, I do not quite understand it.\" Irina: \"It's implicit,\" she replies in her almost unintelligible english. \nListen, I never, ever complain about teachers, but I am warning you, stay away from this one! We went from a class that had almost reached the max, to a class of 4, and that is if they all showed up. Coincidentally, the Calc 1 class after ours had slowly over time exceeded capacity, I wonder why? Run away from her! She does not want to be teaching this class, and it's obvious, she never showed up to class on time, even on the day of our final. A GS student was fuming that he had spent $4,000 on a class that wasn't necessary to ever show up to, save for midterm and final. I hope what I have said is good enough to deter you, if not, you deserve her!\nWorkload:\n1 HW assignment per week, 2 midterms, 1 final, 1 presentation (optional, but not really)\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "May 27, 2005",
            "review_content": "\nWhile Irina clearly has a comprehensive knowledge of the material (as presumably all instructors do) something is clearly lost in the translation. I am not referring to the fluent yet heavily accented English that she speaks. Rather, I am referring to the fact that she does a below average job of teaching the concepts. There is a difference between nurturing a learning environment for your class and flying through problems at break neck speed on your own with little or no explanation. Clearly this distinction is lost on Ms. Goia. She manages to make the simple difficult and the difficult nearly impossible as even during her office hours she is resistent to helping you understand the material. \nI was forced to teach myself everything in the course from the text book. This made her lengthy homework assignments even more challenging. Additionally, her tests were uncommonly difficult. \nSome people are born teachers. Others are meant to sit in an office and thorize about esoteric math concepts. Ms. Goia clearly falls in the latter category.\nAvoid this class.\nWorkload:\nHeavy\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "May 16, 2005",
            "review_content": "\nI would not recomend Irina's class to anyone lacking a strong math background.  If you have had a great teacher in the past and have a secure understanding of the basic concepts covered in the course you will be fine, but if not, you will likely leave her class frustrated and confused.  Her exams were very long and from what other PHD students that have taught the class before told me, harder than normal.  Looking back, I should have dropped the course (over 50% of the class did).  Avoid this section if you can.\nWorkload:\nweekly hw, 2 exams (20%), and a final (40%)\n"
        }
    ]
}