{
    "prof_info": [
        {
            "prof_name": "Celia Deutsch",
            "prof_id": 190,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Accent and Voice: Minority and Immigrant Women's Literature",
            "review_date": "December 14, 2008",
            "review_content": "\nCelia is an absolute joy to be around!  I felt more like I was in a book club than in a class because all of the books we had to read were things I would have liked to read for pleasure in my spare time.  Discussions were open and pleasant and very interesting.  The writing assignments were kind of a pain, but when are writing assignments NOT annoying?  Celia claims to be a tough grader and that she doesn't give out a's, which is total BS-- she is a pretty fair grader and i'm pretty sure a lot of people in the class came out with B's and A's or A-'s.  I highly recommend this class for any incoming freshman-- I learned a lot about college writing and got to read interesting books!  Plus, Celia is so kind and helpful that I was never too worried.\nWorkload:\n4 papers increasing from 4-5 pages to 12-15 pages in length.  We read about a book a week (which sounds like a lot but it really wasn't-- even if you dont read them it's easy to BS through).  Also, we paired off and had to lead discussions in the middle of the semester, which wasn't nearly as scary as it sounds.  No mid-term, and the final was a long paper.\n"
        },
        {
            "course_name": "Immigrant and Minority Women Literature",
            "review_date": "December 09, 2008",
            "review_content": "\nI read the other reviews about her religion classes and I've taken some religion courses so I have to say unless youre passionate about the topic, most professors will be boring! As for immigrant and minority woman literature, she is AWESOME. True the class does go off on a lot of tangents but its usually on topics related to the book and the converstations are interesting and insightful (it is a seminar). She asks a lot of questions that encourage you to approach reading more analytically but this is a good thing becasue it will help you in your college career. She is definitely a tough grader but not an unfair one. Some of the books were boring but you only have to read it that one time and you can write about the ones you really enjoy so its not that bad. She's super sweet and understanding and always available outside of class to talk with you. This is a class worh takin if youre interested in the subject.\nWorkload:\nA lot of reading but you can get away with not doing all of it. A LOT of writing compared to other seminars but hey, its college. four papers starting with a five page intellectual autobiography assigned on the first day, with two pages added to each successive paper. \n"
        },
        {
            "course_name": "Accent and Voice: Minority and Immigrant Women's Literature",
            "review_date": "November 12, 2007",
            "review_content": "\nThe books we read were pretty good, albeit I didn't love each one but who does, really? Professor Deutsch is super nice and caring and she was generally a great professor to have. Her niceness does have its disadvantages sometimes because students tended to go off on tangents, especially when it was clear that they had not read the chapters dued. Yet, she brings into the classroom personal experiences and is clearly interested in students' experiences in a roundtable discussion. My favorite thing about her is that she was really passionate about the book list that she created for this first-year seminar and she relayed that to the class. She's somewhat of a tough grader on papers but definitely not horribly so. Just make sure you're proofreading and concise.\nWorkload:\na little heavy on the reading but not that bad.... several chapters before each class; a few papers (along with draft)\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "December 20, 2006",
            "review_content": "\nShe's really sweet...super boring. Class was hard to sit through if only because it felt like it went on forever. The reading material is good, but we hardly covered it in class. \nShe's really nice about grading, but she is definitely in her own world sometimes. She cannot remember names of people who don't talk everyday, would discuss esoteric things that no one knew about, and would mention things in class that were neeeever used again. She's nice though, and if you do the work you'll do well. She usually gives a lot of days off too.\nWorkload:\nModerate. Readings every week (quite a few) and a response paper once a week (hand them in!), Midterm paper (8-10 pgs), Final paper (10-12 pgs)\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "December 20, 2006",
            "review_content": "\nShe's really sweet...super boring. Class was hard to sit through if only because it felt like it went on forever. The reading material is good, but we hardly covered it in class. \nShe's really nice about grading, but she is definitely in her own world sometimes. She cannot remember names of people who don't talk everyday, would discuss esoteric things that no one knew about, and would mention things in class that were neeeever used again. She's nice though, and if you do the work you'll do well. She usually gives a lot of days off too.\nWorkload:\nModerate. Readings every week (quite a few) and a response paper once a week (hand them in!), Midterm paper (8-10 pgs), Final paper (10-12 pgs)\n"
        },
        {
            "course_name": "Introduction to Western Religions",
            "review_date": "June 08, 2006",
            "review_content": "\nWonderful Class! Take it! Yes, Professor Deutsch can be a little boring at times, but it is worth it. Even within a lecture section she encourages active class participation which is usually based on interesting topics. While there is a lot of reading assigned, it is not necessary to do all of it. There are weekly response papers--for these all you need to do is one of the assigned readings for the week. There are only two papers assigned for the semester and they require no outside research--and the syllabus is detailed enough that you can go back and read the articles pertaining to your subject. \nAside from the in-class material, Professor Deutsch is a wonderful and interesting woman. I strongly encourage you to go to her office hours and get to know her--she has so many interesting anecdotes!\nWorkload:\nA lot of reading that you don't actually have to complete, weekly response papers--except you get two \"freebies\" and you can make up missed ones, one midterm paper (8-12) and one final paper (12-15)\n"
        },
        {
            "course_name": "Introduction to Western Religions",
            "review_date": "June 08, 2006",
            "review_content": "\nWonderful Class! Take it! Yes, Professor Deutsch can be a little boring at times, but it is worth it. Even within a lecture section she encourages active class participation which is usually based on interesting topics. While there is a lot of reading assigned, it is not necessary to do all of it. There are weekly response papers--for these all you need to do is one of the assigned readings for the week. There are only two papers assigned for the semester and they require no outside research--and the syllabus is detailed enough that you can go back and read the articles pertaining to your subject. \nAside from the in-class material, Professor Deutsch is a wonderful and interesting woman. I strongly encourage you to go to her office hours and get to know her--she has so many interesting anecdotes!\nWorkload:\nA lot of reading that you don't actually have to complete, weekly response papers--except you get two \"freebies\" and you can make up missed ones, one midterm paper (8-12) and one final paper (12-15)\n"
        },
        {
            "course_name": "Early Christianity",
            "review_date": "May 18, 2005",
            "review_content": "\nOoooh I love Professor Deutsch!  Her teaching style is reading from pre-written lectures, which can be dull, but at least she is upfront about it and you know what to expect from the beginning.  A LOT of reading, and some of it is dull, but if you put a lot in you can get a lot out.  She is also pretty admirable:  as a nun, as a prof, and as a person--if you go to her office hours, which you should, ask her about the social justice work she has been involved in.  It will blow your mind how cool she is, and make the sometimes-boring lecture style much easier to stomach.  Plus, she is caring and wants to help her students and treats them like real valuable people.  She is the cool nun Auntie you never had, and if you can get through the complicated material, you will be so glad you took her class.  \nWorkload:\n2-page response paper every week; 8 page midterm paper; 12-15 page final paper....tons and tons of reading.\n"
        },
        {
            "course_name": "Accent and Voice: Minority and Immigrant Women's Literature",
            "review_date": "May 04, 2005",
            "review_content": "\nIn this course we read good books, but each class was still, somehow, utterly boring. She has no control of the class. She allows people to go on tangents, and often joins in, when it is entirely irrelevant to the class. If you don't show up she won't do anything about it. And if you do, and dont speak, cause you obviously havent read, that doesnt hurt you either. She is a really nice woman, but is not a good english teacher. She teaches religion, which means her comments on papers suck and her grading is based on whether you  met the page length requirement. This is bad because she asks for a ridiculous number of  pages. It seemed like every other seminar had a lot less work. She barely teaches the entire semester, she makes  pair of students lead discussion every class. Also, there is peer editing for the papers, which is good if you dont have the draft done on time, but bad if you actually want solid feedback from the person who is actually grading your paper. Again, she is a nice woman  but that really isnt enough to make this class worth it. My suggestion, get the reading list and read those novels on your own time, because they are good and read relatively quickly. \nWorkload:\nAn intellectual autobiography (4-5 pages), 1 5-7 page paper,  8-10 page paper, and the final paper (10-12 pages). Each person leads class with another student at least twice. Readings are relatively decent, a book a week, but they read quickly.\n"
        },
        {
            "course_name": "Introduction to Asian Religions",
            "review_date": "December 20, 2002",
            "review_content": "\nboring as hell. run away. if you aren't a religion major sitting in the front row, you won't get an A, no matter how innovative your ideas or beliefs may be. there is no room for confrontational theory in her class...especially with Lillian, her TA. you must agree, or you must pay the price of eternal damnation in the \"B-ZONE!\" hers was the only B i've gotten at columbia and her class was equally unfulfilling......a goddamn shame.\nWorkload:\nweekly responses (1-2 pages) and 2 papers: 10-12 each.\n"
        },
        {
            "course_name": "Western Religion",
            "review_date": "April 21, 2002",
            "review_content": "\nI'm undecided about my recommendation. It was okay for me - my final grade was disappointing B+. The class was too easy to not get an 'A' despite she reportedly does not give them out. She is nice and welcoming though her lectures read (sic) at times like a bad movie, dull and uninteresting. This is not to say she isn't passionate nor knowledgeable about her subject b/c she knows her stuff. You may not learn much but it's an easy class. \nWorkload:\nI believe one can get by w/o doing most of the vast readings (the reader cost $$$) or even going to the lectures. Yep, it's that easy. My suggestion is to do the weekly (ungraded) response papers. That way you have material for the ONLY two papers. One 5-7, one 8-10. No midterm or final exam. The papers don't necessarily have to relate to anything she discussed in class so you can pretty much make up a topic for both papers. \n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "January 21, 2002",
            "review_content": "\nThe worst class I've ever taken? Easily. I can easily say I've learned nothing, and anyone who takes this class is in for a world of trouble. I have nothing more to add that hasn't been said already.\nWorkload:\n8 page midterm paper. 10-12 page final paper.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "December 17, 2001",
            "review_content": "\nThe worst class I have ever taken. Deutsch's lecture method is to read word for word in a monotonous voice other scholar's quotes, and then comment on them. In a class fo 75, about thirty went each week, and ten of those left before class was over. The weekly two-page response papers were assignments in how to bullshit. NEVER TAKE A COURSE FROM HER! You will hate yourself for doing it.\nWorkload:\nweekly 2 page response papers torn apart by the TA's, then 2 research papers, midterm 8 pgs, final 10 pgs.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "December 16, 2001",
            "review_content": "\nShe is the nicest woman ever, but boring beyond belief. She reads her lectures off pre-written speeches, but shes so nice and will hep you with whatever you need. The good thing is that you don't really have to do the readings or go to the class, and she says she doesn't give As, but its just not true.\nWorkload:\nungraded response papers once a week, 2 papers, no tests.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "December 04, 2001",
            "review_content": "\nIt is puzzling to me that other reviewers claim that Professor Deutsch is intolerant of others' views or somehow close minded. She goes to great lengths to be open and understanding of others' viewpoints. However, she is unwilling (unlike certain humanities professors) to compromise basic facts in order to boost someone's self-esteem. Thus, when someone makes a comment that goes beyond being uninsightful, and is, in fact, flat out wrong, she let's them know. Case in point, she refused to agree with several members of the class who seemed hell-bent on their own bizzarro-world definition of the word \"theology.\" (Yes, one has to be a believer to be a theologian.) Overall, a very good and enriching class. The lectures are sometimes a bit overwhelming, but this is a function of professor Deutsch's unwillingness to oversimplify the material. Since there is no midterm or final you don't need to memorize every fact. Deutsch clearly cares about teaching and about her students and is extremely knowlegeable. The readings are generally good, although there are too many of them for most people to do every one. The response papers are a bit annoying. Still, highly recommended.\nWorkload:\nWeekly response papers, an eight page take-home midterm and a ten to twelve page take-home final.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "November 10, 2001",
            "review_content": "\nAWFUL AWFUL AWFUL. This woman stands and reads an inpenitrable essay on random religious topics every week. The readings are sometimes rather interesting, if you're inclined towards the material in general, but somehow Deutsch murders it in class session. There are a great many people in the class who seem to float in once a week to hand in their papers and then skeedadle out before the brutal lecture starts. Seems like a good strategy to me.\nWorkload:\n2 page reading responses every week are required, and are mindnumbing. Also, an 8 page midterm paper and a 12 page final.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "November 09, 2001",
            "review_content": "\nRun....don't walk.....run from this class!! It was by far the worst class I have taken at Columbia or Barnard. The lectures are boring and tedious, and what's more, they're simply read from (presumably) her previous writings. As Bishop Fulton Sheen once said about preachers who need to read their homilies: \"If we can't remember it, how can we expect those listening to remember it?\" Deutsch is knowledgeable, but is not that receptive to views that vary too much from her own. Also, the readings are too heightened and are inappropriate for an \"intro\" level class.\nWorkload:\nWeekly response papers that two narrow-minded TA's criticize, as well as lengthy papers in place of the mid-term and the final.The weekly response papers are waste of effort, because even if you invest tremendous time and thought, they don't help your grade. They're simply \"standard operating procedure\" like attendance.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "April 16, 2001",
            "review_content": "\nI found her lectures uninteresting. I came in with a really fresh mind, excited to do work. I began the class reading everything, but by the end, class was so unbearable that I not only didn't read but found myself skipping class. She just reads straight from an essay she prepared before class, and although she engages you in a discussion, she rarely leaves any room for interpretation. In fact, she is one of those teachers who just expects the obvious answer, but an answer so obvious that you can't even think of it. Anyways, I used to want to major in religion, and now I am not so sure. I hope that makes a difference...\nWorkload:\na lot of reading and two papers along with small papers each week proving that you did the reading (which the TA's often lose) and which are subject to the random decision of whichever TA is grading you that week.\n"
        },
        {
            "course_name": "V1101 Introduction to Western Religion; V3407 Mysticism",
            "review_date": "December 31, 1999",
            "review_content": "\nShe's one of my favorite professors. Her teaching method is certainly not dynamic -- she writes a paper and presents it in each class -- yet she is completely devoted to her students. Don't try to write down every fact that she mentions in lectures, but instead try to get the basic idea. She's very willing to go over difficult material inside and out of class. Her workload is generally three papers. She doesn't want students to simply regurgitate what she's presented, but genuinely wants to see understanding and is willing to learn from students. The grading is tough, but she's very willing to work with students to improve their performance. In smaller classes, she tends lecture for half the class and then open the floor to discussion.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "December 31, 1999",
            "review_content": "\nI cannot say enough about how amazing this woman is. Celia Deutsch's lectures prove that she has two things few Columbia professors have in combination: thorough knowledge of her subject and a passion for teaching. Though some have complained that Deutsch's lecture style is a tad boring (she simple reads a prepared speech), I found her willingness to incorporate discussion refreshing, especially in a class of 50 or so students.\nWorkload:\nTwo 5-6 page papers and a 10-page paper in lieu of a final. Papers require no research beyond the books read for the course.\n"
        },
        {
            "course_name": "Introduction to Western Religion",
            "review_date": "December 31, 1999",
            "review_content": "\nI took this class as a first semester freshman and so I was terrified when she began lecturing a mile a minute, pausing only to announce that she \"doesn't give As\". As it turned out though, she may not give As but her TAs do, and the fact that I stressed out over actually doing the readings turned out well for me. Fascinating stuff.\nWorkload:\nTons of reading, but your grade is based on papers of your topic choice, so you can cheat a bit.\n"
        }
    ]
}