{
    "prof_info": [
        {
            "prof_name": "Steven Mintz",
            "prof_id": 3685,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "American History Through Sight and Sound to 1877",
            "review_date": "May 10, 2010",
            "review_content": "\nBest professor in the entire world. Hands down. Kind, passionate, brilliant, interesting. He actually cares about what he is teaching and his students. One of the most humble people I have ever encountered in this school. I took his American History through Sight and Sound until 1877 seminar and then the same seminar with him for post 1877. The class itself is wonderful. Mintz believes that music, art, film, dance, etc. are historical texts that should be studied. A 2 hour class flies by as you are inundated in the cultural wonders that are usually skipped over in other classes. Mintz will also just drop little anecdotes that are just fascinating and that leave you wondering how they are left out of history--and also, how does he know all of this?\nOf course, the class still has reading even though we learn about different historical mediums. The reading though is probably some of the best I have had in my four years here. And it is super manageable. Seminar reading is always the first thing to go when you are pressed for time (not tested), so I began to think of Mintz's reading as a luxury--something I would reward myself with. \nProbably the most original part of the class is the final project in which Mintz has every student create a mini movie on some historical topic that they have written a research paper on (~12 pages). You can do it on iMovie and he goes through the process repeatedly. It is challenging if you are terrible with computers like me but in a good way. He wants you to really use different mediums to recreate history. At the end, you feel accomplished, especially since everyone presents to the class their movie. \nIn addition to this final research paper and movie project, there are about 3 mini papers (3-4 pages) throughout the semester based on the readings for that week.\nWorkload:\nWeekly reading, 3 mini papers, 1 final paper and movie project.\n"
        }
    ]
}