{
    "prof_info": [
        {
            "prof_name": "Ji Meng Loh",
            "prof_id": 1785,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 14, 2007",
            "review_content": "\nNot sure why everyone's bitching about this class.  Loh's good at explaining concepts in class and uses a lot of examples to demonstrate them, so you can figure out what's going on just by copying stuff off the board.  He really goes overkill with this, to the point that half the class can become boring repetitive examples (but at least you're sure to learn the concepts, if you can stay awake).  The first half of the semester is just basic probability and basic statistical concepts and you only really need to go to every other class, if that.  It gets a little harder for the second half of the semester and I'd recommend actually going to class at that point- he's great at explaining stuff you don't already know.\nHe also gives a good list of midterm and final review material so you get familiar with what you have to know (he'll also tell you in lecture whether something will be tested).  In order to do well in this class, you just have to do the homework yourself- if you do the homework, then you'll know all the concepts for the tests.\nWorkload:\n15%: 11 Homework sets that take less than 2 hours each.  He drops the lowest homework grade.\n35%: Midterm.  Very easy as long as you understand the basic concepts.  You get one double-sided cheat sheet.\n50%: Final.  Harder than the midterm (with a curveball or two) but you still will do fine if you understand the basic concepts.  You get two double-sided cheat sheets.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 21, 2006",
            "review_content": "\nJi Meng Loh does explain the concepts in this class fairly well but expect to spend a lot of time outside of class going through concepts he did not. This way be an introductory course but expect to spend a long time trying to figure out concepts and doing his long and tedious problem sets. I don't agree that this is an easy A. He tries to keep the number of A's he gives out to around 25 percent so I gather he curves to b-/b. Well, the quote of the semester would be what he said just before the final. 'If you have done your work consistently throughout the semester, you SHOULD not get anything LESS THAN a C-' - Ji Meng Loh\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 13, 2006",
            "review_content": "\nProf Loh expects his students to put in a good deal of work. But he said this straight out on the first day. This is not an easy class, but Loh said he was trying to prepare us for Econometrics. The good news is, he is a decent teacher. He is organized, covers the material well and is very accessable.\nThe good news is, if you are willing to put in the work--this class is an easy A. \nTests are hard but the scale is good.\nOverall, Loh is a no BS decent guy. Good class.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 20, 2005",
            "review_content": "\nHorrible teacher, \"nice\" man (not overly nice as some reviewers here would have you think). Not too willing to help his students. He chose horrible TAs. The solutions he gave to the sample final did not show how he arrived at those answers. 1211 with him is really bad. HUGE AMOUNT OF WORK ASSIGNED.\nWorkload:\nABSOLUTELY HUGE.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 19, 2005",
            "review_content": "\nThere are no words sufficient to express the horror of W1211 with Ji Meng Loh, but I'll try: the homeworks take a long time, but when you get to looking at them for the tests, you feel that they're basically pretty doable. He gives a sample midterm and final that seem pretty doable as well- BUT, his tests throw a large amount of questions at you completely out of left field. He'll ask stuff he never went over. I'm not exaggerating, and please believe me for your own sake, this was the worst class I have ever taken in my life. He can't explain concepts in class. he's ok in office hours (nowhere near as great or nice as some people here are making him out to be).\nWorkload:\nA HUGE AMOUNT. Weekly p-sets, midterm, final. He acts as though this is the only class you're taking, even though it's 1000 level.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "October 01, 2005",
            "review_content": "\nProfessor Loh is a dedicated teacher who is easily accessible. The material in this course wasn't too difficult, just put in effort and you'll get a good grade. \nWorkload:\nWeekly Problem Sets; Midterm; Final\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 13, 2005",
            "review_content": "\nA no-frills professor who goes over all the topics in detail.  The classes are quite boring, but hey it's stat so deal with it.  He answers questions in class and is flexible with his office hours.  Probability took up quite a few lectures.  He has a sense of humor that sometimes shows through unexpectedly in class.  The weekly required recitations are a hassle.\nWorkload:\nWeekly problem sets (most include an annoying Stata exercise), weekly required recitations, a midterm and a final.  Not hard to get an A.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor Loh seems like a nice guy.  He posts all of the lecture notes online, and is welcoming to students.  When it comes to teaching, however, he is poor.  He spends a lot of time on abstract concepts, which are quite hard and confusing.  He seems to think that his class is the only class that students are taking, and thus assigns a huge amount of work.  Problem sets take forever, and are difficult.  Tests are painful.  Overall, take this class only if you need 1211, it is not a fun class and Professor Loh doesn't make it better.\nWorkload:\nProblem Sets (weekly, took a long time), Midterm,  Final\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 05, 2005",
            "review_content": "\nOh god.   Here's a clue about how bad this class was.........20 min into the final a girl ran out crying......yeah it's true. This class was so rough.  We started the first week out  easily what's an avg? what's a mean?  Prof. Loh uses slides that he posts online and taught from the slides. Logical nice cool.  Then the stuff got really abstract.  Albeit I probably got a C in the class so if your'e not a strong stat student then you know where I'm coming from.  The recitation's were the only way to be able to do the homework which took hours to do.  My recommendation is to go above and beyond the call of duty. I couldnt' go to office hours but you kind soul must do all the reading AND read the slides AND go to lecture if you want to do well.  There IS a good side though. He curves hard and strong.  \"I think very hard before giving a C\" -J Loh\nWorkload:\nWeekly homeworks straight outta the book with STATA- couple hours, midterm-pretty rough, final-rougher\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 03, 2005",
            "review_content": "\nI didn't really like this class. Prof. Loh did not do a good job teaching during class. The first part of the class is easy enough where a quick read through the book can fix the poor teaching, but towards the end of the course, the terms and calculations get very complex and Prof. Loh tends to understate the basic principles of such difficult concepts. I hear he's a good teacher during office hours, but I had another class at that time so I couldn't go. What's the worst about the whole class is that attendance is required for the lecture and the recitation. It makes up 5% of your grade, and missing one class means a reduction of your participation grade by one point, so if you miss five classes, it will really affect your grade. He teaches as is he's punishing us for his bad luck in being assigned to teach such a basic and boring class. Needless to say, this style doesn't help you learn and it only makes you fear Econometrics.\nWorkload:\nProblem Sets every week. Sometimes there are Stata assignments that are both useless and frivolous. Pop quizzes when he thinks not enough people are coming to class. One midterm, one final. Watch out - this guy likes to ask definition questions on the tests, and if you can't explain math in words, you won't do well.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 10, 2004",
            "review_content": "\nJ Lo is by far the worst professor in any department at Columbia. Never take this course, but if you are an econ major you will have no choice so avoid him if you can. Your life will be destroyed attempting to do his problem sets. The practice midterm was a breeze and the midterm was a bleep*. Time in class is best spent napping, that is if you can convince yourself to go. At times i concidered him a sadomassochist!\nWorkload:\nToo much for a 1000 level course. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "August 19, 2004",
            "review_content": "\nProfessor Loh is a nice, quiet man who is unfortunately easy to fall asleep in front of.  His class was fairly straightforward and relatively easy to follow.  He teaches from slides which he also gives you a copy of, so it is not hard to follow along, and if you miss a class, it is easy to catch up on the notes, since you have most of them already.  Not particularly exiciting or engaging, but at least he shows definite interest in having the students learn as opposed to some Profs in the Math and Statistics department, who often couldn't care less about their classes.\nWorkload:\nWeekly problem sets that can get pretty time consuming, midterm, final.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "June 23, 2004",
            "review_content": "\nIf you like probability, this is a good class. Ji Meng Lo teaches very slowly, carefully taking apart probability questions in a slow, step-by-step manner. He is a funny oddball of a man, and the class is a very interseting group of characters who are all really smart. at first, the class is very easy, basic probability questions about the probability of randomly picking such and such, basic stuff. \nThe first midterm is a breeze, he even lets us have cheat sheets (two sided page). The 2nd half, however, might take a little extra work, the pdf's and the pmf's get quite complicated and by the end you have to put in that extra effort. If you get the math, you can get this class, and do well. Rest assured, the class is full of math majors so the average is high, so like they say, if you can't stand the heat, get out of the kitchen. Class attendance was very high, too. I checked my problem sets online at other colleges, which was helpful. The book ain't bad either, but this class can get boring. If pdf's and pmf's and funny questions about randomly picking matches out of your pockets and figuring out which pocket is likely to have the last match, then you'll do just fine.\nWorkload:\nWeekly problem sets (doable), midterm, final\n"
        },
        {
            "course_name": "W4315-Linear Regression",
            "review_date": "May 12, 2004",
            "review_content": "\nHeavy homework load. Even though it's due every 2 weeks, the homeworks are more like projects or midterms. By the time you finish doing one, you only have 1 week left to do the next one.  His tests are nothing like the homeworks he assigns and difficult compared to the homeworks.  His lecture notes are easy to understand, but he's a low talker and writes microscopically on the board.\nWorkload:\nHomework Project due every 2 weeks\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "April 24, 2004",
            "review_content": "\nSolid teacher. Provides slides online. Fairly easy course with weekly problem sets. Willing to help student out in office hours. \nWorkload:\nWeekly Problem Sets, Midterm Final. He taked about in class quizes but never gave any. \n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "April 16, 2004",
            "review_content": "\nStatistics sucks.  I don't think you'll ever find an enjoyable stat class.  With that said, Ji Meng Loh make stat pretty painless.  He's really nice, lectures at a good pace, and provides PowerPoint printouts of his lecture notes.  Problem sets take some time but are mostly taken out of the textbook so they're not difficult.  The TA I had blew chunks, but that didn't matter too much since Prof. Loh was quite sufficient in teaching the material.\nWorkload:\nStandard.  A problem set every couple of weeks.  Supposedly a few pop quizzes, but we only had one the entire semester.  Easy midterm, slightly harder final but if you study it's quite doable.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 16, 2003",
            "review_content": "\nA nice guy, Prof. Loh is very accessible outside classtime if you ever need help. The course material itself is straightforward; even though calc is a prerequisite, you don't ever use it on the exams. He posts lecture notes online. The only negative is he takes attendance at lecture and at the useless recitation section. \nWorkload:\nWeekly problem sets (questions from the book) including some Stata, pop quizzes (we had 1 and it counted as a homework grade).  The midterm and the final were both much easier than the homework.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 11, 2003",
            "review_content": "\nOverall a good no frills teacher. He is not really exceptional. Good lecturer, provides the slides online. Homework assignments are reasonable. The biggest downside is that he takes attendance in class and recitation. Everyone seems to do well in this course. Easy A\nWorkload:\nWeekly problem sets, Midterm, Final. \n"
        },
        {
            "course_name": "Probability",
            "review_date": "November 17, 2003",
            "review_content": "\nVery hard to understand what he is saying. decent guy. class sucked. its starts off easy for the first month but after the midterm get real hard.\nWorkload:\nWeekly problem sets, which get harder and more time consuming. midterm final\n"
        }
    ]
}