{
    "prof_info": [
        {
            "prof_name": "Marco Pagnotta",
            "prof_id": 12363,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "June 08, 2015",
            "review_content": "\nI took Chem 1403 with him. I got a C+ with a 50 on every exam.\n-teach yourself, read the textbook\n-OWL IS NOT MANDATORY (it does bring the eBook though)\n-You do not need to buy the clicker or workbooks\nLecture:\n-he does practice problems in class like the ones on the test\n-he tells you what questions will be like and gives hints to what questions will be on the exam \n-he teaches you how to solve problems time efficiently\n\nWorkload:\n3 midterms, he drops one (I only took 2 exams)\n1 final\nall doable if you actually learn and study\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 08, 2014",
            "review_content": "\nHuh. My experience with the class was a lot different than the rest here. I got a B+ (despite doing much less work than I should have and not taking advanced chemistry in high school). I found the tests fairly easily, and got A's after the curve on most of them. The quizzes, however, were deadly. My TA gave some that were deadly (I don't remember his name, unfortunately!), and they dragged down my grade tremendously. But in terms of Pagnotta, I didn't mind the lectures, I liked his use of real reactions in class, and I found the food science interesting (though I am someone who watched a huge amount of Alton Brown as a kid). Overall, not a bad experience.\nWorkload:\nBrutal quizzes, but fair midterm and final. Optional OWL problems.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 07, 2014",
            "review_content": "\nIf you ever get the chance to take this professor..wait did I say chance? Oops, I meant MISFORTUNE! He is ABYSMAL. And take all is this into consideration because this is coming from someone who made an A- or higher in the class. For one, his T.A.'s give quizzes that have nothing to do with any of the reference material for the course. You can memorize that horribly made book and still be ready for none of what they portray in the recitation sections. Tests were often unfair. If you try to debate with him about a point on the test, his argument is that grades don't matter and one point won't affect the difference. This is all false, faulty logic that is construed also when he lectures. He lectures very bizarrely and can sometimes go on for half an hour about a particular food. Sorry, if I wanted to take Home Ec 101, I would've signed up for that..NOT general chemistry. Furthermore, expect to spend about 5-6 hours a week memorizing the insane/inane details in the book. But I won't pretend like this will prepare you for the exams. If you want even a CHANCE of getting an A- or higher then make sure you do a bunch of random problems because he can literally throw any problem remotely related to chemistry at you. Overall, you don't really know how you're doing till the end and don't assume that doing above the mean will guarantee you an A in the class. You gotta be making some kinda A to make an A in the class generally-- unless you miraculously understand the quizzes or are a chem genius. If you have any other option, take that professor. In fact, take Parkin, I hear you at least know what's going on. In Pagnotta, expect to be confused every single second.\nWorkload:\nNone. Don't take the class just don't. It's a bad decision. I don't even want to know if I want to do medicine anymore.(And I made a high grade).\n"
        },
        {
            "course_name": "General Chemistry 1401",
            "review_date": "December 19, 2013",
            "review_content": "\nSo... Marco Pagnotta may be a very intelligent professor but as a teacher he just isn't cut out for the job. He basically reads over his powerpoints and doesn't really \"teach.\" I also took chemistry lab this semester and I can say that the lab was a million times better than general chemistry regardless of the demanding workload. Pagnotta doesn't really assign homework except for the optional OWL problems that may help on the quiz depending on your TA. As the other review mentioned, the average for the tests and quizzes is usually a 60%. If you are a chemistry major or interested in actually learning chemistry I would recommend that you choose another professor. However, If you are stuck with Pagnotta, just know that his practice exams don't reflect the difficulty of his real exams. Lastly, I would recommend not falling behind (since many people just choose not to go to class) and doing the practice problems from the book. \nWorkload:\nNo homework except for the optional OWL problems. 3 exams and a final. \n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 15, 2013",
            "review_content": "\nWhere to begin...\nPagnotta is a nice guy, really. He seems to try hard to engage students with tiny offerings of \"chem in real life\" examples and \"use your phone to text in an answer\" practice questions. \nBut when it comes down to it, his lectures seem somewhat disorganized and his powerpoints are not helpful at all. 80% of the class seemed to have disappeared after the first two weeks of the semester - left to their own devices to try to stay afloat in what ends up being a sort of weed-out course. While OWL work is optional, tests and quizzes are, unfortunately, not. \n...and those tests and quizzes are killer. \nQuizzes are based off of who TAs the class. Unfortunately, none of the TAs this semester seemed to be too great - quiz averages were in the low 60s. Tests went the same way. Students were left frazzled, frustrated, and wanting to never touch chemistry ever again. \nIt's a very discouraging class. Really. And this is coming from an engineer. \nPagnotta supposedly curves everything at the end of the semester, but he doesn't tell anybody by how much, or when, so you're stuck hyperventilating over what your grade could possibly be right up until the end. \nI wouldn't recommend him, but considering the fact that almost all of the chemistry professors seem difficult to handle... he might be one of the better of the worst. \nMaybe. \n...just maybe. \nWorkload:\nNo workload, but you better study your behind off before tests and quizzes if you don't want to come out of the lecture hall feeling violated. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 16, 2013",
            "review_content": "\nHe returned from a long leave of absence this year to teach Gen Chem, so there were no reviews going in. He basically reads off of Powerpoints that he uploads onto Courseworks, so it was no surprise that a large part of the class did not attend lecture on a regular basis. Class was not boring, persay, since his commentary was lively enough and his speech was often punctuated with very loud emphases on various random words. He had a useful acronym, \"DGQQ,\" aka Damn Good Quiz Question, which he used sometimes. A fair amount of good practice questions in class, and he liked using polls that involved texting in answers and seeing what percentage of the class got it right, etc. All in all, an OK, not outstanding lecturer.\nThe part of the class I wanted to emphasize the most was OWL. Most people I knew seemed to hate it, since it was mandatory, very time-consuming, and tedious. Although that's true, OWL also was a huge help to me, since it was a vast database of practice questions, all very similar or identical in style to the questions that Pagnotta puts on his midterms and finals. It's a lot of grunt work, but suck it up. That grunt work gets you the A. If you do the OWL questions before the exams, you should be looking at a very good grade. If you're not willing to put in the effort, you fail. Spectacularly. Not brain surgery to be honest.\nOverall not a bad class. You put in the work, you learn what you need to learn, then you get a good grade. \nWorkload:\nWeekly quizzes in recitation. They can be tough if you're not caught up with what's been going on in class. Three midterms and a final, all fairly easy if you did a lot of OWL practice. He drops your lowest midterm score. The final was perhaps a bit harder than the midterms. No homework, but he announced sometime near the end of the term, to the devastation of many a student, that the required OWL exercises were, in fact, required. The quizzes + OWL together were only worth 15% of the grade, I think.\n"
        }
    ]
}