{
    "prof_info": [
        {
            "prof_name": "Deborah Becher",
            "prof_id": 11026,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Law and society ",
            "review_date": "December 26, 2016",
            "review_content": "\nI have very mixed feelings about this class. The topic itself is very interesting to me, and I did many of the readings and was really fascinated. Most of Becher's lectures were also insightful - she is clearly so so smart and has a lot of knowledge to share, but sometimes the class would feel really loose, almost like she wasn't prepared. Overall though, the readings and the lectures were the good parts of this class for me, and I do think I learned a lot of useful information. \n6 or 7 of the lecture days were given up as group work days.  While the group work was sometimes helpful, I think there was too much of it, I would have preferred a bit more lecture by Becher. Even on days when she did lecture, she would often open up the floor to us, asking us questions, but I found this to be very problematic, because either no one would answer and she would get frustrated (instead of just answering her question herself), or someone would answer, and very often she would push them on their answers and go head to head with students. This wasn't like nice, academic discourse, it was really a professor arguing down a student. I felt afraid to speak in her class because I didn't want her to argue with me in front of the entire room. \nThe written assignments for this class were my biggest problem. The prompts were very specific but also convoluted, and I had a lot of trouble understanding what Becher was going for. They require a great deal of time in the preparation/ research phase, Becher asks for very specific kinds of sources as well. Grade wise, these assignments end up carrying by far the most weight, and my confusion with the prompts ended up killing my grade in this class. \nShe also really didn't seem to care about piling the work on at times. We would have weeks where we would have a written assignment due at 5 pm on Sunday and a group paper due the next morning for which we had to read an entire book and watch a movie (and then work on our portion of the paper.) All in all, I learned a lot in this class but it was a lot of work and there were many frustrating aspects. \nWorkload:\n- fair amount of reading or viewing for each class, I didn't do all of it but it's really interesting and also her lectures make almost no sense if you don't have the background from the reading \n- 5 700 word reading responses on two of the readings from that week, you choose which 5 weeks \n- 6 group papers (given in class time to work but we did a lot of work outside of class on these as well) \n- 3 3 page single spaced papers \n"
        },
        {
            "course_name": "Law and society ",
            "review_date": "December 08, 2016",
            "review_content": "\nThe concept of law and society is great, and the readings are very interesting. However the professor is sometimes all over the place, not the most focused lectures. That being said she's very nice and accommodating. \nWorkload:\nThree essays, group work, 5 reflection essays but one is dropped \n"
        },
        {
            "course_name": "Social Theory",
            "review_date": "May 13, 2016",
            "review_content": "\nAll of the reviews of Becher are spot-on. She's funny, casually brilliant, and able to take really dense material and make it understandable. I was dreading taking social theory because it's tons of dense reading, but Becher made it manageable and was clearly enthusiastic about teaching the material. She's the kind of professor who wants you do to well, and with whom you will want to do well. She's also one of the few professors who was able to take a class of more than 30 students and have q-and-a sessions that were productive.\nSome of the small group work we had to do was tedious and annoying, but you get through it. Every assignment she gives, even if there are a lot of them, has a reason behind it. She has a very clear idea behind how to teach social theory and she conveys that really clearly.\nWorkload:\nHeavy. Reading that can range from 15-80 pages depending on the day, but all of it is super necessary. Assignments that range from 1,000-1,200 words. Tedious, but annoying. Midterm and final exam. Occasional group work.\n"
        },
        {
            "course_name": "Social Theory",
            "review_date": "May 13, 2016",
            "review_content": "\nAll of the reviews of Becher are spot-on. She's funny, casually brilliant, and able to take really dense material and make it understandable. I was dreading taking social theory because it's tons of dense reading, but Becher made it manageable and was clearly enthusiastic about teaching the material. She's the kind of professor who wants you do to well, and with whom you will want to do well. She's also one of the few professors who was able to take a class of more than 30 students and have q-and-a sessions that were productive.\nSome of the small group work we had to do was tedious and annoying, but you get through it. Every assignment she gives, even if there are a lot of them, has a reason behind it. She has a very clear idea behind how to teach social theory and she conveys that really clearly.\nWorkload:\nHeavy. Reading that can range from 15-80 pages depending on the day, but all of it is super necessary. Assignments that range from 1,000-1,200 words. Tedious, but annoying. Midterm and final exam. Occasional group work.\n"
        },
        {
            "course_name": "Social Theory",
            "review_date": "April 01, 2012",
            "review_content": "\nProbably one of the best professors I've encountered at Barnard/Columbia. Not because she's sweet and friendly (though she is- she baked us all cookies for our last day of class), but because she communicates effectively and teaches the material so well. \nI was dreading taking Social Theory- the material is dense and boring and the readings are impossible to understand unless you read them four or five times. However, Becher does such a great job communicating the ideas, I always left class understanding the concepts with clarity. She leads class discussion very well but doesn't let the class go on tangents or mislead the conversation into convoluting the ideas. Let's just say that anyone who can make reading Weber bearable and easy to grasp deserve props. \nI agree with the review below, you MUST put the work in. She is no-nonsense. Don't expect to do well if you halfass your assignments or hand them in late. Do the readings. Participate in class and most definitely go to office hours even if its just to talk about the questions on the assignments (she or the TA will carefully walk you through them). If you put in the work, the class is easy to do well in.\nWorkload:\ncan range from 15-80 pages of reading between each class- however she never assigns unnecessary readings, 4 assignments (short answer/mini essays - about three pages each), mid-term, final \n"
        },
        {
            "course_name": "Social Theory",
            "review_date": "November 17, 2011",
            "review_content": "\nSummary: Prof. Becher is a great teacher. If you put in hard work, you will get a lot out of her class. You will actually learn, and probably enjoy, the material. Becher doesn't take any bullshit and leads the class firmly. \nI was worried about taking Social Theory (it's one of 3 main required classes for the sociology major and seemed like it would be boring/really difficult), but Becher has made it interesting, applicable, and even enjoyable. She is not easy by any means, but if you work hard, you will do well. The class has about 30-40 students in it, and Becher somehow manages to skillfully lead lecture and class discussion every time - there is always a nice balance. Her lectures are clear and concise, and she always clarifies if we don't get what she's saying. She answers questions well, and is almost always open to hearing our opinions. \nIf you're going to take Social Theory and will put a good amount of work into it, take the class with Becher. You will learn a lot and actually remember it. This class is not about memorizing and verbally vomiting the textbook on exams. Don't take Becher if you regularly skip class and/or don't do readings. The assignments really test our grasp of the material, as do the exams. \n\nWorkload:\n4 assignments (2-3 pages single spaced)\noccasional pop quizzes (she counts the top 3 for our grade. about 9 overall)\nmidterm exam in class\nfinal exam\nrelatively high percentage participation grade\n"
        },
        {
            "course_name": "Social Theory",
            "review_date": "May 18, 2011",
            "review_content": "\nThis is the professor's first semester here at Barnard, and I cannot speak highly enough about her teaching abilities. I enrolled in this course purely to fulfill my major requirement and had been dreading taking it since declaring my major. The material is dense. And boring. But Becher did the best she could to make the information accessible and to give you the chance to do well in the class. I would HIGHLY recommend going to her office hours before the assignments are due, she will literally go through rough drafts with you and steer you in the right direction. By doing this, you're basically guaranteeing yourself a good grade. It's a lot of work, with little room for bull. But you can do well versus other classes of a similarly challenging nature where your grade is a lost cause even if you spend an extra hour on the paper or assignment. When going through the course itself, I often felt a little bit lost, but looking back, I can see she has clearly thought through the structure of the course and planned it meticulously. One annoying thing, which I hope she does away with, is that she has you watch 2-3 episodes of The Wire at the conclusion of each theorist. I know the intentions are good and supposed to help engage you more, but the episodes are an hour each and as much as I love any excuse to watch TV and call it homework, it was time consuming and often would be at the expense of catching up on other readings which, at the end of the day, are the real substance of the course.\nWorkload:\nFairly heavy, but consistent...4 assignments that are 2-3 pages single spaced, pop quizzes at the beginning of class (we had 9, but it's at the professor's discretion), 1 take-home midterm that was open note, but had a 90-minute time limit, and an in-class 3 hour cumulative exam\n"
        }
    ]
}