{
    "prof_info": [
        {
            "prof_name": "Crystal Kim",
            "prof_id": 12516,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 10, 2013",
            "review_content": "\nIf you got Crystal as a U Writing teacher, you are really lucky. University Writing is not a class that many people like, but it is an experience that everyone should appreciate. I did not like UW, not because of Crystal, but because I have a hard time writing. In the end though, I got a ton out of this class and definitely improved as a writer. I went from feeling lost within every paper I wrote, to knowing exactly what it was that I needed to concentrate on, and a format that I could fall back on. Crystal really pushes you both in class and in your writing, but at the same time she is very reasonable in her expectations. She is easy to talk to and wants to help her students.\nJust like any UW class, there is a lot of work, but it is spread out reasonably, and the structure forces you not to procrastinate quite as much as you could. The readings for this class were engaging, but not overly long as they often are in other UW classes. There are 4 main papers each with drafts and other work before hand. Crystal is strict about attendance and tardiness, don't be late.\nWorkload:\nReasonable for a University Writing class - readings and 4 papers each with drafts and other small assignments building up to them\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 08, 2012",
            "review_content": "\nCrystal is amazing. I thought I was going to hate UW because of everything I'd heard about it, but she managed to make this course so much more enjoyable than I'd thought possible. Yeah, there's still a lot of reading/writing exercises which can sometimes get annoying, but they're not arbitrary and they actually have a purpose. Every single exercise Crystal made us do ended up being really helpful when we had to write our final essays. Meaning, she never made us waste our time on pointless work. Crystal is really approchable and funny and genuinely cared about everyone in the class. Despite the fact that we had class at 8:40, she made it easy to be engaged and stay focused. She explained the concepts we were learning clearly, and managed to make in class discussion entertaining while still staying on topic. She's always ready to meet with you outside of class, and her grading and feedback on assignments is very fair and helpful. On days when we had papers due, she brought us cookies and bagels to make us stop stressing out. Basically, if you get in this section, you're really lucky. Crystal made this class awesome.\nWorkload:\nShort writing assignments for every class, but she doesn't grade them. The usual reading (like 3 or 4 essays a month) and the usual 4 papers.\n"
        }
    ]
}