{
    "prof_info": [
        {
            "prof_name": "Alice Boone",
            "prof_id": 3026,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 06, 2007",
            "review_content": "\nAlice is one of the better University Writing professors, from what I can tell from the comments friends have made about their University Writing classes.  The articles she chooses for you to read for each progression (there are four - lens essay, conversation essay, research essay, and retrospective essay) are interesting for the most part.  Discussions of the essays in class, however, can become tedious because what's being discussed is how the author writes, rather than what the article is about (which makes sense for a writing class, but is boring regardless).  She livens up the class sometimes with weird anecdotes that reveal either endearingly strange personal qualities or her extensive knowledge of weird subjects.  Her best quality is the fact that she makes very good comments on your drafts. Definitely schedule meetings with her about them.  At first I was skeptical about her comments, but in retrospect I realize that they really made my essays, and my writing skills in general, much better.\nWorkload:\nRead 1-2 essays and complete a brief assignment on them for most classes, write 4 essays throughout the semester, no more work than other U Writing classes\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 30, 2007",
            "review_content": "\nAlice is really a fantastic person who is more than willing to help you if you're willing to give University Writing some effort. She can be a bit spacey at times and we would occasionally get off topic during discussions, but for the most part she pushes you to write about something you care about. She's really pretty flexible with the topics as long as you're able to justify why you want to write whatever. She also is pretty nice about due dates as long as you're willing to talk to her and explain yourself. Although she's a grad student and the University Writing curriculum is kind of bunk, she really is pretty knowledgeable about the readings and topics that come up in class but doesn't come across as an obnoxious grad student.\nRead something by Joan Didion and she might just love you forever.\nWorkload:\nNot too bad: There were minimal assignments outside of the standards essays. She grades a little harsh at the beginning of the semester but it's just to get you to try harder. She definitely grades fairly and takes note of your effort as well as your writing skill when deciding scores.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 12, 2006",
            "review_content": "\ni mistook her for a student on the first day of class.  she graduated from barnard (negative) but was the editor of the spec (positive).  a little strange, but at times quirky in a somewhat enjoyable way.  she always answeres your questions with questions and cant explain the difference between a conversatin essay and a lens essay (not really her fault tho, they're both bs constructions).  she loves overanalyzing how writers make their arguments in class by listing the \"features\" of the essay and identifying the \"exhibits.\"  that kind of vocabulary gets annoying.  it's also annoying how she uses the word \"vocabulary\" to mean much broader things.  she's very serious about a lot of bs stuff.  often times the time in class is a complete waste.  her comments on essays make you change your ideas and pretty much write a whole new essay.  she knows a lot of detailed random facts about movies, books, etc.  her best quality: one day in class she very seriously recited some of eminem's lyrics and then continued to talk about flavor flave in flavor of love, also very seriously.  just ironic.     \nWorkload:\nthe usual reading and writing essays, nothing extra.  some bs in class stuff that is never turned in so u dont really have to do it.  \n"
        }
    ]
}