{
    "prof_info": [
        {
            "prof_name": "Benjamin Martin",
            "prof_id": 1997,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 05, 2004",
            "review_content": "\nBen Martin will probably be the best teacher I will ever have at Columbia.  As the other review states he is only a graduate student, but he knows how to run a class.  He lectures for 5 minutes at the beginning of each class about the life of each author, but that is the longest you will ever hear him speak consecutively in class.  His questions are very well formulated and he strongly encourages student participation.  The discussions are incredibly enlightening and thought-provoking, (I was especially lucky to have a fairly opinionated and diverse group of talkative classmates).  My favorite aspect of Mr. Martin's teaching was that he never brought his personal opinion into the classroom.  \nHis grading can be harsh -- he is a former Chicago University student.  His assignments are challenging yet have really improved the way I think critically.  I strongly recommend taking CC with him if you can, you will not regret it.  \nWorkload:\nAverage, 2-3 @ 6 page papers.  Reading is heavy but well selected.  He often makes last minute omissions to help out during crunch times.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 18, 2004",
            "review_content": "\nBenjamin Martin is the best professor I've had at Columbia and he's a grad student. He is incredibly engaging, refuses to lecture, guides the class through the key points every text while never spelling them out, and he kindly sends out question lists before every class session to guide the reading. He pushed every one of us to improve immensely in our writing and clarity of argument. He doesn't allow for shooting off at the mouth unless you cite the text, which encourages you to read closely and carefully while taking notes. This class has changed my life and I wouldn't trade anything for it.\nWorkload:\nAvg. CC workload, perhaps on the heavier side in terms of books assigned, but he doesn't give more reading than is possible and frequently edits down the readings by page number, preferring to lighten the load in the interest of closer reading. Though the workload is avg, you'll want to engage every text to prep for exciting discussions. He's also a fair grader in the end, thoug you have to work hard for it. He went to U Chicago and retains some of that grades-are-worth-more-than-blood seriousness, but if you work hard he rewards you. Don't screw around and it will pay off for your mind and your grade.\n"
        }
    ]
}