{
    "prof_info": [
        {
            "prof_name": "Isaura Arce-Fernandez",
            "prof_id": 10090,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "April 10, 2015",
            "review_content": "\nIsaura is a fantastic.  Her teaching style is artistic, she uses her creativity in every class.  Her innovative approach to language learning combined with her tech savvy bring the lessons to another level. She is organized and pleasant.  If you want to learn Spanish and gain fluency take her courses.  Her feedback is second to none.  She offers a detailed response that often includes resources that elaborate on the subject at hand.  I've found the resources to be so very helpful.  She loads Courseworks up with resourceful material that proves helpful in self-study.  She is approachable genuine, and kind.  \nWorkload:\nThe name of the game is immersion.  She does not want students speaking English.  It takes some getting used to, and a little courage ... but its worth it.  Jump on in, give it your best and she will help you along the way.  The more you practice in class, the more you will walk away with after class.  The workload is pretty standard otherwise, in line with the departmental requirements.  Issuer likes films, and if she can work a film into the lesson, count on it.  Take her class, she's gold worthy.  \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "January 09, 2014",
            "review_content": "\nShe's great! She really focuses on conversation and therefore a lot of time in class is spent conversing (participation is 20% of the grade and it seems as though she's pretty generous w/ the participation grade as long as you actually participate, which it seems impossible not to).  \nAlthough in class she emphasizes practicing speaking the language (vocabulary) I feel like the tests and homework emphasize grammar. The grammar in elementary Spanish is significantly easier to grasp than the grammar in intermediate. However, I feel like the sequence (w/ her) is definitely manageable as long as you put in effort and stay on top of all of the grammar. \nWorkload:\nusually 2 homework assignments a week (vary in length, usually very short unless there is a passage to read and the longer assignments she allows more time for you to complete), 4 short compositions, watch 1-2 movies outside of class, 1 project/presentation that you have a few weeks to work on (w/ partners), midterm (created by the department), oral exam, written final (created by the department)\n"
        },
        {
            "course_name": "V1101-V1102 Elementary Spanish",
            "review_date": "March 04, 2013",
            "review_content": "\nIsaura is a wonderful professor. She is kind, sweet, funny, patient, and understanding. You can tell that she absolutely loves her job and is determined to help you learn the language. Her assignments are often fun and quirky. I wish I could take all four semesters with her. \nShe is such an incredible person. She is always sympathetic to illness or other emergencies. She fully understand that life extends beyond 110th street. For A GS student like me, this is crucial. She is always willing to work with you as long as she knows the circumstances.\nAbove all, her exercises and in-class practice really helps you learn the language. She makes the class fun, almost everyday. I believe this enjoyment is key to learning the language. If the class were boring or tense, I'd probably hate the language subconsciously. Isaura understands this and does her best to keep everyone fully engaged.\nWorkload:\nAverage. A mix of online exercises (MySpanishLab) along with handouts or grammar book exercises. Never overwhelming.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "December 14, 2011",
            "review_content": "\nI absolutely love Isaura. She makes class enjoyable, so much so that Spanish went from my least favorite class to my favorite. She really wants you to learn, and she never makes you feel silly for asking a question. She also has a knack for explaining things in ways which are clear and that I really understood. There was a lot of Spanish speaking in groups and also as a class, and it was fun and also helped the students get to know each other (which was really nice and doesn't always happen). Homework was standard, and there were 4 compositions. She's terrific, you won't be sorry if you take a class with her.\nWorkload:\nFair, average\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "November 17, 2011",
            "review_content": "\nNot only is she a wonderful instructor, but she is also a wonderful person.  Classes were informative and she would happily go over grammar and vocab.  Sometimes they'd get boring just because we would be doing work in groups and she gave us way to much tie to complete the assignments, so you just end up talking in english, which she doesn't really care about.  This class manages to be easy and help your Spanish.   She gives A/A+ on almost all writing assignments and really wants you to succeed. Class participation is big and easy to get an A on.  Take this class.  She is adorable.\nWorkload:\nHomework before every class, but doesn't take longer than 20-30 min to complete.  Copositions after every sectin, your almost guarnteed an A if you change the corrections she gives you.  Midterm and Final, Class Participation, Oral exam, Un Proyecto. All standard Spanish class work, just with better grades\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "February 01, 2010",
            "review_content": "\nWonderful teacher for Elementary Spanish I.  She really cares about her students, was never frustrated with anyone for not understanding something, and let you submit a draft of every composition before the final draft so that you were basically guaranteed an A+. To be honest, the class was an easy A+, but I did do all the work and I really felt like I learned a lot of Spanish. She focuses on putting the class into discussion groups every day so that you do get a lot of practice speaking. All in all, it was an easy class, but I love her and think she's a great teacher.\nWorkload:\nEasy. Homework in the workbook every night (takes about 5 minutes), 3 compositions (she lets you hand in a draft before the final draft so that she corrects everything you got wrong; all you have to do is adapt her corrections and its an A). One group project in Powerpoint with oral presentation.\n"
        }
    ]
}