{
    "prof_info": [
        {
            "prof_name": "Archie Rand",
            "prof_id": 220,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Drawing, Painting I",
            "review_date": "April 04, 2002",
            "review_content": "\nArchie is a god. DO NOT MISS HIS CLASS!!! I don't care what your major is or if you can only draw stick figures. This man is one of the BEST educators on campus. He will change the way you view yourself, life, and of course, art. Do yourself a favor -- wake up early and get on line to register at Dodge. It's worth it.\nWorkload:\nHe makes you want to walk through fire.\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "April 14, 2001",
            "review_content": "\nThe best course I've taken at Columbia - no shit. Archie lets you explore your desires while giving you the tools to fullfill them. Once you take a course with him the way you view life changes. You are no longer a student but realize that you're an artist. And you will be - MANY PEOPLE GET GALLERY SHOWS WITH HIM! Highly recommended.\nWorkload:\nnon stop but worth it\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "March 31, 2001",
            "review_content": "\nBe warned: this is no easy class. Possibly the most rewarding, though, depending on the amount of time and effort you decide to invest. Archie demystifies the practice of art and makes you believe that you are, indeed, an artist, majors and non-majors alike. That is because once you take this class, you are! The strange thing about it is that, somehow, he teaches without instructing. That is, he won't tell you what to do or how to do it; he simply gives you the basic tools--and the freedom--to develop your own style. Grades are not based on talent or aesthetic, but on \"courage and commitment.\" He has a scary way of knowing if you're blowing things off--so don't do it. He is also a great storyteller. Cheesy as it may sound, you'll learn a lot--not only about art, but about life.\nWorkload:\nShitload.\n"
        },
        {
            "course_name": "Basic Drawing, Painting I",
            "review_date": "December 31, 1999",
            "review_content": "\nGreat guy, gifted storyteller. Full of interesting and funny anecdotes, all with built in life-lessons. Any class with him will be entertaining and worthwhile.\nWorkload:\n8-12 hours per week.\n"
        }
    ]
}