{
    "prof_info": [
        {
            "prof_name": "Justin Hoffman",
            "prof_id": 3070,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 13, 2009",
            "review_content": "\nnot a great professor, but not terrible. we had no textbook, and the readings were of anecdotal interest, but not necessary, so the class basically consists of Hoffman's lectures. he does not go very deep into technical details, so if you know more than a little about music, you will probably be bored and unsatisfied. he is obviously enthusiastic about the material, but has trouble conveying that enthusiasm. all in all, an easy class with good music, but nothing to get too excited or stressed about.\nWorkload:\nlight. weekly readings (not necessary) and listening (necessary). 2 short papers and take-home midterm and final exams.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 08, 2007",
            "review_content": "\nJustin was a really good teacher.  He was generally chilled out and never made a fuss about people coming late for our 9:10 class.  He responded promptly to emails and was always willing to help.  We only had one quiz, and the only thing we needed to memorize the entire semester was what sonata form is.  That being said, I put more work into this class than any all of my other classes this semester put together.  We had to go to four performances and write concert reports on them.  The third one was the opera Carmen which we saw together as a class one Saturday night.  The fourth one was optional and if you did it they you could drop your lowest grade on the concern reports.  We also had a take home midterm and final where we needed to listen to pieces, identify the composers and write about the pieces.  Whatever you do, do not google the text of the pieces and write what they are, even if you explain how you would have gotten there without googling them.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2006",
            "review_content": "\nJustin was absolutely fabulous! He looked so nervous on the first day of class (he was kind of doing this rapid box-step dance subconsciously that made me somewhat dizzy, but he calmed down by the second week, haha). But he totally managed the class perfectly from there on. The syllabus was on courseworks--totally organized, updated as needed, clear, useful, etc. He always returned assignments in a timely fashion and provided thoughtful and helpful feedback. (And it was super neat because he had us submit paper via email and he typed the comments right onto the paper and emailed them back--way more efficient, environmentally-friendly, and easier to read than the old-school handwritten comments on hardcopy papers.) He answered emails promptly and was great about providing extra help outside of class. He totally devoted a ton of time to this class--he would personally meet with every student to help with concert report drafts (we had 4 of them). He asked for student feedback and seemed to care about our suggestions and input. He was definitely knowledgeable about the subject and he came to class prepared. He kept to the schedule really well and kept the class moving at just the right pace--never boring, but never overwhelmingly fast. He was enthusiastic and approachable. I can't say enough good things about the way he ran this class! My first experience with Music Hum was terrible (ie. the prof walked in on the first day and said \"okay, let's listen to some f*cking music\" and turned on Stevie Wonder) and I dropped the class within a week. So I feel so fortunate that my second experience was way better--count yourself lucky if you get Justin's class. He may demand more work than some other classes (seems like we had more concert reports to write others), but he's still a blessing because there are definitely plenty of scary-bad Music Hum teachers out there.\nWorkload:\n4 concert reports, daily reading/listening assignments, take-home midterm and final\n"
        }
    ]
}