{
    "prof_info": [
        {
            "prof_name": "Barbara Farnham",
            "prof_id": 1369,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "International Politics Seminar: Foreign Policy and Decision-making",
            "review_date": "January 11, 2011",
            "review_content": "\nTake this class.  You will come out of it with much more knowledge about foreign policy and decision-making processes, not to mention an appx. 30-35 page paper under your belt.  It feels damn good.\nWas the reading mundane? No.  Was it unnecessary (inasmuch as it contributed to your paper or grade)?  Generally.\nWas Prof. Farnham incompetent?  Not at all.  Did the class drag on?  Absolutely.\nDo you have to keep up with all of the readings?  No.  Do you end up learning more about political psychology than international relations?  Debatable.  Very, very debatable.\nOverall, I think it was worth it.  She's older than some but very intelligent and helpful when you seek out her advice.  Pick a topic that you have GENUINE academic interest in; the paper will then feel like an adventure instead of a burden.  And please, for the love of God, don't start it two weeks before it's due.  Bad idea.\nWorkload:\nPaper proposal, 3-5 page \"research note\" (detailed paper proposal), 1-2 class presentations on readings, 30 pages research paper.  I'm pretty sure participation factors into the final grades more than she lets on.\n"
        },
        {
            "course_name": "International Politics Seminar: Foreign Policy and Decision-making",
            "review_date": "May 11, 2004",
            "review_content": "\nTruth is, I don't remember her saying much. Each week, a few ppl presented the readings, and then she sort of monitored the discussion, but thats about it. However, she was helpful during office hours and in her comments after we presented our research to the class. She is very knowledgeable, but hardly shows it during class. The readings are standard IR readings, except for the psychology crap that was barely understandable and for the most part ignored by the class. You wont love the class, you wont hate it. If youre looking for earth-shattering seminars, then skip this one. If you just wanna write your long paper and get the requirement over with, this is a good choice.\nWorkload:\nSubstantial reading -but who cares? no tests. you have to present on material once or twice, but thats it. [although the readings are very helpful for writing the theoretical side of your paper]. 70% of your grade is the 30 page paper. you also have to prepare a 6 page \"research note\" and make a 15 min presentation to the class.\n"
        },
        {
            "course_name": "International Politics Seminar: Foreign Policy and Decision-making",
            "review_date": "December 19, 2002",
            "review_content": "\nThis class was a great pleasure (well, ok, that's relative to horrible classes).  Professor Farnham is one of the most humble and yet knowledgeable instructors I've ever come across at Columbia (it's just too bad it took me until my senior year to find her).  She really cares about your topic (an in-depth analysis of a decision made by any foreign government--although you can choose the US as your actor as well) and is AWESOME at helping you find amazing works that support your aims.  The readings are manageable (~100 pages a week), the class is small (mine had 8 students), and the subject is intriguing.  Professor Farnham's kindness is disarming but don't be fooled--she is an expert in cognitive psychology and international politics: utilize her help and you'll thank yourself.\nWorkload:\n\"Research Notes\" (i.e., 5 pages of your paper due fairly early); Reading Presentations (2 each student--read 1 or 2 articles and deliver your own lecture); and a 30-page paper\n"
        }
    ]
}