{
    "prof_info": [
        {
            "prof_name": "Thomas Katz",
            "prof_id": 1039,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 24, 2007",
            "review_content": "\nProf. Katz is not a nice man by any means. He belittles students both in the class and outside of it. He also just doesn't know how to communicate to the class or convey information to it. He just seems to be on a very different wavelength, a really different world from the rest of us.\nThis seems too bad. It's rare to see a teacher enjoy what it is that he does so much, and he's having an incredibly good time up there. He can also be quite helpful, in, for example, office hours--that is, he can explain material there and he knows the material extremely well. So this just seems too bad that he doesn't really seem there with the students.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 20, 2006",
            "review_content": "\nDon't expect to learn anything from Katz's extremely hard to follow lectures. All teaching is done by the TAs and from the book. Although Katz is obviously extremely intelligent and talented in his field as well as a nice and amusing guy, he sucks as a teacher. He couldn't understand that to most of us organic chemistry is not really common sense. Get a tutor (if you can afford one) and go to the TA help sessions. The exams are not extremely hard for orgo.\nWorkload:\n4 midterms (of which the lowest grade is dropped) and 1 final. graded weekly (before exams biweekly) homework sets are 5% of the grade.\n"
        },
        {
            "course_name": "Chem I",
            "review_date": "December 24, 2005",
            "review_content": "\ni didnt believe people when they said Katz would be an easy A...all throughout the semester I felt I would be getting a B+ at best scoring 5 pts above the mean..in the low 80s...until the final and I somehow got an A in the class....\nso this is not reflective of everyone's story (i know a lot of people who were surprised and disappointed with their grades) but i never went to lecture, stopped reading the textbook after the first exam(the textbook is horrible..).  only things that helped me were my TA and his homeworks...\nhe tends to be tricky on exams but it benefits those who really understand the basic concept, and hurt those who just memorized the mechanisms. and the final was surprisingly easy...\nif you are willing to work on your own to learn the material, take katz.  i know so many people who took cornish and live to regret it...\nWorkload:\nhw 5%, weekly quizzes 10%, 5 exams and a final (two hour units dropped)\nnot too bad..\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 22, 2005",
            "review_content": "\nKatz is clearly the lesser of two evils when it comes to Orgo I, but don't be fooled...his class is no walk in the park.  His lectures were sometimes informative, but he frequently rushed through or even skipped topics that were covered on homework and exams.  I walked out of many of his lectures feeling confused and had to learn a fair amount of the material from the TA's in recitation and on office hours.\nThe structure of the class was also not very student-friendly.  The TA's gave quizzes in recitation almost every week (including some exam weeks) that sometimes were extremely difficult--simply looking over the material before recitation would not nearly be enough to get a good grade.  Homework also came fast and furious--problem sets were due every week and a couple of weeks had two problem sets due.  These problem sets were extremely time-consuming (usually 2-3 hours) and frequently required attendance at TA office hours to figure out.  In a couple of instances, he gave problems on topics that were neither in his lectures nor in the textbook--a major annoyance.\nI thought his tests were fair, but the grading was not.  Make sure you have every little detail right on the reaction questions, because on some he will give you zero credit just because your final structure for a three-step reaction is missing one atom.  His overall grading system isn't much better--he only calculates the curve for the class after dropping students' lowest test scores.  This means that if you get an 80 on a test where the mean originally was 65, you may actually end up below the mean for the test once he takes out all the dropped scores.\nMake no mistake about it, this class is a bruiser.  But unlike bio, if you put your best effort into this class you can come out of it with an A.\nWorkload:\nVery heavy--13 problem sets, 4 midterms and a final.  TA's also give recitation quizzes (10 over the course of the semester) and practice problems, which are not mandatory but can make the class seem that much more overwhelming.  Grades: midterms are each worth 1 unit (each unit is 17% of the grade), final is 3 units.  Katz drops either your lowest 2 midterm scores or your lowest midterm and 1 unit of the final if your lowest score comes on the final.  Recitation quizzes are 10%, homework is 5%--these two percentrages really should be flipped considering the amount of time the homework can take.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 19, 2005",
            "review_content": "\nI don't want to write yet another review that focuses on grades, because Katz is right when he says that grades are not the most important thing.  I know most people in this class were pre-meds, and grades matter a lot when it comes to getting into med school, but the thing is, if you actually bother to learn the material, you're going to know a little organic chemistry, and there's no reason you shouldn't get an A that way.\nAnyway, I never went to class and it didn't end up mattering.  Just know how to do the homework problems he gives (his personal problem sets.. not the ones in the books) and read the book and you'll be fine.  Anyone who says the tests aren't based on the book is really not right.  The book provides a nice foundation of organic chemistry, and as long as you understand that, everything else should become clear. A little clarity is all you need to get through this course.\nEveryone says organic chemistry is such a hard course that's full of memorization. Yes, you will need to simply memorize some things, but everything has an explanation that makes sense. If you understand those underlying principles, you'll do just fine.\nWorkload:\n4 midterms, 1 final, 2/7 of those dropped. weekly problem sets. as long as you write something you'll get credit. quizzes in recitation.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 18, 2005",
            "review_content": "\nProf. Katz is a wacky, chatty eccentric, endearing to some.  He may grade somewhat generously, though I've heard of nothing more than conjecture about that.  Exams means for his four midterms were about 75, 88, 70 and 75.  Standard deviations are occasionally provided.  If a midterm has a low mean, it appears that Katz does not add points to everyone's score to \"even out\" the midterm scores (thus, if you're 10 points above a 70-mean midterm, and later are 10 points below an 88-mean midterm, your resulting grade may be unduly low, given your performance).  Midterms each count as 100-pt units.  Final exam seems to be trifurcated into three 100-pt units.  Your lowest two of these seven 100-pt units will be dropped.  Katz's exams diverge considerably from the McMurry text (or any other text, for that matter), so you'd be very smart to attend class and pay attention.  He assigns many problems from the McMurry chapters, but I found that his exams drew far more from both his lectures and his \"homemade\" problems sets he cooks up and hands out in class (usually very little is posted on CourseWorks unless a TA does so).  Lectures are chalk-on-blackboard style (PowerPoint schmowerpoint).  Katz's homemade problem sets take about 3-5 hours to do and are often far more complicated than his exams - so try and determine what brief, 5-minute question he could distill from those lengthy 30-minute homemade questions.\nKatz doesn't reply to emails and doesn't provide answer keys to the prior year exams that his TA's post on CourseWorks.  However, your TA may work up an answer key for the class.  Only one prior year's exam is posted for each midterm because Katz's midterms are very much the same from year to year.  Queries about grades, \"where do I stand in the class?\", \"what's the B+ cutoff for this exam?\" or \"how are final grades calculated?\" were met by nothing more than an \"I'll try to be fair.\"  Note to Katz: the oft-repeated remark of \"Relax.  Grades don't matter\" wasn't well-received by the class.\nWorkload:\nWeekly recitation quizzes count 10% of grade.  Select problems from Katz's homemade problem sets (there's one for each chapter) must be turned in, totaling 5% of grade.  The other 85% of your final grade results from your best 5 of the 7 previously mentioned 100-pt units.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "November 28, 2004",
            "review_content": "\nHis teaching is decent - its not great, but covers the concepts well enough for his tests. Hes a really nice professor and really wants everyone to do well. You should defintely choose him over Cornish because his tests are so much easier and the curve is way better.\nWorkload:\nProblem set every week, quiz in rec, can be very time consuming if you dont understand it, but overall mostly reasonable\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "November 05, 2004",
            "review_content": "\nIf you are a pre-med, I strongly recommend taking Orgo with Professor Katz because from the very first lecture, he assures you that he is not your enemy and is not trying to keep you out of medical school. Personality wise, I loved Professor Katz. He kind of resembles Grandpa from \"the Munsters\" with his crazy mad scientist hair and his enthusiasm for the material. He cracks jokes, doesn't take himself seriously and he genuinely wants all of his students to get A's in orgo. The lecture before our exams, he would take the time to present us with a formal review as well as point out key concepts, reactions and mechanisms he wanted us to know for the exam. And he would post sample exams from the previous year on Courseworks, which I highly suggest you do because his exams from previous years mirrored our exams this year (he even repeats questions!). \nUnlike other reviewers, I did not get the impression that Katz was arrogant or that he didn't care about us, in fact, I found him to be quite the opposite. Katz has a huge heart and I seriously doubt the man has a mean bone in his body so if you're looking for a professor that cares about you as a student and is not out to screw you grade wise, Katz is your professor.\nI would only caution people to re-think taking Orgo with Professor Katz if you are not able to work independently and figure out Orgo on your own with the textbook. Katz is an awesome guy and a great lecturer, but his teaching style might not work for everyone. Let's face it, Katz has been teaching Orgo for a LONG time and I think he sometimes forgets that a lot of us are new to the material and can't pick up things like reaction mechanisms overnight. Lecture can go by quickly and sometimes you will get lost when Katz whips through a lot of material in one lecture but thankfully, one of our TA's took thorough lecture notes and posted them on Courseworks so if you missed something in lecture, or if Professor Katz didn't explain something clearly, you could review the posted lecture notes to clarify what was covered in lecture.  Even if you do feel lost in Orgo at times, which certainly happened to me in the beginning, fear not because there comes a time around late October where Orgo just magically starts making sense and you will realize how great Professor Katz truly is and that he provided you with an excellent framework to understand Orgo. But what I really loved about this class was that your hard work does pay off, which sometimes doesn't happen in college science classes. If you really work hard, and study a lot for the exams you can easily get an A-/A in this class.  \nOverall, I was happy I took this class with Katz. Getting up for a 9:00am class is a bitch and a half, but it is totally worth it and you will learn a lot about Orgo. Do the problem sets, his recommended problems, read the chapters and when you get to reaction mechanisms, make yourself flashcards. Mechanisms are difficult but you can make your life so much easier by writing out the reactions on index cards to test yourself because on exams, Katz expects you to be able to look at a structure and instantaneously know what reagents you need to make a product and how the reaction will occur. Make sure you register as soon as possible, the class fills up quickly!\n \nWorkload:\nNot too bad. There are weekly problem sets and the number of problems vary from week to week. 4 hour long exams plus the 2 hour final and Katz drops 2 of your lowest grades. Weekly recitation quizzes, difficulty of those depends on your TA. Grading is fair, but be warned, the means are high since Katz's exams are far easier than Professor Cornish's so you have to know your reaction mechanisms perfectly and work quickly and efficiently since exams are only 50 minutes long. Make flashcards, they work wonders!\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 28, 2003",
            "review_content": "\nI strongly recommend Prof. Katz. Before taking the class, I heard he was the best teacher, so I was willing to take the MWF 9:00 class to get him, and it was well worth it. He takes somewhat boring material and makes it interesting in lecture with little jokes, etc. He actually takes questions in lectures, even though there are 150 people in the classroom. He makes the material fairly easy to understand, and he is a genuinely nice person. If you are going to take organic chemistry, take it with Katz!\nWorkload:\nProblem sets every week--this is the only downside, he loves giving graded problem sets, so there are always problems to do (this does make the tests easier though). 4 hour-long midterms and the (3 hour) final. Drop 2 lowest test grades. Exams are not bad at all.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "December 21, 2003",
            "review_content": "\nAll the reviews of Katz so far say he is either wonderful or horrible. I think heÂ’s somewhere in the middle. He really does seem interested in the class and in helping students. His cheesy (and repetitive) jokes, whether you think theyÂ’re funny or irritating, definitely lighten the atmosphere. His exams could be worse. On the other hand, I found his lectures tended to be disorganized and sometimes confusing. Although he wants to help, heÂ’s not the most spectacular teacher in the world, so sometimes he doesnÂ’t know how. In his effort to get students not to stress about the class, he sometimes brushes off important questions. His problem sets are graded and often devilishly hard, but the TAs were quite willing to help with them.\nWorkload:\nFour, count them, four exams plus the final. Basically, the lowest two of the four midterms are dropped, but this policy is not actually as nice as it sounds, as he will explain on the first day of class. Problem sets due every week or so.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 15, 2003",
            "review_content": "\nyes, prof katz is a nice guy and his tests are much easier than cornish's.  however, he answers every single question from the class, and many of these end up being irrelevant.  thus, you get up at 9am to learn very little in class and are expected to teach yourself from the book.  Another annoying thing that prof katz often does is not teach what he expects you to be able to do on the problem sets.  Bottom line: if you're looking for a good teacher and lecturer, take Cornish's class.  if you're looking for easy tests, take Katz's.\nWorkload:\n12 graded psets, 4 midterms and final exam.  psets can be annoying and hard to do, as katz doesn't teach you how to solve many of them, but tests are pretty easy.  the medians for the first two tests were 89 and 88, the means for the last 2 midterms were 60 and 70.  2 midterms or 1 midterm and 1/3 of the final are dropped.\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "May 06, 2003",
            "review_content": "\nI just want to respond to the negative review, which I think is ridiculous. Professor Katz is the single most inspiring professor I've had at Columbia, enough to convince me to major in chem. He just bleeds enthusiasm. He was always engaging and clearly knew the material inside and out. He seems to really get a kick out of dyes and their pretty colors, and the way he taught the lecture on conjugation was as if it was the single most wonderful thing in the world. I think you'd have to be a pretty hardened premed drone not to appreciate the energy he puts into lecture. Incidentally, he was also friendly to me outside of class. Just a great professor in general. \nWorkload:\n4 midterms, final, about 10 homeworks. The grades are all on a formula, so they can't be arbitrary. The only hard part is knowing how you're doing versus the curve, but that's the sort of thing you can go and ask him about. \n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "May 02, 2003",
            "review_content": "\nThis Professor is very much into his own research and could not care less about his students. every question in class is met with complete apathy. What will be on the exam? we ask. his response is \"who cares? it's a test. it doesn't matter.\" Well, med schools beg to differ. Professor Katz is very distant and unapproachable. If you have a problem, only deal with the TA's because Katz will treat you like a little cockroach. He will step on you and squash you. Definitely go with Cornish. She can actually teach, cares about her students, cares about the course, and you will leave the class feeling like you learned something, and not like you just spent $3000 to hear someone tell you you don't matter and that your life doesn't matter for a whole semester. With the therapy you'll need after this class, expect to spend at least 5 grand.\nWorkload:\n4 midterms and a final. grades are very arbitrary. TA's make a lot of mistakes so be sure to check your exams for errors. Class is very disorganized and Katz never gives solutions to hw or exams. \"I want you to kill yourself figuring out what you did on your own. he says\" then he says \"no I don't really care. I just don't feel like writing up solutions.\"\nFinal was straighforward. Katz kind of just makes up grades how he feels. You could just as easily get an A and a C, regardless of your actual grades. It's just whatever Katz feels like doing.\nTake cornish! She's so nice too.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 22, 2002",
            "review_content": "\nProfessor Katz is one of the best professors I have had at Columbia.  He's really funny and makes cheesy jokes a lot.  His relaxed attitude definitely made me not stress very much about this class. His lectures can seem very disorganized, but when you go back and study for the final it all makes sense.  The TA's for the class are really great; going to their office hours was very helpful. \nWorkload:\nNot nearly as bad as I thought it would be....weekly homework assignments (worth 5% of the grade), easy recitation quizzes (10%), and seven \"hours\" of exams, the top five of which count (either drop the first two of the four hour long exams, or if your final exam is the lowest, drop one third of of the final and one of the hour long exams).  Overall, not NEARLY as bad as people always make this class out to be...\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "April 24, 2002",
            "review_content": "\nOrganic chem is a tough course.. But katz really makes it the best possible experience. he reminds me of a mix of a grandpa and a mad scientist. He gives some cheesy jokes and goes astray sometimes with lectures, but generally you learn a lot. The TA's are great in helping with concepts, they are quick to return emails. In the end, its a bitch course because of premeds.. the material is tough to learn.. But Katz makes it a good experience in the end.\nWorkload:\npset every week in general- 4 tests and a final. final counts for 3 \"test hours\", adding for 7 total hours. he drops lowest 2 \"hours\"\n"
        }
    ]
}