{
    "prof_info": [
        {
            "prof_name": "E'mett McCaskill",
            "prof_id": 1703,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "June 13, 2016",
            "review_content": "\nAmazing class. I would suggest a background in neuroscience, otherwise it can be a bit hard. Amazing professor, McCaskill has a great lecture style. She has all the information you need (don't buy the textbooks) on the slides, and then talks freely. Just an amazing speaker, really engages you intellectually. Workload is very fair and not difficult, and she does offer extra credit! \nWorkload:\ntwo tests, cumulative\nthree memoir essays, minimum 4 pages\nextra credit assignment- read a book, 4 page minimum \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "May 14, 2016",
            "review_content": "\nProf. McCaskill is truly lovely. She's extremely kind and approachable, and willing to help students. She offered everyone in the lecture the opportunity to come talk to her about their career aspirations.  I took her up on this and she was very helpful. \nI took this class in the summer, which I recommend.  I didn't find the class to be fascinating, but it was informative and not too difficult. I would caution those with a history of mental illness however to be prepared if planning on taking this class. I was warned that it could be triggering, and it certainly was for me. \nWorkload:\n2 midterms, a memoir review paper and a final exam. Average reading workload. \n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "April 22, 2016",
            "review_content": "\nEasily the best psych professor at Barnard and probably Columbia too. She has a conversational style of teaching and does not expect too much of you. She is approachable and clearly has a passion for what she teaches, which is refreshing. \nWorkload:\nMidterm, final, Memoir reviews\n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "April 17, 2015",
            "review_content": "\nShe is my favorite psychology prof! I've taken her for three classes. She is very knowledgeable and understands that her students have other responsibilities. If you can’t make a deadline because of any issue just go talk to her and she will be understanding. She always incorporates stories of her actual patients into all her classes which makes the material more interesting and gives you real world examples which is great if you’re a psychology major. Take her class! The work load is very manageable and her lectures are great. Best part is that her power points are amazing and very helpful for exams. There are very short memoirs in which she asks her students to write a short paper on. This might sound off-putting but the memoirs she chooses are fascinating. You will read through them in no time.  Seriously they are amazing. \nWorkload:\nAbnormal Behavior and Psychology of Drug Use and Abuse: A couple of memoirs, midterm and final (cumulative), extremely manageable. I didn’t purchase the text book and solely relied on lectures and power points and got an A.\nClinical Neuropsychology : both midterm and final are take home! There is a paper, presentation and an assignment that are all fun. \n\n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "December 22, 2013",
            "review_content": "\nVery mixed about this class. The professor herself is very knowledgeable and interesting, but spends half of every class going on some tandem story about a patient of hers (which may or may not be breaking patient confidentiality?), and she seems too busy overall to be teaching at this point in her life. Getting office hours appointments is harder than getting a cronut was last summer,but if you manage to get them (and she remembers to come), she will give you solid advice and is really helpful. Overall, Professor McCaskill is really smart and interesting, but too busy to be teaching this course. \nBecause she is kind of distracted and has other things going on, our TAs took the opportunity to be lazy and overall useless. Only two of them bothered showing up to class consistently and despite our tests being 60 multiple choice on a scantron and then 2-3 case studies, they took over a month to return both tests and were similarly derelect in their grading duties on the review_content. review_content sessions are not very helpful- they will only answer questions and half the answers to the questions are \"we're not sure,\" or \"what is chapter 16 on?,\" or \"wel'll have to ask the professor.\" They seem well meaning enough but it's pretty clear they are fairly disinterested. Their office hours are only slightly more helpful, they're not great at clarifying material.\nThe tests are really fair, as long as you go to class and memorize what the straightforward slide shows are, you'll do really well. There was a textbook but I never bought it and I ended up with an A. Overall, class is not a ton of work and fairly interesting, just frustrating in terms of TA apathy and how distracted the professor can be. \nWorkload:\nNormal- 2 midterms, 2 book revies, and a final. The reading is optional- I never bought the book and ended up with an A.\n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "November 14, 2013",
            "review_content": "\nProfessor McCaskill is a lovely person. You can tell she knows her field. She brought the class Halloween candy.\nI think I would have enjoyed taking a seminar class with her. A large lecture class is not the best way for her to shine. She uses the PPTs from the textbooks do her lectures. If you read the book, you know what's going to be on the test. She fell a bit behind on the syllabus, but no big deal. She is a bit disorganized, but it isn't too distracting.\nIt seems like she is a bit of a procrastinator. Her syllabus was not posted until class began, and review sheets, though promised well in advance, came out right around the day of threview_content. review_content sessions with the TA's were kind of a joke, but at least they existed. \nHer exams are moderate, with some questions that seemingly come out of left field. Keep up the readings and you will be fine.\nI would take another class with her, as long as it was a seminar.\nWorkload:\nLight.\n2 midterms, cumulative final: moderately difficult multiple choice with several case studies for you to diagnose as well. 2 memoir response papers for two interesting books. \n"
        },
        {
            "course_name": "Abnormal Behavior",
            "review_date": "April 08, 2013",
            "review_content": "\nI love professor McCaskill! Her lectures are engaging because she uses case studies from her professional work to explain disorders and engage the class. These studies are fascinating and really help you learn the disorders. \nShe also assigns memoirs of people who have suffered from various disorders that you \"review.\" She intends this to be primarily as a \"grade-booster\" (her words) but don't expect to get 100% if you write a boring paper. \nShe is a big fan of the DSM multi-axial diagnosis, so you will definitely learn to read a case study and make a full diagnosis. The multiple choice on her exams are moderately difficult. \nFor people who prefer extremely structured slideshows, this may not be the class for you. Professor McCaskill does have slideshows, but she prefers to tell case studies and brainstorm treatment options with the class. As someone interested in going into the field, I found this invaluable. \nA note: drug use and abuse does involve Neuroscience, so I would reccomend taking it after or while you take a neuro class. \nDon't expect an easy A (but don't expect to have to do a ton of work and still fail). I've found that if you put in the time, the A is yours. \nWorkload:\nNot too heavy. A midterm and a cumulative final for both classes, as well as 2/3 3-5 page book reviews. That's all! \n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "May 31, 2011",
            "review_content": "\nIt's kind of hard to figure out what to say about Professor McCaskill. First of all, she is extremely nice and knowledgeable when it comes to the subject matter. She has years of experience in the field, and she uses that experience to supplement every lecture. However, it sometimes felt like this course lacked direction. Professor McCaskill spent a lot of time focusing on her clinical experience, but the tests ended up really just being about the characteristics of the drugs and their effects, which I learned by reading the textbook the day before the final. All in all, it's not a difficult course. We don't cover that much material because McCaskill spends so much time talking about other things. She is interesting to listen to, though, and it's worth going to the lectures if you would like to hear about her experiences. Otherwise, you can get all the information from the lecture outlines and the textbook.\nWorkload:\nRead 4 memoirs throughout the semester and write a short response. You meet with an assigned \"book club\" before each response is due.\nAttend an AA or NA meeting and write a response.\nMidterm and final consisting of a case study, short answer, true/false, and multiple choice.\nOpportunities for extra credit in class and on the midterm and final.\n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "December 27, 2007",
            "review_content": "\nProfessor McCaskill is one of the most engaged and passionate professors I have ever come across.\nShe seriously cares a lot for the well being of her students and seems to love to teach.\nOne downside of this class is that the lectures tend to jump around a lot. It makes taking notes very tricky, which makes end of semester review kind of tricky. With that said she does give great printed lecture outlines (even though she doesn't follow them in a succinct fashion). \nThis is a very interesting class for anyone interested in addiction or clinical psychology. There is a bit of neurophysiology but it is kept fairly simple. \nWorkload:\nPretty light. The final is cumulative so there's a lot of review at the end. The exams are very multiple choice heavy and are made as painless as possible.\n"
        },
        {
            "course_name": "Neurodevelopmental Processes",
            "review_date": "May 08, 2007",
            "review_content": "\nFirst off, I love McCaskill.  This is the second class I've taken with her, and I think she is a truly wonderful woman.  She loves what she does and is very knowledgeable, but sometimes (and I felt this way about Drug Use and Abuse, too) she does NOT emphasize enough the information that she actually wants us to know.  We'll spend class after class discussing the ethics of this treatment, or that drug, or the stigma surrounding kids with HIV or epilepsy, but when it comes down to what she actually wants us to KNOW for the final, she often expects us to know more neuropharm. than we ever discussed in class.\nShe does give us all of this information (usually at the end of the semester and in review sessions), but I always feel a bit cheated in this respect.  Otherwise, her classes are great.  Even though you may feel unprepared for a midterm/final, you should have no problem pulling off a good grade.  \nDespite her misgivings, she's a really wonderful teacher - a true breath of fresh air.\nWorkload:\nA midterm, 10-page paper (really easy, just write about a neurodevelopmental disorder), a final (which took about an hour), and LOTS of reading.  I didn't end up doing a lot of it (which was fine), but it's interesting and while it may be a heavy reading, she only ever wants us to read \"at the level of class discussion.\" Not too bad.  Easy to meet with and very understanding.\n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "April 07, 2006",
            "review_content": "\nI honestly do not know what to make of this class. I had no idea what I was supposed to be learning the whole time, yet I managed to do all right on the tests and pull out an A- in the class. \nShe is so sweet and genuinely cares that every student knows what is going on. But that is not always a good thing. Sometimes we need a professor who is just going to put it out there during class and offer the more detailed one-on-one help outside of class.\nI thought the neuropharm was very interesting, but we probably spent about 4 class periods the entire semester learning straight neuropharm. The rest was an iffy discussion of addiction and psychology that most of us already knew from other courses and/or common sense. \nOverall probably not worth your time, unless you really like to read addiction memoirs and engage in somewhat useless lecture style discussion. Or you want to hang out with McCaskill, because that's definitely worth doing. \nWorkload:\nmidterm, final, three \"book club\" like meetings and response papers to those meetings, and a longer paper at the end of the semester about one of the memoirs. \n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "January 15, 2006",
            "review_content": "\nE'Mett herself is very cute and sincerely interested in each one of her students. Because of this, however, she can spend entire class periods listening to what each one has to say on simple topics that could have been explained very quickly (Ex: One time a student asked \"Like, when I go to parties, why is is that I can drink so much more vodka than rum? It's like my body is just, like, tolerant to one and not the other?\" And instead of telling them that this is not the time or the place she allowed the whole class discussion to go on a huge tangent). Although it's clear that E'Mett knows what she is talking about, it seems hard for her to keep focused on the subject at hand. As a result, I went through this class feeling like I didn't know what I was supposed to be learning at all. Her class basically seems unncessary because it is a strange mixture of neuropharmacology and psychology that isn't neurpharmacological enough to give you a clear understanding of what is going on at the level of the neurotransmitters and not psychological enough to give you a clear understanding of what it means to be addicted to drugs. If you're interested in this topic, go to the internet, read a book, or ask a professor. But don't take this class. \nWorkload:\nRead 3 memoirs of addiction, meet with groups to discuss the book and write a very short response paper; a midterm and final that requires you to study the outlines she gives every class (Caution: If you understand the biology of neurons, you'll do fine; if not - you'll struggle); Also written final paper 6-10 pgs about \"what is addiction?\" Very easy\n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "December 16, 2005",
            "review_content": "\nI'll be the first to say that McCaskill is terrible. She's a very nice woman, but she should not be teaching anything neurobiology-related. She has a very \"la-di-da\" attitude, doesn't get anything done during class, and gives us outlines that are supposed to help us, but... I'm trying to study for the final exam right now and she actually put on an outline that opioids inhibit GABA by releasing NEURONS that normally tonically control dopamine. It's not like she doesn't know that that's wrong. She is just all over the place. I wish I had a stricter, harder teacher for this class because I don't feel like I have actually learned anything. Avoid any classes with her if you have taken any biology. She will only frustrate you.\nWorkload:\nIt's any easy class that ends up being more difficult because she sucks. One midterm, final, and final paper. A lot of people didn't bother with the textbook, but I thought it was interesting and clearer than McCaskill.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 19, 2005",
            "review_content": "\nI absolutely love this woman! She is by far the best teacher Ive ever had and she really wants her students to learn; its not just a class to her. She fully explains concepts and is INCREDIBLY patient and INCREDIBLY dedicated; there is absolutely nothing bad that can be said about her!\nWorkload:\n3 multiple choice exams, not bad if you do the reading; she even hands out outlines of her notes  1 really fun paper\nTAKE THIS CLASS for intro, its amazing\n"
        },
        {
            "course_name": "Intro, Developmental Disorders",
            "review_date": "August 30, 2005",
            "review_content": "\nProfessor McCaskill is the greatest professor I have had so far at Barnard.  She is so warm and caring, and really eager to help her students, regardless of whether its for intro or an upper level psych class.\nShe outlines all of her classes, making it virtually unnecessary to do the reading unless you want to go a little more in depth for your own personal interest.  \nI will make sure to take a class with her every semester for my remaining two years at Barnard, and am so upset that I won't get to take a psych class my semester abroad.\nWorkload:\nIntro: three exams (the final is not cumulative) and a 10 page paper based on an experiment you create, but don't actually perform.  That paper becomes really helpful if you plan on doing any further research type papers.\nDevelopmental: Midterm and noncumulative final.  Mini paper for the midterm, and a final research paper on any neurological disorder you choose.Minimal work to get a B/B+, and just a little more reading if you want to get that A\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 14, 2005",
            "review_content": "\nTAKE THIS COURSE W/ PROF MCCASKILL! In fact, take anything you can with Professor McCaskill because she is incredible! Any teacher that can make an intro course come to life and be as exciting and enlightening as she made it deserves serious praise. She was extremely organized with her lectures and provided us with outlines of the material so we would know exactly what to study on the exams. She is also the nicest woman ever and is very encouraging of any student who speaks up in class.\nThe exams can be a bit of a pain to study for. I found that the best approach was to read through the textbook sections that she put on her outlines. There's no need to read the textbook in advance but if you read it and study before the exams, you'll do fine on them. No trick questions but you have to know the material down cold.\nProf. McCaskill is also very willing to meet with students outside of class to discuss any issues whatsoever. She's amazing!!!\nWorkload:\n3 exams which are pretty time-consuming to study for but otherwise there's no need to do the textbook reading according to the schedule. Also a 10 page research paper (you create your own experiment and discuss it at length but don't actually perform it)\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "February 19, 2005",
            "review_content": "\nProfessor McCaskill is a dedicated teacher and a caring woman. If you have to take Intro Psych, take it with her.\nProfessor McCaskill has a warm personality that extends into the material she teaches. She is down-to-earth, and sheÂ’s a real person. She is approachable and friendly. She is happy to talk about material that extends beyond what she covers in class.  \nShe gives you outlines -- I repeat -- she gives you OUTLINES of every topic that she covers, making it virtually unnecessary to take a ton of notes or do the reading. Although the outlines themselves could use a little cleaning up organization-wise, they were still priceless to the student who doesn't want to be forced to do a ton of work.  She does not take attendance. But unless you want to do the reading, I suggest going to class. \nDuring class, McCaskill sticks to the outlines. Perhaps due to her background in neurobiology/biopsychology, she explains biological processes very clearly, even to the point that a scientifically handicapped person like I am could understand them. With these and all concepts, she teaches you what you need to know, and she does it well. She takes time to answer questions in class, and she allows for discussion, which I found refreshing. \nI liked McCaskill very much, and I will take more of her classes. But in Intro Psych, once I got wise, I doodled. I am not a career doodler, but I whole-\nheartedly recommend doodling as a survival mechanism in this case. Intro Psych is a course to be endured, regardless of your professor. ItÂ’s just boring. But McCaskill makes it a lot less painful, and dare I say enjoyable at times. \nHereÂ’s a hint: for B-range grades, you will Â–onlyÂ– need to study the outlines if youÂ’ve gone to class. Take notes during class, but take them on the outlines themselves. This is what I did after I figured it out. If you are the no-holds-barred straight-A's go-getter type, then you will do the readings, you will study for the tests in advance, and you WILL get an A. \nMcCaskill herself says this is possible, and it is. And you donÂ’t need to be a total dork, you just need to stay on top of the readings. \nWorkload:\nThree exams, one of which serves as the (non-cumulative) Â“final.Â”\nOne paper: design a research experiment, imagine you carry it out, and write it up. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 19, 2005",
            "review_content": "\nOne of the nicest professors I have ever met. She makes herself available to help you with anything you don't understand. hte lectures were intresting, but a little too much time was spent with people discussing their own problems. Readings are neccessary only before the tests- she hands out comprehensive outlines that emphasize the important stuff. I did very little reading and work except before the tests and did fine. Overall, she is so nice that you can't help but love her. That plus an easy workload made this class enjoyable.\nWorkload:\n2 midterms, non cumulative final. Multiple choice, some short answer. Study fom the outlines. 1 paper where you design your own psych study- very interesting and not at al hard. \n"
        },
        {
            "course_name": "Psychology of Drug Use and Abuse",
            "review_date": "December 30, 2004",
            "review_content": "\nSuch a nice and genuine professor whose love for her students and the subect matter always comes through. She is extremely approachable and makes you feel very comfortable going to talk to her, whether its about something you didnt understand in class or your own issues with drugs. More often than not, her lectures turn into open discussions in which she encourages students to speak freely about their knowledge/experiences with different drugs. She is very interested in discussing why people do drugs and the motivating factors behind abuse as well as talking about the different drugs that are common on campus and popular among students. Overall a very enjoyable and eye opening experience.  She doesn't really follow a textbook but must MEMORIZE textbook for the midterm/final, even if she says not to and even if she didn't really cover things in class. \nWorkload:\nA midterm, cum final, 3 papers each based on a different book. the midterm and final are difficult - very nitpicky, asks very detailed questions. focuses especially on neuroscience and how drugs work at the level of the receptor. you need memorize ALL class notes and relevent chapters in the textbook in order to do well.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 15, 2004",
            "review_content": "\nThis was a great class.  McCaskill is always engaging.  She is nice to her students and always takes time to hear everyone's comments.  The material itself is fascinating, though it is not necessary to keep up with the readings to do well - usually the outlines she provides, lecture notes, and skimming the chapters will be enough.  Her tests are fair, mostly multiple choice and short answer.  When she feels she has designated too many chapters to a particular test, she will reduce the amount of material rather than make students cram material that has not been covered.  She is exceptionally warm and friendly.  This is one of those magical classes that didn't stress me out but still made me learn a lot.\nWorkload:\nPretty light - two exams, a paper, and a non-cumulative final.\n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "October 28, 2004",
            "review_content": "\nProfessor McCaskill is a gem of a teacher. She is by far one of the top three teachers I have had in three and half years of college. She actually knows the material she is teaching and can therefore answer your questions...and when she is stumped she doesnt make something up but actually looks up the answer and gets back to you. Very rare for a Columbia Prof. She is more than willing to stay VERY late in order to meet with you and help you out. She hold amazing review sessions for BN. Very worth going to because if you do go she knows youre devoted and will give you hints as to what is on the test and what is not. She is the type of Professor who will sit with you for hours to help you with anything, whether it be school work or grad schools apps. She is even willing to help you out with work from other classes. She is just a great teacher...though much better in small setting classes. I highly recommend taking her for a seminar rather than a lecture becuase the lecture could get a little tedious. But in a small group setting she is amazing.\nWorkload:\nNot bad. Drug Use and Abuse- midterm (both are difficult if you dont study) final, paper (REALLY easy). BN- two midterms and a final. You MUST study for these...its a lot of memorization.\n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "June 08, 2004",
            "review_content": "\nProfessor McCaskill is very nice, and it's clear she cares about her students.  I've also heard she holds great review sessions and  explains things well in lab.  However, her class was one of the most frustrating experiences I've had in college so far.  In lecture, she would read straight from Powerpoint slides which were so poorly organized and incoherently written it often seemed she had not taken enough time to prepare.  She did not explain the often difficult terms and concepts on the slides-- she just read them, leaving us to try to decipher them later.  Reading the book was helpful sometimes, but she often contradicted what it said.  So studying for tests meant trying to make sense of her slides, memorizing lots of material I didn't fully understand, and trying to decide whether to follow the book or her.  Basically, this class took really interesting material and made it painful.  I got the impression that she didn't care if we understood anything-- she just wanted us to memorize it.  If you're really interested in knowing and understanding this stuff, don't take this class-- it might turn you off from neuroscience.\nWorkload:\nA pretty substantial amount of reading the textbook, two midterms, and a final.  The tests are nitpicky, so memorize, memorize, memorize!  Also, leave yourself plenty of time to decipher the slides.    \n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "May 11, 2004",
            "review_content": "\nEmmet is a really nice lady who makes herself available to students. The material of the course ranges from rogue memorization of locations and functions of different parts of the brain (boring)  to interesting case studies. Her exams are very tricky. She expects you to know every little detail of each topic, so that she'll ask you a very basic question on one topic that you know in-depth, and a nitpicky question on a topic that you didn't even bother studying, or that you have no recollection of even learning. I probably would not take this class again if I had the choice. \nWorkload:\n2 mid-terms, 1 final (a bitch). \n"
        },
        {
            "course_name": "Neurodevelopmental Processes and Neuropharmacology",
            "review_date": "August 23, 2003",
            "review_content": "\n  I have had E'mett for 2 classes and if there were another one for me to take with her I would.  She is incredably passionate about neurobiology, especially with its respect to pediatric cases, and it shows.  Her lectures are interesting and interactive.  For Neuropharm, she has it such that every other meeting is taugh by members of the class.  In addition, she genuinely cares about her students.  She helped me out tremendously with my medical school apps and interview, and I am quite sure she has offered advice to several other students, as she herself is in medical school at moment.    Another thing I should mention is that E'mett cators to students at all levels of neurobiology.  I took both classes before taking Neuroscience and Behavior (a pre-rec) and had no problem with Neurodevelopmental, but felt I could have gotten a little more out of Neuropharm if I had taken the pre-rec (but still learned A LOT).  I would highly recommend any class that she teaches.  \nWorkload:\nFor Neurodevelopmental: I think there two midterms and a final, all with different formats...I think mostly essay, some short answer, and some multiple choice.\nFor Neuropharm: a midterm, a final, a class presentation based on an article review, and a final research paper of about 10 pages (I think)\nNOTE: some people say that she is an easy A, but I think it is more that she is straightforward and tells you exactly what you need to know.  If you listen to her when she tells you that something will be on your exam, you will do well in her class.\n"
        }
    ]
}