{
    "prof_info": [
        {
            "prof_name": "Bernard Faure",
            "prof_id": 4419,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Chinese Religious Tradition",
            "review_date": "May 22, 2014",
            "review_content": "\nChinese Religious Traditions with Bernard Faure was a great class. Professor Faure is very knowledgeable on the subject and his lectures are fun and interesting. He has a rule about no electronics out during lecture, and he will call you out if he sees you not paying attention or sleeping, or if you arrive significantly late to class. He's a nice guy though, so he's mostly just making fun of you.\nThere are mandatory discussion sections for this class (you can choose a time and TA) and the TAs can help answer your questions when you are unsure of something Faure mentioned in class. Faure's lectures are somewhat improvisational, so they can be rambling sometimes, but I always thought that his stories and details were interesting. He really knows a lot of stuff, so if you're curious about something specific, you can ask and he'll deliver a pretty good answer.\nI'd say that this class is a solid choice for a global core, or if you're just curious about the subject. The readings are really interesting, and the lecture/discussions were chill. Learning about these religions really helped me with my mindset in my own life.\nWorkload:\nOne discussion section each week (one hour long) in addition to the lectures. Each week, there is also a discussion post in which you must answer a question related to the weekly readings and what Faure says in lecture (no more than a page, graded more on completion than on quality). Readings should take roughly 2 hours a week, but you can get away with skimming them if you really are short on time. There is a midterm and a final, with the format of 1) IDs 2) Essay. The TA's give you a list of IDs to study from so you can be pretty prepared for the tests (I recommend getting a pdf of the textbook so that you can ctrl-f for IDs). There's also a final paper (broad range of possible topics to choose from) that's 8-10 pgs long. Grading isn't too harsh.\n"
        },
        {
            "course_name": "Buddhism: East Asian",
            "review_date": "December 23, 2012",
            "review_content": "\nThe main thing Faure wants you to know is that the notion of Buddhism as \"spiritual\" or \"philosophical\" rather than \"religious\" is a modern, Western interpretation that completely ignores what Buddhism really is in its various cultural contexts. Buddhism is a religion, not a philosophy, and it has all the same attributes and problems as every other major world religion (i.e. gods, demons, heavens, hells, tons of superstition, institutional corruption, gender discrimination). A surprising amount of this course focused on learning the names and characteristics of various bodhisattvas and demonic creatures, while very little dealt with the philosophical side of Buddhism or with meditation.\nFaure's lectures are boring and rambling. He seems to cover the same ground over and over. Several times he called students out for falling asleep in class, which frankly is very easy to do. East Asian Buddhism is definitely an interesting topic, but I'd recommend finding a different prof if possible.\n\nWorkload:\nLots of reading, some interesting but some totally obscure and unhelpful. You don't need to do most of reading though. Weekly discussion sections and weekly discussion board posts about any topic from that week's readings. 3 pop quizzes on vocabulary. 2 4-page midterm papers based on assigned readings. 10-page final paper that requires some outside research. Grading is done by your TA and was pretty generous. Attendance sheet is passed around in lecture and discussion.\n"
        }
    ]
}