{
    "prof_info": [
        {
            "prof_name": "Emily Sun",
            "prof_id": 13309,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Narrative",
            "review_date": "December 26, 2016",
            "review_content": "\nEmily Sun is a GODDESS. She is kind, engaging, and wise, and truly wants the best for each student.  The reading list for this class is fantastic - I actually wanted to do all of the reading!!!  The syllabus is also well created, the order in which things are read and the way she has broken the class into units gives the good readings even more meaning. Because it is a smaller class and runs like a seminar, it depends a bit who is in your class and how much reading/ speaking they do as to how the discussions run, but Professor Sun always has interesting questions and thinking points.  This class feels like a book club, not a class, and I loved it so much and got a lot of interesting reading out of it. \nWorkload:\n- regular reading/ sometimes viewing (we watched Vertigo), very fairly assigned (she commented on how she gives more over the weekend than during the week, for example) \n- a few 2 page reading responses (we literally did like 1 or 2 of these) \n- one day leading the class (coming up with questions) \n- 3 ~6ish page papers (requirements were a little different for each one but very fair) \n- take-home final\n"
        },
        {
            "course_name": "Introduction to Narrative",
            "review_date": "December 08, 2016",
            "review_content": "\nReally great course! The workload wasn't that bad (because tbh who actually does ALL the readings) but Prof Sun was really great about initiating discussions and doing the best to really explore even the most minor comments, and made us really passionately discuss whether something was a plot or a story and if that even mattered. It was a really interesting take on literature- from the narrative point of view- and I found myself feeling very passionate about essay prompts that made me want to start writing them right away.\nWorkload:\nA few readings a week, three essays and a final- the final is a take-home, 24-hour couple of essays, and the last paper was a little too close to finals for my liking but overall really not that bad. \n"
        }
    ]
}