{
    "prof_info": [
        {
            "prof_name": "Angelo Cacciuto",
            "prof_id": 4138,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Physical Chemistry II",
            "review_date": "May 19, 2013",
            "review_content": "\nI'm guessing that if you're reading this review, you have no choice but to take this class.  There are two types of students who have to take the class - biochemistry majors and everyone else.  If you're a chemistry major (or chemical engineering, chemical physics, etc.), be aware that this review is written by a biochemist.  \nSimply put, the course is a basic introduction to quantum mechanics.  The class begins with some basic probability and statistics, which you learn pretty quickly are integral to the study of quantum.  The course covers the entirety of quantum that you learned in General Chemistry over the course of a couple of classes, then the fun stuff starts.  You spend a while on the wave equation, then move on to the Schroedinger equation and then apply that to the harmonic oscillator and rigid rotator models.  After that's all taken care of you learn how these things apply to the hydrogen atom, and then you learn the variational method and perturbation theory.  Does this sound scary?  It should.  After the midterm, before spring break, Professor Cacciuto said \"what is coming is so horrible you have no idea.\"\nTake the math requirement seriously.  They say you only need Calc I and II, but biochemists, you will want to take additional semesters to fill your elective requirements.  Multivariable calculus and differential equations are used extensively, and it is in your best interest to be very familiar with these.  If you haven't opened a calculus book since freshman year, start reviewing now.  Cacciuto assumes a level of knowledge that you probably have forgotten over the years.  Physics too, really.  Yes, you can take baby physics (1201-1202) like I did, but you should strongly consider doing 1400 or higher.  Physical Chemistry is a quantum leap above everything you did in 1200.  The wave equation is barely looked at, while the 1400 sequence of physics includes a full semester of it.  That said, if you're willing to put in the work, it's not such a huge deal if you have the bare minimum.\nProfessor Cacciuto's style involves writing a lot of complicated mathematical formulae on the board.  Don't be scared!  He will tell you what is important, and if he tells you to memorize something, MEMORIZE IT!  If something seems like an interesting fact, it might come up in a short answer section on an exam, so you should probably memorize it.  Though I understand how hard it can be to teach physical chemistry to both chemistry and biochemistry majors, there really wasn't much effort to try to find a happy medium.  Cacciuto never really seemed to be able to make the course that accessible to biochemists while making it challenging for chemists.  That said, if you do feel kind of lost, he is willing to meet with students and is actually very friendly on a one-on-one basis.  If you can't make office hours, he will be able to meet you outside as well.\nOn the exams, just make sure to breath and go slow.  It might seem overwhelming, but the second you get flustered, it's over.  The exams are much more straight forward than they seem at first glance.  If he says it shouldn't take longer than 15 minutes, he's not lying.  None of the exam problems require anything too extensive, and a question worth 25% of the exam might not need to take you more than 2-3 lines.  Good luck!\nWorkload:\n8-10 hours per week or more on problem sets.  The problem sets are written and graded by the TA, and Cacciuto tells him (or her) specifically to make them incredibly hard.  Sometimes it doesn't quite line up with the material in class, but don't worry since this is only worth 20%.  There are two exams, one in March and one in May, both worth 40%, and relatively straightforward if you know the material.  Study constantly, even if there is no problem set that week.\n"
        }
    ]
}