{
    "prof_info": [
        {
            "prof_name": "Serena Ng",
            "prof_id": 4463,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Econometrics",
            "review_date": "January 06, 2015",
            "review_content": "\nHighly recommended course. I never thought Econometrics would be so understandable. She really goes through everything in detail, skipping over what she says is of a difficulty beyond the scope of this course (she acknowledges her own hand-waving), and the tests are quite fair. She repeats the basics constantly and, if anything, you come out of this course with a very solid framework for thinking about Econometrics from a more advanced level than in Intro. But the math is really not that hard. The hardest thing you must do in terms of computation is matrix multiplication, which is pretty basic. The difficulty in the course, I think, comes from the more difficult topics like Asymptotics, but towards the end of the course it'll all be very, very clear if you stick it through. Like a previous reviewer, my math background was only the Calc I, Calc III, and Intro. to Stats required for the major, plus of course Linear Algebra (getting only a B+ there), and I did fine in the course and found it to be enjoyable and very clear and useful. It's definitely a worthwhile course, with not as bad a workload. Serena is also charming in her own quirky way, and the TA for the semester (Paul) was helpful as well (though I think he's graduating this year so he may not be around for the next course). \nThe hardest part may have been, in all honestly, the 7 problem sets (the TA wrote them all, I think) and the Matlab coding. Chances are you'll go to the TA's office hours at least twice just for the MATLAB help (and granted, some problem sets, like the probit/ logit one, were quite difficult). I had some experience with Java previously so I wasn't too lost, but even people with absolutely no coding experience got it, and it's a nice skill to have and put on a resume. Plus Matlab can do some neat stuff.\nSmall warning though: She tends to make mistakes writing stuff down on the blackboard. She’ll constantly forget to write down primes or inverses, or flips stuff around like a Hausmann test being beta_RE - beta_FE instead of beta_FE - beta_RE like it’s actually supposed to be… So the TA will usually give his disc. section and then write down a different estimator or variance and you’ll be perplexed as to why… and sometimes even he was a bit confused, so it’s hard to really know whether you’re actually learning the right equation because Serena will give you a different version than the TA's because someone forgot a prime or an inverse or simply screwed up (more often than not, the TA's version was correct and sometimes even clearer to understand... Serena tended to rush through writing things down so she'd forget a lot of the small things like primes, which change the whole estimator). Other than that though Serena’s great, and this is a really good course to take. It’s honestly not as hard as it may sound. I personally found metrics so much more accessible and intuitive when done with linear algebra and projections/ matrices than with summations in Intro. If you have even the smallest interest, and have a baby's understanding of matrices, you owe it to yourself to try this course out. It's not that hard, it'll look nice on a resume and transcript (specially if you're considering graduate work), and at the very least gives you some bragging rights when it comes to the inevitable \"What classes are you taking?\"\n\"Yep, Advanced Econometrics.\"\nBut you, and everyone in the class, will know it's not that bad and revel in the knowledge and the comfort of venturing the course and hopefully having succeeded.\nIn short, 9/10 would take again.\nWorkload:\nLight enough.\nOriginally, the breakdown was:\n8 Problem sets: 25%\nMidterm 1 (early October): 30%\nMidterm 2 (early November): 25%\nMidterm 3 (last day of class): 20%\nNO FINAL\nFor our semester, however, because she was running behind, she changed the breakdown around November. I'm not too clear on what the new specifics were, but in general:\nSeven problem sets: 30%\nMidterm 1 (early October): 30%\nMidterm 2 (last day of class): 40%\nNote that she cancelled the November midterm and essentially gave us a final on the last day of class, so it had a lot of material, but it was quite fair if not on the easier side. People did quite well in it.\nIf I'm not mistaken, she said something like ~40% of people get A- and above, and around 67% get B+ or above. So the grading is quite fair if not generous.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "January 06, 2014",
            "review_content": "\nX PRIME X INVERSE X PRIME Y\nAfter this class you will be reverently whispering this. In your sleep. Forever. You will rudely snap at wee passerby econ majors making snide remarks about econometrics. Never speak ill of econometrics. Perhaps only our fellow brethren of 4412 will understand the stunning beauty of GMM and time series.\nGreat class, probably the best economics class you'll take at Columbia. Serena starts at the basics of econometrics and derives most things out of the building blocks. Her class is definitely worth taking notes for, as her lectures beat both textbooks for the class. It is clearly more mathematical than intro, and I'd say a background in probability and statistics (i.e., not 1211) should be a pre requisite. One attraction is the close association of the material we learn in class to academic economic history and current research. We get to know, but are not required to learn, about econometricians and econometrica. In short, she gives Susan Elmes a run for her money.\nThe problem sets require MATLAB. So you'll learn MATLAB. Paul's problem sets help us practice what we learned in class. The experience of running basic simulations by itself is invaluable. Spend time on them. Savor them.\nA few things though. I hope Serena would consider posting her notes online. Her class lectures are clear, though there are a few organization issues when they go on the blackboard. Being econometrics from a linear algebra standpoint, no one can remember all the primes and inverses. Her rationale for not including them is that we are then encouraged to read the books. Greene is not stunning, and Stock and Watson are slightly better. The curve was also slightly harsh.\nWorkload:\nProblem sets can take a long time, but you never feel that time is wasted, as you are simultaneously practicing both MATLAB and reviewing class material. The tests are pretty hard. Make sure you study for those.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "December 30, 2013",
            "review_content": "\ntl;dr version: If you're interested in serious economics, like statistics and don't have an allergy to linear algebra- you owe it to yourself to at least try this course. It may be one of the best you take at Columbia, and if it isn't for you, you'll know from the start. Prof. Serena Ng is also one of the most perfect professors I've had the privilege to learn from.\nOne of the best classes I've ever had at Columbia, due primarily to Prof. Ng's amazing teaching. And that's no trivial or predictable statement for a class titled \"Advanced Econometrics\".\nIf you liked Econometrics or Statistics (and even mores if you also like Linear Algebra), and are willing to put in some effort, this is the class for you. You'll know off the bat whether this is a class you want to take: the first few lectures are a very good sample of the rest of the course, and she'll give a tough tone to make clear to everyone that this is not a light course. However, once the drop date passes (and even before), she'll show more of her friendly, approachable side, and this is what really matters. If you ever go to office hours you'll find a friendly listener; after warning people in class that those who weren't serious shouldn't stay, I became a bit worried and asked her personally if I should stay during office hours. To my surprise, she actively encouraged me to stick with the class. \nI can't quite explain just why this class works so well. Every class involves nothing more or less than Prof. Ng writing more or less continuously on the blackboard, with explanations where required, and answering questions when asked. However, as someone who liked Econometrics as a subject (but not as a class) in Intro to Econometrics, and as someone with middling math/stats skills, I simply fell in love with the class.\nThe material is presented in an incredibly clear and precise way. There is zero \"hand-waving\" in this class; Ng will derive every formula, explain the intuition and give you the context. By the end of the class you'll find you can derive many of these formulae yourself. Whatever you don't understand you can ask Ng or the TA. Again, even though the class is \"Advanced Econometrics\", I actually enjoyed the lectures immensely and never once felt I was nodding off despite this being my fourth straight class from 8:40. \nThe tests are the absolute fairest I have ever encountered at Columbia, simply put. There are no \"gotcha\" questions; you will be tested on the things studied in class, and you'll have a good idea what the test will look like from the practice exams (and a bit from the problem sets). Your grade will be directly proportional to the amount you know and how hard you studied. The tests were so appropriate I actually enjoyed them a bit. The fact that there are three midterms, no final and none of the tests are cumulative helps a lot (one less final during final week).\nIt seems this semester we had fewer grad students and no Fed people, because the curve was not as unforgiving as others have mentioned. Alternatively, perhaps Ng has changed. Still, she said this was the best class she's ever had (grade-wise), and still I managed to get an A- with 3 and 10 points above the mean on the first two midterms (never got my grade for the third). \nThere was weekly homework but there isn't much point in commenting because the TA changes each time. \nA word, however, on Paul: he's fantastic, one of the best TAs I've ever had. He seems a little too timid at first, but don't let that fool you: he cares about the students, is incredibly helpful, and is brilliant. He would often have 4-5 hours a week of office hours and recitations before tests, including the day before the exam, in addition to email help which he was often open to. His office hours often consisted of him sitting down for two straight hours, answering difficult questions continuously until everyone understood everything that was unclear (he often stayed beyond the two hours). His problem sets were long and somewhat hard, but they were excellent at drilling in the material and he was always open to questions. Every single time, he had the problem sets graded the day after they were due. And through it all he was friendly and considerate. This is a top-notch TA, take advantage of that if you are lucky enough to be in a class in which he's the TA. \nOne last note: you'll need a minimal knowledge of Matlab to do this course, but nothing more than basic commands. If you do't know Matlab, just take some time during the beginning of the semester to get moderately comfortable with it, and you should be fine. \nWorkload:\nWeekly problem sets (mostly Matlab based with a sprinkling of theoretical questions), three midterms, no final. Fairest exams you could ask for, though by no means easy. \nGrading: 30% 1st midterm, 25% 2nd midterm, 20% 3rd midterm and 25% problem sets. \n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "April 03, 2013",
            "review_content": "\nI want to echo the review below. This was one of my favorite classes here at Columbia, mainly due to Professor Ng being an excellent teacher. \nShe told us that she had entirely redone her syllabus, tossing out the stock slides she used in the past and making her own materials. She also teaches what the class wants to learn and gives the students a choice over what the last couple of topics will be (she gave us a choice between VAR or PROBIT/LOGIT).\nI went into this class with a very weak math background (stats 1211, Calc III, and linear algebra) but the course was still entirely manageable. Professor Ng teaches to make sure you understand the concepts and is not as concerned with whether you can crunch numbers or know everything about statistical derivations. She repeats the important concepts a lot and it was always very clear what she thought was important and what material we would be tested on. She can be a little stern in class (like Professor Elmes), but I like that style of teaching and gained a lot from it.\n\nWorkload:\n4 Problem Sets (made and graded by the TA) - Our TA was great and his homeworks were always fair (except the last one but it was curved anyways).\n3 midterms - Not cumulative and pretty fair. Sometimes her questions are open ended and it is a little unclear what exactly she is looking for, but if you just write down everything you know about the topic you will get most of the credit.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "May 03, 2012",
            "review_content": "\nFantastic class.  I cannot disagree more with the previous reviews.  If you were thinking about taking this class but were discouraged by the previous reviews, don't be.\nI really enjoyed Advanced Econometrics with Professor Ng.  She was able to present the difficult material in a way that made it a lot easier to digest.  She is an engaging lecturer who always makes sure that the class is following her instead of rushing to get through material when no one understands. \nProf. Ng gave us really good intuition for concepts, which she drilled into our heads through constant repetition.  She's also always willing to meet with students outside of class to clarify the material (what a previous reviewer said about her not caring about students is completely false).  \n\nWorkload:\n3 midterms (non cumulative), no final. Exams are concept-based\n4 problem sets (assigned by the TA)\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "September 05, 2011",
            "review_content": "\nThe truth is somewhere between the previous reviews, though closest to the first review. (In short: don't bother taking this class).\nSerena doesn't put much time/effort into the class, letting the TA pick the questions for the problem sets. She also \"reviews\" the exams, but the TA is the one who actually gives the grades. Additionally, she just uses the stock slides that come with the Stock & Watson textbook. Chances are your Intro to Econometrics professor used the same slides, so you might as well not bother printing them out again (they're exactly the same!)\nA previous reviewer is correct when pointing out that Serena never tells you what you scored on the final exam, let alone what the distribution of grades in.\nIf you are an undergraduate, keep in mind that many of the students in this class are graduate students and have taken similar classes before. Because she barely curves at all, it will be very, very difficult to get an A or A- in this class. Serena gives very few A/A- grades, and they tend to go to graduate students. My friend one of two students to score above a 90% on the first exam, and scored one of the top scores on the second exam as well. Nevertheless, he ended up with a B+ for a final grade. I beat the mean on the same exams, and I got a B-. That should give you an idea of how unforgiving the curve in this class is.\nIn the end, I agree that the class isn't really worth it. Not just because of the grade, but because you won't learn anything. The textbook is the same as your previous econometrics class, and Serena has some weirdly unhealthy aversion to applied material (despite this being an econometrics class!).\nIf you want to learn this material properly, take the Linear Regression class in the Statistics department. Same syllabus, except you'll actually learn something.\nWorkload:\n4 problem sets (not long, but difficult and time-consuming). Three non-cumulative exams, graded harshly - and a bit inconsistently. Doable, but definitely not worth it.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "December 30, 2010",
            "review_content": "\nI'm mainly writing this to disagree with the first reviewer and clarify a few false statements, as I was in the same class, Fall 2010.\nThe previous reviewer is incorrect about the following:\n-That she did not grade our exams: that is false, she graded half of the first exam, all of the second, and I'm almost certain all of the final.\n-That it is possible she didn't write the exams: she wrote all the exams, there was never any ambiguity about that.\n-That it is unclear what weights each exam had in calculating our final grade: again there was never any question about this, every exam had equal weight (25% each), as she clearly wrote on the syllabus and told us in class.\nIn addition, the first line of the 3rd paragraph reads:\n\"The homework assignments are long...\"\nWhile the first line of the paragraph under \"Workload\" reads:\n\"4 problem sets. Not very long...\"\nSo take that review with a grain of salt.\nPersonally I liked Professor Ng.  I thought her lectures were good considering the material is very abstract and difficult, her slides were decent, and she was overall a good instructor who put a lot of time into the class.  On top of that she showed an interest in the students; she tried to learn our names and on occasion before class she would chat with the class and ask about students' background and future plans.\nThe fact of the matter is that this class is quite competitive as there are a lot of of grad students (mostly internationals in various MA programs, like stats and math of finance, desperate to get into PhD programs in finance or economics, or hedge fund jobs, or whatever - there was even a PhD student in operations research in the class) and a few people from the NY Fed who were only taking this class.  Also in the most recent summer mailing, the econ department strongly recommends (in some cases requires) undergraduates doing a honors thesis to take this class.  So even from the undergraduates in the class you can expect a competitive pool.  I would think this reality would dampen the lofty expectations of some, but apparently not.\nI got a B in the class, and no one I know got an A (I spoke with two others).  If I were to wager a guess, I'd guess the analysts from the Fed were the ones who left with A's.  At the same time, despite the crowd of talent at the top, there were a few people doing P/F who didn't really care about doing well on the exams, so they filled up the very bottom of the curve nicely.  Exactly as Professor Ng told us on the first day: it is not hard to do OK in the class, but it's very hard to do really well.\nWorkload:\nReporting on the problem sets is kind of useless for anyone reading this because the TA makes them up and grades them, and I imagine there is a new TA every year.  Also what program the TA expects you to use for computational problems is also dependent on the TA you get.  This semester the TA said he only knew MATLAB, but would accept other programs, so long as you comment on your code and explain each step.  I used R and eViews and he didn't seem to have a problem with it.  This semester I would definitely call the problem sets \"long,\" but there are only 4 and I thought I got a lot out of them, not so much in preparation for the exams but in using statistical software.  \nRegardless of the TA, Professor Ng does dictate that there will be 4 problem sets and that they count for a total of 25% of your final grade.  As is often the case in this type of class with long and detailed problem sets, the grading is very strict at the beginning of the semester but half-way through it becomes lax as the TA gets busy.  I think that will generally hold for any TA they assign to the course.\nThere are 3 exams, each 1 hour 15 minutes, all non-cumulative, each is worth 25% of your final grade.  The fact that they are non-cummulative sounds good on the surface, but it makes things kind of distorted considering the three parts of the course are not given equal treatment.  For instance, we spent like 7 weeks on time series, and 2.5 weeks on microeconometrics.  But the exams for each part were of equal length and counted for an equal amount.  All of the exams were difficult and unpredictable.  They were especially hard to prepare for since the TA assigns the homework while the professor writes the exam.  Even with Fed analysts and SEAS PhD students in the class, only 3 people scored above 90 on the first exam, I think the TA said the highest grade was in the low 90's (out of 100), and only one person got above 80 (out of 95) on the second, and I think the highest grade was an 83.  Don't know any stats about the final, but it was hard.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "December 27, 2010",
            "review_content": "\nOpacity is the theme of this class.\nStart with the syllabus: the grade weights that she handed out on the first day of the class didn't add up to 100%, and the four problem sets were worth more than the final exam. We asked her three different times in class what the real weights were, and she gave us a different answer each time.\nProblem sets: Mistakes galore. She won't email the class, so you won't know they're there unless you ask. If you asked the TA, he'd tell you what they were. If you asked the professor, she wouldn't, because she didn't know (the TA wrote the problems, even though this is against department policy). Also, the TA will keep adding problems to the problem set, sometimes with only 2 or 3 days left to complete them.\nExams: Vague questions. For the second and third exams, there was a problem that was so badly worded that she ended up giving everybody full credit each time. For the first two exams, the TA just writes a number next to each question when grading, with no explanation for the points lost. For the third exam, you won't even get to find out your exam grade, let alone the grading scheme.\nContent: You won't learn much, or really anything at all. If you're smart, you'll learn how to regurgitate the answers she wants enough to do well on an exam (I got an A- in the class), but even if you end up with a good grade, you won't know anything more than you did the first day of class.\nOverall, this class is probably not worth your time.\nWorkload:\nProblem sets are long for the amount of time you have to do them. Exams can be difficult, with means in the low 70s. Unforgiving curve.\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "December 21, 2010",
            "review_content": "\nIt's very clear that Professor Ng does not think that this class is a priority for her. The lectures are mediocre (luckily her slides are fairly clear, although they often have mistakes on them). The TA chose all of the homework problems and graded the homeworks. Though she looked at our midterms, she did not grade them (again, the TA's job), and it's possible that she didn't even write the exam problems.\nThe material is incredibly theoretical - you will get no practical knowledge out of this course. On the exams, her idea of an \"applied\" problem was handing us a low-resolution graph of data and asking us to comment about statistical properties of the graph (without any actual numbers or even test statistics). You can get an A in this class without having a clue how to calculate a Wald statistic on real data (for example). \nThe homework assignments are long and riddled with typos. Don't expect the TA to email the class if there's a mistake on one - he'll only mention it if you ask him directly in office hours or in recitation.\nGrading is very arbitrary, given that 95% of the problems contain no numbers, and you were not allowed to write more than 5 lines per question (a rule that was actually somewhat enforced). The mean on the first exam was a 73, and she claimed that it was \"apparently too easy\".\nIn the end, don't take the class if you want to learn econometric analysis (you won't), or if you want an easy A (you may get one, but it's not easy).\nWorkload:\n4 problem sets. Not very long, but you don't have much time to do them (the last problems were posted on Friday, and they were due the following Wednesday. 3 midterms. It's unclear whether the last one was worth more than, less than, or the same as the others.\n"
        }
    ]
}