{
    "prof_info": [
        {
            "prof_name": "Gita May",
            "prof_id": 87,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "French Novel Before the Revolution",
            "review_date": "January 10, 2004",
            "review_content": "\nProf. May is, as other reviewers have stated, the cute, grandmotherly type.  She is not neccessarily the most stimulating professor-- for the first few weeks the only opportunities to participate in class were to read from the book.  The class improved towards the end of the semester-- she actually asked for her students' opinions occasionally, and she definately had some interesting things to say.  Overall, not the best class in the department, but not the worst, and a nice one to take if your workload is otherwise difficult.\nWorkload:\nA fairly normal amount of reading-- although it picks up towards the end of the semester.  While it is true that you don't have to do it, I tried to because they were interesting books, and I found it enriched my experience overall.  The final isn't something you should worry about at all.  Their is one 15 page paper, which sounds intimidating, but if it is your first French paper of this length (as it was for me), it is a good one to start with, as I believe Prof. May does not give lower than an A-.  I found writing the paper to be actually a rewarding experience because I enjoyed my topic, and spent some time on my research.  As with everything in this course, however, it is what you make of it--except for the A-range grade, which is virtually guaranteed.\n"
        },
        {
            "course_name": "French Novel Before the Revolution",
            "review_date": "December 19, 2003",
            "review_content": "\nwhile May certainly is the nice little grandmotherly type that other reviews have described, her class did absolutely NOTHING for me.  i've taken over a dozen french classes here and this, by far, was the worst.  half the class didn't show up, the other half barely did the reading.  forget sharing your opinions about the book--she doesn't really care.  after i spent a week and a half writing our final paper, she read and graded it in FIVE MINUTES and just slapped an A on top.  the class is an easy A, no doubt, but, personally, i felt the semester just wasn't worth it.    \nWorkload:\nzilch--there's reading, but since she'll never ask your opinion on it, why bother?  one presentation, one final, and one final paper...don't worry, you'll walk away from the class with no less than an A-\n"
        },
        {
            "course_name": "Rousseau",
            "review_date": "November 20, 2003",
            "review_content": "\nI truly enjoy the class. It is true that one does not necessarily have to do all of the reading or that there are things that are repeated a few times. However it is really up to you to make the best out of it. I have learned a lot and I enjoyed listening to her as she is indeed very knowledgeable, even though more in-class discussion could add to the course. \n"
        },
        {
            "course_name": "Rousseau",
            "review_date": "June 12, 2003",
            "review_content": "\nWhile Professor May is indeed a nice grandmotherly type, she is just too sweet for her own good. Her in-class lectures don't encourage you to try; reading the material becomes pointless after a while, since she is the only one speaking during class.  Forget trying to give your own opinions about the material or bringing in relevant texts; but mention that Rousseau wrote an opera called \"Le Divin du  Village\" (a fact which she re-taught us every day), and she'll praise you for the rest of class. Although I will undoubtedly never forget Rousseau's opera, that he was a hypochondriac, or that he hated Voltaire, I have to agree that the easy A is just not worth it. While Professor May is very nice, you'll spend her class learning what she tells you (sometimes twice) and not learning for yourself. \nWorkload:\nOral presentation (easy), 15-page paper, (what you make of it) and final (if you have any notes at all it will be fine)\n"
        },
        {
            "course_name": "Rousseau",
            "review_date": "June 12, 2003",
            "review_content": "\nWhile Professor May is indeed a nice grandmotherly type, she is just too sweet for her own good. Her in-class lectures don't encourage you to try; reading the material becomes pointless after a while, since she is the only one speaking during class.  Forget trying to give your own opinions about the material or bringing in relevant texts; but mention that Rousseau wrote an opera called \"Le Divin du  Village\" (a fact which she re-taught us every day), and she'll praise you for the rest of class. Although I will undoubtedly never forget Rousseau's opera, that he was a hypochondriac, or that he hated Voltaire, I have to agree that the easy A is just not worth it. While Professor May is very nice, you'll spend her class learning what she tells you (sometimes twice) and not learning for yourself. \nWorkload:\nOral presentation (easy), 15-page paper, (what you make of it) and final (if you have any notes at all it will be fine)\n"
        },
        {
            "course_name": "Rousseau",
            "review_date": "May 19, 2003",
            "review_content": "\nProfessor May should not be teaching any more.  She knows a lot about the subject matter, but she stumbled over her lectures, repeated entire half-hour chunks, got the students mixed up with each other, and did not engage with the texts in more than a reading-comp level.  I have no doubt that she was once an asset to the departement, but she is too old, too disinterested, and too confused to be teaching anymore.  The easy A or A- will ensure that students sign up for her classes, it is definitely not worth it.\nWorkload:\nPresentation, final, fifteen page paper.\n"
        },
        {
            "course_name": "French Cultural Studies: Cultural Standards: Age of Classicism",
            "review_date": "January 05, 2003",
            "review_content": "\nProf. May is a wonderful teacher. She knows a lot and loves what she is teaching. A class you can sit back, relax, enjoy and still learn a lot.\nWorkload:\n1 paper (13-15 pages) and a final. Very leniant grading.\n"
        },
        {
            "course_name": "French Cultural Studies: Cultural Standards: Age of Classicism",
            "review_date": "December 17, 2002",
            "review_content": "\nWonderful professor, takes the time to make sure everyone understands everything. Gives lots of depth and context to make reading 17th century French literature interesting. Very little anxiety attached to this course.\nWorkload:\n6 books over the course of the semester, 1 oral presentation, one 12-15 page research paper, final. No problem.\n"
        },
        {
            "course_name": "French Cultural Studies: Cultural Standards: Age of Classicism",
            "review_date": "December 07, 2002",
            "review_content": "\nProf May is lovely! She is kind and very clear in teaching.Patient with all kinds of questions, and she is just an expert in her field. So don't doubt her. And she never barks at you either. Very well-respected.\nWorkload:\nVery fair amount of readings, one 15 pages research paper and a final\n"
        },
        {
            "course_name": "Rousseau, Novel Before the Revolution",
            "review_date": "December 31, 1999",
            "review_content": "\nMay is the cute little grandmother you always wanted who also happens to know everything about Rousseau and 18th century French literature. Very kind about grading.\nWorkload:\n1 oral presentation, 1 essay, Final exam.\n"
        }
    ]
}