{
    "prof_info": [
        {
            "prof_name": "Allison Busch",
            "prof_id": 2863,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Honors Thesis Seminar",
            "review_date": "December 04, 2012",
            "review_content": "\nProfessor Busch is a wonderful thesis seminar instructor. She is kind, clear, helpful, encouraging -- everything she should be. And she brings snacks every week, which is always a plus since our class is Wednesdays from 6-8 pm! She gives feedback for assignments (via email) in a timely fashion and make sure that everyone participates in the seminar. I don't have a single bad thing to say about her. I would definitely recommend taking the MESAAS senior thesis seminar with her.\nWorkload:\nI mean, it's a senior thesis... at the same time, Prof. Busch broke down the work in a way that made it seem much more manageable. \n"
        },
        {
            "course_name": "Honors Thesis Seminar",
            "review_date": "December 04, 2012",
            "review_content": "\nProfessor Busch is a wonderful thesis seminar instructor. She is kind, clear, helpful, encouraging -- everything she should be. And she brings snacks every week, which is always a plus since our class is Wednesdays from 6-8 pm! She gives feedback for assignments (via email) in a timely fashion and make sure that everyone participates in the seminar. I don't have a single bad thing to say about her. I would definitely recommend taking the MESAAS senior thesis seminar with her.\nWorkload:\nI mean, it's a senior thesis... at the same time, Prof. Busch broke down the work in a way that made it seem much more manageable. \n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "February 13, 2007",
            "review_content": "\nI think Professor Busch did not say a single positive thing about Hindus the whole semester, and kept criticizing implicitly their practices, beliefs, and even origins. I don't understand why she would be teaching a course on India when she can't seem to present a single good quality about Hinduism.\nAlthough tries to come off as impartial, is a very biased Professor.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2006",
            "review_content": "\nThis woman should not be teaching at Columbia. \nI felt as though she had little clue as to what she was \"teaching\" if you could call it that. She agreed with almost any absurd point a student would make, even ones that contradicted each other. She tries to relate everything back to Hindi or some sort of Eastern study or religion, etc. as it's her field. She is scathing on grammar when grading essays. Her wannabe accent is also annoying. I'm not sure what she's trying to pull, if it's British or some sort of weird combination of something but it comes off as being obnoxiously pretentious and comes and goes in her speaking. I'm sorry if you have the misfortune of having her assigned to you for Lit Hum, if possible do anything in your power to get out of her section. \nOne good thing about her is that she doesn't assign extra reading on the syllabus. \nWorkload:\n3 essays, each progressively longer and weighted heavier. \nLots of reading, but that's Lit Hum and 1 introduction to a work read that semester per student. Overall not too bad, but still not great.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 06, 2006",
            "review_content": "\nProfessor Busch is a smart and thought-provoking teacher.  She does a very good job of moderating a discussion, and balancing the need to provide her own commentary based on background knowledge and allowing the students to guide the discourse.  Her field of South Asian studies provides a nice contrast to the Western works of Lit Hum, and she is successful in making you consider the broader cultural and historical implications of the books we read.  She is a fairly difficult grader, but in a good way, because she reads papers carefully and her comments are aimed towards improving your writing skills. \nWorkload:\naverage- 3 papers, very fair midterm\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 06, 2006",
            "review_content": "\nProfessor Busch is a smart and thought-provoking teacher.  She does a very good job of moderating a discussion, and balancing the need to provide her own commentary based on background knowledge and allowing the students to guide the discourse.  Her field of South Asian studies provides a nice contrast to the Western works of Lit Hum, and she is successful in making you consider the broader cultural and historical implications of the books we read.  She is a fairly difficult grader, but in a good way, because she reads papers carefully and her comments are aimed towards improving your writing skills. \nWorkload:\naverage- 3 papers, very fair midterm\n"
        },
        {
            "course_name": "Topics in Asian Civilization: Middle East & India ",
            "review_date": "August 30, 2006",
            "review_content": "\njust a biased professor who portrays a nation, culture, religion, and region as backward, decrepit, downtrodden, and a shame for the world. a major cultures class? i would say not.\nthe reason: hinduism is portrayed from the observer's eyes, while the christianity/judaism/islam are taught from the believer's eyes. simply ridiculous. i could not bear sitting through that class at some points.\nthe class was supposed to be about civilizations, but we spent approximately 5 minutes on the indus valley civ and 20 minutes on the moghul empire. Rest of the class was spent on how women are abused, sati (an ancient practice that she herself said was no longer an issue...then why did we waste time on it?), and the sexual texts of india. horrendous portrayal of this land.\nAside from all this was the fact that she referred to an ancient text as \"full of crazy S--T\". While the text may be controversial, it was pretty ridiculous of her to say that in the classroom. \nIn my opinion, she should not even be teaching at Columbia, and should not teach anywhere...until she understands that at this point in time, we have to learn BOTH positives and negatives of a culture, not just one.  She has discouraged me from taking any more MEALAC classes about South Asia.\nWorkload:\nmidterm was ridiculous. it was okay for me because i am from the region originally.\n"
        },
        {
            "course_name": "Topics in Asian Civilization: Middle East & India ",
            "review_date": "August 30, 2006",
            "review_content": "\njust a biased professor who portrays a nation, culture, religion, and region as backward, decrepit, downtrodden, and a shame for the world. a major cultures class? i would say not.\nthe reason: hinduism is portrayed from the observer's eyes, while the christianity/judaism/islam are taught from the believer's eyes. simply ridiculous. i could not bear sitting through that class at some points.\nthe class was supposed to be about civilizations, but we spent approximately 5 minutes on the indus valley civ and 20 minutes on the moghul empire. Rest of the class was spent on how women are abused, sati (an ancient practice that she herself said was no longer an issue...then why did we waste time on it?), and the sexual texts of india. horrendous portrayal of this land.\nAside from all this was the fact that she referred to an ancient text as \"full of crazy S--T\". While the text may be controversial, it was pretty ridiculous of her to say that in the classroom. \nIn my opinion, she should not even be teaching at Columbia, and should not teach anywhere...until she understands that at this point in time, we have to learn BOTH positives and negatives of a culture, not just one.  She has discouraged me from taking any more MEALAC classes about South Asia.\nWorkload:\nmidterm was ridiculous. it was okay for me because i am from the region originally.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "May 21, 2006",
            "review_content": "\nAllison covered the India half of the course. I was extremely dissapointed in this course and would recommend taking something else for major cultures. Allison seemed like a very nice woman and a very knowledgable professor. Unfortunately, though she clearly wanted it to be a good class, she just did not know how to run a lecture or structure this sort of class. The lectures were boring to the point of being painful and the reading were plentiful, scattered and also often very boring. I think with a little experience or a more specialized/smaller class, Allison could be a tremendous professor. Unfortunately, this class and Allison specifically were pretty terrible.\nWorkload:\nFor the India half of the class: loads of reading (most of which you don't have to do), one paper, one midterm (which was pretty unreasonable but curved).\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "March 28, 2006",
            "review_content": "\nI had high hopes for the India unit of the intro to MELAC class, but I was utterly disappointed. I felt as though everything we talked about was depressing and pessimistic, giving the entire class a very negative view of the country, its culture, and its religion.\nThe midterm was like something out of middle school, except with an Ivy League twist. From the approximately ninety readings we had done in the course, we had text identification on the midterm. While some questions asked what the significance of the passage was, others simply asked \"who wrote this?\" It was not a comprehensive exam, but rather a ridiculous attempt to see whether people had done the readings. Even IF you'd done the readings, committing the ninety authors to memory based upon readngs that are all very similar is not a productive exercise. \nDue to the atrocity of a midterm, the curve was significant--an entire letter grade--but students were still left with D's. Basically they ahd to curve the exam so that people wouldn't fail. \nThis class was Busch's first class she'd ever taught at Columbia. I feel like she has a lot of potential, especially if yo uwere to take a class of hers that was smaller and more focused.\nWorkload:\nTons of reading (you will use up your printing quota every week), 4-6 page paper (graded by TA), final.\n"
        },
        {
            "course_name": "Topics in Asian Civilization: Middle East & India ",
            "review_date": "March 19, 2006",
            "review_content": "\nA teacher of the old-school variety: class attendance & participation as well as clearly demonstrated effort (on the student's part) to grapple with the material counts for big brownie points with Busch. (She's also a stickler for proper grammar and syntax - high school-ese isn't going to wash here.) The flip side of the coin, of course, is that she also goes out of her way to ensure that the primary purpose of the course - ie. learning - is achieved. In a class of 150 students, she encouraged us to meet with her individually to go over our paper topics (and was extremely helpful with additional sources in my case). \nHaving said all that, her style of teaching - and this is a problem by no means hers alone, not by a looong shot - is probably more conducive to smaller group settings, eg. seminars and the like. She doesn't lecture, she talks. (Pritchett is another MEALAC name that leaps to mind.) That works great when there are only 20 people in the classroom - communication becomes a two-way street - but when you have to contend with a lecture hall mostly full of freshmen and juniors who behave like 5 yr olds with a severe learning disability then blank-eyed shoe-gazing, a general air of somnolence, and little incentive to engage in the learning process are only to be expected. (Which probably explains her heavy-handed tactics.) This was her first semester teching the course though, so I guess the rough spots should be ironed out the next time round.  \nThe material is structured thematically, which forces quite a bit of independent thinking, as opposed to passive listening and reception. \nWorkload:\nBusch took the first half of the course - the India half - and Mohaghegh takes the second. Her portion consisted of weekly readings running anywhere from 30 to a hundred pages or more, a 4 to 6 page paper, and a midterm that included various IDs, short answer questions, and 2 essays (we got 5 or 6 to choose from). NOT an easy A, even after the grade curve. \n"
        }
    ]
}