{
    "prof_info": [
        {
            "prof_name": "Natasha Rossi",
            "prof_id": 10512,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 23, 2013",
            "review_content": "\nI hadn't been this disappointed since my father walked out on my family in 2003.\nTo be honest, the course wasn't that bad. In fact, it was pretty standard reading (if not a little less than what my peers in other sections were assigned).\nHowever, the discussions ran dry. When faced with a question concerning context and concept of an author's point of view or argument (which is ... sorta, I don't know, vital to understand and for succeeding in the course), Rossi would often turn to the course's (obvious) best students to provide an answer (i.e.. \"What do you guys think?\" still doesn't answer my question on what the fuck Hobbes is trying to say.)\nBut I think my main source of dissatisfaction comes from the inconsistency in the workload. Papers were assigned deadlines, but all three were pushed back. Granted, in an ideal world, this would provide additional time, but she was often recuperating for the time it took her to reply to emails about the papers (and, if you astutely followed her instructions for each paper, you were required to email your chosen texts for the paper prior to writing the paper; this system, obviously, was more inefficient than anything).\nOn the other hand, her \"American jokes\" were funny (she's Canadian, from McGill, and never let's you forget). I actually can't get through a course at Columbia taught by a non-US native professor without some form of American mockery, I've noticed. \nIn spite of it all, she was bearable. I wouldn't recommend her section unless you kinda have the urge to throw out all that you've learned in essay writing (including University Writing). \nOtherwise, try to find a section without pop quizzes, the same number of papers (c'mon, think about it, would you rather write three 5-page papers, or two 10-pagers?), and just as nationalist of a professor. \nWorkload:\nStandard: the readings are CC. You won't finish all of them if you tried. (Still waiting for the one group of students to come up with a system of dividing the readings so it doesn't look like the *entire* class skipped out on reading The New Testament.)\nYou'll get infrequent pop quizzes. They don't do much, and she won't grade them until the end.\nPapers: three 5-pagers. You also will get these back pretty late. \nMidterm/final: passage ID's which are easy to identify, a bitch to analyze (does she expect a full paper analysis? My Lord(e)...). Also, a long essay comparing three authors on a thematic concept. No short passage analysis, which is generous.\n"
        }
    ]
}