{
    "prof_info": [
        {
            "prof_name": "Maria Cueto",
            "prof_id": 12806,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "January 07, 2014",
            "review_content": "\nI will preface this review by noting that when I was choosing from the numerous Calc III professors, many of them had all over the place reviews, and I took my gamble with a professor who didn't even show up on Culpa. Hopefully, this review will give some measure of accurate picture as to what the class experience was like. (for a shorter review, please visit the last paragraph).\nThe Good:\nThere were, in short, really only two good things that she excelled in as a professor. The first was that she provided practice tests before each midterm, and all of her homework assignments were clearly laid out on her website. The second was that she always held review sessions that went over the majority of the material, so that if you missed a lecture, you could probably get a mini-lecture on it on review day.\nThe Not so good:\nThat website looks like it was made in the early 2000's, and there were no practice tests for the final, simply a giant list of book problems that were from each of the sections out of the book. Her reviews covered a lot of superfluous material and don't really map over to her tests as well as they could, and she often runs out of time on review day so only the first x% of the material is reviewed.\n\nFor the most part, you could study out of the book and understand ~90% of the course material. Only a small subset of things does she teach that aren't in the book. In lecture, she has a variety of shortcomings that make her about as effective as the book. She spends a lot of time on things that aren't very important (the differences between the dot product and cross product in terms of vector algebra, what direction the gradient points to on a contour map, etc) and aren't going to be on the test. She clutters her lectures with notation that would be familiar to anyone versed/interested in math, but makes it a little harder to understand (one such example was her use of \"R3\" to describe 3D space. Little things like that). She makes silly arithmetic errors, and tells us she is terrible with numbers. It's a small complaint to have your math professor be able to consistently evaluate cos(30Â°) correctly, but she messes up like this quite often during lecture. Her handwriting is atrocious; there were numerous times I had to stop and ask people what exactly she had been writing. Her capital M's look like a square with the bottom side erased out, for example. I want to say she is from some spanish speaking background, though I might be wrong; this contributes, I think, to a slight accent and mispronunciation of some words that are kind of grating (subtract is pronounced \"substract\"). To be fair, these are all petty little things that make lecture feel a lot longer than it is, and distract from her teaching.\nI feel as if it is not necessarily that she's a poor teacher, but rather that she is a little oblivious. She evidently cares a decent amount about her students, but often times misses the crux of an asked question or doesn't realize that there is chatter in the back couple of rows, which, again, decreases from the effectiveness of lectures. She says things that are flat out wrong some times (\"your final will be shorter and easier than your midterms have been. AHAHAHAHAHHA no.)\nOn that note, though, I personally never went to office hours, because she had them before class started (when some people actually have class then. Brilliant idea). However, from friends who have told me that they have been to office hours that she is decently helpful there. The best way to talk to her is just to do it right after class, she is usually the most open then.\nHer homework is graded on time, though often times the graders make mistakes (egregious ones, too. \"sqrt(4) = 3\" -1 point. Thanks math TA's, good work).\nThere are two midterms and one final. Her first midterm was relatively easy, and was similar in difficulty to the practice exam she gave. Her second midterm was definitely a lot harder than the practice exam she gave, and many people weren't prepared for that. Her final was absolutely much, much harder than anything she had given us. The averages (out of 100) on each of these tests went from ~75 to ~59 to, my guess is, somewhere in the 30-40 range. There are two problems with her tests. She writes all of her tests, and she is pretty terrible at writing questions. For example, on the final she gave us a kinematics style problem that asked where an object was at a given time. This time was after the ball had hit the ground, so the correct answer would have been something along the lines of \"The object is 20m below ground at t=3s.\" Her ability to write test questions that competently assess your knowledge leaves much to be desired. In addition, her tests are a curious blend of spitting knowledge and equations back out when the question asks for it, and having to stretch your knowledge and use the tools at your disposal. When she asks for the former, the questions are easy, and when she asks for the latter, often times she expects far too much. This, I think, is the reason that her tests come across as difficult.\ntl;dr: What you should keep in mind when you make your decision: She is not the clearest lecturer for getting the information you need to know across, and her tests aren't necessarily easy. In order to get an A- or better, you need to put in the honest work to understanding each of the concepts she presents/are looked at in homework. By virtue of the way she set the class up, honest work is a necessity, but if you are okay with putting in less work, you'll probably get a lower grade. I wouldn't honestly recommend her due to all of the issues she has as a lecturer, but I'm sure there are worse professors out there.\nWorkload:\nWeekly homework assignments, which take between 30min-2hrs, depending on how familiar you are with the material and how quickly you tend to work.\n2 midterms of six questions each\n1 final of eight questions\n"
        }
    ]
}