{
    "prof_info": [
        {
            "prof_name": "Marie Regan",
            "prof_id": 1201,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Intro Film History & Theory",
            "review_date": "January 10, 2012",
            "review_content": "\nI agree with the last review. Her class was not easy, but if you follow the instructions to a T you will be fine. There is a lot to study for during the midterm but the exam was not too difficult. Regan definitely knows the material, but tends to force her viewpoints on the class. Nothing else to say\n\nWorkload:\nTerm paper, midterm and final paper. Participation counts in this course as well.\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "December 14, 2011",
            "review_content": "\nI have mixed feelings about this course.  I had started to take it last year with a different professor but had dropped it after an absurdly terrible first lecture.  This year, I needed to get it out of the way in order to take other film courses so I took it with Regan.  On the one hand, Regan's syllabus was WAY better than the first professor, Regan clearly knows what she's talking about, she contextualizes all the films and movements, and she knows how to spark interesting questions about each and every film.  On the other hand, Regan is a bit dry, her powerpoints are stuffed with information and she moves quickly, she responds a little negatively when students profess differing opinions in class (although granted, a lot of those kids were freshmen that rambled about their feelings), and her assignments don't allow for too much freedom.  Overall, I'm glad I took the course, and Regan seemed just as good as professor as any to take it with.  I definitely know way more about film theory and have plenty of interesting quips for cocktail parties and for family dinners when my uncle gets boring.  \nWorkload:\nweekly reading assignments but not too heavy, discussion section with a focus on participation grade, one paper for the semester, one midterm (fair, but tough), one take-home final paper (tough, but plenty of time to work on it)\n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "April 05, 2011",
            "review_content": "\nI had a nightmare with this professor in it--an actual nightmare. I think this sums up Marie Regan as well as the course. I would strongly advise those considering not to take it. If you must, in order to fulfill a requirement or take other film classes, so be it. This was by far the worst class I have taken thus far, because she takes such an interesting subject and completely sucks the intrigue out of it. It is not a good foundation for film courses and can often cause students to deplore the subject as a whole. \n She is not open to interpretation in class discussion, (though discussion is a vital part of your grade) and she will intentionally go out of her way to disagree with you despite you reiterating her own interpretation. She also has maintains clear favorites. She will blatantly insult a student for their contribution in class and moments later, praise another student who she favors despite them voicing the same thought. She is a stickler about the theory and her demands are unrealistic and unreasonable. Overall, the exams are not too hard, so if you must take this course, take it at Columbia so that you can interact with the TA instead of having to directly deal with her. \nWorkload:\nAn oral group presentation (be prepared: she will hammer you if there are errors), a paper--15% of grade, a midterm- (not too difficult because you are given choices: study the theory!), final paper- 6-10 pages \n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "December 14, 2010",
            "review_content": "\nI agree with the previous poster. Marie Regan certainly makes this class challenging - but ultimately, it's extremely rewarding and engaging. Now, I'd like to offer some sage advice:\n1. Know your theory. Really.\n2. Talk to her during the break or after class. You might be shaky and start to point to yourself and say your name before you talk (out of habit), but in all actuality, Professor Regan is very approachable and she always listens carefully to what you have to say. Once, she even gave me  inspirational advice about film making. True story.\n3. Still don't understand interframe narrative? Look it up. That's why God invented the internet.\n4. Print out the lectures beforehand and save yourself from trying to write down every little detail. This will allow you to listen to Professor Regan's lectures, which are always interesting and very well organized.\n5. Sit in the middle. Don't ask. Just trust me on this one.\n6. Enjoy the films! This class provides a really wonderful sampling of different types of cinema and Professor Regan's commentary is helpful in digesting some of the more abstruse elements of the films.  \nOverall: Don't let CULPA scare you. If you love film and you want to learn more, let Professor Regan be your guide. She's extremely knowledgeable, occasionally funny, and she always keeps the class on their toes. \nFin.\nWorkload:\nWeekly theory readings, 1 theory presentation, 1 paper, 1 midterm, 1 final paper. Always interesting and definitely doable. \n"
        },
        {
            "course_name": "Intro to the study and theory of film",
            "review_date": "December 08, 2010",
            "review_content": "\nHonestly, I don't think people are fair to Professor Regan. This may be an intro, but it's a 3000 level class... you should know that it's going to be harder than your average intro when you sign up for it. And yes she requires a lot of specificity, but that just makes you more prepared. You have to listen very very carefully in class because detail is very important, but she made makes most major topics very clear, and is available during the breaks to clarify things. I agree she definitely should have explained the presentations better. And to future people giving presentations in this class: know your theory REALLY well, because she will grill you on it if she doesn't think you know it.\nSo be warned - this class is very very hard, for sure. Be prepared to put in a lot of hours for each paper, and to learn a lot of detail. But if you're willing to work hard, this can actually be a really fun class.\nAlso she has never once mentioned how much better the columbia class is. I have no idea where the person below me got that.\nWorkload:\n1 paper explaining theory in a (at least this year) fun-ish modern movie, 1 midterm, 1 final paper on theory in a pretty dense film.\n3-8 hours per week, depending on whether or not you have a paper.\n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "October 04, 2010",
            "review_content": "\nAre the other reviews jokes? Don't take this stupid class. Yeah the material is really good, and you'll probably walking away from the class knowing a lot, but GUESS WHAT, that happens with most COLUMBIA classes (if not all). \nI'm kind of scared of her seeing this review and tracking me down. That's the kind of fear she's instilled, and I'm not even a wimpy kid.\nHere are a list of grievances against her:\n1. She always mentions the \"columbia\" class being \"so\" much better.\n2. She comes in late and says, \"the library had trouble finding the movies\"--external blame, instead of \"sorry I'm late.\" It's your fault your late, not the libraries.\n3. She kept us 5 minutes after class because SHE came in late.\n4. Her answers are yes or no to non yes-or-no questions.\n5. She CLEARLY knew NO ONE had any idea what interframe narrative was, and she whisked her hair in the air and said, \"make sure you all know exactly what it means.\" \n6. We had presentations. She didn't tell us explicitly how long they had to be, and right before we had to present, she said, \"You have 3 minutes.\" \n\nWorkload:\n6-8 hrs of work per week\n"
        },
        {
            "course_name": "Intro Film History & Theory",
            "review_date": "January 12, 2010",
            "review_content": "\nIn terms of the course itself, this intro to film course covers film history from its beginning around 1893 up to the present. It's complement the history part with screening of important films and adds major film theories from Bazin, Doane, Mulvey and many others that provide insights and enrich the course materials (everything from heavy philosophical theories about the nature of cinema to how it plays on and mimics some of our psychological-cognitive processes to feminism and racism.)  It's like Masterpieces of Western Art but with films. This course changed the way you view films and help you become an active spectator. Half the semester covers the works of early filmmaker such as Miles, Porter, Griffith, and Eisenstein and the second moves to more modern films including world cinema.  \nThis great learning experience is of course dependent on professor Marie Regan. On the one hand she is very knowledgeable about the course material and certainly makes the classes engaging and interesting. On the other there is very little real dialogue. She is fixed in her opinions and don't respond to question and ideas that she didn't thought about before. It could be very frustrating, especially if you find this subject interesting as you are forced to this one-way style of learning. She  The TA will do all of your grading and their discussion sessions clarify and expand the lectures and especially the theories. Some of my friends said that it was a waste of time. My TA was Livi Newman and was amazing in every respect. \nOverall:\nI had a great time in this course and actually learned a lot of stuff - even with the small drawbacks of professor Regan it is highly recommended.  \nWorkload:\nAnything from 10-60pg of reading a week - the theories could sometimes be difficult to understand \nOne 7-8pg paper \nOne in-class midterm - multiply choice and four essay questions \nOne take home final 8-10pg \nMedium Workload - got an A\n\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "January 05, 2009",
            "review_content": "\nFor an introduction professor, Regan knows her stuff well. She came to class with a well organized lecture each time to contextualize the film and what we were supposed to get out of it, followed by great discussion points after the film had ended. She could be a little condescending, but she was decently entertaining and chose an appropriate syllabus that really covered all the major topics of cinema, which is often tough to do in only 13 classes. Apparently she was a rough grader on the first paper, though she didn't look at the finals. \nWorkload:\nweekly theory readings for section, midterm, 7-page paper, 10-page paper\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "January 13, 2008",
            "review_content": "\nThis is an amazing and stimulating class, whether you are into film or not.  The class made me think differently about writing, reading, and obviously film.  This class introduces students to ideas and ways of expressing ideas in a thoroughly new and exciting way.\nProfessor Regan is one of the most well-prepared teachers I've ever had.  Every lesson is well-organized and she adds little anecdotes about all that she teaches to enhance students' understanding of the material and to help remember it.\n She is more than willing to speak to students after/before class about material covered in class or about assignments.  She is truly passionate about what she teaches and her passion and energy is contagious.  This class made me consider a career in something related to film.\nWorkload:\nNot too bad at all - 2 papers and the midterm exam.  There is weekly reading which TREMENDOUSLY enhances the material so if you want to make the most out of the class and understand everything a lot better and deeper, do the reading.\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "September 17, 2007",
            "review_content": "\nYeah, this is an intro to film class. Which means a pretty healthy mix of film nerds and first and second years who have no idea what the hell they're talking about, but like to think they do, anyway. What I don't get is why we even bother to read film theory when the T.A just glazes over it in class and doesn't even bother to elaborate on *any* of the major theorists referenced in the readings--how can you talk about the beginning of film without referencing Benjamin or Kracauer, especially to a bunch of freshmen who have no idea who they are? Anyway, Regan is okay, though rather rigid, she seems smart--despite the fact that she referenced the Russian constructivists as people who \"constructed things into abstract art.\" I guess her, and the T.A's, missed the memo that film didn't develop in a vacuum. I'm obviously not a film major, but I'd much rather watch these films on my own time and skip the 5-\nhour hell where people make such comments as, \"I'm so over dialectical montage--they use it on FRIENDS!\" Somebody shoot me.\nWorkload:\nmedium--about 60 pages of reading a week, which may seem dense to those who'd rather glue their eyes to a screen instead of read the theory behind it...\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "August 23, 2007",
            "review_content": "\nVery cold woman which is pretty much what everyone says. she does things her way ( like the first month of class we had to say our name after she pointed to us when we raised our hand. even if she knew our name she did this to fit into her \"system.\" she reminded us and got a little angry if we didnt do this procedure). Not such an easy class for an intro. We arent encouraged to give opinions about films so she really takes any fun whatsoeever out of it. its all terms/history of film\nWorkload:\nA few papers, some dense reading\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "January 16, 2007",
            "review_content": "\nRegardless what a few reviewers said below, this is not a terrible class and Regan is not a terrible professor.  She's a stickler to be sure.  She hates tardiness and seems a little frozen in her ways, and unduly fond of the word \"gaze,\" but she's not an altogether unpleasant professor to have.  She knows her stuff, she facilitates a decent amount of class discussion and in my opinion the grading is entirely fair.  As for the work load being heavy, that's a lie.  The readings are short, relatively straightforward and only need be referenced in passing on the midterm and papers.  At least half the class time each week is devoted to screenings, and they're all, almost without exception, excellent films.  For an intro to film course, you could do worse. \nWorkload:\nPretty light.  A short in-class midterm and two medium length papers.  \n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "January 02, 2007",
            "review_content": "\nDo not take this course with Professor Regan.  Before the class, I was considering a major in film and Regan completely killed that ambition.  While she knows her stuff, she takes film theory way too seriously and the class ends up being a complete bore.  Her grading scale is terrible.  Even my TA told us that Regan would be only happy if everyone got an 84.  Thus, she gives A LOT of B's.  This was my lowest grade this semester, among classes including advanced econ and calculus.  Furthermore, while a few of the films are interesting, the two you have to choose from for analysis in the final 10-page paper, which constitutes 60% of your grade,  are unbelievably terrible foreign films.  Also, this class is only 3 credits, but the course itself is 3.75 hours long plus an hour of required TA recitation per week.  That's much, much more than any other 3 credit class, or even 4 credit for that matter. DO NOT TAKE THIS COURSE.  It will only kill your love of film as well as your GPA.   \nWorkload:\nLoads of pointless theory reading which you have to give a presentation on during TA sessions.  5-6 page paper, recitation presentation,  midterm, 7-10 page final paper.  \n"
        },
        {
            "course_name": "Intro to Film Studies",
            "review_date": "December 27, 2006",
            "review_content": "\nMarie Regan is an obsessive compulsive who worries more about reaffirming her own OPINION on cinema, than teaching anything new or facilitating students to think \"outside the box\".\nProfessor Regan would make exclamations in class that were just wrong. For example she claimed the first steadicam was used in Kubrick's \"The Shining\", but it was introduced first in \"Wolfin'\".\nShe fails to point out that Hitchcock didn't win an Oscar, but his film, \"Rebecca\" won best picture.  She also has a thing about noise, students running late, and she loves to yell at the projectionist.  She tells students to move a light dry erase board rather than do it herself.\nIf you speak in class, you'll get a good participation grade, but beware...always repeat what she has said--she doesn't like you having your own theory.  Stick to saying \"gaze\" a lot and \"dialectical montage\" and you'll be fine.  If you love film, this class will suck that passion right out from you.  Her TAs seem to be pretty whipped by her and they will not accept any grade challenges on papers or exams, period. If you're a film major, then you HAVE to take this course...but if you're not...skip it and take a film seminar in Anthropology or English...you'll be glad you did.  If anything, avoid this 3-credits-only-for-a-5-hour- class as much as humanly possible.  Especially with Regan at the helm.\nWorkload:\n2 papers (7 pages avg) that require no personal thought, 1 midterm.\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "November 14, 2006",
            "review_content": "\nProf. Regan really knows her stuff when it comes to film, which sometimes makes her come off as arrogant or condescending towards students.  The truth is, she's very approachable and honestly wants her students to understand the material.  She is usually willing to meet with students before or after class and is open to questions and discussion during class.  There is a lot of reading for this course, but you'll do well on the papers and midterm if you just follow directions and study.  Regan's strictness in class makes her seem like a harsher grader than she actually is.  Overall, this is a very intense and interesting course but be prepared to do the work.  Regan is a great teacher who is excited about the material and eager to share her knowledge. \nWorkload:\n-4-pg. paper, in-class midterm, final paper-Very dense theory readings (8-12 pages a week), plus easier textbook reading (usually around 20 pages per week)-Participation grade (at barnard)\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "November 14, 2006",
            "review_content": "\nProf. Regan really knows her stuff when it comes to film, which sometimes makes her come off as arrogant or condescending towards students.  The truth is, she's very approachable and honestly wants her students to understand the material.  She is usually willing to meet with students before or after class and is open to questions and discussion during class.  There is a lot of reading for this course, but you'll do well on the papers and midterm if you just follow directions and study.  Regan's strictness in class makes her seem like a harsher grader than she actually is.  Overall, this is a very intense and interesting course but be prepared to do the work.  Regan is a great teacher who is excited about the material and eager to share her knowledge. \nWorkload:\n-4-pg. paper, in-class midterm, final paper-Very dense theory readings (8-12 pages a week), plus easier textbook reading (usually around 20 pages per week)-Participation grade (at barnard)\n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "January 22, 2006",
            "review_content": "\nWell anyone who grew up with little social life and was splayed out stationed on their parents couch with a bowl of cheetos and blockbuster will relish in the papers and readings! Congrats to you guys!\nAnyone else who actually enjoys films (and life) and enjoys being able to have their own opinions will most likely be over taken with dread time and time again.  That said, there are some great films watched in this class (Rear Window, The Celebration- I think it was called, um I think there were like 2 others they slip my mind while I deal with the rage of this being my lowest grade this semester).  The rest of the films are artsy indulgent hell.  Most likely the films picked for the finally paper will reflect an annoying filmmaker smarmy wonderment- but don't worry you'll only have to watch the incomprehensibly boring slop about 5 times to gather the details).\nThe T.A.'s are pretty much the kind of people you would think would be TA's for a film class.\nRegan is a good teacher, she is a bit icy but so knowledgeable.  She goes over what she wants you to know before every class repeating people and inventions.  She is pretty much always interesting to hear so that's the plus.  But she never seems excited or happy so it can be monotonous.\nWorkload:\nNot bad, the section readings were a pain unless you have no opinions of your own and love reading about others then you'll love 'em!, 1 short paper 4-5  pgs (I think), one long paper 7-9 pgs. If you can tolerate the film student attitude and focus above boredom take this class.  If these people annoy you when you see them on campus avoid this class like the plague.\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "January 22, 2005",
            "review_content": "\nshe wants you to repeat what she teaches in the lectures. do that and you'll be fine. she's nice but not to warm and fuzzy. smart lady.\nWorkload:\n5 page paper, midterm, 10 page final paper, oral presentation. if you participate and ask questions you'll find out what she wants- for you to agree with her.\n"
        },
        {
            "course_name": "Introduction to Film and Film Theory",
            "review_date": "January 13, 2005",
            "review_content": "\nI would recommend this course to anyone who has a genuine interest in film and a long attention span. If taken at Barnard, the course is a mix between a lecture and a seminar (\"section-like\" discussions take place during lecture). \nUnfortunately, this means that discussion is rushed and high-stress, because everyone is expected to speak but there is only so much that can be said in response to Regan's focused questions. The selection of films was intriguing and variant, and it was especially interesting when supplemented with good theory readings. I would stress that this is a THEORY class. Regan does not care what the students think about the films unless it has to do with theory or formal elements. Grading seemed a bit inconsistent, so don't try to predict what you will receive. In fact, I would suggest you try to disregard grades altogether in this class because it can really take away from your experience in this particular course, and I also found that it was not reflective of what students were actually getting out of the class. \nWorkload:\nweekly theory readings (which could be pretty long and/or intense), one short group presentation on an assigned reading, midterm, take-home final\n"
        },
        {
            "course_name": "Intro to Feminist Theory",
            "review_date": "December 01, 2004",
            "review_content": "\nI also will emphasize that this class is not an easy elective.  Most of the readings, and some of the films, are tedious and pointless unless you really, really like to deconstruct films like a film major.  And there were plenty of film majors in this course.  However, Professor Regan received some unfairly harsh reviews on CULPA.  This is a tough course, and it definitely caters to \"know-it-all\" students.   I found Professor Regan to be a fair grader, and I seriously doubt she \"enjoys\" giving low grades as one reviewer commented.   She's pretty demanding, but for good reason because a 3 1/2 hour class could turn into a free-for-all is she wasn't.  Sure this class is going to lower my GPA, but that's my fault.  I'm not going to blame \"know-it-all\" students and Professor Regan for that.  Fellipe Barbosa was an awesome TA, but he's a pretty demanding grader also.  I'll save my harsh reviews for professors and TA's teaching courses that are part of the Core Curriculum (like a certain Art Hum instructor...)\nWorkload:\nPaper, Midterm (tough), Final Paper, Dreadful Weekly Readings,  Mandatory Discussion Section.\n"
        },
        {
            "course_name": "Intro to the study and theory of film",
            "review_date": "November 15, 2004",
            "review_content": "\nOkay, in terms of scheduling, this class meets only once a week, but for four hours.  There were times when I wondered if I would make it out alive or awake.  That said, Professor Regan does give a five minute break either before or after the feature film and generally looks the other way when you sneak in food as long as it is not too noisy or offensive.  Now as for the class itself:  the movies are great, a really wide variety, and the professor does seem to really enjoy and care about what she teaches.  Discussion can be painful at times, but this class was overall a pretty good experience.  Professor Regan is pretty fair grader, but she takes off if your paper or test does not cover all possible aspects of the questions - in other words, she likes answers to be very thorough.\nWorkload:\nNot too bad.  Weekly readings, one minor oral presentation, a paper, a midterm, and a take home final.  Definitely doable.\n"
        },
        {
            "course_name": "Intro to the study and theory of film",
            "review_date": "November 11, 2004",
            "review_content": "\nunless you think film is your life and are willing to put up with people who think it is,  do not take this class.  Despite seeing some good movies, this class can become more of a pain than anyone would think not only because half the class are know-it-alls but because prof Regan apparently expects everyone to be like that. She grades really hard and sometimes just seems to be out to get you.\n"
        },
        {
            "course_name": "Intro to the study and theory of film",
            "review_date": "November 08, 2004",
            "review_content": "\nI picked Prof. Regan's class based on the relatively good reviews on CULPA and boy was I mistaken.  As a non-film major who is nevertheless genuinely interested in film, I found the actually screenings genuinely interesting, but Marie is insufferable!  Maybe she has changed her teaching style since the previous reviews, but she talked to us like a kindergarten class.  She started the first class by lecturing us on how she always starts the class on time, not because we have a lot to cover, but because we college students need to learn time management skills!  Maybe it's the jaded upperclass(wo)man in me, but I was genuinely insulted by the way she treated us like kids.  the discussions are usually atrocious, not because the students aren't trying, but because she limits the discussion to calling out lists of the formal elements we have discussed in class (\"okay, kiddies, who can spot an iris shot?\").  Some of the readings are interesting, but be prepared for pomo hell with the film theory.  All in all, I could have gotten the syllabus, rented the films myself, and been none the worse for it.\nWorkload:\nShort paper, midterm, take home final.  Not particularly hard, but be precise, as she tends to be inflexible with the grading.\n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "April 19, 2004",
            "review_content": "\nThis 4 hour long class was extremely enjoyable, not only because of the wonderful films we saw in class, but because of Professor Regan's ever interesting lectures. Though the class is always very large, about 50 students, she runs it like a seminar. Everyone has ample opportunity to share their views. The readings, though copious, were enthralling. Though she did pick certain \"unoriginal\" films such as Citizen Kane, we also saw many films I'd never heard of. We went through everything from the silents, to expressionism, to genre films, to the french new wave and italian neorealism, to the avant garde movement, to the modern d.v. phenomenon and we ended with the Danish Dogma movement. If you're going to take an intro to film class - TAKE HERS! \nWorkload:\nA 5-7 pager early in the semester, in class midterm, in class quiz and 7-10 page final paper. A LOT of reading, but not all necessary and it's really interesting reading anyway. \n"
        },
        {
            "course_name": "Intro to History and Theory of Film",
            "review_date": "February 15, 2004",
            "review_content": "\nI enjoyed this class and found Marie Regan to be a competent instructor. The syllabus reflected the broad nature of its subject and included many classics that deserve to be watched and re-watched. Also, Prof. Regan made an attempt to cover current and international examples of cinema and include them in an ultimately well-streamlined course. Class time was well-paced and organized, and I always felt like I was learning something important. My only complaint was with Regan's attempts to lead class discussions: she seemed well-intentioned, but often came across as opinionated, which was very frustrating to students who felt like she was not receptive enough to their ideas if they were not exactly what she was thinking. The TA's were great, and discussion sections were pretty painless.\nWorkload:\ntwo in-calss exams that require knowledge of lectures and readings. Very fair. One 5 page paper, a 10 page paper instead of final. Attendance. Weekly readings. Workload was sometimes rather heavy, but it was all interesting and educational.  \n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "January 05, 2004",
            "review_content": "\nI felt a duty to post something because I disagreed with most of the other reviews. I think that first one is too harsh: Prof. Regan does know her stuff, she is smart and has good tastes (I think). I thought the syllabus was well put together, even for \"serious\" film students. However, I agree that she does not know how to lead a discussion - partly this was the class' fault, but I think Marie could have done a lot better. I hardly ever gained real insight from the tedious discussions, and she rarely responded to student comments. They would go something like: \"that first scene had lots of close-ups.\" \"yes.\" \"that part had colorful costumes.\" \"okay.\" Also, the first paper was basically a test to see if we could spit out all the terms she'd written up on the board; it required no analytic effort. I know a lot of people had qualms with her grading, which was sometimes unreasonable and definitely inconsistent (and I have never complained about grading before at Columbia). Further, she missed the last few classes and the discussions were led by the TA and a guest lecturer. I had thought the discussions couldn't get any worse, but I was wrong - it was completely ridiculous. And to top it all off, she failed to bring the class evaluations on the last day. All in all, I can imagine worse, but a lot of things about this class annoyed me, and I would avoid it with Prof. Regan if possible.\n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "December 08, 2003",
            "review_content": "\nMarie Regan is the only professor I have had in 2 years of Barnard and Columbia classes that has made the time and money I've spent here worthwhile.  She is engaging and engaged with her material, she knows the films she discusses well - both in technique and in history; she is open to students' comments and still manages to keep the class moving at a good pace (for a 4 hour class this is VERY important).  AND, though teaching 2 classes of something like 50+ students, plus pursuing her own interests outside of class, she still managed to know the names of almost everyone in my class of ~80 people by the end of the term (which is not to say she will coddle you, she expects the work to get done on time). \nThe exam questions (which apparently previously were unreasonable) seemed to me quite reasonable, and I only felt constricted for time on one of the 2 in-class exams. \nI would recommend this class to anyone interested in starting to study film, and this professor to anyone interested in taking a class that will be worth your time and effort. \nBefore taking this class i had NO faith in professors at this university; now I know there's at least one good one out there.\nWorkload:\nreasonable; it may change each term - we had 2 exams and 2 essays (the final exam was a  take-home essay)\n"
        },
        {
            "course_name": "Intro to study and theory of film",
            "review_date": "November 18, 2003",
            "review_content": "\nI was just browsing and happened to notice the comments from the first reviewer (starting \"Serious film students...\"), and like the other student who reacted to that review, felt I should add a few words. (I took the class apparently at the same time.)\nI also disagree and feel this person was *way* too harsh. The one major flaw was the exams: too long. She needed to work on that aspect, but that's easy to fix. \nAs for the criticism that the films we saw were \"redundant,\" this is totally bogus. It is an *intro* class--this is the one where you're supposed to see these basic films and attempt to analyze them carefully. (It's the *other* classes we take in the film department that are \"redundant.\" The more advanced classes repeat the basics much more than they should.) On the other hand, what's the problem with seeing a film more than once and getting a different perspective on it? \nAs for discussion, keep in mind that the responsibility for good discussion really is the students'. I thought that the chemistry was terrible in the class that summer, and, trust me, getting students to talk can be an impossible task. And, in any case, I never heard Marie Regan say \"So, what did you guys think?\" and leave it at that, like so many other professors in this department do. (And that's all the discussion we get out of them!)\nAnd, as for the workload, what's up? It's a summer intensive course! You're supposed to work hard (15 weeks in 6). I think the diary is an excellent way to make sure we do some active thinking about all the films we saw. There were no specific guidelines, but that's OK--it was supposed to be our thoughtful reactions.\nI really felt she was an engaging and interesting speaker. She really seems to know her stuff and did a much better job of presenting it than most of the professors I've had in this dept. (Her model is clearly Richard PeÃ±a.) Of course, this was my first film class, so I was reading things I'd never read before and seeing films in a new light, but like I said, it *is* an intro class. And now that I'm a jaded film student sick of the rotten teaching in this department, I'm nostalgic for class with Marie Regan...\nThe only thing that I felt could have been sharpened was discussion of theory (especially contemporary theory), but I haven't seen anything in this department yet that suggests *anyone* is cutting- edge in that sense.\nWorkload:\nA good amount, but basically fair for a summer intensive course: biweekly reading assignments; diary (one entry per class), midterm in class; final take home (too long. Future students should try negotiating a reduction)\n"
        },
        {
            "course_name": "Intro to Film",
            "review_date": "August 29, 2003",
            "review_content": "\nThis course does not fall under the heading of \"easy elective.\" Intro to Film is definitely a film major's class or for people with a serious interest in film. Study Tips: a. Lecture notes, lecture notes and lecture notes. Most exam questions are lifted from the lectures. b. Understand all film vocabulary. c. Theory Readings. Since this is a theory class, the theoretical readings are crucial to papers, test, you name it.\nThe class is structured, focused, with fun and interesting lectures.\nWorkload:\nHeavy reading, 2 papers.\n"
        },
        {
            "course_name": "Intro to the study and theory of film",
            "review_date": "January 02, 2003",
            "review_content": "\nI totally disagree with the previous review. Upon enrolling in her summer course, I found Regan to be extremely endearing (she had never before taught at Columbia and started out nervous but quickly unraveled into a captivating, enthusiastic lecturer).  In fact, I'd rank this couse as probably the most fun course I've taken at Columbia, HOWEVER I have never before taken a film class and was watching all the movies for the first time. Also, I had a crush on Regan, who bears a resemblance to Julianne Moore. Nonetheless, if you are a Barnard student looking to fulfill an art's requirement or if you are just looking for an entertaining (albeit challenging) course this is an excellent, fufilling class to take. I loved almost every minute of it.\nWorkload:\nTOUGH but worth it. I took the class in the summer so had enough time for all the loads of work, but perhaps it would seem unreasonable during a normal semester\n"
        },
        {
            "course_name": "Intro Film History & Theory",
            "review_date": "August 30, 2002",
            "review_content": "\nSerious film students and those who love film should avoid Prof. Regan at all costs. Her selection of films is almost completely redundant for those who have taken a film class before (Citizen Kane, Stagecoach, The Big Sleep, etc.), and her lectures add nearly nothing new to the experience. To her credit, she includes a Dogme 95 film, Celebration, but nothing else new. She assigns a mandatory film journal that turns the experience of independently discovering readings that should be optional (some are very good) into a painfully tedious chore. Additionally, Prof. Regan's tests are unnecessarily difficult - when a single essay question would suffice, she asks four - and designed so poorly that even the best film students will have difficulty demonstrating their knowledge. Since the summer class incorporated a discussion, it bears mentioning that Prof. Regan is a terrible moderator of class discussion, and simply does not yet know how to ask the right questions of her students. Consider yourself warned.\nWorkload:\nMany readings - all mandatory - in order to complete a \"film journal\" of moderate length with a nebulous purpose, one two-page paper, one six-page paper, and a take-home final exam with five essay questions (each essay takes up five to six pages)\n"
        }
    ]
}