{
    "prof_info": [
        {
            "prof_name": "Jennifer Rudd",
            "prof_id": 11589,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 04, 2016",
            "review_content": "\nANNIE RUDD IS A GODDESS AMONG MORTALS\nShe will (regrettably. so, so regrettably) not be coming back to teach next year, but I felt that it was still necessary to tell the world how much I love and appreciate Annie as a professor. \nIn my experience, Annie has only given back positive feedback. As long as you write something coherent and hit the word count, she will give you at least an A-. She says 30% of the grade is participation, but I have spoken maybe 5 times and never had a problem. I think she just really understands that CC shouldn't be about showing off how much of the reading you did but about really getting each student to engage with the subject, understand it, and (dare I say) enjoy it. \nIt's a shame that future students will not get to experience the wonder that is Annie, but that makes me all the more grateful to have had the chance to be in her class. \nWorkload:\nStandard. One courseworks post a week, 2 essays, a midterm and a final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 11, 2016",
            "review_content": "\nIF YOU GET INTO THIS CLASS THANK EVERYONE WHO HAS HELPED YOU GET TO THIS POINT BECAUSE YOU JUST WON THE LOTTERY.  Annie gives nothing but positively constructive feedback and will give you an A on practically every assignment (including exams and papers).  She tells you everything you need to know for exams in a 20 page studyguide that she makes herself and if you study this you are set. You don’t even have to read the books because she goes over them in detail during class and then leads a surprisingly engaging discussion.  Also, the grade is 30% participation (which as long as you don’t sleep through class you’ll be fine)\nWorkload:\nparticipation, weekly discussion posts, 2 papers, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2015",
            "review_content": "\n(Jennifer Rudd goes by Annie Rudd in class)\nAnnie is an amazing instructor. She knows the material very well and presents it very clearly in class. She also finds many ways to relate the material to current events or the media by showing relevant video clips. She is also very good at facilitating class discussions and asking the right questions.\nAnnie also provides very comprehensive and detailed notes for review before the midterm and the final exam. There are no surprises on the exams and everything is extremely straightforward.\nShe also cares a lot about the students. She arranged a few outings for the class and even an end-of-the-semester picnic. \nOverall, if you get Annie Rudd, take the class!\nAlso, no laptops in class (except for review sessions).\nWorkload:\nParticipation - make sure you participate in class.\nPresentations - started in the spring semester. Each person has to present a brief biography on an author/work (chosen by the student) and provide a few questions about the text for discussion.\nCourseworks posts - required once every week (except on a week when an essay is due). 250-500 words. The posts are responses to suggested prompts for the week's readings.\nEssays - There are two, each about 6-8 pages long. There are a few prompts provided, plus an option to write about something else that must be approved in advance. You usually have about two weeks to finish an essay.\nMidterm - Concept identification (requires one to identify the text in which the concept arises and discuss its significance), short passage analysis (analyzing a short excerpt from one of the texts), and an essay portion (with provided prompts). There are multiple options for each part, so you can pick and choose which concepts, passages, or essay prompts to address (for example, choose two out of the five concepts to discuss).\nUsually in-class, although the midterm in the spring was take-home because Annie was sick.\nFinal - Basically the same as the midterm. In-class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 07, 2012",
            "review_content": "\nI don't always write reviews on culpa, but when I do it's for super amazing professors.  Annie Rudd fits the bill.  Always prepared, humbly engaging, insightful, and personable.  She truly cares about each one of her students, doesn't play favorites, and makes sure that the reading assignments aren't a living nightmare.  \nI switched out of my first semester CC because of a bad experience and blindly took this class, and boy was it the best decision I ever made.  If you get her, you are one lucky SOB.  You will learn a lot, discuss a lot, and leave the class with an A.\nWorkload:\nAs light as she can make it; cuts down readings whenever possible.  2 essays (fairly graded).  Standard midterm and final (she makes hers very simple and straightforward).  Awesomeness\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2012",
            "review_content": "\nI say with confidence that Annie (the name she goes by) is one of the best teachers I have had and will ever have at Columbia.  As a teacher she is absolutely always well-prepared for class, she is consistent in teaching style and grading, and she clearly puts a lot of effort into each class and assignment.  She is engaging, enthusiastic, knowledgable, and interested in getting students to learn the material in a low-stress way.  I don't know how this fancy nugget nomination system works, but she deserves a gold nugget.\nUsually, the class is very discussion heavy unless no one has done the reading, in which case she sort of lectures for a while.  She allows the class to get off topic just enough to keep discussion interesting but not so much that class becomes a waste of time.  She always follows up to questions asked in and out of class in a timely manner, and she is often very generous with extensions if you ask ahead of time and have a good reason.  She is a student at the J school (at least for now), so she gets how student life works; she doesn't assume CC is the only class her students are taking, and she knows that some parts of the semester are really hard for us.  Incidentally, because she is a student, she often happened to be busy at the same times we were.  \nAnd I don't know if it was just me, but she seemed to be sick at the most convenient times.  Several times I got to class unprepared and having a bunch of other things I needed to do, only to check my e-mail and find that I got a total freebie.  I would say she is sick more than the average person (perhaps her weak Canadian immune system can't handle NYC), but not so much that the class falls too far behind.  She was basically only sick when everyone else was sick and in need of a break.  \nAs a person, she's pretty cool.  She has good stories, takes Canada jokes well, and is the kind of person you'd want to have a drink with after class.  Imagine your favorite TA, but competent and not an asshole.  She threw us two parties, one of which almost consisted of using the CC budget to rent out Campo.  \nI recommend taking CC with Annie if you rate your interest in political philosophy anywhere from a 2-9 on a scale of 10.  If you hate the idea of CC, if you're really into doing all of the reading and knowing all of the answers, or if you're really just more interested in taking a class with an old wizened professor, don't take her CC class.  Otherwise, do it, even if it's at an inconvenient time, because you will learn and enjoy yourself.\nHeads up: she gets frustrated if people have private conversations during class (which didn't happen that often since class was interesting), and you don't get that many excused absences.  \nTL;DR:  She is awesome.  Take CC with her.\nWorkload:\nWeekly Courseworks post: Usually 250-750 response to the reading.  She suggests 4-7 things you could talk about, but you can write about anything you want basically.  It was a MW class both semesters, so the posts were due either by Sunday or Tuesday (your choice) at 6:00 pm (which she extended until 10 pm eventually).  She does not require them if there's an essay due that week or for the week of the midterm.  They're part of your participation grade and are graded with a check (-/+).  Sometimes she just had us write a discussion question instead of a long response.\nThe readings are average.  Usually reasonable and always sparknotable.  \nTwo papers per semester: 6-8 pages.  You can choose one of her prompts or make your own.  \n1 Midterm:  Fairly short, TONS of choice, very accomplishable.  Class votes on open or closed book.\n1 Final:  Same as the midterm but just a little bit longer.  Closed book.\nShe's a reasonable grader.  A wrestler in my class slept through every class and is probably getting a B.\nTL;DR:  Doable.  Very easy if this subject is your thing.\n\n"
        }
    ]
}