{
    "prof_info": [
        {
            "prof_name": "Duncan Watts",
            "prof_id": 1191,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Six Degrees and the New Science of Networks",
            "review_date": "May 24, 2005",
            "review_content": "\nThis material presented in this class was absolutely fascinating.  But overall it was an unfulfilling and frustrating experience.  The main readings for this class are contained in Professor Watts' own book: Six Degrees: The Science of a Connected Age.  The book is great - well written, lively and humorous, informative and it does a great job explaining the concepts and providing helpful analogies and diagrams.  \nUnfortunately, class-time is a repeat of the book.  It gets worse.  Class-time was a repeat of class time.  First, Professor Watts would explain the concepts - concepts which you would already know if you had done the assigned reading in his book.  Then, he would give several examples to illustrate the concept (many of the same examples which he used in his book).  And THEN, he would write the concept on the board-in full sentences/paragraphsÂ…and then he would read them out loud!  Sure, his explanations were clear, his examples helpful, and his written descriptions straightforwardÂ…but this level of repetition was completely unnecessary.  I don't understand why he couldn't have given us typed notes at the beginning of each class rather than wasting class-time writing them on the board. \nThe pace of this class at times was slower than the crawl of a two-legged turtle.  The first few classes were poorly spent.  The entire first class was dedicated to marveling at New York City and the fact that such a complicated unregulated (think Adam Smith's 'invisible hand') system works.  Ok.  It's an interesting topic.  But do we really need the exact numbers of daily commuters in and out of NYC!?  It was overkill.  We spent the entire second class talking about Google, which I found fascinating but clearly bored some people to tears--our class quickly dropped to 20 something. On a later class, we spent about twenty minutes walking through the links connecting Kevin Bacon to a certain actor.  As the end of the semester crept-up, Professor Watts was forced to cut topics from the syllabus - topics which were the most interesting (and the most relevant to traditional sociology: the spread of ideas, crazes, the factors determining success/failure of riots and political overthrow, structures of organizations etc).  This class sacrificed breadth for depth/repetition and it left me bored and unfulfilled.  Watts, a Nature-published researcher, is the leader in his fieldÂ…this class had the potential to be so much moreÂ…\nThe fundamental topic concerns different mathematical models of social networks-it's largely graph theory and statistics guided by social theory/reflection and real world observations.  I completely agree with the reviewer below: the bulletin's description of this course as a \"non-mathematical intro to the topic\" is completely bogus.  If you hate math, don't take this course.  To an expert in the field, the class topics are probably non-mathematical.  But to the layman, \"non-mathematical\" is misleading-we even had a whole class period dedicated to introductory statistics (about types of distributions).  But as long as you know the basics (i.e. you can read a graph, understand variables in algebra) you'll be fine - Professor Watts does an excellent job clearly explaining the concepts and he teaches any necessary math.  And the midterm/final tested the concepts (not math).\nThe topics covered in this class are real world and tangible and therefore interesting.  They have wide implications and for real-life things like the spread of disease, fads, innovations.  There's even some basic psych/econ topics thrown in: decision externalities.  I'll never choose the crowded restaurant over the empty one next door without wondering what early whims and decisions led to a cascade of events.\nSo in conclusion, Professor Watts is funny, entertaining, and articulate.  But class time is misallocated.  Would I recommend this class? Absolutely.  Sure it has its flaws, but this is a rare opportunity to take a class with a leading authority on the fascinating subfield of mathematical and network sociology. Take this class if you want to see the world in a amazing new way, and see math and computer science models applied to sociology.  Just don't get too passionate about the topics or you'll be left unfulfilled.\nThis is a perfect class to take for fun (as evidenced by the wide variety of the students' majors).  There are zero problem sets/quizzes/homework.  Class-time will teach you everything you need to know.\nWorkload:\nReading in his book and also some research papers (which mysteriously were rarely mentioned in class or on tests and seemed like extras to fulfill curiosity.)  A midterm, a final, and a final project (the scrapbook).  A scary thought: 60% of our grades were undetermined until the day of the final (30% was the exam, 30% was the project) \nThis semester witnessed the unveiling of \"the scrapbook\" which had the most vague guidelines ever.  Throughout the semester, we were supposed to collect newspaper articles and then analyze them by connecting them to class material.  When pressed, Professor Watts finally said that he expected between 10 and 30 pages of analysis.   The midterm and final were open book and open notes but that won't help unless you already understand the concepts.\n"
        },
        {
            "course_name": "Six Degrees and the New Science of Networks",
            "review_date": "August 18, 2004",
            "review_content": "\nI disagree, to an extent, with the previous reviewer.  I am a soc. \nmajor who enjoys theory, but I found this class to be a refreshing break from the abstract and a glimpse into a fascinating field which is catching on with the general public- i.e. thefacebook.com, friendster.  Professor Watts has a great talent for taking very complicated material based in calculus and physics and making it accessible to social scientists like myself.  He was always available outside of class, and let us take our interests (which for many were more geared towards traditional sociology), and pursue them in our final project.  This class has affected how I think about my own friendship networks, about fashion trends, stock booms, and pretty much everything else...\nWorkload:\nVery fair.  Weekly readings with summaries to turn in, which make sure you actually get through all the reading.  HUGE final project which is actually a lot of fun- you get to  work with any topic you want, so long as relevant course material is incorporated.\n"
        },
        {
            "course_name": "W3233 Networks/Complexity-Soc Systems",
            "review_date": "August 18, 2002",
            "review_content": "\nIf you're looking for sociological theory, you've come to the wrong place. In the course description, it says this is a non-mathematical intro to the topic, but we covered papers written by computer scientists and mathematicians more than sociologists. Needless to say, if you know very little statistics, you'll be scratching your head throughout the entire course. As far as Dr. Watts as a professor, he is as equally helpful as he is arrogant; he answers questions as thoroughly as he makes fun of professors in his field who question his work. All in all, an interesting course for the mathematically inclined.\nWorkload:\nWeekly topic summaries (which were mucho easy) and a killer final project. Start the final project early!\n"
        }
    ]
}