{
    "prof_info": [
        {
            "prof_name": "Shira Brisman",
            "prof_id": 12907,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 14, 2014",
            "review_content": "\nHere are the basics:\nExtremely down-to-earth: classmate of mine missed two lectures and she gave a private lecture outlining both lessons. Very approachable before and after class for questions regarding papers. \nLight coursework: just two short papers based on works at the Met/Moma/Gugghenheim. No weekly discussions/posting etc. Goes over each work in class so no real need to do the readings. \nTests: gave the essay prompt for the midterm before hand, gave a list of all comparision works we needed to know for the final. \nClear passion for the subject, loves talking about various artists and including her personal research. \nIt was a pleasure taking Art Hum with Prof. Brisman and you are extremely lucky if you end up in her class. \nWorkload:\nParticipation 20%\nTwo papers (one 2-3 page, one 3-5 page), 20% of grade each\nMidterm (identifications, comparisons, gives essay prompt before hand) 15% of grade\nNon-cumulative Final (identifications and comparions) 25% of grade\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 13, 2014",
            "review_content": "\nIf you want a concise, clear, articulate, interesting, thought-provoking, humorous, stylish, young but highly intelligent Art Hum professor, who is filled with sage insights, who has a PhD from Yale, who requires little more of you than to engage with the art being discussed, Professor Brisman is your gal.\nIf you:\n- Go to class and museum/cathedral trips\n- Actively participate in class discussions \n- Stay up on short readings for each class\n- Write two thoughtful short papers on works of art you find interesting\n- Study the major works discussed\n- Remain open and excited to learn \nYou will not only do great but more importantly you will walk away with a new outlook on life, have a greater understanding for appreciating works of art, and will be able to all around think more critically about other subjects that may have little correlation to this class.  This is what great professors do.  They may be teaching you about one particular subject, but because art or any discourse does not exist in a vacuum, the ability to step back and place a paradigm in its context creates connections to the foundations of our being.  And from that starting line you are left with unforeseen and unanticipated arteries that lead you away from Rome and out into the world to places you had never imagined traveling to.   \nAnd when you look back, you just smile, because you know your life is a little sweeter.\n\nWorkload:\nMinimal.\n"
        }
    ]
}