{
    "prof_info": [
        {
            "prof_name": "Benjamin Anastas",
            "prof_id": 6557,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Fiction Workshop",
            "review_date": "January 28, 2013",
            "review_content": "\nHe's a really great professor. He may seem distant when you have your first meeting with him to discuss your writing, but don't be discouraged by this! If you show him (with your edits) that you are interested in writing, and working hard at it, he will be a totally different person. He wants to see that you have interest, and then he really opens up. \nI knew from the first class that I was going to love this guy. He talks about what you're trying to accomplish in the class, and everything he has you do is nothing short of productive for your writing. I took a senior fiction workshop with him, and he did not ask us to do anything we didn't deem productive for our writing, like making a little portfolio of final works. The class really was about us improving. \nHe's a great guy, and certainly undervalued at Columbia. He is one person whose writing talent actually transfers over into his teaching ability, something that cannot be said of all prolific writers at Columbia.\nWorkload:\nAs with most workshops, two submissions a semester, that can range from 15-30 pages, and weekly edits of other people's work. \n"
        },
        {
            "course_name": "Senior Fiction Seminar",
            "review_date": "January 19, 2012",
            "review_content": "\nBen is an incredibly intelligent and generous professor. It's clear that writing is his life and he is eager to share his knowledge while respecting students' opinions as well. Therefore discussions are pretty intense. It's not just 'say something so you get an A for effort.' He is serious about fiction and delves into the questions with us, as a fellow writer. His comments on our work was thoughtful -- he seemed excited by student writing -- and he is very approachable if you want to talk about anything. I highly recommend taking a class with him. He's got a wealth of knowledge and also happens to be a nice guy. Good combination. \nWorkload:\nThe first half of the course was pretty much a seminar -- readings every week and discussions and occasional exercises. The second half of the course is a workshop. Each person presents once and you write up critiques of everyone's work, just like a regular workshop. \n"
        },
        {
            "course_name": "Advanced Fiction",
            "review_date": "August 02, 2011",
            "review_content": "\nThe previous review lists many valid problems:\nHis grading system is unclear- being by far the worst. He claims to only grade on the basis of attendance ecetera because \"you can't grade writing.\" However, to an outside observer an grade in creative writing does not translate to a grade in punctuality.\nHowever, his actual comments are very sensitive. In personal discussion he has a keen eye for craft and is ready to share. His edits are close are clearly done with care.\nHe also makes an effort to be avaialble outside of class time and to be supportive. So I would argue that if grades are not an issue for you this is a class to take.\nWorkload:\n2 stories a semester plus weekly page long responses.\n"
        },
        {
            "course_name": "Advanced Fiction",
            "review_date": "May 14, 2011",
            "review_content": "\nProfessor Anastas is charming and witty and a very serious reader of student work, which is a somewhat rare commodity in the creative writing department. His one major drawback, however, is his absolute dedication to the literal. If your writing is even the least bit ambitious or imaginative, I'm not sure he's the best professor to offer advice or constructive suggestions. He also scheduled a workshop during finals week, which was inconvenient, but it meant we didn't have to workshop three people each week, so that was a definite plus, since we spent a good amount of time on each piece. He's thorough, but I feel like he's another professor (like many of the recent additions) who's very stuck in a certain literal mentality, who appreciates sparse, obvious work usually about nothing. They say workshop is for experimenting and making mistakes, but his grading system (which practically everyone in my class despised him for, since he was VERY unclear about his standards at the beginning of the year) is arbitrary and not based on the merit of the work or the risks taken. The fact that he thinks being self-deprecating is enough to compensate for being detached all semester is really ridiculous to me; he tries too hard to work in both directions -- to be your workshop 'buddy' and also be the guiding, knowledgeable professor. He'll do better once he settles on just one angle.  \nIn short: Just be boring and obvious as hell and you'll do fine. \nWorkload:\n2 peer reviews a week, one single-spaced page each; some (not enough, in my opinion) reading out of James Wood's 'How Fiction Works'. 2 stories/semester.\n"
        }
    ]
}