{
    "prof_info": [
        {
            "prof_name": "David McKenna",
            "prof_id": 398,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Script Analysis",
            "review_date": "January 16, 2012",
            "review_content": "\nI was nervous about this class having read some of the reviews here, but this is easily the most fun class I've taken at Columbia. McKenna's strength is not the information he presents (Vogler's 12 Steps are pretty basic and you could teach yourself by reading the book), but damn, is he entertaining. McKenna is funny and lively, and provides a refreshing break from other classes in the department taught by professors who tend to take themselves too seriously. Yes, he is crazy and often offensive, but if you can laugh it off and appreciate his twisted sense of humor, you will find that there is also a lot to be gained from this class. Most of what I learned in Script Analysis came from the work we were asked to do. It's surprising how much you learn from doing coverage once a week. The scripts chosen were fun (Erin Brockovich, Unforgiven, The Bourne Identity, etc.) and as usual in film classes, the TAs are awesome and an invaluable resource. Someone on here said that participation is vital to receiving a good grade, and while McKenna loves hearing students talk whether he agrees with them or not, I don't think participating is the only way to succeed in this class. I got an A and never spoke in lecture and not often in discussion. Yes, the class is a major requirement, but it is a fun one. \nWorkload:\n- coverage on an assigned script once a week (scripts are 120 pgs)\n- Director's Prep Project (a series of one page papers and little excerises on a movie of your choosing)\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "December 23, 2011",
            "review_content": "\nIf you are a film major, you -have- to take David McKenna's Script Analysis class. Fortunately for you, it is one of the best courses in film major requirements. \nPrevious reviews are more/less correct regarding the style of the course, insofar as McKenna basically spends the entire semester on one twelve-step process. The process is so intricate, though, that it actually does seem to warrant the amount of time he spends on it. \nMcKenna is extremely engaging and tries to bring out the best in his students. He is loud, inappropriate, and occasionally misanthropic/racist/misogynistic (which, personally, I found to be totally awesome, but it's admittedly not everybody's style). A typical lecture goes like this:\n- Outline of the day's \"12 Step\" element\n- Rocky/Romancing the Stone/Henry V relationship to this element. \n- Clips demonstrating the step\n- Cigarette Break\n- Loglines of previous week's screenplay\n- Discussion of previous week's screenplay\nThe course is three hours long, and you will not watch full length movies -- which ostensibly means three hours of lecturing. This would be tedious were McKenna not such a wonderful lecturer and performer/entertainer. I challenge you to fall asleep in his class; I don't think it's possible. \nA word on grading: It's pretty mystical. You will get \"check plus,\" \"check,\" and \"check minus\" grades as opposed to conventional letter grades. Attendance counts, but there is absolutely no way of knowing how your grade will work out. I assume that the director's prep (a massive assignment) constitutes a large part of it, but there was no grade distribution disseminated. \nDavid McKenna considers a \"B\" a good grade, and makes a point of stating how difficult it will be to earn an \"A.\" I -did- earn an \"A,\" and can share with you the ultimate three-step process on how to do likewise: \n1.) Do your coverages/read the screenplays. These are daunting and will take you several hours per week. But if you do them, and you write them intelligently on a consistent basis, it will not only make you a better analyst but also more competent in class participation. \n2.) Show up and don't be late. He counts attendance. If you are late, you are marked down for half an absence. I recommend going to every class early so as to be sure you will make roll call. \n3.) PLAY. Play with him. Banter. Contribute. Talk. Don't just be another \"seat\" in the Lifetime Screening Room. If you do not want to participate, you will have no chance of standing out. McKenna is not a bad guy and will not make you feel like a moron if you come up with a wrong answer, and he will appreciate your attempt. I am convinced that this is the secret to success in this class. I base this on nothing, however, as I still don't know how the assignment grades were apportioned/evaluated. \nBottom line: Great class. If you are a film major, you have to take it. Don't fret. If you are not a film major and want to take the class anyway, you'll learn a lot. \n \n\nWorkload:\n- 12 screenplay coverages: Read a c.a. 120 page screenplay every week and write a two page synopsis on it. Basically a book report. \n- Scene Analysis: Break down a scene into reciprocal actions. Short assignment.\n- Director's Prep: So intense. You will write 30-40 pages of analysis of a screenplay using techniques learned in class and from the assigned readings. \n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "January 12, 2011",
            "review_content": "\nThis class was so disappointing. For the entire semester, McKenna did nothing but outline and explain Vogler's 12-act structure for writing. Though this structure is interesting for as long as it takes to read the book we had to buy, McKenna stretched this out over months of class time by talking about the most random things, or by recounting the opening to Rocky in a rich, totally unnecessarily theatrical way, or by just cursing a lot. Sure, he is enthusiastic, but I literally learned almost nothing from his lectures.  He kept repeating that though this method of writing wasn't the only effective way to write a screenplay, we should value it as a tool that we could play around with later.  True as that may be, it certainly didn't take a semester to understand it.\nFortunately, the TAs were much better, and discussion sections were filled with a variety of different exercises that, unlike the lectures, genuinely helped me improve my analysis of scripts.  Thankfully, McKenna would occasionally allow one of the TAs to give a short guest lecture on a topic unrelated to the 12-act structure. The assignments were all pretty interesting, too, since they mostly consisted of reading a script and then addressing a specific scene or character.\nWorkload:\n4 short-ish assignments\nAttendance counts\nfinal Director's Prep (40ish pages)\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "December 11, 2010",
            "review_content": "\nOn the last day of this class, our TA asked the discussion section what we thought were the best and worst parts of the class. We proceeded to spend the next hour listing all the problems we had with McKenna and the structure of the class. It simply was not a good course. Of course, it's a requirement for the major, so it will continue to fill up no matter what, but if you're not a film major and therefore don't need this class, it's sort of a waste of time. Just look up Vogler's \"12 Steps\" and read some screenplays on your own time, and you've basically taken the class.\nThe entire course is spent learning an extremely simple concept that McKenna somehow manages to stretch over 12 weeks, 3 hours a week. There was no reason for this. Sure, it was somewhat interesting, but it could easily have been taught within the first couple of weeks of the class, and then we could have gone on to learn more interesting methods of script analysis.\nThe one nice thing about the course were the TAs. First of all, they definitely realized how crazy McKenna was, so they took that into consideration when assigning and grading work. They also gave little mini-lectures throughout the semester, in which they taught about specific aspects of script analysis or screenwriting. It was a nice break from McKenna, and we actually learned more from these than we did from him.\nAll in all, the workload is pretty light and it's all interesting. This is the one class that I've ever actually enjoyed doing my homework for, because it's just reading and talking about screenplays.\nMcKenna tries unbelievably hard to make himself seem cool. He'll curse and talk about smoking and sex and drugs to the point where you wish he would just stop. I would have much preferred a professor who was actually teaching us useful information and making the most of the time we had in the class. This has the potential to be a really great class, but McKenna just does not take advantage of it.\nAlso, if you do decide to take it, watch Rocky and Romancing the Stone before the first day. And maybe even read Henry V. He references these constantly, and it's pretty pointless if you've never seen them.\nWorkload:\nNot bad, also sort of depends on the TA. Read a screenplay and write a log line and synopsis almost every week, break down a screenplay into the 12 steps McKenna loves so much, do a line by line breakdown of a scene, and the final project is a director's prep, which is extremely time consuming and not explained particularly well, but isn't too too difficult. My TA also sometimes assigned movies for us to watch on Netflix.\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "December 14, 2009",
            "review_content": "\nI have no idea why this course hasn't been reviewed yet, it is easily the best course I have taken at Columbia, and expect to take, and McKenna is one of the best professors I've ever had. He knows his subject to near perfection and is a true orator. He's entertaining and intelligent, basically all that can be asked for in a teacher. His presentation of the material is nearly perfect. There was a point when he read monologue from Henry V and I was moved to tears by the off-hand performance. He's really a one-of-a-kind professor, and an inspiration, no matter how humble he tries to play himself off as.\nLots of students won't like his unorthodox and disorganized approach, and everyone's going to say this: McKenna is terrible at planning assignments. He's not in the room to be a conventional professor, and he knows it. He has no rubric of how assignments are graded (leaving it up to TAs), and he really just doesn't care about deadlines. However, his Director's Prep and Script Synopsis assignments are perfect for the course and incredibly enlightening, and while I had to rely a lot on my TA to make these assignments clear, he was honest in letting us know how important they were to understanding the essence of understanding a script.\nIt's true (at least this semester) that the TAs have to pick up a lot of slack, but they did it REALLY well, aside from sorting out the deadlines effectively. In the end, everything worked out, and though McKenna is a character, he gets the point across and addresses student questions intelligently, and his TAs will pick it up if he doesn't know how to answer.\nSure, McKenna has an opinion and an approach, but he admits this dozens and dozens of times, professing that his way of structuring a script isn't the only tool to use, and he challenges students to go out and take what he's taught them to entirely new levels. I can figure that not everyone is going to think he was so great, he's definitely got his weaknesses, but the beauty is that he's become very aware of these weaknesses and will admit to them outright.\nHe's a very self-aware human being, and however vulgar he might be, he has an excellent comprehension of human psychology and just listening to his dozens of anecdotes is inspiring to anyone who wants to write or direct films or theater. When he had Chrisopher Vogler (the writer of his course book, who he's good friends with) come in, their discussion immediately inspired me and made me realize what I needed to do to make a script idea work.\nOverall, amazing class for me.\nWorkload:\nhave to read three scripts; for one of them you do a synopsis, for one you do a synopsis in which you point out the 12-step narrative structure, and for the last one you do an entire director's preparation.\n"
        },
        {
            "course_name": "Topics in American Cinema: Horror ",
            "review_date": "July 07, 2009",
            "review_content": "\nMcKenna is a terrible self-absorbed professor whose old school ideas won't help you learn anything applicable towards today's topic in horror.  His big lead-up ending for us was Frailty, which was supposed to cap an entire survey of horror films.  His grading is arbitrary, more than any other professor at Columbia, and he's very limited in what he knows.  Many times, a student would bring up references to Milton or Nietzsche and he was lost.  He's too focused pushing his own theories rather than applying real film theory to his lectures.  He gives a 90 minute history lesson before every film, which I would rather the 4 hours being a little more reined in to give more clips and then put them in context.\nHe's not an easy grader, and participation won't matter except that you have to arrive for roll.  Careful of his homophobic, racist, misogynistic rants. \nWorkload:\n3 papers, 2 will count.  Although the workload is light, his erratic grading takes the fun out of this class.  Not an easy \"A\". \n"
        },
        {
            "course_name": "Screenwriting: Pitch to Outline",
            "review_date": "June 26, 2007",
            "review_content": "\nIt's true, Dave is totally vulgar and will try his best to insult you.  So don't take the class if you are sensitive.  But Dave is a brilliant story teller and he can teach you the secrets to successful storytelling.  Even if you only take the class for his second lecture on story structure, it would be totally worth it.  I actually clapped after the three hour lecture, it was that good.  I thoroughly enjoyed this class.  You will too if you are serious about learning how to write a successful screenplay.\nWorkload:\nWorkshopping work, you make the class as valuable as you want.  Final is first act of screenplay or well developed treatment\n"
        },
        {
            "course_name": "Senior Seminar in Screenwriting",
            "review_date": "December 27, 2006",
            "review_content": "\nOn Day 1, McKenna makes it clear that only a corpse will not, at some point in the semester, be completely offended by something he says at some time.  And then he proceeds to deliver.  \nIt's part of his method:  uncensoring himself, he's aiming to uncensor the class at large.  And it works in some percentage of the students, and it doesn't work in some percentage of his students.  You need a certain strength of character to dive into that process and make something of it.  You need a certain self-possession to decide what is nonsense and what you're going to chew on for a long time after the class is over.  There are diamonds in the roughage.  They can cut you in interesting ways.  \nAs far as the structure of the class, you'll get out of it what you put in.  It's a writing class.  If you want to come out a better writer, you should try to be harder on yourself than McKenna will be.  He'll tend to be pretty kind, though fanatically provocative.  You need to listen to the remarks on everyone else's material as carefully as you listen to the remarks on your own stuff.  \nFinally, for a good grade, it's obvious that you need to do the writing work, but what's NOT obvious is that you need to comment on your fellow students' work.  Because of the seminar format, McKenna is looking to provoke what he calls a lively room.  \nIt sometimes seems that he could talk for three hours straight without interruption - and he could.  But what he really wants is for the participants to pick up the ball and run with it.  He expects you to pay attention to everyone else's work and everyone else's comments, and to come up with ideas that demonstrate that you're understanding the class.  You might think you can BS your way through that component, and therefore it's not important.  But in fact, it's the difference between a B and an A.  \nWomen get special treatment.  On the one hand, maybe women get a little more slack than guys.  On the other, you have to suffer through his amazingly sexist and borderline offensive monologs.  \nHe says that in order to get an A, you need to demonstrate professional-caliber talent.  I'm not sure it's really that tough, but you should realize that merely doing the work and showing up will not result in an A.  \nWorkload:\nHe assigns only one book to read, and it seemed pretty optional to me.  You can skim a chapter or two, get the idea, and focus on your writing.  The writing winds up being fairly demanding - don't put it off.  You're looking at a three-page outline of two original screenplays, so that's six pages; and then you've got to write the first act of one of those screenplays, which is 30 pages in screenplay format.  It's actually not so demanding, but if you try to pull it off at the last minute, you will have a load of crap in your hands.  Which is a waste of your precious time.  \n"
        },
        {
            "course_name": "Topics in American Cinema: Horror ",
            "review_date": "August 17, 2006",
            "review_content": "\nDavid McKennaÂ’s energy level and enthusiasm for cinema is contagious. He hides his knowledge behind a laid back attitude but no matter how obscure a question, he understands and is able to answer in depth, with much more insight than I expected.  Discussions include so many points of view and this always helped to make them interesting. One time he didnÂ’t know an answer, so he actually said: Â“I donÂ’t know.Â” I never heard a professor say: Â“I donÂ’t knowÂ” before. But then he came in the next class with the answer.  Professor McKennaÂ’s approach to cinema is not a dry academic approach, yet even though there were a couple of films that I wouldnÂ’t choose, his explanation of their place in cinematic history justified having to watch them. One unusual incident in the class came about due to the new generation gap.  An undergrad pointed out an incident in RosemaryÂ’s Baby: McKenna seemed genuinely puzzled that the question would even be an issue.  But rather than belittle the question or dismiss it, he actually contemplated it and bought it up in the next class.  He really wanted to know the students concern about the touchy subject.  Mr. McKenna is actually eager to hear and learn from the students; this for me is a sign of a really unique teacher.  He is not an easy grader; but he is open-minded about different perspectives and let you do re-writes.  He takes care to point out inconsistencies in an argument and, even if he doesnÂ’t agree with your point of view, he accepts it if you present the argument well.   He doesnÂ’t want you to parrot him but to think for yourself, no matter how outrageous the argument. If you want a dry academic course on film donÂ’t take his class. Film major will learn a lot from him but even to take it as an elective, as I did, would be a smart idea.  Professor McKenna knows a lot without being a know-it-all.  \nWorkload:\nFair:three 5 page papers, optional paper and re-writes if you want.\n"
        },
        {
            "course_name": "Horror, War, Senior Screenwriting Seminar",
            "review_date": "May 22, 2006",
            "review_content": "\nSee that I've listed not one but three classes for David McKenna?  That's because he is quite simply the MAN.  McKenna is a dying breed, a genuine rough and tumble liberal whose hit the skids a time or two but definitely knows his shit cold.  Unless you're relatively thin-skinned you'll get over where you and McKenna diverge personality wise (he is by his own admission a bit of a letch, crude and extremely opinionated-but that's the FUN).  Yes its an easy B if you're willing to show up and do the bare minimum but man oh man its a well deserved A if you can get one.  COntrary to other posters if you keep your own bullshit academic posturing to aminimum and make an effort McKenna WILL be interested in you and your ideas. If he's not giving you something to chew on, he'll be dropping an intriguing releavent anectdote or saying something to get a rise out of the easily shaken.  If you're a film major you owe it to yourself to take as much with McKenna as possible.  How good is McKenna: a friend of mine took the same class (war and propaganda in film) with him TWICE!  And he wasn't even a film major.       \nWorkload:\nFor his lecture based electives and classes 3 4-5 page papers (one of which is kind of a freebie).  For his screenwriting usually a two page pitch or treatment and then somewhere between a 40-120 page screenplay (depends on class)\n"
        },
        {
            "course_name": "Screenwriting",
            "review_date": "December 14, 2005",
            "review_content": "\nUnfortunately, McKenna has no interest in hearing your ideas. Do yourself a favor and take a Screenwriting class at the New York Film Academy or another institution. Although at root a very good guy, he is extremely self-absorbed. He spent 90% of our class time talking about himself, what his favorite movies are, and doing impressions of his favorite actors (which include, by the way, Sylvester Stallone in Rocky.) No one in my class thought they got anything useful out of it. A real waste of time- the only thing I got from it was the feedback of the few people in my class, whose comments he stifled to interject his own. Awful.\nWorkload:\nDidn't really matter 'cause he didn't look at it anyway.\n"
        },
        {
            "course_name": "War and Propaganda",
            "review_date": "May 22, 2005",
            "review_content": "\nProbably one of the most enjoyable 4 hour session classes I've had. Prof McKenna makes an interesting subject matter very entertaining, with his raw and explicit opinions on the subject. The film discussions were entertaining and the course requirement involves three papers, and although the minimum grade is a B, there are no handouts for As. \nWorkload:\n4 papers, one freebie, throughout the semester.\n"
        },
        {
            "course_name": "War and Propaganda Films",
            "review_date": "April 19, 2005",
            "review_content": "\nLove him--I took this cause it fulfilled an Eng requirement, and I was interested in film/history and knew little about both. McKenna knows his shit and is extremely entertaining. I learned a lot about history, politics, and the basics of film seemingly effortlessly cause I like listening to him speak. He is super-liberal and all that jazz, but it's cool cause he doesn't try to push his opinions; he just wants to present things so that you think about them. I agree with the other reviewer--I am much more skeptical of what is presented to me now and more aware of making my own mind up about it. That's a cool thing to get from a class. Right on, McKenna, you crazy mofo.\nWorkload:\nLIGHT--4 3-4 page papers. Like someone else said, it'll be hard to get an A, but you will learn. If you're motivated by grades, it's not for you (as he'll let you know), but otherwise you'll at least see some cool movies and hear some interesting perspectives on them.\n"
        },
        {
            "course_name": "War Propaganda (Movies)",
            "review_date": "April 14, 2005",
            "review_content": "\nOne of the best classes at Columbia.  I have no idea what the other reviewers were talking about (then again I havent taken screenwriting) but this class is a perfect elective for someone who likes war movies, politics, and generally entertaining lectures.  Despite being as liberal as they come, McKenna does a decent (by Columbia standards) job of presenting both sides of political arguments - in other words, he helps the freshman figure out that they should have some idea what's going on in this country before they bash Bush because all of their friends are doing it.  McKenna's funny and very well informed about film, history, and contemporary issues.  The serious film majors seem to love him, but his focus in this class is on propaganda and its affect on the American people, so you don't need to know so much about movie-making to benefit from this class.  You'll never look at a movie/tv screen the same.\nWorkload:\nReadings that are completely (by McKenna's admission) unnecessary - but worth looking at.  4 3-5 page papers on pretty much anything you want if it has something to do with war propaganda.  It's hard to get an A, but even harder to get a C.  Take this class for enjoyment, not a grade.\n"
        },
        {
            "course_name": "Screenwriting",
            "review_date": "December 29, 2004",
            "review_content": "\nIn my opinion, David McKenna really doesn't care about you.  He will talk about your screenplay in class, but don't count on any interest beyond that.  He prides himself on being anti-academic, and seems to think he is incredibly profound, but mostly he's just lewd and inappropriate.  \nWorkload:\nTwo treatments and one 30 page screenplay, to be submitted in class any time before the end of the semester.  You get a B whether you work hard or not, so they don't really matter.\n"
        },
        {
            "course_name": "Screenwriting (Barnard and Columbia)",
            "review_date": "July 19, 2004",
            "review_content": "\nMcKenna can be a real asshole, but he is one of the best professors I've found at Columbia.  His nothing-sacred, determinedly un-PC attitude can be off-putting, but if you can't deal with some obnoxious people, why are you in the film industry anyway?  Once you get past his demeanor and car metaphors, however, he is a brilliant guy with a ton to offer.  I learned more in the first week of his class than in all the Creative Writing Program classes I've taken combined.  He rarely lectures, and instead spends most of the time workshopping students' work in a very collaborative atmosphere.  He scares off all the dilettantes in the first class by talking about how he doesn't believe in grade inflation, so his classes are filled with serious, motivated writers, and he tends to bring out whatever is wild, nutty, lecherous or ridiculous in the class.  This is the only class I've had where students voluntarily stayed late because we weren't done talking!  His class becomes like a little family by the end of the semester--the Osbornes.  I have taken both his Barnard and Columbia classes; the Columbia class had film grad students in it (who said it was better than their grad classes) as well as people like myself who aren't even film majors.  Try to get into his 3-hour Columbia classes if you can; two hours is not enough time.\nWorkload:\nYou are techinally supposed to complete either a first act or a full screenplay (depending on which semester it is), but as long as you work hard and turn something in he is relatively lenient with the requirements.  Don't skip class!  It affects your grade and the rest of the class will talk about you when you're not there.\n"
        },
        {
            "course_name": "Screenwriting",
            "review_date": "December 31, 1999",
            "review_content": "\nMcKenna is a macho man to the bones and a frustrated actor as well. His recent reincarnation is a cross between Crocodile Dundee and Clint Eastwood. He red lines on swagger, a phony cowboy accent, profanity, and pure bologna. He uses an excellent book that charts the course of a screenplay and uses examples from films to back up the course book, and that can be illuminating -- at times. But unfortunately he is a teacher that confuses taste with style and erudition with high octane delivery. Watch out for his little black cigar. He likes to hang it in his lip like Clint and opine like Dirty Harry, which he ain't.\nWorkload:\nMinimal, but you better write something he likes or else. \n"
        }
    ]
}