{
    "prof_info": [
        {
            "prof_name": "Gautam Dasgupta",
            "prof_id": 4155,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "E3161 Fluid Mechanics",
            "review_date": "January 18, 2011",
            "review_content": "\nI took Fluid Mechanics with him in Fall 2010.\nIf you want a professor that will hold your hand and walk you through the material, Dasgupta is not it! As the last reviewer said, you will have to teach yourself all of the material. If you have any questions, don't ask him, go straight to Wikipedia. While the TA tries to make life easier, (s)he will point you back to Wikipedia as well. Do yourself a favor and cut out the middle man.\nHe is nice one-on-one but in class, he can be confrontational and rude. I remember an instance when someone tried to ask a question in class and he shouted that they should have gotten said information from the book. Needless to say, we kept questions to a minimum.\nHe gives tons of handouts and the homework is difficult to understand if you actually try to learn it.\nTip: The homework consists of reworking the examples with different numbers but very little of the homework appears on the exam. Memorize the derivations and don't worry about understanding the homework problem. Memorize the equations and the steps for deriving them. \nNo formula sheet on exams. Your notes will look like crap when you leave class so compare them with no fewer than two classmates. Let's just say that you learn more from the lab section than him.\nWorkload:\n40% - The Final\n20% - The midterm\n20% - Homework\n20% - Lab\n"
        },
        {
            "course_name": "E3161 Fluid Mechanics",
            "review_date": "November 14, 2010",
            "review_content": "\nProfessor Dasgupta's power of communication is not the strongest. He speaks English, which is sometimes hard to find in science/engineering classes. However, when you ask a question in class, which he does encourage, he probably will misunderstand you. Be prepared to take full charge of your education in his class. He really likes derivations and does not adhere to the book. His homework is reworking examples in the book different data. His assignments do not prepare you for the midterm. \nThere is a lab every other week, straight forward and in a group of six. \nWorkload:\nA overly-straight forward midterm (very specifically relates to the notes) which can trip you up. Homework is easy. Read the book though, his notes make a lot more sense after the reading.\n"
        }
    ]
}