{
    "prof_info": [
        {
            "prof_name": "Robert Mundell",
            "prof_id": 311,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Macroeconomics Seminar",
            "review_date": "May 07, 2012",
            "review_content": "\nAfter taking a senior seminar with Professor Mundell I understand the previous commentor's frustrations BUT I think they probably just had the wrong attitude about the class.\nAs far as a seminar goes, this is about as easy as you can hope for. There are no readings, homeworks, or papers. There is a midterm and a final that is entirely based on class notes, his general ramblings in class, and a few papers he has written. If you study that material, everything is pretty clear and the exams are fair.\nThe main thing with this class is that most of his economic theory is really outdated. He is pretty much a stubborn brilliant econoclast (see what I did there?) who just preaches his own beliefs. His lectures range from fascinating to incredibly boring and it is almost impossible to understand any of the graphs he draws. However, it doesn't matter! As long as you go to office hours and have him explain the most important models (or figure them out on your own) that is all you need for the exams.\nOverall, this was a totally painless seminar where I learned a lot about some really pertinent issues right now (optimum currency areas, currency stability, etc.).\nAs long as you are not a control freak and can handle a class that is a bit disorganized and not completely clear, I would definitely recommend Mundell's Macro Disequilibrium seminar.\nWorkload:\nAs noted above: only a midterm and final\nNo reading, homework, or papers\n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "February 02, 2006",
            "review_content": "\nI took this class in Spring of 2005.  Let me preface this by saying that I got an A+ in the class, so this review is purely a matter of my frustration with Professor Mundell over the term, instead of grade revenge:\nRobert Mundell is the Howard Hughes of economics -- a genius of the 1960s (most notably for his work on the Mundell-Fleming Model and on optimum currency areas, which is the work for which he got his Nobel), who somehow became crazy as a loon in the 1970s and never came back.  Mundell's brand of craziness unfortunately includes being \"abusive-crazy.\"  Let me relate to you an interaction I had with him in the middle of the term (after it was too late to drop the class!):\nMundell's lectures were fairly difficult to understand.  His lectures on the geometry of international trade were a series of unmarked random wavy lines on the chalk board, and, in another lecture, when trying to draw some bubbles to describe the international monetary system, he drew something resembling a La-Z-Boy recliner with a foot rest.  A group of friends and I put together a study group, to put our heads together and make something of his lecture notes.  We got nothing.  No one had any clue what was going on.\nRight before the first midterm (he calls it a \"quiz\"), I asked Mundell if I could meet with him for the whole hour during his office hours, in order to go over the class notes about which I was confused.  I told him that I understood that this was a long time, and that I would step out temporarily if he anyone else needed to see him during that time.  He was very nice about it and happily agreed.\nTwo days later, I come to his office and begin asking him questions about the class notes.  On almost every question I asked, he would answer by saying, \"I don't know.  You tell me.  They're your notes.\"  I would ask him about a graph he had written on the board -- about what variable was being represented on the horizontal axis, and I would get back the same answer, \"I don't know.  You tell me.  They're your notes.\"\nAt one point, in the middle of me asking him a question, he starts reading a magazine.  I thought this was pretty rude, but, I also thought, \"Who am I to question a Nobel Laureate -- in his own office no less.\"  So I kept going.\nAt one point I asked, \"So your notes here say that 'Wealth equals income over the interest rate' --\"  Mundell looks up from his magazine.  Then he starts yelling, \"What?!  Wealth equals income?  That's not right!  How could you say something so stupid . . .\"  And he went on this tirade about how stupid it is to say that wealth equalled income.\nSo I told him, \"No, if you'll just look over here at my notes, you'll see that what I just said was that wealth equals income *over the interest rate*,\" and then I pointed at my class notes, which said exactly that.  He looked over at my notes, and, after a pause, began yelling again, \"No, you said that wealth equals income.  How could you . . .\"  And he went on berating me for something that I clearly had not said.\nSo I kept asking questions and trying to get some answers out of him, and, when we reached almost the half-hour mark, Mundell said to me, \"Look, I'm going to give you five more minutes and then that's it.\"\nI should reiterate that these were his designated office hours, and there was nobody else waiting outside his office who wanted to see him.  So I said to him, \"But you promised the other day that we could meet for the hour --\"  Mundell interupts, \"Well, you didn't prepare your questions in advance; they're not well-formed.  . . .\"  So I told him that I wanted to leave right now, and I got the hell out of there.\nLater in the semester, Mundell tried to pull the same thing when a friend of mine (to whom I had complained about the above incident) went to his office hours.  As soon as Mundell got aggressive with him, my friend (unlike me) stood up for himself and told him to stop.  And surprisingly Mundell backed down.  A lesson: If you take this class and ever interact personally with Mundell, you should be aggressive with him so that he knows that he can't push you around.\nSo that's my litle anecdote about what Mundell is like on a personal level.  Here's how the rest of the semester went:\nI went into the first midterm armed with a skeletal understanding of his notes.  I received a score of 81 out of 100, with the comment next to my score \"Highest mark in the class.\"\nI attribute my good grade in the class to the fact that I had already taken both International Macro and International Trade (and I generally love economics and do not forget the material after I take the classes).  These are not official prerequisites for the class, but I knew quite a few other people who had not taken these courses, and they did not do very well.\nIntellectually, the one thing I got out of this class was a general version of the Mundell Fleming model that allows for varying degrees of capital mobility.  It provides a better understanding of the perfect capital-mobility model (a special case of the general version) about which I learned in my International Macro class.  The problem is that you won't realize that Mundell is doing this unless (a) you think really hard about what Mundell is trying to say and (b) you have already taken International Macro.  Anyway, I really did not need to go through the agravation of his class for such little pay-off.  Everyone else I knew seemed to have gotten nothing out of this class except frustration.\nI had hoped that he would give a rigorous treatment of the domestic tax cuts of the Reagan years (Mundell is considered one of the father's of supply-side economics, although this is not among the things for which he received his Nobel).  He actually said very little of substance on the topic.  At its heart, this is an empirical debate, not a theoretical one.  Mundell gave us little more than the statement that U.S. GDP growth was pretty bad before the Reagan tax cuts and pretty good afterwards, and better for the U.S., which cut taxes, relative the Europeans, who didn't (maybe Europe had other problems besides taxes, such as labor market inflexibility).  No counterargument to the claim that the Reagan boom was mostly a restoration of aggregate demand rather than an expansion of aggregate supply, although he did acknowledge it.  No mention of the expectations-augmented Phillips curve, which says that, if you start out with unemployment way above the NAIRU, then even if unemployment begins to fall, you will see (regardless of tax cuts) a simultaneous fall in inflation, as long as the level of unemployment stays above the NAIRU.  This undermines the supply-siders' claim that the simultaneous fall in unemployment and inflation during the 1980s was somehow due to the miracle of tax cuts.  I can't imagine that Mundell does not have an empirical counterargument to this, but he did not provide it.  No mention of estimates of elasticity of labor supply with respect to the after-tax wage or elasticity of saving with respect to the after-tax interest rate.  If these quantities are high, then Reagan was an economic miracle, but, if they are low, he was a disaster.  These are among the central issues in the debate over Reagan's economic legacy, and Mundell really gave them short shrift.\nIn summary:\nDisorganized and difficult-to-understand lecturer\nIncoherently abusive personality\nHard tests (called \"quizzes\") unless you already know international trade and international macro\nVery little intellectual payoff.\nWorkload:\n1 paper, 1 Midterm (he calls it the \"first quiz\"), and 1 Final (he calls it the \"second quiz\")\n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "December 29, 2005",
            "review_content": "\nThis course is probably decent for students who have seen the models before, but horrible ones who haven't. The syllabus promises so much, but the course delivers so little. There is virtually no reference material. He references old articles, but doesn't really follow them. He frequently makes mistakes on the board, but yells at students who ask for clarification in office hours. Of course, you're lucky if you find him in office hours: he didn't show for the two sessions right before the midterm \"quiz.\"\nThe second half of the class was just an oral history of the gold standard. We didn't really cover any of the material that made him famous. (Taken Fall 05).\nWorkload:\nNot enough. A problem set or two would have really helped with the material. 15 page paper, which was graded so-so. Quizes were graded harsly, but everyone I know ended up scoring in the traditional Columbia range (but sometimes lower than they were used to).\n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "August 18, 2004",
            "review_content": "\nYou had to take a little initiative to get something out of this class, and you also had to listen closely to what Prof. Mundell to say.  \nIf it was really so easy, like high school as some people have said, people would have done better on the quizzes.  The quizzes asked people to explain economic models and historical examples used in class.  The readings add depth to the models.  \nThis is definitely a class worth taking.\nWorkload:\nThree quizzes and a final paper.  The grading was a little mysterious.  I also got a B+ on the paper, but an A+ based on a high 90s average on the the quizzes.  I saw the other scores on the quizzes when going through the pile to find my score, and mine seemed to be about the highest.  Only one or two people received A's on the paper.  \n"
        },
        {
            "course_name": "Topics in Macroeconomic Theory and Policy",
            "review_date": "May 28, 2004",
            "review_content": "\nIt's unbelievable how much this class sucked. As the previous reviewers noted, he uses no book and no handouts, and he assigns exclusively his own articles. He doesn't stick to the course outline or syllabus and forgets what he's talked about in previous lectures. Grading is pretty half-assed and arbitrary, just like every other aspect of the course.\n"
        },
        {
            "course_name": "Topics in Macroeconomic Theory and Policy",
            "review_date": "May 22, 2004",
            "review_content": "\nAfter three years at Columbia, I have not been more disappointed by a course or by an instructor. Like most, I was seduced by Mundell's credentials into taking the course. But, somewhat ironically, his course was more like a high school class than any other I have had at columbia. He uses no lecture notes, which guarantees that his lectures will be meandering and disorganized, and he repeats himself endlessly. Further you do not go into any of the \"topics\" in depth at all. Mundell does nothing to challenge his students - he belabors simple points that you learned in principles of economics, or worse, in high school. His tests require spitting out stupid catch-phrases. The course as a whole is disgustingly unstimulating and offers no insight into economics AT ALL. My advice: DON'T TAKE THIS COURSE! Instead, go to his website www.robertmundell.net and read through his international economics text papers - they are wonderful. You won't get anything more out of the course. SAVE YOUR MONEY AND YOUR TIME - I WISH I HAD.\nWorkload:\nthree quizes, one research paper.\n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "May 20, 2004",
            "review_content": "\nUnlike any other econ elective I have ever taken. No text book, and no real structure. He just picks a topic he wants to talk about and then goes at. Afterward he'll mention a paper he wrote for the class to read. If you take this class I would reccomend going to the lectures, because it can be difficult to pick up what matters from the papers. Overall this class was a breeze with no work other than a final paper. \nWorkload:\nNo homework. 3 quizes and 1 term paper. He says the grade is split 50/50 between paper and quizes, but I only got a B+ on the paper and somehow ended up with an A+ for the class\n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "April 29, 2004",
            "review_content": "\nThis class was interesting, in good and bad ways.  I took it simply because I wanted to take a class with a Nobel Laureate, and I appreciated that in the end.  There is not much structure to this course - it is basically the 'topics' that Mundell has published important papers on during his career, and so there is no main textbook.  I was blown away by Mundell's incredibly sophisticated papers, even though most of his very important work he accomplished during the early 60's.  Nevertheless, Mundell does a great job of keeping subjects topical to today.\nThat said, Mundell is a couple parts crazy.  In the '80s and since he has become an advocate of supply side economics, and he becomes much more of an ideologue than an economist while discussing it.  Also, his articles often diverged from what was being discussed in class, and it the syllabus was pretty incoherent.\nI would not recommend this class to any besides an econ major, and probably no one besides a senior who has taken a  large number of classes, especially in international econ.  Mundell assumes a sophistication that most econ majors are too lazy to achieve, and most of you brain-dead i-banking wannabes will probably complain your way through a fascinating course. \nWorkload:\n3 quizes, no midterm or final. One long termpaper, whichis 50% of the grade. (LIGHT)\n"
        },
        {
            "course_name": "International Monetary Theory and Policy",
            "review_date": "September 12, 2003",
            "review_content": "\nThe man is a genius.  What more do you need to know to take this class?  \n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "May 17, 2003",
            "review_content": "\nAlthough lectures sometimes tended towards the boring side, you can always remind yourself that you're being taught by a Nobel Prize winner. Prof. Mundell was surprisingly available outside of class. He wanted everyone to come in to his office hours and talk about the final research paper and taught at least 80% of the classes himself. (The others were taught by a TA). Because there was no in class midterm or final, it is easy to get by this class without ever turning up, but I think thats besides the point of taking the class with one of the most brilliant minds in economics. \nWorkload:\nTake home midterm and final paper (13-15 pages). \n"
        },
        {
            "course_name": "International Monetary Theory and Policy",
            "review_date": "December 31, 1999",
            "review_content": "\nYes, this man won the Nobel Prize for Economics. We all understand that the econ department considers him the MAN. But be forewarned before you take this course. Even before he won the Nobel, you could tell that it was a bad sign when his TA's would be teaching more classes than him. OK, so maybe he's busy these days building his palatial villa in Spain and a little too important for us undergraduates, but cmon, we should reap some of the benefits of such an esteemed scholar, shouldn't we? After all, we are paying top dollar to come here, so you would expect the best for what you paid for, right?\nWorkload:\nAll work graded by TA's\n"
        },
        {
            "course_name": "International Monetary Theory and Policy",
            "review_date": "December 31, 1999",
            "review_content": "\nI tend to disagree with the negative review. I found Professor Mundell to be accessible outside the classroom, and he was helpful in guiding my paper along. And, it isn't everyday that you have a Nobel Prize winner teaching you. It doesn't get any better than that.\n"
        }
    ]
}