{
    "prof_info": [
        {
            "prof_name": "Nicola Zaniboni",
            "prof_id": 12837,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Economics",
            "review_date": "August 21, 2014",
            "review_content": "\nTo be honest this class was not the most enjoyable. The professor is nice and tries hard but lectures were pretty dry. I mostly ended up reading the book well instead of going to class and came out with a pretty good grade anyway. Recitation was not that useful either. \nAverages were pretty low and the curve was decent. \nWeekly Problem sets got harder as the semester progressed but were doable if you don't mind spending some hours on them plus refer to the book. \nExams mostly consisted of questions very similar to problem sets. \nI would recommend this class to those who like to learn from the book, probably not worth your time actually attending class.\nWorkload:\nWeekly problem sets 15% (become more challenging), Midterm worth 35% (hard to complete in time), final worth 50% \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 08, 2014",
            "review_content": "\nProfessor Zaniboni's new (and apparently may not be returning next year), but he was a strong professor and really knew how to convey information well. His slides were strikingly up to date (often including information from less than a month ago), which added some relevance to the class. He was at times disarmingly funny, and he was, in general, a very strong lecturer, which made a potentially-dry class interesting. I hope he comes back next year, he's a good choice, even if he doesn't have the all-star name of Gulati or Musati.\nWorkload:\n10 Problem Sets, 2 tests. pretty simple\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 25, 2014",
            "review_content": "\nI've never taken an econ class and I don't have much of an interest in econ, so I really did not know what to expect walking into Zaniboni's class. Since I've never taken Musatti or Gulati's classes, I don't know how Zaniboni compares and whether his class is \"better\" or \"worse\" than theirs.\nZaniboni does a good job of breaking down concepts so they can be explained in a very simple manner. His lectures are very clear and focused on understanding the concepts themselves, which is great, although they can be a bit dry at times.\nUnfortunately, I found that his lectures were not very applicable to the homework, since he does not really address the mathematical side of econ. The textbook was a lifesaver. In some classes, you can get by with only attending lectures and not using the textbook, but that was not the case here. Thankfully, the discussions (recitations) were fairly useful in that the TA went over problems that were very similar to the homework and was very open to answering homework questions.\nThe midterm focused on micro and the final was not cumulative and focused on macro, which was a definite plus. The final was easier than the midterm. However, the TAs actually grade the homework, which is out of 5. You have to be perfect for a 5/5. One error is most likely a 3/5 and anything more than that is a 1/5. On the bright side they did not take very long to do.\nMaybe I'm just not an econ person, but I feel like I drifted through this class without really knowing what was going on. Zaniboni is very approachable and seems like a nice guy, but given the choice I would probably try either Gulati or Musatti.\nWorkload:\nNot too bad:\nWeekly psets that are actually graded (10 total w/ 1 dropped, 15%)\n1 midterm (35%)\nFinal -- not cumulative (50%)\n"
        }
    ]
}