{
    "prof_info": [
        {
            "prof_name": "Hammou Barmi",
            "prof_id": 6380,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistical Inference",
            "review_date": "June 02, 2014",
            "review_content": "\nSimply put, this class was hard.  I took it as part of the probstat requirement for Information Science, and if I had the choice, I would definitely go back and take 4150 or 3600 instead.\nYou need to come in with a solid foundation in probability, and if you don't have that, you're kind of screwed from the start.  There is a quick review of probability in the first few lectures.  The material is challenging, and Prof. Elbarmi does his best to teach it, but sometimes it just isn't enough.\nThe lectures are extremely organized.  They were dry, but the material is to blame, not the professor.  He systematically goes through definitions, theorems, and examples.  Many of these are straight from the book.  If you get to class early, you can ask him questions, and he'll answer them on the board.\nThe homeworks, aside from those in the beginning for the probability review, were always 5 questions from the textbook.  Five questions sounds short but these psets were the bane of my existence for the entire semester because they were just too damn hard for me.  They took me hours, but I am sure they were easier for other people who were more comfortable with the material.\nThe exams were challenging, but the material did not stray far from lecture examples and homework questions.\nThe professor was pretty unresponsive to emails.  The TAs were only slightly better.  Just go to office hours or ask the professor in class.  You probably will never find out how he curves though.\nWorkload:\nweekly psets: ended up with 10 total, lowest grade dropped\nmidterm: no review, 1 sheet of formulas, 6 problems. I think one person finished the whole thing.\nfinal: not cumulative, review session, 1 sheet of formulas, choose 5 out of 7 or 8 questions. This was more doable than the midterm, but still challenging.\n"
        },
        {
            "course_name": "Intro to Statistical Inference",
            "review_date": "May 16, 2013",
            "review_content": "\nHammou is one of the best professors I have had at Columbia thus far. \nHe truly cares about his students and took the time to actually learn our names in a large class of 50+ students. \nHis lectures/notes are organized and beautifully presented and he encourages class participation during the lecture. \nHe makes sure to ask if there are any questions quite frequently throughout the lecture. \nI highly recommend him; he makes learning statistics a joy!\n\nWorkload:\nabout 10 problem sets(5 questions each); 1 midterm (1 page front and back of notes allowed); 1 final (2 pages front and back of notes allowed). If you attend lecture, not bad at all. \n"
        },
        {
            "course_name": "Intro to Statistical Inference",
            "review_date": "January 21, 2013",
            "review_content": "\nThis is one of the best professors that I had at Columbia. Everyone complaining about the bad grades are either lazy or stupid.\nFirst, on the complaints about no review for midterm/final:\nThe examples he gives in lecture are practically identical to the homework, which are in turn practically identical to the midterm/final (and in fact there have been exact copies of hw problems on these tests). He lets you bring in FOUR sheets of notes for the final and I think at least two for the midterm. They can be typed and they can contain worked problems. Put the examples from class on them and the very few formulas you need. \nOn grades:\nHe gives Cs because people (myself included) get close to 100%s in the class. If several people have a 98 in the class and you have a 65, you deserve a C. You are not entitled to a good grade in a class where you do not understand the material and, for this class, the fault is on you, not the professor.\nOn his teaching style:\nHe prepares and presents beautifully organized notes in class and these are all you need to do well. The book is terrible and confusing and I rarely read it. If you skip class and try to learn out of the book you are putting yourself at a terrible disadvantage. He also encourages participation in class, which keeps you awake and helps you to make connections yourself. He is also very nice and learns most of the names of the students in the class. His psets are usually pretty short (5 quick problems max) and don't take longer than maybe 2 hours. \n\nWorkload:\nPsets. Midterm. Final. Some quizzes.\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "January 02, 2013",
            "review_content": "\nPlease, do yourself a favor and run away from this professor. Absolutely horrible!\nFirst, Stats dept states that the ONLY prerequisite for this course is Calc 1, which is a big fat lie. The material covers Calc 4 and you HAVE to have at least a basic understanding of stats before you walk into this class!\nHammou is a great guy, but horrible professor. He never gave reviews for either the midterms or the final. The material that appeared on those had nothing to do with the homeworks, he just comes up with random stuff to make your life complicated. \nNo curving whatsoever, many of my friends failed the class, I was \"lucky\" enough to pass with a C (and I am NOT a C student). \nBottom line - DO NOT take Elbarmi if you have never taken stats before. He would not mind failing you, keeping your grade a secret till the very last day. \nShame! Shame! Shame! \nColumbia should not have such a horrible Stats dept!\nWorkload:\nWeekly hw, not challenging. Difficult midterm, ridiculous final.\n"
        },
        {
            "course_name": "Intro to Statistical Inference",
            "review_date": "March 14, 2012",
            "review_content": "\nHammou Barmi is a horrible professor. He is from Baruch so he doesn't know how to curve; he thinks all columbia kids are as dumb as baruch kids so he won't mind flunking everybody.\ni don't know who did his previous review but hammou's statistical inference class was the worst experience i ever had in my columbia life. He doesn't know how to teach and he tests you on material you never learn about. \nMidterm Average ~ 60%\nHis curve: >80% A range\n70-80%B\n50-70%C\nt even know how he is still at Columbia.\nWorkload:\nridiculous, weekly homework that the TA doesn't know how to solve. Hard midterm and final.\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "January 10, 2012",
            "review_content": "\nHe is an excellent professor. One of the best at Columbia, and \"THE BEST\" in the statistics department. You are very lucky if you have him for Statistical Inference as he teaches with so much passion and enthusiasm that just sitting in the class is enough to understand the material and solve the homework problems. The text book helps ONLY to get the homework questions. Other than that, you just have to attend his crystal clear lectures.\nI find myself very lucky to take his class after having a terrible semester with probability. Do your self a favor by taking his class.\n\nWorkload:\nVery reasonable. Weekly PS, a midterm and a final. Very generous grading.\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "September 05, 2011",
            "review_content": "\nDo yourself a favor and wait to take this class with a better professor.\nElbarmi Hammou is a nice guy, but that only takes you so far. It doesn't change the fact that he has no idea how to teach a class, or even how to structure/organize a class. Furthermore, it doesn't change the fact that his quizzes and exams are horribly designed.\nThe average on the first quiz was a 2/10. After the first quiz, he never told us the mean/range of the quiz scores, just that \"they were low\". Last semester, the median midterm grade was a 20/80. This semester, it was slightly higher (30/55 or 31/55).\n(The reason the quizzes/exams are so hard is that he will focus on one small concept that he mentioned only once, and then center half of the exam around that. For example, in class he always used distributions for which the support was independent of the parameters, and all of the examples/homework problems did as well. On the exams, all of the problems used distributions for which this wasn't the case, so none of the techniques we were taught in class worked properly.)\nHe changed the grading weights a month into the semester (the quizzes were never part of the original syllabus), so we never knew how much the quizzes, homeworks, midterm, and final ended up being worth. The only thing he told us was that the lowest homework would be dropped, and that the lowest quiz would be dropped. (The last part doesn't help you much, because he doesn't tell you at the beginning of the semester how many quizzes you'll have - he decides about a week in advance).\nThe curve was MISERABLE. He was very vague about the specifics of the curve, but he alluded to curving the mean to a B-. This would make sense, since a surprising number of people ended up with C range grades (or lower).\nI wouldn't mind the low grade, as long as I at least learned something in the class. Unfortunately, you won't really learn anything in the class, so you might as well wait to take it with another professor (or just not take it at all).\nWorkload:\nWeekly problem sets. I'm sure that the solutions are floating around there somewhere, because there is no way that more than half the students in the class would have been able to do them without help. They were really, really difficult (the TA who graded our papers confessed that she didn't know how to do many of them).\n"
        }
    ]
}