{
    "prof_info": [
        {
            "prof_name": "Cordula Grewe",
            "prof_id": 1252,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 22, 2010",
            "review_content": "\nProfessor Grewe is awesome. Her art hum class was the most enjoyable core class I have taken. She can be a little intimidating. On the first day of class she gave a speech about how she doesn't care if other Art Hum instructors give less work and that she refuses to post her slides and prefers that we go find the artworks on the website, etc. and this in combination with the fact that she is very tall and has a strong German accent scared about 4 or 5 people out of the class. But! it turns out there was a completely manageable (in fact, practically easy) workload for the class. The lectures were very engaging. She calls on everyone, whether you want to be called on or not. She is very good at making even the driest points of Art Hum enjoyable and she creates good conversations in class. Also because she calls on everyone and everyone has to talk in class, you get to know your classmates better than most other classes. \nWorkload:\n3 papers (each about 3-5 pages), 1 midterm, 1 final, occasional short powerpoints that you make but dont have to present. \n"
        },
        {
            "course_name": "German Art in European Context 1760-1920",
            "review_date": "February 25, 2010",
            "review_content": "\nGrewe is one of those professors one imagines before enrolling in the university: the terms brilliant, accessible and enthusiastic are appropriate, yet perhaps don't extend far enough.  Unfortunately, after enrollment many students find that teachers of her caliber are a rarity, even at Columbia.  If you wish to be inspired by art, she is certainly a person well-endowed to instill in any student this sort of energy.  I encountered art work to which I have never before been exposed, presented in challenging formats.  Additionally, we read some texts written by Grewe in which the true scope of her intellect was openly exhibited.  If you are given the opportunity, take a class with her.  It will not be regretted.  Rather, you will look back upon it as one of those rare moments when the growth of one's intellect is also correlate to growth within the individual self.  I'm certain I'll be a better art historian for having studied under her.\nWorkload:\n2 take-home exams, 100-200 pages of reading a week (all primary source, or very interesting critical analysis)\n"
        },
        {
            "course_name": "German Art in European Context 1760-1920",
            "review_date": "November 07, 2004",
            "review_content": "\nwarning: a highly subjective love letter of a review follows.\nthis class, open to undergrads and grad students, traced the development of german art \"from the rise of neoclassicism to the formulation of expressionism.\" the relationship of german art to that of more-famous france and england, as well as issues of national identity and religion, were discussed at length. professor grewe is energetic, youthful, articulate, knowledgeable, and has a fabulous accent. the material covered in this class was voluminous and broad, and i was introduced to new artists and works i'd never seen before in my life every week. the readings were many, sometimes dense or obscure, but all relevant and interesting. i actually have retained to course books and packets on my shelf, a year later, because some of the material has proved so useful in my research for other art history classes, not to mention german department classes.\ngrewe exudes endless intelligence and love of her subject, and always seemed interested in answering questions and generally doing anything in her power to bring more information and material to us. she utilized powerpoint and many images as well as bringing in speakers and playing germa music of various periods in class. (at one point she made us stand up and sing \"deutschland ueber alles\" which i found hilarious and supertoll); i also quite enjoyed her occassional flinging about of neologisms and german terms, the meanings of which the non-german speakers in the class most likely had not a clue and had to figure it out later...haha. don't be afraid, she's a little intense but just don't be scared of her and you'll be fine. instead of being scared of her, just respect her deeply and feel lucky to have such a wonderful person from whom to learn.\nWorkload:\ntwo 1500 word book reviews and one final take-home essay exam. fairly graded, with lots of freedom as to how to approch the assignments.\n"
        },
        {
            "course_name": "Major's Colloquium: Introduction to the Literature and Methods of Art History",
            "review_date": "May 10, 2003",
            "review_content": "\n(This is the body of a letter sent to the Art History Dept. by appreciative students.)\nProfessor Grewe is a truly talented teacher.  She is incredibly learned,\nwell-spoken and enthusiastic both about her own field of study, which we\ntouched on briefly now and then, and about the art historical methods our\nclass covered.  Indeed, she communicated this enthusiasm with ease, making\nmethods that often seemed utterly opaque at the beginning of class both\ncomprehensible and fascinating (but never overly simple) by its end.  The\ntrue joy of this transformation, however, came not from what she told us,\nbut from what she enabled us to discover ourselves.  She strongly\nbelieves, and told us many\ntimes, that \"if you don't say it, you don't understand it.\"  Practically\napplied, this attitude does wonders for class participation.  Professor\nGrewe facilitated discussions in such a way as to challenge each and every\nperson to, in her words, \"become a detective,\" and contribute to the\nworking out of the investigation at hand.  These investigations, however,\nwere not confined to purely art historical texts; she assigned philosophy,\npsychology, and literary theory as well, showing us that the field of art\nhistory encompasses elements of many other liberal and scientific arts.\nThe result was that the class had a better  understanding of art\nhistorical methods, and began to comprehend the diversity of ways in which\nart history can be practiced.\nOutside of class Professor Grewe likewise worked hard to broaden our\nhorizons and encourage us to think critically about the field of art\nhistory.  She spent a great deal of her own time organizing absolutely\nwonderful trips for the class, including a visit to the Met on a Monday,\nwhen the museum is normally closed, to see the Leonardo exhibition; a trip\nto the Met's drawing and print study room, which opened our eyes to an\nincredible research facility; and a tour of Christie's.  Going out of her\nway to plan these exciting and memorable experiences, Professor Grewe\ndemonstrated what we all found to be characteristic: that she is\nexceptionally committed to her students and cares a great deal about their\neducation.\nWorkload:\n2 medium-length critical responses; 2-part research assignment; 2 class presentations; reading\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 21, 2003",
            "review_content": "\nThe lectures in this class are amazing, bordering on sublime.  However, there is really nothing more to it than them.  The reading is absolutely unneccesary (I know this because I never bought the books and got an A-), but classes are imperative since she discusses the larger themes over and over and gives great examples.  She is a very smart lady and speaks well, despite the German accent and tendancy to say ten syllable words and refuse to translate them.  All in all, I highly recommend this class, for nothing else but the fact that you get hours of beautiful entertainment with absolutely no work involved.\nWorkload:\n2 papers (no secondary sources), midterm, exam\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "January 01, 2003",
            "review_content": "\nGrewe is a young professor and it shows.  While she is enthusiastic, approachable and tries very hard to get students excited about the material through interesting assignments and integrating various media (think movies) into her lectures, her lecturing style leaves something to be desired.  She reads directly from her notes and seems to jump around from one topic to another and then loop back around several minutes or weeks later.  She drives home a few points again and again and again (enough on \"shifting interpretation to the viewer\" already!) which becomes tedious (but also confusing) and zooms through a million slides, talking quickly, without providing students with a slide list until the following class.  What is great about the course is that she addresses a lot of interesting issues (and brings up a lot of very interesting questions) that you won't find in your average 19th century art class (like German Romanticism and Neoclassicism), which was a great experience for those of us who think that the 19th century is just about French impressionism and also really helped to contextualize subsequent works.  The only problem was that she did such a great job leading us through the late 18th and early 19th centuries that she got a little bogged down so that we studied fairly little from the later part of the century.  Her lectures are mostly sparkling and energetic, albeit sometimes confusing,  and the tests and papers she assigns tend to be interesting and graded generously.  Overall she is highly recommended and I look forward to taking further classes with her.\nWorkload:\nTwo papers (the first is five pages and the second is seven pages), midterm, final.  Interesting readings (they are sometimes written to a higher level 19th century art student than those found in intro classes) that mostly don't really need to be done.  The review sessions given before the tests whittle down the amount of information you actually need to know.\n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "December 25, 2002",
            "review_content": "\nSTAY AWAY!  This woman is scary.  While I am sure that she is very nice, when she told us about her two 850 page dissertations (that's right, folks, TWO dissertations), I was terrified.  Then I approached her once to ask her a question, and I could barely look her in the eye.  When I handed in the second paper at the end of a class (clearly showing that I cut class), she gave me the look of death.  Her accent makes her difficult to understand, and if I ever see another work of German Romantic and Nazarine art (if that's your thing, no offence), I'm going to vomit.  While I know many of the people in the class were excited about Neoclassical painting and Impressionism, I think that German Romantic art should at least be referenced in the course description.  If it had been, I would have known better.  Grading is capricious; in terms of the two papers, mine were always on the bottom of the pile and received lower grades than expected (corrrelation?hmmm).  The TAs are pretty moody as well, and one always rolled her eyes at me whenever I asked a question and she was a student with me in a different class!  If you want to take this class, be forewarned that it is boring as all hell, the readings are useless, and the TAs ... well they are just like the other art history dept TAs.  Waste of time, take History of Photography instead.\nWorkload:\n2 papers, Midterm, Final.  These are dumb assignments, with unpointed and vague questions.  Midterm and final are completely covered at the review session, so its not necessary to go to class at all.  Plus the final essay questions are given ahead of time.  \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "December 23, 2002",
            "review_content": "\nThis class was an amazing experience. Not only did I gain a more intimate and in-depth understanding of the 19th century and its culture, not to mention the art itself, but the process was engaging from start to finish. This woman is a wonderful professor - incredibly well-spoken, enthusiastic, learned - almost every class was a pleasure. Grewe is a great addition to the faculty.\nWorkload:\npretty easy - a lot of reading that is not especially required. the review sessions are particularly useful. \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "December 15, 2002",
            "review_content": "\nAlthough she is knowledgable, I was bored out of my mind in this class. She writes her lectures out before class and then reads them, which isn't bad, but they just don't flow. She also has this cool German accent, but it means that unless you speak German and French, you're going to have no clue how to spell anything when she uses French and German words. And you don't get the slide lists until the class after the lecture, so you're not so sure which painting you're looking at. She jumps around, and shows about a gazillion images a class that you don't really need to know. I did learn things, and it wasn't the worst class I've ever taken, but I'd avoid it. \nWorkload:\nDefinately on the low end. A lot of reading that isn't necessary. Do the readings after the review sessions when the TAs narrow it down to the two important articles. They also tell you which slides to know, and its not that many. Midterm and Final, 2 short papers. \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "November 14, 2002",
            "review_content": "\nThis woman is incredibly knowledgeable and very active in the academic art history circles. I love having her as a professor -- the lectures are interesting and the readings are (with the exception of the Modernity/Modernism textbook) very appropriate, erudite, and engaging. Her assigned readings expect a lot from you, as they are often very specific academic studies, but the lectures are very easy to understand, even for those not versed in the Art History lexicon or familiar with the iconography of the time period. \nWorkload:\nThe reading is often more than you can actually complete, but the TAs will tell you during review time which ones you have to know. Images on the exam will be selected from a list given to you during the same review sessions. Two 6-page papers (one painting analysis, one comparison) midterm, final.\n"
        }
    ]
}