{
    "prof_info": [
        {
            "prof_name": "Ann Senghas",
            "prof_id": 531,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Developmental Psychology",
            "review_date": "January 19, 2017",
            "review_content": "\nI hated this class and thought Senghas was a terrible teacher. There's a lot of memorization, and it's all dry. I recommend taking it with someone else. I did quite poorly in the class and I worked incredibly hard. \nWorkload:\n3 tests- all multiple choice\ntextbook readings and article readings\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "May 16, 2016",
            "review_content": "\nDevelopmental Psychology with Professor Senghas was decent class, but nothing great...standard for Barnard Psych 1000 levels. Although I found the material for the first half of the class to be a bit dry, the sections on academic achievement, temperament, attachment, and gender development were super interesting and Professor Senghas supplemented those sections with great readings (it might be helpful to note that I was particularly interested in those topics though before taking the class though...)! Professor Senghas is clearly very interested in the material and has a lot of anecdotes to illustrate the concepts on the slides. I definitely think the course is worthwhile if you're trying to fulfill the science requirement or you're a psych major, but I wouldn't necessarily take it as a \"fun\" elective. \nIn terms of the exams, it's important to do the reading. She says it's the difference between an \"A\" and a \"B\" in the course. I'm not sure that's true - I didn't do all of the reading during the semester and I got an \"A,\" but I definitely looked through the chapters pretty thoroughly when studying for the exams. \nWorkload:\n2 midterms and a final exam. The multiple choice on the final were only from the last third of the course and the corresponding book chapters, but there was an essay question that was cumulative-ish.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "December 28, 2011",
            "review_content": "\nProfessor Senghas is not the most engaging lecturer, but she is very passionate about the material. The exams are pretty easy, read the textbook the day before and look over your notes. You don't have to take a lot of notes in class, is Professor Senghas posts her slides and doesn't have that much to add except for clarity to random words on her slides. Her personal research is really incredible and it was very interesting to read about it in the book and have her explain it in class. For a couple of the lectures, she brought in other Barnard psych professors who specialized in the area. That was really helpful because they could answer more specific questions from the students. This was a very interesting class, but if you need a class in the C group, I would recommend Social, which I took with Stroessner, because it is an absolutely incredible class, though this one is easier.\nWorkload:\nNot a lot at all. A few medium length chapters and articles per exam. 3 non-cumulative exams. Nothing else.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "January 16, 2011",
            "review_content": "\nI agree with most of the reviewers' comments here that Senghas is too caught up on minuscule details of the reading. I studied pretty hard for her 3 exams, and did not do very well on any of them. The second one was the hardest and afte she had given it to us she realized and made the third test slightly easier. That said, the material is extremely interesting and I don't regret taking this class at all to fulfill my psych requirement. Prof. Senghas has such a passion for what she is teaching. While some may be turned off by her outwardly gruff manner and her tendency to run a little late (please keep in mind she has a 2 1/2 year old child people!), her incredibly intelligence on the topics she teaches more than makes up for any of that. My family and friends are about at their wits' ends this winter break, because I won't shut up about all of the interesting things I learned in Developmental Psych (I'm a poli sci major).\n\nWorkload:\nThe lab is a joke, at least if you get Josh Davis as your lab teacher. I hated lab. It's one long group project all semester. But this review is about the lecture. There were 3 exams, mainly multiple choice, with some fill in the blank questions. You're not going to do as well as you think on the exams, so study hard. MAKE SURE YOU GO TO CLASS. If you don't go to lecture then you are NOT going to do as well, because the phrasing of a lot of her questions comes from her lecture notes. And read over the book closely. Not too much reading a week; Only about a chapter from the textbook and some articles.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "May 23, 2010",
            "review_content": "\nProfessor Senghas is a nice woman, but boy do her exams test on the most ridiculous of details. Some of her multiple choice questions are honestly impossible for the average human being. On the first and the last test, you will do fine, but the middle test, well, that will turn out interesting. Be sure to write down everything she says in class, as well as read the book and study from her lecture slides, if you memorize every single detail from all of the above, then you can manage that A you thought you'd get. \nAlso, unless its an emergency scenario, she does not respond to e-mails so don't even bother.\nWorkload:\nThe exams are about 60-70 multiple choice and some short answer questions at the end that will test some random details you probably didnt think were important. \n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "May 19, 2010",
            "review_content": "\nShe is probably the most disorganized and apathetic professor in the Psychology department.  The material presented in any Developmental Psychology course is not difficult, but Senghas manages to contort the information in a incoherent manner on her exams, and asks irrelevant questions about her own beliefs in the field that go against what is said in the textbook and other scientific journals.  She claims she doesn't believe in extra credit because it is \"unfair\", yet on the exams asks unrelated questions such as \"Where did Professor Senghas go to college?\" and \"Name 5 of the 7 Sister Schools\" for extra points.  \nDuring lecture she mainly reads from the powerpoints and all her answers to more in-depth questions from the students are: \"I don't know.\"  \nWorkload:\nJust 3 non-cumulative, incoherent exams.  No curve.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "June 04, 2005",
            "review_content": "\nVery nice professor, but her tests do pay attention to a lot of details. Her tests are all multiple choice with some short answer. She is very nice about meeting before exams. Though she does not give review sessions or let you have the midterm to study, she will make a great effort to meet with you if you have questions. One time, I met with her at 9pm before an exam to ask questions, and she was really nice about it. She specializes in language development and is studying Nicaraguan sign language, so this topic will probably pop up in class.\nWorkload:\nWeekly chapter readings. no hw. midterm and final. \n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "May 03, 2005",
            "review_content": "\nProfessor Senghas is a nice, smart lady but I got the feeling that she didn't actually know a lot of the material past what she put on her powerpoint slides. Most questions from the class resulted in her spending a few minutes to rephrase the question and then ending with \"But I don't know\". The previous reviews are also right about class participation - there will be lots of students discussing their cousins and sometimes even themselves, particularly when it comes to them wanting to verify their status as \"exceptions\" to the general framework we were learning. I learned a fair amount, but much of it was common sense. \nWorkload:\n2 midterms (very nitpicky multiple choices based on the book), final (same), attendence\n"
        },
        {
            "course_name": "Advanced Seminar in Language Development",
            "review_date": "March 03, 2004",
            "review_content": "\nShe's a gem.  Extremely bright and funny and always eager to help you understand.  I agree that she might humor the questions in Developmental a bit too much for a large lecture course (my brother's friend's niece does so and so, is that normal?) but she tries to keep things moving.  In her language seminar she's even better.  She really knows her stuff and does some of the most interesting and compelling research in the field.  Amazing.   \nWorkload:\n3 midterms.  Not bad if you study, though some found them overly detailed.\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "June 30, 2003",
            "review_content": "\nI had Professor Senghas for Intro, and I expected her Developmental class to be similar (as in, ahem, EASY.) It's not. While it's definitely not advanced physics, her tests are quite nit-picky, and you must remember tons of seemingly silly little details from the book and lectures in order to earn an A. However, it CAN be done, and this is how I did it: Read the book, highlight the important points, and go to class. This is not one of those courses that allows you to skim the text and get the notes from a friend, because Annie is majorly detail-oriented. Other than that, the class is quite pleasant; the material is fun and interesting, and besides the reading, there's no other work.\nWorkload:\nThree tests - the last one is partially cumulative. Memorize the damn book and you'll be fine (just kidding ... sort of ... )\n"
        },
        {
            "course_name": "Introduction to Developmental Psychology",
            "review_date": "July 10, 2002",
            "review_content": "\nProfessor Senghas is the best!! Although class conversations would sometimes go on a tangent, she always answered anything you asked! She was always willing to meet after class, and was so, so, so accomodating to her students' needs. She even made about 8 possible times we could make up tests for holidays! Her lectures were informative, clear, and well-organized. Only drawback was when she started using powerpoint for everything, so my notes were kind of non-existent for a month. But, it had its pros, because we knew that with the slides, we wouldn't be missing anything for the tests. \nWorkload:\nReading--about a chapter a week in a book filled more with glossy pictures of babies than with writing. 3 separate tests, and no final. Only problem: her tests are really, really nit-picky, so you really have to know even the most minute facts. But, even though they're detailed, they're definitely not hard.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "February 19, 2002",
            "review_content": "\nProfessor Senghas is the BEST! She makes things interesting by including lots of specific examples in her lectures. She is also always prepared, on time, and enthusiastic. I really liked that she was available outside of class if I had questions about any of the material. Get her to talk about her research on sign language! Anyone taking intro should definately try to take it with her, since I know (from experience) that other professors can make it extremely tedious.\nWorkload:\ntests weren't too bad-- i think there were three and they were all multiple choice and short answer.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "February 11, 2002",
            "review_content": "\nRepitition lectures from the readings. but she tries to keep it interesting w/ videos and slides and guest speaker. she is a pretty okay professor. nice and approachable. exams are slightly difficult if you don't study hard or don't read details within the readings. pay attention to the things she lectures on that's not in the book. it will end up on the exam. overall, an okay class.\nWorkload:\nexams on sections of book (4-5) & quizzes (1-2)\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "January 27, 2002",
            "review_content": "\nThough an expert in language acquisition and Nicaraguan sign language, Senghas unfortunately allows students a ridiculous amount of time to share their personal, irrelevant, annoying anecdotes with the class. Hoping to learn mainly from a solid professor, I ended up having to listen to people's random interjections about how old their nephews, nieces, & siblings were when they first started to roll over by themselves.\nWorkload:\nrelatively light. tests are straightforward multiple choice - three of them. No final. Questions can be a bit nit-picky, but overall not a huge problem.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 10, 2001",
            "review_content": "\nAnnie is the best! She is definitely one of the best teachers I have ever had. She cares so much about how much her students understand the information. Senghas is ALWAYS available to talk to, whether its about the class or anything else. Take her class whenever you can because she is SO amazing!\nWorkload:\nNot bad....4 tests (the final is partially cumulative), and a few quizes based exactly on the reading. Very managable, and she's VERY fair. If you go to class and do the reading you can easily get an A.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 04, 2001",
            "review_content": "\nProfessor Senghas attended Smith and MIT--so there's no doubt she's brainy--but she is a really down-to-earth, sweet, funny individual. She's also extremely friendly and wants to get to know you. I am a Barnard student, and one day after class we started chatting about our experiences at women's colleges, and before long we were laughing like two friends. The aspect of her teaching style that most appeals to me is her use of examples in the classroom - for example, when we were discussing visual perception, she showed us a bunch of really neat optical illusions on the overhead projector. She does a good job of making abstract psychological theories more understandable to her students. If you are at all interested in psychology, take this class.\nWorkload:\nQuizzes based solely on the reading material - most questions are pretty obvious and basic. She just wants to make sure you're actually reading. Tests are multiple choice/true-false/matching/essay + extra credit. She grades fairly. Other than that, you have to read about a chapter a week, participate in class discussions, and oh yeah, volunteer for five hours of experiments in the Barnard Psych Department. That last one is a pain in the ass, but all Intro Psych'ers have to go through it.\n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nProf Senghas works with kids and she oozes sweetness and warmth. She's just starting out and so occasionally she lectures straight from the book in a gentle voice that will put you straight to sleep. But she's got some fascinating research going on concerning deaf kids in Nicaraugua that she loves to talk about, so steer the conversation in that direction whenever possible. She's trying really hard, and she wants to be your friend.\nWorkload:\nIf you're lucky, you'll take both her intro and developmental class, like I did. Soooo much overlap. It's lovely. Reading not at all heavy and multiple choice/essay tests. Not a problem.\n"
        }
    ]
}