{
    "prof_info": [
        {
            "prof_name": "Xiaoxi Tai",
            "prof_id": 3356,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "January 23, 2009",
            "review_content": "\nI've had Tai Laoshi for both of my semesters last year in Elementary Chinese, and have her currently for Intermediate Chinese II. I learned a great amount last year, which, unfortunately, i attributed to the Nazi-like coursework that the department dumps upon your shoulders (this is a serious 5 credit course) that made me spend hours nightly memorizing characters for \"diarrhea\" and \"pillow\" (not the same chapters). In any case, unable to fit her class into my schedule for my Fall 08 semester, I took another class with another teacher. This is when i realized how great TaiLaoShi is. She's patient, fun, and never overcomplicates things (my fall 08 teacher would put practice questions up with words that we have never learned and never will). She's always perky (again, as opposed to my teacher who would sometimes whine about how tired she is-- hey, i'm tired too). As far as calling on people who are more comfortable with the language, you CAN raise your hand to answer questions and there are occasions when a student straight up does not try to keep up and sometimes a teacher has to realize this and move on keep the class going. I can hardly see how it would be hard to take in an  18 student class who are all capable of joking about a fictional Chinese character's long distance girlfriend or his stolen bike. Have fun in this class! no one's going to laugh at you for your sucky chinese, and if they do, it's all in jest. Unless you're those obnoxious pricks who think they know the entirety of the Chinese culture and wish to discuss this in class. You know who you are.\nWorkload:\nIntense, at least 2 quizzes per week, 4-5 exams/semester+ final + midterm oral + final oral presentation. Bright side, you'll be good at chinese by the end of the semester.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 26, 2008",
            "review_content": "\nAs other reviewers have said, Tai Laoshi is a nice, engaging teacher. She was generally helpful both in class and during her office hours, though there were a couple of times when she clearly got frustrated with certain students in our class when they were struggling. I haven't had any experience with other teachers in the department, but from what I hear, Tai Laoshi is among the best. She is pretty tolerant and helpful when it comes to mistakes (with the above exception), she is good about correcting tones, and her English is excellent. \nOne minor complaint about Tai Laoshi was her tendency to call more on those who had a greater mastery of Chinese, rather than on those who needed more practice. As a result, those who were more comfortable with the language got more practice in class and became even more comfortable with the language, while a few others were left quietly in the corners. And class time is 100% oral practice. All character work is done through homework. \nKeep in mind that while Chinese isn't necessarily more difficult than other language classes, it takes more time. When they say two to three hours a day, they really mean it. You can try to skate by with less, but once you fall behind, it's nearly impossible to catch up because the class moves pretty fast. \nWorkload:\nIt's a 5 credit Chinese Class\n-7 lessons\n-Pinyin Vocab Quiz the first day of each new lesson\n-Character Quiz near the end of each lesson\n-Memorization of a short Presentation for each lesson\n-Recording of dialogue for each lesson\n-Character sheets for each lesson\n-Homework exercises for each lesson (by far the most laborious part of each lesson and they often covered material we hadn't gone over in class before they were due)\n-1 mandatory 50 minute drill session per week\n-1 test every 2 lessons\n-Oral Midterm (very easy) \n-Oral Final (We had to write our own with up to 2 other people...3-5 minutes per person and a list of mandatory grammar structures)\n-Written Final (Mostly multiple Choice and English to Chinese Translation...multiple choice doesn't mean easy)\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "April 15, 2008",
            "review_content": "\n     Tai Laoshi is a sweet, young, engaging, and talented Chinese instructor. Her English is probably one of the best among the Elementary Chinese instructors, and her slight accent was endearing and no barrier to communication at all. She is able to explain vocabulary and grammar so that everyone understands. She talks with students outside class despite being very busy like all the Chinese instructors are. She was even nice enough to take us out to Chinatown (Joe's Shanghai) for delicious soup buns/dumplings towards the end of the term.\n     The grading is the same no matter which section you're in. It's extremely lenient (we're talking 0.1-0.5 points off for most mistakes on tests out of 100), so if you do all the work (there's a lot of it), it's an easy A.\n     I've had such a good experience with the Chinese department that I'm going to Beijing this summer for Columbia's Summer Language Program. I think I may get Tai Laoshi again for Intermediate Chinese during the summer, and I'm really excited to be in her class again.\n     You really can't go wrong with the Chinese department at Columbia, and Tai Laoshi is certainly no exception.\nWorkload:\n- standard workload for Chinese language classes (be warned: 5 credits)\n- a short vocabulary quiz and character quiz for each lesson (7 lessons total)\n- memorization of a medium-length presentation for each lesson\n- recording of each lesson's dialogue (easy)\n- character sheets for each lesson (somewhat tedious but helpful)\n- a test every two or so lessons\n- midterm and final oral exams + final written exam\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "January 06, 2008",
            "review_content": "\nTai Laoshi is great. She is understanding, likable and prepares a lot for every class. Everybody I know enjoyed her class a lot because she is so nice. She is a great teacher to introduce you to this very difficult language. \nWorkload:\nChinese is 5 credits, which is no joke. I thought the department was exaggerating, but it's entirely true, you have to be prepared to devote at least 2 hours everyday to this class. \n"
        }
    ]
}