{
    "prof_info": [
        {
            "prof_name": "Marco Maiuro",
            "prof_id": 4248,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 01, 2010",
            "review_content": "\nBy far, the greatest professor I've had in a liberal arts class at Columbia, period. He's like the Indiana Jones from Italy. He's both an archaeologist and an economic historian of the Roman Era. He rolls his own cigarettes and dresses a la Robert Langdon. He's friendly, extremely approachable and extremely smart and brilliant about all matters historical, logical, philosophical, archaeological, etc. One is truly surprised by the breadth of his knowledge and by the precision of detail he picks up or adds to the class. Marco makes the class exciting and entertaining because he values a diversity of opinions, despite retaining his own views. He never shoots anyone down, even if someone says something stupid, idiotic or shows that he clearly has not read the text. If you're shy, take this class. If you're talkative, take this class. If you're na engineer, take this class. If you're an economist, take this class. Its absolutely terrific the diversity of views he manages throughout the discussion. I had this class at 9 AM and I always made it. Even if you happen to miss a text (or two or three), the discussions are so comprehensive, you learn a lot. Additionally, each class begins with two rituals: I) An open forum on what our opinion of the text was, II) Each student has the opportunity to do a background in-class presentation that focuses on the author, the historical background/timeline and text and basically leads the discussion with questions. Its a great opportunity to seriously analyze a text and usually helps ones essays in conducting research.\nMarco is always willing to meet for office hours whenever, and he'll usually ask you to join him for an espresso or in rolling a cigarette at a local cafe or in Uris, (and he usually treats you as well). He's TOO much of an extremely fair grader and as long as you've established a line of communication, he's always willing to understand any absences, extensions in deadlines and more. (YES he offers the nicest one-week extensions ever). Marco always offers a side selection of texts, essays and books to read to enhance our reading experience as an option. Honestly, he isn't too caught up on grading and scores, as much as he is concerned with leading a strong discussion and learning new viewpoints. Just try not to come more than five minutes late/habitually, chit-chatting in the back of the classroom or chew gum obnoxiously. He sees that as disrespectful.\nI got an A, and found this class delightful. I'm only disappointed that he's not teaching the course next semester because of a scheduling conflict.\n\nWorkload:\nAside from the reading load, he assigns four 2-page response papers per semester on whatever text you'd like, whenever you'd like.\nIn class presentation on philosopher, your choice.\nThere are two papers, on whatever topic you'd like although he always offers assignment topics.\nA midterm, which involves 2 or 3 long-response questions and about 10 ID's. (Very manageable)\n"
        },
        {
            "course_name": "The Romans and their Empire, 754 BC to 565 AD",
            "review_date": "June 26, 2009",
            "review_content": "\nEven as I write this, I have extremely mixed opinions about this course.  The lectures are bland at best.  Professor Maiuro stumbles on and on in his limited English, leaving the class in a stupor.  He reads directly off his powerpoints, which, while bullet-pointed, very often simply amount to a full paragraph of block text per page.  The second half of the course is organized by concept instead of chronologically--this may sound like a good idea, but it's a nightmare later on to try to piece the historical events in order.  I don't recommend not going to lecture, however, since fairly often a concept or a person only briefly touched upon in lecture and never really mentioned in the notes appears in the ID section of an exam.  \nSpeaking of which, there are four \"exams\" in this course-- the midterm, two quizzes, and the final.  The quizzes are IDs and the midterm and final are IDs and essay questions.  More than anything, you have to know the ancient sources to do well on these essay questions.  You don't necessarily have to memorize quotes, but you have to name-drop ancient authors and their works throughout the essays in order to get a good grade.  In other words, it's very difficult to cram for the essays.  Plan out your studying accordingly and you should be fine.\nI don't want you to get the idea that Professor Maiuro is a bad professor.  He's a bad lecturer, but an incredible man.  Talk to him before/after class, during office hours, when he drops by recitation, etc.  He is actually very approachable, much more knowledgeable than he lets on in lecture, and has quite a sense of humor when he's not bound by a powerpoint.  Overall, I think I would recommend this course, not for the material, but because it's a chance to get to know a great man.\nWorkload:\nA ton of reading if you actually bother to do it all.  In reality, you can actually get away with doing none.  The textbooks will, however, be useful when preparing ancient sources for exam essays.  No paper, which is almost unbelievable in a history class.  2 quizzes (20 IDs choose 10 or something along those lines), midterm (IDs, one essay), and final (IDs, emperor IDs, 5 essays choose 3).  Recitation required.  Overall, light for a history class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 15, 2009",
            "review_content": "\nHe makes a bad first impression...do not be turned away!! Although the first day of class is painfully quiet and awkward, Professor Maiuro is a GREAT for some key reasons.   CC has been one of my favorite classes and Maiuro is one of the best professor's I've had.\n1. He sincerely enjoys and is interested in every book you read in CC, and he has an immense breadth of knowledge about each of the topics.  His has a huge amount of enthusiasm every class, even when all the students are still asleep at 9am.\n2.  He  wants you to learn in your own way. He's the type of prof who really promotes the things you do well and doesn't dwell on things you do wrong.  If you show him that you are thinking and you have read he's super supportive.  He doesn't want people to worry about grades in CC, it's more about the experience.  He mainly wants you to learn about philosophy and yourself through the course, in whatever way is appropriate for you. He's open to every opinion and view point.\n3.  He's totally interested in your opinions about how to run the course.  Every semester he asks if the course format should be changed and there is an open forum to propose ideas and then it is decided as a class.\nBasically, if you are someone who reads the material and participates in class then his style is awesome.  If you are really quiet and don't feel comfortable speaking in front of the class then it will not be such a great experience because he is really into getting everyone to at least give some opinion.  He is known to call on people who never speak randomly, and is obviously disappointed when they have nothing to say.\nHe's a generous grader if he can tell you've put thought into your work.\nWorkload:\n2nd semester we have 4 snapshot analyses, 1 major essay at the end of the course with open topic, and one presentation on an author/lead the class discussion for a day.\nMidterm and Final are open notes--easy (no essay questions, just passage identification and analysis). \n"
        }
    ]
}