{
    "prof_info": [
        {
            "prof_name": "Hiie Saumaa",
            "prof_id": 9555,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2016",
            "review_content": "\nHiie was the best!!! I'm SO glad I had her for LitHum. The workload in her class was reasonable. It was a bit lighter than most LitHum courses, but certainly not a joke. She was so caring about her students and truly wanted to see everyone succeed. The class was heavily discussion based, which in my opinion is how LitHum is meant to be. She is so sweet, gives ample feedback on assignments, and responds to emails in a timely manner. She will give you an extension if you need it. She sometimes takes a while to give back grades on group assignments, but it's not a big deal because everyone does well on those anyway. Highly recommend this class!!!\nWorkload:\nmoderate\nlots of reading (duh it's lithum)\n1-3 reading quizzes per semester\n2 essays per semester\nmidterm/finals\noccasional reading responses\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 15, 2015",
            "review_content": "\nTL;dr : Bad teacher, nice person, easy to moderate workload, average grader.\nShe has no idea how to lead a discussion. We talk in very vague terms about themes, with no close reading and little guidance from Hiie.\nWorkload:\nStandard for lit Hum.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 14, 2015",
            "review_content": "\nSo, so glad I had Hiie. She actually cares about the students and gave us a break: when we had a project due in her class, she gave us extra time on papers, easy days during midterms. I felt completely prepared for exams after taking her class. Classes are fun, she breaks it up so it doesn't feel so long. We might divide into groups and each group would explore a theme and then present to the class. We write in wisdom books during class sometimes, reflecting on the way the books relate to our life. It's a nice way to start class. It never felt like too much work, actually learned the material, discussions were productive and well led, hands down my favorite class.\nWorkload:\n3 papers (2 pages passage analysis, 3-4 pages comparative literary analysis, 5 pages comparative literary analysis)\nquizzes, in class responses, out of class responses maybe 5 total\npresentation on one of the texts with a partner\nNewsletter project- a multimedia project in a group of 4, has to relate to the course, but free reign other than that\nreading the Lit Hum texts (obv)\nMidterm and Final... passage ids, pick 4/5 or 5/10, passage analysis essay, literary theme analysis essay. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 01, 2011",
            "review_content": "\nBest UW teacher out there, without a doubt. Super lenient in terms of assignments. Many people in my class would forget to do a reading response and it would barely bother her. Although, if you do them, it's a sure way for her to like you. Participation is completely optional. I think I may have spoken twice all semester. She provides really helpful comments on our essay drafts and is also very willing to give extensions. She's also a really easy grader which is certainly a plus. Basically I loved Hiie and if you can manage to roll yourself out of bed for a 9 am class, you should most definitely fight for a spot in her section! It's worth it!\nWorkload:\nVery light. Readings twice a week. Short (1 page) reading responses on about half of the readings. (a lot of people didn't even do them). \n4 essays. Vary in length. Easily graded. She gave the entire class A's on the reflective paper.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 22, 2011",
            "review_content": "\nAn amazing UW teacher. As said, really caring about her students. She puts emphasis on the thought process and how hard you are trying, and encourages students to get out of their comfort zone. It was really a joy to experiment with my writing and not fear penalization. My class was a little too quiet so she ended up rambling on sometimes, but listening to her rambling was pretty entertaining and sometimes enlightening. A great UW experience! I loved the class with her.\nWorkload:\nthe standard essays for UW, though the drafts were not graded (though towards the end of the semester she suggested she might)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 02, 2011",
            "review_content": "\nShe is so nice. Awesome teacher with really nice life lessons. Understanding and caring about her students and she understands that students' lives can be stressful and hard to manage and gives a lot of leeway for essays. She is one of those educators who care about students getting better at writing by being fair and nice rather than difficult and uncaring. \nIf you see her on the course lists please take her! you will not regret it.\nWorkload:\nsame as any UW course yet less assignments in between essays.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 18, 2011",
            "review_content": "\nHiie is a great teacher. Very energetic and relatively easy grader. Her UW class was awesome. She is very lenient on deadlines, responds quickly to emails, and is very open if you need extra help on your paper. She is not too demanding and also does not get worked up if you show up a few minutes late. The syllabus said you can only have 3 absences, but there were like 5 people in my class with at least 7-8 already, so I'm not sure how strict that policy is. However, I'd show up no matter what. It's a relatively short class and you don't really have to participate if you don't want to... I asked for a few extensions on my papers and she gave them to me without asking questions. I'm sure there isn't a nicer or easier UW teacher out there.Just do the work she assigns, show up to the 9am class and write decent papers = A-/A\nWorkload:\nVery light. Maybe one short assignment a week and 4 Papers. (2 1500 words, 1 2500 words, and one 1200 words)\n"
        }
    ]
}