{
    "prof_info": [
        {
            "prof_name": "Asifa Malik",
            "prof_id": 1754,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2008",
            "review_content": "\nLitHum with Asifa is boring.\nAt first I thought it was my fault - and to a rather large degree it was - because I didn't really read all of the material, and didn't really pay attention to the class. But having had CC with a great teacher this semester, I realize that LitHum was boring for me not only because I fail as a student, but also because Asifa kind of fails at teaching. I didn't read all of the books this time either, but my CC teacher engages all of us with his strong and interesting opinions on the material that we were supposed to read but didn't - most students in my class don't really read, but we still always have a super-interesting time in class. But I'm not reviewing my CC teacher so...\nThe problem with Asifa is that she doesn't provide enough structure to the discussion. As a result, discussions ALWAYS (100% of the time, no exceptions whatsoever, at all) degenerate into a crapfest of repeating what the person before you said in a slightly different wording because you don't have anything good to say yet don't want to get shafted on your participation grade. Oh, and Asifa never has any opinions on any significant ideas presented in the texts - ever. She will occasionally interject to inform us of interesting trivia that has nothing to do with anything that we are supposed to be learning from the Core Curriculum, which, in my opinion, is itself kind of pointless... honestly, the Core seems to be designed for the purpose of filling us with vague and superficial knowledge of literary subjects so that 30 years later we can impress high-society snobs (who pretend to care about literature because that is what high-society snobs do) at cocktail parties with our seemingly impressive but ultimately superficial literary cultivation. But anyways, Asifa can't even seem to do this, and this is not because she lacks the requisite knowledge - I'm sure she knows a buttload more about the LitHum subject material than many of us will ever know - but it's because she chooses not to, or is incapable of, reigning in the class so that we get a good old dictatorial lecture that actually has some substance instead of a democratic (keep in mind what Plato says of a democratic education - IT'S BAD!) forum of unchecked idiocy.\nThat being said, she is a nice person.\nWorkload:\n2 papers, 1 midterm, 1 final. Weekly posting on Courseworks in which you share your thoughts on what you read that week for LitHum (which is unsurprisingly also filled with complete BS most of the time).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 01, 2007",
            "review_content": "\nAsifa does not teach an exciting class.  At all.  She keeps discussions vaguely focused, but chooses not to contribute at all even when no one has anything to say.  As far as midterm goes, she does choose to follow the format of the final, which not all professors do.  However, in my opinion she chooses very difficult IDs and obscure essay questions, making the midterm more difficult than the final to come. She provides real, comprehensive feedback on papers during the drafting stages, so draft, draft draft! However, her input regarding explanations for grades is lacking- she provides a page of comments and a grade, but the link between comments and grade is often tenuous, or non existant.\nAs a whole, Asifa was a decent lit hum teacher. The class was not riveting, but did cover all the material it was supposed to at a reasonable pace.\nWorkload:\n2-3 papers (at least one 5-6 page and one 8-10 page), midterm, final, one courseworks posting per week, one presentation per semester, lots of reading per week\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 25, 2007",
            "review_content": "\nI think the review of Asifa from second semester is quite unfair. Asifa knows that having class 6-8 PM (which we did) is a complete drag and that every student does not want to be there, so she tries to do things that will get people's attention and/or not bore them (and she encourages bringing food, which keeps people interested). That being said I think Asifa is a good teacher although sometimes she will pull out completely random themes in the book and leave the whole class clueless but she will explain them in such a way so that you will understand them. She allows for plenty of discussion and is very fair concerning assignments, grading and participation. The workload was no different (and in fact probably easier) than most other LitHum classes and Asifa is understanding about the large amount of other work students normally have since she herself is a student. If you meet with her to discuss your papers (good idea) you will get to see that she's a really nice person who wants her students to enjoy the books as much as she does. \nWorkload:\n2-3 papers a semester, weekly postings on courseworks, one presentation per semester, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 05, 2007",
            "review_content": "\nshe's pretty much awful.  nice person, but crappy professor, inadequate grasp of the thematic concepts running through the texts.  when we read confessions, we went through each chapter and outlined plot points on the board.  there was also hamlet read standing on a table.  it's your high school english class, but worse.  sit back and listen to the giggling over every homoerotic reference in the aeneid and listen to asifa explain that it's really all oedipal.  this class makes me really hate this university sometimes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2006",
            "review_content": "\nThough Asifa may seem timid and may seem to have a lack of control in some conversations of class, she is good at directing discussion toward relevant points in the class and allowing the students to speak what they think needs to be spoken. She is always helpful and available if you need help on papers (which I HIGHLY advise you take advantage of), and, though she's quiet, she's alright. The class won't be exciting, but it'll be informative.\nWorkload:\nA bit of work. Postings on Courseworks, 2 papers (one 5-6 page, one 8-10 page), midterm, final, and one presentation from each student (easy)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 07, 2004",
            "review_content": "\nI'm disturbed by the fact that students at this university would blame their lack of participation in a class on a teacher.  Obviously, as a previous reviewer pointed out, you will not get a good grade if you sleep through the class.  Then, the class will be a joke, but the joke will be on you.\nThat being said, you can get a lot out of Asifa's class.  She is a sweet and understanding woman, and she really does know how to write and teach.  In exchange for sharing this with you, she expects that you will participate and be respectful, but that's not out of the ordinary. If you pay attention and work hard, you will emerge a better writer, and you will probably get an A.\nWorkload:\nStandard for University Writing, with all associated reading, papers, etc.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 14, 2004",
            "review_content": "\nI completely disagree with the previous review (What kind of person expects to get an easy A in any class, especially when they sleep through them?). The class was extremely helpful for developing my reading, writing, and research skills, thanks to the instructorÂ´s thorough comments and frequent encouragement, especially in the very difficult but rewarding research project. All in all, AsifaÂ´s a good instructor and Ã\u008dÂ´d recommend her class to any one who really wants to learn how to write a research paper.\nWorkload:\nStandard\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 31, 2003",
            "review_content": "\nBasically she was awful. Granted I did have her the first semester she taught but isn't L and R (or University Writing) supposed to be an automatic A?..not for her! I think I slept through 90 percent of the classes and although all your friends will say L and R is a joke her class really is.\n"
        }
    ]
}