{
    "prof_info": [
        {
            "prof_name": "Siobhan Burke",
            "prof_id": 13574,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Dance Criticism",
            "review_date": "May 15, 2021",
            "review_content": "\nAlthough I had to take this course remotely, I really enjoyed it. I learned a lot about different facets of the dance criticism industry, the process of dance criticism, and a different point of view for viewing and analyzing dance. The class was very process-oriented, allowing for us to re-write reviews to improve and emphasizing the development of the skills and perspective necessary to be a good critic. The readings for the class were really fascinating, as were the discussions that we had. I also really enjoyed the opportunities for creativity and exploration within the reviews and the final project. For my final, I got to create a 20-minute podcast and I was very proud of the product and felt like it showcased my improvement over the term. Professor Burke is wonderful! She is very organized and great at communicating. You can also tell that she cares about her students, as evidenced by the fair grading, insightful feedback, and how available she makes herself to students. We had two different sets of one on one conferences with her, in addition to her having office hours every week and being very responsive to emails. Overall, I thought that this was a great class, and I definitely recommend it for a dance elective.\nWorkload:\n1 compare/contrast paper of two different reviews (10%), 3 reviews that range from 500-1000 words and come with some more creative prompt options (15% each, 45% total), weekly discussion posts (15%), participation (15%, includes attendance, discussion participation, and 5% for facilitating one discussion), and a final project, which in the pandemic, was to explore audio/visual criticism either through a 6-8 page paper or through creating an audio or visual review (15%)\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "June 04, 2018",
            "review_content": "\nThis class is exactly as advertised. There are ~10 performances which every student must attend. The performances vary wildly each semester, so you can't really ask your friends what they saw and use it as reference. Usually there is one Broadway show late in the semester, and every class goes to see Movement Research at Judson Church. Some of the performances are free, and for sometimes the dance department sells extra discounted tickets to students, so you can bring your friends who are not in the course. \nWith Siobhan, most of the class time was devoted to seminar-style discussion, instead of lecturing. We also had the chance to speak to several artists as guest speakers. Siobhan was a smart, understanding professor who contributed to discussions and made students feel heard. She provided useful feedback on our ideas and writing style. I learned a lot form this course. \nWorkload:\nThe performances are by far the most time consuming part of the course. A few of them are in Brooklyn, and some of them are very long. Often there is a choice of two dates to view a performance, but it's not very flexible. Other than that, students had to write 3 short papers (3-5 pages), do a short final group presentation (10 mins, groups of 3), and write a final paper (6-8 pages). My only complaint about the workload is that we were not given adequate warning about the final paper, which made it hard to plan for during finals week. \n"
        }
    ]
}