{
    "prof_info": [
        {
            "prof_name": "Richard Longman",
            "prof_id": 4498,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Introduction to Control Theory",
            "review_date": "October 23, 2012",
            "review_content": "\nOne of the worst classes I took at columbia.  Absolutely no application of the theory was taught, save for the \"robot arm\" example that the professor used exclusively and repeatedly.  Classes were long and boring, and the professor wasted time fiddling with the digital board EVERY week with the same issues and bad jokes.  Ridiculous, considering that the guy teaches control theory and feedback.  Basically, if your math is good, you'll be fine in the course (with a lot of studying), but don't expect to learn how to apply the theory at all.\nWorkload:\nfair.\n"
        },
        {
            "course_name": "Introduction to Control Theory",
            "review_date": "December 27, 2011",
            "review_content": "\nThis class starts out quite easy, with basic ODE review. The first few homeworks and the first test are over this easy material. The material gets a bit tougher after the first test (the average on the 1st midterm was 88%, 2nd midterm was around 50%, and the average on the third midterm was around 40%). The third midterm is literally four days before the final exam. Longman gives a series of handouts which are quite helpful near the beginning of the class, but become less useful near the end. The final exam is surprisingly fair, particularly in comparison to the previous midterm. On a few sections (such as root locus diagrams) the textbook is pretty helpful. For most of the other material, though, the textbook is quite unhelpful. It has a drastic lack of solved problems. However, you should still get the textbook because you'll do better with it, and it can be had cheap on the internet/international edition. You must take careful notes if you want to do well in this class. \nWorkload:\nWeekly problem sets, which start out very easy but become really, really time consuming by the end of the semester. Find someone who took the class last year and get their HW solutions.\nThree poorly spaced midterms, the last of which happens mere days before the final.\n1 final exam, not too bad, with a heavy emphasis on state variable models\n"
        },
        {
            "course_name": "Introduction to Robotics",
            "review_date": "May 31, 2011",
            "review_content": "\nI was fooled (FOOLED I TELL YA) by the awesomeness implied by the course title and by the course description. Less than 20% of the subject material covered even mentioned the word \"robot.\" Everything was extremely theoretical and mathematical, and most of the time we were just solving linear algebra problems or feedback problems without understanding how it pertained to robotics. I did fine in the class, got my A, and understood absolutely everything - all the math and theory was fine - except I would have no idea how to apply any of it to robotics. \nAlso, class is from 6:10-9:20 on Tuesday nights and Longman is very very disorganized and boring. However, the book is horrible and he never uses it, so you have to go to lecture. If you don't understand something in lecture, you will not be able to find it somewhere else. \nWorkload:\n7 problem sets for 10% of the grade - some were very easy, others were more difficult, but all were time consuming (mostly due to how cumbersome linear algebra can be). \nOne midterm and one final, each worth 45% - very fair and I would even claim easy if you understand all the homeworks. it is VERY important that you can do EVERY problem in EVERY homework comfortably, without missing anything. He can repeat questions and he might only change a constant or something, so as long as you understand the homeworks, you should be ok. However, if you mess up even a little bit, he can take off a lot of points, which may cost you since the mean is normally high due to the majority of the students being grad students. \n"
        },
        {
            "course_name": "Introduction to Control Theory",
            "review_date": "January 11, 2010",
            "review_content": "\nLongman is a decent guy. He's Just EXTREMLY disorganized. He doesn't know how to present material and often forgets what he has to teach for the exams. That said he does actually care about his students and wants them to do well. His Homeworks take a while but wease up at the end of the semester in terms of difficulty. Personally The book is far more helpful than his lectures because the book actually organizes material. Don' be fooled the course is a math course - there is little to no engineering involved. His grading is pretty fair, but you have to stay on top of the material in the course. If you've forgotten your DIFF eq and linear algebra don't take the course. His claim that he will go over all the math you need to know is absolutely false. \nIt's a fair course, but you need to spend a lot of time organizing the material for yourself. He will throw a curveball here and there that wasn't on the homework so know the examples he does in class inside and out. I will say this if you have a bad attention span dont' take the course his lectures are long and boooring.The course could be amazing but Longman has a long way to go in refining his presentation of the material. \n\nWorkload:\nFirst two homeworks were brutal the middle 2 were ok the last two were easy - exams are a bit tricky, but if you know the homeworks and the examples he gives in class you should do well. \n"
        },
        {
            "course_name": "Introduction to Control Theory",
            "review_date": "December 29, 2009",
            "review_content": "\nThis class was interesting. It was very late in the evening which made it rather difficult to concentrate sometimes. The professor liked to take nice long (~25 minute) breaks which made it easier to pay attention. Also, in place of a normal blackboard there was one of those newfangled digital ones which also wasted many minutes each week.\nPros: Professor Longman is a good guy. The workload isn't very heavy.  \nCons: We spent hours going over undergraduate linear algebra and differential equations. The subject isn't hard, what's hard is figuring out what he wants you to write on the test and the homeworks. The book is terrible. \nOverall, I found the course to be a non-rigorous treatment of some very easy concepts.  \n\nWorkload:\naround 6 problem sets (very easy) for %10 of the grade. 1 midterm and 1 final (not difficult).\n"
        }
    ]
}