{
    "prof_info": [
        {
            "prof_name": "Brian Gibney",
            "prof_id": 2489,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Inorganic Chemistry",
            "review_date": "January 14, 2007",
            "review_content": "\nI took this course two years ago and am only reviewing Gibney now because I was browsing gold nugget professors and couldn't believe that Gibney made the list.  Not that he's a bad professor -- but gold nugget?  Please...\nBrian Gibney does teach well, in that his lectures are clear, he's very approachable, and I believe that he wants people to learn the material.  However, the stunning accolades he's received this far are, in my opinion, quite overdone.  Gibney is a sarcastic fellow.  He likes to make jokes, but as innocuous as they may seem, at times one will see that his \"jokes\" are a little too close to reality, and that he's being rather abnoxious.  On  a less personal level, his class isn't very well tied together.  He sort of jumps around from topic to topic, but between sections of the class he does a poor job of tying things together.  Sure, some of the topics might seem disjoint, but I saw many connections that he never brought up, and that did not help make a cohesive class.  Overall, Gibney was a good teacher, but he has his flaws, so don't go into the class expecting something amazing and perfect.  I do believe it's better than the Barnard class (this is science, so I mean, duhhh), and you can definitely be confident that you won't have a bad experience.  It will most likely open your eyes to new, exciting things in chemistry.  But it might also leave you feeling slightly unfullfilled (like it did to me), due to the lack of cohesiveness in the class.\nGo to class, take good notes, don't hesitate to ask questions, and get sleep before exams.  You should be fine.\nWorkload:\nWhen I took it, basically nothing.  There were problem sets that you didn't have to hand in that we later received answers for.  Two midterms and a final (non cumulative), all equally weighted, \n"
        },
        {
            "course_name": "Inorganic Chemistry",
            "review_date": "May 16, 2006",
            "review_content": "\nProf. Gibney is a great teacher. He is enthusiastic, he enjoys teaching undergrads, and he wants you to do well.  I enjoyed the class for several reasons. \nIn the first place, I enjoyed the material; inorganic chemistry is less about specific reactions than organic, and is more about concepts.  You learn a lot ofmaterial that can be applied to other chem classes; for example, in the first part of the semester you learn about molecular orbital diagrams from a symmetry standpoint, which has been the most comprehensive explanation I've been given.  \nIn the second place, Gibney makes students read articles from scientific journals.  It is a very important skill to have, and most of the articles he has us read are pretty foundational (like Mendeleev's periodic table and a chronicle of olefin metathesis by Grubbs).\nIn the third place, the tests are challenging but fair.  He asks at least one question on each exam that goes a step beyond what was discussed in class, although it is not a question that is unsolvable with knowledge gained in the class. As a bit of a side-note, Gibney grades all tests within 6 hours (including the final), so you don't have to spend the next two weeks in dread.\nThat's pretty much it. Take his class.\nWorkload:\n3 exams equally weighted (one is the final, although it's not cumulative). A bunch of journal articles (8 or 9), and some problem sets (ungraded but useful).\n"
        },
        {
            "course_name": "Inorganic Chemistry",
            "review_date": "November 12, 2005",
            "review_content": "\nGibney is the best chemistry professor at Columbia (this from someone who's taken A LOT of chemistry).  His lectures were by far the most clear - he has a way of explaining things that make everything in chemistry just seem easy and sensible.\nGibney is always available outside of class - with our year, he frequently stayed up to 2am with us on the 7th floor of Havemeyer, answering questions.  He came to a lot of the TA recitations just so he could help people individually.\nOutside of that, Gibney's just a nice guy - brought us donuts to the final, loves to chat about non-chemistry, very approachable.\nWorkload:\nProblem sets you don't turn in (but DO THEM!) 3 pretty difficult exams which are weighted equally.  (Very similar to the homework questions)\n"
        },
        {
            "course_name": "Inorganic Chemistry",
            "review_date": "November 12, 2005",
            "review_content": "\nGibney is the best chemistry professor at Columbia (this from someone who's taken A LOT of chemistry).  His lectures were by far the most clear - he has a way of explaining things that make everything in chemistry just seem easy and sensible.\nGibney is always available outside of class - with our year, he frequently stayed up to 2am with us on the 7th floor of Havemeyer, answering questions.  He came to a lot of the TA recitations just so he could help people individually.\nOutside of that, Gibney's just a nice guy - brought us donuts to the final, loves to chat about non-chemistry, very approachable.\nWorkload:\nProblem sets you don't turn in (but DO THEM!) 3 pretty difficult exams which are weighted equally.  (Very similar to the homework questions)\n"
        },
        {
            "course_name": "3071- Inorganic Chemistry",
            "review_date": "April 17, 2005",
            "review_content": "\nTruly one of the best profs i have had in the department, and definitely the most approachable! He truly cares about his students, and loves looking at our puzzled little faces as he tells us chemistry as we knew it in high school is A LIE!! Lectures are interesting, and it is easy to fall behind, but not hard to catch up either, if you 've got the chemist in you... Once i emailed him to ask a small question, and ended up going to his office and staying there for over 5 hours-- and it felt like minutes! He (and i) love chemistry, and he will most definitely fulfill your every curiosity in a very excited way! I loved this class so much. Highly recommended :-)\nWorkload:\n3 exams, equally weighted. Mean was LOW on the 1st, went up from there quite a bit. Exams are hard, but in a fun way. About 7 problem sets also, but not graded. And 10 primary literature papers, 1 q on the exam is always about one of them.\n"
        }
    ]
}