{
    "prof_info": [
        {
            "prof_name": "Marina Budhos",
            "prof_id": 1047,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style II",
            "review_date": "November 13, 2003",
            "review_content": "\nI really regret taking Marina's class. She spent more than an hour of the weekly class session babbling about one of her favorite short stories (which usually weren't liked at all by the class). Then, when we finally started discussing our own material, she preferred to nitpick  and avoid commenting on the meat of a piece. S&SII; could be a valuable opportunity to fine-tune one's skills, but Marina's class was without a doubt the LOW POINT of my Columbia writing program experience. Only recommended to teen magazine writers.\n"
        },
        {
            "course_name": "S&SII;",
            "review_date": "September 01, 2003",
            "review_content": "\nGreat person but doesn't do much to improve your writing.  She's too gentle and understanding to be critical of someone's writing.  This 'all's good' rubs off on the other students as well, so the workshop turns into a feel good praise session. Ofcourse, none of this encourages good writing, so I'd have to say that as much as I liked Marina, the course did very little to improve my writing.  \n"
        },
        {
            "course_name": "S&SII;",
            "review_date": "December 20, 2002",
            "review_content": "\nmore than often, she gives decent critiques. but, she definitely likes the more predictable, sappy writers (emotional poets will like her) and has a tendency to be redundant and overexplain herself. doesn't like abstract endings (or writers)...spent six weeks on fiction and then crammed the dramatic sequence into 2 or 3 weeks at the end of the semester (we had class during study week to make up for the first day of class, which SHE missed). \nnice lady, pretty unexciting, reasonable grader.\nWorkload:\n3 or 4 poems, short story, 2 dramatic scenes (at 3 pages or so each)\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "May 13, 2002",
            "review_content": "\nI didn't really like this class. There was a lot of structure, not much style, and i feel like she definitely had her favorites. I have a horrible premonition that she's going to give me a crappy grade. she claimed that a B+ is for very good work. i get the feeling i wasn't \"very good\" this semester. \nWorkload:\nbunch of little assignments that you never use for anything in particular, few poems, one longer poem, short story, scene\n"
        },
        {
            "course_name": "S&SII;",
            "review_date": "April 28, 2002",
            "review_content": "\nGives good advice, although sometimes fails to connect with a piece of work, and may miss the point. Tolerates foolish / ridiculous commentary by students. Pleasant.\nWorkload:\nMore reading and writing than S&SI;, seems to be a kind of tough grader. \n"
        }
    ]
}