{
    "prof_info": [
        {
            "prof_name": "Walter Bock",
            "prof_id": 1122,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Animal Structure and Function",
            "review_date": "January 10, 2009",
            "review_content": "\nThe Reviewer below is essentially correct for the 08 Class, except I truly think they're too kind.  \nThis class was an absolute horrific excuse for a Columbia Course.  I've since a better dissection class at a local college in Ohio... while actually learning the subjects that were meant to be the purview of this class.  \nNo additional Comments.  People who like wasting time should sign up.  \n"
        },
        {
            "course_name": "Introduction to Animal Structure and Function",
            "review_date": "August 29, 2008",
            "review_content": "\nThis was definitely not an intro course. I had a very unpleasant experience with professor Bock and everyone I talked to felt the same.  With all due respect, he probably should have retired years ago.  Bock sat at a desk and talked at the class in a VERY unorganized way.  The diagrams on the board were painfully messy and imprecise.  When asked to clarify them, Bock could not explain them and just said to look elsewhere, which of course made no difference.  Don't even bother asking a question about the material because you will still be confused and frustrated as we often were.\nI wouldn't buy the textbook.  It was not helpful or relevant to the lecture.\nThe lab portion was decent and much more interesting.  It was individualized and personally-paced. It was solely run by the TAs who did not help or answer questions.  I often left feeling drained and unaccomplished.\nWorkload:\nAn overwhelming amount of reading material and preparation necessary for the two lecture midterms and final.  There was also much to know for the lab midterm and non-cumulative final, both of which were practicals.\n"
        },
        {
            "course_name": "Introduction to Evolutionary Biology",
            "review_date": "May 25, 2007",
            "review_content": "\n   The class is completely repetitive everyday. Pretty much the same materials are discussed in class and prof bock doesn't care that he talks about the same thing in every lecture. I took this class because previous commenters said that he is an easy grader and the materials are easy. I ended up reading numerous articles by bock that range up to 50 pages per article. He is by no means a hard grader; he likes to give everyone above B- but only a few will get A or A-. If you are going to take this class to get a good grade (B+ and above), don't take this class. His style of lecture and materials covered in class is neither useful nor interesting. You will be stuck with the same stuff for the whole semester without a good grade to show for (unless you really put lots of effort to read every article and go to his office hours regularly). Exams from previous years are given as practice tests but there are no answers. Unless you are planning on memorizing 100+ questions, it's pretty much useless in the actual exam (although some questions are very similar to past exams). BE AWARE that THERE IS NO CURVE IN THIS CLASS AS THE AVERAGE IS ABOVE 80 in exmas (1 midterm and 1 final). Overall, I walked out with an A-(95/100 in the midterm and 290/300 in the final; I thought I was going to get A but prof bock surprised me) but I know most people ended up with B/B- with fair amount of effort.\nWorkload:\n1 midterm and 1 final. 8-12 \"optional\" articles he wrote (very very verbose and convoluted) with each article ranging from 10 pages to 60 pages. You must read them for a midterm and a final. More work than you think... Grading is somewhat arbitrary (unlike other science class) because he does not like to talk about grade and there is no curve.\n"
        },
        {
            "course_name": "Introduction to Evolutionary Biology",
            "review_date": "April 03, 2006",
            "review_content": "\nA course for the truly unmotivated.  Professor Bock's lectures are at best coherent and at worst, utterly painful repetitions of the same thing he has been saying since the first day of class.  You essentially learn about ten terms and the word Archeoptryx.  Grading is generous and readings are wholly unnecessary.  Attendance is semi-\nimportant since there were about 9 people in the course my semester, so he may not know that YOU were absent (he seems to forget a lot, especially people's names) but he'll notice if there are only 3 people in class on a specific day and he will complain.  Overall, tedious but a guaranteed good grade, unless you really mess things up.  \nWorkload:\nTake home midterm and final (REALLY easy and based on his readings)\n"
        },
        {
            "course_name": "Introduction to Evolutionary Biology",
            "review_date": "May 20, 2004",
            "review_content": "\nThis was probably the most useless class I've taken in college, and the most disappointing. It could have considered the battles between evolutionists and creationists, or the damage that descending from monkeys may or may not do to humans' pride of place, or whatever. Instead, the class was more or less Professor Bock defending evolutionary biology and his own work from Karl Popper and anyone else who says it's not a real science. He delivered essentially the same lecture every week and dredged up the same examples over and over again (turkey vultures aren't real vultures!). I stuck with the class until after the drop date because I kept hoping something would change and, I'll admit, because I was tempted by the idea of a 4 point class whose entire workload is 15 pages of writing. At least the reading, especially Mayr's books, is generally interesting. It doesn't really matter if you do it though, since Prof. Bock barely seemed to read the midterm paper. I got about 20 words of comments on mine, and everyone got some variety of B. The final paper was officially more ambitious but blatantly asked you to repeat what he had said over the course of the term, to the point where more than half of the papers he assigned to read before writing it were by him and on the same topics as the paper. All in all a very weak class.\nWorkload:\nlight; 2 papers.\n"
        },
        {
            "course_name": "Introduction to Evolutionary Biology",
            "review_date": "April 18, 2004",
            "review_content": "\nI would agree with the previous reviewer- I learned next to nothing from this class.  Or rather, what I learned, I learned on the very first day- Professor Bock essentially repeated the same lecture over and over for an entire semester.  Students would joke about \"preparing for yet another day of review\".  With all that time taken up by mind-numbing repetition, it's easy to see how other vital topics will get overlooked.  Gould's theory of punctuated equilibrium is (mean-spritedly) discussed -and dismissed- in about half an hour, towards the end of the semester.  \nWorkload:\nVery easy.  There is essentially no reading, and, as with the lectures themselves, exams questions are recycled from previous ones, often verbatim.  \n"
        },
        {
            "course_name": "Introduction to Animal Structure and Function",
            "review_date": "April 01, 2003",
            "review_content": "\nAwesome class!!!  Only offered in the Spring.  It's a 6 pt. class that requires 3, one hour lectures, and 2, four hour labs...but it is so worth it!  Premeds should be required to take this class!  You learn the muscles and circulation in a cat and shark as well as some brain structures in a shark and sheep.  This will help you ace anatomy in med school.  Lots of memorization, but the written exam answers are basically a given if you do the consolidated exam practice problems.  Don't miss out on this 6pt, A!!!\nWorkload:\n3 written exams, 2 practical exams.  Memorization can seem daunting, but it's really not that bad.\n"
        },
        {
            "course_name": "Introduction to Evolutionary Biology",
            "review_date": "May 17, 2002",
            "review_content": "\nThis class seemed interesting to me when I registered for it, but as I sat through the first, then the second lecture, Bock very quickly drained that interest from my entire body with his slow and repetitive lecturing. Basically, this guy likes to hear himself talk and use long confusing sentences. Ten minutes into a lecture and I would be zoning out. Recording lectures doesn't help either. Same deal, ten minutes into the tape and I was zoning out. Bock made a big deal about certain \"issues\" in evolutionary theory, but no one in the class could understand his point. I came away from this class with little enlightenment.\nWorkload:\nWorkload was what you made of it. Although there was assigned reading, it didn't matter if you read until the exam and you were panicking because you realized that you knew nothing about evolutionary bio. Bock gave out copies of his old exams dating all the way back to 1989, which was extremely helpful in studying. One midterm, one final, grading seems arbitrary though.\n"
        }
    ]
}