{
    "prof_info": [
        {
            "prof_name": "William Latzko",
            "prof_id": 2590,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Quality Control and Management",
            "review_date": "July 31, 2012",
            "review_content": "\nIt's a shame this man retired.  I learnt a lot in his course.  The subject matter is very applicable to all forms of the service industry.  I feel as though this is an important exposure class.  A lot of information is given to you and you can do with it what you wish.  He is really concerned with everyone walking out without any questions at the end of the say.  You are able to understand the material, because Latzko is a true expert.  He is the modern day Walter Shewart.  He is undoubtably one of my favourite professors in IEOR.\nWorkload:\nVery minimal and relaxing\n"
        },
        {
            "course_name": "Quality Control & Management",
            "review_date": "May 16, 2010",
            "review_content": "\nProbably one of the easier classes you'll take in IEOR. His class and lectures are extremely well-organized and structured! Have to give him credit for that!\nHe's a very knowledgeable guy, and one of the most important persons in the area of Quality Control out there. Manages to bring in some guest speakers and that is always interesting.\nA lot of the work is in groups, so that makes life a lot easier.\nNothing to complain about the class--enjoy it, and get a good grade!\n\nWorkload:\nQuiz every class; 2 exams; a bunch of group projects and a final presentation.\n"
        },
        {
            "course_name": "Quality Control & Management",
            "review_date": "May 04, 2007",
            "review_content": "\nAgree with the last reviewer--easy A+ with very little work, everything is in groups--I just want to add that he is terribly boring.  Unfortunately participation is important.  So join this class only if you don't mind coming with a book or laptop to pass the time.\nWorkload:\nvery easy\n"
        },
        {
            "course_name": "Quality Control & Management",
            "review_date": "July 26, 2005",
            "review_content": "\nProfessor Latzko is pretty different in terms of his teaching style.  The key word in this class was \"group.\"  From the first day, he split people up randomly into groups of 3-5, and for every lecture, we were to sit with our group and participate as a group.  His answer to why we didn't get to choose our own groups was \"your boss chooses who you work with, not you.\"  Professor Latzko is pretty good natured, but he's HUGE on teamwork.  Every lecture, a group would do a presentation on that day's materials, then he'd go over some more stuff he thought important, and lastly, he gives each group a question/problem to solve together.  He's big on attendance, and passes attendance sheets around for people to sign; it's hard to miss a class because your already small group will look even smaller.  Participation was 50% of the grade.  Midterm was very easy: 50 multiple choice questions out of a 75-question list that you get ahead of time, and again, midterm is done in groups.  Final was a group project that focused on what the course is about.  He's very generous about grading... Overall a very easy A+ as long as you go to class.\nWorkload:\nWeekly question on new material to be submitted as a group (we just took turns to write this), going to class (participation includes attendance), very easy midterm in groups (50 multiple choice questions out of given 75), final group project (very lenient on grading, but includes peer evaluations so you better participate).\n"
        }
    ]
}