{
    "prof_info": [
        {
            "prof_name": "George Fiske",
            "prof_id": 1153,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "July 04, 2005",
            "review_content": "\nIt is true that \"discussion\" sections with George ranged for most from mind-numbingly boring to mind-boggingly frustrating, which was terrible because we were working with such juicy, fabulous material in this class.  However, I found that I could learn a lot from George after class or via email, and was impressed and touched by his beyond-the-call-of-duty availability and commitment to helping me and other students out.  As a semi-clueless non-History major I still ended up with an A- (which I worked my ass off for.)  Moral of the story:  if you have no choice but to be in section with George Fiske, use the sections as an opportunity for increasing tolerance and love in your heart in the face of what often looks like extreme incompetence, and make use of what George does have to offer academically outside of the class.\n"
        },
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 13, 2005",
            "review_content": "\nI'm a senior this year, and I've had maybe 30 TAs.  It is unfathomable how bad George was, and I'm not even going to describe it, because it will make me too upset, but I feel plenty confident saying that in the history of the Ivy League, there has never been a worse TA.  Just don't stay in his section...and if you can't switch out, drop the class.  Seriously, you don't want your grade in this guy's hands.\n"
        },
        {
            "course_name": "The Balkans from 1800 to 1949",
            "review_date": "February 07, 2005",
            "review_content": "\nLegitimately, the other reviews aren't far off the mark in terms of the content of George's section. He comes off as very knowledgeable in general but struggles when it comes to running a focused, concise section. He is extremely approachable, however, and a fair grader. He periodically sent students interesting articles and links just because he thought we'd enjoy them--a very thoughtful person in general.\nWorkload:\n5-7 page paper on primary source, 2 map quizzes and an in-class, all essay final\n"
        },
        {
            "course_name": "The Balkans from 1800 to 1949",
            "review_date": "January 26, 2005",
            "review_content": "\nIt amazed me how unproductive a discussion section could actually be--worst scenario the  TA may have no clue whats going on but at least the students are interacting with eachother and stimulating discussion!  NO NO NO NO not here with Geroge Fiske. He talks the whole time about incoherent nonsense as far as I am concerned without letting a student get ONE SINGLE word in, unless you fight tooth and nail with him. \n"
        },
        {
            "course_name": "The Balkans from 1800 to 1949",
            "review_date": "January 18, 2005",
            "review_content": "\nPretty terrible.  We didn't look once at the outside readings.  While this reduced my reading load significantly, I didn't learn much from the discussion section.  He talks on and on, and slowly.  50 minutes felt like 3 hours.  95% of what he said had nothing to do with the Balkans at all.  Instead he lectured about the concept of what history is and whether or not it is reality and so on.  There was very little discussion because he talked all the time and interupted people.  Pretty easy grader for papers.  Hard grader on map quizzes.\nWorkload:\nReduces workload significantly because you never discuss any assigned readings.  However, because you will never talk about the class topic, you will have to learn more on your own.\n"
        },
        {
            "course_name": "Introduction to Major Topics in the Civilizations of the Middle East and India",
            "review_date": "June 03, 2002",
            "review_content": "\nHORRIBLE!! Avoid this man at all costs. George is actually a nice guy in person, but his section was an incredibly painful experience. He asks horrible questions that are impossible to answer and have nothing to do with the stuff you're supposed to be learning. We wasted tons of time talking about \"what is history?\" and \"what is national history?'\" (actually, most of the time was wasted sitting there waiting for someone to say something). On the rare occasion when he actually teaches, George literally reads (too fast) a paper he wrote and which is actually intended to be confusing (he told us so). The class itself was pretty bad, but this section was unspeakably awful. I would not wish this man's teaching on my worst enemy (and I spoke with a number of people in the section who all agreed).\nWorkload:\n2 papers, 4-5 pgs each. Pretty easy grader because the students are all so indifferent and the class attracts idiots (one student couldn't tell whether \"left\" on a map was N/E/S/W). No midterm. Final is pretty predictable and quite easy.\n"
        }
    ]
}