{
    "prof_info": [
        {
            "prof_name": "Vivek Pal",
            "prof_id": 12881,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "September 16, 2016",
            "review_content": "\nVivek is one of the best Math Professors at Columbia I have encountered so far. His lectures are very clear, and he could explain the hard concepts in a relative easy way.  Usually, when I take math classes at Columbia, I have to watch other videos or do extra problem sets to understand the material well, and I believe many other students do the same thing. But if you take Vivek's class and pay attention during lectures, you won't freak out and seeking somebody else for help. Taking Vivek's class is a big saving of time, and I really appreciate all his help!\nTips for taking his class: \nHis lecture notes and homework problems are crucial. I always review 2/3 times of his lecture notes and practice the homework problems twice. Such practice would help you getting familiar with all concepts he taught in class, and would guarantee your success in exams as well. \nWorkload:\nSimilar workload.\n2 midterms and 1 final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "May 01, 2014",
            "review_content": "\nBy far the best professor I've had at Columbia. He cares so much about his students actually learning. He's always super helpful, reasonable, and encouraging. If you ever have a conflict with where you can't make it to one of the quizzes and want to make it up, he'll tell you not to worry about it. If you ask for an extra day to do the homework, he'll give you a week. AND he gives full days of class time for midterm & final review.\nI really hope he continues to teach after his graduate studies, because he has a true talent and passion for teaching. I am never a fan of waking up for 8:40 classes, but Vivek Pal makes this completely worth. He is the only professor you should take Calc II with.\nWorkload:\n10-15 question Webassign due every Thursday; 2-3 question written homework due every other Thursday; 2 question quizzes every Thursday; 2 midterms. \n"
        }
    ]
}