{
    "prof_info": [
        {
            "prof_name": "Timothy Frye",
            "prof_id": 5878,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 05, 2013",
            "review_content": "\nI took this course because it was required for my major. Words cannot express how much of a drag it was to go to this class.\nProfessor Frye is a great guy and is very accomplished in academia when it comes to comparative politics. However, if you dislike theory-based courses, you will hate this course. The discussions sections did not help either. The readings were long and dense. \nMy TA really didn't break down how the exams would be and we didn't know what IDs would be on the exam. Yet, the exams were not that bad if you read and studied beforehand.\nOverall, the class was not great at all and should not be an intro course.\n\nWorkload:\n200+ pages of reading per week. 2 2 to 3 page essays not graded well and with enough comments on how to improve. Midterm and Final.\n"
        },
        {
            "course_name": "Political Economy of Development",
            "review_date": "August 29, 2011",
            "review_content": "\nPolitical Economy of Development is an excellent class. Professor Frye is hugely knowledgeable and has clearly taken time to construct a course that isn't too rigid in the topics it covers, but is also much more than a superficial review of the topic literature.\nFrye lectures for most of the class, with some diversions for questions and debate. He is not the best lecturer in the world, but he is capable. Most importantly, you can tell he really sees the info as valuable and worth learning. The only issue is when wannabe smarty pants try to over complicate things with their comments. Frye is almost too nice to suggest they stop derailing the knowledge train.   \nIt is important to stay up to date with the readings, as he will call on people in class to get a quick tidbit about what the reading was about, or what the implication of a concept might be. It can be a little nerve-racking, but he really doesn't seem to hold it against you if you don't know and there were some pretty funny deflections in class. \nOverall, I highly recommend this course. It shows you the many sides to political science scholarship in a way that will get you thinking globally and pragmatically. \nWorkload:\n200-300 pages of reading a week, with one midterm and a final. Major essay due at the end of the semester. Stay on top of the readings and it is fine. \n"
        },
        {
            "course_name": "Political Economy of Development",
            "review_date": "May 17, 2011",
            "review_content": "\nI'll echo the sentiments of the last two reviewers -- Frye is a good man, an excellent teacher, and a very fair professor. If you're into Russia, taking Frye's class is a must, as he is a pretty big scholar on the post-Communist state. If you're a freshman or sophomore looking to take this class, I might recommend holding off until you have at least 3 or 4 other PoliSci classes under your belt because the development stuff is a bit trickier than your general intro class. The workload is pretty standard, though you really really need to get started on the research paper way in advance if you want it to come out decently. Speaking from experience, you could write it the night before but (as you could imagine) that's really stressful. Be sure to find a group of people you can split the readings with and start splitting up the material from Day 1. The summaries will be invaluable come midterm and final season and save you a lot of anxiety and time. Overall, a good class but just be sure you're up to the challenge (albeit small).\nWorkload:\n12+ page research paper, midterm (5 out of 8 IDs, 2 out of 3 essays [not enough time]), in-class final of short essays. I heard scary things about his grading, but it was very fair at the end of the day.\n"
        },
        {
            "course_name": "Political Economy of Development",
            "review_date": "May 11, 2011",
            "review_content": "\nI agree with the last reviewer - give this man a silver nugget. Frye's Political Economy of Development class is well-structured, informative, fair, and engaging. The class basically seeks to explain development outcomes of different countries by looking at the interactions between politics and economics. It is a poli sci course, so there are no econ formulas, but it will be very helpful to understand basic macroeconomic theory before taking this class. As far as the class goes, it's largely theoretical with a big emphasis on how to conduct a good comparative study between different countries or regions. During the first semester, you learn different theories for development, based around foreign aid, natural resources, institutions (democracy), corruption, globalization, and finally social capital. During the second semester, you study different regions in depth (Latin America, China, Africa, and post-Communist Russia, Frye's specialty) while seeking to apply the development theories you've learned. The class is organized very logically, and if you keep up with the syllabus you should learn a lot. \nAs far as actually succeeding in the class, the key is to keep up with the readings and to be able to summarize each of them, because 1) the lectures are basically a discussion about the readings, and 2) the final and midterm are based around the readings. The final paper is completely open-ended, which is exciting but also challenging.. reach out to TAs early and often (they're actually very helpful). \nOverall, for anyone interested in developing countries, this is an excellent course. It really gives you a deep understanding about why it's so hard to solve world poverty problems. Frye himself is not preachy; he simply states the facts. He's a solid lecturer with a wry sense of humor, and he is very helpful in person. He does take attendance by calling on students randomly from the class roster, so be sure to show up.\nWorkload:\nQuite a bit of readings. One straightforward midterm (IDs, short answers, essay) and a final (5 in-class short essays). 12+ page research paper due at the end of the term. \n"
        },
        {
            "course_name": "Political Economy of Development",
            "review_date": "April 12, 2011",
            "review_content": "\nThis man deserves at LEAST a silver nugget. His class on political economy of development was engaging, informative, and well-structured. We covered a breadth of topics, which I felt, gave me a good introduction to the topic. Frye himself is approachable, articulate, and smart. He lectures alongside sparse powerpoints for most of the class--everything is well structured and organized. If I were interested in Russia I would take the class he is teaching next fall.\nWorkload:\nHe calls on students periodically to ask questions (see if they've done the reading)--a great pedagogical tool if you ask me. Otherwise, there's just a midterm, final, and research paper (10-15 pages). Pretty standard for polisci.\n"
        },
        {
            "course_name": "Political Economy of Development",
            "review_date": "May 03, 2010",
            "review_content": "\nengaging, interactive lectures and interesting readings (long!) on all kinds of political problems of economic development. frye has a lot of funny little stories to tell and gives a great overview of the main topics. because the topic is so large, the syllabus seems crammed sometimes but it's a great class overall, especially when you're interested in both econ and poli-sci. the midterm and the final are IDs and essay questions and sum up to less than half your final grade. you have to write two papers that you can hand in whenever. Frye and the TAs give quite a bit of help so it's doable. if you don't mind the reading and that you have to come up with your own ideas once in a while, take the class! \nWorkload:\nreading: 100+ (sometimes 200+) a week, moderately difficult midterm & final, research paper, research critique paper\n"
        }
    ]
}