{
    "prof_info": [
        {
            "prof_name": "Rachel McDermott",
            "prof_id": 54,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "Tantra In Asia and the West",
            "review_date": "September 04, 2015",
            "review_content": "\nJust echoing all of the other reviewers that say Como and McDermott are great. She's a bit more linear, he's a bit more freewheeling. They're both excellent lecturers and incredibly nice human beings. If you start to feel behind take advantage of their office hours, they're both very warm and helpful.\nWorkload:\nHEAVY on the reading, but very light on the writing. Mid-term and Final were a breeze if you pay attention to the readings and lectures.\n"
        },
        {
            "course_name": "Jews and Christians in Southeast Asia",
            "review_date": "May 02, 2013",
            "review_content": "\nThis is my third class that I have taken with Professor McDermott.  She is absolutely amazing!  Regardless of what she teaches, I highly recommend that you take her class.\nJews and Christians in Southeast Asia is a class that she teaches every 3 years.  So best jump on the opportunity when you have it (I waited over a year for it)!  \nI am a well educated Jew, and she did an incredible job covering the Jewish part of the course.  I learned an incredible amount, and was unbelievably excited to come to class every day.  It was very interesting.  That being said, Professor McDermott begins teaching, by being wholly academically honest, and saying that she is not an expert in the field, and is teaching what little she does know.  And honestly, she knows a heck of a lot.  The Christian part of the course is also incredibly interesting, but I personally think harder, as it is difficult to keep track of all of the different sects and communities (compared to two or three \"groups\" in each of three cities for the Jewish portion of the course).  \nAnyone who is majoring in this area, or interested in India, or with a free course to spare would do well to take a course with Professor McDermott.  She is one of the warmest, sweetest Professors I have had here, and honestly cares that her students learn, as opposed to just getting good grades.   \nShe also shows a number of wonderful films, and brings in speakers.  We heard from Rabbi Romiel Daniel, a Bene Israel born and raised in India, and Father Jebamani, a Dalit priest.  Both were wonderfully fascinating.  There is also a field trip to a church (that you will choose), that is a wonderful cultural experience.\n\nWorkload:\nReadings for each class.  Not super heavy.  About 50-80 pages.  \nTwo papers.  One of the Jewish component, and one in the Christian component, but with a much broader theme choice. \nOne final.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "May 05, 2011",
            "review_content": "\nI can't help but reiterate what everyone else has said. The class is interesting and extremely well-organized. McDermott is a wonderful and thoughtful lecturer as well as extremely approachable. She works really hard and you can tell she puts a lot of time and effort into this class. Typed outlines that she is careful to stick to, music at the beginning of every class that's relevant for the day's topic, and good timing on getting essays and assignments back. But that means she also expects you to work as hard. As everyone else has said, this is NOT an easy A, but an A is possible if you make an effort to attend the lectures and do the readings. Even though it was a 9am lecture, I found her lectures to be interesting enough to keep me awake. Plus, she's so nice that you feel bad if you fall asleep!\nThe grading was split between her and the two TAs. The final was evenly split between the three in that one person graded the same part on everyone's exams so that it was consistent. She grades all the film responses though. Although people have complained that the grading is too harsh, I don't think it's true. McDermott's an extremely fair grader and if you feel like you got screwed by the TA, bring it to her and she will take a look at it. But show that you are actually thinking in your writing and don't BS it. If you need to, talk to her about the papers beforehand, she's very helpful. \nThat being said, take this class if you want to actually learn from a fabulous professor, not if you just want an easy A. She's one of the best professors at Columbia, so if you can, take her class. \nWorkload:\nMedium workload for a humanities class. Two 7-8 pages paper, 1 map exercise, 4 film Responses, and a cumulative final. The final is a killer, but if you take good notes during lectures and do some of the readings, it shouldn't be too difficult, just tedious preparing for it. \n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 27, 2010",
            "review_content": "\nThis course is really fantastic for those interested in any part of indian civilization, whether it be the historical, cultural, religious, or political aspects. Professor McDermott is really a delight. She is clear, concise and most importantly, super organized. She is always available to speak with you outside of class if you have any concerns about her course. She is really just a sweetheart. She and the two TAs split all the grading, so it's really luck of the draw with regards to who will be grading your work. I found that she is a much better grader than the TA I had this semester, as he graded one of my papers and she graded the other. She is definitely a fair grader. The three split up the exam evenly so that one graded the same section on everyone's exam. It was all very well planned out. Overall, though it's a challenging course covering thousands of years of history, it's a really great class and McDermott makes it even more enjoyable. Definitely take the class if you're interested in the subcontinent and its history!  \nWorkload:\n1 take home map assignment (easy but be careful, because it's graded harshly!), 4 in-class film + film review sheets, 2 short (6-8 pg) papers, 1 HUGE final (she gives the entire exam out in a review sheet 1 week prior to the final)\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "November 15, 2010",
            "review_content": "\nI very much enjoyed her Intro to Indian Civ class. She is completely unpretentious and is incredibly warm. She's a great lecturer and is clearly passionate about the subject. There is a lot of assigned reading, but you can get by just fine waiting to selectively read before writing a paper. The films she requires you to see (four of nine possible) are interesting and well worth it. I was initially dreading that requirement but it became one of my favorite things about the class. The map exercise is not impossible to do well on, though it seemed like those evaluated by her, and not the TAs, got better grades. \nI had never taken anything on South Asia before and knew almost nothing about the subject, but the pace of the class was fine. \nWorkload:\nTwo essays, 6-7 pages in length, chosen from three prompts each time. Map exercise. Final. Four film responses, 1-2 pages.\n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "January 12, 2010",
            "review_content": "\nI must write a review for Prof. McDermott, as she was honestly one of the nicest, most helpful, and engaging professors I've had in my years here.\nAlong with Prof. Cachia, the other professor for this course, she led the class through many interesting discussions over some great texts from Indian and Middle Eastern cultures.\nThe discussions were very engaging, and her feedback was always enlightening.\nShe was very approachable when it came to papers and class discussions and gave us very clear and detailed guidelines for every part of the course.\nShe made the final a breeze and the class was something I looked forward to every week.\nI would definitely recommend this class and definitely with Prof. McDermott!\nWorkload:\nWeekly reading assignment (these can get a bit long towards the end of the semester but are very interesting)\nLeading a class discussion (once in the semester)\nTwo papers and a final\n"
        },
        {
            "course_name": "Hindu Goddesses",
            "review_date": "January 21, 2009",
            "review_content": "\nI have taken Hindu Goddesses with Professor McDermott, and she is also my adviser and thesis adviser. I just have to write a glowing review for her before I graduate, even though she already has an excellent reputation. She is an excellent lecturer and seminar leader. The readings she assigns are relevant and thought-provoking, and she makes sure there is enough structure in the seminar to stimulate interesting discussion, rather than allowing aimless student commentary to dominate. The course itself was excellent, and I would recommend taking anything she teaches. She is a respected scholar but extremely humble. In addition to being brilliant, she cares a great deal for her students. She is the most devoted and thoughtful professor I have had at Barnard. I just can't say enough good things about her! If you are at all interested in South Asia, don't leave without taking a class with her.\nWorkload:\nI think she has a reputation for being a hard grader, but she is fair--put thought into your work. For Hindu Goddesses, we had weekly graded responses, a presentation, and a 15-ish page seminar paper. Reading was manageable and interesting.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 08, 2007",
            "review_content": "\nPay no attention to the reviewers who claim that McDermott is overly difficult.  Her course is demanding, but not to the extent that some have claimed.  It's absolutely not necessarily, for example, to write more than the prescribed length on the papers in order to get an A on them.  Additionally, I've never taken a class focused on South Asia before, but her pace was perfectly adequate for me (I've done a small amount of reading on my own, though).  The final is killer, but if you pace your studying it's possible to learn it all.  McDermott is one of the most thoughtful and available professors I've ever had, and while Intro to Indian Civ is a good lecture class that will give you a solid, if necessarily surface-level, background in Indian history and art, if you have the chance to take a seminar with her, you should jump at the chance.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "May 24, 2006",
            "review_content": "\nIf you are interested in bhakti and super-old Indian stuff, take this class.  Apparentally she knows tons about Ambedkar, yet barely mentioned him during the entire semester.  I'll bet she's a really wonderful academic but that you just can't tell because of the virtue of the course being introductory.  TA's grade really rough--I've been taking S.Asia classes for three years and I only pulled a B.  AND I didn't learn anything new.  She uses lots of technology, which is kind of cool.  Always some music playing when you come into class, and she will usually use the video screen also.  Overall, not the easiest way to shirk Major Cultures requirement, but the material is interesting (if you haven't learned it 60 times before).\nWorkload:\nHave to watch a bunch of stupid movies and write up questions on them, two papers, in class midterm and final.  Too much work.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "March 22, 2006",
            "review_content": "\nAmazing professor. Interesting and very organized lectures (she gives handouts with keyterms, and pictures related to lecture). Covers all spans of the topic: history, religion, art, literature. Medium workload. She is an amazing person, and an amazing professor. There does seem to a heavy focus on the art in the class (take notes on her art slides as info from them will be on the final.) Be wary of the papers - some of the TAs can be annoying graders and she expects lots of detail. \nWorkload:\nmap assignment 10%, 4 video review assignments (watch on your own. they're short and range from somewhat interesting to good and tehy'r every easy to do well on) - graded on check, check+, check-. 2 papers (she claims they're bt 7-8 pgs, but to do well you need to write bt 12-15.) and a very extensive final The readings are not necessary for class per say but you do need to do them for the papers. \n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "January 12, 2006",
            "review_content": "\nDon't let the course load scare you. McDermott is an INCREDIBLE professor, and she certainly reaffirmed my decision to be at Columbia - because as a first year taking this course, I was extremely impressed. She knows her stuff. This class covers a HUGE range of topics, and you'll leave an expert on the history, culture, and art of the Civilizations of India. McDermott is extremely approachable, and she responds to e-mails quickly. NOT an easy A at ALL, though. I thought I was solid in this course, and I wound up with a B -- but that's because it's just THAT hard. I don't feel too bad because I know I learned more in this class than any of the others. There's no midterm, so the FINAL is HUGE AND SCARY, the films are interesting, and the paper topics are broad. The TAs are terrible and arbitrary -- if you ever have a question or want to contest a grade, go to the professor herself. I would recommend taking a class by her once at Columbia if you want a real rewarding class.\nWorkload:\nInsane final (but she gives you a review sheet so you can't do TOO bad), 2 papers (5-7 pgs), 4 film response sheets, a MAP exercise (that is graded unfairly by TAs but suck it up and do it)\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 27, 2005",
            "review_content": "\nAmazing! Amazing! Two thumbs up! Professor McDermott is super organized, very enthusiastic, a fair grader, willing to answer questions, and highly knowledgeable. Don't hesitate to send her questions via email--she answers promptly and is willing to help. Her class is challenging (a ton of reading), but you will learn so much from it if you can get motivated (which for me was easy because I'm fascinated by India)! I never missed her 9:10AM class--I thought it was always interesting. She makes great use of multimedia--films, music recordings, slides of artwork, video clips, etc.--in addition to lecturing. You will put a lot of time into this class, but it can definitely be rewarding. The TAs seem useless (and the fairness of their grading can be questioned), but McDermott still makes the class worthwhile. \nWorkload:\na map assignment (time consuming, but it IS possible to get an A on it), lots of reading assignments, two 6-page papers, 4 film reviews, a massive final exam (but not impossible if you make an effort and study)\n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "August 30, 2004",
            "review_content": "\nA course in the \"classic\" texts of Hinduism, Buddhism, and Islam. If you liked Lit Hum and need to fill the major cultures requirement, this is a great class. My section met once a week only so it was a true seminar. Each week a different set of three students ran the seminar. Get involved in the class and when its your turn to lead, be as thorough as you can. She's a pretty tough grader, but extremely fair as she \"bumps\" students up if they're on the borderline and gives students' later grades more weight if they're drastically better. Extremely approachable.\nWorkload:\nA work a week. Two papers. An oral final. Participation is a huge part of this class.\n"
        },
        {
            "course_name": "Hindu Goddesses",
            "review_date": "May 17, 2004",
            "review_content": "\nThis has been said so many times before, but it needs reiteration.  You should not leave Columbia without taking a class with Prof McDermott.  Her lectures are engaging and well-organized.  She is more demanding than many other professors but it's worth it, you will learn so much.  I recommend taking this seminar if you have a fear of tough exams.  It's mostly reading, writing, and talking.  This class was absolutely one of the best classes I have taken in four years.  Professor McDermott is also insanely dedicated to her students and doesn't do anything half-assed.  Take Hindu Goddesses, you will not be disappointing.  Everyone comes to the class from different perspectives so the discussions are usually pretty interested.\nWorkload:\nSeminar amount of reading (quite heavy but always interesting), 2-page weekly response papers, 15-20 page research paper, and one presentation.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "May 06, 2004",
            "review_content": "\nAll i have to add is that she is sooo organized, brilliant, and fabulous! Take her, take her!!\nWorkload:\ntwo papers, final\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 22, 2004",
            "review_content": "\nThe best course I've taken so far at college with the best teacher I've had so far at college. Do NOT miss McDermott. Not only is she a great lecturer (organized, straight to the point, engaging, versatile with teaching media, open to questions, conversation, and criticism) but she makes sure all the material is relevant. You will learn a lot, and you don't even have to do all the reading. Just get the gist of whatever, or even read it after she's lectured (she covers everything in there anyway). But you'll want to do the reading, maybe not in the beginning when its ancient and obscure, but as the course progresses so does its momentum. McDermott is interesting, knows her stuff (and if she doesn't she'll ask the TA's, the students, or look it up and admit she doesn't know). It's a moderate amount of work, and the final is hard but not impossible, and when you finish you feel like you really know some stuff and have real, applicable opinions about things. Take it, do half or more of the reading. Don't miss McDermott if this is a subject that interests you. And if you're good, you'll find a mentor.\nWorkload:\nMap Assignment (annoying but easy points), 2 papers 6-8 pp (grading depends largely on the TA's who were great fall semester), no midterm, but cumulative and really stressful-to-study-for-final. Lots of reading. All rewarding.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "January 20, 2004",
            "review_content": "\nProfessor McDermott is a highly demanding professor. She is a wonderful lecturer, and dedicated to her students BUT your time will be sucked away into this course. Filling in a map of india doesnt sound hard, but just wait till you get a full point off for every time you place a city slightly to the right or left of where she wants it. At the end of your papers she'll make charts to show you what points you could have elaborated on, and take off full grades for nit-picky areas not covered. Her final is a KILLER, and requires days of reading week to prepare for. You need to know 70/73 identifications, memorize that darn map and all of indian art history, plus prepare 7 full essays. Overall, she is a wonderful and engaging lecturer, but im not so sure that makes it worth drowning all semester for a mediocre grade. I must say, however, that she does an excellent job in presenting a thorough introduction to indian civilization both for people who know a lot about the region and people with no substantial background. \nWorkload:\na killer final, (memorize 70 IDs, the entire map of india + be able to identify all slides ever shown in the course, and about 7 essays you need to prepare ahead of time). two 7 page papers which she'll grade with a fine tooth comb. LOTS of readings which you'll have to do for the papers, but can lag behind for in the lectures.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "January 08, 2004",
            "review_content": "\nGreat professor. I learned so much in this class, but it came at a price to my hand as she never stops talking in lectures and its really really hard to keep up with her. But the class is still really intresting and she opens it up to discussion many times. And again, you'll learn so much. Oh, and she gives you the final before hand so its uber easy but very long.\nWorkload:\nlots of reading which no one does expect for the 2 papers, which are graded easy. 1 map excerize, feels like you are in 1st grade, but hey, its an easy 10%. movie responses that are fun to watch, 10%. and final, which she gives you before hand.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "May 28, 2003",
            "review_content": "\nVery good class on the whole.  Interesting material, presented well.  McDermott is very nice, makes an effort to learn everyone's name and seems to know quite a lot both about her scholarly specialty (Kali worship) and Hinduism in general.  The readings are generally worthwhile, and if you miss a couple, it's not disastrous.  I don't know about other classes McDermott has taught, but the TA for this class was fine.\nWorkload:\nTwo papers and a final.  A medium amount of work is required.  The grading seemed to be relatively easy.\n"
        },
        {
            "course_name": "Hinduism",
            "review_date": "May 04, 2003",
            "review_content": "\nThis class was excellent - very interesting based on just the information alone, but also taught very well.  Professor McDermott passionately cares about what she's teaching, and is always eager to talk to students and help them in any way she can.  She brings in her travel slides to class, gives handouts with key terms for every lecture, and shows some interesting movies.  The reading load could be heavy, but with a little bit of corner-cutting you could get the main ideas and do well.  \nWorkload:\nA lot of reading, two 6-7 page papers, and a final, which, by the way, you get a review sheet for that tells you EVERYTHING that's going to be on the final, explicitly.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "April 22, 2003",
            "review_content": "\nI LOVED Prof Mcdermott..I had her my first year and at first I was initimidated because the class was primarily juniors and seniors but she made me feel so comfortable..she really wants to get to know her students and she is down to earth. Her papers aren't that bad and I probably did 30% of her assigned readings yet well in the class..she's a great woman and I would love to have her again!\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "February 04, 2003",
            "review_content": "\nShe's an amazing lecturer.  Her enthusiasm is contagious, and she really works to learn everyone's name in a LECTURE class.  Even if you don't do the reading, she goes over everything in the lectures.  Every day in every way, she's just kickass.\nWorkload:\nLots of reading that you don't really have to do, 2 papers that take some time, 4 pretty easy movie response sheets, and a comprehensive final.  She gives you a review packet that has the whole final on it, if you split it up with 3 or 4 other people it's manageable.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "January 13, 2003",
            "review_content": "\nListen, I feel like the other reviewers have been too harsh.  If you're taking this course, then you'll probably love this course.  McDermott is a really great person with interesting and highly organized lectures.  Prepare to become extremely engaged and interested.  This course spans from ancient religion (the course is big on this) to modernday politics in the subcontinent.  If you simply make an attempt, you will do well.  This was my best class last semester and McDermott is a great professor.  Yes, the TAs are quite creepy and harsh, but if you're sure you deserve better, then won't McDermott agree?\nWorkload:\n2 6 page papers, map project, 4 movies, final\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 17, 2002",
            "review_content": "\nIf you don't trust anger and resentment, read the other reviews. McDermott was horrible, the class was horrible, the assignments were horrible, and the TAs were horrible (though by now they've moved on). The readings and other assignments, as reviewers have already mentioned, were terrible wastes of time. I learned nothing from her readings or lectures, and unless you're from, or visited India in the last year, you'll feel completely out of touch with the two person discussion section that the hundred person lecture tends to become. Perhaps the only aspect of the class I appreciated was the movies she required us to see. Of course even that mediocre experience was raped of all its value by her graded \"movie review\" system. I am embittered, to say the least, and will avoid her and her TAs at all costs.\nWorkload:\nTime consuming but by no means difficult. All philosophical texts go completely undiscussed in class - which really helps since she grades papers by checklist-answer-key. Don't be fooled, this is an easy class if you have no problem denegrating yourself on a regular basis - but if you're at all inclined towards a beneficial education, DO NOT TAKE THIS CLASS.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 15, 2002",
            "review_content": "\nTwo things: 1) Unless you plan to do ALL of the reading and/or attend EVERY session taking profuse notes therein, DO NOT TAKE THIS CLASS because if you don't do the above, the exam alone will cause you more stress than all of the potential pros of the class could possibly be worth.  2) If you plan to follow the above advice to avoid the exam nightmare, then prepare to go without a more sleep than a 3 pt class should ever warrent.\nWorkload:\nA boat-load of reading assignments which aren't necessarily overviewed in class.  Two 6 page papers (grading can be stiff).  A rediculously patronizing yet tedious map project.  And finally, the mother of all finals which far overshadows the fact that there's no midterm.  Oh, and 4 film review sheets (you pick 4 from 8 movies over the term).\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "July 14, 2002",
            "review_content": "\nThe class itself was interesting and very informative. I learned alot - something I can't say for most of the classes I've taken in Columbia. However, the workload is a killer. There's a ton of reading, and only some of it is worthwhile. The grading on papers is very difficult, and the final covers the entire course. You also have to watch 4 movies of her choosing by the end of the class and fill out a question sheet about each of them. In any case, just be prepared to work very hard if you want a good grade. \n"
        },
        {
            "course_name": "Perspectives of World Religions on Evil and Suffering",
            "review_date": "May 10, 2002",
            "review_content": "\nGreat class. Highly organized. Sophisticated readings and analyses of the readings. Professor is a deep thinker who is also able to think on her feet. Some of the Barnard students feel the need to interject annoying and irrelevant personal anecdotes, but assuming that doesn't happen too much, which it didn't this year, this is actually a great topic to study in a participatory lecture.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "April 01, 2002",
            "review_content": "\nMcDermott is a great lecturer, passionate about the subject material, witty, and super-organized. The papers are doable and the topics are fun (although the grading is beyond arbitrary), there are no dumb discussion sections to attend, I didn't even mind the map exercise that much. Really nice woman too. Yet I still cannot in good conscience recommend this course, because the final was the most harrowing experience of my academic career. There's no midterm, which is nice at the time, but it means that the final covers the whole course. And does it ever. She even tells you exactly what's on the test, but it's more than is humanly possible to memorize. Be prepared to spend your entire reading week studying just for this test. And you still probably won't do all that well. If you hear that McDermott has decided to give a midterm, take this class. It will be wonderfully rewarding. Till then, look elsewhere for your major cultures requirement.\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "February 28, 2002",
            "review_content": "\nProfessor McDermott is an amazing lecturer. She is organized and clear, all her lectures have a typed outline with key terms on them. She is more than willing to discuss things after class and take questions in class. The TA's are crazy freaks, they grade unfairly and arbitrarily. They contradict what the professor wants you to do during their office hours. So if you have any question go to her. The grading is tough, its not an easy class.\nWorkload:\nALOT of reading but you dont really have to do it. Easy movie responses. A map exercise which is painful. 2 papers 5-7 pp and a final exam which is difficult because it covers so much information. She hands out a rough outline before the final. If you prepare the outline you will be okay, but it takes more than a week to do a thorough job. The TA's told us it will be the hardest final we ever take\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "January 27, 2002",
            "review_content": "\nA very competent and organized lecturer. You'll learn a great deal about Indian religion, history, society, and current issues. The readings in the coursepack are by far the most important - the others are much more expendable. Beware of TA grading, as they can be overly harsh, though you can appeal their grades to the professor, who can be more generous. The final is comprehensive, which makes it quite big and annoying, but it's a good overall review. The problem with McDermott is that the actual final exam forces you to regurgitate the entire semester, instead of just picking a few topics as an indicator. Paper assignments are very reasonable. Map exercise is an insult to your intelligence and a huge pain in the butt. But McDermott's enthusiasm for the subject matter, and her articulate lecturing style, go a long way in making the class a rewarding experience.\nWorkload:\nTwo 7-pp papers, a map exercise (which really sucks), and a cumulative final.\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "November 14, 2001",
            "review_content": "\nLots of reading, but you can get away with skipping some of it. (Burton Stein's book is the world's biggest, densest waste of matter.)\nWorkload:\nModerate. Two papers, a map project (yay second grade!), four movie response worksheets, and a Final.\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "November 14, 2001",
            "review_content": "\nLots of reading, but you can get away with skipping some of it. (Burton Stein's book is the world's biggest, densest waste of matter.)\nWorkload:\nModerate. Two papers, a map project (yay second grade!), four movie response worksheets, and a Final.\n"
        },
        {
            "course_name": "Evil and Suffering",
            "review_date": "December 31, 1999",
            "review_content": "\nMcDermott's \"Evil and Suffering\" class is well organized and includes some fantastic readings. The class is mostly lecture, but she enjoys stimulating occassional discussion and welcomes students' questions and comments. She truly seems to enjoy the material that she's teaching about. The course load includes a small paper, a larger paper, and an exam. She encourages creativity in students' written work and is willing to work closely with students who want to perfect their papers. She tells students exactly what questions will be asked on the final exam, but it is still quite difficult and assumes that students have done most of the readings.\n"
        }
    ]
}