{
    "prof_info": [
        {
            "prof_name": "Rakesh Ranjan",
            "prof_id": 5581,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "April 22, 2016",
            "review_content": "\nAmazing professor who is invested in his students, taking Hindi with him will be the best decision you make with languages. \nWorkload:\nDaily homework (pretty easy)\n"
        },
        {
            "course_name": "Elementary Hindi-Urdu I",
            "review_date": "May 26, 2010",
            "review_content": "\nRakesh Ranjan is a veteran Hindi teacher who came to Columbia recently from Emory University.  He is the head of the Hindi-Urdu program here.  You might not be able to tell from looking at him, and he wouldn't brag, but he's a badass who is whipping the Hindi-Urdu program here into shape.  He is a sweet and friendly man whose approach to teaching the language is excellent.  The course itself is very challenging, and I would not recommend taking Hindi for your language requirement unless you are unusually interested in the language.  For an easy-to-learn language for native English speakers, try Spanish, Persian, or German.\nIf you are ready to dedicate five hours a week (an hour and fifteen minutes per day) and countless hours of homework to your study in addition to everything else in your course load, Rakesh ji is an excellent choice for instructor.  He's slow, methodical, and he knows what he's doing.  He's easily available outside of class.  You will get out everything you put into this class, and he will meet you more than half way.  If you have experience in Hindi or other Indian languages, his expectations will be higher than if you have no experience.  My only gripe is that, as a native speaker, he sometimes has trouble understanding the questions students ask about grammar.  Since a native speaker never has to learn grammatical rules in the same way, grammar questions aren't always as clear to them.  However, Rakesh's experience and patience makes up for this by far.  If you're going to study Hindi, start with Professor Ranjan.\nProtip: if you're interested in intensive summer study of Hindi or Urdu, look up the Critical Language Scholarship.  Rakesh ji has been part of the Hindi program in Jaipur for many years, and if you're a good student, his recommendation would be very helpful in earning the scholarship.\nWorkload:\nIntense.  Daily exercises, frequent readings and translations.  Hindi grammar is not overly complex, but it's very different from English, so be prepared to invest a lot of time in this class if you want to do well.\n"
        },
        {
            "course_name": "Hindi for Heritage Speakers I",
            "review_date": "January 04, 2010",
            "review_content": "\nGreat class...Hindi for Heritage Speakers was a great a idea and definitely helped me solidify my speaking, reading, and writing skills...he is a very good teacher who knows exactly where you may have problems and can address those problems quickly...Rakesh ji is also extremely accessible... he makes himself available almost every single day to provide help to students and review concepts...generally easy but at the same time I felt like  I was actually getting what I wanted and expected from the course.  Take this class or take his elementary hindi if you dont have any previous experience with the language...\nWorkload:\nHomework every day...1 midterm worth 10%...1 Final...8 quizzes (only 5 count)\n"
        }
    ]
}