{
    "prof_info": [
        {
            "prof_name": "Larry Heuer",
            "prof_id": 180,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Social Conflict",
            "review_date": "January 19, 2017",
            "review_content": "\nI took this class Fall of 2016 and loved it. It's an easy A if you do the basic work. I skimmed the articles, did the the little paragraph responses and wrote a mediocre paper and got an A. He loves class participation and that'll help you're grade so much if you're struggling. \nWorkload:\n1 Final Paper (10 pages)\n3 weekly articles ( with either you leading a discussion in class, or writing a paragraph response on courseworks)\nclass participation\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 01, 2009",
            "review_content": "\nProfessor Heuer is funny, smart and an all around really nice guy.  He is an extremely fair grader, and if you keep up with the homework, you'll do just fine.  His classes are very powerpoint based.  If you miss a few, you should be fine.  My suggestion: you don't have to go to class, but you really should go to recitation.  Usually it's just a few people, the review problems often end up on the test, and it's basically just like going to his office hours.  Statistics isn't my favorite thing in the world, but he certainly made it a good class.  If math isn't your thing--this is the class for you.  You really don't have to be all that strong in math to do well. You just have to stay on top of the homework.\nWorkload:\nHomework once a week, but you can miss 3.  3 midterms (final is just another midterm).\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "January 02, 2007",
            "review_content": "\nWell. \nLet's just say that I am glad to have completed the class.  I learned a lot, but I feel that the homework took wayyy too much time and some of the problems were redundant and unnecessary.  The recitation is not mandatory, and I personally did not attend recitation (maybe 1-2 throughout the entire semester) but I feel that the information covered in the textbook/class is sufficient.\nThe classes were very organized- Prof. Heuer always taught straight from the powerpoint slides available online (thus omitting the need to attend class).  However, I studied for the exams by reading the textbooks and using the powerpoint slides as a secondary reference- I didn't think the slides were that helpful..they served more to 'aid' what knowledge you had instead of actually 'teaching.' \nNow, on to a review on the professor himself.  He's a pretty cool guy- he drives a motorcycle and as one reviewer mentioned, he hates giving out tests & the whole grading mumbo-jumbo.  He reads his reviews on culpa (hello, professor) and is strict in emphasizing that he does NOT follow the curve that one student mentioned in a previous year.  His grading policy is alright- there are 3 non-cumulative midterms and the lowest grade is deducted by 1/2, BUT I STRONGLY believe that it would be sensical to factor in the homework, as it takes up an insane amount of time (expect at least a solid 2-3 hours) on top of the reading.  You need all the homeworks completed except for 3 to pass the class.  Now, there are several characteristics that I did not find agreeable with the professor.  First of all, he hates answering questions.  If a lot of people ask questions, he appears disgruntled and gives curt answers.  He's nice, but in my opinion, he's not very approachable (I can't really explain it- perhaps because he doesn't like answering questions).  He's a bit...lazy or really, really busy to the extent that he does not like to do extra work-- for example, if you ask him to put up answers for something or whatever else, he'll either do it late or he'll just not do it.  \nThe first test came out of nowhere and it screwed up my grade.  He didn't prepare us at all for it, and the grades weren't that pretty.  The second test was pretty easy because he took the time to prepare us with sample MC and short answer.  The third test was hard- sample MC was available but he didn't take the time to provide a sample short answer section, which would have been extremely helpful.\nThis is turning into an essay, so to sum up the class: Professor Heuer is organized and will teach you the material needed to pass this class.  His grading policy is fair but expect to do a lot of work on your own in order to understand the material.  He's a decent professor so just take the class.\nWorkload:\n3 non-cumulative midterms and the lowest grade is deducted by 1/2\nhomework assignments (don't have to do 3)\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "January 15, 2006",
            "review_content": "\nLarry is a great guy and he knows stats very well. Overall a great class but if you are having trouble with the material, and you can't make it to his office hours, he doesn't seem to have any extra time for help. Also, his tests are very conceptually based so you HAVE to read the book and understand the logic behind the problems you are doing. \nWorkload:\n3 midterms - all non-cumulative; weekly homework very doable\n"
        },
        {
            "course_name": "Social Conflict Seminar",
            "review_date": "May 30, 2005",
            "review_content": "\nProf Heuer really knows his stuff and loves what he does. This seminar had a lot of weekly reading and responses, but it was manageable. The class was mainly run by professor Heuer (not the students) who got us started with discussions, and he would often provide personal opinions of the articles. Notably, he always took the time to answer any specific questions that we had and he never forced anyone to speak who didn't volunteer. The final paper assignment was very challenging, but the grading for the class was very fair and generous. I personally did not have an interest in the area of psychology this seminar talked about (justice and fairness), but I still really enjoyed the class, mainly because of the relaxed atmosphere brought into the room by the professor each week (along with the snacks). I would highly recommend this professor to anyone, as well as this seminar.\nWorkload:\nWeekly readings (2-3 articles), short (1 paragraph) responses to each article, and a final paper ~15-20pgs.\n"
        },
        {
            "course_name": "Social Conflict",
            "review_date": "April 28, 2005",
            "review_content": "\nHeuer's passion for this subject is totally contagious and inspiring. Some readings were dense and dry, but they usually had interesting implications and class discussions were often very stimulating. Some of the topics discussed are also directly relevant to current political issues.\nI really can't stress how much I enjoyed Heuer's attitude, though. He was funny, open and honest, supportive and perceptive, and realistic in his expectations. \nWorkload:\nWeekly posts on all articles, which can take a while to get through, and a final paper (max 15pgs) worth 50%, which is initially daunting, but do-able. \n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "May 22, 2003",
            "review_content": "\nProfessor Heuer is a nice guy with good intentions but he shouldn't be teaching a Stat course.  He doesn't seem to be at all interested in the subject and this comes out in his teaching, despite the effort he makes.  Stats is boring to start with but this class can push the limits at times.  There's a powerpoint presentation for every class, and Prof Heuer follows them word for word.  They're all available online so there isn't even really a need to go to class.  This would all be ok and probably typical if it weren't for his completely unaccommodating grading system.  He tells you from the start that he'll give 30% As, 40% Bs, and 30% Cs.  He follows through with this no matter what the quality of the class overall.  So you better hope you find yourself in a class of people who are lazy and bad at stats. If this is the case then good for you because your grade isn't reflective of your knowledge as much as it's reflective of your position in comparison to the rest of the class.  I'm not normally a person who gets caught up in grades, and I actually came out with one of the As, I just know that the majority of the class was really frustrated with his rigid curves that were incorrectly applied to a class of less than 40 students.  I feel bad to complain about Professor Heuer's course, because he is really a very nice guy and I'm sure that the classes he enjoys teaching are also enjoyable for the students.\nWorkload:\nWeekly homework assignments (worth 10%) that are pretty easy and will def help you to understand the material for exams.  Weekly recitation sections that are usually about an hour long.  3 non cumulative exams that are fair.  Prof. Heuer brings candy for the class on test days :-)\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 04, 2002",
            "review_content": "\nProfessor Heuer is SO cute. What a nice guy. He felt so bad about giving us exams that he brought candy in for us on test days. He gives lectures in the form of Power Point Presentatons and always includes really dorky jokes to keep the class entertained (and awake.) Let's face it, statistics SUCKS and he knows it as well as we do -- so he tries to make it as painless as possible. If you do have to suffer through this course, take it with Heuer.\nWorkload:\nWeekly reading and problem sets that are not too hard at all -- in fact, they really help you to understand the course material. Three (tricky!) exams, none of which are cumulative. Weekly two-hour recitations that are often shortened to about an hour. Pretty fair.\n"
        },
        {
            "course_name": "Psychology and Law",
            "review_date": "December 31, 1999",
            "review_content": "\nHe is somewhat obnoxious in person, particularly when he's kicking excess peopole out of the classroom, or discussing papers, extensions on assignments, or attendance. The lectures are interesting, but do tend to drag half the time. Course is relatively easy, provided that you do the work, which is heavy. Workload: About 3 journal articles must be read each week, and reaction papers must be written and emailed to Heuer by noon on the day before the class. If the paper isn't in by noon, it counts as an absence. (You are permitted only one absence per semester, after which your grade is docked one letter grade for each absence.) Also: final paper due last day of class: extensive, and grading on it is strict.\n"
        }
    ]
}