{
    "prof_info": [
        {
            "prof_name": "Chad Gifford",
            "prof_id": 1391,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "The Ancient Empires",
            "review_date": "December 19, 2011",
            "review_content": "\nIf you are interested in the subject, do not hesitate and take this class. It's a great way to learn a lot of the details of several ancient empires and the themes that repeat or make them distinct. The key for this class are the readings: there's a lot of it to do but if you're into that sort of stuff, it's a breeze. Needless to say, I found them extremely interesting.\nChad himself is a great guy, very knowledgeable and approachable, and he covers the material in a laid back way; look for when he gets to the Incas, as he has experience doing actual archaeological field work. Very interesting and entertaining at times. On the other hand, there's no discussion in class, it's just him talking with close to no pauses and no interaction. Might be a problem for you if you need hand-holding.\nAnd here's a joke I came up with:\nWhat was Ramesses II's favorite TV show? Dynasty!\n\nWorkload:\nMidterm, paper (8-10 pages), final. He gives review sheets for the tests with sample questions (I found them worth thinking about even outside the context of studying for an exam). The midterm was straightforward (definitions/essays), the paper is fun to do. His daughter wrote the final and she made it just a little bit longer than the midterm, and in the same format.\n"
        },
        {
            "course_name": "The Ancient Empires",
            "review_date": "December 19, 2011",
            "review_content": "\nIf you are interested in the subject, do not hesitate and take this class. It's a great way to learn a lot of the details of several ancient empires and the themes that repeat or make them distinct. The key for this class are the readings: there's a lot of it to do but if you're into that sort of stuff, it's a breeze. Needless to say, I found them extremely interesting.\nChad himself is a great guy, very knowledgeable and approachable, and he covers the material in a laid back way; look for when he gets to the Incas, as he has experience doing actual archaeological field work. Very interesting and entertaining at times. On the other hand, there's no discussion in class, it's just him talking with close to no pauses and no interaction. Might be a problem for you if you need hand-holding.\nAnd here's a joke I came up with:\nWhat was Ramesses II's favorite TV show? Dynasty!\n\nWorkload:\nMidterm, paper (8-10 pages), final. He gives review sheets for the tests with sample questions (I found them worth thinking about even outside the context of studying for an exam). The midterm was straightforward (definitions/essays), the paper is fun to do. His daughter wrote the final and she made it just a little bit longer than the midterm, and in the same format.\n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "June 25, 2005",
            "review_content": "\n   The material for this course was very interesting. Prof. Gifford is sweet and funny and cool - a lovable man. But his teaching style borders on boring-He basically teaches the course from a printout of notes that contain a lot of facts about the culture you are discussing (though of course there is no actual discussing in this lecture class). Yes, class definitly was boring at times. But, look, I honestly learned some really great, interesting things that i will probably remember for a long time. \n   it's a pretty decent way to fulfill your major cultures requirement, especially if you don't have a specific culture you want to focus on. This class will give you a nice overview of  6 different cultures, mostly ancient ones, but the things you learn about them are  very relevant to the current culture of each area.\n   Don't make the mistake i did by not doing the reading AND not going to recitation sections. You should pick one, and i definitly think that going to recitation is more helpul and time-efficient. The best way i found to navigate this course (and i tried several ways) in order to get the most out of it without wasting your time, is to go to class and to recitation (which will basically just review the important (i.e. test-relevant) material)--and then you dont have to do the reading. its just too much reading to do when you have a full course-load.\nWorkload:\nmidterm, final, optional paper (will boost you grade! you'll know wether to do it or not once you fail or don't fail the midterm), readings ( a lot -like a said, not necessarily necessary)\n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "June 13, 2005",
            "review_content": "\nI enjoyed this class for the first few weeks of the semester, but after a month or so the lectures became increasingly boring and disorganized. Professor Gifford is extremely approachable and a nice guy, but he lacks a cohesive teaching style. My notes were always a mess and while the class readings helpeed to clarify things I still felt screwed come exam time. Gifford will tell you that he doesn't care about details, but believe me, he does. Especially when he wants you to compare and contrast 4 different civilizations and every minute detail surrounding their rise and fall. There was an overwhelming amount of information and the TA sections were no help at all as they couldn't teach worth a dime. If you love archaeology and are detail oriented, this class could be for you. I'm an anthropology major and I think I will stick to those courses from now on.\nWorkload:\nWeekly readings, midterm, optional paper, and final. \n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "May 30, 2005",
            "review_content": "\nProf Gifford is a passionate professor who has a contagious enthusiasm for anthropology/archaeology. He teaches a good class, but is very spacey and tends to go off on tangents, which is often frustrating. The reading for both classes was VERY light, and most of it was not necessary- all the exams basically ask you to regurgitate everything he said in class. That said, if you go to class, you will do fine. He is a fair grader and offers assignments (like optional papers or projects) that will boost your grade. The TAs for this class were useless- don't bother going to section. Overall, these classes were enjoyable and relatively easy.\nWorkload:\nOrigins of Human Society: Light- 1 quiz, 1 midterm, a project, and a non-cumulative final. Weekly reading (don't bother).\nRise of Civ: light- 1 midterm, 1 final (non-cumulative), and an optional paper reviewing a museum exhibit (really easy A- I recommend doing the paper).\n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 17, 2005",
            "review_content": "\nI have taken 2 courses with Chad, the one listed above as well as Origins of Human Society. Chad is very knowledgable of the topics he teaches as he has first hand experiance with them. He has run digs all over South America and is currently working on one now (wait for his shameless yet interesting advirtisment of it in class). He is very personable and can relate to students well. He understands that not everyone taking his class is an anthropologist and therefore tailors the class for non-anthro majors to understand. That said, if you are an anthro major you can certainly challenge yourself on tests, as there is much room for detail oriented work that the average student wont take advantage of. Lectures are pretty interesting and Chad usually tries to add humor to them which is great. Fun class, great teacher, would reccomend to anyone.\nWorkload:\nMidtern and Final with an optional research paper that affects grading ratios.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 22, 2005",
            "review_content": "\nhe's amazing. take everything you can with him. \nWorkload:\nquiz, midterm, presentation, final.  he doesnt grade them- so get buddy buddy with your ta.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 03, 2005",
            "review_content": "\nI agree with the reviewer who said this course and Chad weren't a good fit.  The second half of the class was on the origins of human society, and the first half was mostly biological anthro and archeology.  The guy is definitely interesting, as is the material, and it's always fun to watch him get excited about his own work, or make fun of famous anthro/archeologists.  But we were at least a week behind schedule by midterm, which I think showed where his interest really lay.  That meant that a lot of the class felt rushed.  This was probably due to the fact that we ended 10 minutes early every day, and sometimes half an hour early; a phenomenon I hope was related to Gifford's newborn baby, and won't continue in future incarnations of this course.  My feeling is that this class should have been great, but it had problems come from unusual directions.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 02, 2005",
            "review_content": "\nGifford is a decent instructor but I feel this class is not for him, nor is this class accurately described.  It is under the Anthropology department, yet the majority of the material taught in this class is archaeological.  Gifford's personal interest lies within archaeology, do take note of that before choosing this class.  Overall, I found the class too unmotivating to attend more than half the lectures.  Gifford, as a professor was supportive, available and fair, but I feel his own lack of personal interest in some of the subject matter made this class disappointing.  \nWorkload:\nQuiz, Midterm, Project and a Final.  There are two course packets and a couple outside book requirements where weekly readings are drawn from.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Gifford is great. His lectures are always well-organized, informative, clear, and interesting (which is impressive, considering the great potential for boredom when memorizing the names of prehistoric species and artifacts). The workload is manageable, and exams are reasonable. The readings vary in their relevance and enjoyability, but Gifford's lectures are truly engaging. Highly recommended.\nWorkload:\n1 quiz; midterm; in-class presentation and paper on a topic of your choosing; final exam\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 14, 2003",
            "review_content": "\nI completely agree with the previous review.  I took his class as a freshman, and although I was a bit nervous about memorizing a billion latin names (not to mention how long they were--australopithecus afarensis was one of the short ones to give you an idea), Chad made class really interesting and he was an incredibly engaging professor.  His slides and jokes about his travels around the world didn't hurt, either!\n\nWorkload:\nNot too bad, though the reading was a bit heavy at times. A quiz, midterm, and final that weren't hard and if you go to discussion sections, the TA's make sure you understand everything you need to know.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 28, 2002",
            "review_content": "\nGifford is a great professor despite the sometimes boring material he has to cover.  He keeps you laughing, and he's really enthusiastic, especially when you show interest.  You'll learn a lot from his classes, and everything's straightforward.  The reading is fair as well as the tests.  I'd highly recommend taking a class from him.\nWorkload:\na quiz, midterm, final, and a special project, everything is fair and he always gives you the benefit of the doubt as long as you try\n"
        }
    ]
}