{
    "prof_info": [
        {
            "prof_name": "Liz Abzug",
            "prof_id": 3262,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Junior Colloquium",
            "review_date": "December 31, 2011",
            "review_content": "\nProf. Abzug is very engaging and knowledgeable in class.  Her extensive experience in the field shows through in her teaching.  The class is very focused on discussion. So, often times one or two obnoxiously loud people end up dominating the class. I think Abzug does not do the best job of managing these people who tend to talk too much.\nAlso, I had a very difficult time with professor Abzug outside of the classroom.  She often ignores students emails and is grumpy about arranging meetings.  \nWorkload:\nArticles to read every week, but you can get away with not reading all of them as there is no test.  Most of this class centers around a 20 page paper at the end of the class.  \n"
        },
        {
            "course_name": "Women & Leadership",
            "review_date": "November 08, 2011",
            "review_content": "\nProf. Abzug's class Women and Leadership seems like a really great class, at first glance. The readings are interesting, the topic is applicable to Barnard women interested in leadership seminars. However, be warned. Prof. Abzug is not a teacher by profession. She's been in business and politics. This gives her a perspective on her subject matter, which she has no problem telling you over and over and over again. She is more often than not too focused on her own ideas than on anyone else's. Additionally, she is a poor class facilitator. She doesn't have a good grasp on leading class discussions and instead has her students lead discussions each class. But every time she has an opinion she interjects. As a result no one has real power over the class and the discussion is often boring. Also, her class instructions- what to read, what to write about- are always vague. Not worth 4 credits.  \nWorkload:\nA weekly response to readings. The readings are sometimes interesting and sometimes really boring. 2 outside panel reviews. 1 short essay (1200 words) on the readings. 1 large paper assignment (10-12 pgs) \n"
        },
        {
            "course_name": "Junior Colloquium - Urban Studies",
            "review_date": "May 10, 2011",
            "review_content": "\nShe spends most of class name dropping politicians and asking \"open-ended questions\" where she expects a specific answer. We also didn't really talk about the readings, but about New York City, sometimes in ways related to the syllabus, other times not. There were several times that I wanted to shout an opinion, since that's the only way to really get heard, but just as many times where I just didn't want to bother. Just letting the clock tick down and sometimes doing reading for other classes was less aggravating. Not because she is intolerant of other opinions, though she sometimes is, but simply because it was about obscure issues in New York that I just couldn't contribute anything about, and wasn't really interested in anyway.\nNot a horrible class and easy enough to cruise through without doing much work (she doesn't care if work is late and you can get by without really doing reading), but not a favorite class by any means.\nWorkload:\nOne paper on your hometown, presentation on a neighborhood, weekly response questions (which I'm not sure she looked at) and a final research paper with topic statement, annotated bibliography and outline.\n"
        },
        {
            "course_name": "Junior Colloquium - Urban Studies",
            "review_date": "April 28, 2011",
            "review_content": "\nThe course is standard regardless of the section you are in.  It took a little warming up to Liz.  At first I thought she was close-minded and aggressive, but as the semester progressed she became much more likeable.  I would even willingly take another class with her.  She doesn't take anything too seriously (aka you don't have to stress out, just enjoy the discussion and work) however she is very knowledgeable and clearly prepared for class.  I liked that she let and encouraged strong discussion and disagreement.  The course is reading heavy and the weekly response questions are a bit annoying and mostly useless.  The hometown paper was one of my favorite papers to write so far in college.\nWorkload:\nweekly response questions (3), hometown paper (4pgs), neighborhood presentation, final 25-30 page paper. a good chunk of weekly reading.\n"
        },
        {
            "course_name": "Women & Leadership",
            "review_date": "April 05, 2011",
            "review_content": "\nDo not take this class unless you have to. Liz has very clear opinions and she doe not look kindly on students who think different. This makes you count down the minutes until the class is over. She assigns weekly readings but really we never talk about them in class. All you talk about in class is how hard it is to be a woman - which makes you leave class feeling upset every week. All you talk about in class are issues women face and there is never any resolution to these issues. Liz also loves to talk about herself. If you refer to her or her mother you will probably gain brownie points in class. If you have to take this class just go into it know that it isn't everything the Athena Center says it will be. \nWorkload:\nWeekly readings, presentation on a female leader, attend two lectures outside of class time\n"
        },
        {
            "course_name": "Community Building Seminar",
            "review_date": "January 26, 2009",
            "review_content": "\nProf. Abzug is smart, driven, and intense.  That being said, I loved her class. The readings were manageable (some great, some bad), and she really expects you to participate.  Don't try to BS anything because she'll rip you apart.  And it will be funny.  I learned a lot from Abzug and would recommend her class to anyone interested in urban policy/politics. \nWorkload:\nWeekly readings, one 3-paged paper, one 15-page paper on any CDC (great topic in my opinion)\n"
        },
        {
            "course_name": "Women & Leadership",
            "review_date": "June 05, 2007",
            "review_content": "\nWhile there were good and bad things about this class, IÂ’m really grateful that it was an opportunity for me to get to know Prof. Abzug since she is extremely active in the field and a good person to know in New York.  The course in general is relatively interesting, as we just talked about the images, methods, and successes/failures of women in leadership roles.  ItÂ’s not very necessary to do the reading since most of the conversation hinges on just getting together to talk about these topics, and the seminar style is great for doing that.  The only thing is that you can tell Prof. Abzug is not a professor by profession (sheÂ’s an adjuct who runs a consulting business and just teaches one class a semester).  While she has a great outside perspective on the issue because of this, she is not great at leading discussions.  SheÂ’ll tick off a list of people in the order theyÂ’ll speak so everyone will put down their hands, and then in no way will she follow this list, so that it can be difficult and frustrating to get the chance to say something.  She can also be pretty rude and judgmental about opinions that some students express in class, and can respond by scolding them to the point where itÂ’s inappropriate if the goal is to encourage academic freedom (I know a lot of other students noticed this too).  Aside from these complaints, however, the class is interesting and easy and you should definitely take it if youÂ’re interested in the topic.  I think all of us were in some way inspired to go partake in leadership ourselves through our studies of great women leaders and their leadership styles.  \nWorkload:\nReading that you don't really have to do.  One 10-15 page paper on a woman leader.  ~2 courseworks write-ups.\n"
        },
        {
            "course_name": "Community Building Seminar",
            "review_date": "May 20, 2006",
            "review_content": "\nProf. Abzug is a solid professor.  She's not the most amazing prof. anyone will have, but she's definitely above average.  Community Building was a seminar, and she did a great job of keeping discussions lively and engaging for everyone.  She was also good at letting people talk or not talk as they wished, while also encouraging wide participation.  The readings could be a bit redundant and sometimes boring, but you don't need to do them all to keep your head in the game in class.  There's not a whole lot else to say--Prof. Abzug was definitely understanding and willing to give extensions and that kind of stuff.\nI know some reviewers have lamented Prof. Abzug's eagerness to share stories from her work, which can sound a bit like name-dropping.  To me, it never came off that way.  Her work--outside of Columbia/Barnard--is as a community developer, and it always seemed to me that her stories were meant to illustrate the very real implications of the material we were covering.\nWorkload:\nPrepare discussion questions for one class, 3 pg. field review, in-class presentation, final 15-20 pg. paper.\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "November 16, 2004",
            "review_content": "\nGreat professor who really knows her stuff.  Don't miss out on an amazing opportunity if you get the chance to take a class with her!\nWorkload:\na lot, but its set by the department so it's the same in either section\n"
        },
        {
            "course_name": "Community Building Seminar",
            "review_date": "May 06, 2003",
            "review_content": "\nProf Abzug is AWESOME! Not only are the papers manageable (one 3pg paper and one 15pg paper), but its actually a FUN class! Shes extremely knowledgeable. The weekly readings can be long at times, but you can skim it to get by.\n"
        },
        {
            "course_name": "jr collq & Building Community",
            "review_date": "May 23, 2002",
            "review_content": "\nAwful Prof? No Way! First, if U.S is your shtick then her class will give not only a sound foundation but one friendly, nurturing and fun atmopshere to do it in. Yes, the readings are long , but you can skim and still come out way ahead. 1/3/- 1/2 grade based on class participation; so if sitting quietly in the background is for you , look elsewhere. She's fair, knowledgable,amd down to earth...a rare commodity in this place. \n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "January 27, 2002",
            "review_content": "\nShe has a great reputation in New York politics but she is an AWFUL professor. Very self-absorbed. Always talked about her community board and how much they did, and also her losing campaign for city council. She might be a good person to know to get you a job or something but she didn't carea bout the class. \nWorkload:\nThere was massive amounts of reading---maybe 500 pages a week---3 books or so---but i heard they changed that. Also one BS paper that doesn't matter for anything. The big thing is the final research paper---20 pages ors omething---and a presentation. I doubt she spent much time reading them They key to a good grade is participating in class discussion. Split up the reading and only read the intros just so she'll know you read in the 10 minutes of conversation before she starts talking about herself.\n"
        }
    ]
}