{
    "prof_info": [
        {
            "prof_name": "Susan Mendelsohn",
            "prof_id": 10786,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 24, 2013",
            "review_content": "\nSue was super cool. Not going to say this is an easy class but from my knowledge UW in general is not a walk in the park to say the least. \nSue set the class air as one that was casual to improve circulation of ideas. I appreciated the more comfortable atmosphere. \nGrading: A little stricter on the whole spectrum of things\nShe implements Google Docs which was nice and efficient in my opinion. May be a little harder if you aren't used to using it. She also provided audio commentary to give you a better understanding of what she meant. \nShe also has a pie policy and guys, 10:10 AM UWriting class is so much better with pie. \nWorkload:\n4 Progressions. 3 drafts due for each(exploratory, formal, final)\nLots of mini excercises in between\nreading heavy in the first half of semester\n"
        },
        {
            "course_name": "university writing",
            "review_date": "January 15, 2012",
            "review_content": "\nSue is a fantastic UW professor who really cares about her students growing. She's the head of the writing center, and associate director of the undergraduate writing program. UW is her passion, and it shows. If you lucked into Sue in the lottery, breathe a sigh of relief. She's a great professor. If you're deciding who to take, I definitely recommend Sue as long as you're willing to put in some effort.\nShe's very responsive to student feedback. Based on comments from students in the semester those culpa reviews below are from she trimmed way back on the reading for our class. I imagine she may give the next class slightly more reading, since we could certainly have handled it. \nThe actual progressions can be frustrating and difficult for everyone. We were experimenting with some new assignments, which I think was interesting for both us and Sue. She did a pretty good job of helping guide us to complex arguments and great prose.\nShe doesn't provide much feedback on grammar, citation formatting, etc. Hopefully you're already excellent at the basics when you came to Columbia. \nKeep up with your drafts, and get them to her on time. Her feedback is incredibly valuable. Go in to see her at least once every progression, but more often and you'll do better and be a better writer. You'd be an idiot not to meet with her frequently.\nBring pie to class!\ntl;dr: She's a fantastic UW experience, enjoy.\nWorkload:\nReading assignments for every class, less than those older reviews. \nWriting exercises or drafts for the current progression basically every class.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 11, 2011",
            "review_content": "\nSue Mendelsohn is honestly an amazing instructor! TAKE THIS CLASS! It's honestly harder than the other University Writing sections, but this is Columbia University, so get used to it. Anyways, you should be all right with proper time management. She sincerely cares about her students and offers pie! She'll respect your opinion and offer you a chance to share your thoughts. TAKE THIS CLASS! You will not regret it. You'll get more out of this class than most people (isn't that what the core is for?)\nWorkload:\nTons of reading. Regular UWriting essays with more time, but graded more strictly. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 05, 2011",
            "review_content": "\nSue deserves a Golden Nugget! Right now. I know she is a new professor this semester, and has only had 14 of us as students, but she deserves one all the same. The first day of class I considered switching out because she seemed so intense and assigned us so much work. If you have this sentiment, DON'T SWITCH OUT! Seriously, Sue cares more about our Uwriting class than any teacher I have ever had. Even though she was writing her dissertation and was completely overwhelmed with writing center business, she was so passionate and engaged every class period. In our last class (right before she invited us to her apartment for delicious lasagna), she started tearing up-- the perfect embodiment of her love for teaching and our class. I think I improved so much, both as a writer and a person. \nWorkload:\nAlot, more than most UW classes. And she's a tough grader... but such an awesome person that grades don't matter! Also, at end of semester she rounds up a few students grades one half letter (like B+ to A-) if she feels that you have put excellent effort, so participate ALOT in class! The conversations are so engaging that you'll want to participate regardless!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2010",
            "review_content": "\nthis woman is da bombbbbbbbbb\nShe's the head of the writing center, she cares sooooooooooooo much about her classes, and she really cares about her kids.  I def. became a much better writer thanks to her.  Also, she invited us to dinner at her place, we often brought (or she brought) pie and cider to class for all of us.  Insightful readings, presentations, videos, etc.  This class is hard, but probably the best Uwriting class you could get for your monayz.\nSue is also a rockstar at life.  She's like the Dos Equis man, but in woman form.  Such a boss.\nWorkload:\nreally really really really fing hard. too much. soooooo much to read, and so much to write.  three articles (at least) to read for every class (and they aren't short--try reading three articles, all about 10-16 A4 size pages, for every class). Also, lots of writing for every class too--not just essays, but many many m any ungraded papers.  Sometimes it was hard to keep up, but so worth it; also, sue makes you want to work harder and do really really well because she's just so good at life, so that's part of the reason that the work load is so intense.\n"
        }
    ]
}