{
    "prof_info": [
        {
            "prof_name": "Brian Cole",
            "prof_id": 647,
            "total_reviews": 22
        }
    ],
    "reviews": [
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 21, 2015",
            "review_content": "\nBrian is one of the nicest teachers I've ever had.  He has a genuine appreciation for physics and enthusiastic students, and he has many office hours and review sessions.  I started Columbia in the spring before I took 2801, and the number of close friends I made before 2801 pales in comparison to the number of close friends I made after enrolling.  Brian encourages students to help each other out.  I don't know whether this helped me understand the material, but it was nice to have moral support, and I think I will keep some of these friends for the rest of my life.  The grading was fair; if you understand most of the problem sets and do each one independently, you'll do well.\nThere were some downsides, however.  I would not recommend taking this class unless you are pretty serious about physics.  The assignments probably would have taken me 10-18 hours a week on average if I had sat down with each of them in a quiet space and finished them.  I certainly had friends who could do them in less time, though.  Sometimes I would not know how to do a problem, but there is a lot of support available in the form of office hours and friends.  I would recommend making at least two good study-buddy relationships.  Brian is neither the most organized or punctual person, but he does try his best.  He sometimes assumes that you understand more than you do, but if you are in this class you probably understand more than you think you do.\nI found this class rewarding over all.\nWorkload:\nWeekly problem set\n2 midterms\n1 final\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 13, 2015",
            "review_content": "\nThere is no excuse not to take this course if you are interested in physics. Actually, there are plenty of excuses, but in the end, I at least found the course worth the effort. Let me get the one potentially off-putting fact out of the way: Homework is at least 8 hours a week. The problems are of varying difficulty, and Cole often times struggles to get the problems published on time. If you take this course, do not wait until the eleventh hour to start your psets. Exams are much easier than the psets, I found the questions reasonable and the curve forgiving.\nThe material is not terribly difficult once you understand it, but it takes a lot of effort to get to that point. I am leaving this sequence with a much better understanding of physics than I started with. In the first semester, our treatment of special relativity was well motivated and interesting. In the second semester, our exploration of E&M; tied in perfectly with relativity and quantum. Actually knowing these physics topics is very rewarding.\nCole is a great teacher; he is truly excited about physics and about teaching you physics. If you are up to the challenge, it would be a shame to miss such an exciting class.\nWorkload:\nWeekly Problem Sets\n2 Midterms\n1 Final\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 29, 2014",
            "review_content": "\nProfessor Cole is a brilliant researcher who works with the ATLAS experiment at the LHC, but he's also a great teacher, a real diamond in the rough. However, this course is designed for physics and other majors who want a rigorous introduction to modern physics. To that end, the structure and content of course material is often designed to be a precursor to more advanced classes in the physics department. It is not for the faint of heart.\nBrian effortlessly takes multiple approaches to any given problem -- especially approaches that involve a more intuitive understanding, but which one wouldn't otherwise see in an introductory course because the math is a little harder. He'll regularly ask for a show of hands (\"who has seen this before?\") to see whether he has to spend more time on an explanation, but if it's not new material, he won't dilly-dally on the basics. Further, like any good science professor, Prof. Cole wastes no time emphasizing numerical values or particular equations, preferring that his students understand careful definitions and observations, or \"the physics\" behind the writing on the blackboard. \nAs a student coming from a math-major background, I was delighted to see a deliberate amount of rigor and derivation of results in lecture. It's also great that, in addition to the traditional classical mechanics (1st semester) and electricity & magnetism (2nd semester), we covered special relativity (1st semester) and elementary classical waves and quantum mechanics up to the Schrodinger equation (2nd semester). I liked moving at a fast pace. But if this is not you, and you're not interested in cultivating a strong background in physics and an understanding of the physical underpinnings of the world, this course is *not* for you.\nAs Brian warns you outright at the beginning of the class, 2800 is a difficult course, and according to many former students, the most difficult course you'll take at Columbia. Regularly a quarter of the already small class drops out over the course of the year. The problem sets are HARD. They are NOT the type of problem sets that a reasonably motivated, smarter-than-the-average-bear first-year who goes to every lecture and recitation can expect to complete in one night. The most well-prepared students at recitation usually spent the entire weekend on the problem set and hadn't finished. (Speaking of, come to recitation with questions or just to absorb advice about problems you haven't tackled yet -- this will be absolutely invaluable, especially second semester, because the TAs, bless them, have already done the problem set themselves.)\nProblems in Kleppner & Kolenkow (mechanics, SR) and Purcell (E&M;) tend to be time-consuming but only rarely very difficult. The problems that Cole LaTeXs up himself are often much harder, as previous reviewers have noted. Sometimes he'll literally guide you through a derivation as if you're giving the next lecture. The nice thing about them, though, is that you get a sense of accomplishment at the end that you don't get from K&K; or Purcell problems. You honestly do learn as much from the problem sets as you do from the lectures.\nAnd all of that being said, grading is not really an issue in 2800. Prof. Cole curves to somewhere around a B+ or A-. He really gets to know the students who come to lecture and/or office hours and is willing to grant extensions when necessary. Also, if you're interested in research in the physics department or beyond, go and talk to him -- he's very friendly and more than willing to give you advice or recommend you to another professor.\nA grueling, self-esteem-destroying course, but Prof. Cole will help you understand and learn to enjoy \"the physics.\"\nWorkload:\nA problem set every week (10 or more hours on each one -- if you work quickly). These are reportedly worth 20% overall. Two midterm exams and a final each semester -- Brian tries to make exams as stress-free as possible and provides previous exams as practice, and often problems are similar between years -- for that reason, exams aren't that difficult.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 20, 2014",
            "review_content": "\nI want to start with saying totally understand why people may dislike Professor Cole. He is not cut out for teaching a standard intro course. He jumps from place to place and it takes familiarity with the subject material to follow him.\nHowever, when it comes to C2801, I think he's perfect for the job. While he isn't particularly organized, I'd say that's his one flaw and it mattered less and less as the effects of his disorganization became more predictable and easy to accommodate. He is very nice and tries his hardest to make time for his students. This semester he missed one day for a physics conference and another for a trip to CERN but he made them both up. Whenever his work gets in the way of office hours, he extends the due date of the weekly assignment and attempts to schedule makeup hours that work for everyone. You can also stop by his office whenever and if he's there, he'll make time.\nThis doesn't mean that the class is in anyway easy though. The assignments are not short. The problems assigned from the textbook are straightforward but every problem set comes with 1+ \"Cole Concoctions\", problems that reach bullet point k at times and can become very convoluted. When you finally do manage to completely solve them however, you realize you've learned a lot and have a much better grasp of the material than the book's problems were providing you with.\nHe is also very nice with the grading and curved the class to a B+ or A- average (he never did specify which he chose in the end), a nice reward for a grueling semester.\nWorkload:\nWeekly problem sets that sometimes grow as the week progresses, 2 midterms, 1 final.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 24, 2013",
            "review_content": "\nLet me just say first, Professor Cole seems like a genuinely nice guy and tries really hard. Please note I said try. \nIt was unfortunate this semester. He went back and forth from Cern in the beginning of the semester causing us to have a shaky start. Ahh but that was just the beginning. \nI came from Prof. Hughes' class which was fairly straight forward despite the occasional curve balls. Pretty solid class. However Cole wishes for you to \"understand the physics\" and thus proves a lot of equations in the class that I found to be pretty useless. \nProblem sets helped so if you have to take the class do them religiously. Speaking of which, the problem sets from the textbook aren't too bad as you can find loads of help on the internet and from your genius friends. However if you have to interpret his own handmade problems you may need someone that \"speaks Cole\" to even understand what he's looking for. \nTests... He lets you bring in one page of notes for formulas and such you may need. There are two exams and I can't say how well they are spread out as the first test essentially only covered Gauss's Law. I thought they were pretty hard. \nI guess the man is busy and he's used to teaching an advanced class so he was \"dumbing the class down\" but if you are looking for a straightforward class best to avoid this one. \nWorkload:\n8 Problem Sets (Not sure if any dropped)\n2 Exams\n1 Final\nIn general pretty hefty in my opinion\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 09, 2013",
            "review_content": "\nI couldn't believe it when I saw that Cole had a silver nugget, but maybe this just means that I was the only one who despised his class. For another disclaimer, I guess I'll say that I've never liked or been good at physics; although I did manage to get an A- in Hughes' 1401 class, so it's not like I can't learn the subject.\nHowever, in Cole's class, physics just started to sound like a foreign language. Maybe his teaching style just doesn't work for me, but I honestly learned NOTHING in his class. You can tell he is a very smart man, and I know from talking to him that he is incredibly nice, but the man cannot present any of his information clearly, at all!! Even starting with two point charges, he lost me when he failed to explain the VACUUM PERMITTIVITY CONSTANT. When I didn't understand a word he spoke about such a simple concept that I already understood from high school, I should have known to run away as fast as I could. When he explains anything, he is incredibly muddled, unorganized, and will often go back and fix work he'd done minutes ago that was screwing up what he was trying to teach us. I attended every class before the first midterm, and scored about seven percent lower than the standard deviation. I never went to another class, and almost scored a standard deviation above the mean on the second exam. If I did go to class, I left within twenty minutes, because I felt myself just getting more and more confused about topics that the book presented in a very clear, logical fashion. It's frustrating to attend the lecture of such a nice, smart guy, and feel like you can't learn anything from him, even though he is trying so hard to teach well. \nWe didn't even get to optics!!! How!!! It's a necessary part of the course!!!!!\nAll his poor teaching methods aside, he really cares about his students, and even runs his own recitation sections! After reading previous reviews about how amazing he is, maybe he's just struggling to simplify his subject from 2802 all the way down to 1402. \nI wish I could like him. His teaching is just so confusing, and the class is unorganized in general. He promised to upload a syllabus, and just NEVER DID. It took him a while to write the last problem set, and decided to make it due at the final. What. I'd rather study the textbook than try to decipher his awkwardly structured problems to prepare for the final.\nGah! I feel bad for having written this, because he really is so nice!\nWorkload:\nWeekly problem sets were okay, but when he writes his own problems (they're a mix of book questions and his own), it's hard to tell what he wants. Two midterms, which are manageable if you study out of the book rather than your notes from class. I haven't taken the final yet (writing this during reading week). Not sure if any grades are dropped because he never posted the syllabus.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 07, 2009",
            "review_content": "\nBasically, this course covers almost everything that an introductory class can cover. Many parts of it are in class, while the others are in weekly problem sets- killer problems. They can be extremely hard.  Let's just say it's definitely below 10 hours a week for most people... unless it doesn't have that 'Prof. Cole's special question'. Even if you are really good at physics, just writing down the solutions right away takes quite a bit of time. However, it is also very rewarding, and you actually can get the idea how things are done. He does kinda good job at explaining, although he goes into that overemphasizing territory quite often, and he knows what he's doing, although he forgets lecture notes or books quite often.\nGrades. Class is essentially made up of 'science kids' from high school, and usually there are quite a few perfect scores even for hard sets. This applies to midterms too, although in case of midterm they're not really perfect scores- just high scores. The course is curved, but I don't think there are many As.\nWorkload:\nWeekly graded homeworks, two midterms.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "September 10, 2009",
            "review_content": "\nNot for the faint of heart.  Take iff you have a tremendous passion for physics and you have plenty of high-school experienced studying it (with calculus).  The difficulties are immense--the class is incredibly fast-paced, the problem sets are LONG (and often, part of the problem is determining what the mistake is in the question) and the exams brutal.  But what doesn't kill you makes you stronger.  If you're absolutely sure you want to take this course, you will be a better physicist and scholar for it.  If you're not sure, it's not for you.  Take 1601 instead.\nWorkload:\nUngodly.  Problem sets can 10-20 hours, and nearly always require finding your dorm's Physics Genius for help even so.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "May 01, 2009",
            "review_content": "\nProblem sets and their solutions are returned extremely late, if at all.  The problems that Professor Cole writes are RIDDLED with mistakes/typos, and the problems actually grow over the course of the week, as Cole feels the need to keep adding more substance to the p-set.  Lectures that \"only\" finish at 12:35 are considered short to normal (the class officially ends at 12:25).  Other than that, 2800's a really good class, and Cole an awesome professor.\nI'm not actually screwing with you.  This class was without a doubt the most intense academic experience of my life thus far.  Quantum mechanics, E&M;, Special Relativity, and Mechanics all in two semesters.  Not only that, but it uses arguably the most difficult introductory textbooks available: Kleppner/Kolenkow for Mechanics and Relativity, Purcell for E&M;, and Gasiorowicz for quantum (we didn't actually get any book problems in the latter unit, but later classes might.)  If this sounds ridiculous, that's because it is.  P-sets are very difficult, taking a TON of time and sanity, even without their typos.  Exams range from reasonable to hideous.  \n\"What's the good part?\" you might ask.  Brian Cole is one of the best professors I have had so far.  He is truly intent on getting his students to understand the material, and he schedules extra lectures and office hours accordingly.  His lectures are generally very informative and his presentation really clear, though he has a habit of moving too fast for his own good and he makes a fair number of mistakes on the board (if you catch them instead of waiting for him to do so, the class will move at a much better pace.)  He understands that much of the mathematics in the class will be new to students, so he does try to give succinct introductions to the necessary linear algebra, differential equations, Fourier analysis, etc. so that you can actually do physics at a nontrivial level.\nWhich leads me to another point.  A lot of the difficulty of this class was mathematics.  If you consider this class, I'd STRONGLY suggest taking Calculus IV first term and Linear Algebra soon afterwards (I don't know about the honors math sequence).  Understanding eigenvectors, complex analysis, Stokes', Green's, and the Divergence Theorems from a MATH perspective makes the physics a lot easier.\nThe class was well curved first term (the jury is still out on the second term), and though I cannot attest to the next fact yet, according to other students of Cole's 2800 class, many of the rest of Columbia's physics courses are considerably easier having hacked away at the material in this class.\nIn short, you do not just take 2800, you LIVE it.  And though you might think that you will be lost forever in an interminable labyrinth of Green's functions and boundary value problems, be assured that it will end, and that by the end of the journey you will emerge extremely well prepared for the physics ahead.\nWorkload:\nDeath.  And only significantly after Easter will you be resurrected.\n"
        },
        {
            "course_name": "Accelerated Physics II",
            "review_date": "October 02, 2008",
            "review_content": "\nBrian Cole is a BAMF.  I learned far more from a year of Cole's problem sets than from any other class at Columbia. If you just suck it up and actually do the never-ending problem sets you end up learning more than you even know until you see it all again in other classes, PDE, Into Quant, Linear Algebra, Mechanics, all begin with problems easier than the ones treated in Cole's problem sets. A genuinely great intro to studying physics. The guy actually knows what's going on, and he's also busy as hell, but was still willing to do an occasional night lecture if we were falling behind. I don't know why you would pay for Columbia and not take such a sweet class, just wish I hadn't slept through so many lectures.... \n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 09, 2008",
            "review_content": "\nThis man is a fantastic Physics professor whoâ€™s got more on his plate than most mortals can handle.  I have a lot of respect for him- heâ€™s brought our class through the mud and muck of enough angular kinematics to make you dizzy, and our treatment of quantum and classical waves (which will last about a month) required him to spend a half-lecture on vector bases that my linear algebra class took four lectures to cover.\n Heâ€™s got a shit-ton of pressure on him to maximize the scope of the class, though, which means that heâ€™s an organizational disaster.  Iâ€™ve caught three or more typos on each problem set from the beginning of the year, and he makes flat-out unsolvable/â€™wrongâ€™ problems frequently enough that spending 5~6 hours on a single problem really makes you wonder whether itâ€™s you or him.  I donâ€™t meant to bitch, but the man actually forgot to write me a recommendation (actually, fill out a webform, so itâ€™d have taken him approximately 5 minutes) after a month of polite reminders and pleas.\nNevertheless, donâ€™t let that stuff color him wrongly- Professor Cole will take your young, supple mind and fill it to bursting with physics.  If what doesnâ€™t kill you makes you stronger, you will literally be smart enough to blast holes through the spacetime continuum with your mind (or at least know enough special relativity to get your head around that).\n\nWorkload:\nLaughter is the best medicine after spending anywhere from 4 to 15 hours per week on each problem set.  Either that, or you'll end up joining a coalition of homework-doing that cuts that figure to as much time as it takes to do 1/15th of the problem set.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "December 11, 2007",
            "review_content": "\nI'm a little surprised at the silver star next to Cole's name on CULPA, but I guess I'm in the minority.  Having now taken additional physics classes, I now have a better perspective on the them, which leads me to think that Cole did an overall terrible job teaching the class.\nMy biggest complaint is his overall lack of organization.  Problem sets were not handed back in time.  While we had solutions to first semester materials up until the midterm and had gotten back our graded problem sets, this was not true for the rest of the semester.  We did not have a single solutions set for the second semester, and most of the problem sets were not graded.  In my opinion, it is highly difficult to study for a class where I do not receive feedback the homework.  I understand that Cole is probably very busy with his research, but for my two physics classes this semester, the professors have each uploaded solutions in a timely manner.  Problem sets were returned to us as well.\nAnother issue was the pacing of the class (although this probably will get better in the next few years).  Cole spent the entire first semester on Mechanics, leaving us to do E&M;, relativity, waves, and intro to quantum all in the second semester.  As one can imagine, the lectures were rushed, and the problem sets consequently highly difficult to understand.  Cole also had a habit of writing PS questions with errors in them, which did not help the situation.\nI don't deny that I did learn a lot in accelerated physics, but most of it was due to my own efforts, not Cole's.\nWorkload:\nWeekly problem sets with increasing difficulty as he writes more problems himself.  Be wary of typos.  Midterm and final.\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "April 17, 2007",
            "review_content": "\nHe is a giant- not physically, but he is just an incredible teacher.  This is the hardest class I've taken all year (except for 2802) and it requires a ton of work but if you love physics then don't be scared off by this class.  Professor Cole is extremely clear, and he is the nicest guy in the world.  He is often behind on grading and the class is often behind on the problems sets.  He is extremely accomadating.  Don't sign up for the class if you don't want to work hard.\nWorkload:\n1 problem set a week- (~8 per semester)\n1 midterm and 1 final\n"
        },
        {
            "course_name": "Accelerated Physics I",
            "review_date": "January 01, 2007",
            "review_content": "\nCole is incredible.  His presentation of the material is perfect- the class moves at a fast pace yet he is easy to follow and explains the physics perfectly.  I never felt I learned so much in such a short amount of time.  \nWorkload:\nOne problem set a week.  The class is extremely time consuming as a whole and is well worth the 4.5 credits designated.\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "October 07, 2004",
            "review_content": "\nI was in this class for about two-and-a-half weeks before I dropped down to 1403.  Professor Cole is a very thorough professor, and expects you to be able to learn a lot of fundamental concepts very quickly.  In the first week I had to pick up differential equations.  In the second it was complex exponentials.  And in the future it was going to be linear algebra and partial differential equations, and who knows what else.  If you have a solid math background and are interested in covering everything there is to know about describing and analyzing waves, then by all means, take this class.  But if you only want to take it because it looks better than 1403, you'll end up in 1403 anyways.\nOh, and the day that I went to the 1403 professor to get my add/drop form signed, three other people were there asking the same thing.  A class of 65 had fallen to 38 in three weeks.\nWorkload:\n10-20 hours per week on problem sets.  God knows how long to study for the exams.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 25, 2004",
            "review_content": "\nThis course was probably the most postive course evaluation I have ever filled out: the material is fascinating and Professor Cole is spectacular! \nThe course is physics the way it is supposed to be, starting with F=ma and step-by-step deriving harmonic motion, coupled oscillators, classical waves, fourier analysis, electromagnetic waves, and, finally , elementary quantum mechanics.  Almost without exception Professor Cole teaches the material the way that it must be taught for a physcist to understand, which brings me to the first caveat:\nthis course is for PHYSICISTS, NOT engineers!  repeatedly i heard engineering students complaining about the lack of applications and the formalism of the material; well sorry guys but that is what 1403 is for.  This course has a lot to cover, essentially needing to bring up-and-coming physics majors from the introductory level to being able to take 4021 graduate quantum mechanics next year (which is the recommended path for majors), and even with extra classes and extremely generous recitations and office hours by professor Cole we still did not do some of the later material justice.  \nGiven that Professor Cole lives two hours away and works at Brookhaven, he was absolutely great about coming in for extra sessions to help us, sacrificing many hours of his time to help the often-small numbers of students that attended the extra sessions.  He was also exceptionally open to quesions not directly pertaining to the material, for example after the final talking to several of us about the strong force and super-symmetry for at least 45 minutes.  \nSome students have complained about the lack of a textbook, but I found that Professor Cole's lectures notes were wonderful at getting to the heart of the material without the unecessary frills in most newer texbooks...  He provides us with several chapters from the French quantum book for background reading and recommends buying the French wave book as well. His handmade problem sets are terrific. \nIt is only fair to mention that the class is rather disorganized, with due dates and extra lectures being added and changing willy-nilly and the changes (usually) being posted on Cole's website.  This creates a fun casual atmosphere, but it is also irritating at times.  \nUltimately, this course is not for slacker engineering students wanting an easy A, but for anyone who loves physics it is a must-take experience that will change the way you think about and do physics for the rest of your time here.  \nWorkload:\nproblem sets are a blast, but rather time-consuming.  usually are somewhere inbetween 5-10 hours a week.  tests are inherently not that difficult, but i had a real problem running out of time...\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "January 21, 2004",
            "review_content": "\nProfessor Cole's classes are not for amateurs.  He has tremendous ability and intelligence and is clearly highly respected within the department, but for those who aren't supremely motivated and already well-versed in physics, this class will be a nightmare (assuming you don't drop it).\nThe (lengthy) review before this one is pretty much spot on, in the following respects:\n- Problem sets take a LONG time, and if you don't attend class and keep up with the material religiously, you will find yourself playing a continuous game of catch-up from which it is very hard to recover.\n- This past semester he used no book, and no TA.  This meant we were entirely dependent on him and his limited time schedule (remember, he's a big-shot professor) to answer any and all of our questions.  And no book to pore over, not until the last few weeks when we started into the actual \"quantum mechanics\" of the course\n- The course spends 3/4s of its time on waves and the mathematical tools needed to analyze different types and consequences of waves.  Be prepared for matrix algebra and eigenvectors, Fourier analysis, partial differential equations, and so forth.\n-- moreover, if you haven't taken classes that cover these subjects before or aren't taking them concurrently, you're pretty much f'd.  Prof. Cole will, of course, assure you that any math background you need will be amply covered in class, a promise he forgets as he blazes through the lectures, skipping steps and assuming knowledge willy-nilly.\n- Our class started out with roughly 60 people and dwindled to 35 through drops - and these were among the people who felt confident enough on 1601/1602 to try their hand at a tougher physics course.  Many people stopped going to class even if they were going to stick it out through the semester, simply because if they hadn't heard the previous 5 lectures, they wouldn't understand the current one.  The barrier to catching-up is absolutely enormous, and Professor Cole's office hours are generally dominated by fawning nerds who ask pedantic questions, show off their own mastery of the material, and sneer at those of us who legitimately are having trouble.\nIn Cole's defense, I did get the sense that he was genuinely interested in helping his students succeed.  Indeed, he often devoted long office hours on Fridays to answering questions, and would push back deadlines if it was necessary.  (He would also accept stuff late if you didn't make a big deal about it).  However, the disorganization of the class and the many unorthodox decisions Cole made in setting it up (no TA, no textbook, insane problem sets, no ability to catch up...) combined to make this an altogether miserable experience.\nCole's really a nice guy though.  Seriously.\nWorkload:\npainful.  problem sets took me 30 hours a week (yes, i'm not kidding), although most people could do them in half that, and the true experts probably spent 6-10 hours on them.  Midterms are fair but challenging, as is the final.  Cut class at your GPA's peril!\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "January 02, 2004",
            "review_content": "\nBrian Cole started the semester by telling us that we should not buy a textbook for his class because none of them are worth their price. Instead, he would made his lecture notes available online and print them out (when he had time which was about half of the lectures). Brian Cole also decided that because he was not using a textbook he would hold his own recitations. \nThe lectures were at 9:15, but Brian Cole's skill as a lecturer was so strong that halfway through the semester I stopped drinking coffee before coming to class because he made physics so engaging. Many others decided not to come to lecture (maybe because it was at 9 or maybe because the notes were all online) - by the end probably only one-third of the 35-person class would come. Often the lectures would start 5 minutes late because he was late or because he was waiting for enough people (8-10). \nThe class is heavy on the math - a lot of which is above the typical sophomore's level of knowledge. This class is for physics majors, if you're not interested in physics or maybe some applications of math, take 1403. The course definitely ups the ante from 1601/1602, but probably falls shy of the rigor of 2801/2802. They don't let physics majors slip through an introductory sequence without doing some mathematical physics. I thought it was much less painful to do it for one semester as a sophomore than for two as a freshman.\nThe math used includes complex variables (to more easily solve sin/cos differential equations and for the quantum mechanics), linear algebra (to solve coupled-oscillator problems - finding eigenvectors and eigenvalues), partial differential equations (to solve the wave equation). However, Brian Cole provides everything you need to know to do the physics. If you've taken these courses already, you're set; the problem solving won't be challenging and you'll develop intuition very quickly. I took linear algebra and partial differential equations concurrently and it helped tremendously.\nBrian Cole told us he didn't like to talk about grades; he said we should focus on the material and if we learned it the grades would come. Basically, he's telling you to not bitch at him after the midterms and that he'll probably give you an A range grade if you are competent on the exams.\nThe class is pretty difficult. The problem sets take a lot of time, usually, because he uses them to teach extra material. Brian Cole makes himself very available for help, which you should definitely make use of. In the end, it's all about caring. If you care about physics, you'll spend the time doing the homework; if you care about learning how to solve the problems, Brian Cole will guide you through them. Brian Cole care about you - he spent hours writing his lecture notes and creating problem sets, and he expects you to care about learning, and consequently, to not grade-grub.\nBrian Cole is not without fault, however. He can be slow to post homework problems and lecture notes, but will usually extend the deadline if he's late. He also does schedule extra lectures, to make up for days missed for exams or if he misses a lecture, sometimes on Friday (but we often had a problem set due on Friday, so it was already a wasted weekend day).  \nIf you think you're interested in physics, you should take this class. Even if you're unsure, Brian Cole could give you reason to like physics. I thought it would be my last physics class, but now I'll probably take more. If you're an engineer in need of the third semester of a physics track and don't want to work hard, take 1403.\nWorkload:\nDemanding problem sets, pretty standard exams.\n"
        },
        {
            "course_name": "Classical & Quantum Waves",
            "review_date": "November 10, 2003",
            "review_content": "\nProf. Cole is a very nice man but a complete disaster when trying to organize a class. For this semester's class, he decided he didn't like ANY books & so taught only from his notes. He didn't have a TA so did recitations himself, during which he refused to help students 'too much' - which means if you're confused and want to see a problem done, because he really doesn't do many in his lectures and you don't have a book, you're out of luck.\nPerhaps the most annoying aspect of Prof. \nCole's teaching is his complete disorganization and chaotic way of assigning homework. He never posts completed problem sets, but rather parts of problem sets, which are then amended later to add problems and correct frequent errors. \nAnd the homeworks bear only a passing resemblance to his lectures.\nHe schedules exams for random evenings, holds makeup classes on random days. He shows no awareness that students have other classes with other obligations.\nStudent feedback on his chaotic methods is met with silence. He either can't get his act together or just doesn't care enough to try. \nIf you're having trouble imagining just what a mess his teaching is, check out his class website. It speaks for itself.\nhttp://phys.columbia.edu/~cole/c2601/\nBottom line: stick to a professor who bothers to assign things on time and sticks to a fixed schedule so as not to throw his students' lives into chaos.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "September 10, 2002",
            "review_content": "\nOne of the worst teachers I have ever encountered. He is a super nice teacher and he means well but he cannot teach. He paces back and forth constantly and he talks to the chalkboard. He'll try to help you during his office hours. Often the office hours don't help either. Avoid taking him! \nWorkload:\nMinimal; 3 midterms 1 final\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "March 09, 2002",
            "review_content": "\nBefore taking Cole's class last semester, I read the review above by a student who took his 1401-1402 course. Due to the scathing nature of this review, I prepared for the worst. What I found completely flabbergasted me. Professor Cole is one of the nicest human beings in the physics department, always available and glad to see students in his office hours. He is patient, enthusiastic, and really cares about his students. Every class he asked if there were any problems with his homework sets or with their due dates. He held extra lectures on his own time to catch us up when we fell behind in material, and even scheduled a fun optional lecture on quantum tunneling at the end of the course because he thought the material was so cool. He also likes to see enthusiastic students poke their heads up above the silent crowd. His chalkboard notes weren't perfect, but he really reaches those who truly listen to him. His explanations made sense! I learned more in his one-semester course than I could have possibly imagined, and I now feel significantly better prepared for future study in physics than the students who took the two-semester 2801-2802 track. For whatever reason, the student who did the previous review was completely out of his/her mind, and I think it would be a shame if other students missed out on so good a professor because of that terrible and unfair review.\nWorkload:\nWeekly problem sets of varying length, some from the book, but the best written by the professor personally. These special \"hand-made\" problem sets were some of the best learning I have done so far as a physics student here. Two midterms and a final. Tests are tricky in general and really make you think, but he often makes them open book.\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 10, 2001",
            "review_content": "\nI saw a skit one time about a guy who couldn't modulate the pitch of his voice.....well that reminds me of Prof. Cole. Prof. Cole is the most dry, boring, horrible, (you can keep inserting negative adjectives if you'd like) teacher I HAVE EVER HAD!!! People tell me he's brilliant, and maybe he is, but he couldn't teach to save his life. He is boring as hell and I think he talks to hear his own voice. He spends entire class periods on derivations, but once he reaches the final formula, that is it. He does not show you how to attack a problem using it. He said at the beginning of 1401 that he didn't want to just put up formalas and not explain them, so instead he puts up derivations and doesn't explain them. And his derivations are mainly equation manipulations that any monkey could do, so they don't even help in your understanding of the material. You walk out of every class either feeling well rested from the nap of utterly confused from listening to his useless drivel. And to make matters worse, he isn't even a nice guy. He doesn't even attempt to be friendly towards his students, even the 8 or 9 that actually show up to his class all the time. I once asked him to help me out on a problem set problem and he literally looked at his watch the whole time, meanwhile he has no problem going over the time of the class period by about 10 minutes each class. I have nothing nice to say about Prof. Cole. I honestly feel dumber after taking these classes. Avoid him at all costs! Transfer from SEAS if thats what you have to do.\nWorkload:\nBoth 1401 and 1402---About 8 problem sets for the semester, not too terrible, about 4 hours to do each and they are weekly and fairly regular. 2 midterms and a final. 1401 -- Midterms were fair, final was fairly easy. 1402 - Midterms were a little harder but fair, final made me and about 70% of the class practically cry.\n"
        }
    ]
}