{
    "prof_info": [
        {
            "prof_name": "Michael Lipkin",
            "prof_id": 5014,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary German II",
            "review_date": "November 16, 2012",
            "review_content": "\nMichael Lipkin has been an extraordinary success with my German class. His conversational approach to the class really challenges you to think in a different language on the spot. He assigns enough material to reinforce concepts covered in the class. I've taken German three years in high school, but I've learned how to begin to speak and think in German better in just this one semester of Mr. Lipkin's class. He has a very warm and engaging personality. If you're afraid of teachers that like to laugh a lot, then this will not be your favorite class, because he brings so much relaxation to the class. You will find yourself wanting to study either because you don't want to be embarrassed when he converses with you, or because he really just motivates you to study. There is no professor I would rather have had for my first language class. \nMr. Lipkin is truly a brilliant, exceptionally amazing teacher; I can thank him for my renewed interest in German.\nYEAH\n\nWorkload:\nDaily manageable assignments, Test once every other week, No Midterm, and a Final.\n"
        },
        {
            "course_name": "Elementary German I",
            "review_date": "January 15, 2011",
            "review_content": "\nThis spring semester, Michael Lipkin is taking on the daunting task of teaching a class in elementary German. But, I hear you ask, does he have what it takes to rub shoulders with the giants of the German department, with people such as Richard Korb? Will he be able to step out of the shadow of his superstar sensei, Jutta Schmiers-Heller? Can he survive the ruthless Gossip-sessions at the biweekly Kaffeestunde?\nWell, I don't know about all that, but chances are that at least he'll offer a kick-ass class that I know I would want to take if I could do it all over again.\nI'm writing this because I've seen him in action as a Teaching Assistant, and although its hard to extrapolate from that (TA-ing and teaching a class can be very different), I believe that at least, Michael will be a competent German teacher with a refreshing and sarcastic sense of humor and youthful dedication that will make coming to class so much fun that you'll forget you're actually learning, just like he did while TA-ing my Accelerated German class last fall. \n\nWorkload:\nAgain, I'm only guessing, but I would say that Michael's class will probably feature group exercises, class discussions, blackboard teaching, movie watching, and individual work in the Language Ressource Center lab.  There will probably be  test every two weeks our so, as well as written essays. However, Michael seems to be a pretty relaxed person, so I'm sure the workload will not be keeping anyone up at night. There's is a certain amount of boring yet easy grammar to get through in this course, as well as a lot of vocabulary to learn. But with his extensive knowledge of German culture, experience from living in Germany, and (I just have to stress this) great sense of humor, I'm sure he will make that experience as enjoyable as it can get.\n\n"
        }
    ]
}