{
    "prof_info": [
        {
            "prof_name": "Jocelyn Shu",
            "prof_id": 12656,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Science of Psychology",
            "review_date": "May 27, 2013",
            "review_content": "\nI love psychology and Prof. Rakitin's class is a good introduction to the subject. There are, however, a number of issues with his teaching style: (1) his lectures tend to be too focused on the topics HE wants to discuss; (2) they seem like a vinyl record played at the wrong speed (i.e. way too fast for any intelligible information to get through without you laughing at the \"funny voices\" coming from the phonograph), and (3) they provide little opportunity for those really interested in the subject to explore it further.\nWith this said, he is not the worst professor on Earth. He motivates you just enough to keep you interested and the occasional errors during lecture are more due to his delivery speed than lack of knowledge of the subject matter. He knows his stuff, for sure. He does deliver on a series of fronts and if you go to his lectures, you will do fine. It is true most exam questions can be answered after just reading the textbook, but the second part relies heavily on Prof. Rakitin's actual lectures. Attending them may well mean the difference between a B+ or A- and an A. His scaling formula for exams is okay, although he never explained how it works. (See below for a critique on his \"normalization\" of WA scores).\nRead the textbook and attend lecture, even if it is to take a good nap. One day, perhaps, you will be able to catch something useful from Prof. Rakitin's monologue. He gets a B+ for his teaching abilities.\nWorkload:\nExams: 3 midterms, graded on a mysterious scaling formula (third midterm offered as the final exam), consisting of two parts: the first part is entirely based on the textbook, especially material Prof. Rakitin did not cover during lecture (watch out for key concepts and their application to straightforward situations); the second part is mostly based on the lectures (not just the uploaded slides, but what he actually says in class). \nWritten Assignments: 3 two-page essays, pretty structured, about one of two assigned readings; the formula used to normalize grading among TAs (from 1 to 5) is absurd at best, unfair at worst (even if you get a 5, you will end up with a substantially lower score); beware, the TAs ask for a critique of one study presented in the articles, but do not specify that they expect you to read the ACTUAL research study, so you really need to read TWO articles to get a good grade. \nExperiments: 5% of the final grade is based on participation in 6 credits worth of experiments run by the Psychology Department (yes, we are the guinea pigs).\n"
        }
    ]
}