{
    "prof_info": [
        {
            "prof_name": "Ling Yan",
            "prof_id": 2487,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "May 22, 2016",
            "review_content": "\nTAKE YAN LAOSHI'S CLASS! I don't know why she doesn't have more (recent) CULPA reviews. She is the sweetest, most adorable professor ever. I spent so much of both semesters of this class laughing, but also definitely learning Chinese. Her teaching style is super effective, and she gets everyone to participate. Most of the people that took the fall semester stayed with her for the spring, and I totally understand why. She clearly cares about her students, and does everything she can to help them. There are due dates on all assignments, but she basically always accepts work late, and even allows people to make up quizzes/memorizations. Chinese is obviously a tough language, and it's almost like learning two at once between the pinyin with tones and the characters, but the structure of the class really keeps you on top of things since there's almost always a quiz or test or memorization on any given day. If you can get into her section, definitely take it. I hated the 4:10-5:15 time slot, but I stuck with it. I'm so sad she doesn't teach intermediate because I cannot imagine that I will have a better experience with another Chinese professor than I have had with her!\nWorkload:\nTypical Chinese. Additional weekly drill session and something's due every day. However, that means less prep is necessary for tests.\n"
        },
        {
            "course_name": "Readings for Modern Chinese (4W)",
            "review_date": "May 17, 2011",
            "review_content": "\nYan laoshi is awesome.  Always smiling, excited, and laughing.  She really enjoys what she does, and enjoys students.  The test questions come from the homework, the å\u0090¬å†™s aren't usually difficult if you put in an hour of studying (which you should be doing even without quizzes) and doesn't so much have a late-work policy.  Just get the homework in at some point and you'll be fine.  She doesn't have strict guidelines for much of anything, really, aside from that there are definitely 'right' answers on the sometimes ambiguous homework questions.  Speaking of homework, it is not difficult, necessarily, but time consuming.  At least 3 to 4 hours per.  \nWorkload:\nChanged from 1st semester to 2nd semester, but fundamentally it goes thus: tingxie every day, test thrice a semester, [somewhat gnarly] homeworks due for every lesson every other week or so, and essays due every other week.  not so bad if you like chinese\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "March 17, 2009",
            "review_content": "\nAbsolutely amazing teacher.  If you are struggling with Chinese or starting it for the first time, you should definitely take Yan Laoshi's class.  Obviously you do not know the particular Chinese professors until the first day of class when the names magically appear on the Directory, however, as soon as you do, go to her section ASAP!!!  She is funny, kind, attentive, courteous, approachable, and an excellent ally in the Chinese Language Program.  While her lectures can be all over the place and her PowerPoint presentations and grammar explanations vague (though cute), she will spend hours of one-on-one time with you in a non-condescending and truly educational way.  Unlike most Chinese professors, she will NEVER make you feel dumb.  Simply put, she is a teacher first and foremost.  Finally, she makes an effort to weed out the plethora of lying Chinese speachers who register for the N-level sections, sending them quickly to the W-section for Native Speakers.  Do WHATEVER you can to take her section; you will NOT regret it!\nWorkload:\nSame as ALL sections.  Dictation, Character sheets, and Character quizzes every week.  Five tests and a final.  Oral Midterm and Oral Final Exam.  One or Two short essays.  Weekly diary entries of 10 sentences minimum.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 16, 2008",
            "review_content": "\nI thought Yan Ling was a good instructor for this course. I've decided to stick with her for the second semester of the elementary course, actually. \nShe is friendly, very good at getting people to speak up, and in general explains things pretty well.\nSometimes she doesn't understand the implications of the questions that people in class ask... as is natural with people teaching their own language to foreigners. However she seems to have enough teaching experience to anticipate where the problems are going to come up. \nI thought this course was not divinely inspiring or academically riveting, but you get through a lot of chinese.\n\nWorkload:\nNormal for 5-credit Chinese course. Character sheets, quizzes, tests, recordings. You'll be doing a lot of work. Its manageable. Go figure. \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 16, 2008",
            "review_content": "\nI thought Yan Ling was a pretty good instructor for this course. I've decided to stick with her for the second semester of the elementary course, actually.\nShe is friendly, very good at getting people to speak up, and in general explains things pretty well.\nSometimes she doesn't understand the implications of the questions that people in class ask... as is natural with people teaching their own language to foreigners. She seems to have enough teaching experience to anticipate where the problems are going to come up.\nI thought this course was not divinely inspiring or academically riveting, but by god you get through a lot of chinese.\n\nWorkload:\nNormal for 5-credit Chinese course. Character sheets, quizzes, tests, recordings. You'll be doing a lot of work. Its manageable. Go figure. \n"
        },
        {
            "course_name": "Readings for Modern Chinese (4W)",
            "review_date": "May 18, 2008",
            "review_content": "\nThis is as much a review of the course as the teacher, but this class was--for everyone involved, without exception or exaggeration--a godawful screaming trainwreck.  Yan laoshi is very nice, there is no doubt about that.  Nor is it her fault that when program head Liu Lening tapped her to teach the class, he decided to scrap Meng's excellent textbook and  compel her to write an entire new book in twenty days just so he could put his name to it.  This is not rumor, it's the truth from Yan's own mouth.  In any case the book was an extraordinary disaster, so riddled with typos and mistranslations that homework assignments were impossible.  The problems with the textbook, from which we never diverged, were too legion to detail here.  Suffice it to that that the unquestioned consensus within the class was that the textbook was insultingly amateurish and unfit for any class, much less one here at Columbia.  As far as Yan laoshi's teaching technique, she relies almost entirely on powerpoint, which is infuriating, and insists on explaining words we don't know with MORE words we don't know, which is remarkably demoralizing.  She doesn't understand the need for repetition and reinforcement.  Finally, all we ever did in class was read overly complicated sentences right off the powerpoint, so while my reading-out-loud has improved, everything else has gone to pot.  The focus of the class is entirely on literary chinese, which is not very useful.  I would not recommend this class to anyone for any reason; I would furthermore recommend taking anyone else's class, including Su taitai's.  Take Meng.  Accept no substitutes.  Aside from being unrelentingly unpleasant, this class will torpedo your GPA through no fault of your own.\nWorkload:\nNegotiable.  She originally planned for us to learn an entire chapter's worth of words, do the homework AND write an essay--every night.  No joke.  We talked her out of it.  But she still had no notion of how long the work takes, which makes it unduly heavy.  Five tests, none of which are dropped.  Weekly homework which is impossible to do without a list of errata from the book, which she never provides.  Seriously, stay far, far away from this one.\n"
        },
        {
            "course_name": "chinese 1",
            "review_date": "July 22, 2007",
            "review_content": "\nshe is an awesome teacher!! very understanding with beginners but tough enough to make you learn a lot. \nWorkload:\nstandard for chinese class (which means weekly recordings, quizzes, grammer exercises, and a test every other week). yes, its a lot. you will have memorizations every night and a quiz every other day or so- some spoken, some written. You get used to it though and i think out of a class of 20 there may have been only one b or a-.take her class!\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "March 30, 2006",
            "review_content": "\nvery nice teacher, tries very hard to make sure  you understand. She loves to answer questions and she is very quirky. I just love her, even though class sometimes is a little boring but she makes it so funny when we go off topic sometimes. very standard chinese class, powerpoint slides for our lessons and she just explains them. participation here and there and a few acting out scenes. She loves to do scenes and make you present in class\nWorkload:\ndictation quizzes, character quizzes, 5 tests, final, midterm oral exam, drill sessions on the side, character sheets, grammar sheets\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "November 04, 2005",
            "review_content": "\nYan Laoshi has to be the best teacher I've had at Columbia so far. She drills us incessantly on the vocabulary and grammmar, but she is always willing to answer any questions we have. She spent the first week of class teaching us tones & for the rest of the semester will point out even the slightest mistake in our speaking. But what really makes the class is her quirky personality and unique sense of humor that brings an amazing livelihood to the class. If you're planning on taking Elementary or Intermediate Chinese, definitely look for prof. yan!\nWorkload:\nStandard for a 5 point Chinese class: recordings of dialogues, character and vocab quizzes, tests, a weekly drill session, & presentations\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "April 17, 2005",
            "review_content": "\nReally nice and quirky teacher who actually knows how to speak English.  She is always willing to answer even the most nit-pickiest of questions about the slight nuances of the Chinese language. She stresses pronounciation and tones a lot and will correct you for the slightest of errors.  But your pronounciation will improve a ton. She will drill you on the grammar until you know it in your sleep. \nWorkload:\nNormal for a 5-credit Chinese class. Character quizzes, presentation memorizations, dialogue readings. \n"
        }
    ]
}