{
    "prof_info": [
        {
            "prof_name": "Nicole Callahan",
            "prof_id": 13117,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 21, 2016",
            "review_content": "\nYou're a lucky student if you get Nicole Callahan as your CC teacher. She made CC incredibly interesting and entertaining. She really understands her students and tries to relate the texts to situations that we might face so that we can understand the texts better.  Most text discussions would start out as little group discussions and if we got stuck on an idea she would steer us in the right direction. She also made the class feel very familiar with each other so you were very comfortable sharing your ideas every time you stepped into the class. Furthermore, she usually baked us something! Nicole bakes some of the best banana bread and chocolate chip cookies i've ever had. All in all, it's been the greatest class I've taken at Columbia and I wouldn't hesitate to take it again if I could. \nWorkload:\nWeekly discussion board posts and responses.\n2 longer papers\n1 midterm\n1 final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2016",
            "review_content": "\nNicole is honestly awesome.  She's a friend to all of her students, looks out for everyone in her class.  She is engaging and makes even the driest parts of CC interesting and applicable.  She is very fair with her grading and if you go to her office hours and reach out for help she definitely appreciates it and is more than happy to help.  She will push you and challenge you with some difficult assignments and papers, but she is always looking out for her students and doing whats in their best interest.   Highly recommend for anybody looking to have a positive CC experience.   \nWorkload:\nFair, responses for each reading for class on courseworks that don't take more than 20 minutes each night.  Few Papers.  Her Midterm and Final are tough but fair, not out to trick you with IDs.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 30, 2015",
            "review_content": "\nLoved CC with Nicole! She made excellent additions to the syllabus second semester including Foucault, MLK, and Animal Farm. We even delved into Baldwin and contemporary texts and explored the relevance of philosophic texts in light of recent events in Ferguson, Baltimore, Paris (Charlie Hebdo), etc. She also prompts us to make connections between authors, to modern events, and to our own lives in our weekly commentaries and long essays. Nicole is a fair grader and a kind soul who bakes us muffins and cookies on a weekly basis. She is kind and attentive in office hours and the passages she chooses for the midterm and the final are ones we have discussed in class at length. I highly recommend taking CC with her if you can.\nWorkload:\nEach semester's workload:\nBiweekly commentaries that became weekly commentaries second semester\n2 paraphrases (choose a quotation and explain it)\n2 essays with excellent prompts\nMidterm: passage IDs and extra-credit vocab and concept explanation\nFinal: passage IDs, essay (she chooses 2 prompts from a list of 5 that she gives you beforehand), EC vocab\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 30, 2015",
            "review_content": "\nBest CC teacher at the school. Very helpful with students and bakes muffins or cookies for a lot of the classes. Can't ask for much more.\nWorkload:\nTwo 2 page papers, Two 5 pages papers, Midterm, Final\n"
        }
    ]
}