{
    "prof_info": [
        {
            "prof_name": "Shayne Legassie",
            "prof_id": 763,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2008",
            "review_content": "\nShayne is learned, insightful, extraordinarily articulate, and has the most creative, active mind I have ever encountered. These alone would make him a great professor. However, he is also dedicated, funny, generous and kind. When I was a prospective student Columbia promised I would study with world-class minds who would broaden my mind and change the way I thought. With Lit Hum, the University made good on its promise. After a semester in Shayne's class, I can say that I have learned to think in ways I never knew I could. Shayne does not just tell you want to think about books but breaks down literary analysis into understandable components and uses class discussion to allow students to take the parts of books that most interest them and apply those analytical skills. Simply put, in Lit Hum I learned how to read. Shayne also taught us how to write. Reading draft after draft of our writing, he has taught me and my classmates how best to make academic arguments and has also encouraged us to pursue the topics we are most passionate about. Shayne's class has challenged, enlightened, and even entertained me. You could not ask for a better prof. \nWorkload:\nHeavier than other sections. The standards for written work are exacting, but laid out for you in advance. You also get as much help as you need in drafting and redrafting papers. It's a really hard section, but if you care at all about becoming smarter, take this class with Shayne.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2008",
            "review_content": "\nShayne is learned, insightful, extraordinarily articulate, and has the most creative, active mind I have ever encountered. These alone would make him a great professor. However, he is also dedicated, funny, generous and kind. When I was a prospective student Columbia promised I would study with world-class minds who would broaden my mind and change the way I thought. With Lit Hum, the University made good on its promise. After a semester in Shayne's class, I can say that I have learned to think in ways I never knew I could. Shayne does not just tell you want to think about books but breaks down literary analysis into understandable components and uses class discussion to allow students to take the parts of books that most interest them and apply those analytical skills. Simply put, in Lit Hum I learned how to read. Shayne also taught us how to write. Reading draft after draft of our writing, he has taught me and my classmates how best to make academic arguments and has also encouraged us to pursue the topics we are most passionate about. Shayne's class has challenged, enlightened, and even entertained me. You could not ask for a better prof. \nWorkload:\nHeavier than other sections. The standards for written work are exacting, but laid out for you in advance. You also get as much help as you need in drafting and redrafting papers. It's a really hard section, but if you care at all about becoming smarter, take this class with Shayne.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2008",
            "review_content": "\nBy far the best class I've ever taken anywhere. I can't believe how much we learned. As other people have noted, Prof. Legassie doesn't simply teach content and themes. Instead, he teaches you how to analyze the works yourself and find interesting things to say anywhere in a book. The atmosphere in the class is electric--the intellectual excitement of everyone is always palpable and contagious. Legassie requires a lot more effort from you than other professors, but for every hour he asks you to put in, he gives you back two, whether in office hours or in spontaneous meetings about your writing or phenomenal field trips. I loved going to this class and I started missing it before it even ended. \nWorkload:\nIf you're looking for an easy section, this isn't for you. IF you want a core experience that will rock your world, put in the extra effort\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 23, 2008",
            "review_content": "\nI had Shayne for Lit Hum last year and it was an amazing experience. The more time that passes since I took Shayne's class the more I grow to appreciate a) how uniquely dynamic, challenging and fun it was and b) how essential and empowering the skills are that Shayne teaches. There is not one paper I've written at Columbia in which I did not use the tools of textual analysis and/or argument development that I learned from him. \nTake it from someone who is HIGHLY critical of all of my teachers: this man is a gem as a person and, more importantly, as an educator. Take whatever class he teaches and you will look at your work with fresh eyes and excitement. \nWorkload:\nNothing out of the ordinary for Lit Hum reading. You will spend more time on your 2 papers than most of your friends in other sections but Shayne will guide you and the end product will be totally worth the effort.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 24, 2007",
            "review_content": "\nI miss LitHum. CC is fine, but nothing can compare to the year I spent in Shayne's class. At the time I didn't realize how rare it is to be in a classroom full of people who are excited about having done the reading and who are excited because the professor has made learning about so many things so much fun. Although I'm not a \"literature person\" I couldn't wait to do the reading for LitHum, and even though I didn't finish Don Quixote--Shayne had us read the whole thing--I read the rest of it this summer because our discussions about it were so exciting.\nLitHum was the best learning experience I've ever had and Shayne the best teacher. My only complaint is that now everything else seems a little bland in comparison.\nWorkload:\nA little more than other sections==we read all of Don Quixote, for example. He's also hardcore about writing. This is great in the end, though, because once you're a sophomore, writing papers is a breeze. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2007",
            "review_content": "\nFor my third essay, I e-mailed him asking for help on my thesis. He was in Butler and read the email and saw me in the room at the same time. He came up to me and asked if I wanted to talk to him then and there. It was a Saturday afternoon and we ended up talking for about an hour. Even though he was busy he was willing to set aside all that time to help me.\nShayne is extremely patient, approachable, and brings a refreshing mood to the classroom. You've probably noticed from today's class that he doesn't usually lecture but rather facilitates discussion. I know that he rereads the books along with his students every year, because he says he notices different things and teaches differently from year to year. Shayne often takes into consideration someone's comment or idea earnestly which I wish older instructors would do more frequently.\nHis style of just facilitating discussion and rediscovering the texts we read along us is, I have to say, a risky approach on his part. On rare occasions, when it's a slow day for everyone the discussion can get stale and slow without any progress made. But there are those classes I live for when we hit upon a gold mine and just dig and dig. During these classes I truly feel as if I own a piece of the intellectual back-and-forth that went on - that I really contributed something. This is Shayne's goal.\nHe's eaten lunch with me and some other students in John Jay and planned many field trips to the Met and Cloisters and plays. these are great. \nWorkload:\nReading : ~50 pages a night\nEssays: four 5pagers and they're all pretty much open topic\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2006",
            "review_content": "\nAs the other reviewers have mentioned, Shayne is both intelligent and a committed instructor, and is appropriately inspiring and demanding. He lectures briefly and only occasionally (in the semester I was in his class, he lectured about three times), and only to provide necessary background about a text. The remainder of the class is dedicated to discussion, which he engages but lets flow where it will. Again as previously noted, this occasionally leads to long pauses in the discussion (especially in the 9 AM section), but it's far superior to any other mode of instruction I've experienced. It forces you to think carefully about your opinions and positions about the texts, and gives you an opportunity to test your own inferences and interpretations against the observational and interpretive powers of your classmates--and of course, against Shayne's almost encyclopedic knowledge of literary thought and criticism.\nIf you can, take Shayne's class. Any class you can. If you do, try to spend the time to do as much of the reading as you can. If you can't do most of the reading, think hard about the reading that you do complete. Talk to him about it. Develop your thoughts. Get his feedback on your papers. His class will make you smarter.\nWorkload:\nTwo relatively short papers, one midterm, final. Exams are graded generously. Papers are not graded as easily as in some other sections, but if you really care about your grade--or just about understanding your subject--Shayne provides ample office hours. Lots of reading (it's Lit Hum), but as noted above you can select fairly narrow paper topics and still get a lot out of it if you think carefully about them.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 03, 2006",
            "review_content": "\nI had a good experience in Shayne's class. He's friendly, knowledgeable, and a great teacher. He doesn't give a lot of the busy work some of my friends got in their classes, and thank goodness for that. The class is really just a big discussion--he starts with a passage or just opens up the floor completely. The conversation moves from passage to passage, from book to book, from century to century, and even from Thucydides to 28 Days Later. The discussion is very student-oriented, and sometimes it leads to long, awkward pauses in which everyone twiddles their thumbs and stares at each other. Shayne'll sit there, and eventually someone will chime in. Not doing study questions or the like puts more responsability on you, but I liked his style of teaching--very refreshing after 12 years of elementary, middle, and high school. Even though you can't choose your Lit Hum prof, if you get Shayne, count yourself lucky.\nWorkload:\nThere is obviously a lot of outside reading because it is Lit Hum, and Shayne adds a few extra essays. There are two 1500- to 2000-word essays, a midterm, and a course-wide final. There is mo busy work which is a plus.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 28, 2005",
            "review_content": "\nThe first review of Shayne's Lit Hum class is right on.  While Shayne is a demanding instructor, you will benefit greatly from this class.  The overarching theme of the course thus far has been the use of rhetoric.  You will gain an excellent understanding of rhetoric; how and why it is used for different functions throughout the readings.     In the beginning of the semester Shayne had difficulty directing class discussion into unifying themes, but he has since improved.  He started to provide topics and themes on which the class would focus while reading, so discussion would go smoothly.  Shayne's questions can be intimidating, and the silences that follow may feel awkward, but he will appreciate just about any contribution you can offer.  He is very understanding and available; he will also appreciate you coming to talk to him about your essays.\nWorkload:\nLike the other reviewer said, the midterm and final were graded easily.  He emphasized that the he used the tests just to make sure you were reading and had some understanding of the works.  The essays (there are two per semester), however, are graded very difficultly.  Hapazardly putting together 1500 words about one of the readings will not cut it.  Overall, however, his grading system is fair because the ease with which the midterm and final are graded makes up for the grading of the essays.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 15, 2005",
            "review_content": "\nShayne is a very challenging and demanding teacher. Though he demands close and often mentally taxing analysis of the selected readings, he tends to pose questions for discussion that take him minutes to articulate. On more than one occasion, after a period of awkward silence, a brave member of the class has had to ask \"what was the question?\" In other instances, Shayne will ask a mindlessly simple question that through his circuitous wording intimidates most of the students.\nShayne is relatively passive when it comes to stirring class participation, so several students use the hour-and-fifty-minute period to get some sleep, much to the dismay of those who are attentive and actually want to learn something about the book in question.\nIn the realm of grading, I have found him to be light on the midterm and heavy on the papers. The midterm was absolutely nothing out of the ordinary, and if you had anything to say about the books (that had some unifying trend), you probably did pretty well on the essay section also. As for the papers, Shayne's standards are amazingly high. Not that this is bad a thing, but if there is anything that will drop your grade, it'll be his papers. Be sure to see him once or twice per paper and try to workshop your paper in class. Even if this doesn't help you much, he'll probably appreciate your initiative. Oh yes, a word to the wise: he will not tolerate a poorly structured essay.\nWorkload:\nA LOT OF READING - you will get through the readings considerably faster than most of the other lit hum sections. We seem to be about one work to a work and a half ahead of the other sections. In addition, Shayne adds some articles in literary theory that are incredibley confusing. These don't appear on the midterm or final though.\nLittle or no written weekly assignments - Shayne is huge on papers and also rarely assigns short explications (usually to determine the theses of your papers). There is virtually no other homework.\n1 midterm - very straightforward. If you did most of the reading and paid attention in class, you should be more than prepared.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 24, 2005",
            "review_content": "\nAcknowledging previous reviews, it is very hard to get an A in his class. Although this might have a deflationary effect on your GPA at a school where everyone else gets an A- just for showing up, this class will help you think, argue, and write in ways that you never imagined you could. Since I took this class two years ago, I've had no problem writing successful research papers, and more impressively, have never lost a debate with my parents. In short, swallow your pride and do whatever you can to take his course. He's one of the best teachers in the business. \nWorkload:\nUW--It's never pretty\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 07, 2004",
            "review_content": "\nThis is a review I should have written a long time ago. Shayne is very smart and an incredibly committed and effective teacher. Taking his class helped me become far more organised in my thought and in my writing. I do not remember enough else. Shayne is wonderful. Help him help you and you'll learn a lot. \nOh yes, Shayne was so good that he was an instructor for L&R; instructors the year after he taught us. And then I believe he pioneered the University Writing course. But I'm not sure. I don' t think he teaches L&R; anymore. But take anything with him. He's too bright and too committed not to do a brilliant job.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "September 21, 2003",
            "review_content": "\nAt first I was scared. Not only did Shayne ask tough questions in class, but he also wrote comments on my papers like \"this isn't really an argument but rather a stream of unconnected ideas that has overflowed its banks.\" It didn't take me long, though, to realize that he wasn't a jerk and that, in fact, he was the best teacher I've had at Columbia so far. Thanks to his thorough comments and helpful conferences by the end of the semester I felt like a more versatile thinker and much more confident writer. As for the man himself, he's super intelligent, friendly, funny and really cares about the progress of his students and can talk about Foucault, Grand Theft Auto, psychoanalysis and porn (!!). He's also stylish and cute. \nWorkload:\nA lot. Get used to it. (It's worth it in the end).\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 14, 2002",
            "review_content": "\nShayne is an excellent teacher. He is very good at getting students to understand the logic and the strategy behind arguments. He does not lay down rigid rules for structure (like a lot of L&R; instructors seem to), the understanding being that your arguments should find their own. His classes are usually very engaging, he gives extensive feedback on each essay, and is a great help outside of class. Shayne helped me a great deal in polishing my writing, and I left his class with a good understanding of several important concepts. He obviously loves his subject, he enjoys teaching, and he's a wonderful person --a combination that would make any class fabulous.\nWorkload:\nRegular L&R; workload.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 15, 2001",
            "review_content": "\nA great teacher. He is very laid back in class and is always helpful with papers. You can tell that he enjoys being there and makes the class somewhat enjoyable. He is a harsh grader, though, and the grades do not improve much even though he says that you are improving. It is EXTREMELY difficult to get an A on a paper, and there is no inflation at the end of the semester.\nWorkload:\nUsual work load, 2 a week for the first half of semester, 1 long a week after that. Not lenient, both in grading papers and final grades.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 13, 2001",
            "review_content": "\nAt first I was taken back by how casual he is, but soon I realized how committed he is to the class. Although he's not a professor, he is very well qualified to teach the subject and is exceptional at probing into the finer points of an argument. The classes can be really dull, though, because they are usually centered around the analysis of classmates' writing samples. In general, he's got a good sense of humor, and is more than willing to meet with you out of class to try to help your writing. Also, he is a tighass grammarian, and has memorized all the sections of the Bedford handbook, but in the long run, this is actually quite helpful.\nWorkload:\nA paper every class for the majority of the class, then 3 long (one for every two classes) at the end. He is a harsh grader (I don't think anyone has received an A at all in our class), but his comments are very helpful at helping you refine your writing. But it definetly is a lot of work to polish your papers to his liking. He is especially a stickler for grammar and MLA guidlines.\n"
        }
    ]
}