{
    "prof_info": [
        {
            "prof_name": "David Keyes",
            "prof_id": 2885,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "July 02, 2008",
            "review_content": "\nBrilliant Professor teaching an introductory class. He cares about his students - use him and his TAs as resources and you will do well. Relatively generous end of semester curve. Lazy BMEs might struggle.\nWorkload:\nMedium - hard to study for the quizzes and problem sets are worth a lot (very worth the effort). No midterm - final is difficult.\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 19, 2007",
            "review_content": "\nSimpley put, David Keyes is way too smart for this class. He's brilliant.  I think that the teaching of the class is just too smart for the class.  \nThe concepts are hard (especially ODEs) and the exams and quizzes are worded really differently from the homework, so it makes them really challenging.  But judging by if you're reading this review, 2102 isn't a choice for you.  You have to take it, and Keyes is the only instructor.  \nWorkload:\n8 Problem Sets (All nighters the night before they were due), 6-7 hard quizzes, 1 ridiculous exam.  It's a hard class.\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 16, 2007",
            "review_content": "\nI think both reviews of Dr. Keyes are fair.  Dr. Keyes clearly loves teaching, and will send you multiple witty and informative emails every day.  If you feel lost in lecture, don't feel too bad.  He lectures at a very high level and loses most of the class mid way through lecture, I think.  The textbook was not bad, although I used an older version.  I recommend supplementing your notes with Wikipedia articles, which are extremely clear and provide good examples.  \nOne thing you need to get used to quickly--Dr. Keyes writes a lot on the board AND on the quizzes.  Quiz questions are often paragraphs in length.  And the questions are not always straightforward, they require some ingenuity.  Do not let the length of the question scare you.  Partial credit was always generous.  \nThe final exam was quite difficult this year, and he told us in an e-mail that the previous year was too easy, and this year was too hard.  So next year will probably be a compromise, but do prepare to be tested on some of the most obscure parts of the course. \nI found Keyes to be both supportive and so accessible.  He travels a lot, and despite this, answered many of my questions at late hours via e-mail.  And he's psyched about math, so enjoy him.\nWorkload:\n6 quizzes, drop 1.  An EXTRA quiz is given during reading week, so take that and it's 7 quizzes, drop 2.  Biweekly problem sets that get progressively longer as the semester goes on.  Open book/note final that you will need to study for.\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "April 17, 2006",
            "review_content": "\nProfessor Keyes definitely knows the material and is actually exited about it, but he does not teach the class in a straightforward, clear-cut way. Especially for an introductory class youÂ’d expect the concepts to be laid out logically and with patience, but this is exactly what Prof. Keyes does not do. His handwriting is very legible on the board, but he writes too much too quickly and skips over a good portion of the material. Instead, he fills class time explaining special cases and other things not directly related to the book material or homework.  The only way to easily follow what heÂ’s doing in class is to read the book material beforehand and understand it. Unfortunately the book (Â“Advanced Engineering MathematicsÂ”, used Spring Â’06 semester) is also a problem because it is longwinded and hard to follow. One of the common problems in the book is that it only explains techniques once, often inadequately. Sample problems can be hard to understand because the book doesnÂ’t take the time to write out a full explanation, skipping over parts from previous sections it assumes you know perfectly well. For this reason doing the homeworks (homeworks consist of book problems) can feel like a logic game; I spent a lot of time just figuring out how the book did the sample problems! The TAÂ’s arenÂ’t that great, so donÂ’t expect to get much from recitation. Overall however, the class could be a lot worse, and especially if youÂ’re familiar with the material it doesnÂ’t take too much effort to walk away with a decent grade.\nWorkload:\nHomeworks consist of book problems and are due every one or two weeks. They are slightly too long. There are quizzes every few weeks which are difficult because they do not always correlate with the homeworks/book material. There is no midterm. One homework and one quiz are dropped.\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "April 15, 2006",
            "review_content": "\nProfessor Keyes is one of the best math teachers I've ever had. He loves teaching and tries his best to present very dry topics with some level of engagement. He is really, really dorky but he can be funny that way. He's very accomodating with scheduling quizzes and problem sets for religious holidays and such.\nHe'll sometimes lose most of the class during lecture, but the material he covers is usually above what you need to know for the quizzes.\nHe does one of the three weekly recitations himself, in which he'll give you a good idea of what's going to be on the next quiz (as opposed to the TAs, who seemed pretty incompetent as teachers).\nAMPA 2101 is probably a class you'll have to take. It's not such a killer.\n\nWorkload:\nEight reasonable problem sets, six in-class quizzes, and a final. One bonus problem set and final to make up for one for an equivalent to dropping two quizzes.\n"
        }
    ]
}