{
    "prof_info": [
        {
            "prof_name": "Marie-Stephanie Delamaire",
            "prof_id": 8620,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2015",
            "review_content": "\nThis was the most painful class I have taken at Columbia so far.  I love art and was really looking forward to this class being light and fun, but it wasn't.  This is not a history class, but rather the focus is on being able to analyze the structure of painting, sculpture and architecture, which is cool if you are able to understand your instructor.\nMSD has a french accent which can sometimes be difficult to understand and she also has a tough time with effectively relaying concepts.  Her presentation of material is also highly disorganized which makes it extremely difficult to take notes.  She'll show you one slide, grill you with questions that you aren't sure of how to answer, and move forward 3 slides only to go back 2 previous slides.  It was all over the place and super frustrating.  She did make herself available after class or by email, but asking for clarification didn't really help.  I spoke with many students in the class that felt just as frustrated and lost.\nThe workload was time consuming and some assignments actually included drawing.  One trip is to St. John the Divine Cathedral which you are expected to draw the outside facade of the church and part of the inside.  Granted, she explained she wasn't expecting a masterpiece, but it was time consuming and unnecessary, especially if you can barely draw stick figures.  The reading material was dense and uninteresting, and she made sure you read it by assigning reading responses.  3 to 4 museum trips, St. John the divine and walk around campus drawing columns.  Exams are a mix of identification of works of art, definitions and short essays analyzing known and unknown works.  Tough grader.\n\nWorkload:\n3-4 museum trips, trip to St. John the Divine, several reading and writing responses, midterm paper, midterm exam, final exhibition or 4-5 page paper, final exam.  \n"
        }
    ]
}