{
    "prof_info": [
        {
            "prof_name": "Mark Kesselman",
            "prof_id": 475,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Political Economy and the Sociology of Global Capitalism",
            "review_date": "January 17, 2005",
            "review_content": "\nInteresting class which really (to me at least) made clear several of the negative results of globalization. Professor Kesselman is very intelligent and a good lecturer, though he only dictates notes which can be difficult for some. I enjoyed the laid-back environment of this class, though the grading of the papers tended to be more harsh than most Pol Sci classes I have taken.\nWorkload:\ntwo papers averaging about 7 pages in length and a final exam which came to about 10 pages. Weekly reading ranges in length from 50-150 pages, but it is not absolutely required though most will be discussed during additional sessions. \n"
        },
        {
            "course_name": "Political Economy and the Sociology of Global Capitalism",
            "review_date": "April 03, 2004",
            "review_content": "\n I entered the class from the opposite end with my view on global capitalism: that we are all doomed.  I took this class looking for hope, but really in the end didn't learn much I didn't already know, except for the fact that many \"ivy league\" students don't know as much as I learned in my AP Human Geography class in high school.  I was very inspired by this class in high school, and was hoping to further my knowledge on the issues involved, and was very disappointed that this is as far as the knowledge gets in college (this being the 4000 level and all).  So, it's pretty easy, no reason to be intimidated. \nEveryone should take this class BECAUSE YOU SHOULD REALLY KNOW THIS STUFF.  Yes you.  Really.  You.  For real.\nWorkload:\n3 papers.  You don't have to do all the reading.  But you should at least skim everything.\n"
        },
        {
            "course_name": "Political Economy and the Sociology of Global Capitalism",
            "review_date": "December 01, 2003",
            "review_content": "\nThis class is a must for anyone interested in political or economical aspects of globalization. I took the class the first semester of my sophomore year, and at first it seemed very antimidating to be the youngest student there. But that quickly faded, and I found that the class was very manageable regardless of its 4000 level. As a Republican, a previous CULPA review almost convinced me not to take the class with the warning that Prof. Kesselman roasts capitalism. But, after taking the class, I think he roasts Capitalism where it deserves to be roasted. I entered the class an unabashed proponent of free trade and globalization, and I am still leaving the class as a globalization proponent. Yet I find that now I am much more critical of the premises of globalization. \nFrom posters in the halls of SIPA, I take that Professor Kesselman is somewhat of an expert in marxism, but don't expect his class to just be a mindless portrayal of marxist ideals. Instead, to me it seems he roasts the far left as much as he roasts the far right. This class will leave you will a completely different view of how the global economy works, and how it can be made better. After this class I still believe in free trade, but I am more aware of the challenges of free trade that must be overcome. I would HIGHLY recommend this class to all.\nWorkload:\nLots of reading, as with any political science class, but discussion sessions really help to get it down. Three papers overall (2 are 5-7 pages, 1 is 8-10). Very doable. \n"
        },
        {
            "course_name": "Comparative Politics Seminar: Organized Labor and Social Movements",
            "review_date": "August 13, 2001",
            "review_content": "\nMark (who requests you call him by his first name) is a great man. He realizes that juniors in the major (and seniors who have been abroad) rarely have a clue how to write a 40-ish page paper, and is prepared to guide you along the way. His office hours fill up quickly, but are always encouraging. I left them with an average of half a dozen new ideas scribbled down. Our seminar received emails from him at least once or twice each week, and they were not always seminar-related. He often took the time to encourage us to attend lectures, conferences, dinners, etc. He is probably one of the most approachable professors in the department. I'm not sure what a larger lectures would be like with him-he seems especially well-suited to smaller discussions, but certainly take a class with him when he is back from his sabbatical.\nWorkload:\nWeekly readings-some were shorter than others-mostly social movement theory. Long research paper- anywhere from, in his words, 25-100 pages. Presentations go along with both the reading and the papers.\n"
        },
        {
            "course_name": "Comparative Politics Seminar: Organized Labor and Social Movements",
            "review_date": "December 31, 1999",
            "review_content": "\nKesselman is the sweetest, most forgiving Professor you're ever going to meet. His office hours are better kept for chatting, \"don't worry about the paper,\" he'll say \"it's great, I really feel that it's going somewhere.\" -Even when It's evident that you don't even have a thesis. Some of the readings are standard theory texts and the more interesting one's are provocative. Hopefully, you'll enjoy Mark's left-wing politics. BEWARE REPUBLICANS -capitalism will get roasted. But stick with him and you'll walk out saying, \"hmmm, what a good man.\"\nWorkload:\n1 Reading Presentation, 1 BIG paper. Weekly discussion questions.\n"
        }
    ]
}