{
    "prof_info": [
        {
            "prof_name": "Shree Nayar",
            "prof_id": 1812,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Computer Vision",
            "review_date": "December 12, 2016",
            "review_content": "\nThis is a super interesting class for those interested in learning how everyday image processing algorithms work. It provides a comprehensive survey of vision algorithms from the ground up: from lenses and sensors (hi, photographers!) to basic 2d stuff to algorithms that reconstruct depth from multiple points of view to neural nets in the last lecture. With Deep Learning(TM) being billed as the one algorithm to rule them all, it was interesting to see how many simple, interpretable models have good performance without less complexity and faster run times.\nProf. Nayar's lectures are fun and engaging -- he applies his sense of humor and PowerPoint animation skillz to make CV easier to learn. You don't need any books since the slides have all the formulas, derivations, and examples you need to do homework. (I wish we could get electronic copies of the slides, since it's in a computer **vision** class, sometimes you need to see the colors in a diagram/picture for things to make sense. And videos in the slides are completely lost in translation. But it doesn't sound like he plans on making the change any time soon.)\nI really dislike how the teaching staff handled office hours. It felt like every other week, they were held at a different time and place. As a TA for a similarly large class, I know that it's hard to teach and study at the same time. But there is a minimum quality of service that we need to provide our students.\nWorkload:\nWorkload: We have 7 homeworks. All of them included programming in MATLAB, and most had a written (math) component. They took me about 8 hours each. I liked that they allowed us to build things like a panorama app or computing depth from shading -- very gratifying when you finally get it working. It was frustrating not being allowed to use libraries for almost anything, including simple functions like converting an image from color to grayscale. I spent too much time reinventing the wheel and debugging problems related to MATLAB's flipped image coordinates or 1-based indexing, and not enough time working to solidify the algorithms we covered in class. \nThe midterm exam was similar to the written parts of the homeworks, but more in depth. Kind of hard to study for. Expect to memorize a couple random formulas or you will not have a good time on the exam.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "August 13, 2016",
            "review_content": "\nMaterial was hard to understand. \nEasy material was covered until the registration deadline. \nOnce the students are registered the material becomes hard. \nThere is a group of shree's favourite students who will get good grades. \nWorkload:\nToo much work.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "June 08, 2014",
            "review_content": "\nVision was the most rewarding class by far. Prof. Nayar is funny, smart and makes lectures very interesting. He has an answer to all of your questions. He likes discipline, mind you, but is not that fanatic about it.\nYou cannot miss any of his lectures as the slides will stare at you when you prepare for the midterm or final. You get printed slides so you just need to take down additional notes (if any).  In Spring 2014, he tried a lot of new material and so the overall workload increased exponentially after midterm. He also took feedback post midterm and in the last class to update the class materials. There were review classes in the lecture before the tests which were quite helpful, if at all you started preparing!\nIt helps to have a study group as making sense of each slide takes up a lot of time although everything seems like a breeze during the class. TA's were very helpful. Thomas was a little picky in giving points but used to explain important concepts easily. You won't understand where exactly you lost points but they do indicate the relevant challenge number. Though programming in MATLAB seems easy, debugging is a headache. Make sure you proceed step by step. Just a tip: avoid built in functions unless you are completely sure of what they return. Getting a working solution was not enough to secure full points. You need to provide a 'smart' solution.\nI was taking Computer Graphics along with it and I must say a lot of my fundamentals got cleared through this class. His 'Math Primer' slides were just mind-boggling. Everything was explained in such an elegant manner. Overall, \"you get a lot for the tuition you pay\" in Prof. Nayar's words!\nWorkload:\nHeavy. 5 Homeworks (1 Theory, 4 Programming + Theory) + Midterm + Final.\nYou generally have more than two weeks for each HW. No late days. First assignment had basic MATLAB intro but some challenging theory questions. Second one was the toughest for me and I lost a lot of points since I started just the night before. Rest of the HWs were decent and rewarding provided you start early i.e. the previous weekend or so. You implement a panorama stitcher, refocusing app...how cool is that!\nMidterm as well as the final were not tough but there were few challenging questions to identify people who could think a little out of the box. Overall the avg was quite high ~ 20/30 midterm and ~ 35/48 final.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "May 18, 2014",
            "review_content": "\nPossibly the most difficult class in the CS department. \nProfessor Nayar is also possibly the best professor in the department. Great lecturing style, clearly super intelligent, and genuinely does his best to make sure we understand the material. That said, we cover a lot of material in this class, and preparing for the exams is hellish. The exams generally cover some of the easier concepts in the class, but it's also easy to lose points on proofs and there are also quite a few questions where you just have to remember a specific detail or some model which you otherwise can't derive on the spot. No way around some of this stuff unless you put a lot of time into memorization of the material.\nHomeworks are great! They're done in MATLAB now (I think he said they were in C until a couple years ago), so they're constantly evolving - Nayar admits as much himself, especially that he put a lot more material in the class and on the HWs this semester. This is not a class you want to procrastinate on (nor can you afford to). If you start the night before, you may stay up all night, and just not be able to finish due to the difficulty of some of these homeworks. You should start at least a few days before so you have time to consult the TAs because you will inevitably run into MATLAB bugs, amongst other issues with understanding the Vision algorithms themselves.\nYou should probably attend every class because Professor Nayar doesn't post any of the material on courseworks. The TAs print out all the lecture slides and you pick up one of these packets at the beginning of each class. These are literally just printouts of the slides, so you'll want to take miscellaneous notes and comments based on what the professor says while presenting each slide.\nWe didn't receive any information about the distribution of grades this semester, so I can only comment that my grade was definitely lower than expected. A few people have said the same thing about their grades, but we can't make any generalizations. Just know it's a hard class - if you get a low grade, don't worry too much about it because this is one of the best, most useful classes you'll take in the CS@CU department, from one of the best professors around.\nWorkload:\n5 homeworks (1-3 non-programming, 1-2 programming problems per HW). HW is 50% of your grade. Midterm (15%), Final (35%). Homework could take anywhere from 5 to 40 hours per assignment. Writing the skeleton code for basic functionality doesn't usually take too long if you understand the algorithms/concepts to use, but there are always faster and better ways to implement certain things. Whether it's MATLAB vectorization or clever use of convolutions, you have to think things through pretty well to attain top marks. This takes time, and can cause problems if you're not already familiar with MATLAB syntax and other tricks. \n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "May 12, 2010",
            "review_content": "\nI can see why people like him, but the material is extremely difficult, beware!\nHe makes lectures interesting and funny, but he glosses over important concepts and you never feel like you understand anything until the difficult midterm and final come around. You'll have to study your ass off just to pass.\nThe programs are a lot fun. They take some thinking, but overall they're well-structured and very useful. The theory questions on homeworks are impossible.\nWhat's very unfair about this course though is that you can't recover from a single bad grade on anything (hw, midterm, or final). A single mess-up will glare at you on your final grade, not to mention that the curve is very small. The difference between letter grades is very slight, only a few points will be bump you up from a B+ to an A (notice there's no A-). But only a few points will drop you down from a B+ to a B-.\nUnfortunately he grades strictly by the numbers, and no amount of asking questions in class, going to office hours, or demonstrating grade improvement throughout the semester will factor into your final grade. He has no problem setting the average to a low grade.\nWorkload:\n5 homeworks (they get easier over time)\n1 midterm (impossible)\n1 final (difficult)\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "April 15, 2008",
            "review_content": "\nProfessor Shree Nayar is the best professor I met at Columbia.  The course is very informative.  He gives great lecture with a sense of humor.  The TA are very helpful.  The assignments are not that hard but yet gives you a sense of how things really work.\nI highly recommend this course to anybody who has interest in vision/graphics.  It's a must for students in vision/graphics track.\nHighly recommended.\nWorkload:\nNot bad.  The assignments are getting easier after the third one.  But you need to spend lots of time on the slides to make sure you really understands the materials.\nFinal and midterms are well organized.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "March 03, 2008",
            "review_content": "\nProfessor Nayar is tied for my favorite professor.  The main reason I believe he is so good is because he conveys material in an extremely concise, understandable and well-spoken manner and really knows the subject inside-\nout.  He is also very approachable in person and makes an effort to know students on some basic level.\nThe only thing that was a little weird about the vision class was the lack of math -- it was all in the slides but there is essentially no math in the entire class, which is in sharp contrast to the textbook.  In addition, the first homework is pretty ridiculous in many ways and shouldn't be considered as a measure of the class' overall worth.\nProgramming assignments are engaging, and exams are very fair.  Prof. Nayar makes use of the entire spectrum of scores on exams, and I feel gives proper questions to let those who understand subjects thoroughly to stand out.  The one complaint about them is that he does not even give a format for the exam, let alone sample questions -- this was very nerve-wracking for me personally but it ended up OK in the end.\nWorkload:\nThe workload for the class is VERY front-heavy, so just get down and dirty early to enjoy the freedom from work at the end of the semester.  It can definitely be a more difficult workload, but not too bad.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "January 15, 2008",
            "review_content": "\nProf Nayar is a natural. He is clear and cogent and drives all the relevant points home. Be sure to hang on to every word he says, because its generally very deep. If possible, make notes on top of the slides he gives, they make it easier to understand them when you study for the exam. This is a no-nonsense course, only relevant stuff is taught. Therefore, read the slides very thoroughly. Its not much to read, compared to the Horn book which is quiet abstruse. The class is a great learning experience. Particularly because of the simplicity that Prof Nayar brings to it. If you ever have anything remotely close to Vision take this class. If you don't, take it to experience what a great teacher is like.\nWorkload:\n5 assignments. If the first freaks you out, hang in there, things just get easier. Overall assignments are easy. The slide handouts are all you need to prepare for the exams, and yes, some presence of mind.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "December 09, 2003",
            "review_content": "\nI loved this course.  Professor Nayar is an excellent lecturer.  He provides the class with handouts containing almost every slide he uses (yes, he uses slides on a projector, which is usually a bad sign, but he pulls it off well)... over 400 pages per student across the term.  This minimizes how much you have to take down in terms of notes, and allows you to spend more of the lecture making sure you understand, rather than copying down diagrams.\nI have to agree with the previous review: Professor Nayar's digressions are always interesting, and regardless of whether they help understand the material, they help understand the motivations, or how vision works in humans.\nIt's not an easy class, but if you come to lecture all the time and pay attention, you shouldn't have trouble with the homeworks... \nthe midterm and final may be a different matter though.  However, the professor and TAs are very helpful in office hours.\nWorkload:\nThe homeworks aren't so bad... 5 or 6 of them, and I found that the programming actually got easier as the term went on (after the third homework).  However, the midterm and final were... insane, I thought.  The best study advice I can give is:  If you think there's no way it'll be asked, memorize it.\n"
        },
        {
            "course_name": "Computer Vision",
            "review_date": "November 23, 2003",
            "review_content": "\nExcellent course taught by an excellent professor! The course revolves around the idea of teaching a computer to extract information from visual images, such as the position of an object, the position of edges, shape/depth of a scene from multiple images. Some of it will make you rethink the many things we as humans take for granted, and Shree likes to insert pertinent biological/philosophical/tech-biz tidbits that encourage an appreciation for the material beyond a purely CS perspective. The underlying theory could potentially get very mathematical, but Shree avoids that and focuses instead on the general ideas and principles. In sum, the subject material is interesting, challenging at times but rarely impossible.  As a teacher, Shree is one of the best out there. He is entertaining, funny, and very dedicated to making sure we learn. He is also a very effective lecturer with excellent presentation. So, although he is quite a busy man (a lot of conferences to attend) and had the TAs teach a couple of classes, I feel that we learnt more in his classes than usual.  All in all, a great experience and highly recommended.\nWorkload:\n5 HW assignments, each of which involves both writting exercises and 3-5 programs. Programs can be challenging, but again there's nothing impossible. Shree and the TAs are very helpful. If you keep up with the class and don't procrastinate, you will be fine.\n"
        }
    ]
}