{
    "prof_info": [
        {
            "prof_name": "Lening Liu",
            "prof_id": 34,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Classical Chinese I",
            "review_date": "December 31, 2011",
            "review_content": "\nI agree with the last review. Though Liu does give you the impression that he's not entirely emotionally invested in the class, he is a professional and does a pretty good job teaching the material. This isn't to say that the pedagogy is perfect. In my eyes there are a lot of things that could be changed about the way that Chinese is taught at Columbia, but that's more of an institutional critique than anything against the man himself (though he is department head, so these issues still may bear mentioning). He operates well in the system that has been set up.\nI really appreciated Liu's formal treatment of Classical Chinese grammar. Being able to parse a CC sentence and understand all of the stuff that's going on underneath the hood is awesome. I wish that they had this sort of thing for the Modern Chinese courses. It might have something to do with the fact that this is taught in English. Whatever it is, the guy knows his stuff. I know much more now than I did in September. Liu also seems to be an active member in the academic community, for what it's worth. If you have questions about Chinese literary culture or linguistics, he's your guy. He also has a kick-ass reading voice that I am determined to master.\nAs a person, Liu seems like a pretty nice guy. I didn't pick up any of the mystique (either good or bad) that gets attributed to him in some of these reviews. Part of this might be because these classes were at 9 in the morning. I had to miss a class once and he had no problem letting me take the test scheduled for that day earlier. I've never seen him lose his temper--nor does he particularly seem to care when you hand in your homework. There doesn't seem to be any real penalty for turning in your work late. He grades them all in piles anyway. He's less concerned with grades than most. I wouldn't hold that against him. The final project is a nice affirmation of the skills you pick up over the course of the semester. Your ability to translate a passage from the Records of the Great Historian is direct proof of what a mini-badass you've become. This course gets you pumped up for the next semester and ready to do some real heavy lifting. which is good because Branner's section starts at 8:35 IN THE FREAKING MORNING ON MONDAYS, WEDNESDAYS, AND FRIDAYS !!!11!!!11!1!\nWorkload:\nThe amount of translation you're actually expected to do is minimal. The daily dictations are trivially easy for anyone that has experience learning Chinese (you just need to be able to recognize the traditional characters, at no point will you be expected to produce them from memory). Class time is spent working through the text with a lot of hand-holding from Liu. Some people get more out of this than others. If you ask questions about translation, you may be able to glean more insight into why a passage was translated in a particular way. If you just are in it for the A, memorize exactly what he says and spit it back out on exams. \nHomeworks and tests pop up from time to time. Don't worry about them. A homework sheet can (and should) be completed in a single night while eating a five guys burger and watching sports highlights on youtube. If you're a weirdo and actually count the number of minutes you spend working, I'd guess you could finish the work with about forty minutes of effort. \nTest prep--reread the stuff you're being tested on and reread the homeworks. You will have seen everything Liu puts on a test several times before. \n"
        },
        {
            "course_name": "Intro to Classical Chinese I",
            "review_date": "November 10, 2011",
            "review_content": "\nHaving read the other reviews, I am a bit surprised at the bad rap Liu gets here.  He is, to quote another review, a cool guy, definitely not a strict grader, and reasonably good at explaining complicated grammar despite his accent.  [In response to a few other reviews] I'm going to pull an unpopular card and say that if you, the student, didn't remember anything from his class, that's your fault and not his. I'll summarize my experience briefly:\n--The study of Classical Chinese is heavy on grammar analysis.  American students are not used to grammar analysis (generally speaking), therefore, it is a difficult subject to grasp.\n--If you do your due diligence and learn the [English] words he uses to analyze grammar, you won't have a hard time getting by.  Grammar vocabulary is just as important as vocabulary in the lesson.  Wikipedia is a good tool for this.\n--The homework is maybe tedious at first, but the homework and quizzes/tests are all constructed the same; that is to say, the sections on both are equivalent and have the same kinds of questions, and therefore there are no surprises when the tests come around.\n--A knowledge of Chinese is extraordinarily helpful.  In no small part because modern Chinese translations of Classical Chinese exist on the internet.\n--I'm in 5th year Chinese.\nWorkload:\ndaily quiz, ~30-40 characters, purely recognition, not writing.  Fortnightly homeworks that, depending on the long translation at the end, take anywhere from a few to a lot of hours.\n"
        },
        {
            "course_name": "5th year Chinese",
            "review_date": "October 26, 2010",
            "review_content": "\nI love the texts read in this class.  I finally get a glimpse of modern Chinese literature read in Chinese and taught in Chinese.  This is no longer just a language class.  It's more like a language class that helps you transition into real Chinese literature classes at Columbia.  \nProfessor Liu is very insightful, but sometimes his lecture feels long.  It's a challenge for me to focus sometimes, but he really explains the cultural nuances and literary allusions in the text.  Hearing his lectures do make the texts much more interesting.  I definitely recommend this class to people interested in Chinese literature.\nWorkload:\ndaily dictations, weekly homeworks, a few essays, and final.  Definitely manageable.\n"
        },
        {
            "course_name": "5th year Chinese",
            "review_date": "September 21, 2009",
            "review_content": "\nThis is a terrible, terrible class.  It's perhaps the only class where I truly felt that I was wasting my tuition money and time.  I don't recommend that anyone take it for the following reasons:\n-the instructor, Lening Liu, is incredibly lazy.  Half the class time is spent with him reading the chapter or story aloud; the other half is him reciting rambling anecdotes about his personal life.  Sometimes a few sexual innuendos are thrown in, making some of the female classmates squeamish (myself included).  \n-the coursework was confusing and unstructured.  I could not discern any pedagogical direction. The texts vacillated between hard-to-read 15th century Chinese literature and modern texts.  Mostly, it was there to showcase Liu's learning and \"excellent\" reading voice.  \nThe class size dwindled from 15 students to 7.  And not because it was difficult.  The ones who were stuck either had requirements to fulfill or wanted an easy A, which he dispenses with ease because it quiets down complaints.  But easy As are not what academia is about, is it?  It's about learning. You will do very little--if any--learning in this class.   \n\nWorkload:\nLight.  He assigns questions from the \"textbook\" (if that is want you want to call a mish-mash of unrelated, irrelevant stories copy and pasted into a Frankenstein-esque book).  The questions range from super easy to absurdly hard.  I remember one question asked students to write a Tang-Dynasty poem. Seriously? A handful of essays with broad, easy topics, and a final exam that is straight out of the textbook--i.e., laughable.  \n"
        },
        {
            "course_name": "5th year Chinese",
            "review_date": "October 25, 2003",
            "review_content": "\nA nice guy, chic, suave, etc etc. Yes, these adjectives all fit, but at bottom he is a lazy instructor. What do nice, hip, and suave have to do with education? I cannot remember a single thing he taught me after a year. He will make you feel good, but this is not the same as making you learn. There is no drill, no review of previously learned material, no requirement that you actually can use the words or structures he glosses so well. His classes are a good demonstration of his learning, but not of the student's. The student sits and listens. If you don't have anything to say, you never are asked to speak. The same for writing, except the weekly homeworks which merely require that one go back to the texts read and find where the word was used. Without any pedagogical structure, nothing is retained in the mind. \nWorkload:\nlight, which makes the occasional work all the more painful as it is not preceded by any buildup. Like being on a track team with no mandatory practices and then on the day of the meet being asked to go out and compete.\n"
        },
        {
            "course_name": "Intro to Classical Chinese I",
            "review_date": "November 15, 2002",
            "review_content": "\nLiu Laoshi is a great professor and a really nice guy, and this is a good class. A couple of warnings are in order: first, although I don't think there are any official prerequisites for the class, it would be hard without at least some knowledge of Chinese characters. Liu spends a lot of time comparing modern and classical Chinese, which could be pretty dull if you don't have any experience with the former. Second, although for some baffling reason this class is only worth three points, it is about as much work as any five point colloquial Chinese class. There is also no avoiding Friday classes. Aside from these matters the class is great. The material is generally very interesting (mostly philosophical proverbs and the Shi Ji), and Liu's extensive training as a linguist actually helps; he is exceptionally good at communicating what he knows to people like me who don't know a damn thing about linguistics. That, and his wardrobe and demeanor give him the appearance of a suave James Bond villain.\nWorkload:\nDaily dictations plus a pretty tough quiz and a tedious, time-sucking homework assignment every two weeks, a final and a translation project.\n"
        },
        {
            "course_name": "CHNS W4003-W4004 Advanced Chinese N",
            "review_date": "December 31, 1999",
            "review_content": "\nThe guy works hard to make the material interesting. A young guy quite popular with the ladies, dresses the hip urban uniform of all-black chic, and parties with famous Chinese movie directors. However, be forewarned. The class textbook was written by another Columbia prof, and it's boring.\n"
        },
        {
            "course_name": "CHNS W4003-W4004 Advanced Chinese N",
            "review_date": "December 31, 1999",
            "review_content": "\nThe guy works hard to make the material interesting. A young guy quite popular with the ladies, dresses the hip urban uniform of all-black chic, and parties with famous Chinese movie directors. However, be forewarned. The class textbook was written by another Columbia prof, and it's boring.\n"
        },
        {
            "course_name": "CHNS W4003-W4004 Advanced Chinese N",
            "review_date": "December 31, 1999",
            "review_content": "\nIn my opinion, Liu laoshi is the best instructor in the Chinese department. He's actually interested in teaching students, and he listens to student input. Also, he tries to make the class interesting, and you end up learning things that are actually useful. He's written books and scholarly articles about Chinese language, so he's definitely an expert, and you will learn a lot from this course.\n"
        }
    ]
}