{
    "prof_info": [
        {
            "prof_name": "Taoufik Ben-Amor",
            "prof_id": 720,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Arabic I",
            "review_date": "December 14, 2012",
            "review_content": "\nThis was totally the best intro arabic class. Taoufik would come into class, full of energy and always make sure we speak in arabic in the class.  He also held a meeting with each of us after one of the tests to discuss weaknesses and how to improve. Probably because he knows so many language, he is brilliant at articulating the use of certain words and how to formulate thoughts into arabic. He also has a nice handwriting and goes over all the quizzes in class and gives extended vocab sheets.\nBasically a great teacher, loved this class. Speaking and writing skills are fairly good now.\nWorkload:\nHeavy - its arabic. Homework due monday to thursday and bi-weekly quizzes. Cumulative final with oral. Homework takes as little as 30 mins to like 2 hours but its best to spend a lot of time so it could be a review session\n"
        },
        {
            "course_name": "Composition & Style in Arabic Literature I",
            "review_date": "February 05, 2007",
            "review_content": "\nOn the one hand, Taoufik is a pompous snob  who sometimes appears to have become a teacher to make others listen to him talk.\nGiven this, what's really shocking is that he is a fantastic teacher.  He chooses his lessons well, varying the level of difficulty of the texts so that students at all of the many levels in the class can be challenged and drawing out the most important stylistic aspects of the stories in follow-up lessons.  He also demands improvement and gives each student personalized reccomendations on what to improve.  His demeanor is off-putting, but I feel I'll have to take as many classes as I can with him because I am learning so much.\nWorkload:\nPretty damn much, but learning Arabic is a full-time job.\n"
        },
        {
            "course_name": "Composition & Style in Arabic Literature I",
            "review_date": "January 08, 2007",
            "review_content": "\nWhat can I say? He is one of my favorite professors...I can't tell you how hard it was to master my fear of this man...not because of his attitude...it was more out of awe of his linguistic abilities, his style, his mannerisms, and his humor. Don't expect an easy ride...I think I've done more work for this class than any other at CU. If you are studying Arabic, don't miss Prof. Ben-Amor. He will inspire you and show you Arabic and Arab culture in the best way.\nYou won't be disappointed.\nWorkload:\n8-10 pages of translation per week, 1-2 writing assignments per week, one paper, midterm, final...heavy, but always worthwhile.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "December 21, 2003",
            "review_content": "\nIf you are lucky enough to make it into Taufik's section, consider yourself VERY VERY lucky.  He is incredibly nice and patient, yet posesses the ability to run an intense and enjoyable language class.  You will be putting in a LOT of work if you want to do well in this class.  Most of the class fell into this category, and the ones who werent as motivated ended up with poor grades and a weak grasp on the language.  Personality wise, he is very hip, personable, but slightly hard to read.  He focuses a lot on the script, writing, and reading -- as opposed to speaking.  But if you do the drills, you will grasp an accent and idea of how the language sounds.  Of course, real proficiency isnt achieved in one semester, but the amount of material you learn is astounding.  Nothing but praise for Ustedh Taufik!\nWorkload:\na quiz every two weeks, homework for each class (2-2.5 hours), and a final.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "August 27, 2003",
            "review_content": "\nHe is very intelligent, has a good sense of humor, and a good grasp on teaching Arabic.  I really learned a lot and enjoyed it at the same time.  He's also really hot, if you like the Middle Eastern type, and that's always worth waking up for.  But that aside, he and El-Hage are the best Arabic teachers in the department, so take it with one of them.  I reccomend Taoufik for first semester of Elementary Arabic, because his handwriting is amazing, and if you copy him, you'll have beautiful handwriting as well.\nWorkload:\nFair - a lot of homework.  2-3 hours, 3 days a wekk, depending on your ability.  But you shouldn't take Arabic with any teacher if you're not willing to put in that much effort.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "December 22, 2002",
            "review_content": "\nUstadh Taoufiq is great! His teaching style is excellent, he's a linguist, and if you want to learn Arabic, and put in the effort, he'll be satisfied with you. He does seem slightly intimidating, and you can never really tell if he likes you or not...but his class is worth taking, especially since Ustadh Taoufiq will break out into beautiful poetry, and amaze you with his eloquence. Overall, all the Arabic classes in Columbia are the best!\nWorkload:\nlike any language class, this requires alot of effort...particularly hours of work on the exercises in the book, quizzes every other week also, but it's all worth it!\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "November 21, 2002",
            "review_content": "\nThis guy is amazing! He brings in such a cultured view of the Arabic language and is passionate about it as well. The way he describes the significance of the letters is beautiful. He however, can be a little insensitive at times, but he is nonetheless, a nice guy. You'll get a kick out of making fun of Maha and Khalid! He is approachable, but be careful of what you say!\nWorkload:\nPretty demanding...daily homework which is collected, biweekly quizzes, and a final, which is oral and written. Take the homework seriously, since it is a great way to practice\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "November 07, 2002",
            "review_content": "\nTaofiq is one of the most capable, understanding and intelligent professors at Columbia. And he's cool as hell. Once you're out of intro, take Toafiq for intermediate. You won't regret it. Read these other reviews. We ain't lying.\nWorkload:\nYou're learning Arabic, stupid.\n"
        },
        {
            "course_name": "arabic",
            "review_date": "September 13, 2002",
            "review_content": "\ni did not take his class, but i went out to dinner with him and he, as a human being, is the coolest professor teaching at columbia. check out his ude skills! SO COOL!\nWorkload:\nno problem\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "April 21, 2002",
            "review_content": "\nTaoufiq is focused but relatively easygoing and makes class an enjoyable experience. He has a good sense of humor and responds well to students' questions. High points of the class include group conversation exercises and the various tidbits of cultural information he works into grammar lessons. Most of my class enjoyed his teaching methods but wished, in retrospect, that he had put slightly more emphasis on speaking over reading and writing. Regardless, Taoufiq is a good professor and provides an excellent introduction to the Arabic language and culture.\nWorkload:\nAssignments (usually writing and listening drills) due each class period, biweekly quizzes, and a final exam.\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "October 22, 2001",
            "review_content": "\nTaufiq is worth waking up at 9 am for. He has a presence, very warm, lots of dignity, funny, which is absolutely incredible. Also he is nice to look at (this helps early in the morning). He goes out of his way to show his students that Arabic is a fascinating, beautiful language and sometimes he'll sing or read poetry so that while you're trying to struggle through the alphabet or mangling \"I am very busy today\" you can step out of the rut and hear exactly how gorgeous this language can be. He understands Arabic and is capable of explaining all the wacky ins and outs of it so that you understand better and are more interested. For comic relief, the book tells the sad story of Maha and Khaled and their somewhat pitiable lives which manage to be endlessly amusing.\nWorkload:\nA lot of work. Most of the people in my class spoke a fair bit of colloquial arabic; if you do, you will have a huge advantage and not struggle so very much but, if not, you will probably be competing against some people who have a huge advantage and don't have to struggle nearly the way you do. Gird up your loins, do hours of homework every night, and keep your eyes open for quizzes every other friday.\n"
        }
    ]
}