{
    "prof_info": [
        {
            "prof_name": "Lee Abraham",
            "prof_id": 12602,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish II",
            "review_date": "January 06, 2015",
            "review_content": "\nProfessor Abraham is incredibly understanding and fair. He makes it a point to be available for his students. However, his method of teaching, at times, leaves a little to be desired. Having already had a substantial background in Spanish, I was able to nonetheless get through the course fairly easily but others often complained that his lectures were a bit sporadic. Most classes were spent doing various exercises or working with the book. It is clear that Professor Abraham means well and that he is very passionate about his work, but sometimes his class felt a bit like a waste of time. However, overall, I did enjoy the class and would definitely recommend him to somebody just trying to get the language requirement out of the way. \nWorkload:\nEasy but sometimes time consuming, 3 compositions, midterm, final, MySpanishLab online exercises, occassional book work\n"
        },
        {
            "course_name": "Intermediate Spanish I/II (1201-1202)",
            "review_date": "April 10, 2014",
            "review_content": "\nProfessor Abraham is a nice person, but a poor teacher. His classes are mind numbing, and you will spend the entire time doing exercises out of gente (possibly the worst Spanish textbook ever made) or watching stupid videos. He also prepares you poorly for the midterm 1. Because you learn little-to-no Spanish in this class, and 2. Because he essentially refuses to tell you what's on it. If you value your time, don't take this class. \nWorkload:\nStandard for Intermediate 1: \n1. Project that spans the semester\n2. Randomly assigned Gente HW\n3. Four 300-word papers \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "August 17, 2013",
            "review_content": "\nI was nervous because it was his first semster teaching at Columbia and I placed out of the first 3 semesters of Spanish straight into intermediate 2, but I gotta say, he's hands down the nicest most understanding professor at Columbia. He totally understands that students have a shitton of other work to do and is flexible with assignments. He's really approachable and helpful AND he's a lenient grader. He tries his best to give you as much credit as possible. The syllabus seems a little weird and strangely distributed but that's not his fault, that's the department format. He's really funny in class and makes discussions really interesting by discussing current issues like immigration and human rights. TAKE ANY CLASS HE TEACHES. You won't be sorry. \nWorkload:\nNot bad at all. 3 500-word papers on really good movies, a couple of small assignments from the textbook that literally take 10 minutes to do. 1 midterm and 1 final (a separate oral exam that's 10% of your grade that is super easy and leniently graded). A creative, end of the semester project on basically anything you want. Easy easy stuff \n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 20, 2013",
            "review_content": "\nHe is a very nice person, but absolutely unable to teach a class.  Granted he was new this semester, but Professor Abraham does not have a grasp on department expectations or what students need to do well on the department-wide Spanish mid-term or final exams.  His classes are a waste of time.  He spends much of his time in class messing with the computer, speaking in English, and talking about how disorganized everything is and how it's not his fault.  Avoid his section if you are serious about doing well on the exams!\nWorkload:\nNever assigned or enforced nightly homework, a few compositions, and a joke of a final project in addition to the midterm and final exams.\n"
        }
    ]
}