{
    "prof_info": [
        {
            "prof_name": "Deborah Bradley-Kramer",
            "prof_id": 391,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 22, 2013",
            "review_content": "\nHonestly, I don't even know where to begin with DBK. What immediately comes to mind when I think of her class are the words \"stupid\" and \"awful\", and that doesn't even cover it.\nI am shocked that she has gotten such good reviews in the past, because the class I took with her was not the one described. At all. She is obviously very knowledgeable about music and music history, given her position and her background. But that doesn't mean she knows how to teach... especially a class like Music Hum where everyone comes in with varying degrees of knowledge of music/reading music/performance, etc.\nThe good stuff: She doesn't really go deep into music fundamentals so if you don't know anything about music, you won't have to learn any of the hard technical stuff. Also, she's very nice, and pretty understanding about missing class (although you can only miss a certain number). She at least knows her shit so I guess you could be stuck with a worse professor. She tries to bring in performances for some of the units, e.g. we had a chamber choir-type group sing for us, and a jazz group play for us, among others. That's probably the best part of the whole course. I did feel like I learned a significant amount, but it wasn't from class. It was really from reading the book and having a genuine interest in music. The class is mainly focused on music history and we started from medieval music and went all the way to modern/postmodern. The class got more interesting toward the end when we were talking about jazz, modern, postmodern, etc.\nThe not so good: Like I said, she doesn't really know how to teach Music Hum. She assigns a shit ton of reading and assignments (it wasn't that bad in the beginning but it felt like there was more and more as time went on), but then doesn't go over any of it in class unless you bring up an issue in the assignments. We didn't really talk about the music we had to listen to for homework much or how to identify them. I did not think the assignments helped me prepare for the exams, really. You're supposed to do the reading because there can be a random pop quiz on the reading on any class day (and your pop quiz average is worth 10% of your final grade), which is silly in itself. But the real silly part is that she gave us like one pop quiz in the first 3/4 of the semester and then gave us like four in a row. Also, these quizzes were hard. They were like three questions each and she gave us five minutes to do them but the questions were so arbitrary, I almost always did the reading and basically could never answer more than one of the questions. As mentioned, she doesn't go over the reading in class. The entire class is spent ... honestly I don't really know on what. She encourages participation but asks questions that don't really facilitate participation or that no one really knows the answer to. I'm thinking about it and I really do not know how we spent class time. She would lecture at us for some time, and we spent some time looking at handouts and watching YouTube clips, and she spent a lot of the semester going over structures of types of pieces, like fugues, sonatas, etc. which was interesting. I did learn a bit about listening (for meter, and to hear which pieces were sonatas, etc.) but I didn't feel like this knowledge was really solidified, more like we did it and then moved on. It was really a waste of time.\nAlso, she sucks at technology. She doesn't respond to emails well, even important ones (like reading over paper drafts). She had all of us buy the interactive e-book instead of the hard copy book because she thought that it would be easier, except the book she told us to buy in the beginning of the semester had different versions on the site so we didn't all have the right book. We all ended up getting the book for free from the company, which was great, but it was still stupid. Then she would try to reference the book in class and couldn't pull it up, etc. etc., shenanigans ensued. Also personally reading from the e-book, I felt like things didn't stick as well. Which was a problem since we never went over it in class but then would be tested on it. Also, she had a problem with Courseworks. She would email out deadlines for papers that were different than the ones listed on CW and then not respond to emails about it and assume we knew which one it was; her grade breakdown on CW didn't add up to 100, plus she changed it like three weeks before the end of the semester; she forgot to give out the opera tickets; etc. etc. She was very disorganized.\nI don't want to shit on her class too much because I got a good grade, but I wouldn't say this is one of those easy classes that you can just breeze through. The exams are based on both class material and stuff from the book you read and never go over again, and she asked some pretty specific things. The papers are graded pretty easily. Some music hum classes you have to really analyze concerts/opera for musical elements and stuff, which was not the case with our papers. I just wrote about what the pieces/opera sounded like they were about and how I felt about them and then backed those claims up with some musical stuff (like dynamics or something) and did fine. But they were all crammed into the last month of the semester, all three papers, which is pretty dumb. \nSo ... I wouldn't recommend this class to really, anyone. If you want a good prof that you can learn from, she's not it. If you want an easy grade, this class isn't really it either. It was a headache to deal with, even if I did fine in the end.\nWorkload:\nThis is something of what it was like:\nthree 4-5 page concert reports, 10% each (one being the opera paper)\npop quizzes, 10% total\nparticipation, 10% (she later changed this to 5%)\nmidterm, 25%\nfinal, 30%\nI probably spent like an hour for homework for each class, so it's not really a lot of work, and the reading can be interesting. But the class was just stupid.\n\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 25, 2012",
            "review_content": "\nProfessor Deborah Bradley-Kramer is probably the best professor I have ever had at Columbia. \nDeborah Bradley-Kramer is an amazing piano player in her own right (and would often play for us in class), and is extremely knowledgable about the material covered. You will learn so much from her class, and be introduced not only to the mainstream musical composers of the course (Bach, Beethoven, etc.) but also be introduced to Deborah's own personal choice of interesting pieces, many of which have so many connections to the genres of music you will learn in the course. Deborah as a person is the sweetest, nicest professor you will ever encounter, and is always readily available at office hours and available to talk before and after class. \nIn terms of the work for the class, you will have brief reading assignments (from both the textbook and readings Deborah will post on courseworks), listening assignments (that have a few questions you have to answer and submit to her for credit, and she gives you full credit if you've done the assignment), two longer papers (4-5 pages, 1200-1500 words), and short one-page responses to listenings and readings. It was really not that bad at all. The midterm and final were challenging, and you had to memorize quite a few listening compositions, but it wasn't that bad because if you keep up with the material you should be able to know the pieces thoroughly. The final had a short essay response. I did pretty well on the midterm, and Deborah gave you an opportunity to do an extra credit assignment to boost your midterm great. All in all, Deborah Bradley-Kramer is a fantastic professor and the greatest professors at Columbia. It is unfortunate that professors as good as this come few and far between at Columbia, but this woman deserves a golden nugget!!!! Take take take her class! :)\nWorkload:\nReally light readings (usually 6-8 pages, sometimes 10-15). Listening assignments with questions from the book, had to be completed on the internet and emailed to her for credit (not graded on how well you do, just whether you did it). Short responses to listening and reading assignments. 2 medium length papers, one optional extra credit paper. Midterm, and Final that were challenging but okay. I got an A in the course.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 14, 2011",
            "review_content": "\nThis class was amazing -  one of the best classes I have taken at Columbia. If only every core class could be like this!\nHer strength comes from connecting really disparate genres of music - we talked about the connections between opera and Pearl Jam, between Bach and Eddie Van Halen, and between Gregorian chanting and The Velvet Underground (to name a few). At the very least, this makes the class much more interesting, but it also makes the material that much easier to grasp.\nThe only downside to the class is that the workload is a bit inconsistent. It starts off very light, then works up to a moderate level, except that there were two weeks when it spiked - there were a lot of assignments due for the same class (or for two classes in a row). That said, it's very do-able overall, and she's a very reasonable professor, so if you need an extension, she'd probably be willing to help you out.\nThat said, if you take this class, you'll have a lot of fun, and you'll never look at classical music (including opera) the same way again. Even if you come to the class with some musical training (as some in this class did), you'll still learn new things... and if you have no training whatsoever, that's fine - you won't feel like you're behind at all.\nIn short - if you have an opportunity to take this class, by all means do! You'll thank yourself for it every day in class, and every time you listen to classical music for the rest of your life.\nWorkload:\nModerate (it varies - see above). Not too bad. Two concert reports, one opera report (all 1000-1250 words). Readings/listening assignments for every class, with a short (10 question, multiple choice) listening exercise for most class (very easy). Midterm and final are pretty straightforward if you study properly. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 27, 2006",
            "review_content": "\nPositives: interesting reading assignments; facilitation of class discussion; not 'by-the-book' (i.e. very eclectic and personalized curriculum);  very helpful in class and during office hours.\nNegatives: tries to fit too much actual activity into class periods where out-of-class activities would work better; readings and lectures more complementary, not integrated.\nOverall, I would strongly recommend this professor.\nWorkload:\n3 Concert/Opera Reports; Midterm and Final (both around 20 listenings to memorize); scheduled topic paper (canceled)\nReadings from textbook and course reader, along with periodic writing assignments. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 11, 2006",
            "review_content": "\nIÂ’m not kidding when I say this but I think she might be the best professor I have had a Columbia. She really makes the class come alive, and is really interesting. She is an amazing musician herself and its really cool to hear her play the piano in class; it gives the class a more personal feel. DBK is also so nice, I did poorly on my midterm and I met with her and she let me do extra work to make up for it, it was so nice and not many other profs would do that. She gives a good amount of work but grades things so easily. If you take her you will really be thankful, she is so cute I just wanted to hug her everyday shes very motherly. Take her i give her an A+++++ no matter what she gives me\nWorkload:\navg.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 03, 2004",
            "review_content": "\nA ++ to Deborah Bradley. Professor Bradley's course  Masterpieces of Western Music was one of the best learning experiences of my college career at Columbia. She is always interesting, informative and well- prepared. The consummate professional. Since this class is a requirement for most students, I highly recommend that you try to take it with her. The coursework and assignments are interesting and not overwhelming. In addition, Dr. Bradley is a very very fair grader- this class will definitely boost your GPA if you apply yourself.\nWorkload:\nI was an econ major- so taking this class did not seem like work at all. A much lighter and MORE INTERESTING workload than what I was generally accustomed to.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 03, 2004",
            "review_content": "\nA ++ to Deborah Bradley. Professor Bradley's course  Masterpieces of Western Music was one of the best learning experiences of my college career at Columbia. She is always interesting, informative and well- prepared. The consummate professional. Since this class is a requirement for most students, I highly recommend that you try to take it with her. The coursework and assignments are interesting and not overwhelming. In addition, Dr. Bradley is a very very fair grader- this class will definitely boost your GPA if you apply yourself.\nWorkload:\nI was an econ major- so taking this class did not seem like work at all. A much lighter and MORE INTERESTING workload than what I was generally accustomed to.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 22, 2004",
            "review_content": "\n  Professor Bradley made Music Humanities the best class I've taken at Columbia.  I entered her class with a distaste for classical music.  Now, I attend operas regularly and listen to classical CDs all the time.    Professor Bradley is an extraordinary piano player and knows music very well.  She forces her students to think outside the lines, while still managing to teach the fundamentals of classical music and form.  As a student in her class, you will gain an understanding of how the music works as well as how to appreciate it, and these lessons will be lasting impressions.  Her collaborations with various outside groups (such as opera companies) allow special advantages for her students and glimpses at the professional world of music.  She always manages to make time for her students and their questions.  If you want to have a truly wonderful and lasting Core experience, take Music Humanities with Professor Bradley.    \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 19, 2004",
            "review_content": "\nThe review that was on before that got erased was completely accurate. If you know what's good for you, switch out of this class. I seriously walked out of it not knowing anything- it was an exercise in futility. \nBradley is ok, but I found her unresponsive to emails and unclear in the assignments. I also thought she was joking when she made us study over 70 songs, and ended up giving us 5 or so that we had never heard before. I don't know if rock and roll can even be listened after the Eroica, but she didn't see a problem with it.\nColumbia gives you the impression that you're getting a world-class education. If you get into this class, that whole illusion just flies right out the window. From what I've heard, this class can be spectacular (when taught by someone else) and I was dismayed by the simplistic, seemingly dumbed-down approached used by Deborah. The syllabus had so much potential, but all I ever got down cold was that Berlioz was kind of nutty and Beethoven was deaf. I wouldn't recommend this class: when you take a Core you want it to be as painless as possible. This doesn't fit the bill. I certainly tried to appreciate it, but I couldn't help but be disappointed. Overall not a pleasant experience. Good luck with this one.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 18, 2003",
            "review_content": "\nThis is a core curriculum class, which is mandatory for everyone.  She made that experience feel more like a choice than an enforced obligation.  Professor Bradley is very open to studentÂ’s opinions and perceptions, creating a non-judgmental environment, where it is comfortable to discuss anything.  Her enthusiasm is contagious and I felt that she opened a new world for me.  She introduces musical eras, concepts and definitions by playing examples.  If anything was unclear, she was open to going over it either in class, or during office hours.  If the entire class had difficulty, she skipped the concept entirely.  What more could you want from a professor?\n\nWorkload:\nWorkload: Workload is essentially reading a textbook, notes and listening to CDs, learning to identify music.  There were three papers: a concert of our choice, the opera Carmen, and the third was a choice of several options.  She distributed a listening list to aid preparing for the final exam.  The midterm and final were fair.  She counts class participation, but is so non-judgmental, that it would be boring not to say anything.  The only real difficulty was identification of so many different pieces of music.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 21, 2002",
            "review_content": "\nShe was a very good teacher. I would definitely recommend u keeping her. She is really big on participation and really wants everyone to be involved. I had no complaints about her at all, the course could be boring at times, and it is a straight lecture, but she tries to make it interesting, and is always trying to figure out what people dont understand so she can explain it better. You'll take a lot of notes, and she really wants you to do the readings, but she is real nice.\nWorkload:\nWorkload is real light, she has 2 papers which are relatively easy to write. There are pop quizzes, but they do not count that much and u shouldnt fret over them. The midterm and final I thought were fairly easy, but be prepared to stay up the week before to memorize a lot of songs for idenitfication.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 16, 2002",
            "review_content": "\nBoring and slow. That's all I remember.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 16, 2002",
            "review_content": "\nBoring and slow. That's all I remember.\n"
        }
    ]
}