{
    "prof_info": [
        {
            "prof_name": "Robert Amdur",
            "prof_id": 1500,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Equality and the Law",
            "review_date": "January 15, 2013",
            "review_content": "\nProfessor Amdur is one of Columbia's best kept secrets! He's an incredibly talented legal scholar and is interested in teaching, not following some meaningless ritual that other professors seem to enjoy oh so much. If you're interested in law, race, gender studies, American politics and/or public policy, I highly recommend his Equality and the Law course. It's not just a great way to get your feet wet for graduate school, but you'll have a blast doing it. He's also highly accessible to students and will provide meaningful feedback on your term paper each step of the way (if you want it, that is).\nWorkload:\nJust 20-30 pages of case law reading per week, plus 20-page term paper. No meaningless quizzes or tests. One of the lightest workloads you will ever encounter in a seminar or in any class related to law.\n"
        },
        {
            "course_name": "Equality and the Law",
            "review_date": "December 22, 2011",
            "review_content": "\nRobert Amdur is one of the most accessible and student-friendly teachers on campus. If you ever had a misfortune to have a class with a prof-primadonna who thinks they're the hottest and smartest thing around - prof. Amdur is the exact opposite of that. The class was interesting because based exclusively on Supreme Court cases - so pretty far from the usual useless theory thrown at you at Columbia. He spices it up with controversial articles and legal opinions, to make the readings interesting and thought-provoking yet easily digestible. Plus discussing racial issues in a class with students of all races will most probably give you a somewhat uncomfortable feelings which cannot not be beneficial for your intellectual growth.\nOverall, I totally recommend the class to anyone moderately interested in what's going on the US legal system and why the covert racism persists. \nWorkload:\nWhat workload? Well ok, there is a huge final paper to write but since it is the sole component of your grade, you can treat weekly readings extremely lightly and focus on the paper (which I would suggest). The paper can produce a solid argument in 20-25 pages so be ready to put aside couple of days, or nights, just for that. Overall it's not much work for a 4-point course. \n"
        },
        {
            "course_name": "American Politics Seminar: First Amendment and Censorship",
            "review_date": "June 03, 2011",
            "review_content": "\nThere's a lot of good material in this class, interesting cases, etc. Almost all the readings are cases.\nYou'll enjoy the course if you can pay attention, which is sometimes tough because Amdur is a boring speaker. (If very smart, and decidedly not boring, outside of class.) And--this is a blessing and a curse--he doesn't really care if you participate in class. I suppose it helps to talk, but he's never going to make you say (or read) anything. \nSo his readings were always the first chunks of my homework load I skipped, and you might skip them too. This is somewhere in between a relief and a disappointment. You'll never get tested on them, though.\nThe course then reduces to the final paper, which was actually a blast to write. It's long (20-25 pp.) and requires you to dig through case law and scholarship. But he'll give you leeway in picking the topic so that you might find something which really interests you.\nSo, weirdly enough, if you don't do the reading and don't participate in class, you'll still have a worthwhile independent research project to do. Maybe he designed it that way.\nWorkload:\n50-60 pp. of reading per week (light!), no writing aside from giant term paper, which comprises all of your grade. He'll grade them tough, but he'll give you any extension you want to work on them.\n"
        },
        {
            "course_name": "Equality and the Law",
            "review_date": "March 29, 2009",
            "review_content": "\nRobert Amdur is a joy to have as a professor.  He is not out to get you, not out to embarass you, he just wants to teach.  The readings are minimal, ESPECIALLY for a polisci seminar.  Its usually between 30-50 pages of reading a week, all case studies with the occasional article.  No outside work, just come to class with the readings done and they will be discussed.  \nHe's such a nice guy and so fun to meet with outside of class.  He's got a wonderful, warm persona and no ego, though he's extremely knowledgeable. \nHe'll start off with a background on the day's lecture and then delve into the cases themselves.  The reading is actually not even that necessary, so if you miss it, don't worry, he'll cover them in class.  Wonderful discussions and opinions thrown around and his take on everything is basically unbiased so don't worry about sharing your opinion. \nFinal paper (25 pages) on a topic of your choice, paper proposal due before hand (around thanksgiving time) and you must meet with him once during the semester.  Other than that, zilch!\nMaximum 20 people in the class, so email him early on to get a spot. Wonderful class, take it if you love discussing relevant equal/civil rights issues.  Polisci majors will help but not necessary.  \nWorkload:\nreading= minimal 30-50 pages a week, participation (so he says, but you don't have to), attendance, but mostly 100% final paper (25 pages).\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "April 05, 2006",
            "review_content": "\nAmdur is wonderful.  He is one of those professors without a huge ego to protect or a potential hotshot academic career to shuttle along, and it shows in his classes: he focuses on teaching and enjoys his students.  He is perhaps the clearest lecturer I've encountered, and he speaks at a manageable pace so that you can easily take down all the important points.  He always leaves time at the end for questions, and genuinely welcomes them; it made me sad to see how disappointed he was on those days where there were none!  He makes difficult texts seem easy.  I truly hope that I will be able to take another class with him in my time left here.  A shy but extensively kind man.\nWorkload:\nTests are fairly easy if you study, since they are straightforward and only ask you to reproduce the arguments of the texts, not analyze them.  Frankly, my one complaint is that I would have preferred some questions about analysis, but I suppose that the lack thereof was appropriate for an intro class.\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 14, 2005",
            "review_content": "\nAmdur isn't the most scintillating lecturer, which turns off many students, but I found that listening to them gave me a strong understanding of the argument of all the authors we studied.  He speaks at a very manageable pace, and chooses his facts judiciously--he's not trying to show you how much he knows, or cram in every fact he's ever learned about Plato.  In general, I appreciated this class a lot.\nWorkload:\nMidterm and final; optional paper.  Readings are good to do but not absolutely necessary; do buy the books so you'll be able to identify the quotes on the exams.  I haven't taken the final yet, but the midterm was very fair.\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 06, 2005",
            "review_content": "\ni liked this class a lot.  professor amdur has a very dry sense of humor that makes his lectures entertaining, and he really relates to his students, so he knows what will interest us.  the theorists we read (plato through the federalist papers) were all interesting and amdur did a really good job of tying them together even though they are all very different.  for each thinker he told us their views on women, which i think is often neglected.  his lectures are sometimes a little dull only because he reads passages and explains them for 75 minutes straight, but i still enjoyed them.  he summarizes the previous day's lecture every class, so even if you miss a class you still are caught up on the important themes.  one thing that bothered me was that he always started class late and almost always ended it early.\nWorkload:\nseveral books are assigned, about a book every two weeks?  but it's not really necessary to do the reading if you come to class.  grades are based solely on midterm and final, and an optional 10 page paper.\n"
        },
        {
            "course_name": "Human Rights and Social Justice",
            "review_date": "May 27, 2005",
            "review_content": "\nAnyone who teaches a course called \"Human Rights and Social Justice\" has to be a nice guy and the same holds true with Prof. Amdur. He's a great teacher who is very approachable and concerned about his students. The readings are a little dry but Amdur's methodological approach and willingness to repeat explanations ultimately made the texts easily digestible. In fact, I really looked forward to going to class because of AmdurÂ’s ingenious capability to elucidate esoteric theory.  I am so happy I took this course, which really broadened by mind, and had Amdur as my professor. True, he's not particularly charismatic but he is incredibly organized and deeply respects his students. I unequivocally recommend this course to anyone even remotely interested in social justice theory.\nWorkload:\nShort readings that are rather difficult but you can skim them if you attend class regularly and take good notes (he'll highlight important sections). The mid-term and paper are optional if you want the final to count for 100%. Everything is straight-forward, without tricks and very manageable. I get the feeling Amdur genuinely wants his students to both learn and do well.   \n"
        },
        {
            "course_name": "American Politics Seminar: First Amendment and the Politics of Censorship",
            "review_date": "May 13, 2005",
            "review_content": "\nI loved this class--it was great, and Amdur is great.  He's a theorist, so all of your discussions go back to the theory we read int he first couple weeks.  He's very methodical, and spends time at the beginning of each class reviewing the previous week (though I sort of wish he didn't).  The conversations we had in class were great, provacative and fun.  The paper was hard, but you really learn a lot about one area of law.\nWorkload:\ncases every week (maybe an hour of reading at most), and a 25 page paper on something having to do with the first amendment.\n"
        },
        {
            "course_name": "Human Rights and Social Justice",
            "review_date": "March 21, 2005",
            "review_content": "\nThe most refreshingly logical lecturer at Columbia, Professor Amdur's class is designed to help you not to talk to at you or over your head. He assigns a section of a book and then lectures on that book's main points from an outline. He gives you what you need, explains some of the more complicated points, and cuts out the crap. Wonderful. But don't hink that he's dumbing anything down, the readings are difficult and the material is abstract, so it pays to have a prof so concerned with actually teaching. He spends thae first 15 minutes reviewing the last class (again from his outline), and then moves on for another 45 minutes. There was always time for decent discussion in the last 15 minutes. My one reservation is that this is an extremely liberal course. If you don't believe that human rights exist or don't believe that discussing them is worth while, then you're going to be slightly uncomfortable reading about why you need to sell your belongings to feed the Nambians. As a conservative, I was dissapointed that the course did not inclue utilitarian discussions of human rights or any sort of neocon perspective on why rights are important, but I'm pretty used to that at this school by now. All and all, a wonderful course.\nWorkload:\nFive dense books and a handfull of articles. Soemtimes fairly light in terms of pages. Excellent lectures make life easy. Optional in class midterm, optional research paper, big time blue book final. If you're brave enough, the final can be worth 100% of your grade. \n"
        },
        {
            "course_name": "Democratic Political Theory and its Ethics",
            "review_date": "December 31, 2004",
            "review_content": "\ni'm sure he's smart.  I'm sure he's bias.  I'm sure his perspective borders on religious favoring.  This class could have been good, but everything you say.. he says, \"so let me see if I understand what you are saying... \nwhat you are sayhing is..\" and he normally is wrong in his understandiungs, thus, he puts words in people's mouths.. BUT you can't correct him because his speaking is sooooo slow and methodical that to interrupt it is impossible and he doesn't like that.\nHE is not the guy to be teaching a class on DEMOCRACY nor ETHICS.  He is not particularly fair.  He favors students and seems to hold narrow views on interpretation of text and analysis.  \nSo, yes, there are wrong answers and wrong opinions... and he will pretty much disgard your ideas.. rather than even bother to refute them. \nhe's smart, no doubt, i'm sure.  But he is not a mediator, nor an unbiased party in colloquia \"discussions\".  \nhe holds the gavel.. don't even expect a chance to argue that...\nWorkload:\ngood.. read and discuss... but 1/2 discussion is him re\"iterating\" what he \"understands\" you to have said.. so you don't get so deep into concepts as you may like\n"
        },
        {
            "course_name": "American Politics Seminar: First Amendment and Censorship",
            "review_date": "April 21, 2004",
            "review_content": "\nLovely man, very very smart, terrific knowledge of the texts, interested to learn from his students.  Does a remarkable job of directing the seminar while allowing it to go wherever students want to take it - but that place is always interesting.  Also constantly available and responsive outside of class.  Plus, cool baseball memorabilia in his office.\nWorkload:\nStandard seminar paper - 20-25 pages.  Happy to let students write on basically whatever they want, and it's true that you can turn in the paper basically whenever.  Always prepared for class, covers the readings, but isn't going to be terribly upset if you are occasionally unprepared or don't show up.\n"
        },
        {
            "course_name": "Political Theory I",
            "review_date": "December 04, 2003",
            "review_content": "\nIf you can stay awake through his letures, Professor Amdur is extremely easy to understand.  He always opens lecture with a review of the last one (which helps if you skipped a lecture), and he constantly references the text when teaching (which helps if you didn't do the reading).  His only weakness: his lectures can be extremely boring.  He discourages students from asking questions during the lecture, which usually leads to 50-60 minutes of uninterrupted droning on Locke, Hobbes, or another important political thinker.  Many people fall asleep during these lectures.  However, he almost always reserves the last 10-15 min. of class for questions and sometimes lets the class go early.  I wouldn't rate hi m as a great professor, but definitely a little above average.\nWorkload:\nWeekly reading (not difficult), easy midterm, final.  Best of all: no required papers\n"
        },
        {
            "course_name": "Human Rights and Social Justice",
            "review_date": "May 30, 2003",
            "review_content": "\nAlthough the first review was for a seminar and the course I took was a medium-sized lecture course, but I completely agree with it. \nAside from Amdur's good qualities extolled in that review, I must add that he is also a great lecturer. He had a very clear outline as to where he was going in every lecture, and he spoke slowly and clearly enough for you to be able to write down what he was saying while thinking about the concepts. He also reviewed what he said in the previous lecture in the first 20 mins of every class, so it was really helpful for when I missed a previous lecture. You can either review past concepts, or just zone out for the first 20 mins each class.  He's not the most animated person though, and sometimes the material get a little dry - so I think an interest in human rights theory before you take the course helps you stay focused a bit better. But even if he doesn't win you over with his charisma at first, if you get to know him, he is completely approachable, understanding, reasonable, and has a great sarcastic sense of humor. More importantly, he is a brilliant scholar (studied under Rawls) who knows how to convey the knowledge in his brain to his students. All in all, I learned a lot and enjoyed his no-nonsense type teaching style. I definately recommend this class and the professor!\nWorkload:\nReading: This course reviewed 5 major books (and a few short articles), and he only assigned relevant portions of each book... so not too many actual pages of reading, but all the books are on theory, so it may take you more time to actually get through it.  But don't worry if you have trouble digesting it, he goes over key concepts in lecture.\nGrading: An optional midterm, an optional 10 pg paper (he only recommends this if you are really interested in a topic), and a required cumulative final exam. I chose to have just the final exam as 100% of my grade, but it's not as scary as it sounds, because he gives some options on the exam - so you can still do well, without knowing every little part of every book. He is a very fair grader - just looking for clear, concise answers showing that you have basically read the book and/or attended lectures.\nBasically: the course is not a piece of cake, but an A is very attainable.\n"
        },
        {
            "course_name": "American Politics Seminar: First Amendment and Censorship",
            "review_date": "January 26, 2003",
            "review_content": "\nAt first, he seems like he'll be strict and somber, but Professor Amdur is actually a very dryly funny guy, who is always glad to talk to ou outside of class and who has a very warm way of running a class discussion. Manages to let stronger personalities indulge themselves without destroying the class, and gives the students a lot of say in what they study-- which is good, because it's a seminar. clearly has a lot of scholarship backing up whatever he says, but his opinions are not set and his mind is open, so you can still surprise him and have a good conversation that won't necessarily turn into a debate. He has wide familiarity with different legal texts, which he uses to produce great readers for the class.\nWorkload:\nnormal 20-25 page seminar paper, topic of your choice. he's very good at giving help and guidance for your research. Grade almost completely based on the paper. Gives massive extensions, but then takes inordinately long time to grade the papers. it's the beginning of the second week of spring semester and he hasn't posted the grades yet.\n"
        }
    ]
}