{
    "prof_info": [
        {
            "prof_name": "Barclay Morrison",
            "prof_id": 2235,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "August 11, 2015",
            "review_content": "\nPro: \nProf Morrison is an okay lecturer and explains things okay. The lecture experience is pretty average. He uploads slides on Courseworks and assigns readings. I didn't find the textbook too helpful or necessary. Most of his slides borrow heavily from the textbook and the only time the textbook was really necessary was for the homework True / False section. One thing to note is that he gives pop quizzes so you must come to class if you want to perform well on the quiz section of your grade (explained below).  \nYou probably have to take this course if you are looking this up. I root for you, BME major. You can complain about this class with your classmates to befriend them. \nCon: \nNot sure if this is a con but this class was, at least in my experience, memorization based. If you memorized the homework answers and practice problem answers, it is likely you received a high mark. This may or may not work in your favor. \nExams are a huge time crunch. Morrison expects you to have memorized everything when you get to the exam. He expects you to be able to spit out whatever you have memorized and just be done with the exam. If you have to \"work through the problem\" instead of spitting out what you know, it is likely you ran out of time. That said, the exam difficulty is on par with your average homework question. It was just a time issue. \nNO ANSWER KEYS FOR ANYTHING. Office hours are obviously crowded. He gives \"practice problems\" before each midterm. (They are most likely recycled homework problems) Again, no answer key for this either. He has the TAs hold a review session that is just giving out answers to a few of the practice problems and/or homework problems. Usually it is very rushed very little time for questions. If you want to ask a question to clear up a concept, you can email or ask during office hours. \nI found this professor to be one of the worst experiences I've had here with a professor. Though his lectures are fine, he is not personable. He is intimidating and approaches the student with a \"well did you read the textbook\" attitude. I felt like I was wasting his time every time I went to his office hours. I would just interact with the TA's if I were you. \ntl;dr: Average lecture/textbook based class. Memorization based. Exams are a huge time crunch. Prof is condescending. \nWorkload:\nReading: He assigns a lot of reading and if you want to do really well on quizzes, you need to do your reading (at least read ahead in the slides). However, I found the material covered in the homework and exams drew mostly from his lectures. Some homework questions were not in the slides and needed to be looked up in the textbook (or Google) \nHW: 6, none dropped. Difficulty varies. Usually 10 T/F questions from textbook and 3~4 questions similar to what was done in class. Some were easy others needed an hour or two of office hours. Each homework is 100 pts\nQuizzes: Pop quizzes usually one per homework assignment. I think the grading is by point value in the overall HW and Quiz category but I'm not sure. Each quiz is 10 pts\nExams: 2 evenly spread out. 20 multiple choice and 2~3 short answer. Question difficulty is similar to that of the average homework problem. Main issue here is time. There is a ridiculous time crunch. If you know everything perfectly, you should breeze through the exam (with probably no time to spare). Thus if you struggle with anything, haha good luck.\nFinal: Similar to the exams in difficulty. Slightly longer--but you have 3 hours instead of 1 so the time to question ratio works out better for the final.  \nGrading: Quizzes & Hwks: 30%, Exam 1: 20%, Exam 2: 20%, Final: 30%. Average curved to B-\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "June 22, 2015",
            "review_content": "\nQP 2 was not bad in terms of material or workload. The classes were delivered clearly, if at a slow pace. However, Barclay Morrison is the rudest professor I have ever come across at Columbia. He shows very little respect towards his students, especially through email and during office hours. He is not interested in helping us learn the material. \nFor instance, I emailed him because wanted to discuss my exam, and in his reply, he asked if I had done all the reading and if I could do all of the HW problems cold. If not, he wouldn't waste time discussing my grades. His attitude and demeanor towards his students is totally inappropriate.\nAdditionally, the lack of answer keys for HWs/exams was detrimental to our learning, and did not prevent cheating on exams.\nWorkload:\nNot too bad, 6 reasonable problem sets, 2 midterms, 1 final. Exam problems were similar to HW, and cheatsheets were allowed.  Averages were much higher in QP 1 than QP 2 for my class.\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "April 27, 2015",
            "review_content": "\nProfessor Morrison is one of the worst professors I have experienced in terms of caring that his students learn the material.  He is a decent lecturer but makes it difficult for his students to succeed. There are no answer keys for any problem sets, quizzes, midterm exams or even practice exams, because professor wants to prevent cheating (a situation in which an upper year student passes on an answer key). However, this also results in students simply not knowing the correct answer with no way to find out besides office hours. Problem sets are returned with barely more than a score; midterms and quizzes are the same. \nI understand that the professor is trying to prevent cheating for his exams. Perhaps he can make different exams for different years? Just a thought. He says that we can visit his office hours to ask for some answers. Perhaps he has not considered that students have other classes or part-time jobs and may not be able to make his and the TAs office hours.\nWorkload:\nTry to figure out the homework from looking at equations on slides. Not much actual learning\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "July 02, 2007",
            "review_content": "\nBarclay lectures painfully slow. Class is, I think, pointless. The best thing to do is read the notes for quanitative questions and memorize the textbook readings for the multiple choice. Test are really long. It is, in my opinion, more about how fast you can regurgiate simple questions rather than actual problem solving.\nWorkload:\nnot that bad\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "May 22, 2006",
            "review_content": "\nMorrison is a good guy. He's genuine and approachable and tries to make the class understandable. Alot better than QP 1 with Kam where the material on the HW and Exams was impossible, Morrison's class is alot more straight forward. He gives VERY LONG exams though, so time management is key. Going to lecture doesnt give you much more than is in the slides but i would recomend it. He started posting his slides online this year so those are a must to have in class and very useful to study with.\nWorkload:\n6 problem sets spread out somewhat evenly. Two midterms and a final.\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "April 30, 2006",
            "review_content": "\nI think professor Morrison has more than the appropriate qualities to become the recipient of the distinguished professor award. he is a good teacher, well prepared and intelligent, not affraid of saying \"I dont know\" sometimes, fair with homework load and tests, and fairly accessible. that makes a distinguished teacher in my opinion.\nThe sad part is, however, that the department puts the capstone  class of our junior year at 9AM in the morning, making it almost impossible for anyone to really get pass their blind hatred of biomedical engineering and give Professor Morrison enough credit.\nThe workload is incredibly fair, compared to the horrors of Lance Kam's class in the fall, and the rest of this useless, pompous major.\nWorkload:\n6 psets, all really easy if you: read book, go to class, and review...\nthe final? havent taken\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "May 22, 2005",
            "review_content": "\nProf. Morrison likes to come off as a hardass, but don't let that fool you. Deep down, hes a pretty nice guy.\nSure QP2 is tough, and sure he curves to a B-, but considering that you have to take the class, make the best of it.\nHe is a very fair grader, and though he makes his exams unnecessarily difficult to get a \"separation\" chances are that if you study and do your hw, you'll survive.\nWorkload:\nPretty heavy, im not going to lie.\n"
        },
        {
            "course_name": "Quantitative Physiology II: Organ Systems",
            "review_date": "November 27, 2004",
            "review_content": "\nProfessor Morrison seems like a pretty nice guy when you meet him in person, but hates to teach class because he can't teach for his life.  QP2 was basically just a 9 AM class where he would write down a bunch of information on the blackboard for you to copy, and wouldn't explain what any of it meant.  Even better was the fact that the homeworks had nothing to do with the class, so basically you had to google for the answer or just had no idea how to do it.  \nWorkload:\nProblem sets every 2 weeks. With a midterm and a final, both very long tests.  Class curves at a B-, so goodluck to the upcoming biomedical engineers!\n"
        }
    ]
}