{
    "prof_info": [
        {
            "prof_name": "Rachel Mundy",
            "prof_id": 10948,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 30, 2011",
            "review_content": "\nProf. Mundy IS GREAT. Besides the concert report and the final report, work is MINIMAL. Whoever wrote the review preceding mine said you had to work quite a bit, but I disagree... maybe because I'm in SEAS and I have to do a ton of work? There was like 1 quizz every 3 weeks or so which was TOO easy... to mess up in it you really have to not care about the class... The music aspect tended to be really interesting, and I actually feel I learned a good amount.\nSummary: Prof. Mundy IS A FANTASTIC TEACHER. EASY GRADE.\n\nWorkload:\nweekly discussions (not very hard), 1 mid-term and 1 final (very easy if you are not a dumbass), 1 concert report (3-5 pg) and 1 final paper (5-7 pg)--- I recommend you set some time aside to write each one well---, some weekly readings you can just skim through, those easy quizzes.... I don't know, the class was just interesting.\nMUNDY IS GREAT\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2011",
            "review_content": "\nProfessor Mundy is an excellent Music Hum teacher. Her zany enthusiasm is infectious and makes classes easy and interesting to attend. She would sometimes prepare helpful powerpoints for class or would allow class discussion to dictate the class, especially for classes on modern / post-modern music. She clearly cares a lot about the course and music in general.  Assignments are very clear and the readings she assigns [we didn't use a textbook] are really interesting and place the different music being studied into interesting contexts. Approaching music from the perspective of Plato, Renaissance magic, Walter Benjamin, and biology is really fascinating and much more effective than other textbooks I've seen for Music Hum. \nI highly recommend taking Music Hum with her.\nWorkload:\nWeekly listening and responses, a few in-class quizzes, a 5-7 page performance paper due around mid-term, one final paper (or you could compose a piece of music and swap with a partner and then analyze your partner's piece in a 2-3 page paper), midterm, and final. Very manageable. \n"
        }
    ]
}