{
    "prof_info": [
        {
            "prof_name": "Bernard Tamas",
            "prof_id": 10438,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "January 16, 2012",
            "review_content": "\nBernard Tamas, is, in two words, quite incompetent. Sure he has his fans, and his lectures are certainly \"interactive\", but the quality of his oratory declines by the minute until you begin to wonder how he got a teaching position here in the first place. He enjoys infantalizing even the most complex subjects of comparative politics simply out of expediency (but probably because he lacks the articulation to elaborate). The class is easy, yes, you probably will get an A with (some) of the readings (and common sense, it seems), but don't expect to receive an \"academic\" approach to the fundaments of comparative politics. The TAs seem to know some of the concepts better than he does... Nonetheless, Bernard seems like a nice guy to know personally, and he does his best to ensure that students feel at ease to speak out in lecture. Due to this however, the class is basically taught by a self-righteous group of around 8 students that sit at front of the lecture hall and enjoy flaunting their brilliant young minds. These same kids naturally dominate the discussions as well...expect to hear their endless (seriously, these people have a lot of crap to say) normative opinions on the despicable nature of Russian politics or whatnot. \nErgo easy A -- that is, if you do what they tell you and like to show off (which you probably do considering you're here after all), rudimentary (for lack of a better word) professor.\nWorkload:\nTwo 3 page essays (hard to call it an essay, more like copying stuff off wikipedia and citing indecipherable foreign sources), Midterm, Final (both quite easy but a lot of writing in a minimal amount of time)\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 31, 2011",
            "review_content": "\nTamas is definitely enthusiastic. He is, however, an awful lecturer. As the semester progressed we covered less and less new material in lecture, and by the end we would be spending 1hr reviewing material from the previous lecture and 15 minutes covering a little new material. Tamas wants participation, but the result is inane and obvious comments which Tamas runs on for lengthy periods whilst the rest of the lecture hall falls asleep. \nThe class is heavily biased towards the study of democracy, rather than the other fields of comparative politics. My TA, who was great, also said that probably 1 in 3 readings should  have been updated (we read a lot of stuff from the 60s which has been improved upon).\nOn the plus side, readings are fairly interesting, and in terms of actual work, the class is a joke. \nWorkload:\nTwo 2-3pg essays (topics given out 2 weeks before due date, really basic questions). 1 midterm (easy IDs, essay), and 1 final (easy IDs, short answer, essay). Final covers only 2nd half of semester, and essay question was given in advance.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 13, 2011",
            "review_content": "\nThe review directly below is, for the most part, correct. Professor Tamas is very open, approachable, and invites student participation in lecture. He never shoots anyone down. This is theoretically great. However. Class is soon dominated by people who don't actually know what they're talking about. Tamas sometimes reverts to asking simple, obvious questions to spark participation, yet it is always the same 3 people responding to him with answers taken verbatim from the previous lecture. This is very frustrating and eventually people with anything interesting to say stop bothering. This makes for a very irritating lecture, even though Tamas himself is great.\nMaybe it would be different with different classmates, but it's an intro class and it's hard to get away from that fact. The readings are often dull (frameworks of regime types, etc.) but a good basis and useful in future comparative politics classes.\nWorkload:\nLots of reading, but it's not extremely necessary to do it. Students make \"presentations\" in section that are simply summaries of all the readings, and Professor Tamas emphasizes what he thinks is important in lecture anyway. Midterm, final, two 3-page papers.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 09, 2010",
            "review_content": "\nAWESOME. I loved this class, definitely one of my favorites this semester. Tamas is passionate about comparative politics and democracy. He is an expert in his field (Hungarian and Eastern European transitions) and has a great basis of knowledge in general. He was very good at encouraging class discussion and was receptive to student opinions. He never once shot anyone down and found merit in most student responses. Our section was small for an intro class, and there were some very good discussions in lecture. Tamas did a good job of outlining the important points in major readings and provided equally helpful examples. Even though he's a visiting professor, I hope he stays. He was much more competent than many of the tenured faculty I've encountered here. He only missed one lecture, and that's because his daughter was born. He was definitely interested in his students and was more than happy to answer any and all questions. \nElham, my TA, was AMAZING. She went out of her way to encourage students and was more than helpful with preparing for papers, tests, and was a good source for info on the discipline. She is hands down the best TA I've had at Columbia. I hope to see her in more of my comparative politics classes. \nWorkload:\nplenty of reading, though most of it was very interesting; 2 papers, each 2-3 pages; midterm; final; mandatory recitations. Not too difficult, just study for the exams and go to recitation. \n"
        }
    ]
}