{
    "prof_info": [
        {
            "prof_name": "Yogesh Chandrani",
            "prof_id": 3709,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 28, 2016",
            "review_content": "\nThis man is so so intelligent. YES, he has a very autocratic teaching style - he will cold call students and holds high expectations; he will shoot you down if you are wrong; he will remain in silence waiting for students to respond. However, there was not one class where he did not blow my mind with his insights. Take his class and don't be put off by his demeanour, he is a really fantastic person. \nWorkload:\nDiscussion posts for every class + standard essays + reasonable midterm/final\n"
        },
        {
            "course_name": "Contemporary Civilizations",
            "review_date": "July 28, 2015",
            "review_content": "\nThis was by far the worst class I have ever taken at Columbia. My biggest regret to this day has been switching into this class second semester. I will corroborate previous comments referencing his knowledge of course content but his efficacy as a professor unworthy of any praise. He is so soft-spoken to the point that students 3 chairs away from the head of the table will only hear indistinguishable mumbles. If you are so blessed to actually hear what he says, he provides explanations without any references to the text. Seeing as though papers and examinations are all take-home, you end up with a notebook full of notes, without any textual support. His grading is extremely harsh with minimal feedback and only question marks on the margins. He does offer to discuss papers before they are due but you basically have to have the entire paper written weeks in advance in order to receive any meaningful feedback. Finally, his course expectations are extremely unclear. For instance, he provides no feedback on weekly discussion posts, yet these posts are graded based on quality and content. As a result, you spend the entire semester trying to ask meaningful questions with no idea whether these questions are acceptable. Overall, his grading criteria for all aspects of the course lacked transparency and detail. STAY AWAY FROM THIS CLASS. Yogesh has the lowest A-range percentage out of any CC professor. Even if you want to learn philosophy or political theory, you won't learn anything here unless you spend hours and hours poring over notes and trying to comprehend his esoteric pedagogy. Seeing as though most students have 4-5 other classes to worry about as well, doing well in his class is nearly impossible without sacrificing time and effort for other courses\nTL;DR: Yogesh is an extremely knowledgeable individual who is able to draw upon his expertise in anthropology but as an educator, he fails at every aspect.\nWorkload:\n2 Papers\nTake-Home Midterm\nTake-Home Final\nWeekly Discussion Posts on Courseworks\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 08, 2015",
            "review_content": "\nI think people are missing the point with some of these reviews. Most of what I've read sounds like it was a judgement made on the first day of class and then the person just held onto that for a whole semester.\nYogesh is brilliant, no one on this page argues with how intelligent he is. Now here's a question; if your teacher is brilliant, and knows the texts way better than you ever will, why wouldn't you try to learn from him? He's the teacher, that's the point of the class.\nYou will get nothing out of this class if you don't put anything into it. Yogesh is a demanding professor who wants you to think critically about the texts. If you want to make up your own interpretation and never be challenged on it, take a different section. In class he is going to offer his own interpretations, and I know some people don't like being told things that contradict what they think. It's not that he wants you to just blindly accept everything he says, its that in order to have a nuanced conversation you need to be able to understand what he is saying. Most of his notes require a lot of thought to fully comprehend, I know I usually only fully got them after hours of writing an essay.\nWith this in mind, you will be far better off if you try to understand where he is coming from on each text. The reason he shuts people down in class is because their arguments don't make much sense. If he challenges ideas (what people have called condescending) it is usually just, \"What do you mean by that?\" or \"How do you define X?\" and other questions that make you reflect on your interpretations. If your ideas don't work, and you can't articulate them, then you need to fix them. That's not a mean professor, that's a great professor. Learning means changing what you think, if you think the same thing the same way before and after a class you didn't learn anything.\nThis class is difficult, not an easy A, but it is possible. If you are taking CC because it is a requirement and couldn't care less, do not take his class. Yogesh requires you to think deeply about each text. If you want to learn the texts and are willing to put in work, this is the best class you can take. I would say he is one of the best professors I've had at Columbia.\nAlso, GO TO OFFICE HOURS! He is extremely helpful and can help make sure you understand each text before he moves on to the next one. CC builds on itself, so it is dangerous to start falling behind early. \nWorkload:\n9 discussion posts\n2 essays\nTake-home midterm and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 15, 2014",
            "review_content": "\nI don't want to make this review long, because the December 2013 comment pretty much sums up what this class was like. Yogesh is extremely condescending and often times unresponsive to students' efforts to participate in the lecture and discussion. This year he taught two sections of the class, however he clearly treated each section differently as is apparent in the other reviews. Yogesh did not start off being a terrible professor, but his snide and hypocritical comments/remarks slowly began to build up and some respect was lost; this may have been a major contributor to the lack of participation by the class. It's almost pretty sad how every day, half the class would faithfully arrive 15-30+ minutes late every single day. I don't blame them though.\nI would agree that Yogesh is very intelligent and sometimes has insightful tidbits of information to share/discuss with the class, but he is very ineffective when it comes to stimulating a meaningful class discussion that assists with your understanding of the text. He forms skewed and often times flawed perceptions of some of his students which are often times flawed and unprovoked. His condescending mannerism goes as far as to question your time, schedule, extra-curricular, and honor to the class. He has no problem accusing students of dishonest work, and you should also be weary of the \"hints\" he gives you in preparation of the exams. He may opt for a take-home exam, however be mindful that it is A LOT more work than you would have to do for an in class final, and he does not allow you enough time to submit quality work.\nYadda yadda yadda. He sucks. If you want to get something meaningful out of CC then find a different professor.\nCC > Yogesh\nWorkload:\nNot terrible (if you don't do the readings)\n9 weekly response papers: 1/2 - 1pg single spaced\n2 papers (6-10pgs)\na lot of typical CC reading\nopen note midterm/final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 12, 2014",
            "review_content": "\nGoing into this course I was a little bit nervous. I had read some of the more scalding reviews below and was expecting the worst, but Chandrani's section of CC was the only one that worked for my schedule, so I had no other choice. Ultimately, though, I ended up staying in his class for both fall and spring semester, and I can safely say that he is a fine professor.\nHe possesses a tremendous amount of historical and cultural knowledge on a wide variety of topics, text-related or otherwise, and he's also very up-to-date with current events. More importantly, his explanation and critical analysis of the texts was always enlightening and informative, if you show up awake enough to listen.\nYogesh will generally open the class with a discussion. A reviewer below mentioned that, after a student speaks, he will often call on another student without responding to the first student's comments. This is true, but you shouldn't take it personally; he intentionally stays out of the class discussions as much as he can in order to let the students talk among themselves. As with any discussion in any CC course, this part of the class hinges upon many students show up prepared and awake. \nAfter the discussion proceeds for a while, he will then turn to his own notes and begin a more lecture-like phase of the seminar, where he does most of the talking. This is the most important part of the class, as the passages he points to and the concepts he highlights as important will directly translate to what shows up on the exams and essay prompts.\nSo, following on that, the essays and exams are all very fair. Even if you only skimmed the readings (I admit to doing this pretty often), as long as you took adequate notes in class you'll be fine, because when he goes into \"lecture mode\" he gives you all the ammunition you need to earn an A. He's very fair about essay extensions and missed classes, too, and as long as you give him notice in advance, he'll gladly see you during his office hours to talk about an upcoming essay or anything else.\nYogesh is not an easy A. If you're interested in a CC class that you can sleep through every time and still succeed, this is not one of them. But, he is a \"straightforward\" A; his work is very manageable, even for a lazy person like me, and there are no surprises on any test or essay. Most importantly, if you do apply yourself, you're really able to learn a lot and have a rewarding experience.\nAll in all, he's very friendly, and not at all the uptight egocentric man some previous reviewers have made him out to be. \nWorkload:\n- Standard CC syllabus readings\n- Weekly reading responses (\"no longer than 1 page single-spaced\")\n- Two exams (midterm + final), usually in class, rarely take-home, always open notes\n- Two papers, one due near midterm, one due near final, 7-8 pages double-spaced\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 22, 2014",
            "review_content": "\nThis was a great CC class, although I admittedly have none to compare it to. Discussions were either excellent or very dull, depending on how exhausted the students were (and how many of them fell asleep in class). Yogesh is also extremely intelligent and gives interesting lecture breaks in class. Grading was fair, exams and essays were pretty much straight out of class notes and discussion. As long as you do the readings and short, weekly response assignments you should get a lot out of the class. It is a good idea to write the responses with a purpose. It's a lot easier to talk in discussion if you already have an idea of what you want to say about the reading instead of coming up with stuff on the spot. \nThe other reviewers are very mean and I'm not sure why. \nWorkload:\nTwo essays: 5-10 pages each. \nWeekly response papers.\nA lot of reading (typical CC)\nMidterm and final: both are in-class and open note. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2014",
            "review_content": "\nI think the reviews for Professor Chandrani are being unfair. He may not come off as the most approachable professor, and he does tend to lecture, but he is an extremely intelligent man and I enjoyed the class as a whole. The workload is not especially heavy for a CC class. There are weekly one page write ups, but many other sections have to do this as well. As long as you participate in discussion, take notes, and keep up with (most) of the reading, your grade should be within the A range.\nWorkload:\ntwo 6-8 page papers per semester, assigned reading, weekly one page responses, in class midterm and final (both open note)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2013",
            "review_content": "\nHORRIBLE CLASS!! GET OUT IF YOU CAN!! \nThis class was by far the worst class that I have taken at Columbia.  Chandrani is not a good professor AT ALL. The discussions were very forced 85% of the time.  If you said something that he didn't agree with, then he just ignored your statement and looked to someone else to speak. There were times that everyone read the readings, but people were still confused because of his extremely difficult and confusing questions.  This ended up in the class sitting in awkward silence for 5 minutes at a time.  He also has this thing where he tells people to speak up because the room can't hear them, but then says that he is the only person who can speak at a low volume like he is some high ruler.\nHis grading is ridiculous.  For our response papers, he just put the grade at the bottom with no feedback, so you have zero knowledge as to what to fix or improve upon. Several of my friends in the class failed the midterm and it was open-note.  After comparing answers, it turned out that they had the correct answers, but according to the professor, they didn't explain in enough detail.  I can see that as getting a B- or maybe even a C+, but not an F.\nThis professor is arrogant and hard. Do not take his class!\nWorkload:\nOne page single space response paper weekly\nOpen note midterm\nOpen note final\n2 essays, 6-8 pages then 8-10 pages\nA lot of reading\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 22, 2012",
            "review_content": "\nThe WORST professor I have had EVER had ANYWHERE. In all of Columbia... all of high school... all of LIFE. This man is the lowest of the low, the scum of the earth. He is patronizing, condescending, and smug. He is probably taking out his frustration of being a failure in his academic circles (look him up, he's like 50 years old and has only published one book which he CO-AUTHORED... the laughing stock of the Anthropology department). This is why he needs to make himself feel better and smarter than all his students. What a jerk. If this is the only spot left when taking CC... postpone it until next year! Fake an illness and take a medical leave of absence! Go cry to another professor to let you into his/her class (Stamenka Antonova is an easy A). He made us go to class during the 2010 blizzard when they shut down all of Columbia for the first time is YEARS (maybe decades) because of the snow... and there we were in Hartley watching the snow grow by the minute outside the window (which is already underground as it is). He constantly tells you to, \"Think!\" as if you were the stupidest person in the world. I can't believe I didn't throw a book right at his repugnant face. \nWorkload:\nOverwhelming.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 02, 2012",
            "review_content": "\nAbsolutely and completely the WORST  professor I have has in all of college. I am not exaggerating when I say that I still have traumatic flashbacks to this course. Professor Chandrani is very smart, but he is alao aggressive, egomaniacal, and vindictive. He will smugly patronize you while humiliatingly making you redo paper after paper. He is totally inaccessible and terrifying, and has absolutely no interest in hearing what his students have to say. For our final class, he read aloud his 100-page disseration for two hours. I hope this man is not still employed at Columbia.\nWorkload:\nA lot\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 04, 2010",
            "review_content": "\nProfessor Chandrani is a very smart man. There is nothing this man does not know. Is very well-read, as well as very current on news stories. Also has lots of knowledge of the history of foreign conflicts, which adds a lot of insight to second semester CC.\nThat being said, he is probably one of the hardest teachers in CC. His questions often cause a dead silence in the room, and sometimes class turns from discussion to a struggle to survive, i.e. someone says something before he calls randomly on people who didn't read the book (he only did this twice throughout the whole year). He can become very abstract, and doesn't do a good job of explaining the authors' vocabulary well. He expects you to understand it from the reading. The discussions can get pretty terrifying on occasion, but it's important to still put yourself out there in order to make a good impression on him.\nHe does allow you to take notes on your computer.\nHe'll often go into lengthy explanations in the middle of class to explain a concept. These tend to be good, but you can't tune out at all or you'll miss very important information and will not understand the rest of the explanation.\nIf you want to do well in the class, you must do all the reading. Beyond the lengthy readings and the terrifying discussions, the workload becomes very manageable. Two 7-8 page papers, usually from a choice of three topics (though the last paper second semester he allowed only one topic). The paper topics consist of some abstract subject, and the two authors you must compare. Make sure to meet with him about your paper, and try to get a meeting earlier in the day, when he's fresh and chipper. His essay prompts require lots of reading between the lines: if you meet with him, however, you'll come out with a very clear idea of what you need to write about.\nTake-home exams, often 3-5 days to complete them. Also, the grades you get on the exams do not represent the grade you will get at the end of the class: he came from the British school system, so the grades you get tend to be lower than what another teacher would give you.\nTake my review with a grain of salt: I never did any of the readings completely.\nWorkload:\nReading gets a lot heavier second semester (though I suspect that happens with most teachers).\nWeekly responses.\nTwo 7-8 page papers. Suggested to meet with him at least once.\n1 midterm (first semester was take-home, second semester was not)\n1 final (both semesters was take-home, at least 72 hours)\n"
        }
    ]
}