{
    "prof_info": [
        {
            "prof_name": "Mikhail Khovanov",
            "prof_id": 5511,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 18, 2015",
            "review_content": "\nI can't shake the feeling that Khovanov was a dud. I like the guy, he's sweet, and actually incredibly smart. Look up \"Khovanov Homology,\" he's done a lot of ground breaking research (somehow being used a lot in String Theory). As a Modern Algebra instructor, though, he fell pretty flat.\nModern Algebra I is trivial for anyone who's been exposed to a group before. It was weird, somehow it didn't feel like we were ever really doing anything. I think the only interesting stuff was Burnside's Lemma (and group orbits in general), the Sylow theorems and the classification of Abelian Groups. I realized that I was doing fine in the class, but that was just because I had a good idea of how groups worked, not from anything I learned in lecture. The way Khovanov speaks makes it impossible to pay attention. It's not exactly his accent, I can always make out what he's saying at any given point in time, but the way he presents things is just bizarre, and I can't quite explain how. I had no problem paying attention in any other class except for his. Every time I tried to I would lose the thread after 5 - 10 minutes. By the way, this isn't just me: everyone I talked to in the class had the same experience.\nModern Algebra II is pretty bizarre. It definitely had a lot more content than Modern Algebra II, going briefly over Ring Theory and then spending a lot of time talking about Fields and Field Extensions, and then finally Galois Theory (apparently there's more to it than the unsolvability of the quintic, who knew?). I was excited to learn about Galois Theory, but now that the course is done, I can't honestly say I have. Sure, I understood the results, as they weren't too crazy, but I didn't really understand the process. The homeworks and tests really only test you on the results. I basically learned exclusively from the textbooks / Friedman's notes, as I wasn't able to pick up anything from the class itself.\nIt's not hard to get an A in Algebra II, but it is pretty hard to understand all the material at a good level. Maybe it's just Khovanov, who knows? When the TA came in to teach as a substitute a few times, it was like the clouds opened up and I understood everything.\nThe weekly homeworks aren't so bad, a lot of them are pretty easy, some of them use results proved in class which make things a bit harrier. The quizzes are all true / false, a few tricky ones, but not THAT tricky. The midterms were pretty easy, but the final wasn't that easy, not because of the questions, but because I had such a poor grasp of the material.\nSo... Algebra... A bit of a let down, not gonna lie.\nWorkload:\n25% weekly homework, 10% quizzes (2 or 3), 15% each midterm, 35% final.\n"
        },
        {
            "course_name": "Representations of Finite Groups",
            "review_date": "December 29, 2009",
            "review_content": "\nProfessor K is a really awesome guy and I think everyone enjoyed this class. He has a really good sense of humor and is always cracking jokes related to the material. For example, the light-switch started beeping once during class, as if it were going to shut off soon. We had to toggle all three switches to stop the beeping and Michael quipped that it was \"the group Z2xZ2xZ2.\" On another occasion, he remarked \"When I was young, I tried to picture the 3-sphere....and I almost succeeded except for one point!\"\nWe went through the material in a very non-rushed manner and Michael was happy to answer any question no matter how stupid. The TA (You Qi) had a round table discussion for an hour every week which was great. You Qi is extremely smart and he likes to talk about math.\nThe homework and tests were extremely easy (small computations usually) but the material is rather advanced and there are some difficult patches. There is a wonderful website for the course with many useful links and even a few online books. We loosely followed one of these books for about 2/3 of the course. For the rest of the course Michael came up with this interesting way to present the last topic which wasn't in any book or article but the TA wrote up the notes for this section. They are excellent.\nWhat I appreciated most was that we covered necessary topics that you don't see covered in any of the other undergraduate courses here (Modules, Algebras, Category Theory, Zorn's Lemma, Linear Groups). Everything was presented in a very intuitive way (he loves geometrical proofs) and the different pieces of the class were wound together nicely.\nThis is a really good class. It wasn't very time consuming but you will learn a lot if you take it. Khovanov is a good teacher, I hope he decides to teach this class again.\n\nWorkload:\n1 problem set every week,2 tests, 2 quizzes (All of them very straightforward, no tricks)\n"
        }
    ]
}