{
    "prof_info": [
        {
            "prof_name": "Daniel Kalderon",
            "prof_id": 3286,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Stem Cells: Biology, Ethics, and Applications",
            "review_date": "May 17, 2011",
            "review_content": "\nThis is a paper-based biology class.  This was the first year, so everything was a bit chaotic.  We never really knew what we should be reading, skimming, or just noting.  Class was a frustrating mix between a lecture and a seminar, and 4 professors and 4 TAs in a class with 16 people can be a bit much.  All of that said, I'd still recommend this class to students interested in stem cells and the ethics of science and medicine.  It's one of the few science classes that is more than academic bulimia.  Way less knowing facts and way more emphasis on reading papers and trying to answer more complicated questions about how stem cells work. \nWorkload:\nA rather large problem set every 2 weeks, in class midterm, take home final.  There's also a weekly recitation.\n"
        },
        {
            "course_name": "Biotechnology",
            "review_date": "May 05, 2011",
            "review_content": "\nAll I can say is STAY AWAY. Professor Kalderon is one of those Professors who ends up taking off points and saying \"I would have done it this way\". He doesn't look at whether something is right or wrong, but instead, he determines what he thinks is a correct interpretation/how something should be done. Trust me, if you don't do it his way, your grade will suffer. Actually, I should say suffer more, because he is also one of those Professors who gives amazing work a B+. Don't bother going to office hours. He is rude and not very helpful. \nWorkload:\nIts not a huge amount of work, but whether you work on something for 3 days or 3 weeks, your grade won't change.\n"
        },
        {
            "course_name": "Biotechnology",
            "review_date": "September 11, 2007",
            "review_content": "\nI always came out of this class with a lot of confusion. Initially, I thought it was only me but later on realized that the professor didnt make sense to most in my class. We were given lot of home works and it almost always didnt cover what was taught in class. When i had gone for the TA session just to make more sense, he was least interested in teaching us and basically this course is a waste of time and money. you tend to get more confused if you question the professor during the lecture.\nWorkload:\nhome works everyweek which doesnt make much sense.\n"
        }
    ]
}