{
    "prof_info": [
        {
            "prof_name": "Deborah Mowshowitz",
            "prof_id": 2673,
            "total_reviews": 95
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 31, 2017",
            "review_content": "\nThis is a difficult class. If it matters to you, I got an A- the first semester and a B+ the second semester (FYI this was my first ever B at Columbia). If this were any other class I would be really mad at myself for getting a B, but the amount of interesting information I learned made up for it and I don't regret taking this class at all. I'm premed, and I thought Mowsh bio would be the reason I drop premed. The class ended up instead making me want to continue to be premed even more. I think professor Mowshowitz is one of the best teachers I've ever had at Columbia—there's a lot of information, and some of it is difficult, but she is so good at explaining concepts. This is why my number 1 tip for this class would be to simply FOCUS IN CLASS. I started to pay a lot less attention in class second semester and ended up having to learn a lot of information on my own (which is much, much, harder). Another thing that made this class so great is that there was no required readings—95% of the things you needed to know were taught in class (which is another reason you need to FOCUS IN CLASS). If you pay attention in class, do all of the practice problems in a timely manner, and read her lecture notes (which are easy to read, to the point, and teach you that last 5% you don't learn in class), then I promise you will enjoy this class and not get a terrible grade. Mowshowitz isn't this demon everyone seems to portray her as—she's actually a very nice person and a great teacher. I'm surprised she doesn't have a nugget on here. I feel like her culpa page is dominated by people who got bad grades in her class (which is ok, grades aren't everything! Enjoy the more important things in life for god's sake). And yes, it's true, there is no real \"curve\" in this class, but this past semester if you averaged an 86 on the exams you would get an A-, which is doable. Good luck!\nWorkload:\nproblem sets that you don't turn in, weekly quizzes in recitation (you're guaranteed to get full points for the quizzes, so you don't have to worry about studying for those), 3 midterms + 1 final (drop lowest midterm or drop half of your final/half of your lowest midterm)\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "March 02, 2017",
            "review_content": "\nI had a really tough time with this class and decided Barnard was a better choice. It was just weird, and very tricky. Barnard is a traditional biology class, straightforward and organized from basics to advanced material. We learned about anatomy which I enjoyed.I took biochem separately as is required by many medical school admission committees.  My study time as full time student was manageable and I was able to explore opportunities at the medical campus. I don't believe that I would have had as much time for that if I contributed with mowshowits as a full time student. I did well on my MCAT and have been accepted to multiple medical schools including highly ranked ones here in NY. Maybe if you are a postbacc and have time for it you will like it but I'm glad I switched. There are allot of rumors but the truth is that med schools care about your grades not where or who you took Bio with.\nWorkload:\nAllot\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 05, 2017",
            "review_content": "\nIf you become a doctor, someone is eventually going to die because you could've done something better, or didn't know any better. That's going to be more difficult to deal with than getting a C+ in this class (or it should be). If you can't emotionally handle that, don't become a doctor. \nThat said, don't take this class unless you have to.\n\nWorkload:\nA lot\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "August 02, 2016",
            "review_content": "\nIf You're Reading This It's Too Late.\nWorkload:\n3 midterms, 1 final \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 26, 2016",
            "review_content": "\nTaking these courses was probably the worst decision I made at Columbia! I did well, but the experience was taxing, demoralizing, and thankless. The lectures themselves are fine—not earth-shattering as people claim—but the exams are outrageous. Some questions are fair, but others are ambiguous in their wording and meaning to the nth degree, and are testing us on how well we can intuit what was *meant* to be asked, without being given enough information to know for certain. Basically we're betting. \nI know people beg to differ on this point, but I am an experienced test-taker, am totally capable of critical thinking and deduction, and knew the course material backwards and forwards (spent countless hours at recitation, reading the class notes, re-listening to the lectures, working through the problem sets, etc.). I am certain that in many cases these weren't edifying puzzles we were solving, but intentional obfuscations.\nIn short, unless you have a taste for aggravation, ambiguity, and fear-mongering, don't take this class! And if you do take it, do not for a minute let anyone make you feel stupid for not being adept at solving \"Mowshowitz problems\"; it isn't a reflection on your intelligence, or a prognostic for your future, in any way. \nWorkload:\nVery heavy\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 08, 2016",
            "review_content": "\nI am an alum from a short while ago who is pursuing a medical career, fortunately with some success (at least thus far). \nThis class can be beneficial to you as a pre-med in several different ways:\n1) Doing well in the course demands that you adjust to complex material and a new mode of problem-solving. \n2) It requires you to produce. Regardless of the time you put in and the effort that you pour into studying, if it doesn't show up on your exam performance, your grade will suffer. This naturally causes some stress, but it parallels aspects of MCAT preparation, of interview season in the thick of med school applications. You have to adapt your processes on the fly and work smarter, not just more, as with some other class. You can't work mindlessly, on autopilot. The correspondence between work/time and results can be unclear to many and it requires some troubleshooting to establish. 3) It is difficult, as I expect medical school, which I will begin shortly, to be.\nRegarding preparation for the MCAT--it is not that the class functions necessarily as the ultimate MCAT prep course, as I have heard some to say (at least in my experience it doesn't). Rather, the fact is that the demands of the class make you more accustomed to \"pressure\" MCAT study/reasoning places on your shoulders. It is like running a marathon--you'll be better off if you're accustomed to the exertion.\nNow, that said, it is easy to get overwhelmed if 1) you're background in biology/chemistry is weak (this may be due to your own negligence in earlier years of study, or, as it commonly is, due to matters out of your hands). 2) You have a lot on you're plate in terms of competing demands on your time. 3) You have bad time management skills. If you have any of these problems, you need to do some introspection + pursue tutoring etc. Get some outside perspective/help. \nWorkload:\nVery variable, depending on your previous preparation. The problem set books are your best friend. \nAlso, unless something's changed, the textbooks are not necessary for scoring well in the class. The material in lecture/notes is. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "April 28, 2016",
            "review_content": "\nProf Mowshowitz is one of THOSE professors who teaches and tests in a style all her own. I am NOT a premed major nor do I want to be. She lectures, teaches and then tests on materials foreign to most. In a class where the MEAN test grade is a 70 this is evident. My classmates and I spent 15 plus hours a week on this class to score a 70. That says a. She doesn't teach right or b. she doesn't test right. Avoid her at all costs.\nWorkload:\n3 midterms, 1 final. Non cumulative. Drops the lowest midterm or averages it with the final. Average course grade rumored to be a C. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 07, 2015",
            "review_content": "\nThis was my absolute favorite class during my time at Columbia. Dr. M is great lecturer and has a great sense of humor. Having recently scored well on the new 2015 MCAT, I can tell you all that Dr. M's teaching style was The Best preparation for the kind of critical thinking skills you will need to succeed on the new test. Don't chicken out and take the class at Barnard. Instead, listen to all of Dr. M's advice on how to study for her class and you will do well. It might be hard at first, but if you sincerely work at it, it will benefit you in all of your classes. The problem sets are everything. Do not wait until the last minute before an exam to work on them. Do a couple of problems every night and -  this part is crucial - review your mistakes on the problem sets! Make sure you understand where you made mistakes in your thought process. \nWorkload:\nThree midterms, 1 final. Lowest midterm dropped. The exams aren't technically \"cumulative,\" but if you don't understand what you learned before, you won't do well.  Weekly recitation with quizzes. Do the problem sets! But don't procrastinate. Pace yourself. This is the key.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "August 14, 2015",
            "review_content": "\nI found the class and the professor to be pretty funny. Maybe it's because I'm a little older than most premeds here but the whole idea of forcing people to take your class because you think no one else teaches biology the right way is kind of ridiculous. It's also a red flag for a weed-out course. after a good laugh ...back to ssol: \"drop\" Contemporary Bio.. \"add\" Introduction to Biology (barnard college)... Medical School is Competitive and your GPA is one of the most important aspects of your application if not the most important.  I think challenges build good character and I definitely respect the friends I have who did well in this course, however in the grand scheme of things your college intro biology is not really a huge part of your medical education. However, bad grades will hurt your chances and unfortunately I've seen many people vanish after their \"orgo-bio\" year. It's all challenging.. Orgo, Bio, Biochem, The new and longer MCAT which you also need to prepare for. Unless you're linking or you have to major in bio or orgo I don't see the utility in taking this class. Take bio somewhere else, maybe Barnard, study for the MCAT, spend time on orgo, and get recommenders who know you and apply early. Your grades are very important, set yourself up for success. You're not taking the easy road, you're making good decisions. \n\nWorkload:\nI wasn't in it for long enough to say\n"
        },
        {
            "course_name": "Introductory Biology",
            "review_date": "May 02, 2015",
            "review_content": "\nI don’t understand how Dr. M still doesn’t have at least a silver nugget. She is a fantastic lecturer and when you are sitting in her class, you can easily tell that she is well-seasoned in teaching and talks with ease. She gets the material across very clearly, and as long as you do the problems honestly, you should be able to do fairly well in the class. Yes, introductory biology may be more stressful than it needs to be because of the exams, but that does not mean Dr. M is a bad lecturer. In fact, she is one of the best I’ve had at Columbia.\nWorkload:\nProblem Sets, optional, but you should definitely do them.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 25, 2015",
            "review_content": "\nI think Mowshowitz is a very solid teacher--she's good at getting the information across, but she's not outstanding. She really cares about her students though and genuinely wants everyone to do well. My advice for people in this class is not to stress. If you over think tests then you just psych yourself out and do badly. Her tests are hard, but she doesn't usually want you to come up with convoluted answers or anything like that. My first semester I stressed so much about this class and didn't do very well, but the second semester I decided to loosen up and not study as much and I did way way better. I think for her class you really just have to accept that you are good at taking her tests or you're not. Some people are really good at them and some people just aren't.\nMy \"review\" of this class is to tell all people not to worry too much! It's really not worth the stress and you will do fine! Just do the problem sets!! \nWorkload:\nNo work during the week, just mac sure you do the problem sets before the tests.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 27, 2014",
            "review_content": "\nThis class is taught by Larry Chasin for the first unit or so and Mowsh for the rest. The difference is incredible. I wish Mowsh taught the whole thing. Chasin uses powerpoints that are impossible to keep up with during lecture and drones on and on in monotone that's hard to understand. Mowsh uses chalk and models and handouts and speaks clearly. She covers all her bases and makes everything very clear. One thing I loved about this course was that all you really needed for it was a $26 workbook Mowsh wrote herself -- no required textbooks. If you pay attention in class and do the problems, you're golden. The book includes an answer key that explains the solutions very in depth. This was quite possibly my favorite class and nowhere near the stress and workload I had heard about, although I do know many people who would disagree. I think AP Bio prepared me well -- a lot of the material is review from that, just covered more quickly. Very little memorization, you just have to know the stuff inside and out for when she gives scenarios on exams that don't actually happen in real life, but can be solved if you understand the processes. The exams aren't exactly easy, but the curve is good. We haven't gotten our final grade back yet, but I expect an A.\nWorkload:\nRecitations each week an hour and fifty minutes long, which are kind of annoying but chill. Quizzes, but the TAs typically make them easy because they don't really matter -- once you accumulate 60 points (points from each quiz just add together), you're done. And there are more than 6 quizzes worth about 10 points each. No big deal. After that, review lecture material and do recitation problems.\nWorkbook problems optional but highly recommended\n3 Midterms, all Thursday nights (kind of annoying), 1 final. Lowest midterm dropped, or, if your final is your lowest grade, weighted half as heavily and you lowest midterm is weighted half as heavily (so that people still have to actually try on the final). Non-cumulative\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "April 17, 2014",
            "review_content": "\nI am an alum (graduated from CC 2011). I am now in medical school, studying for my boards. Why am I writing this review? Because after taking Mowshowitz, everything in medical school is a PIECE OF CAKE. I am studying for the boards right now (Step 1 USMLE), and I just got 3 questions from the Question Bank right because of what I remembered from Mowshowitz's class.\nTake the class, because you will be thankful later, especially if you become a medical student.  \nWorkload:\na lot but worth it \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "April 09, 2014",
            "review_content": "\nThis class is hard, there's no getting around that.  However, it is by far one of the most interesting classes I've taken.  Yes, there were hours spent in Butler reviewing lecture notes and working through the problem book only to get a mediocre grade on an exam, but I wouldn't rather have anyone else teach this class.  Go to lectures, take notes, draw on the handouts.  Mowsh puts the lecure notes online, but it's her descriptions and explanations that make her a great professor.  She loves her food analogies (the proteins in tight junctions are like carrots going through a sandwich) and get's super into her plastic DNA models.  If you just take a deep breath and really focus in class, you will appreciate her humor (yes, she can be quite funny) and teaching style so much more.  \nBottom line:  Mowsh is great.  Your approach to the class will decide how stressful you find it.  Do the problems and the practice exams, and take notes in lecture.\n\nWorkload:\nAs much as you want.  Weekly 2 hour recitations, but after you get all the points, you don't technically need to go.  Expect to spend several hours each week doing problems and reviewing lecture notes.  3 midterms (lowest is dropped) and 1 not-so-cumulative final\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 22, 2014",
            "review_content": "\nI loved this class.\nI loved Mowshowitz.\nI was slightly less enamored with Chasin. Really, if you have a different teacher for the biochemistry lectures, make it someone who specializes in biochemistry. There are several at Columbia. Maybe Professor Cornish as a preview for those who eventually have to take bio. \nDisclaimer: not a pre-med, not a bio major. I took this purely out of interesting (and as a sort of masochistic challenge?) It ended up being one of my easier classes with a light workload of just doing the problem sets and reading through the lecture notes before each exam. I haven't been to office hours with Mowsh but my TA was the nicest person ever and maybe I'll come to see her if I have questions this semester. Doing the problem sets was actually a highlight of my week, they were awesome and interesting. \nDon't panic! You will survive! \nWorkload:\nFour exams, non-cumulative beyond the accumulation of test taking skill.\nA lot of problem sets--do them in the order on the website for best results.\nWeekly (easy) recitation quizzes, basically just participation. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 21, 2014",
            "review_content": "\nI am now an alum of Columbia and I am writing this review to help other students make an informed decision about taking Mow bio.\nI didn't take AP biology in high school and didn't have an incredibly strong biology background. I went into Mow bio very unprepared and found it VERY difficult. We studied cellular respiration early on and while most of my classmates already had the basic idea (any maybe even steps) of the Krebs cycle mastered, I was still trying to figure out what it was. Ultimately, I withdrew from her class (after failing a midterm) and took biology at Barnard the next year. Yes, biology at Barnard is easier (those of you who struggled and made it through Mow bio... congratulations). However, there is nothing wrong with easier. College biology doesn't need to be as difficult as Mow makes it.... its just not necessary. I worked hard in my Barnard biology class (again, I was far behind in terms of biology knowledge), but I didn't let it take over my life. I ended up with A's both semesters.\nFast forward two years... I did incredibly well on the MCAT and graduated magna cum laude from Columbia. Again, biology doesn't have to be as hard as Mow makes it. If anyone is trying to tell you that you have to take Mow bio to get a good score on the MCAT... they are wrong. I have been accepted to multiple medical schools, including one that is tied in rankings with Columbia (for those of you that are tied to rankings). So, if anyone is telling you that you have to take mow bio because med schools know that you chickened out and went to Barnard for the easier bio.... well they are just wrong again. Not one medical school has even mentioned my biology class. I promise that all that matters when you end up applying is your grade/GPA (not whether it came from Barnard or Columbia). \nOverall, this is my advice: \nIf you are a student that took AP biology/similar class, has a strong biology background, has a relatively light courseload (Mow is doable but it takes A LOT of time), and is interested in the challenge.... take mow bio. \nIf you are a student that doesn't have a strong biology background or is taking a heavy courseload (or one that just doesn't want to invest 20 hrs/week studying mow bio).... take biology at Barnard. It isn't a walk in the park and you will still have to work for an A. However, you will learn all that you need to know to do incredibly well on the MCAT and succeed in future courses. Also, PLEASE, don't let your pre-med friends guilt you into taking mow bio. If you think that Barnard bio is a better fit for you, take it. Your GPA/med school applications will thank you,\nI just wanted to put this all out there because I heard a lot of rumors when I was at Columbia (med schools know the difference between the two classes, mow bio prepares you much better for the MCAT, etc) and they are just not true. \nWorkload:\nLots.\n"
        },
        {
            "course_name": "Introductory Biology",
            "review_date": "January 10, 2014",
            "review_content": "\nI came into the class thinking that it would be filled with impossible problems and materials. It didn't end up being too bad. Yes, there is a certain way you have to think about the problems -- some people get it right away, and some people don't. If you don't, then you'll probably have to spend some extra time doing the problems from the problem set book. I did end up doing almost all the problems from the book, but even though there were a few that I just gave up on doing because they were long and/or confusing, I was fine on the tests. I received an A in the class, and to be honest, the course was one of my easier ones this semester (I'm in applied math in SEAS, so had a handful of other technical courses). Be prepared to spend a decent amount of time studying and doing problems, but the content of the course isn't more complicated than what would be covered in AP bio. Id say the most difficult part of the course is just plowing through the paragraph-long questions, and to be careful and attentive to detail. \nWorkload:\n3 midterms (in the evening...) and a final. Midterms are slightly scaled up by 3-4 points. \nProblem set book-- can take as much or as little time as you make it, I spent probably 3-4 hours a week. \n"
        },
        {
            "course_name": "Cellular and Molecular Immunology",
            "review_date": "October 17, 2013",
            "review_content": "\nWord of advice: DO NOT TAKE THIS CLASS WITH ORGO. PERIOD. ACTUALLY, DO NOT TAKE THIS CLASS WITH ANY OTHER DIFFICULT/EXTREMELY TIME CONSUMING CLASSES. I finished freshman year with a strong GPA, so I got overconfident and opted to take this class along with orgo, with the plan of taking my MCATs earlier. BIG MISTAKE. I'll probably have to put off taking the MCATs and take some time to pull up my GPA after this class (and possibly orgo) completely destroys it. If you want to take bio with mowsh and earn a semi-decent grade, make sure it's the only time consuming/difficult class you're taking. That said, the material itself isn't impossible to understand. But be warned, you need to devote a shitload of time to her problem sets. And yes, DO ALL THE PROBLEMS!  \nWorkload:\n3 midterms, 1 final\nproblem sets \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 24, 2013",
            "review_content": "\nTake a deep breath!  It's going to be ok.\ni took mowsh bio and now i'm a yale med student, so you can do it!\nI heard terrible things about intro bio with mowshowitz and i was incredibly scared to take her class, but it actually turned out to be completely manageable and one of the most, if not the most, important classes i've ever taken.  it lays a very important framework for understanding biological mechanisms and will guide you through the rest of your biological studies.  tackling every bio class since mowsh has been so much easier because she teaches a special way of thinking.  even today in my med school classes i feel like i understand what is going on so much better because of what mowsh taught us and how she taught us.  sometimes i even go to her c2005/c2006 websites to review basic topics.\nmy suggestions:\n1) go to lecture, her demonstrations are key and so are the questions she asks in class.\n2) go to bio recitation, ask a lot of questions.  stay 5 minutes late or come 5 minutes early if you still need more clarification.\n3) if you have questions, email mowsh!  she is amazing at sending back clarifying responses.\n4) do the practice problems!  it's best if you can review them in a group, but doing them on your own works too if that's how you learn.  you can learn a lot of key concepts from the answers.\n5) don't focus on little details.  mowsch cares about the bigger picture.  she doesn't care if you remember the name of something, she cares if you remember the pathway.  in this way you can apply your logic to any new situation.\n6) dont read the textbooks!  there is no mandatory textbook because it is unnecessary.  she teaches you everything you need to know.  its a waste of your precious time.  BUT looking at the pictures in the book and reading their explanations is a good idea.\n7) print the lecture notes and annotate them with her lectures.  read them several times over, at least 3 times.  it takes time for your mind to wrap around certain ideas.  \n8) get a good night's rest before the test.  since her tests are mainly testing your way of thinking you need to make sure you are awake and sharp for the test!\n9) look for clues in the paragraphs she gives you on the test.  THERE ARE ALWAYS CLUES.  pay close attention to bold words.  if you think you don't have enough information to answer the question, you're probably missing something.  move on and look back at the question information again later.\n10) make sure you can explain your answer all the way to the end.  sometimes you'll follow your logic to the end and realize that that was the wrong train of thought!  and then you'll realize what the real answer is.\nif you aren't doing as well as you would like, please don't freak out.  that's the worst.  it's bad for your health (mental and physical) and it won't get you anywhere.  you might even freak out so much, you impair yourself from studying well.  \nalso, you can do badly in one class and still succeed in life guys!  for example: a close friend of mine got a C in 2nd semester of mowsch bio and is now in a great medical school.  i wouldn't recommend it, but you can always make a come back.  don't give up!\nlastly, make sure to do things that you love: run, paint, walk your dog, sing some songs.  butler isn't going to make you happy.\nWorkload:\nMedium: go to lecture, read lecture notes, look at pictures in books, do problem sets on your own time.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 18, 2013",
            "review_content": "\nDISCLAIMER:If you're reading this review, chances are you have to take this class. Tough luck. (Also, for full disclosure, I got an A in this course for both semesters.)\nI don't think reading all of these reviews will help you with this class. There's no real sage wisdom to be found here. These reviews are here solely for comedic purposes, written by burned out pre-meds who are either venting about the unfairness of it all or by students who drank the Kool-Aid and bought into the personality cult of Chairman Mow.\nThis is a flunk out course. Pure and simple. It is designed to weed out people that should go to medical school from those that should not. Once you dispel any other notions you may have about this class and accept that, you will be able to do well in this class.\nA lot has been said about Deborah Mowshowitz, aka Chairman Mow. People, even if they're doing poorly, seem to think she's an amazing professor, albeit one with a penchant for students' suffering. The truth, however, is that she is only an average professor. Those handouts look like they were drawn by a 3rd grader and they're not very well organized. The class notes, the surrogate textbook for the course, is just an outline of the lecture which doesn't have any additional information/references. So, if you don't understand something in the notes/lecture, you're stuck. My biggest gripe with her teaching is that she acts as if she's bringing great wisdom down from the mountain for the benefit of humanity. It's Intro Bio, and the actual information taught in this course is not far above what they teach in AP Bio (and in some cases, is at the exact same level).\nThen there's studying. You buy the problem book, do the problems, understand how to do the problems, make sure you logically understand the material, and replicate this process on the exams in order to do well. That's it. There is no magic formula for studying, no easy way around it. For the people who say they study for hours and hours on end and still don't do well, you're probably not studying effectively. This class will teach you how to study if you don't already know how to. If you can't learn how to study, then medical school is going to be tough for you.\nThe Chairman is often accused of decreeing, \"Well, maybe you're not cut out to be a doctor.\" I don't doubt that she's said this (in fact, I can almost guarantee she has), but I don't think that's an extraordinarily mean thing to say. To be honest, I think it is a little bit of hard truth. I've talked to people in my family who are in medicine (one of whom is a professor at a med school), and when I've told them about this, they say. \"You know, as harsh as that sounds, it is true. And it's probably better to hear it earlier rather than later.\" \nSome of these reviews complain that \"the only way to do well is to think like Mowsh.\" Well, ok. All I can say is get used to it. Just about every professor thinks this way, including STEM professors and med-school professors. That's kind of the whole point of taking their classes.\nLastly, there are some people (possibly including Mowsh herself) who think that the comment \"Maybe you're not cut out for medical school\" is a dig at your intelligence, suggesting you should do something easier, \"like history or philosophy.\" First of all, those subjects aren't necessarily easier than medicine (as a STEM person myself, you're not automatically smarter or better than humanities kids, sorry). Second, it's not a dig at your intelligence. Even though I did well in this course, I ultimately decided (partially because of this class) that I shouldn't go into medicine. So I guess the system works.\nUltimately, you should stop complaining so much about this class. If you really want to go to medical school, then you're going to have to get used to classes like this. It's just the first of many. And if you do poorly, don't let it get you down. No one's going to care about a B in Intro Bio.\nWorkload:\nProblem book work used to study, recitation sections that contribute to almost 0% of your grade (and are fairly unhelpful), 4 exams (3 midterms and 1 final), the lowest 1 dropped.\nGodspeed.\n"
        },
        {
            "course_name": "Introductory Biology",
            "review_date": "June 13, 2013",
            "review_content": "\nThis class is not about biology. It is about teaching yourself to think like a Mowshowitz. As a high school student I taught myself more conceptual material in AP than I ever garnered in C2005/6. Mowshowitz's dedication to teaching is very admirable, as she devotes all her time to her several hundred students and publishes papers on undergraduate education. That being said, her lectures are extremely repetitive and her notes are \"organized\" in a swirl of unnecessarily coordinated colors and prints that bring me back to kindergarten. The material she covers is interesting, of course, but her manner of presenting it kills its beauty. Her tests, however, are the most abominable part of this course - and not because they are conceptually challenging. Mowsh's questions are designed to trick you, which is not an inherently bad thing. The problem is that the only accepted answers are the ones she thinks as such. Even if you explain your logic in a perfectly sound manner, you do not get full credit (at least that was my experience). You have to teach yourself to look at what she wants you to know, biology notwithstanding. Never over-think the problem, and don't make too many logical assumptions. Instead make assumptions based on the material presented in class (for example, a seven-pass transmbrane protein will always be a GPCR, even if you have no experimental data to support that). To do well, do the problems and do them again. If you're premed, I pity you for having to take this course and I hope in the future Columbia's biology department will expand its repertoire of Intro bio professors. Columbia does a great disservice to its biology students by forcing them through a single introductory course fueled by one professor's well-intentioned but ineffective methodology and perpetuated by premed angst.\nWorkload:\nDepends on what grade you want. A solid five hours each week and a few days of problem set cramming can get you an A. Use your resources!\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "June 02, 2013",
            "review_content": "\nAs for the overwhelming number of posts about unfair and hard the class is â€“ this is not for some classic or psych major student. The majority of students in this class are pre-med/pre-PhD students. Yes it is hard, but hell would have to freeze before I would ever want my doctor not to be able to do this class. If you are pre-med and seriously have a complex about having to â€œteach yourselfâ€\u009d the material and think this is too difficult/tedious- reevaluate your current life path, what do you think med school is going to be like? This is a weeder class, the whole point is for it to be hard. That being said the only people I ever heard say the class was extremely hard or unfair or just general complaining were the post-bac students. Maybe the rest of the undergrads have just already been beaten into submission for the workload at Columbia but they tended to have the mentality â€œyes this is hard and I have to work to get the grade I want.â€\u009d \nGoing in to this course you have obviously read about how hard it is and yes you will change your way of problem solving and test taking yadda yadda- but a good grade isnâ€™t unobtainable. There is no way to BS your way through these tests. You know the material inside and out or you donâ€™t. The exams are not unfair and if there is ambiguity in the questions, Mowshowitz compensates for this with the grading. She has a certain way of asking questions that can take some time be able to follow how the specific phrasing of the questions should guide your thought process. If you are unsure which answer she wants put both and EXPLAIN YOUR ANSWERS â€“ if your logic is right you will get points.\nIt amazed me at how inefficiently people prepared for these exams â€“ read the lectures notes (its pretty helpful to look at the referred figures in the textbook â€“ Becker â€“ donâ€™t waste your money on Sadava, they give a much more in depth view of processes that help on the exams when you have to infer information). Now re-read the lecture notes and do the problems in the ORDER THAT SHE ASSIGNS THEM in the notes. They are assigned in order bc the answers sometimes have info you didnâ€™t have in the notes and need for further problems. People seemed to get really frustrated with the problem book when they started a pset at questions 1 and went in order. Yes is would be totally logical for her to put the problems in the order you should do them but it just didnâ€™t happen. \nGoing to lecture is really up to you, it helps some people to see the models and drawings etc. \nChavin doesnâ€™t get enough credit on these reviews he is a great, although sometimes monotonous, lecturer â€“ the powerpoints are helpful to see in class as he goes through them.\nAs for the guest lecturer Hinkle-something, sheâ€™s obviously brilliant but she was very scattered and her notes were atrocious/skeletal compared to Dr.Mâ€™s. Go to lecture, decipher what topics she is covering, and then read the accompanying textbook to teach yourself. \n\nWorkload:\nDo the problem sets and get your hands on some old tests - the more practice you have with the understanding the way she expects answers to the questions the better you will do. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "May 15, 2013",
            "review_content": "\nI just completed this course as a second semester freshman planning to major in Biology, and I don't think any teacher has ever taught me more than Dr. Mowshowitz.\n\nDr. Mowshowitz does her utmost to help you learn the material. She is an excellent lecturer who explains the concepts very clearly and rarely, if ever, leaves anything for you to learn independently. Before every lecture, she posts notes online that contain everything she hopes to cover, and after every lecture she posts recordings of the lecture for anyone to listen to. Basically, there is absolutely no reason for you to be clueless when exam day comes. In fact, I learned enough just from the lectures that studying for tests was just a matter of rereading the notes to remind myself what she'd said. The only times I really needed to thoroughly review the material and take notes while studying were when we had Dr. Heicklen as a guest lecturer. The material covered is also a great deal more in depth than high school biology classes, and if you're here to learn rather than to get a high GPA, then you shouldn't even think about getting an exemption from this class. \nAs far as her exams go, Dr. Mowshowitz has gone to great lengths to make this class useful to you in the long run. Most biology classes have you memorizing mountains of material for tests so that you can promptly forget them afterwards -- I took Environmental Biology I last semester and Dr. Naeem, also a great lecturer, had us memorize upwards of 500 terms every 6 lectures. On the other hand, in this class, the exams focus on problem solving, which emphasizes the reasoning necessary in all sciences (yes, biologists have to think too) and teaches you to pay close attention to the details -- if you forget an important detail, you can come to a conclusion that is completely wrong. Some people here seem to think that these things aren't important in biology and medicine, but they really are: research is entirely logic-based and requires much more detailed knowledge than she asks of you here, and doctors need to use everything they know about their patients to make life and death decisions all the time -- neither you nor your doctor has the luxury of ignoring the details of your medical history when you have a life-threatening disease.\nIt seems that many people here don't like Dr. Mowshowitz because they aren't used to a biology class like hers, but this class will probably be a lot more helpful in the long run than most other classes you'll be taking. My only qualm with this course was with some of the incredibly anal policies are -- I ended up sitting an exam with a fever because you need to file an incomplete to take a makeup.\nThe problem book she makes is also worth the money as it helps you get used to the types of problems you'll see on the exams and helps you learn what type of answers she'll expect.\nTL;DR: Mowshowitz is good teacher. Take this class.\n\nWorkload:\nThe workload really depends on whether you show up and listen to lecture and on how quickly you get used to the problems. I showed up to every lecture and took notes, so studying amounted to a few hours of revision and practice problems before each exam (I haven't gotten my final back yet, but I'm trending an A-). There are three midterms and a final with one midterm dropped. In addition, there are weekly recitation quizzes and recitation practice problems. Each recitation can give you up to 15 points with a maximum of 100 over the entire semester. There are like 10 opportunities to get these points, so reaching 100 doesn't require much work. All reading is optional and unnecessary. If you need to know it for the exam, it's in the lecture notes.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 22, 2013",
            "review_content": "\nPeople who are on here saying it's totally possible to get an A and Dr M is great etc are insane. I don't know anyone who managed to get above a B in this course. It is a really bad sign when they are expecting the median to be in the 60s- so half the class failed?!\nThis course does not prepare you for the MCATs, unless you are taking an MCAT written by Dr Mowshowitz, and even then you are totally screwed. \nShe is a good lecturer and seems like a decent person, but this class is utterly absurd. After spending an obscene amount of time on the problem sets, following every bit of advice offered on the stupid class website, attending recitations, and getting a tutor, I still did so poorly in this class that I am going to retake the \"bio for idiots\" at Barnard just so that when I apply to medical school I a) Have a reasonable GPA b) Learned actual biology and most importantly c) have my sanity.\nThis class is a nervous breakdown waiting to happen. People rush out of the room crying at the end of the exams (no joke). \nIf you want/have to take this course, be prepared to destroy your entire life. \nWorkload:\nyou don't HAVE to do anything except take the exams, but the workload in an attempt to succeed (failed attempt btw) is astronomical\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 12, 2013",
            "review_content": "\nI am one of those people who loves this class, and loves D Mowsh. Or, in the words of one reviewer, I am â€œjust [an] obsessive compulsive puzzle solver  who [is] giddy about having taken a college course in sudoku biology, and have an inhuman appetite for homework, that would cause the 98% of the species to commit suicide.â€\u009d But I disagree with this, and most of the other reviews posted here. This is why:\nMost everybody says the workload is ridiculously heavy. It is not, not if you donâ€™t put it off. While many say that you have to start studying for the exams two weeks in advance, I found that I put less effort into studying just before these exams than for my other science classes. If you do a few problems from the problem book between each lecture, you will have a good handle on the material, so that when exam time comes you can work your way through the sample exams or review problems given to you for studying purposes. \nAnother huge complaint is that students are either born with an innate sense of how to solve her problems, or not. I have a problem with this complaint for two reasons: 1) I definitely worked hard and got better at her problems. And 2) even if I hadnâ€™t, how is that any different than other sciences, like, say, physics? Solving physics problems require a certain way of thinking that is easy for some, and come with great difficulty for others. \nSo yes, this class will make you think. This class will NOT be the same as other Bio 101 classes. This class will sharpen your problem solving skills. And if you spend your time doing the work rather than complaining about D Mowsh, you may find that you learn a great deal.\n\nWorkload:\nHeavy, but not terrible. Just DO the work! I recommend saving the starred problems for exam review, as Dr. Chasin and Dr. Mowshowitz will recommend to you on day one.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 11, 2012",
            "review_content": "\nThis is EXACTLY what I wrote in my course evaluation:\nDr. M is a great teacher and obviously LOVES bio. She is willing to help and answers questions readily. The problem sets are helpful and make you think.  BUT.  I am a firm believer in the idea that teachers need to TEACH - meaning, over half of the lectures had material we were responsible for that was never covered in class.  We are not paying Columbia loads of money to teach ourselves several hours a week. (I think it is unavoidable in general to have to teach yourself material in a given class, but with Intro to Bio it was on a very consistent basis). \nAlso, felt really in the dark about grading. Why the secrecy? Why can't we know averages? \nThis is EXTRA that I did not write in my evaluation:\nThe class itself has interesting material that is covered in great depth. If you are detail oriented (read: slightly neurotic premed) you will enjoy this class (minus the crazy exams).  Just make sure to keep up with the work or you will not be a happy camper (read: start off the semester working as hard as you've ever worked - after the first exam evaluate where you need to go from there.  But you CANT start off the semester slow or you will be bound to get a low grade in this class).\nObvi, the problem sets are ridic.  If you want to have neck problems from hunching over a desk all day doing problem sets or similarly have hand cramps at the end of a bio study session that will undoubtedly lead to a hand deformation because you want to get into med school, good luck, because by the time you finally get there you'll be filing a law suit asking Columbia to pay for your physical therapy.\n\nWorkload:\nHIGH. Do ALL PROBLEMS (!) to ensure an A and wrist arthritis.\nIf not, stay in good health but get a C.\n"
        },
        {
            "course_name": "Biology",
            "review_date": "December 10, 2012",
            "review_content": "\nI know you will probably get many similar comments (considering I have read this over and over again on CULPA)....but I feel the need to express my concern for Dr. M's lack of compassion for her students. She is aware that I have a learning disability and says to me \"Some people just aren't meant for medicine\".... She followed this by saying maybe I should look into philosophy or something like that.... even though she has no idea of my other grades or reason for studying neuroscience.luckily I am a G.S student and can handle that type of discriminatory and negative feedback. I still left her office utterly dejected and questioning my entire purpose at this school and that maybe I shouldn't have come here, what I'm doing with my life ect. I have taken BIO 1 at another university and received an A...her response: \"That's like telling your French teacher that you've already taken Spanish\". So she is aware that her course is like no other intro bio class... and I would hope that she could realize that maybe her class isn't the 'end all be all' say in whether or not a student is fit more studying science? Since meeting with her, my zeal and love for biology has diminished greatly. I wish her words didn't cause this, and as much as I want to say \"I'll show you\"... and am saying \"yeah...maybe she is right. I have a serve learning disability, and am probably too handicapped to continue is pursuit of a science degree. \nI thought about reporting this to the department head, but after seeing so many similar stories on CULPA, I assumed it was not worthwhile because things will not change. She is a wonderful and creative teacher. Yet even though she is the advisor for G.S neuroscience, I will not dare go and meet with her for advice on classes or research, and numerous other students feel the same way. I doubt that she is intentionally sadistic.... but it sure feels/looks that way. If I could choose again which university to transfer to, this experience with her is enough to make me regret every coming here. To the extent that I even emailed Georgetown and University of Michigan inquiring as to whether I can still accept my position there. \nThe average median for each exam is usually a 63-65. This is in no way good enough to get into medical school or grad school in general. 1/2 the class is failing? \nEnd of semester survey \nWorkload:\nHeavy...very heavy\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "August 29, 2012",
            "review_content": "\nStudents who say this course is mazy, confusing, has unfair grading and testing policies. Your complaints are valid.  Those who say they've learned more than ever, I doubt it, friends; you're just obsessive compulsive puzzle solvers who are giddy about having taken a college course in sudoku biology, and have an inhuman appetite for homework, that would cause the 98% of the species to commit suicide.\n  For those who are willing to commit a full time job amount of time to excelling at this course, you will find it helpful.  But be honest, students.  Most of us will not do problem sets twice.  We won't study fours a day for this course alone, and get tutors, solve problems till our personalities deteriorate into lifeless, pale robots without any social sentiment.  But this route is possible and achievable especially for the \"?\" that is the Columbia student. Also, let's not evade the fact y'all munch on adderals like m and m's to produce your insane work ethic or simply you can withstand a type of human experience which would send the regular person into a hopeless depression.  Or you're so talented you don't give a F--- what I say.  Nice.\n\nWorkload:\n4 tests\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "July 12, 2012",
            "review_content": "\nI was a premed at Columbia College and now I'm a 3rd year med student at Columbia.  This review was written 4 years after I took the course with Dictator Mow and is meant to give you (whom I assume is premed) some perspective on why you should or should not take the course.  The following may offend you, but if you're truly intent on going into medicine, thick skin is a prerequisite.\nWhat D.Mow does is an important function for Columbia undergrads.  Like it or not, she's the grand filter for premeds and her class does a hell of a job at sorting out the failures and likely to be failures.  Her exams test you on logic and technicalities as much as knowledge of the material.  This is a lot like what the board certifying exams and shelf exams are like.  Medical school exams are, obviously, much tougher than D.Mow's exams, but D.Mow's exams does a good job of replicating at an undergrad level of just how cruel med school exams and board exams can be.\nNow, this absolutely does not mean you have to do well in her class nor take her class.  No medical school admissions gives a shit about who taught you intro bio  None  (they do care that you took courses at a reputable school though).  Professors and physicians who hold high level academic positions and are extensively published will woo the hearts of medical school adcoms (admission committees).  D.Mow does no medically related research and has no lab.  Again, no adcoms will give a shit whether you took intro bio with her or a regular, non-sadistic professor.  Taking a higher level bio seminar looks much more impressive.\nAlso, if you got a B- in her class, it does not mean your chances of being a physician are screwed.  I got a B- in her class, I'm going into surgery after next year.\nIn the end, yes, her class is tough and sadistic.  But if you want an undergrad taste of what med school materials may be like, do take her class.  But if you have AP Bio credit and don't want the risk of damaging your science GPA, by all means, take higher levels bio classes which are more interesting and look better on your transcript.\nWorkload:\nI forgot.  20+ credits as a premed science major is nothing compared to med school though.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 26, 2012",
            "review_content": "\nI truly believe that professor Mowshowitz is probably the worst professor that I have encountered at Columbia, and it is not because of her teaching style or her lectures, which surprisingly are excellent, but rather her grading policies and her behavior as an instructor and symbol of Columbia's educational system.\nYou will definitely learn a great deal in this class, and the way Mowshowitz teaches is excellent for the most part. Albeit annoying that she starts the lecture 5 minutes before the class actually is supposed to start, and often throws so much stuff at you and ends up rushing and holding the class for an extra 10-15 minutes, for the most part you will learn a lot. Most of her lectures are really good, and although she can be disorganized or disjunct in the content she teaches (the kidney, cancer, immune system, nerves, muscle contraction), and sometimes in the rush be unclear, she does take time to answer questions. This aspect of the class will help a lot on the MCATs.\nOkay, now down to the dirt and grind. This woman is by far the cruelest and least compassionate person I have ever met in my life. First off, despite you paying $60,000 a year for tuition, she is the ONLY option you have for introduction to biology, a key bridge class to so may pre-med and biochem/bio major courses. She has a silly chart with the minimum cutoff, and if u make just two points below that average, you will not receive the higher grade, so even if u got the average in all the exams, just one splitting hair can smack you with a B-. Yes, it's that bad. Any attempt to try to ask her to check your exam will result in her telling you that you must submit a stupid regrade form, and if you do so, you will not be bumped up gradewise even if you're one point from the cutoff. She seems to think that she is the Sorting Hat from Harry Potter that determines whether you're cut for med school or for failure in life, but in the end she is nothing more than a neurotic woman who never got residency in med school and dedicated her life to being cruel and creating unclear and untested educational testing methods that in truth go beyond critical thinking to a realm of just stupidity, randomness, and most of all, unfairness. People who have gone to her and asked for help were shrugged off and told they were not good enough for med school, and she treats certain students preferentially.\nHer exams are horrible---they're all adopted from research papers she read and that she created questions about. She even has her own problem book, and in the end you will struggle through her problems and see that stupid technicalities and not what you learned, such as her poor control of the English language, or just her diabolical and stupid (read unfair and unjustified in a clear way) her explanations for why your completely valid educated guess was wrong. She needs to understand that unlike her we haven't read the research papers and that it is totally fine if our guesses don't perfectly align with the findings of research conducted over several months. Her TAs that grade the exam seem to be just as bad as she, grading harshly and giving a 50 on an exam that only had a few errors. This is also a class where you see the same kids acing the exams without effort just because they have a natural ability to solve her ridiculous problems and have their answers totally aligned with her. She seems to think all her unclear and stupid problems earn her some role as a paragon of critical thinking education, but in the end they are void and totally useless. I struggled on her exams and got a 40 on the MCAT, as her \"critical thinking\" is too extreme and just downright ludicrous and that her explanations are bunk, even compared to the MCAT.\nIn the end, be relieved that your grade in her stupid class will not really matter a great deal in he grand scheme of things, as even medical school interviewers have told students who bombed her class \"don't worry too much, we've heard about THIS class.\" Be assured that Moshowitz is not a Sorting Hat for medical school admissions, and smile and have hope that you will attend medical school. My advice for Columbia is to use some system of checks and balances to at the very least prevent Mowshowitz from the administration of ridiculous exams and untested/ ridiculous teaching methods, or just let her go. Don't let this class destroy your hopes, this woman is nothing more than a joke.\nWorkload:\n3 exams, one final. Lowest midterm dropped  (if final is lowest, the average of the final and the lowest midterm, plus the two midterms make up your grade). Insane and ridiculous problem set with ridiculous, unclear, stupid, and poorly written problems. A 2-hr recitation with quizzes that will not help much. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 16, 2012",
            "review_content": "\nI'm surprised that no one has commented/reviewed on how extremely detailed (read controlling and neurotic) Mowshowitz is. Written forms to request regrades? No regrade if anything on test is written in pencil? We only allow one regrade per semester and by the way if you do a regrade, you will not be considered for a bump up if you are on the cusp of a better grade. I'm sorry but what happened to the days where you could actually have a normal discussion with the professor about your exams? \nWhen I asked for advice, the only wisdom she had to offer was \"some people just are not fit for medicine...whether it is their work ethic or level of intelligence\" What?? I'm not even pre-med?!\nAlso, why does she not have a CV/ background history on her webpage? Every other professor has one. What is she trying to hide? Could it be the fact that she has not published a single biology research paper since 1982? Or is it something worse?\nWorkload:\nHigh. Do all problems. Or else.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "November 12, 2011",
            "review_content": "\nEveryone likes to complain about the Mowsh, but to be honest I absolutely loved her class. I learned the most with her course (Intro Bio I and II) than I have in any other course so far at Columbia. Sure, the questions are different and she styles her class such that it turns out to be harder than many other teachers, but I feel like that's why I learned so much. She does all her teaching by writing on the chalkboard, which gives you time to take notes (as opposed to when professors use powerpoint and you're reading/listening simultaneously and miss things), as well as gives you handouts including all of the drawings and more complicated processes that you can annotate as she goes through them. She lays out what she will be covering at the beginning of every class. She provides tons of information and support on her class website. And as for the exam questions, she provides tons and tons of practice and example questions. I honestly think this kind of question is more useful, since instead of regurgitating biology you have to apply what you know to solve a puzzle. On occasion, the question is poorly stated, but the majority of the time it's because the student isn't fully acquainted with the material that he or she doesn't see that enough information is provided. \nWorkload:\n3 midterms and a final, all with the puzzle-style questions. Stressful, maybe; interesting, definitely. I would suggest doing at least 70% of the practice problems, it's the best way to study; that probably requires beginning to study for exams a week or more ahead of time. Depending on your TA there are also homework problems and/or quizzes, but the most points you can get to add to your grade from recitation is 60 and probably about 99% of students hit 60 - the TAs do just about everything to help you out there. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "May 26, 2011",
            "review_content": "\nI am not adding this to vent, just to give some perspective from someone with a learning disability specifically for people like me who find themselves in Mowshowitz' course.\nFirst, Mowshowitz doesn;t seem to believe that learning disabilities are real, and seems to try to thwart the ODS system. Thus, exams are not quite as relaxed as they usually are with ODS. Plus, you may find yourself face to face with Mowshowitz saying something like \"well, not everyone is cut out for medicine\" upon learning about your LD.\nShe doesn't seem to rely on current educational research research for her teaching methods - she is very old-fashioned. Her lectures are good - she uses demos and tries very hard to plan her lectures, but she is all over the place sometimes. Her exams are killer. She thinks she is teaching you to \"apply\" your knowledge (she even tries to use good old 'Bloom's taxonomy' to make it look like she is really a professional educator). But in truth, she tries to make biological problems as tough as physics problems by limiting the amount of information she gives you. Bio is not like physics - it's a systematic science that requires different approaches to problem solving. I think that for people with LDs, this class can be particularly hard because of her attempts to teach in this strange way. I prefer straignforward profs who try to help their students achieve, not by creating new, untested teaching methods.\nThat said, lots of people seem to do well in her class. And the MCATs indeed are easy in comparison. I was not one of those who did all that well. I learned a lot because of the amount of studying I did. But there is no reason for bio to be made this hard. It is a fun subject that is normally quite easy to learn for people with learning disabilities compared to the other sciences. I regret coming to the post-bacc program specifically because of this class. I will be taking a couple of other bio courses afterward to lift my GPA back up.\nIf you insist on taking this class, get a tutor who was once a TA for this class if possible RIGHT AWAY! Don't wait. And yes, shell out the cash. \nWorkload:\nPut as much time into this as I did into orgo. Try not to take labs the first semester until you get how to study for her exams and have a sense of the workload. If possible, do all the labs in the summer after year 2.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 01, 2011",
            "review_content": "\nThe lectures are good, you can get away with not going.  I don't mind the tough problems and the deflated grades, some people claim they haven't learned anything I think I've learned more than from any other class thus far...I just wish she wouldn't take herself so seriously. Yes its a pre-med weedout, but I feel like a prisoner taking those exams.  She makes such a big deal out of it and her office hours become lecture hall sized, she has us sit in certain ways, our cell phones cant be in the room, she has a ton of corrections because her questions are badly proof read or too vague.  She makes it more stressful than it needs to be.  10-15% A/A-s is pretty stingy for Columbia but compared to other schools not so bad.  Not to mention even if you do very badly you can get the gentlemans C at almost 50%.\nWorkload:\nUsually I start studying 10 days in advance, about 1-3 hours a day then maybe 4-10 the last 3 days.  Problem is the exams are 3 weeks apart so it feels like you get the weekend off before you back to work.  I missed a lot of lectures but you can usually pick it up quickly in recitation.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 31, 2010",
            "review_content": "\nJust like what 20+ other reviewers said, this class IS HARD. Ten days before each exam, I spent the entire day just dealing with her lectures and her cryptic problem sets. I actually did pretty well on the previous three exams and (hopefully) expecting an A. Here is what I thought of the class:\nThe Lectures\nI went to every single live lecture. Chasin was a horrible lecturer who just read off the powerpoints and he is clearly not interested in whether students are actually \"learning\" the material. Honestly, I fell asleep in most of his lectures. Mowshowitz, on the other hand, uses only chalk and she delivers her lectures in a clearer way than Chasin. Do not skip the lectures just because the recordings and notes are online. There are parts where Mowshowitz clarifies here and there, which are useful in solving her problems. A lot of material is covered in the lectures so cramming 6~7 lectures before an exam is not going to give you a good grade (since you have problem sets to deal with).\nThe Problems\nI started to tackle the problems around two weeks before each exam. Don't just do them once. Do them over and over again until you understood her logical pathway. During your second round, try to look for the key words in her problems. I highlighted these words and wrote down how these words (or phrases) gave me evidence in finding the answer (or why my initial answer was wrong). I used this methodology and scored in the high 90s on the third exam. Also, do the starred and the R problem sets last.\nThe Exams\nYes, they are hard and you probably never seen these problems in your lifetime. Get some sleep before the exam because spending another 30 min looking at the Krebs Cycle handout is not going to give you any additional points in the exam. When you deal with a problem, don't just straight go to the questions. Set up a diagram and/or summarize important points before you start answering. This will prevent you from making incorrect assumptions or leaving out important information. In her exams, reading comprehension skills are just as important as your knowledge of biology.\nRecitations\nThey are easy 60 points. Don't be a fool by skipping recitations. To be honest, recitation sessions didn't help much overall.\nFinally\nYou will definitely learn biology in this class. I did not take senior (or AP) biology but after taking this class, I now probably know more bio than most of my friends at other colleges.\nWorkload:\nHigh High High. Probably spent more time on this class than any other class.\nDo not take this class with orgo (unless you really have to)\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 28, 2010",
            "review_content": "\nMowshowitz's bio class was my favorite class I have taken at Columbia so far, and she is one of the best teachers I have ever had. Her class is hard, as everyone says, but I think it is completely fair. You do really have to think hard to do well on her exams, and you don't have a hope of doing well on the exams if you don't REALLY UNDERSTAND all of the problems in the problem book. I think that these problems are excellent preparation for the exams, and give you a great idea of what to expect. But you have to do them all and do them carefully, not just rush through and then understand them in retrospect after reading her answer key.\nIt bothers me that so many people find this class unfair, or that you have to \"think like Mowshowitz\" in order to do well. The skills she requires us to have really are basic critical thinking skills that anyone who wants to be a doctor should have. She takes bio to the next level by requiring us to think hard and really figure stuff out, not just memorize it. But everything is based on logic, and as long as you explain your answer clearly and state what you are assuming if you think there is any ambiguity there, she is very fair about the grading and generous with partial credit as long as what you wrote makes some sense. And I consider myself very lucky to have had a teacher who requires this level of thinking about bio, and who presents the material very clearly, and puts in a ton of effort to make sure that students understand what she is talking about and what is expected of them. I am very confident about the bio section of the MCAT after taking this course. Her class is very difficult and she expects a lot, I'm not saying she doesn't. But I really believe that any intelligent person should be able to do quite well.\nOne annoying thing you have to watch out for with Mowshowitz though, is that she really will try to trip you up with semantics from time to time--so make sure you read every question VERY carefully. There is usually at least one question on an exam that you can get wrong by assuming it is similar or she means the same thing as she meant in a similar homework question, but it's actually slightly different and you'll get the whole question wrong unless you catch it.\nI'll get an A or an A- in this class, depending on the final.\n\nWorkload:\nHeavy, but not unreasonable at all. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 22, 2010",
            "review_content": "\nO.M.F.G.\nThis class is awful. Unless you have a lot of natural talent for the kinds of questions that Mowshowitz asks on her tests, you will struggle and struggle mightily. As you might have gathered from my intro, I am not one of these people. I spend well over twice the time on this class that I do on any other and my grade is in the B- range. \nOn the upside, you will learn a lot of Bio. I mean a lot. I feel like I learned the topics covered first semester inside and out, not that it helped me on her insane tests. Hopefully, it will help on the MCAT if I decide med school is still possible after this class eviscerates my GPA. Mowshowitz is a fantastic lecturer (much better than Chasin, who teaches about the first third of the course). I really enjoyed going to class because she got the concepts across really well in her lectures. Also, I used to really love Bio, that is until I took this class.\nHer tests, on the other hand, are incredibly demoralizing. I don't care how many med students come back on CULPA and say that \"Mowsh's tests prepped me for the real world of medicine\" or the like. They are straight-up unfair. No matter how well you know the material, they will destroy you. Basically, they are based on applications of the material that you probably never considered because you were NEVER TAUGHT ANY OF IT. The tests are about 80% insight. Do the problems. Then, later, do them again. Get a good night's sleep before tests because you can't have the epiphanies you need to get a good grade on the exam if you're asleep. Then pray really hard that your soul and grade are not utterly destroyed by this class.\nThere is a 2-hr recitation. It is mandatory and extremely annoying, but also helpful. You take quizzes (way easier than tests) and do recitation problems which are problems from old exams.\nYou need this class for a lot of things, pre-med, Bio major, Neuro, BiomechE, etc. So you won't be the only one suffering. But you will probably suffer. What's really a shame is that this class is actually really good. You learn a lot of bio. Problem-based learning is actually really effective. Mowsh just makes it needlessly frustrating and difficult. While at most schools, this is a memorization course that every serious pre-med or prospective bio major gets an A in, at Columbia, it's a ball-crusher which makes you look like a slacker. Gird your loins.\nWorkload:\nLooks pretty light on the surface, but it's not. If you're not averaging an hour or two working on this class (80% doing problems, 20% reading lectures) a day, you will not do well. I wish I had known this fact a few months ago.\n4 Exams. You get to either drop lowest of first 3 or count the lowest of the first 3 for 50% and the final for 50%. They are impossible. Earn a \"free\" 60 points by going to recitations (or you're basically screwed).\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 21, 2010",
            "review_content": "\n  All the other reviews are right: this class is HARD.  There is a lot of material, a lot of work book problems, and a lot of reading.  You EARN your grade by learning the material and applying it to feasible situations on the test.  Don't think that this review is coming from a kid who did exceptionally well- pending the final, I'm expecting to earn a B.  How did I do it?\nWent to every class.\nListened to every lecture over again on the weekend.\nDid the problems as the material was being taught, and then did them again right before test time.\nWas CONFIDENT of my answers during the tests- can't stress this enough-if you state your assumptions clearly and then answer the problems you WILL earn partial credit for wrong answers.\nOf course I have my gripes- the exams are hard and I spend all my time studying for Bio which will be my worst grade out of all of my classes.  I keep in mind though that the difficulty of this class puts every other class into perspective for the rest of my 4 years here.\nMowsh herself I think is a great teacher- she is organized, clear, and works hard to try to set up a successful class.   You need to bust your hump to meet her half way to earn a decent grade.\nIn summary, put your head down and plow through the material, and I guarentee you will come out a stronger student at the end of the semester if you work hard.\nWorkload:\n3 midterms, final, either drop worst midterm or if final is the worst, take 1/2 grade of worst midterm and add to 1/2 grade of worst final for the 3rd score.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "October 08, 2010",
            "review_content": "\nDisclaimer: I am a med student who took her class three years ago.\nThe angry reviews you will read about how doing well in her class depend on being able to speak her language, and about how her exams are just cryptic puzzles are written by people who had a hard time with her class because they refused to adapt their way of thinking. \nDr. Mowshowitz takes her class away from the perfect world of academia and into the real world of medicine. Nothing is cut and dry and there is usually a probable answer instead of a certain one. She teaches you the material but then expects you to UNDERSTAND instead of just memorizing it. Once you understand it you can apply it on her exams to problems you have never seen before. \nIf it helps, think of it like orgo. When asked a question, one of my professors said he just had a sense of how the electrons would move. We were pissed, but realize at the end of the course that we had also developed this innate feeling. Why? Because we had finally understood the basics instead of just learning them. \nEnough ranting.\nIf you want to do well in her class, don't just study... understand the material. Make connections between topics, ask yourself what would happen if something went wrong, and most importantly, become so familiar with the material that it becomes second nature. I promise that if you achieve this level of understanding you will walk out of her exams feeling great.\nMy suggestion: study with someone. Explain the material to them and have them quiz you. If you can teach it, then you know it. Come up with questions to ask each other. Use the whiteboards in Butler. Scare humanities majors with your drawings like its your job.\nWorkload:\nHardest part is letting go of the past and thinking differently. The more you do this the less you have to study. Even still, I studied more for this class than for any other class. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 29, 2010",
            "review_content": "\nI've seen so many reviews for this course and for Dr. Mowshowitz that I thought I would give my opinion.  I'd like to preface the review with the fact that I got an A both semesters and am still involved in the course as a TA, so I've been on both sides of the fence. \nFirst off, this course is hard. Though I did well, it wasn't easy at all, and I remember studying for a week and a half in advance and still having a hard time on the exams.  Everyone who has taken the course, Dr. Mowshowitz, and myself will tell you that the key to Bio is to do the problem sets.  I don't mean do the problems with the answers next to you, or only do them once.  I mean do the problems a week in advance, study more, and then do the problems over again a few days later.  Not only is it great studying, but it also familiarizes you with the format of the test, which is a difficult thing to get used to when you first start the course.  There is 1% of the student population that can get by without doing any of the problems, but the chances of that person being you is slim, so do them.\nSecond, Dr. Mowshowitz herself is a great lecturer, and is one of the better ones I've had at Columbia.  Some people come out of the course with a lot of negative feelings towards her because her tests are difficult, but she really does want you to learn the material, and the way she does it works.  The material from this course stays freshest in my mind more than any other subject I've studied because of how it is presented.  A lot of science courses at Columbia ask you to simply memorize and have little thought process involved.  The Bio tests, though difficult, put the knowledge you've learned into real life situations and very genuinely ask you to apply everything you know about Biology (and a little common sense) to answer the problems.  It isn't easy, but it will most definitely put the knowledge into your head.\nAnd for the people who say no matter how hard you study, you'll just never do well, its not true.  I remember getting below a 70 on my first Bio exam and being completely demoralized.  For the next test, I studied 2 weeks in advance and did all the problems at least twice, and did a lot better.  As you get further into the course, the testing format becomes less of a problem, and the so called \"Mowshowitz language\" that other reviews say is impossible to decipher won't be as much of a problem.  \nOverall, don't just freak out when you take this course and blame everything on Dr. Mowshowitz.  Everything you need to do well in the class is there in front of you, just utilize it to the best of your ability.\nWorkload:\nProblem sets assigned after each lecture that should be done, though they are optional.  \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "August 13, 2010",
            "review_content": "\nAs with anything on this site, you should take this review with a grain of salt.\nThat being said, HOLY SHIT this class was an absolute ball buster. I don't think I've ever [insert miserable adjective; examples include: lost sleep, cried eyes out, worked as hard for nothing, etc] than I have for this class, and I predict for the rest of my academic career at Columbia. \nUpsides: \n1) MCAT Bio is an absolute joke after this. We didn't get so much into anatomy but that's easily solvable with renting a basic guide \n2) The bonds you make with people in this class are hard to break. Something about collective misery really brings out the best in people\n3) Really awesome war stories\n4) Unless you're a genius or really bomb all your classes, you can only go up from here and upward trends are good trends. \n5) If you ever consider working for biotech, all the time we spent on genetics and proteins instead of general bio makes so much more sense. \n6) The most amazing catharsis comes with ending the second semester \n7) This class is the great equalizer: Pre-Meds, Engineers and PostBaccs will uniformly struggle with this class  \n8) Most importantly: YOU WILL LEARN HOW TO STUDY\nDownsides:\n1) You will have a bio induced breakdown\n2) Your GPA will be shit until you figure out how to study  \n3) You're GPA most likely will continue to be shit \n4) You will hate, with every fiber of your being, Mowshowitz. This hate will probably spill into other areas of your life.\n5) If you're really lucky you'll get to hear Mowsh tell you you're not smart enough for her class and should take the easier version at Barnard (truest story ever told).\n6) How much you study has NO CORRELATION to how well you do, whereas in other science classes (notable exception: physics) \nI feel like the fact that I can come up with more positives than negatives after being raped by this class with little reward (1st sem- C, 2nd sem- B-) speaks to the utility of this class.  \nWorkload:\nWhat you make of it. My roommate last year didn't even buy the problem book until halfway with the semester and got an A. Conversely, I have a friend who reads the textbook (which I strongly discourage) does every problem twice and ended up with a not so great grade both semesters. \n"
        },
        {
            "course_name": "Intro Lab to Cellular and Molecule Biology",
            "review_date": "June 03, 2010",
            "review_content": "\nDr. Mowshowitz is a terrible teacher.  While her lectures are occasionally interesting, she is nasty to her students.  I always thought it was the duty of a professor to 'set their students up for success'.  Dr. M sets you up for failure.  \nI didn't do as well as I wanted on the first exam of the semester.  I went to her an explained my study habits and asked for some advice on how to improve.  She essentially went through my exam and told me that I should have known the things I got wrong and offered no advice.  \nI did all the homework problems, and I did them in groups and alone.  Normally, one would assume that the homework would provide practice for the exam, or at least show you the importance of topics (for example, more problems on one subject would mean it was more important).  This wasn't the case.  The one problem made of terms she only mentioned once (I searched through the lecture notes) was a quarter of the exam.  \nI sought out tutors for the finals.  The ones she had listed for the most part didn't know the material.  When I mentioned what I was feeling in the course (that the material given to me had little baring on the exam), they all understood and said that most of their students felt the same.\nI think this course can be summed up by a conversation I took part in earlier in the semester.  I was talking with two students, one that didn't really put in much effort, and another that went to both lectures, read all the lecture notes, took notes on the lecture notes, and did all the problems twice.  The one who didn't put in much effort did above the mean, and the one who put in an insane amount of work got well below the mean.  This course teaches steps a and b, but tests on step m in the made up language that Mowshowitz speaks.\nFor anyone who sits there and tries to say that the people complaining are just lazy and mean spirited, you happened to be the small percentage of people who speaks Dr. M's language, a skill that has nothing to do with biology, being a scientist, or being a doctor.  I hate that this woman thinks that she has the sole duty of determining who is qualified for med school, something I don't even want to do, and decides that she must be the gate keeper.\nWorkload:\nirrelevent.  the problems she gives has nothing to do with how well you will do, don't provide accurate practice or ability to judge your knowledge.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 29, 2009",
            "review_content": "\nDr. M's exams are unfair and horrible. They don't test your knowledge of the material covered in class, but rather whether or not you can figure out her \"puzzles\" in the test time allotted (roughly 90 minutes). If you don't think like her, then you won't do well in her class, no matter how much time and effort you put into studying her problem sets. She's a terrible teacher and a mediocre lecturer at best. She doesn't care about her struggling students. She doesn't actually \"teach\" anything, but rather rushes threw topics as if her students already have a background in what she is lecturing and have a clue what she is talking about. When I asked her for extra help and suggestions as to how to improve my test scores, she told me that she was sorry to say it, but that quite frankly I wouldn't be a good doctor if I couldn't do well on her exams. I studied 60 hours per week for her class and earned a C- (she didn't even have the decency to give me a C even though I had missed the cut-off by 2 lousy points). Now I'm taking biology over again at Barnard and earning As. Go figure. Dr. M is arrogant and has made many students give up on their dreams of being a doctor for no good reason. Take bio at Barnard and save yourself the pain and heartache.\nWorkload:\nhorrendous workload consisting of problem sets, all optional. 4 exams, worst exam grade dropped.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 22, 2009",
            "review_content": "\nEveryone gives Dr. Mowshowitz a hard time.  I'm sick of it and I think people need to quit whining.  \nI took her class last year.  Because she was an AWESOME teacher I was able to get a 14 on the Bio section of the MCAT and now I'm in medical school.  Trust me, her class is teaching you biology even if it feels like its not sometimes.\nMy medschool Biochem course is all review from her class and I am shocked how well I remember everything.  Plus, I'm able to do well without giving it much of my time.   This is a huge boon when you've got Anatomy to worry about. \nSo...suck it up premeds and you'll thank her later.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 29, 2009",
            "review_content": "\nBio was a really valuable experience for me. Yes, it was painful, frustrating, and often disheartening, but I thought that Mowshowitz's problems were a good way to learn the material. I liked having to apply the concepts instead of just memorizing names and pathways (but there was a lot of memorization the second semester). Many of the problems are based on real research results, and some of them are quite fascinating.\nShe's a fantastic lecturer and uses a lot of models. The organization can be a little confusing sometimes, but I think this has as much to do with the complexity of the material as with her lecturing skills. I definitely suggest going over the lecture notes in detail before starting on the problems because you don't want to waste them on learning the basic material (i.e. the memorizable facts). You should use the problems and the detailed solutions to become more familiar with the nuances of the material and the kinds of questions she asks. After going over the lecture notes, you may feel that you know the material, but the problems always make you think about it in a new way. It also helps to do the problem sets more than once. The first time you do them, you're learning. The second time, you're reviewing. A TA once suggested knowing the problems and solutions by heart, but that's really not enough. It actually doesn't matter if you remember all the answers or not, but you should understand all of them. It's also incredibly important to stay up to date with the material and problem sets. There's just way too much information to absorb for most people to cram successfully. I also suggest writing down what you learn every time you get a problem wrong and making notes of your most common mistakes.\nMowshowitz is very helpful during office hours, and she's genuinely interested in making sure people learn in this class. She's also really good about replying to emails.\nLastly, I think the grading is a little more generous than people assume. First semester, she lowered the cutoffs by several points. Second semester, she offered extra credit (max 4 points). I honestly don't get the feeling that she's out to crush anyone.\nWorkload:\nThe fun never stops. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 16, 2009",
            "review_content": "\nMany of these reviews are rather exaggerated. Yes, it is a tough course, but it is not impossible by any means and should not end your chances at med school so long as you do all the problems and are decently intelligent. Yes, she is a good lecturer and does a decent job with making dry topics not too dreadful, but \"brilliant\" and \"fabulous\" are a little extreme. Often, you will read the lectures and think \"Why, Deborah? Why are you telling us these random, unrelated facts? Why must we know the details of this seemingly arbitrarily selected disease?\" Sometimes, you will leave class feeling like your knowledge is more random trivia than cohesive, comprehensive, biology knowledge. Many topics that should be in \"normal\" intro bio classes are never covered, many topics that we covered are too specific and detailed to be in an intro bio class. \nBut if you're reading this review, you likely have no choice.\nSo, tips: go to lecture and try to pay some attention; or at least pay enough attention to annotate her increasingly cryptic handouts (oh, dmowsh, I know you want us to learn by going to lecture, but a handout full of blanks and third-grader style sketches isn't very useful at all). Do no problems yet. About two weeks before the exam, read through/highlight the lectures (unless you actually absorbed the material in lecture, you star student, you) and make your way through the problem book (skipping the R's and stars). Do the R's and stars last. Then do the practice exam the day before the exam.\nWorkload:\nHeavy.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 15, 2008",
            "review_content": "\nI love this class.  I love it.  Sure its really hard and you want to jump out a window when you studied 100 hours for a test and got a 70, but the course itself is great.  Dr. M is a great lecturer and the way she presents the material in class and in the homework is very engaging. My only complaint is that at times I felt like all I was being tested on my logic ability and not my understanding of the actual course content. That aside, it is so refreshing to be in a class where FOR ONCE its clear the professor has put in as much effort as the students.  Dr. M clearly has high expectations for her students, for her TA's and for herself.  She has but in so much work to make this a good class.  She and Chasin have made all the course materials for crying out load.  Have you ever been in a class where the professors wrote the book just for the class? thats my point.    All that said, the course is very hard.  You have to stay on top of your work and you have to put in the time to understand everything like its second nature.  You can't cram.  Here's my advice:  If you don't want to work you butt off for good results 1) you probably shouldn't take this course and 2) you probably shouldn't be a doctor or an engineer so you shouldn't take the course.\n\nWorkload:\nLots and lots.  Dr. Mowsh and Dr. Chasin write all their own homework problems.  There are a lot of them and they are hard.  Usually around 10-15 questions per lecture.  Some of the problems took me an hour!  The coursework is no joke, but I found the problems were very engaging even when they were hard.  Also there is less reading than in other courses--I never read the textbook, just the lecture notes which are about 8-10 pages a lecture.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 15, 2008",
            "review_content": "\nwell let's see...\nonce there was sunlight, now there is darkness\nonce there was pleasure, now there is sadness\nonce there was hope, now it's despair\nonce i thought i could get into med school..\nnow, i don't really care.\nin summary: i have just wasted 10 minutes of my precious time writing this horrible poem about the woes of intro bio with the Mowsh. she is really and truly a wonderful professor but if you do not make time for her class, she will bring you down. Study like you have no life but if, in the end, you find yourself dangling from a fine thread of despair, don't take it personally. Her class is not a test of how much you know your bio, it's how well you can deal with her questions.\nWorkload:\ntheoretically? nothing. actually? consider tattooing the problem book to your body, eating it's binding and regurgitating the messy contents of your stomach only to do the same thing over and over again.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "June 06, 2008",
            "review_content": "\nIt's time someone said it straight out:  The emperor has no clothes.  Everyone at Columbia knows how hard Mowshowitz is, but even students who do poorly in her class seem to swallow the myth that it's their fault, that they were somehow deficient in learning her method of Deep Scientific Thinking.  And those who get A's actually seem to think they learned something about biology!  Sorry, all they learned is how to think like Deborah Mowshowitz, and that has almost nothing to do with real science.\nFirst of all, Prof. M doesn't practice real science: she hasn't published a genetics paper since 1982, and she doesn't even have a lab.  So she presents herself as some kind of authority on science education instead.  The way she talks, you'd think she invented Problem-Based Learning, but that's not true (it was developed in Canada in the 1970's).  But what's worse, she violates the whole spirit of PBL; the goal should be to TEACH students by example, not to deliberately confuse and trick them as she does.  \nIn her problems, half the challenge is figuring out what the question is-or more accurately, what she thinks it is.  Standard English doesn't matter; she speaks Mowshowitz, and if you don't, too bad for you.  Little did you know that words like \"before,\" \"after,\" and \"during\" can have special meanings that are found only inside her head, and can even change from problem to problem.  That's pretty sad, considering that the goal of science is to be consistent and reproducible.  Instead, she's arbitrary and capricious.  You can have the \"right\" answer on a test question, and a written explanation that is virtually identical to the one on the answer key, but somehow what you wrote is worth less than full credit-and you can never get a straight answer as to why.\nHer famous lectures are also overrated.  Many students are in awe because they're packed with so much detail, but it's all trees and no forest; there's no thematic organization and no connection between topics, yet each is presented in mind-numbing detail.  In just the last 3 weeks of 2nd semester, we covered (in order): embryonic development, temperature and blood pressure regulation, hormones, the structure of the kidney, and the immune system.  It felt more like a grab-bag of random topics than a biology course.  \nThe final insult is that, for all her obsession with details, she gets quite a few of them wrong-sometimes in a big way.  For example, she gave an entire lecture about 2 proteins which store and release iron in the body, and it turned out the whole thing was backwards.  (One protein works only when iron is high, and she said low; the other was the opposite.)  She never even admitted this in class, but relied on the TAs to tell their students about it, even though recitation is optional for many students.  That's just wrong.\nIn summary, this is less a class than a form of torture.  Just grit your teeth and get through it as best you can, but get rid of any illusions you may have about learning anything, other than how to survive Mowshowitz' educational reign of terror.  I guess our only consolation is that she'll retire someday.\n\nWorkload:\nVery heavy.  But there's almost no correlation between the time you put in and the grade you get.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 20, 2008",
            "review_content": "\n  Mowshowitz is a decent professor, once you learn how to handle her class (which unfortunately often does not happen until 3/4 of the way through the semester, if at all). I'm a textbook learner, but the textbooks assigned for this course are useless, don't buy them. Do, however, buy the problem book, and do all of the problems. They are great practice for the exams.\n  I found it much easier to skip lecture and instead copy down the lecture notes from the website (which she recites practically verbatim in lecture). It's much harder to take notes in lecture because she moves kind of fast and in a disorganized manner, as she does not use PowerPoint slides. For me, my grades in this course improved greatly when I focused just on the online notes and problems and less on her live lectures and handouts.\n  The exams are scaled against a set median grade, but it doesn't really help much. The tests are not curved like one would expect them to be in a science class. To get an A, for example, you pretty much have to score in the 90s or high 80s on all the tests.\nWorkload:\n15 problem sets (optional, but extremely recommended), 4 exams (including final; final weighs as much as midterms, though), lowest grade dropped, weekly recitation quizzes.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 16, 2007",
            "review_content": "\nI guess I must be an idiot according to the reviewer two below.\nI took Prof. Mowshowitz's class during 2006-7. I felt that she did not adequately prepare me for the MCAT. She covers extremely little about physiology, the respiratory system, and a lot of simply factual information.\nShe's certainly interested in biology, but the critical thinking exercises can often detract from the biology and leave you unprepared. She should teach a section of biology called scientific reasonsing, or biological reasoning, but not biology in my opinion. \nBut the real worst part of the class is Professor Mowshowitz's language. The reason her exam questions are so ambiguous is that she does not want to give any hint whatsoever about the the answer might be. So she strips her sentences and never expands on what she writes. Let me give you a good Deborah Mowshowitz question:\nQUESTION:\nTrue or false: There are 7 national banks in the U.S.\nANSWER:\nTrue--there are more than 7 national banks in the U.S.\nFalse--there are not 7 national banks in the U.S., instead there are many more than that.\n \nWorkload:\nvery demanding\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "October 09, 2007",
            "review_content": "\nHe's perfectly fine for the lectures for the first exam.  He does go a fast with the powerpoint, but you can always fill in the gaps in your notes with the Lecture notes, posted online.  Or you can print out the powerpoint slides and go into class with them and take notes directly on those, but I found that I would zone out when I did that.  The two lectures he does that are not on the first exam go way too fast.  Read the lecture notes before you go to those lectures and you will get more out of it.  \nMowshowitz is more dynamic, but there were only 2 lectures with Chasin where I felt like I was lost (the Glycolytic Pathway stuff).\nWorkload:\nDo every single problem in earnest--no cheating!  No giving up and just looking up the answer!  Do the unstarred problems in the problem book first, and save the starred problems for once you've understood all the material.  Write down each lesson learned from each problem--there's a point to each.  Do practice exams.  And get some sleep, ok?\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 26, 2007",
            "review_content": "\nI don't think many people realize what Diddy Mow has accomplished.  She has managed to take a course that at most universities is centered around memorization and turn it into something that requires critical thinking.  Her examinations are hard; infrequently, they are possible to misinterperet; they will not include every major topic covered in lectures, and covering every topic in the lectures won't  guarantee success on her problems.  How, I ask, is this different than passages on the MCAT?  Mowshowitz, more than any other source or struggle out there, will prepare you for the MCAT.  I think the structure of the class ultimately gives a better understanding of the material.\n   One practical tip: Never assume she means anything.  If the answer you write is justified based on what is written, it is justified based on what is written.  Don't ask yourself what she is thinking. \"I thought you meant\" will not get you points on a regrade, but \"my answer is also logical,\" just might.\nGood luck.\nWorkload:\nBe prepared to do a lot of work.  As everyone will tell you the problems are the best practice since they establish the associations between terms on which she will test.  I would say 1.5 hours a day spent on this course will give you a solid shot at an A.  I would not recommend taking it with other very time consuming classes.  It is better to take Biology laboratory before, or with the first semester of this course.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "March 23, 2007",
            "review_content": "\nAnyone who says Dr. Mowshowitz is a bad professor is truly an idiot. Her lectures are simply first-rate. Given the complexity of modern biology (and of course it's getting exponentially more complex every year), I must say, I respect her dedication and commitment to presenting only the most important (and up-to-date) facts and ideas succinctly, and in the most organized and articulate manner. I think any objectively-minded person would agree. (It's understandable, though, that a lot of people find it hard to be objective about her, since her exams basically test for IQ and problem-solving ability, so that extra studying beyond a certain point doesn't really pay off).\n\nWorkload:\nI average about 6-8 hours a week, and I'm doing really well\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 08, 2007",
            "review_content": "\nWhy isn't there another option for a Biology I and II Professor? Dr. M, as some people call her ( but you would have to like her to call her that, so I'll call her Mowchowitz), Mowchowitz is a freaking dictator; she will make you hate life. Honestly, does it really have to be so hard?  She turns the beautiful science of Biology into molecular/technical problem solving for psycho-geeks. Other schools have more than one General Biology Professor to choose from; I think there aren't any others here because no one wants to deal with her Nazi-like manner to approaching Biology!  Really, who does she think she is to believe she knows better than the actual author of the class textbook! She makes it way too confusing with her diagrams, which look like a 3year-old drew them! I really hate this class (you put in all this work and on the exam you don't really get what you bargained for); I am really frustrated about there not being other options! Who ever heard of this?  Isn't this a democracy? Does she honestly think if someone can't her past her class, they can't or shouldn't be doctors; I really think she believes this as she has told some people that the patient would die after talking about missing some questions on the test.  Someone is taking herself too seriously and her tests.  Many doctors, and other professionals, have never had to go through this lady's crazy class and we should have other options.  She sucks, I'd tell you to take another class, but well, there aren't any other professors, and this is Columbia University, you would think the school would cater to their students more effectively, with all the money most of us are paying.  I am truly annoyed, that's all I have to say!  \nWorkload:\nRidiculous, forget having a life with this lady.  The downside, you don't get the to reap the benefits of your labor; your either good at her tricky problem-solving method, which I will add is strictly hers; I think she had been working almost 30 years writing up these problems making them as incomprehensible and ridiculous as possible just screw hard-working students over!  \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 08, 2007",
            "review_content": "\nWhy isn't there another option for a Biology I and II Professor? Dr. M, as some people call her ( but you would have to like her to call her that, so I'll call her Mowchowitz), Mowchowitz is a freaking dictator; she will make you hate life. Honestly, does it really have to be so hard?  She turns the beautiful science of Biology into molecular/technical problem solving for psycho-geeks. Other schools have more than one General Biology Professor to choose from; I think there aren't any others here because no one wants to deal with her Nazi-like manner to approaching Biology!  Really, who does she think she is to believe she knows better than the actual author of the class textbook! She makes it way too confusing with her diagrams, which look like a 3year-old drew them! I really hate this class (you put in all this work and on the exam you don't really get what you bargained for); I am really frustrated about there not being other options! Who ever heard of this?  Isn't this a democracy? Does she honestly think if someone can't her past her class, they can't or shouldn't be doctors; I really think she believes this as she has told some people that the patient would die after talking about missing some questions on the test.  Someone is taking herself too seriously and her tests.  Many doctors, and other professionals, have never had to go through this lady's crazy class and we should have other options.  She sucks, I'd tell you to take another class, but well, there aren't any other professors, and this is Columbia University, you would think the school would cater to their students more effectively, with all the money most of us are paying.  I am truly annoyed, that's all I have to say!  \nWorkload:\nRidiculous, forget having a life with this lady.  The downside, you don't get the to reap the benefits of your labor; your either good at her tricky problem-solving method, which I will add is strictly hers; I think she had been working almost 30 years writing up these problems making them as incomprehensible and ridiculous as possible just screw hard-working students over!  \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 03, 2006",
            "review_content": "\nI just have a few thoughts on prioritization in studying for tests.  The key to doing well on these tests is concentration, more than anything else.  If you can do half the problems and get some sleep every night, or do all the problems and come to the test tired.... SLEEP.  Take a break the morning of.  Rest, go to the gym, eat a good meal.  Take some advil if you've had an injury or whatever else.  Bring a pillow if your back hurts and you think it might help.  But feel well in her exams, and feel rested.  Ideally, try to do all of the problems also, but if it ever comes down to a choice between rest and studying, veer a little more to the side of rest so you can really have maximum capacity for concentration while taking the exams.  There are really very few things you need to understand well.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 03, 2006",
            "review_content": "\nI just have a few thoughts on prioritization in studying for tests.  The key to doing well on these tests is concentration, more than anything else.  If you can do half the problems and get some sleep every night, or do all the problems and come to the test tired.... SLEEP.  Take a break the morning of.  Rest, go to the gym, eat a good meal.  Take some advil if you've had an injury or whatever else.  Bring a pillow if your back hurts and you think it might help.  But feel well in her exams, and feel rested.  Ideally, try to do all of the problems also, but if it ever comes down to a choice between rest and studying, veer a little more to the side of rest so you can really have maximum capacity for concentration while taking the exams.  There are really very few things you need to understand well.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "November 13, 2006",
            "review_content": "\nAn amazing lecturer who gives utterly DEMORALIZING examinations.  The best advice I can give is to stay on top of the homework - the problems are far too difficult to put off until the exam is approaching.  You don't really need the suggested textbooks, though you might glance at the Becker text for reference on some of the gene regulation material. (Reading the text will waste valuable time - that is better spent doing the homework problems.)  Also, you might want to bring a pocket recorder to class, for some of the gems she inserts into her lectures.  A word to the wise: if you are a postbacc pre-med student, do not get confrontational with her, in the event that you disagree with her grading.  People on the postbacc committee will tell you that they hold Dr. M in very high regard.  You do not want to get Dr. M upset.  Good luck, and keep your cool.\nWorkload:\nSignificant.  You will need to invest alot of time in doing the problems (don't cheat and look up the answer).  Most students do not try to do the text readings (her lectures are very thorough and complete.)\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 28, 2006",
            "review_content": "\nDoes it really have to be so bad?  Life is too short...\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "May 26, 2006",
            "review_content": "\nBackground:  I just finished taking Dr. M's 2nd term of Intro Bio.  I got a B 1st term and an A 2nd term.  Maybe that'll help you all put my review in context.\nSecond term she eased up by giving us more time on the exams, which helped substantially.  As with most science classes, you can know the material well but still get screwed running out of time after you misunderstand or get bogged down on one question.  This is particularly a problem in her class because the questions are confusing.  There are both honest conceptual \"tricks\" and stupid semantic \"tricks\" that may or may not be thrown in.  You really need to concentrate very, very hard taking these exams or you won't be able to show what you know.\nIMPORTANT: 45 min or so of extra time 2nd term on exams helped. Instead of just having 1 class period for exams, we got 1 class period plus and extra 45 min to an hour. Don't let her get away with going back to her old tricks next term.  \nThere's no trick to this class except to get an early start on the problems.  There are 2 ways to go wrong with the problem book.\n#1 - you hurry through the lectures, only skimming them, then get to the problems, don't know how to do any of them, and look up the answers.  You are wasting your one opportunity to come at these problems fresh.  Take 2-3 hours (not more than 5) to look over each lecture in some detail and make notes on the important points.  Then tackle the problems.\n#2 - you want to understand everything thoroughly and completely before you tackle the problems.  \nI tried not to spend more than 5 hours reviewing a lecture on my own, including looking up stuff in the book and drawing out diagrams, making flashcards, whatever.  Trust me, come back to this *after* doing the problems, if you have time. \nIf you want a shot at an A, you need to do all the problems.  Also, its important to actually remember the valuable notes she makes in her answers.  Some of which she doesn't cover at all in lecture.  I would spend my time making flashcards and diagrams of the answers to problem book questions before I'd spend it on the lecture itself.  \nWorkload:\nI spent about 10 hours a week outside of class and recitation second term.  Not sure about 1st term anymore, but it was less.  \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 18, 2006",
            "review_content": "\nIt's been a full year of my experience with Dr. Mowshowitz and I must say, it was quite an adventure to remember.\nA couple of pointers for those yearning pre-meds who are expecting to get a B+ in this course but really really really want that golden \"A.\"\n-Read up on every single of CULPA review on her and Chasin. I'm not kidding. I remember during the summer being scared absolute shitless when I read her CULPA reviews, but now I'm thankful for having been so demoralized. Because of what I learned early from culpa, I came into this course more than aware of and prepared for her ambiguously-worded and infamously tough exams (and yes, they are as tough as if not worse than how they're reviewed here). \n-It is after taking her first exam that you will realize that you're now in college and there's no turning back. Prepare well for that first exam with the right mindset, and it'll probably define the mood for the rest of your year in Bio. I studied harder for each midterm than I did for any of my GChem finals combined; that attitude helpfully carried me on for the entire rest of the year\n-Go to every single of her live lectures. Although her downloadable lecture outlines are almost written word-for-word, there always exist a few minor details that she clarifies so well in class. And it just happens to be that those details are the ones that end up in some way on the midterms.\n-Read her lectures outlines thoroughly, over and over and over and over. Read them once, you'll probably retain only 60% of the material. Read them again, and you'll get all the materials that you missed out on the first time. It's those sneaky little details you disavowed on the first run that end up on the midterms. If you ever think that \"ah, there's no way she can put that on the exam..,\" she can and she will.\n-Treat your problem book like your new significant other. Do the problems over and over and over again. Bring it everywhere with you, take notes on it, sleep with it. If you're already in a relationship with someone else, tell him/her that some things are going have to change this year. If you're single, then that's great; you won't be so bored at Columbia anymore.\n-With that said, take NOTES on how she asks questions (what she means when she says this and that). There's a way she words her questions that you should pick up on early on before it gets too late into the year. Therefore, take notes on her lectures and problems, and then take notes on your notes.\n-Start a study group and teach the material to each other. The recitation teachers always say that there's a huge difference between knowing the material and teaching it. And remember that the recitation teachers are the selected few undergrads who all got A's in the course. Know the material, and then be able to teach it to others.\n-NEVER EVER GIVE UP! You can go in with an \"oh shit\" feeling but never feel that one bad midterm grade will destroy you. You can always drop one midterm; just don't take a midterm with the plans to already drop it -- that's the wrong way to approach this course. Always give your 100% to every single midterm and if you have the stamina, you'll be proud of what you've learned and accompliahsed.\n-Don't buy bio textbooks if you plan on going to every live lecture. You'll be in a better mood to start off your year having saved at least $200. Spend that money on food to eat while you're studying furiously into the night.\nGood luck premeds! and godspeed.\n\nWorkload:\n-The world. 4 midterms, drop one (you cannot drop the final, 4th midterm/final) + weekly quizzes. Treat this class like an 8 credit course.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 13, 2006",
            "review_content": "\nIf you're reading this review simply to get a feeling for the pain and frustration you are going to feel in this class, please stop! This review is not for you. This review is for those with the courage to stand up to injustice and take this class at Barnard or not at all. Everyone will try to scare you into taking this class because it's on such a high level, but its really not. You learn the same material as any other Bio class, except you have to be terrorized by HER. Trust me, please! Be the smart one who enjoys a happy life while all your spineless premed friends lament this class. There is another way- take Bio at Barnard or, better yet, use your AP credits to place out of it- nobody at this university will tell you that secret, but yes you can do that!!\nWorkload:\nThree tests plus a final each semester which test nothing but your trickiness. Don't be surprised by a wide range of scores on your tests- your grade in this class is completely up to chance (unless you consider making the correct baseless assumptions about what her idiotic questions are asking some kind of intellectual quality.) \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "March 04, 2006",
            "review_content": "\nlets get things straight since you will have no choice but to take this class. Dr. M is a really good teacher but her tests are freaking impossible she thinks that if you \"understand the material\" that the tests are not challening, but the wording of the questions is always ambiguous and misleading and she intentionally throws you off with diagrams that are difficult to interpret.\nthe key to doing well in this class is learning to think like her. this is not a skill that can be learned by everyone. sorry. youre out of luck premeds. \npros: you will be well prepared to think like a scientist inthe future, you will LAUGH at the bio section of the mcats, and you will have a lot more information about modern biology than anyone else in the country taking an intro bio class.\ncons: you can put in a massive amount of work and still end up with a C. no tutoring, practice books, or textbooks can help you unless you take that damn problem book and graft it to your body, letting the style of scientific thinking slowly seep through.\nWorkload:\nhahaha. prepare to give up your life\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 23, 2006",
            "review_content": "\nMowshowitz is one of the most organized lecturers that I have had at columbia rivaled only by Gulatti. It is only fair to say that Mowshowitz is expected to cover such a great deal of material in the class that she can't walk students through everything in lecture. I felt that she used the time very efficiently and covered all the material required for exams. The exams were certainly very fair as demonstrated by the fact that she usually gets a curve close to what she expects and if she does not she just gives you the extra points to pull the median up to what it should be. The material on the exams combine the material you learn in class with critical thinking and problem solving skills...there is no \"plug-and-chug\" in biology. Most people find the matterial difficult and the exams \"unfair\" for three reasons. The first is that if you dont have a strong high school biology background (like I did fortunately) then you need to pick up the book to get a more in depth view of the topics and catch the details that Mowshowitz glosses over because she simply doesnt have any time. The second is that you should definately not miss a single class...each is so dense that missing just one class can mean a 20% swing on an exam plus Mowshowitz uses some very useful demonstrations that can come in very handy to being able to visualize the concepts. The third is that you simply have to do every single problem especially the ones that were from previous exams because, even more than orgo, bio is dependant on being able to solve the problems and if you arent solving them by urself and working through them then there is no way you will do well on the exams. \nMowshowitz, is also a very nice person when you go and talk to her in person. She is very prompt with answering emails and tries to choose the most competent TAs. The only drawback is that her online lecture notes are a bit slim and should be taken as an outline where if you dont understand a topic you go to the book or to a TA for explanation. \nWorkload:\nDepends on the person and how long it takes you to grasp concepts and do problems. I saw some people studying for over a week for midterms while some were able to pull it off with a couple night's of studying...I think it all depends on your bio background because the class just zooms by.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 21, 2006",
            "review_content": "\nThe way I would describe this class is that it's Mowshowitz's way or the highway-- and this goes for everything from her lecture notes to the problem book and tests. She has only one way of describing things, which may or may not make sense to you but either way you should do whatever it takes to understand it. Although the workload truly is \"obscene,\" as one reviewer described it, you're gonna have to learn Bio one way or another so you might as well bite the bullet and tough it through this course. Once you do, you come out of the class not only feeling like you know the textbooks inside-out, but like you how to actually think and problem solve. In retrospect, it was a really good experience and though I busted my ass for my grade, to an extent it was well worth it.\nWorkload:\nThis has been said time and time again, but be prepared to read her notes over and over again. Don't take the problem sets lightly. Tests have an amazing ability to screw with your mind, but just keep everything straight in your head and you'll be fine. Everyone has their own method for how to do well in this course-- find yours fast and stick to it. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 05, 2006",
            "review_content": "\nProf Mowshowitz is good, but a bit overrated. She apparently won some Presidential Teaching Award a few years back, and to her credit, her lectures were generally well-delivered and the material covered in her class honed nicely over the twenty years or so that she has been teaching it. However, she has a tendency to get sloppy. Her printed lecture notes, which are a very important part of the class (a surrogate textbook, apparently) were full of confusing sentences, perplexing abbreviations, and typos (how hard is it to run a spell check? She has had twenty years to do that). Her problem sets also, and even her test questions, were often poorly written and difficult to follow. A lot of points were lost on tests, I bet, because of misreadings caused by her poor phrasing. And she got lazy running the class website, taking forever to post test solutions and final grades. I agree with others who say we should have some other options for Intro Bio.\nWorkload:\nHEAVY, the problem sets would take forever even if they were worded clearly. Tests, too, were hard, but not unfair. My recitations were useless--get a good TA.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 02, 2006",
            "review_content": "\nPros:  You learn a shitload of bio!  You will be so ready for the MCAT it's nobody's business, good lecturer, has time to meet, always punctual and tries to get tests back fast.\nCons:  Her tests are EXTREMELY rigorous, RIDICULOUS weekly problems sets (which if you don't do, you're doomed), curves at a B- (that means that if you are average, you are saddled with a B-), she will, without hesitation, give you a C in the course if you don't work your ass off.\nI have found that you are either good at taking DMOW's tests or just bad.  The sad thing is that it is pure chance.  The person you call an idiot down the hall may just have a natural talent for doing well while you work your ass off.  Such is the life of the premed.  Sad thing is if you don't take her, you take bio at Barnard and ALL med schools know this is a cop out.  So if you're set on a top notch med school, getting through DMOW with a B is SIGNIFICANTLY better than an A in Barnard's Mickey Mouse Bio (all med school's know how hard DMOW is and pity your B).  So, if you're feeling lucky, take the class.  If not, you should reconsider premed. \nWorkload:\nOBSCENE.  3 exams (1 dropped), and final.  The problem sets are not collected but if you don't do them, you are screwed.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "November 12, 2005",
            "review_content": "\nI took this course last year and I've got to say that this course is difficult for exactly the reasons stated in the 23 December 2004 review -- it's spot on.  Doing well in this class' exams requires brains and the skills of a detective -- you have to integrate a huge number of details to deliberately tricky test problems.\nI attended every lecture Â– but for me, the recitation section was the key to surviving this course.  Switch asap if your recitation leader seems bad.  (Ask around and find a good section and claim that a schedule conflict arose.)\nThe great thing about this course is that if you donÂ’t understand a concept you have no lack of places to turn for help: a) lecture notes b) a recitation section led my an undergrad that recently took the course c) two textbooks d) a problem book e) lots of friends in the course\nMowshowitz is much better than Chasin (although it might just be that she gets to teach the more interesting lectures).  I should also say note the Purves textbook is fantastic -- well diagramed, concepts well-explained and put in context Â– if youÂ’re having trouble with something, read Purves closely before reading the lecture notes or doing the problems. \nThere's not much to say that hasn't been said before.  The material on the tests are really unpredictable and you must learn every detail to do well.  So all i can really do is acknowledge that the problem book and lecture notes are at times confusing Â– lots of mistakes, typos and confusing grammatical issues.  And the tests are brutal and the lectures are sometimes disorganized.  But suck it up, and youÂ’ll learn a helluva lot of bio.\nWorkload:\nlots. do the problem book over and over.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 22, 2005",
            "review_content": "\nLet me make it simple for you.\nClass and D-mow are a waste of time and space.\nI don't even know what she looked like, but I walked out with an A.\nIf you want to do this my way, screw going to class, read the notes VERY CAREFULLY, and do every single problem twice or three times. Thats all there is to it.\nStill, its quite time consuming, and I went into the class liking bio, and left hating it.\nWorkload:\nRidiculous. I am stupefied that this woman is allowed to continue teaching.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 15, 2005",
            "review_content": "\nI am completely disagree with the person who posted two below me- the class is tough and the one week cram will only work if you have no other classes, exams, work or social issues to deal with for a week- clearly for most students that is not the case.  I tried it both ways- the one week cram and the three week steady stream of work- do yourselves a favor and do the steady stream of work- don't fall behind, don't miss class, don't take the problem sets lightly.  The practice exams were a joke compared with the real exams- the problem sets were ten times easier- don't get cocky. Do study hard\nWorkload:\nalot of problems- recitation problems, 1 exam dropped\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 13, 2005",
            "review_content": "\nMy feelings are also very mixed about Debbie. She's definitely a more dynamic, interesting lecturer than her partner in crime, Larry Chasin, she has a good sense of humor and she really does want us to completely understand what is going on with biology since she tries her best to explain things completely and clearly. She will even repeat concepts over a couple of times to really get her point across so I don't get the impression that she doesn't enjoy teaching or could care less about us (which were the vibes i got from Chasin). I'm sure she is a great woman but i find myself torn because while I like her personality wise, grade wise and exam wise, I feel that is where this course needs significant improvement. \nThat being said, my main issue with this course is the exams. I did the problem sets before the exams and I studied my butt off but I was locked into the same grade range every test, no matter what approach I took, I could not get out of a rut. Debbie certainly does know how to write an exam, I'll give her that, but I guess the main problem is that her expectations are too high and her TA's are a big problem. Most are postbaccs or undergraduates and I think that is really ridiculous because when it comes down to grading the exams, they are bound to Dr. M's answer key and if what you wrote doesn't exactly match what is on the key, you get docked points. And can't say I'm a fan of problem based learning, I think it's counterintuitive for some people and it's not fair that those that prefer a traditional lecture based course don't have any choice in the matter here at Columbia.  I don't feel as if I know the material better going through PBL and not knowing what debbie is going to throw at you on a test just makes for stressful studying. Also, she is a fan of making 3 to 4 test questions revolve a single case, so if you don't understand or screw up one question, most likely you will just propagate the error through the entire exam and you don't get points for being consistent. \nYou can at least take comfort that her reputation for being a hard ass is known at most medical schools, but still if you struggle with this class, it's a very frustrating experience because you know the material but can't show that on the exams and the amount of effort you put into this course does not translate to an A+ as someone else said, for a lot of people it translates to a low B or a C+. \nMy only advice is to attend the lectures and really pay attention for Larry's part because you need to know everything in detail. I found reading one of the textbooks was helpful because it broke down the topics simply which is nice if you've never taken college biology before. For Dr. M, I suggest doing the problem sets a little bit each day, I found that the day of the lecture, I would read the lecture notes carefully (highlighting and taking notes) and would do her suggested problems in the lecture notes that way you don't have to cram them in the week before the test. Work through old exams and recitation questions and realize that you have to completely change the way you study, the days of cramming are over, in fact I would suggest studying for her exams at least a month in advance. i know it sounds like overkill but the more you go over it and familiarize yourself with the material, you can start seeing patterns in Debbie's thinking (this is what is helping me improve this semester). \nWorkload:\nHeavy, especially for Chasin's lectures since he really doesn't explain the material well so you end up teaching the first 9 lectures of the course to yourself before Dr. M takes over. Dr. M expects a lot and expects that you know the material backwards and forwards and graders are unforgiving. Studying biology is a full time job so grow to love glycolysis, the krebs cycle and your bio textbooks.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 11, 2005",
            "review_content": "\nI disagree with what some of the previous reviewers have been saying about the exam problems going beyond the level of the homework problems.  I actually think that the exams are right on par with the problem sets, which are certainly not easy.  For any given unit, imagine a pool of over 100 questions with varying difficulty and style.  Let's say that 60 of them are in the problem book, 10 in recitation, 5 on the practice midterm, 7 on your midterm, and the rest looming for future Bio students.  So how do you study for these seemingly \"random\" exam problems?  Do the problem sets CAREFULLY, maybe twice.  But you really don't need to do them so far in advance.  If you are a little lazy like me, cram about a week before the midterm by reading the lectures and doing/understanding every problem you can find.  To be clear, I'm not saying don't go to class and work dilligently all the time.  I am, however, saying that the 1 week cram can work just as well.  It did for me. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 06, 2005",
            "review_content": "\nI believe that premed students should be given a choice of Biology professors and will lobby Columbia on this point, as should you.  In the meantime, you'll enjoy Prof M's lively, entertaining lectures.  \nShe grades tough.  Over the past two semesters that she's taught Bio, she's given A- or better to only about 33% of her class, with about 16% A.  (Please see above note about lack of choice).\nOn the bright side, Bio can be beaten like a drum if you disregard the silly advice on her course website and do the following: attend class if you like (no need to read lec notes before or after); a week before an exam, work the problems, then do them again (yeah, this takes about 6 days).  Know them cold plus the prior year's exam.  Waste no time on anything else.  \nWorkload:\nNot as bad as most say, because most Bio students waste time studying the wrong stuff.  4 midterms, one of which is taken the day of the \"final\" but is simply a midterm like the prior three.  Lowest of first 3 exams dropped.  Cushy quizzes in recitation that 98% of class will ace (no exaggeration), so they don't factor into grade.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 02, 2005",
            "review_content": "\nAn incredible lecturer.  Professor Mowshowitz presents the material with clarity, answers students' questions whenever she can, and almost never makes mistakes (or at least I can't think of an instance).  The material isn't difficult, per se, more than it is just taught in a different style than most people are used to -- sort of the way biology was meant to be learned.  And if you want to simply understand the material, all you have to do is come to lecture; they're very interesting and you find yourself absorbing the material very easily.  Doing well on the tests, however, is another story.  Rote memorization and regurgitation won't get you a passing grade, so don't assume that either of those are sufficient preparation for C2005 exams (like I did initially).  The best way to study is to do the problem sets and practice exams which are released about a week before each exam, but you really have to understand them to do well, since the tests in no way resemble the homework.  Some people find the problem-set approach annoying, but I personally think it's more interesting than, say, the AP Biology setup in high school.  Overall, this is an excellent course for anyone who's interested in biology, or anyone who's interested in figuring out problem sets.\nWorkload:\nLots of problem sets (you do part of one after each lecture), but they're not required (but do them anyway).  Some sets have over 20 problems, and some have less than 10.  The amount of time spent on them differs from person to person, so I can't explicitly state a workload in terms of hours, but I would say it's doable for anyone.   3 midterm examinations (of which one is dropped) and a final (which isn't).  It would be wise to do every problem and reread all the lectures online to prepare for them.  And some advice regarding the problem sets: don't check the answers in the back of the book until you're convinced yourself that the answer you wrote down is correct, even if it takes a while.  For an entire unit, for each problem I didn't know how to do I just read the answers and told myself I understood the material.  Bad choice.  I ended up doing extremely poorly on that midterm.  During the next unit I followed my own advice and improved significantly -- over 40 points better on a 100 point test.  Take that for what it's worth.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 22, 2004",
            "review_content": "\nMy feelings toward Dr. M are mixed.  I think the problem-based approach she uses for the course is very good; it teaches actual learning of concepts rather than just repetition of definitions and facts.  I came away from the course feeling I had learned quite a bit of new information.  However, I think she carries the problem-based approach too far, to the point where your ability to simply understand the problems given to you matters more than the effort you put into understanding the material.\nThe difficulty with the course has three stages.  In class, Dr. M explains concepts in a tremednous amount of detail, adding lab techniques and applications of the concepts as well.  Rather than condensing material into a few easy-to-understand principles, she attempts to emphasize every detail equally, which makes for a tremendous amount of material to study.  Dr. M then includes all of the little details given in lecture in the course's 15 problem sets, which are incredibly long, difficult, and sometimes frustrating.  The problems also require application of the material to situations a step beyond those discussed in class.\nAnd if that wasn't enough, the tests go a step beyond the problem sets, requiring application of the class material (and the problem set logic) to entirely new situations that are neither discussed in class nor shown in the problem sets.   Simply knowing how to apply your knowledge to a test question is half the battle, knowing the material (and all of its associated details) is the other half.\nThe bottom line: You will learn a lot from Dr. M if you come to class and do the problem sets.  But this class does not reward 100% effort with an A--you can work your tail off studying and doing the problem sets and still get a mediocre grade if you can't see a test question and immediately know what material to apply to answer it.\nWorkload:\nExtraordinary--the 15 problem sets amount to about one a week, many of them take 2-3 hours, some may take four.  None of them are collected or graded, but doing them is essential to getting even a decent grade in the class.  Quizzes and additional problems are given in weekly recitation.  Tests: three midterms and a final, lowest midterm is dropped (mercifully).  Class is curved to a B- average.\n"
        },
        {
            "course_name": "Molecular Biology and Evolution for Nonscientists",
            "review_date": "December 16, 2004",
            "review_content": "\nBe warned that although this class sounds easy (for \"non-scientists\") it isn't. The actual subject is easy but the way it is sometimes presented or tested is very confusing.\nThe most difficult thing I struggled with was the wording of the questions on mini-exams and homework. They are  very ambiguous and unclear.\nHowever, she is a very nice person and will answer all your questions. She answers emails quickly and takes participation into account. \nOverall, I don't think I would recommend this class though. If you like biology, take a reall class and if you just want to get  easy credits for the science requirements, this is not the way to go.\nThe class is somewhat philosophical. Discussing evolution and questions relating to it was interesting.\nWorkload:\nA lot. Weekly graded homework, mini-exams every other week. Recitation once a week (graded) and a final (which you can choose not to take if you are happy with your grade)\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 04, 2004",
            "review_content": "\nI think that most of the mean reviews of Professor Mowshowitz come from people who didn't do as well as they expected to. If you're not ready to deal with a biology class that actually forces you to think instead of just regurgitating facts, this is definitely not for you.  You have to do a ton of work. The reason that Professor Mowshowitz doesn't use the established textbooks is that they throw so many details at you that the key concepts get overlooked. This is probably one of the few problem-based intro biology courses in the country, so all the materials and problems are from Dr. M herself. \nHere is the deal. If you want to actually understand the concepts and learn to apply them, then take the course. If you want a bio course where you memorize the \"established\" textbooks and get an A by regurgitating material, go elsewhere\nWorkload:\nHeavy. Keep up, or you will get a C\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "February 11, 2004",
            "review_content": "\nThe severity of the problem with Introductory Biology at Columbia has not been truly brought to light by these other reviews.  Allow me to raise a few points:\n1) Why does Dr. Mowshowitz (with a little Chasin and Gibber sprinkled in) have a monopoly on the Intro Bio racket? Have any of you stopped to think that in Physics, G Chem and Orgo, Columbia offers you a choice of at least 3 different professors per semster.  So why is she the only choice one of the most prestigious institutions of our country offers for such an important subject? \n2) What right does Dr. Mowshowitz have to filter a class through her lenses the way she does?  Let me explain: in G Chem, Physics and Orgo, the main source of material is a textbook.  But in Dr. Mowshowitz's class, the information comes mainly from her on-line notes and the problems (which mirror her exams) are based on problems she wrote or co-wrote. Not trusting the industry standard Campbell (or Becker and Purves for that matter) for problems she forces students to wrestle with her style.  If that style does not fit yours, well you're out of luck, there are no alternatives or other professors offered. \n3) Down to the nitty gritty: Her problem sets and more importantly exams are comprised of a set of questions with subsections which are often interconnected.  For example there is #1 1-a, 1b, 1c.....and #2 2a, 2b, 2c.  Now, not only is all of problem #1 (i.e. 1a, 1b etc) based on one question, but often problems #1 and #2 are connected. The point being: there is a domino effect.  If you get one part wrong this leads you to get another part wrong and often even other entire problems.  I would prefer questions that are wholly independent of each other so there is no double jeopardy. Again, I am asking that she model her exams like G Chem, Physics and Orgo.\nAmen,\nThanks for Listening. Petition Columbia to hire some more Intro to Bio professors. \nWorkload:\nThe workload isn't the issue.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 04, 2004",
            "review_content": "\nCheck LarryÂ’s review board for the dark sides of the class, because I actually have some praise for Debbie. YouÂ’ll be relieved once she starts teaching, she writes on the board, and doesnÂ’t waste your time trying to figure out the computer presentations. She is a natural comedianÂ…you wonÂ’t realize it until you get to genetics Â– everywhere you go she throws in some humor about bacterial sex, or pokes fun at the idea of random mating, and really does give you the run down on inheritanceÂ…she may have won all those teaching awards solely on the basis of sexual humor. But she is an incredibly clear lecturer, and youÂ’ll appreciate it, even given the frustration of hours of fruitless labor in the class.   \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 24, 2003",
            "review_content": "\nThis class is overrated.  Dr. M's lectures are terribly vague, disorganized, and superficial.  Dr. Chasin just happily ploughs along the first few weeks that he has to teach.  He's not better than Dr M, but at least his lectures are organized.  The TA's are a toss-up.  Some are clueless and others are better teachers than the professors.  The material is very interesting, but you're better off reading the textbook instead of going to class (half the class did this after the 2nd midterm, leaving lots of room for ass-kissing postbacs to attend the morning lecture).  The problem book is only helpful if you understand the concepts.  This class is run like Communist China.  Exams are are poorly written and ambiguous, and graded somewhat abitrarily.  Sometimes all you need to do well is a little luck (for guessing the correct multiple choice answer) and a knack for giving ambiguous answers to the equally ambiguous questions.  Grading: ok, so first there's the monumentally stupid idea of handing back the exams in a lecture of 300-400 people, unless you like to get trampled by a mob.  Blatant misgrading is the least of your worries(and it happens quite a bit).  Sometime they'll lose your exam, or hand you back an exam that will have pages from someone's exam.  Don't expect them to do anything about it.  They 'll snark about the most inane to the most valid concern about grading.  Plus, there's no guarantee that, if you are pre-med, that the course will cover material relevant to the MCATS.     If you are a bio major, you ought to be good enough to opt out of this course (there have been such people who've weaseled their way out of this course).  If you are premed, take your bio prereq somewhere else, or take Pollack's class in the fall so you only have to suffer through Intro to Mol & Cell Bio for one semester.\nWorkload:\nA lot, but not overwhelming.  However doing all the problem sets doesn't mean you'll ace the exams.  Weekly quiz during 2 hour recitation.  3 midterms and a final.  Like someone said, don't count on the curve to save your grade.\n"
        },
        {
            "course_name": "Molecular Biology and Evolution for Nonscientists",
            "review_date": "November 15, 2003",
            "review_content": "\nIn running with the high-school biology theme, I did not take AP Bio in high school and found Dr. Moshowitz's class rather easy to follow.  She is very clear and, as the prior reviewer wrote, will explain every minute detail to make sure her info. hasn't escaped any of her students.  She is a dynamic lecturer and an approachable professor.  She allows you to replace one exam with a recitation grade (an option I strongly suggest as it allows you to not take the final).  Her exams are more lengthy than difficult and it is nearly impossible to finish them in allotted class time; however, I think she is cognizant of this and grades accordingly.  She is, overall, an EXCELLENT PROFESSOR and I recommend her very, very highly.\nWorkload:\nModerate; exams require much preparation.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 18, 2003",
            "review_content": "\nThis course is not impossible, but don't depend on the curve to save your grade. Mowshowitz's lectures are pretty basic and she really hammers out the explanations. I think she's a good professor and her expectations are fair. Just do the problem sets, as everyone has said before - but more than that, do the practice exams and the recitation problems. Any type of practice on the problems will help you, but don't memorize the answers, understand the answers, because she usually doesn't give you the same exact problem on the exams, she'll give you a problem similar in that it employs the same word tricks and ideas. Most people entering this class have already taken ap bio or some course similar to that. Thus the class isn't about learning more (although there are some things that she goes a tad bit more in depth about), it's about how to do the problems.\nWorkload:\nThere is recommended reading (which is totally unnecessary), problem sets, practice exams, recitation problems (all of which is helpful, but none are due, so discipline on the student's part is helpful) and recitation quizzes (easy 60 points).  You also get to drop one of the first three exams.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 12, 2002",
            "review_content": "\nThis class is not as hard as most people make it out to be. If you pay attention in lecture, you'll be able to understand a lot of the material. She dumbs things down greatly, using childrens toys to demonstrate some of the more complex concepts. The tests are difficult, not because the material is challenging, but because the questions are sometimes random and very poorly worded. If you do the problem sets, you will do considerably better on the exams. However, doing them five times instead of once won't get you a better grade if you just try to memorize the answers in the back of the book - you need to be able to think and catch the little tricks. Previous bio experience helps and if you've ever spent any time working in a molecular biology lab, you'll have it easy. Don't be fooled though - taking AP bio in high school is meaningless, because 2005 is much more in-depth and thinking-oriented. \nWorkload:\nLectures (all posted on line), big book of problem sets, recitation (with quizzes, difficulty depends on TA). The curve sucks\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "November 25, 2002",
            "review_content": "\nI actually took bio for nonscientists before i turned premed, so i've had Debbie twice. One might say i'm an expert on Debbie . . . her teapot-like hand motions (mostly spouts, i.e. her song goes \"i'm a little teapot, short and stout. here is my spout. here is my spout. here is my spout, etc.) I have spent entire class periods entertaining myself by watching the imaginary tea spewing out of her spouts, imagining the pissed janitor who has to mop up the liquid after class, the dejected students in the front row half-assedly wiping off their notebooks. Debbie uses pretty chalk, and she's a good lecturer. She's not as evil as Larry, if only because when you look at the answers to her questions, they usually make sense after you realize you didn't count something or think about something. no amount of memorization of the material or practice problems can prepare you for whatever random crap she'll throw at you on the test, though. The text is near-useless for the Debbie half (at least Becker is, anyway). The practice problems help, but you can be sure if you spend ten or fifteen problems talking about bacterial conjugation or something like that, you won't be seeing it on the test anytime soon. She'll always test you on what you HAVEN'T been doing. We're starting the genetics business, which i sucked at in the bio for NONscientists, not that turning premed makes me a scientist. let's just say i'm a smidgen worried about the next test . . . \nWorkload:\nmany problem sets. it would be moronic not to do them. recitation once a week with a quiz, but my TA isn't very bright . . . so we don't listen to him, heh. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "November 25, 2002",
            "review_content": "\nOne of the most brilliant woman I've encountered and one of the best professors I've had. She's an excellent lecturer and totally approachable out of class. Learn to love her probem set book though, and I mean LOVE. Sleep with it at night or you'll get a C. This is a hard class, but with a whole lot of studying and paying attention in class, not impossible.. Plus everyone in there is premed, so be prepared for some stiff competition for grades. \nWorkload:\nHigh. Two hour mandatory recitation section each week with a quiz. Do every problem five times or you won't do well.\n"
        },
        {
            "course_name": "Molecular Biology and Evolution for Nonscientists",
            "review_date": "November 18, 2002",
            "review_content": "\n\"Dr. M\" is awesome. I took AP Bio in high school, didn't do all that well in it, and didn't retain very much of the information. But this class really helped me understand the CONCEPTS behind biology, and why it is important and applicable in everyday life. She uses great \"real life\" analogies to explain things, and if you don't get it, she won't stop until you do. No question is a \"stupid\" one in this class. \nWorkload:\n4 exams, including a final, but if you go to recitation at least 8 times you can sub that for the final. Grading is ok (i haven't seen my final grade yet)- one of the TA's is pretty tough. Weekly readings for homework, not too much. Occasional problem sets.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "June 05, 2002",
            "review_content": "\nProfessors Mowshowitz and Chasin are both excellent lectures and very knowledgeable. I highly recommend this class. An individual who has a mind for calculus, chemistry, or physics should have no problem with it. if you decide to take this class, do not read the textbooks; all of the relevent information is posted on the course web page under notes. I recommend this class to freshmen, though the professors discourage it. \nWorkload:\nModerate workload. The problem sets, which are essential, do take some time.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 27, 2002",
            "review_content": "\nEveryone else has already said enough about this class. What you SHOULD know, however, is that most people (even premeds!) can take Bob Pollack's intro bio course instead of this one. He's a great professor, and while I haven't actually taken his intro course, I can bet the grading is a lot easier (or at least, fairer) than in Mowshowitz's course.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology II",
            "review_date": "May 08, 2002",
            "review_content": "\nI thought the material was taught too fast. it seemed like we constantly had exams and i often felt very lost in the course. Even when i went to all the lectures, read the textbooks, did all the homeowork, went to recitation, and studied a lot for the exam, the structure of the exams somehow just confused me. For example, for the last exam, i knew the material cold but the question just confused me and i changed my right answer (wprth 18 points) to the wrong one because the right answer made sense to me but i'm so used to the exams being tricky, that i completely doubted myself and lost 18 points on the exam. i think we are given too many problems to do and i don't like that we only get the problems sometimes just a week before the exam. I think the lectures went too fast sometimes, with both Dr. Gibber and Mowshowitz. The slides went by at lighting speed and i wish she had put them online before class so that i could bring them to class with me and be able to better follow what was going on. But it definitely helped that they were online. I think it was completely unfair to tell us to buy Purves and Becker last semester because since they both cover the same material, both are not necessary. and i wish they had told us how much Gibber follows Sherwood because then i would have bought it in the beginning of the semester. For the last exam, i wanted to buy it, but the bookstore did not have it. this is an intro bio class and i have never really studied any bio before and i think this class expected way too much of me. it was unfair that people who had taken AP bio were in the same class as i was because they would study hours before the exam and get A's and i would study like crazy and not get A's. I have not even decided if i'm premed or not, and if i end up not being, i basically just spent this year torturing myself.\nWorkload:\nWAY TOO HARD. there is practically no curve which is completely unfair since the exams are so hard. i did horribly last semester and hopefully, i'll redeem myself this semester. this is the hardest class i have ever taken.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 07, 2002",
            "review_content": "\nOk, so you're a premed and like the other 300 in this course you're ready to stab everyone in the room, sell your own mother/soul... you name it! Moshi knows this, and came up with the perfect solution: the weeder class! It's darwinism at it's best ; there's no need to explain evolution here - the \"fittest survive\" mechanics become abundantly clear... That said, if you have a genuine interest in biology, it's EXTREMELY stimulating. If you can see through the obnoxious hordes of aspiring med students, what you learn is fascinating and will lay a solid ground for your subsequent biological studies. It's a really difficult class - some say it's the hardest you can take in the department - but look at the bright side: it will be all downhill from there! Moshowitz stresses that you should concentrate on the problems, and I must agree with her on that one. Do them three times in a row if you have to, and believe me, if you don't keep up with the work, you don't stand a chance. The professor is brilliant, knows her stuff and is very approchable. I didn't find her lectures confusing at all, quite the opposite in fact. And in case you can't follow her and take notes at the same time, they're all up on the web by that evening, clear diagrams and all. (in reference to the review above...) So if you're ready to work your sorry little ass off and learn everything you need to get started, this is the place for you. If not... RUN!!! (Whatever you do, don't be confused by the name \"intro\".)\nWorkload:\nHeavy heavy heavy. A lot of it is up to you, really. You can choose whether to do it right or not. Doing it right means downloading the course notes (12 pages) after each lecture, going over them with the two textbooks trying to figure out what the f*ck is going on, and doing the lengthy and compulsively anal problem sets. Tests are a living hell. Three midterms and a final. I ended up studing for 8 hours a day / 6 days straight for my final. Good news though: you get to drop your worst midterm. Good luck!\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 31, 1999",
            "review_content": "\nA situation in which an extremely talented and gifted mind unsuccesfully tries to be a professor. One of the most intelligent people I have ever met, and one of the worst professors I have ever had. Lectures are interesting but disorganized and fast fast fast--tape recorders begin to appear by mid-semester. Exams are so impossibly difficult that it's almost funny. Workload is astounding. Moderately sized curve can work for you or against you...mean is a B-. Her specialty is Genetics, and so the class is extremely genetics-heavy in EVERY area, including Physiology. Horribly frustrating while taking the class, but whatever the grade, you do learn a hell of a lot of Bio.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 31, 1999",
            "review_content": "\nA situation in which an extremely talented and gifted mind unsuccesfully tries to be a professor. One of the most intelligent people I have ever met, and one of the worst professors I have ever had. Lectures are interesting but disorganized and fast fast fast--tape recorders begin to appear by mid-semester. Exams are so impossibly difficult that it's almost funny. Workload is astounding. Moderately sized curve can work for you or against you...mean is a B-. Her specialty is Genetics, and so the class is extremely genetics-heavy in EVERY area, including Physiology. Horribly frustrating while taking the class, but whatever the grade, you do learn a hell of a lot of Bio.\n"
        },
        {
            "course_name": "Molecular Biology and Evolution for Nonscientists",
            "review_date": "December 31, 1999",
            "review_content": "\nMowshowitz almost seems to neglect the \"non-scientist\" part of the course title. Let me put it this way: If you didn't take AP Bio (I didn't) and you don't really like science, and you're looking for a relatively painless way to fulfill your science requirement, THIS ISN'T IT!!! Run! Run away! She grades extremely hard and her lectures move way, way, way too fast. Her diagrams are often unclear to the point of misleading you. I'm sure this class is easier than real Bio but for heaven's sake, don't take it unless you enjoy the idea of self-flagellation or you have a really strong background in Bio and want a relatively easy class. The one good thing: she's a really nice woman (even if her lectures aren't terribly well presented or clear or organized) and she'll meet with you and explain everything to you.\nWorkload:\nFair amount of textbook reading. 3 midterms, final. You get to drop lowest, and boy will you have to.\n"
        },
        {
            "course_name": "Molecular Biology and Evolution for Nonscientists",
            "review_date": "December 31, 1999",
            "review_content": "\nI strongly disagree with the other reviewer. I took AP Bio in high school, but I did poorly and don't remember a thing, but I still found this class pretty easy. She is VERY clear and thorough and an excellent teacher. She'll answer any question that anyone asks, and will not give up explaining it until the person understands.\nWorkload:\nThe above reviewer is either crazy or dumb, because this class was not hard, and I'm not a science person. There are a couple of midterms and a final, but she let us drop our worst grade, such that if you did well on the midterms, you didn't have to take the final at all. She even gave out slips of paper on the last day of class telling us what our grades would be if we didn't take the final. Mine said A-. I didn't take the final, and got an A!\n"
        }
    ]
}