{
    "prof_info": [
        {
            "prof_name": "Timothy Paine",
            "prof_id": 13610,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Computer Science for Engineers/Applied Scientists - Python",
            "review_date": "May 28, 2021",
            "review_content": "\nThis guy is a really bad teacher on two levels. First, his communication skills are lacking and it is unclear why he says the things that he does. And if you ask questions, he becomes irritated and implies that your question is stupid. Which leads me into point number two: I'm not sure why Professor Paine is teaching undergrads if his attitude is so horrible. You would think that he is God's gift to humanity, based upon his ego and dismissal of any semblance of intellectual curiosity. \nStay far away. I got an A in his class, but it was the hardest A of my life because I had to learn from someone who clearly did not want or care to teach well. You're better off taking the class with a real professor that you can actually get to know and get advice from. The only saving grace of this class is that you grow closer to your classmates, because it is a hell of a journey -- and not in the good way.\nWorkload:\n8/10 - Total quantity is manageable, but you're going to need to draw some excellent inferences in order to figure out what the hell is going on. And don't even think about asking questions, because if you can't figure it out on your own, you're heavily implied to be an idiot. \n"
        },
        {
            "course_name": "Introduction to Computer Science for Engineers/Applied Scientists - Python",
            "review_date": "March 02, 2020",
            "review_content": "\nIf only Tim Paine could teach. Two weeks into the course, we spent half a lecture asking questions about HOW homework works. Nope, not the codes we have to write nor the content we are supposed to learn in class, but simply HOW to submit homework. After that class, someone posted a question about homework on Piazza, and Tim basically called him out for \"not going to class\", though as someone who went to class I had the same question. \nProfessor Paine is more than disappointing. His barely teaches and doesn't have a clear syllabus at all about what content we are supposed to cover. Going to lecture makes me more confused than not. For homework assignments, we lose points not by wrong or incomplete answers, but for stylistic headers he briefly mentioned in class but never clarified on the homework assignment itself. Basically, he takes points off for things we didn't even know we had to do.\nI won't even make it to the midterms because I will be dropping this course for my sanity. \nWorkload:\nApproximately one problem set per week, but that again changes because people are so confused all the time and had to span Piazza two dozen times a day just to understand what is going on. \n"
        },
        {
            "course_name": "Introduction to Computer Science for Engineers/Applied Scientists - Python",
            "review_date": "February 22, 2020",
            "review_content": "\nHe is literally one of the worst teachers I have ever had. Not only are his lectures absolutely useless, he somehow manages to make the homework assignments incomprehensible to anyone that has not taken Python before. He doesn't know how to teach to ANYONE, which makes the class absolutely miserable to sit through and his personality is absolutely awful when you approach him for questions. His slides are literally pointless bc he doesn't label anything. He's also rude on Piazza so you feel stupid for asking questions, and is not receptive to emails AT ALL. If you can avoid taking this class, NEVER TAKE IT. \nWorkload:\nWouldn't be bad if he actually taught lmao \nHW - Has Part A and B (Part A due one week, Part B due the next) \nMidterm \nFinal\nIt doesn't seem awful, but the amount of time you spend doing the homework is ridiculous (especially part b it takes hours). \n\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "November 13, 2018",
            "review_content": "\nProf Paine is really not a good professor. He is very smart, but does not know how to communicate it to students. His homeworks and exams are very very hard, and I honestly followed 0% of his lectures to feel prepared.The curve is strong though. The class overall is very tedious, very different than other programming class. It is based much more on memorization of computer parts and commands than it is on theories and understanding. \nWorkload:\nHomeworks are all available online but he changes slight details to make sure you dont just copy\n"
        }
    ]
}