{
    "prof_info": [
        {
            "prof_name": "Van-Anh Truong",
            "prof_id": 10860,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Production Planning, Inventory Control",
            "review_date": "May 14, 2012",
            "review_content": "\nI would say to avoid this class at all cost, but then again it's required for all IEOR students... unfortunately.  So here we go.  I never went to class or recitation.  I had past homeworks and exams that let me score perfect on the homeworks and above average on midterms.  Unfortunately, this was false hope.  The material is easy and the book is good.  Let's be for real, at any other college it would be an easy A.  \nThe final exam was different than I had expected, but honestly I didn't think I had done all that bad.  I've been in worse situations in classes and done much better due to grade inflation.  This time I was not so lucky.\nDid she curve to a C?\nWorkload:\nsame as other person described \n"
        },
        {
            "course_name": "Production Planning",
            "review_date": "June 01, 2011",
            "review_content": "\nThere are professors at Columbia that are extremely smart and knowledgable in their fields, but horrible at teaching. There are other professors that you have no hope in understanding because of an accent or other language gap. Professor Truong is hindered by neither of these faults, and yet, was both the worst and most incompetent professor I have experienced at Columbia (and I have had classes with both O'Flaherty and Virdol). \nAt the beginning of the year there was hope. Despite the fact that Truong's first language is not English, she speaks it well and is understandable. But that is where my praise for her ends. After sitting in class, you learn that it doesn't seem to matter whether or not you can understand her because she is constantly correcting mistakes she makes on the board. I think she averaged between 5 and 6 large mistakes a class (at least for the classes I went to, which admittedly was not many, because 1. the professor sucks and 2. the class was at 9am). Even when I was awake to go to class, I didn't because it would just be a huge waste of time. \nThe homeworks varied. The first assignment was to write an essay about a stupid article that I doubt she even read. Sometimes she would give us optional problems on an optional homework. One of these problems was to read a book and write a book review about it. This makes me question whether or not she read the homework that she assigned. Overall, however, it was not very difficult and she allowed students to work in pairs/ allowed a student that had done none of the work to write his/her name on the already completed homework of another student. \nShe didn't allow for a cheat sheet on the first midterm (and we really did not need one), but students complained and she gave in to them and allowed one on the second midterm. \nThere is also a project. There are 4 people per team and each is in charge of managing a simulated production line. There are 2 separate simulations, each lasting a week. Professor Truong claimed that they would be very similar and that the first one would just be a practice run and not count. She then changed her mind and stated that the first one would count towards our final project grade. To make matters worse, the second game has multiple options that could be changed, which the first game did not have. This made both our observations and model that resulted from the first game useless. \nNow onto the final...\nFirst, the final review sessions skipped over reviewing the hardest material taught during the course because we just had a midterm on it. I think the average was just over 50% (I could be wrong, but it was not very high) on that midterm, clearly showing that students obviously had a strong grasp on that material. \nWe were also given a practice final, but were then told that the real final would look nothing like this except in difficulty and length. She also did not have the solutions to the final because she just took it from a professor that taught the course in 2005. Carlos, one of the ta's in the course, came up with the solutions for it luckily, but only because students complained about the ridiculousness. \nThe questions on the practice final were much harder than any of the problems we had seen either in homework or in class. It was also like the practice final in neither difficulty nor length. The only resemblance was that both tests could be applied to the same course, which at that point, I guess I should have been thankful for. \nLast thing: Grading\nShe presented a grading scheme at the beginning of the course: \nYour numerical grade will be determined by the maximum of the\nfollowing two schemes, Scheme A (or Scheme B):\n* Assignments 7.5 % (7.5 %) \n* Littlefield Project 7.5 % (7.5 %) \n* Midterm Exam [Lower]: 20 % (10 %) \n* Midterm Exam [Higher]: 20 % (20 %)\n* Final Exam 40 % (50 %) \n* Participation 5 % (5 %)\nIn an email clarifying this scheme, she wrote (right under saying the above was how our grade would be calculated) that only the higher of the two midterm exams would be counted. Whether or not this was beneficial to some people is irrelevant. This is another display of her incompetence at being an organized, sensical human being. \nI also don't think she knows how to curve correctly. \ntl;dr: Truong does not understand the material she teaches. Incompetent and frustrating. Makes large mistakes and wastes too much time correcting them. Does this every class. Does speak understandable English. \nWorkload:\nNot a large amount. Reading the book to actually learn the material takes a bit of time, but is way more helpful than going to class. \nWeekly homeworks - 7.5% most are easy\nProject 7.5%  \n2 midterms 30 or 40% total, maybe? No idea what she decided to do here after she updated her grading after we had already taken both midterms. \nFinal 40/50% \nParticipation-5% Unless she knows you, she will give you 80% on this section\n"
        }
    ]
}