{
    "prof_info": [
        {
            "prof_name": "John Smalley",
            "prof_id": 887,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2005",
            "review_content": "\nI found John Smalley to be a very able instructor.  He is very knowledgeable and presented the course material in a manner that was easy to learn.  In fact, I would even say minimal work was required on the part of the student.  I made it through fine even though I did not really do most of the assigned reading or listening before class.  There are occassional in-class listening quizzes of the pieces assigned but he warns you before coming to class.  The mid-term and final exams consisted of term id's, short questions based on material discussed in class and an essay question, which he'll either go over in the review session or give to the class before-hand.  He was helpful in answering questions during office hours and in the emails.  He was also flexible about some deadlines.  So all in all, I enjoyed being in his class.  It could have been a LOT worse.  Take him if you can.  \nWorkload:\nA concert report (5 pages); midterm; research paper on any topic (about 8 pages); final (essay topic given beforehand)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2004",
            "review_content": "\nHe is probably the worst professor you could get for Music Hum, so, if you have him, I suggest you take Music Hum another semester or switch sections ASAP.  Not only does he like to make this class obscenely difficult and obscure, but he's just flat out mean.  In the beginning of the semester, he decides who he likes and who he doesn't like and then grades those students accordingly.  I have a friend who consistantly did better work that I did, but the friend always received a worse grade that I did.  On top of that, he'll answer the legitimate questions you ask in class with \"well why don't you know that?\" or he won't even answer them at all.  He's also completely unavaliable as he took 10 days to respond to a two sentance email, and would not meet with me outside his office hours, eventhough I had a class during them.\nWorkload:\nListening and Readings for every class, announced listening quizes (about 1 every 3 classes), readings and answering questions (about 1 set every 5 classes), harshly graded midterm, concert report, research paper, final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2003",
            "review_content": "\nSmalley, who is pursuing a phd on the subject of John Cage and visual art, really came alive in the second half of the semester.  The first few weeks of the course were a bit of a drag, mainly due to the neccesary explanations of several extremely basic concepts of music, which I guess are unavoidable in this type of required survey class, but are extremely boring to anyone with any previous musical experience.  I wonder if it wouldn't be worthwhile to create two separate music humanities sections, one for musicians and one for non-musicians...Anyways, Smalley exhibited much enthusiasm and I found it to be a very interesting and engaging course.  The nightly reading assignments seem to be more of a formality than anything else; one soon learned that doing the 10 or 15 pages of textbook reading everynight was not only unneccesary, but sort of irrelevant to what information Smalley expected us to know (which he gave to us during class).  Unfortunately, we had a T.A. who taught class this semester on several occaisions who was quite possibly the worst teacher I have ever encountered.  Ms. REbecca Fan, though a very kind individual, seemed to have difficulty communicating in English to the students, seemed painfully nervous and unprepared every day she taught class, and seemed unable to doa  simple analyzation of any piece of music (with the possible exception of the theme from austin powers, which she brought in one day...)  Anyways, nothing was learned from these sessions, and at nine in the morning on a monday, learning nothing for 2 hours is not a pleasant ordeal to endure.   Anyways, Smalley's a great teacher, so take his class, just be wary of lurking first year T.A.'s.\nWorkload:\nEasy.  3 papers including a mini opera sketch, a concert review and a research paper (which did take some time to be returned-it's two weeks into winter break, and I'm still waiting.)  midterm exam and final exam were both pretty easy.  AS i said, Nightly reading assignments are easily neglected, and nightly listening almost as easily.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 16, 2002",
            "review_content": "\nSmalley is not a good teacher. You can tell that music is his life, and if it's not yours....you're screwed! He boasts of having a photographic memory and will force you to memorize all song titles in their original language. He won't start songs at the beginning, but insists that starting them right in the middle of a movement is a good way to learn (or to drive you crazy). I agree with the other review. He DOES wear the SAME CLOTHES every single day. Moreover, Smalley is the single most boring man on the face on the earth, and he kinda has a nervous head bobbing habit that is really annoying. Nobody participates in class because nobody is awake. \nWorkload:\nQuizzes every week. Three papers. And one of the required texts for this class is an MLA handbook on how to write research papers- so be prepared to suffer. Gave a midterm and a final with an overwhelming number of terms and concepts. IF you registered for his class....GOODLUCK!!!!!!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 08, 2002",
            "review_content": "\nSmalley is not a good teacher. He's about the most unenthusiastic, boring music teacher I could imagine. His 9 o'clock music hum class was just death. I actually know some things about music and was looking forward to this class, but Smalley did absolutely nothing to make this class interesting. And I'm not one to criticize a man's dress, but Smalley wore pretty much the same clothes (a black shirt and charcoal pants) for every class. Does he own several of the same item of clothing? Does he do his laundry every night, just so that he can keep wearing the same clothes? Or does he just go ahead and wear the same clothes day after day without washing them? If you get into his music hum class, switch out, if you value your time and your GPA.\nWorkload:\nNot very much. The midterm and final were fairly difficult, but not too bad. A fairly long concert report and a report on a composition or composer. Smally apparently thinks he's a L&R; professor too, judging by the amount of red marks and stupid suggestions for phrasing received on returned papers.\n"
        }
    ]
}