{
    "prof_info": [
        {
            "prof_name": "Valentina Lebedev",
            "prof_id": 687,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Russian for Heritage Speakers",
            "review_date": "April 22, 2002",
            "review_content": "\nShe is one of my favorite teachers here at Columbia. The course reminded me of high school a little bit because of the daily HW and because of the small class size. If you are prepared to do a lot of written work that isn't hard, but a bit time consuming, what you learn in this class is very worthwhile, and Valentina is such a pleasant woman that it makes her rigorous workload bearable. It also seems like she really cares about her students and the atmosphere in my class was really pleasant. I learned a lot and nearly perfected my modest Russian. \nWorkload:\nLots of written homework, many short quizzes, a few short personal essays, and a final.\n"
        },
        {
            "course_name": "Russian for Native speakers",
            "review_date": "January 04, 2002",
            "review_content": "\nThe class was, because of its vague title, with people of very mixed levels. Lebedev's nice but will nail you if you miss any of her copious homework. Maybe that's a good thing because unless you're reading at near-English speed and writing in cursive you can't miss an assignment without falling hopelessly behind. Lectures are a must-- this lady gets more done in 75 minutes than some professors do in a month of classes. Fulfills foreign language requirement so a good bargain if you only need to brush up on the reading and writing. Good luck!\nWorkload:\nHomework assignments (usually a packet of worksheets and some reading) after EVERY class-- doable if you come in reading and writing russian, hard if not. Also, quasi-mandatory corrections of all assignments. 2-3 essays. quizzes very often (averaging 1 a week), and a final.\n"
        },
        {
            "course_name": "Russian II",
            "review_date": "August 14, 2001",
            "review_content": "\nDon't take this class if you can't devote massive amounts of energy to it. At best, you will get a great foothold in the Russian language with the help of a wonderful, enthusiastic professor. But that's only if you can put in 2 hours a night to do the huge number of worksheets, nail the grammar, and memorize the massive amounts of vocab. Miss one night and it's all downhill from there; this prof. will really humiliate you in class. If you're planning on majoring in Russian, you probably couldn't choose a better teacher. Otherwise, do your sanity a favor and think twice before registering for Lebedev's section.\nWorkload:\nTests are reletively easy, but homework done well will take you 2 hours on a good night.\n"
        }
    ]
}