{
    "prof_info": [
        {
            "prof_name": "Richard Pious",
            "prof_id": 330,
            "total_reviews": 59
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Politics",
            "review_date": "August 17, 2016",
            "review_content": "\nAbsolutely take this class! Although it starts out not too exciting, it is definitely worth it. Professor Pious is a relatively dry lecturer and the lectures are fast paced and filled with facts and require very fast and focused note taking as he reads from papers at the front of the class. Class rules are somewhat strict (no lateness, food, etc) and absences are not really tolerated. However, by the end of the semester, I was so glad I had taken the class. Pious conveyed massive amounts of really important information very well and in a way that was easy to understand. His lectures were without bias and based on facts and his huge wealth of knowledge on the topic. If you pay attention, the lectures are very interesting and very rewarding. The class grade is determined by three research papers. Although they seem daunting, he is wonderful in office hours and really happy to help. I ended up learning a huge amount from the paper writing experience as well. If you have any interest in environmental policy or politics or just politics in general definitely take this class, Pious is super smart and helpful and also low key very funny. \nWorkload:\nthree circa 20 page research papers, weekly readings\n"
        },
        {
            "course_name": "Environmental Politics",
            "review_date": "July 31, 2013",
            "review_content": "\nThis class wasn't my favorite. While the topic was definitely interesting and Prof. Pious had a lot of insight to offer, his lectures were extremely dry. No powerpoint, no writing on the board, just him speaking very quietly and very quickly while everybody scrambled to keep up. I don't regret taking the class, since I did learn plenty about the political system and just how screwed up it is (especially when you look at it from an environmental angle), but it was definitely a chore to go to class. \nI'm not sure why he has a silver nugget. Maybe Prof. Pious is better in seminar, but for a lecture I'd skip him.\nWorkload:\nManageable. Two 13-15 page papers consisting mostly of regurgitation from the readings, and one 13-15 page final paper with a little more analysis required. Readings are long and dry, but you don't really need to do them all.\n"
        },
        {
            "course_name": "Crisis of Authority (FY Seminar)",
            "review_date": "December 20, 2012",
            "review_content": "\nI can't decide how I feel about this course: on the one hand, it was interesting to learn from a really famous and respected academic, but on the other, his insights and readings were not particularly stimulating.\nIt is difficult to participate because he spends most of the class lecturing, but I don't think he killed anyone on their participation grades. He is mostly just interested in your writing style. If he doesn't like the way you write, he doesn't offer much advice on how to change it- even in office hours, he just repeats what he says in class. I'm glad I took this class, but it didn't change my life or my writing style.  \nWorkload:\nNot terrible, but he doesn't allow drafts, which most professors do for seminar. \n"
        },
        {
            "course_name": "Crisis of Authority (FY Seminar)",
            "review_date": "December 15, 2012",
            "review_content": "\nIf you are a Barnard first-year, TAKE THIS CLASS! It will challenge you, and you will complain, but you are taking advantage of one of the best professors Barnard has to offer. I am still in shock that I was able to learn from such a stellar academic during my first semester. And the seminar is so intimate that you will actually have a relationship with Pious after the class. He is intimidating at the beginning, but you'll soon discover that he is incredibly understanding and relatable.\nDespite the impressive professor, the content of the class is not the most stimulating. It's mostly political philosophy (Plato, Orwell, Machiavelli, de Tocqueville, Mill, Bok.) That being said, the reading list consists of authors that you'll be glad you read. Many of the authors and selections overlap with LitHum requirements, so you can commiserate with Columbia College friends. Class periods are usually spent discussing the readings or analyzing \"good writing\" (mostly journalistic.) Pious wants your writing to dramatically improve over the semester, but the main focus is on crafting quality openings. He tends to reiterate the same advice throughout the entire semester, but his feedback is usually helpful, and he is always flexible about finding time to help (if you aren't too intimidated to go to office hours.)\nBe ready to question your writing style. Be ready to deal with a top-notch academic. But this class is an amazing way to begin your academic career at Barnard.\nWorkload:\nSemester is divided into four topics: Language and Authority, Knowledge as Authority, True Lies, and Power of the Powerless\nRequired readings for each class, sometimes heavy but manageable (only accountability is participation in class discussions, so you could get away with Sparknotes for some)\nFour papers (each work 20%), one per topic, ranging from 6-12 pages (each one increases in length)\nParticipation (the final 20%), based on class discussion and four article reviews (class period before each paper is due)\n"
        },
        {
            "course_name": "Environmental Politics",
            "review_date": "December 03, 2011",
            "review_content": "\nThis class will make you hate America.  But it's good.  Pious knows what he is talking about.  His lectures can get a tad boring, but it's pretty interesting material.  Take tons of notes to use in the papers.  DON'T SHOW UP LATE. and don't eat. Pretty much don't take your attention away from him for one second or else he will yell at you.  But don't get me wrong, he is a sweetie pie in office hours. \nWorkload:\n3 10-15 pg. papers.  He basically gives you an outline in the prompt, so just use that and quote the texts LIKE IT IS YOUR JOB and you will do fine.  Not a bad workload.  Attendance is mandatory (sign-in sheet every class period)\n"
        },
        {
            "course_name": "Crisis of Authority (FY Seminar)",
            "review_date": "December 29, 2010",
            "review_content": "\nCrisis of Authority was my first choice for FY Seminar - so you can guess that I'm really interested in Political Science. Being interested in the subject matter is important in this class; Pious is an absolutely brilliant man, and the course is heavily geared towards people who enjoy reading and writing non-fiction. He demands a certain level of commitment in this seminar - ALWAYS DO THE READINGS. Do not cross him; he really was the most generous professor I had all semester, but you do not want to get on his bad side.\nHe makes you learn how to write in a very specific fashion. If you enjoy reading and writing in the style of The Atlantic, The New Yorker, or other magazine of that caliber, this is the class for you. He has a habit of reading the opening paragraph of every paper aloud to the entire seminar (anonymously, of course), which was nerve wracking at first. Eventually, you get to recognize your fellow classmates' writing styles, and I've had other people in the seminar talk to me about my openings before.\nPious isn't here to let you bullshit through this course - he knows when you participate and when you don't, when you show up and when you skip a few classes. Crisis of Authority may not be the easiest seminar, but it is definitely one of the most rewarding.\nWorkload:\n4 papers (final drafts), standard amount of reading for a FYS, exercise before writing each paper.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "December 22, 2010",
            "review_content": "\nPious is one of the most intelligent professors at Columbia. If you want to understand presidency, beyond mere history lessons, you should definitely consider taking his American Presidency class. \nThe best thing about this class is that Pious grades papers himself so there is no headache of professors telling TA's that there must be only 2 A's and rest of them A- or B. He will give you an A if you use the readings and demonstrate your understanding of the materials discussed in class. \nThe aim of the class is for you to learn and not just memorize. Consistent with this, you must attend class and give your full attention, meaning no drinking or eating in class. Taking notes are crucial in the take home exams as they help you organize your paper but you have to write fast to keep up with him. \nHe is also very helpful in his office hours so you can make use of those when the papers are due.\nWorkload:\nthree 10-12 pages. Use the readings so he knows you have done them and this class will be just as easy as it gets. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "September 07, 2010",
            "review_content": "\nRichard Pious refers to himself in 3rd person when discussing his book and on the first paper. Nuff said. He's not that pretentious but he won't be your best friend. And his smile is about as warm as the Antarctica. \nBut overall, he's another foxnews bashing, Hilary Clinton loving, liberal at Barnard. \nYou must go to lectures but you CAN sleep thru them. Just dont let him catch you eating or on the phone. One time he called out this girl for eating a sandwich: \"What is this a cafeteria? Put it away now!\" \nThis class tore me a new one. I pulled 3 all-nighters for each paper and literally had to read or skim every single freaking reading. This class intense and not for the last minute procrastinators like myself.You will work your ass off and get a B+/A-...Unless you are Barry Greenstein himself (one of his favorite presidential scholars).\nBest of luck friends!\nWorkload:\nthree 12-15 page papers...does not give away A's. Grading gets harder as class progresses. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "December 13, 2009",
            "review_content": "\nDon't be fooled by the silver star. This guy thinks he's the president. The guy's pretentious and pompous. Grading is extremely arbitrary and he will make your life hell if you want an A. No one gets a solid A in this class. No one. You learn a lot but you have to spend your 1/8 of your college career reading nonstop. His lectures are unorganized and he is a really fast speaker. If you are interested in the presidency, maybe consider take his class. But as a person, I really can't stand him. He is a douche.\nWorkload:\n3 16 page papers. Don't look to get an A\n"
        },
        {
            "course_name": "Crisis of Authority (FY Seminar)",
            "review_date": "February 09, 2009",
            "review_content": "\nYou will not regret taking this class. Even though Pious may have rules and regulations, they are practical, and if you're a human being with even a small dose of common sense, you'll understand why he's strict about enforcing them. Before you take this class, though, be prepared to toss whatever you may have learned about writing from your high school teachers; it'll fail you here. Pious can appreciate creativity, which is something I miss, since my current English professor seems to regard originality as a flaw. Don't be afraid to participate. Seriously. Even if you're wrong, he'll find a way to make it sound alright, and he'll definitely remember and appreciate you for trying. \nI wish I could take this class every semester, because he makes it worth taking. The readings are pretty interesting too, and many of them you'll remember for a long time afterward.\nWorkload:\n3-4 essays. Final drafts only. Lots of reading, but interesting ones...not bad at all. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "January 13, 2009",
            "review_content": "\nFascinating class and amazing professor. I learned an enormous amount about a wide spectrum of topics -- yes, theories of the presidency and executive office, but also the federal bureaucracy, domestic policymaking, historical anecdotes, and insights into general management and decisionmaking that can be applied anywhere. The class really gives you great tools to analyze politics as well as a good sense of history. \nPious is intimidating at first, but he's brilliant and filled with knowledge. It's true he's very strict, and you must attend every lecture (but they're totally worthwhile and he leaves ample time for questions and comments). A lot of the historical anecdotes he narrates during lectures aren't necessary to know for papers, but fun anyway. Also be advised that the reading is very heavy. \nThis class is essential if you're an American Politics major or at all interested in politics, management, or decisionmaking. \nWorkload:\n3 10-12 page papers for which you must use the reading (and your own analysis); mandatory attendance at lectures. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "January 01, 2009",
            "review_content": "\nIf you are a poli sci major or even considering political science, take this class.  \nProfessor Pious is a brilliant teacher and this course is fantastic.  Other reviews on here have given him a bit of a bad rap - some people think his method of lecturing is too strict or that he degrades students, but I disagree.  Pious lectures from memory and heart, barely referring to the extensive notes he brings.  He records all lectures for student reference if needed.  He answers questions at regular intervals during each class, and he does his best to give informative responses.  He is definitely strict - there is no drinking or eating allowed, and students who miss more than four sections fail the class, so attendance is important - but he's not unreasonable.  He holds students to a high standard.  The class itself gives not only a great analysis of each president, but also opens eyes to unusual assessments of certain presidents and strikes down commonly held truths.  You won't want to miss lecture.\nDespite the ridigity with which he conducts lectures, Pious grades the three papers very fairly.  papers are based solely on the reading, which is extensive, but topics are given with at least two weeks to the due date.  You don't have to do all of the readings, as it is possible to skim through and get enough information for the papers, but the topics are never straightforward, so if you haven't done any reading and decide to look at the paper with only a night or two to finish it, you will definitely be screwed.\nThere is no final, and the last lecture happens the day before the end of classes.  \nTwo things to note if you're looking to enroll: freshmen shouldn't bother, he does not allow freshmen in the class under any circumstances; and Pious is not a professor for whom chatting during office hours about some lecture aspect helps your grade or rep - he states plainly that students should consult all readings, lectures, and the supplemental website list before asking him a question that they could not find out the answer to on their own.\nWorkload:\nThree Papers (10-12 pages) that are considered exams and for which you must use the readings, attendance at all lectures, and readings\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "February 24, 2008",
            "review_content": "\nI went into this class having heard mixed reviews about Pious, but I ended up loving him.  He does the best he can to make government, which is typically a boring subject, as interesting as possible.  He is extremely knowledgable, and has plenty of first-hand experience and interesting stories that relate to the class.  Pious can come off as strict at first, but its definitely worth staying in the class.  Be prepared to take a lot of notes- he moves quickly, but if you take good notes they will be really useful when you go to write your papers (especially if you skimmed/skipped some of the reading).  \nWorkload:\nThree take home papers, none of which are terrible.  They take a lot of work, however, and it is necessary to do most/if not all of the readings.  \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "January 25, 2008",
            "review_content": "\nIt is difficult for me to really give a good review about this class because Richard Pious is the one who teaches it. As a class, the material is very interesting...it discusses matter of Congressional/Presidential relations, different theories on presidential power and presents very interesting case studies. However, Mr. Pious makes the experience miserable. I received a good grade in the course, so I am writing this review to express how miserable an experience this course really is. First of all, he is very mean. This might not bother some people, but it is degrading to even sit in his class. I have seen him yell at students for drinking water, for asking questions and for coming in even a moment late. He often says that 'we students should learn where we are.' He commands an unreasonable amount of respect, to the point where it feels like he has an authority complex. The grading system is completely arbitrary. The essay grades are out of numbers, and he is very unwilling to discuss exactly where a, let's say 92 comes from and why it wasn't a 93. The system becomes very frustrating throughout the semester. Out of all the classes I have ever taken, in this course, I felt I had the least control over my performance. The upside is that the class is fairly easy...there are lots of readings but most people seem to do them the night or two before while writing the essays. Overall, I would not recommend this course to anyone, because although, especially for a 4000 level course, it is not much work, you will not enjoy your experience and largely dread every minute of the class. \nWorkload:\nVery light...three papers, roughly 10 pages each. Lots of readings, but very easy to skim them and get enough information for the papers.  \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "January 15, 2008",
            "review_content": "\nI'm not a poli sci major but took the class hoping to learn more about politics and I was extremely happy that I took the class with Pious.  He's extremely knowledgable and makes the material come alive with anecdotes and first hand accounts.  He's definitely tough and there are lots of rules to follow--he will call you out if you are late, have water, are chewing gum, or have a computer out--but really he just doesn't want distractions in class.  He talks pretty fast and you have to be a good note taker, because after a class where you think you grasped everything you might look back at your notebook and realize you have no idea what you're looking at.  He welcomes tape recorders and is also very receptive to questions, both in class and office hours.  If you want to take a challenging class and learn about the art of politics take this class.  But be prepared to work.\nWorkload:\nThree 8-10 page papers (graded fairly) and a LOT of reading (some books won't be necessary for the paper topic you choose, but if you leave all the reading until you get the topic choices you're going to be screwed)\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 22, 2007",
            "review_content": "\nHe begins the class by trying to scare people out with both the overambitious reading list and the fact that an attendance sheet will be passed around each class. 2 absences before it hurts your grade; 4 before he drops you from the class. If attendance isn't a problem for you, can manage the reading in your own way, and can write an essay, you'll be fine. There is a lot of reading, but all the exams are take home essays in which you answer 1 or 2 of a selection of questions by using the readings (no outside research). Basically, he is making sure you have done the readings and have understood them. If you don't keep up with the readings before the essay topics are handed out, it is still possible to do the essays - as long as you understand that you'll have to reserve at least a solid weekend to write the essay, which is definitely doable. Prof. Pious is absolutely knowledgeable about his subject, at times his personality is irksome - he shows off; is anal retentive about having no computers, no drinks (no water), no food in the classroom. The class is not taught in a chronological manner - it is not a history class. Complete unfamiliarity with American history would make this class more difficult, but the readings cover background and there is usually time for questions like this during class.  \nWorkload:\nweekly reading, 3 take-home exam essays (each ~10-12 pages; you answer a series of questions within the essay - it's not supposed to be a cohesive whole - it's an exam, he wants you to show that you've read and you understand)\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "July 16, 2007",
            "review_content": "\nMr. Pious stands out as the best professor I've had at Columbia. He is a master of his specific niche, an intellectual heavyweight, and looks the part of an Ivy League professor. He also has a strong knowledge of finance which enables him to speak credibly on budget issues and monetary policy, a rarity among political scientists. He is a good lecturer although he speaks quickly, so you'll probably want a laptop to take notes. His political views don't seem to fit well into the American political spectrum, overall I'd say his views seemed pretty objective to me, if a bit cynical. I am very conservative. \nThis course covers the constitutional, prerogative, and statutory authority of the President as well as academic theories on the presidency. It's a great primer on the presidency and Pious has great anecdotes for each man to hold the office. Take this course and attend all the classes, you'll be glad you did.  \nWorkload:\nHeavy Reading, 2-3 Papers. Not heavy but not a slack-off course as attendance is taken and is mandatory.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 08, 2007",
            "review_content": "\nProfessor Pious is a great man.  He is extremely intelligent, and for all of the people who complain that he's a \"hard ass\" just because he takes attendance, gets mad if you're eating, drinking, or talking on your phone, get over it--this is college.  I took this class first semester my freshman year, and I actually looked forward to it.  Pious is a good lecturer and as long as you go to class, take notes, and do the reading, you'll be fine and learn a lot of valuable information.  I liked Pious so much I'm taking another class with him.\nWorkload:\n3 10-12 page papers which take some time, but are manageable if you do the reading.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "January 09, 2007",
            "review_content": "\nPious is amazing.  He can come off as extremely strict, pompous, and intimidating (note all the pages of rules attached to his syllabus) but the class is well worth it because he is incredibly smart and well-versed in the material.  Pious seems to know everybody & all things as evidenced by his random anecdotes about who he has advised and what his friends have done.  He is also incredibly nice if you can get up the courage to speak with him after class or in office hours.  The reading list is the most intense one that I have ever seen, but you can gauge what you absolutely need to do when you get the essay questions, which are extremely specific.  Each of the three papers took me a ridiculously long time to write, but they were worth it.  After all that work, I was so happy that there was no final.  \nWorkload:\nprobably the longest reading list you will ever see\n3 10-12 page papers on said reading which will probably be very time-consuming\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 26, 2006",
            "review_content": "\nYes, as previously mentioned, Professor Pious is a genius in his field. He knows what he is talking about, and that certainly comes across during class. The lectures are packed with information, so good note-taking skills are a must. You will not put your pen down once during the 75 minutes of class time. He also summarizes most of the assigned readings during class, which can be helpful later for the papers. However, as he states on the first day, don't expect any use of media in the classroom. While he may occasionally crack a joke, what you get in the beginning is what you are going to get all year: straight-out lecture with a few minutes for questions. Attendance is mandatory, and an attendance sheet is passed around each class. Interest in the subject is a must, or by the end of the year the class can be brutal to sit through.\nIn general, it's best to get to class about ten minutes early, as he starts class whenever he arrives, which is usually five minutes before the scheduled time.\nThe workload really depends on how well you organize your time. If you do the readings when you're supposed to, I imagine that it takes much less time to write the papers later. Just make sure to take notes while you're reading, because he expects at least six citations a page for the papers. I personally left all the readings for the weekend before a paper was due, and would then pull an all-nighter actually writing the paper that Sunday. It's not fun, but it is possible, and I still managed all A's and A-'s. But don't expect to spend less than 24 hours writing any of the papers.\nFor anyone who is passionately interested in political science, Professor Pious is your man. However, if you're just taking the class for fun and want something a little less intense, it may be best to explore your other options.\nWorkload:\nSeveral long readings for each class, two midterm papers and a final paper, all 10-12 pages.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "November 27, 2006",
            "review_content": "\nPious is a phenominal educator and a master in his subject matter. Don't let him scare you off the first few days, his lectures are PACKED with information - but he is funny, and most importantly he has lived through much of what he is talking about (any politics that takes place after 1960's he has some form of first hand experience with). do the readings. do the readings. do the readings. there are a lot, but skim through and pick out main points, and you should earn about a b+. He is a fair grader- but the papers he has you write can only be completed if you - DO THE READINGS. \nIf you want a general overview of the American political system- this is the man for you. Truly, I couldn't imagine a more professional, knowledgable professor and haven't had one yet.\nWorkload:\na lot of reading- but worth it, makes everything more clear. \nTwo midterm essays and a final paper- 10-12 pages each.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "November 15, 2006",
            "review_content": "\nProfessor Pious is one of the most well-versed men I have had in any politial science class. However, he explained to me half-way through the semester that his class does not count for a political science major at columbia (as opposed to barnard- good thing I am a history major)\nA working knowledge of American History is preferred - as many political events take place because of world-\neffects- but it is not at all necessary. As a first-year, I thought that the way he explained everything in his lectures (of which you can only miss one- none if you want an A) was very clear and understandable.\nPious has real life experience - he works for the Dem party and has written many many books on Political Science and the President (some of which you will be required to buy). \nTake this class if you want a basic but extremely extremely thorough understanding of American Politics. \nWorkload:\nDO THE READINGS ON TIME or come the three papers, you will be LOST and will have to catch up and waste your entire weekend. Seriously, it will happen. The three papers (no midterm no final) are very very doable if one pays attention in lectures and DOES THE READINGS.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "November 15, 2006",
            "review_content": "\nProfessor Pious is one of the most well-versed men I have had in any politial science class. However, he explained to me half-way through the semester that his class does not count for a political science major at columbia (as opposed to barnard- good thing I am a history major)\nA working knowledge of American History is preferred - as many political events take place because of world-\neffects- but it is not at all necessary. As a first-year, I thought that the way he explained everything in his lectures (of which you can only miss one- none if you want an A) was very clear and understandable.\nPious has real life experience - he works for the Dem party and has written many many books on Political Science and the President (some of which you will be required to buy). \nTake this class if you want a basic but extremely extremely thorough understanding of American Politics. \nWorkload:\nDO THE READINGS ON TIME or come the three papers, you will be LOST and will have to catch up and waste your entire weekend. Seriously, it will happen. The three papers (no midterm no final) are very very doable if one pays attention in lectures and DOES THE READINGS.\n"
        },
        {
            "course_name": "Crisis of Authority (FY Seminar)",
            "review_date": "May 24, 2006",
            "review_content": "\nThis man is a genius.\nChoosing first year seminars was easy; this was the only one was of any interest to me. Unfortunately, the three months between then and the time the semester began, I had become thoroughly apathetic to political science.  But I soon realized that that was not what this class was about. Sure we did read  Plato, Machevelli, Orwell's 1984, and a good many other political commentaries, but that was not Pious' main interest. He wanted us, a group of 15 ambitious, but timid young women, to become writers. Forcing us to abandon the methods we had all learned in high school; he taught us that writing had to be something more. Using the New Yorker are Bible, we learned to how to captivate our readers, make are writing interesting down to the last period, and argue til we win the war. That is what this class is about. And I could not be more greatful; this man has taught me everything. \nAnd as intimidating as he might be, he really is a nice guy who loves to ignite the class in deep, meaningful discussions, and to regale us with tales of his life and all the amazing connections he has made. Pious is a God.\nWorkload:\nA fair amount of reading, four 6-8 page papers using readings, and four short, ungraded reviews of reviews from different periodicals such as the New York Book of Reviews and the Atlantic Monthly. Keep in mind that he will read the introductions of each paper aloud to the class and expects criticism. While he keeps their anonymity,  it is not easy to endure the first time around. \n"
        },
        {
            "course_name": "Crisis of Authority (FY Seminar)",
            "review_date": "March 20, 2006",
            "review_content": "\nI have to say, that this class was my favorite class last semester. It had absolutely nothing to do with the readings, since I'm not a big fan of Socrates or Plato but I have to say that Prof Pious is one of the most intelligent people I think I have ever met. I came from high school getting straight A's on every AP english lit paper and teacher then wasn't an easy grader. But, seriously, you will wish that you still had your high school english teacher grading your essays. Prof Pious does not BS and he will tell you when your writing sucks and when you are writing like a high schooler and when you're not thinking. He won't just tell you that you are smart and for that I highly respect him. He encourages you to write like a real writer and not some cheesy \"thesis statement\" essayist. He really improved my writing and gave me a whole new perspective on writing in general. We read essays from \"The New Yorker\" and \"The Atlantic Monthly\" and he encouraged us to write our own papers so that it was of that caliber (where people actually read it and remembered it). He's very meticulous about writing style (he loves the MLA Handbook). He encourages class discussion - actually he insists upon it and he is quite comfortable just staring at you until you say something. He was a bit intimidating at first, but I really loved this class and I think it had everything to do with the professor. \nWorkload:\n4 papers, reading assignments from various journals and magazines...Go to office hours -He doesn't seem as intense as he does during class. \n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "September 13, 2005",
            "review_content": "\nThe reading list was incredibly long, but the lectures were great and the material was fascinating.  Essays are long but not bad at all if you do most of the reading.  He does expect you to regurgitate the readings and lectures, however, so room for creativity is often lacking.  As for Pious, he's sort of an ass but a charming one at least.  Just put up with him--you'll be happy come the end of the semester.\n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "May 24, 2005",
            "review_content": "\nLook. It's Pious. He's strict about attendance and food, and he's arrogant as hell (you can make a good game of counting his references to the famous people he's taught or who've asked his advice on something or other).  But he knows an amazing amount about the American Presidency, and he's a superb lecturer (as long as your notes can keep up with him).\n Plus, he responds quickly to email, is approachable and friendly in office hours, and grades every paper himself while still having them back quickly (do they have detailed written comments? no. what, you want everything? he will talk to you about them in office hours, though).\nYeah, he makes you jump through a whole bunch of hoops (ask the kid who got bitched out for two minutes because he brought in a bottle of snapple), and yeah the reading for the American Presidency, especially, is insane (and you actually have to do it to write the papers). But it's totally worth it.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "May 08, 2005",
            "review_content": "\nThe first few weeks of Pious' class, I was so scared I almost dropped out. He is very intimidating in class, and doesn't hesitate to yell at anyone who's a minute late or-gasp-has any food or drinks in class. Once you get over this and the fact that he often goes on rants against anyone who even considers breaking one of his many rules, you'll realize what a good teacher he is. His lectures are packed with information- you literally do not ever put your pen down all class- and are really interesting, even if you don't know much about poli-sci. In person, Prof. Pious is very personable, nice even, and is very helpful on paper topics, or any other questions you might have. All things considered, definitely a class worth taking.\nWorkload:\nHeavy. Tons of reading, and even though Pious insists you do it all, it's easy to tell what you don't need to do. Midterm and Final take-homes, 10-12 pages each. \n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "May 01, 2005",
            "review_content": "\nI want to preface this by saying no one is more Republican than I am, or at least on this campus. This will make sense as you read the review. I have read the reviews on this that challenge Professor Pious, especially his rules. People if not letting you drink water is your judge of a professor's worth than you are the one with issues. \nYes, he purposely tries to intimidate people in the first couple of weeks, exactly for this, to weed out those who can not handle the class. The reason for the attendance sheet,...because unlike so many classes in this and any other University that require you to memorize things then regurgitate (sic) them, in this class you will LEARN. yes LEARN.\nI have not found many courses in my college life, which is quite lengthy and broad, that match this course. It challenges you, it makes you think and at the end you actually know things that you didnt know before. Do not let anyone fool you, politics aside (and he doesnt care what you are and allows you to express your opinions)  he will tell you what is going on and allow you to determine your own set of results or application of that data.\nI would not only reccommend taking one of his classes, I am actually trying to juggle my schedule to take another class with him, if they offered more, I would take more. Dont be afraid of a challenge, and dont be afraid to talk in class, he will respect you, and TEACH YOU!\nReal life experience counts for a ton and this man has put his money where his mouth is. EXCELLENT.\nWorkload:\nDifficult no doubt about it. The second paper was one of the hardest that I have ever had to do, the material is complicated and makes you make a leap to get it all, but its worth it, really worth it. Only take it though if you can afford say a B+ in the class.\n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "May 01, 2005",
            "review_content": "\nI want to preface this by saying no one is more Republican than I am, or at least on this campus. This will make sense as you read the review. I have read the reviews on this that challenge Professor Pious, especially his rules. People if not letting you drink water is your judge of a professor's worth than you are the one with issues. \nYes, he purposely tries to intimidate people in the first couple of weeks, exactly for this, to weed out those who can not handle the class. The reason for the attendance sheet,...because unlike so many classes in this and any other University that require you to memorize things then regurgitate (sic) them, in this class you will LEARN. yes LEARN.\nI have not found many courses in my college life, which is quite lengthy and broad, that match this course. It challenges you, it makes you think and at the end you actually know things that you didnt know before. Do not let anyone fool you, politics aside (and he doesnt care what you are and allows you to express your opinions)  he will tell you what is going on and allow you to determine your own set of results or application of that data.\nI would not only reccommend taking one of his classes, I am actually trying to juggle my schedule to take another class with him, if they offered more, I would take more. Dont be afraid of a challenge, and dont be afraid to talk in class, he will respect you, and TEACH YOU!\nReal life experience counts for a ton and this man has put his money where his mouth is. EXCELLENT.\nWorkload:\nDifficult no doubt about it. The second paper was one of the hardest that I have ever had to do, the material is complicated and makes you make a leap to get it all, but its worth it, really worth it. Only take it though if you can afford say a B+ in the class.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 24, 2005",
            "review_content": "\nPious is a scary scary man.  Although he is extremely knowledgeable about politics, his insane classroom rules almost made me forget about that.  During one class, he yelled at a girl who came in a minute late-for about five minutes.  But, if you show up and specifically on time, you will find the class extremely interesting and informative.  \nWorkload:\nA LOT of reading.  Three papers 8-14 pages, but the topics are so broad it's really easy to fill up the pages in no time.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "January 24, 2005",
            "review_content": "\nLook, after reading many of these review for Pious, it is clear to me that there is more to being a professor than teaching. You have to be a good person too. A professor is a role model, and should act as such. For $30,000+ a year, don't tell me in a condescending tone when I can and cannot drink water, without a very good reason. In short, I don't care how great a teacher he is, if he's a jerk, then he's not a great professor. I dropped his class, so I can't comment on the whole semester.\nWorkload:\nputting up with him seems to be quite a workload...\n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "January 07, 2005",
            "review_content": "\nThe reviewers who attack Pious for his arrogant and controlling ways would do well to remember that \"it's not bragging if you're telling the truth.\" If anyone deserves to run a classroom the way he or she wants, it is this man right here. My first semester was dismally uninspiring save this twice a week lecture and I unabashedly admit that I now worship the ground this guy walks on. He is brilliant, experienced, and if you're a snob who likes to be pampered and reassured that you're smart, he will walk all over you. This was a small seminar that required a lot of class participation, and he got it. (Even if he had to sit there in silence and glare until someone cracked.) Sitting in his class, I got the impression that I was listening to one of the most informed and wordly people I had ever encountered. He missed one class to attend a panel in L.A. and was out of town the next weekend lecturing at Oxford. His real-life experiences of the themes we discussed in class brought them into greater light and relevence, and his critical (in-class!) corrections to our papers were harsh but very helpful. Do yourself a favor and put away your ego long enough to learn from Pious. You won't regret it. \n(P.S. Go to office hours!!! He is a completely different person outside of class and very helpful.)\nWorkload:\n4 medium length papers (no midterm, no final, and we ended a week early)\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 29, 2004",
            "review_content": "\nGood class.  I liked Pious even though he was sometimes dry with this rather dry topic.  He can be scary at times, but don't let him intimidate you.  Just follow the classroom rules (no eating or drinking anything!) and try your hardest to always be on time or early, and you won't have a problem with him.  Meet with him during his office hours and you'll score extra points.\nWorkload:\n3 papers, all took work but weren't too hard.  There's a lot of reading for the course, a bunch of it too dry to get through, but you only have to do the reading for the paper topic you choose.  He gives the assignments enough ahead of time so you have time to read what you have to to write the paper.  In the paper, use lots of quotes and you'll do fine.  It is not difficult to get an A in this class, but it takes some effort.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "December 23, 2004",
            "review_content": "\nI have to defend Mr. Pious from the BS that is going on here.  He is by far the most interesting, knowledgable, excellent professor in the political science dept, and especially in American politics.  If you want to know how american politics works, take any and all of his classes.  Yes, they are an impossible amount of reading and writing, but are well worth it.\nWorkload:\nSo much it hurts.  But it's a lovely pain...really.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "December 19, 2004",
            "review_content": "\nSome of the negative reviewers clearly dropped the class a couple weeks into the semester. Pious is an ass and ridiculously strict  in the beginning to whittle the class down since he reads all the papers himself (refuses to have TAs). But once the class gets rolling, he's an incredibly good lecturer, producing 4+ pages of notes every day and peppering them with random stories and strange anecdotes (ask him about Donna Shalala, or how he's been shot at...). Best of all, he sincerely realizes he's teaching a class and answers questions incredibly well, holds office hours, and responds to emails quickly. He's tough and sometimes a bit strange (no food/drink in class, attendance sheet) but so worth it.\nWorkload:\n3 10-12 pg papers which are A LOT of work. Usually involves doing about 1/3 of the reading list to do well on the papers. Grades on them are NUMBERS with 5 or 6 word comments on the entire thing. But in the end, he seems to be realistic when grading (seems to be a wide range for A-). Oh, and take most of the books out of reserves, only buy the ones which are important for the whole class (Neustadt definitely).\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "November 08, 2004",
            "review_content": "\nVERY intimidating professor, can be a total bully, but he does take some very respectable positions on the American political system.  I wasn't blown away by any of his insights, and I thought he graded too much on what you can prove you read rather than on the depth of your understanding or analysis.  Still, this is one of the best classes on American politics in the department; it's just that if you think American politics is slimy and evil, this class will probably reinforce such beleifs.  \nWorkload:\nLOT'S of reading, although you can get away w/ doing half of it, 3 10-bangers\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "October 28, 2004",
            "review_content": "\nI think this guy is a complete a$$hole...he won't let you drink water in his classroom, and he refuses to change to a bigger room, regardless of the number of students in the class. i dropped him after about two weeks because he treats his students like 12 year olds. he is VERY strict on attendance, and in no way, shape or form understanding -- at least as i see it.\nWorkload:\nwho cares, the guy's a jerk\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "May 27, 2004",
            "review_content": "\nWhat a cranky old bully.   Unless you regurgitate exactly what he wants to hear, laugh when he's in a (rare) joking mood and sit solemnly at attention when he's not, in my opinion he will openly regard you as a piece of pond-scum.  \nWorkload:\nBoring and high-schoolesque.  Redundant reading assignments (they overlap each other and the class lectures).\n"
        },
        {
            "course_name": "Colloquium: American Political Decisionmaking",
            "review_date": "May 17, 2004",
            "review_content": "\nDon't let the course title deceive you.  You won't actually learn anything in this class, except possibly in my opinion the fact that the people who gave Professor Pious tenure must never have sat in on his class.  I spent the entire semester listening to other students read aloud their papers on various programs to combat world hunger via the UN.  You could say that this course gave me a taste of the mind-numbing bureaucracy and cliquishness of slow-moving international committees.  Yawn.  \nWorkload:\nSeveral drafts of an (ultimately) 50-page paper, half of which was supposed to address  \"my experience in the class and my assessment of the teacher.\"\n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "May 13, 2004",
            "review_content": "\nPious is simply the best political science professor at this University.  He is brilliant, he looks at politics the way they are rather that how they should be.  He exemplifies everything that the Poli Sci dept as a whole is missing--which is some real world awareness.  This class is absolutely fascinating.  There is a lot of work, but it could not be more worth it.  Take whatever you can with Pious.  If you don't, you just aren't taking a poli sci course.\nWorkload:\nA few cases every class, and some other reading.  Three 8-12 page papers that feel like 30 page papers--they are absolute killers, but when you're done with them you feel a real sense of accomplishment. No midterm, no final.\n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "May 13, 2004",
            "review_content": "\nPious is simply the best political science professor at this University.  He is brilliant, he looks at politics the way they are rather that how they should be.  He exemplifies everything that the Poli Sci dept as a whole is missing--which is some real world awareness.  This class is absolutely fascinating.  There is a lot of work, but it could not be more worth it.  Take whatever you can with Pious.  If you don't, you just aren't taking a poli sci course.\nWorkload:\nA few cases every class, and some other reading.  Three 8-12 page papers that feel like 30 page papers--they are absolute killers, but when you're done with them you feel a real sense of accomplishment. No midterm, no final.\n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "April 28, 2004",
            "review_content": "\nPious is a great professor fused with somewhat of an hard-ass personality.  He's great.  He knows the material, takes it seriously, and puts in a tremendous amount of work to prepare and help his students engage with it in a way that goes beyond normal readings and papers.  He does simulations in class and connects the topic with current events to keep things interesting.  \nHe is a challenging grader.  He'll give you a decent grade but he'll give out A's to those who say exactly what he wants.\nHe has some draconian \"classroom rules\" that can be annoying but they seem mostly for the benefit of other students rather than his idiosyncracies.\nHe's available for office hours and will carefully, patiently, ahd helpfully go over any questions you have about papers or the material.\nHighly recommended.\nWorkload:\nLots of reading for each class, four simulations, and three 8-10 pp papers.  It's a pretty heavy workload but not that bad if you enjoy political science and a professor who uses it well.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 29, 2004",
            "review_content": "\nThis class is amazing and a \"must-take\" for anyone who is considering a poli sci major. I have never learned so much in such a short period of time. Professor Pious is a fascinating lecturer, albeit slightly anal -- on the first day of class, he hands out an extremely comprehensive list of his class rules, which include no eating or drinking ... he will publicly embarass you if you break one of his rules. He also gives the exact paperweight he would like you to use on his essays. Yea, it's a little nuts ... but he knows his stuff. \nWorkload:\nA LOT. 200 pgs or more of reading per session, and most of it is on reserve, which I found to be extremely frustrating. 4 papers of 8-10pgs, all of which are challenging and require a good solid week's worth of work in order to pull off a good grade. No midterm, no final.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "September 03, 2003",
            "review_content": "\nI take issue with the previous reviewer's comments.  As a closet Republican, I came into Pious's class expecting left-wing diatribes and was pleasantly surprised.  Mr. Pious is extremely well-educated, friendly, and entertaining as a teacher.  History comes alive in his class, and while he probably prefers (ugh) Clinton to either Bush, he didn't impose his views on anyone.  I thoroughly enjoyed his summer course.\nWorkload:\nIn the summer... so we only had one essay.  Lots of reading, but if you're a politics buff it will be fun and games.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "September 03, 2003",
            "review_content": "\nAny serious political science student who does not take this course is doing themselves a disservice. Not only are the lectures well-organized and clearly delivered, Pious is very aware of the needs of his students and is more than approachable. This is the best class I have had at Columbia.\nWorkload:\nExtensive reading, and some writing (8-10 page essays).\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "August 29, 2003",
            "review_content": "\nAfter reading all these glowing reviews, I simply HAD to take a class with Pious.  Imagine my surprise when it turned out to be the must muddled, disorganized, one-sided flotsam this side of the Atlantic! Pious is nice - okay, and handsome, too - but he seems better suited to academic writing than teaching.  If you ask him a question, he'll answer in an informed and entertaining way.  Left to his own devices, however, he lectures your ears off about all sorts of unrelated things.  I think we spent half this course on the Iran-Contra scandal, and I don't feel I have a firmer grasp of the course topic as a whole.\nI never enter a Columbia classroom expecting unbiased political oration, but Pious was the most blatantly left-wing prof I've had so far.  He called Reagan a \"moron\" - and, indeed, he spent the majority of the course discussing the crimes and misdemeanors of various \"crafty, dishonest\" politicians of the Right.  *CULPA censor*\nCame essay-composition time, I was hopelessly unprepared.  Neither Pious's scrambled class discussions nor the narrow list of assigned books bore even the slightest correlation to my essay topic.  Overall, Pious's cynical, condescending view of the inhabitants of our nation's highest office turned me off.  Students who share his views + suspicions would probably have a blast in this class.\nWorkload:\nNot too heavy, but difficult to meet its demands for reasons outlined above.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "April 12, 2003",
            "review_content": "\nThis class has a ton of reading but it is not that difficult to do well.  The topics for the 4 ten page papers are so broad that they are simple to write, especially because he loves you to fill them up with citations.  He also covers a lot of material in class which helps with the papers.  He comes off a bit arrogant and moody.  One minute he  is making a joke and then starts yelling about people having food in class.  You do learn a lot but it's so much material in such a short amount of time that it's hard to retain most of it.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "January 16, 2003",
            "review_content": "\nI LOVE HIM! He is the best teacher that I EVER had in this school. His knowledge is amazing. Also his ability to fit in such amazing and important information in an hour and fifteen minutes (sometimes he went over but before class he would let you know that he would go over the time) was great. Questions are allowed, but not stupid questions where you might want to demonstrate your intelligence. The best professor to e-mail or see in office hours! He might appear to not care about students, but he really does. As long as you do not violate his rules, which he discusses during the first week, you'll be fine.\nWorkload:\nA LOT! But it was worth it. 4 ten page papers. All readings are necessary in order to write a B+ to A paper. Tons of reading. The syllabus was 4 pages long in 10 font. But once again, if you are interested in political science, this teacher is necessary.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 22, 2002",
            "review_content": "\n Not that I have any personal experience, but taking this class was a lot like giving birth. It engenders an incredible amount of stress and sleepless nights (and I don't even mean if you're stupid enough to write your paper the night before!), but the end result is worth it. An illuminating, informative, cogent class. Probably the first class in my life where I actually went back to my room and, pondering certain things we had discussed in class, did a significant amount of research so that I could present my point without being shot down. This class makes you want to work hard, for two reasons: 1) you don't want to fail and 2) the hope that you will make some brilliant statement that even Pious will concede is correct, although that didn't happen in my semester. Quite simply, Professor Pious is is one the university's greatest, if not the greatest, resources on American government and politics. But don't let him hear you say that. Actually, on second thought, if he did, he would warmly agree with you. \n One caveat: this teacher believes that expertise allows for rudeness, which basically characterizes his behavior in class. But when taking individual questions, he is attentive and brings the full weight of his considerable intelligence to answering it.\nWorkload:\n Introductory course, my foot. Approximately 100-200 pages of reading a week, and four papers (three 'midterms' and a 'final') which, as someone else wrote, must be perfect to even have a slim chance of getting anywhere near the A's. If he doesn't like your writing style, he won't tell you unless you ask him, so always investigate that possiblity. Most likely, you will be spending a couple of days on them.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 11, 2002",
            "review_content": "\nAlthough a little obnoxious at times, I think that he is an amazing professor who has been around since forever and really knows American Politics, inside and out. The readings can be a pain in the ass, but it's american politics, what do you expect? I strongly recommend this class to any political science major (well, it's technically one of the requirements so you have to take it anyway) and/or non-political science major. I'm sure you'll get at least one thing out of the course that you never knew about the American political process.\nWorkload:\nfair\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "December 23, 2001",
            "review_content": "\nThis was the most amazing class that I have ever taken. Prof Pious was organized, insightful, and has taught me more than every other professor at this University combined. His lectures were interesteing, and although at times I found myself with ten pages of notes at the end of class, I'm not sure that that was the case for everyone. His anecdotes were very funny and added levity to the class. Yes, at first he seems a bit scarry, but if you make it past that point you'll get to learn about the true inner workings and behind-the-scenes of the White House. Yes, the readings were extensive but you definitely could get away with only reading a few of them per class. Just make sure to quote him in all three of your 10-page papers (which if you include the needed amt of info will become more like 15). Ok, so the papers were a lot of work but the readings were amazing. I can't wait to take a course with him next semester. And to end with you feel an amazing feeling of accomplishment when its all over and you realize that you've managed to survive one of the hardest professors on campus.\nWorkload:\nA lot!!! Definitely take one of his courses but see if you can do it in a semester when your workload from other courses wont be so heavy because this class wll take up a lot of time. Probably more than 500 pages a week if you do all the readings but you dont need to. Three 10-page papers that you need to work really really hard on to get a good grade.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 19, 2001",
            "review_content": "\nThis is a great course. Pious is a great Prof. The guy knows his stuff and is witty and sarcastic. He hates it, and will let you know that, if you eat, drink, read or do anything in his class that is not listening to him. This is not just a standard intro course. It is far more thought-provoking than that. Pious is a great teacher and commands respect for being tough in class and in his grading. So be forwarned that this is not an easy A course, but he is far better than the other teachers for this course.\nWorkload:\nFour 10 page papers. No midterm or final. Lots of reading, which is not all necessary to read depending on which paper topic you choose.\n"
        },
        {
            "course_name": "The American Presidency",
            "review_date": "December 10, 2001",
            "review_content": "\nProf Pious is a marvel of organization and efficiency. His lectures are clear, concise, orderly and jam packed with important, exciting, interesting, and sometimes down right funny information. There are a lot of Professors who know their stuff but just can't teach-Pious knows his stuff AND can teach, and very well. Don't let Prof Pious' harsh sterness the first couple of lectures scare you off; he is the exact opposite once he manages to scare off a portion of the class down to a manageable 50 or so students. However, don't be fooled by his kindness, he is hard as nails with grading and expects you to work hard, very hard, but it is worth it. Although the reading list seems to rival the Library at Alexandria, Prof Pious does a more than adequate job of presenting all of the essential parts in class. Readings can be skimmed for note taking purposes essential for the three 10pg papers. Don't be frightened off by the readings- you will find you actually want to sit and read them all; they are absorbing, anecdotal and present history in a lively and stimulating way, much like Prof. Pious himself. Though Pious often jokes he speaks in a monotone, and \"has been accused of giving the lectures in his sleep\" (and some students do claim they find him boring), the majority of students could not have found this further from the truth. Pious is witty, and does have his not so infrequent moments of lively jocularity. Listening to his lectures you can tell he is just dying to break out in presidential impersonations which he claims he just can't do. I learned more about the Presidency and REAL U.S. history in this class than any other i have ever taken. There is little else to say except TAKE THIS COURSE and any other Pious gives.\nWorkload:\nThere are three 10pg papers=Two \"midterms\" and a final. The reading list is extensive but interesting. The papers do require A LOT of work, and Pious expects a lot of work. 10pg is the requirement but most students have found it impossible to answer the questions in less than 15. Some have gone as high as 18 or even 23 pages. Hard work pays off though.\n"
        },
        {
            "course_name": "Colloquium: American Political Decisionmaking",
            "review_date": "August 14, 2001",
            "review_content": "\nIf you're tired of traditional political science classes and willing to work hard, then this is the class for you. It's syllabus is one of the most creatively designed at Columbia and if you can manage to get your name on the enrollment list, which is generally capped around 12, then you have to take this class. If you're not on the list, don't bother showing up since spaces never open up. The class simulates an advisory group to the President and Pious expects you to learn everything there is to know about the policy area you cover. The upside is that you will become an expert in a policy area that interests you; the downside is that you will do more work for this one class than you ever thought was possible. At the end, you will have produced a 50 page document, learned an incredible amount about political strategy and been privileged enough to both take a class with, and get to know personally, one of the best professors at Columbia.\nWorkload:\nInsane. As with any class taught by Pious, the reading list is extensive and, in this seminar based class, he expects you to have something intelligent to say about the readings. With 12 people, there isn't anywhere to hide so you actually have to do all of the work. The class' end product is a 50 page paper, the writing of which is similar to giving birth, replete with the pain that goes along with the process. You will eat, sleep, think and breath your policy area for the month before the paper is due. Along the way, you hand in several drafts of the first 25 pages of your paper which Pious and your classmates comment on. This is not a course for those who need a lot of guidance on papers, are lazy or timid. If you can stomach the thought of writing 50 pages, then this is the best class you will ever take.\n"
        },
        {
            "course_name": "Constitutional Law of Presidential-Congressional Relations",
            "review_date": "August 13, 2001",
            "review_content": "\nThis was certainly the hardest class I have taken at Columbia, and if not the most engaging, one of the most. The readings were deceivingly short--you cannot skim works on constitutional issues in the same way you can breeze through a journal article. Those who did their homework, however, were sure to gain a lot from the lectures, which were extremely well structured--to the minute. There was usually ample time given to questions, unless the class had fallen behind slightly on the syllabus. Pious also did a good job engaging everyone in the class to participate. I hesitate to say I learned everyone's name by the end--there were about 30 of us--but it came close to approximating seminar conditions. Beware--lots of life long learners like to volunteer what are often irrelevant comments. Oh, and he takes attendance every day. If you miss more than four classes you are out.\nWorkload:\nExpect to really work. 5 8-page briefs, written as memoranda to the President. Each must cite about a dozen cases/journal articles. 5 classroom simulations of the constitutional issue being written on, in which everyone is expected to participate. If you don't, don't expect a good grade.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nPious is a Poli Sci god! He knows his stuff and his lectures are so packed with info., is bound to make your head spin. But Pious also take arrongance to new levels - which might upset some (especially those who are socialists). The work load is unheard of & the chances of an easy grade (other than an F) is nil. Just make sure you're not a mental patient by the end of the semester.\nWorkload:\n4 10-page papers that must be stellar to recieve even a decent grade. All of the class reading is mandatory if one wants to still have a G.P.A. by the end of this class.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you do the work in Pious's class you will learn more about American Politics then you thought possible from an introductory course. If you do not do the work he will fail you from the course. As far as doing the work goes he is a fiend from hell, he does obscene amounts of work and will expect that you do the same. He really seems to act as if you are in no other classes. He also is trying to scare people who think that Poli Sci is the default major that you take when you have nothing else to do away from the major. On the other hand, I have learned so much about the American Political system from his class that it is hard to complain.\nWorkload:\nHuge. You are assigned more reading than Lit hum, all of which you actually have to have read in order to do the four papers that comprise the total grade. I managed to get through most of the class without watching any of the videos on his sylabus and this is a good way to help par down the huge assignments he gives. This class is a wolf in sheep's clothing as a 3 point 1000 level class; bottom line, take it if you are really interested in the subject and have a light course load to go along with it. If you need the class to fufil a requirement (watch out it does NOT fufil the Columbia College intro requirement) then take it with another teacher.\n"
        },
        {
            "course_name": "Dynamics of American Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you want to know about the way our political system works, this class will answer every question you have ever had. Many students sit captivated by the vast experience and expertise that Pious brings to this intro course. He expects the class to run in a pretty formal way (no food, be prepared to answer a few questions about the reading) but you just have the most respect for him. A lot of students find him not very approachable and even rude in class, but during office hours he is completely wonderful, kind, funny, and very helpful. He is very excited about his students and his subject.\nWorkload:\nA LOT of reading (few hundred pages a week) but he doesn't expect you to read every single text word-for-word. 4 papers (including final paper), be sure to use lots of written references (including a quote or two from his own texts).\n"
        }
    ]
}