{
    "prof_info": [
        {
            "prof_name": "Robert Pollack",
            "prof_id": 1021,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "June 12, 2012",
            "review_content": "\nI landed in Professor Pollack's Frontiers section in Fall 2008 as a freshman and stayed in the section because Prof. Pollack seemed to be a nice guy who brought food to class and ran a laid back section. However, in retrospect not switching out of this section was one of my biggest mistakes at Columbia. Prof. Pollack did not prepare his class for exams; rather, he rambled about any random subject he felt like (irrespective of whether it had to do with the course material) for two hours each week.\nHowever, Prof. Pollack's spaciness and general disinterest in teaching the Frontiers curriculum wouldn't have been so problematic had it not been for his completely opaque and frankly arbitrary grading system. He would not reveal how grades were calculated until the end of the semester. At the end of the semester, he revealed that students could only get a maximum grade of 90% unless they wrote the optional \"extra credit\" paper (which could boost you into the A range) and/or if your final exam was two letter grades higher than your midterm score (if you got a C on the midterm and an A on the final, you got an extra 5% added onto your grade).\nAlthough I got an A on the midterm, an A- on the final, 100% on the homeworks, and an A+ on the extra credit paper, I wound up with a B+ in the course... I was one of 16 people in Pollack's two sections to contest my grade (an absurdly high number) but he was not receptive to anyone. \nI would not recommend taking his class. \nWorkload:\nLighter than the standard frontiers workload- weekly home works that are graded for completeness, midterm, final, optional extra credit paper. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 12, 2010",
            "review_content": "\nPollack in general is a pretty cool guy. Taking a seminar with him is mostly him talking and a few people raising questions on parts they didn't understand. I found his seminar interaction overall not too bad, and he even brought us food every class. \nThe problem with his seminar however is the fact that his grading is extremely subjective and on average quite difficult. From he beginning of class he tells you that 60% of the grade is tests and the other 40% is something subjective. He doesn't even tell you what exactly it consists of, but one can probably guess its some combination of participation and just what he thinks about you. He even tells you to \"not worry about it\".\nI personally scored a high 80 (with the average being a high 70) on the midterm and over 90 on the final (I asked at the end of the semester), did all my hw, attended all the lectures, and even wrote the \"extra credit\" paper, and ended up under an A-. I personally asked him what the grading distribution looked like at the end of the semester and he told me only two people out of a class of around 20 managed to score in the A range and B+ is \"well above the mean\". \nI think this class is fine in terms of having a knowledgeable professor but the 40% subjective grading can really be a wildcard. Just be warned that grading is tough.  \nWorkload:\nWeekly HW (technically not counted, but who knows how much of the subjective 40% is in this), midterm + final (department wide, Pollack is pretty lenient in grading tests), and an extra credit paper.\nThe extra credit paper is really stupid because I don't see where the extra credit comes in (he doesn't tell you how you did or how much EC you get; he literally says something like \"just have faith about how I will incorporate this into your grade\". Also you don't have anything to write about, because the essay is about how the stuff you learned in FoS relates to your life, and because FoS is basically useless, you really can't relate much. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 21, 2010",
            "review_content": "\nDon't be fooled by his cranky sounding emails: Bobby P is the sweetest, most adorable old guy alive. \nHis seminars were very interesting if you paid attention, and if you could show up on time, or at all for his 9 am classes, cause homey's mad smart. \nHe shows up to class with his double mint gum box of nearly dried out red pens in his grandfatherly attire...with his mac and blackberry. Homey's mad cool too. \nIf you don't show up for class, he will notice and email your counselor if you do it too many times. But that's ok cause Bobby P's freaking awesome. \nFrontiers of Science was the bane of my existence.  \nThat is all.\nWorkload:\nWeekly assignment, quizzes, a midterm and final. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 21, 2010",
            "review_content": "\nOverall interesting guy: past dean of Columbia College, closed his biology lab to focus on Science & Religion, has a wiki page, etc. It would also be cool to have a guy who gives some of the FoS lectures, which Bob does, on Evolution.\nThat said, the seminars are boring as hell. I think I made the suggestion on Courseworks that they should do away with seminars altogether and just have the lectures (most of which I find engaging) and help rooms. Professor Pollack does not make it any more interesting by being a strict advocate of the FoS seminar. Almost everything is done to the book: lecture review, taking up of homework, activity (which he sometimes alters or omits). No offense, but I have to admit that Bob is getting a bit senile. While he is extremely clear in communicating what he wants, he's not the most engaging speaker (it shows in the lectures he gave).\nThe seminars end up being a four-way conversation between Pollack and a few very eager, but uncomprehending students. I ended up skipping quite a number of seminars (and yet did quite well in the course), because a) it's boring and b) it's way too early. \nNonetheless Professor Pollack is still a nice guy, at least a full faculty member. His seminars are just plain annoying, and the attendance shows.\nHis bringing treats (almost) every class is as a big hallmark of his teaching style as the name cards and red pens.\nWorkload:\nTaking FoS with Prof. Pollack is the easiest thing ever, IF YOU KNOW A BIT OF SCIENCE AND CAN THINK LIKE AN INTELLIGENT PERSON. The HWs and quizzes don't count at all, which means you don't have to do them or spend much time doing them. But that means 40% of your grade's entirely based on participation (a variable). The optional essay can help bring some certainty to that 40% (though no one knows how much). My personal advice is to ace the exams, then for some reason you'll get that A.\nVery easy class. Almost no workload, except for the nights before exams.\n"
        },
        {
            "course_name": "Independent research",
            "review_date": "May 28, 2009",
            "review_content": "\nProfessor Pollack is a nightmare. Why did they make him the overseer for this course? I really wish they hadn't done such a thing. He is extremely difficult to talk to and hopelessly rude via email. I have tried to contact him and his replies are stern, one-worded and often completely unhelpful. If you try and talk to him about a situation in lab, he retorts back. I realize that he may be an effective teacher for other classes but in my opinion he is old fashioned and extremely unhelpful. As the Columbia connection for this course, he is only succeeding in making it extremely stressful for students to the point where they don't feel like even talking to him about any problem they may have, just because they expect a cold retort. If he doesn't have the time or the concern to handle this class then I would hope he quit this position now rather than waste students' time and injure their interest in research. If you are planning to take Independent research do yourself a favor and chose a fabulous PI so you never have to go through the nightmare of the Pollack. One more thing- don't mix up his name with that of a fish or he'll probably bite your head off. So all in all, he has succeeded in making this class which is generally one of the most interesting in Columbia, one of the most painful. I do not recommend this class because he is hard to get by and while people who have had a good mentor may have found him alright, he really does nothing when you have a bad mentor. For me that is the strength of a true overseer of W3500 and Pollack has failed immensely. \nWorkload:\nInitial proposal, Progress report, Paper, etc. largely for administrative purposes. He has all these rules about when the paper is due and the deadline but gives hopeless feedback so I wonder if it even matters? I didn't even get a remark on my paper. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 22, 2008",
            "review_content": "\nDon't get me wrong, Bobby P is a really nice guy. He brought us candy and snacks every week because he understood the afternoon slump of a 4:10-6 pm class.  He may've been thinking that he was doing us a favor by not grading our homeworks, instead it just put more pressure on class participation.  This meant that classmates tried to explain their answers to the class, which wasn't always helpful to people like me who just didn't get it.  He did his best to be available to answer questions, however, with no office hours, it was hard to track him down. If you take his class, his email is your best friend. I would recommend that you do the extra credit paper because your grade is comprised of participation (out of 40 points that he abritrarily dishes out), the midterm, and the final. Although he was pretty harsh at grading the midterm, he was very open to the idea of looking over it to make sure that he hadn't made any mistakes.\nWorkload:\nweekly WIA that's not graded, midterm, final, and extra credit paper about any topic of FoS that has caught your attention\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 10, 2008",
            "review_content": "\nBob Pollack is very intelligent and very kind. If you ask him a question, he will tell you everything you wanted to know and much more. He encourages people to ask questions and make comments. He doesn't even grade the WIAs at all. Your grade consists pretty much entirely of participation. Also, he brings in candy to every class. The class was boring, but it wasn't his fault. He was just teaching such inane material that his venerable set of talents could not fully be brought to bear.\nWorkload:\n1 WIA a week, doesn't take long, isn't graded.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 27, 2008",
            "review_content": "\nThis class was a nightmare. The course itself has interesting content but is ruined by the way it is taught. Professor Pollack is clearly a very intelligent man but he made the two hour seminar seem like it lasted for years. There was little or no discussion, he just talked, and talked...and talked. The WIAs seem like a waste of time and the exam is only barely related to everything you learn all semester. Pollacks grading was obscure. We never found out what we got on our WIAs and his final grades seemed unfair, despite his promises he would try and be as lenient as he could.\nWorkload:\none WIA a week, doesnt take long. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 28, 2006",
            "review_content": "\nGreat guy and good teacher, but his grading system was incomprehensible.  He gave E, F, or P on all graded work which we all assumed to be equivalent to excellent, fair, and poor, respectively.  In my case, he gave me all E's except for one assignment where I got a F and an A-range midterm and final.  I participated and even did the extra credit and still ended up with an A- for the course, which makes little sense.  He said that he would not try and grade against you but it's almost apparent that he did.  It's a required class and my personal feeling is that in required classes, the grading system should be more lenient--Frontiers requires each teacher to curve the midterm and final to a mean of 80, which is harsh by almost anyone's standard.\nWorkload:\nWeekly individual assignments and a three-page paper. \nMidterm and final which were painfully easily yet graded as if we were science majors.\n"
        },
        {
            "course_name": "Environmental Bio",
            "review_date": "January 11, 2006",
            "review_content": "\nWhoa. I don't know where all these positive reviews are coming from. DO NOT TAKE THIS CLASS if you can at all avoid it! Pollack's lectures are utterly unitelligible and his tests are even worse (I couldn't even understand what he was asking on some of the short answer questions). The only way I got by was remembering some things from my high school bio class. Taking good notes will not help, because 75% of the stuff that comes of Pollack's mouth is convoluted gibberish, and the textbook is so detailed it's hard to pick out the important stuff. This class made me not want to concentrate in EEEB. If you are interested in majoring or concentrating in the department, the only advice I have is to take this class P/F. Good luck!\n"
        },
        {
            "course_name": "Environmental Biology 1",
            "review_date": "December 11, 2005",
            "review_content": "\nIt's difficult to find words that correctly describe Pollack.  \"Grandpa\", \"Thunder Cat\", and \"Teddy Bear\" all come to mind, and \"Grandpa Cat-Bear\" about sums it up.\n"
        },
        {
            "course_name": "Molecular Biology of Disease",
            "review_date": "May 07, 2005",
            "review_content": "\nIt's difficult to find words to correctly describe Pollack. I would venture to say \"brilliant\" but somehow that term doesn't quite capture him. He is by far the most amazing professor I have had in my four years at Columbia. He is charismatic, patient, and encouraging. Don't let him scare/intimidate you out of the class. Many people drop it because of the fact that he chooses people at random to give presentations. Just go over the readings carefully with special attention to the data. He just wants to see that you put forth effort. If you are wrong, its no big deal and he helps lead you all towards the right answers. I highly suggest taking this class!\nWorkload:\nNot too bad, weekly readings and a final 10 page paper.\n"
        },
        {
            "course_name": "Environmental Biology I",
            "review_date": "January 10, 2005",
            "review_content": "\nThis was the best class I have taken during my first semester at Columbia. As many reviews will tell you, lectures are not enough to get your grade.  Reading the book is crucial for the exams. Still, I enjoyed the lectures very much, they were really inspirational, don't miss them. Taking extensive notes is not possible and unnecessary. If you don't have background it might be a good idea to read the book ahead in order to grasp the lectures in all their beauty .\nWorkload:\nIt really depends on your level, if you know some chemistry and biology, this course will not be too chalenging during the semester.  Two midterms (only the better counts) and a final. Timing is very important - format of the exam might  change, but  it will definitely require you to be fully engaged till the last minute.  If 200 multiple choice questions in 3 hours seems fine, go ahead, it is worth it.\n"
        },
        {
            "course_name": "Environmental Biology I",
            "review_date": "January 02, 2005",
            "review_content": "\nI took this course a year ago and only have fond memories.  You'll work hard for an A, but thats what college is for.  Pollack is one of the more eloquent and inspirational science lecturers I've come across.\nWorkload:\n\"The end of all our exploring will be to arrive where we started from and know the place for the first time. - TS Elliot\"  Pollack drops shit like that all the time - science majors and premeds should take his class if only because the man is a living testament to how you can combine hard science and the philosophy of life into one coherent study.\n"
        },
        {
            "course_name": "Environmental Biology I",
            "review_date": "December 29, 2004",
            "review_content": "\nHe knows what he's talking about, and can even be entertaining at times but READ THE BOOK! He says to use it as background but it's necessary to do the reading to follow the lectures at all (unless you have an extensive bio background).  He has the worst handwriting I've ever seen, it's actually more like scribble, but will clarify if you ask.  Be persistent with comments/questions- he insists he's open to it during class but often doesn't see raised hands.  You can learn a lot from him but you really have to want it.  \nWorkload:\nthree exams, lowest grade dropped\nreading: about a chapter a week\n"
        },
        {
            "course_name": "Environmental Biology",
            "review_date": "December 21, 2004",
            "review_content": "\nThere was so much information and detail to learn in such a short amount of time, I think there could have been twice as many lectures with the same amount of material and that would have been fine. He is a nice, smart guy who really wants to explain everything as clearly as possible to you. He just wants you to know an insane amount. I had taken advanced biology and chemistry before, and it was still a lot. There were a lot of lectures rescheduled for the optional recitation time, which sucked because since recitation wasn't required I hadn't known about it and I had a conflict and couldn't go. Definitely go to every lecture - that is your best bet. I felt impossibly lost whenever I missed a lecture because so much was covered. Go to lecture, sit down, shut up, and write notes as fast as you can. I ended up missing a lot because I was still writing the previous thing down. Having a legible shorthand will help you. GO to recitation to ask the questions you didn't get a chance to ask in class. He will pause occasionally to look for raised hands, but take that opportunity because he can go 30 minutes without looking at the class or pausing for breath. It was an OK class, but I am still reeling from the shock of so much information. An enzyme he mentions once in passing will probably be on the test.  Write it down. \nWorkload:\nJust reading the chapters - HIGHLY recommended to read along with the course - don't try to wait til right before the test. No hand-in homework. 2 midterms with short answer, 1 final all mult. choice. \n"
        },
        {
            "course_name": "environmental biology",
            "review_date": "December 19, 2004",
            "review_content": "\nI took this course for two reasons.  #1 I am pre-med and wanted to save myself one semester of insanity in Mowshowitz.  #2 I was interested in possibly being a EEEB major and knew that this was an acceptable course for both this and a bio major/concentration.  It seemed like the best of both worlds.  I think If I were choosing again, I would not take this class.  I'd suck it up and deal with Mowshowitz.  At least you will be ready for the MCAT.  I didn't learn anything beyond high school bio, Pollack is an incoherant lecturer, and the grading system is terrible.  There are 2 midterms, he drops the lower one, and a final.  That's it.  Two chances.  His tests are ambiguous and based on his lectures for which the notes are not even helpful.  I knew everything from the book, but it doesn't mean you'll do well because his questions are not straightforward, and as far as I am concerned, unfair.  If you're pre-med, face the facts and take Mowshowitz.  If you are just interested in EEEB, I'd take another course.  If you are a major and have to deal with it, fine, its not the end of the world.  \nWorkload:\nNone.  No homework or quizzes.  Read and study before tests.  \n"
        },
        {
            "course_name": "Environmental Bio",
            "review_date": "December 17, 2004",
            "review_content": "\nPollack takes some getting used to, but he's a thorough and thoughtful instructor. Expect to do poorly on the first exam: since there's no feedback (no homework assignments), it's very hard to discern what you're supposed to retain from the lecture and readings.  Nonetheless, if you attend the lectures/recitation and do all the reading, you will learn a tremendous amount in this class. \nWorkload:\nStrange--there's no work or assignments per se--it's all about the 2 midterms and the final.\n"
        },
        {
            "course_name": "Environmental Biology",
            "review_date": "February 04, 2004",
            "review_content": "\nA course of memorization.  Unfortunately, it is not a course for the uninitiated in biology.  If you know very little about environmental biology and are looking for some inspiration, this course is not for you.  The prof says you need only listen to him and use the book as background, but the opposite is true.  Study the book and then maybe you'll understand him and get some interesting perspective from the prof.  A good survival strategy for those who have to take the class is to get a good biology text in advance and start memorizing the amino acids, DNA and basic genetics, photosynthesis, respiration, and read up on basic evolution and population science.  Then you should do well.  The prof likes written tests, so good advice would be to practise writing out a few definitions of basic concepts of the above, but beware, the multiple choice, when used, can ask for very detailed information about these processes.  He also asks for drawings of the important molecules.  The prof's lectures can be hard to follow and some people taped the class, but following the book first and then prof second probably saves time and works just as well.  A lot of the grade, 20%, is decided by him as a \"participation\" grade.  Students regularly corrected the prof as he sped through his molecules or genetics concepts on the blackboard, so that must contribute to the participation grade.  Good luck.\nWorkload:\nStudying about one chapter per week.  Compulsory recitation hour, most often useless meandering discussion.  Three exams.  One after the first month, then a midterm, and the final.  A lot of memorization and ensuring you understand basic biological processes outlined above in detail.\n"
        },
        {
            "course_name": "Science & Religion East & West",
            "review_date": "January 20, 2004",
            "review_content": "\nThis course is co-taught by Pollack and Joe Loizzo.  I agree with the below review, Pollack's lectures were good and clear, however, he wasn't really interested in student input (although on the first day, he made it sound like he was excited about the diversity of student backgrounds and potential discussion - don't be misled!).  He and Loizzo just wanted to argue with each other in front of an audience.\nThe course is mainly philosophical and religious texts.  I was hoping it would explore the political and social clashes of science and religion throughout history, but there is pretty much NONE of this.  If you want to study this sort of stuff, don't take this course.  If you like philosophical and religious debate about huge questions such as \"What is the nature of consciousness?\" and \"Is there life after death?\"  you will probably love it.\nWorkload:\nOne short paper and one long paper on whatever you like.  Lots of reading, only some of which is truly essential.\n"
        },
        {
            "course_name": "Science & Religion East & West",
            "review_date": "December 23, 2003",
            "review_content": "\nThe topics this class is attempting to address (origin of the universe, nature of reality, nature of consciousness, etc.) are so huge individually that a comparative discussion in the course of one semester is bound to have shortcomings.  That said, there were many interesting readings, and Pollack's lectures are worth the price of admission.  This course has two professors: Pollack does the Western science and religion sections & Joe Loizzo does the Eastern sections.  Pollack is incredibly articulate, and makes even the most obstruse readings seem simple.  He comes to class well prepared, and his lectures have structured arguments.  This guy is really smart, and has fascinating ways of justifing his religious beliefs with his scientific ones.  Loizzo is clearly a less experienced teacher, and did not always succeed in bringing across his ideas.  He also focused mainly on Indo-Tibetan Buddhism, which I found far less interesting than the East Asian Buddhism and Taoism with which I was already familiar.  I could have done without all the 10th century Buddhist influenced, Hindu influenced, Indian philosophy, of which there was a lot and from which I got very little.  Perhaps others found these readings more enlightening though.  \nThis was the first time the course has been taught (fall '03), and it will doubtless be much better next time around.  But it got me thinking about  interesting stuff and was well worth taking.  The papers were very open ended, and could be based on only the reading from class if you wanted.  I did much better on both papers than I expected.      \nWorkload:\n5 page midterm  &  8-10 page final paper.  100 pages of reading a week.  But Pollack said if he teaches the course again there will be less reading and more writing. \n"
        },
        {
            "course_name": "Environmental Bio",
            "review_date": "November 18, 2002",
            "review_content": "\nVery knowledgable, very intelligent, very boring. Take notes, but don't worry. If you miss them the first time, he will repeat himself endlessly. Don't bother with a tape recorder.\nWorkload:\nThree exams, including final.\n"
        },
        {
            "course_name": "environmental biology",
            "review_date": "August 31, 2002",
            "review_content": "\nI love this man. His lectures will inspire you. Biology with an apathetic philosophical twist.\nWorkload:\nnormal. Go over his notes, and use the reading to help you understand them.\n"
        },
        {
            "course_name": "Molecular Biology of Disease",
            "review_date": "May 23, 2002",
            "review_content": "\nPollack is easily the best science professor I've had at Columbia. This class is a must for all pre-meds and Bio or Biochem majors. The papers discussed are really interesting, and he points out things that you never would've noticed on your own. He brings together many concepts that you've learned in other bio and chem courses (and after his class, you'll actually remember them).\nWorkload:\nFairly light. 2 short papers to read for each class (about 2 hours' reading) -- and since he randomly chooses students to present them at each class, you do need to read them. (But the presentations are really easy -- basically just an explanation of the figures -- and he takes over pretty quickly. Plus, you're allowed one \"pass\" per semester.) The grade is based mostly on an 8-10 page final paper - a sort of critique of a journal article of your choice. The assignment is a little vague, but it can definitely be written the night before for an A- or better.\n"
        },
        {
            "course_name": "Environmental Biology",
            "review_date": "April 21, 2002",
            "review_content": "\nDefinitely bring a tape recorder to class because Prof. Pollack talks really fast. Mostly because he has a ton of stuff he wants to cover in the alloted time period. The class itself wasn't impossible, as long as you kept up with the readings and went to class on a regular basis. I agree with the previous reviewer that some background knowledge in Chemistry and Biology helps but the Chemistry part isn't quite necessary as Prof. Pollack will go over it in class. The language of his tests can be a little confusing but if you've kept up with lecture and have done the reading you should be fine. Overall Prof. Pollack is one of the most through, organized, and receptive professors I've ever had. He's willing to go over the more difficult material a few times to make sure you understand it and is very receptive to questions both in class and during office hours. However, if you aren't a science major, you may want to try a different class as this one does require work, and is supposed to be similar to Intro to Molecular and Cellular Biology I. Other than that I would highly recommend Prof. Pollack and the class itself. \nWorkload:\nApprox. 2 Chapters a week of reading material. 2 Midterms and 1 Cumulative Final. Tests vary from essay - multiple choice.\n"
        },
        {
            "course_name": "environmental biology",
            "review_date": "April 17, 2002",
            "review_content": "\nThis man is exceptionally knowledgeable about the subject and he is full of wonderful information. He is a little intimidating and not very approachable, but don't worry, you grow to love him. He's like a grumpy teddy bear. His classes are fairly fast paced, depending on your science background. If you've taken some basic bio and chemistry, you're fine. Make sure to attend all lectures because his exams are mostly from there. Notes can get complicated, lengthy, and unfortunately the man has awful handwriting so you have to follow closely with the class. But you'll be amazed at the amount of detail you know by the end of it all. He makes it all very understandable, he will go over the difficult bits, and encourages questions all the time. I'd definitely recommend him for any class.\nWorkload:\n3 tests total, weekly recitation, pretty straight-forward although you should know the stuff. \n"
        }
    ]
}