{
    "prof_info": [
        {
            "prof_name": "Danielle Sedbrook",
            "prof_id": 13025,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "January 06, 2017",
            "review_content": "\nOrganic Chem Lab was difficult for me. However, if I didn't fully understand something in lecture, Dani and the TAs were helpful at explaining the concepts in their office hours. The quizzes were hard, and I did below average on the majority of them (and the averages were pretty low in general), but there are plenty of ways to gain points elsewhere, such as labs, lab reports, lab technique etc. \nThe content of both lab sections were pretty much the same, as I had some friends who were enrolled in the other instructor's section as well. Dani is a lighthearted person who cares about her students and genuinely encourages them to learn and think for themselves. She also tries to engage the students in her lecture, which is hard considering the class is 100+ people. If you're a person who likes this kind of teaching, I would take lab lecture with Dani. \nI believe the class was graded on a curve. Even though I did below average on the quizzes (which I studied a lot for), I managed to get an A in the class. I would not worry too much if your quiz grades are really bad. As long as you put in a decent effort in your reports and prepare for your labs, the TAs were pretty lenient with the grading. The one thing I recommend is to go to office hours if you don't understand something. Dani and the TAs were all really approachable and really good at explaining concepts. \n\nWorkload:\n4 hour lab + 75 minute lecture every other week + study time ~2-10 hours/ week (varies depending on whether a lab report is due or not)\n2 Lab Reports \nQuizzes (20 min each) \nLab itself: prep for lab, pre-lab worksheet, and turning in your work at the end of the period\n"
        },
        {
            "course_name": "Organic Chemistry Laboratory",
            "review_date": "December 10, 2014",
            "review_content": "\nDani (as she likes to be called) makes this class a lot more enjoyable and a lot less painful than it could be given the workload (see below...). She really wants you to succeed, though the quizzes at times may make you feel otherwise. Overall, I was expecting to hate this class given all the hype and it ended up being one of my best experiences at Columbia. Granted, as a postbac I had more time to attend OHs, work on lab reports, etc. I can see how as an undergrad with 5+ classes it could be a nightmare. The bottom line is, this class is much more work than you would expect from a 3 credit course, but you also get a lot more out of it than say, bio lab. If you prepare your schedule accordingly, you will be fine. Also, I cannot stress this enough, go to OH! It will save you a lot of time sitting at home spinning your wheels and probably ending up with the wrong answer. As for the mythical quizzes, if you do the practice problems, review your notes, and stay calm, you will be fine. The means are usually fairly low (~10/20). \nWorkload:\n4 lab reports (averaged ~15-20 hours each, but for some of them you have 2+ weeks so budget your time accordingly and make sure to leave time to attend OH). 8 regular quizzes and 1 final quiz. Notebook pages for every lab that take 1-3 hours each.\n"
        }
    ]
}