{
    "prof_info": [
        {
            "prof_name": "Oscar Barreto",
            "prof_id": 13110,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "V1102 Elementary Spanish II, C1201 Intermediate Spanish I",
            "review_date": "April 27, 2015",
            "review_content": "\nHe seems like the man. Nope. I took this class as a sophomore with a good understanding of spanish already, thinking it would be a walk in the park...overall it was, but it was so incredibly frustrating.  The class itself is so dull and you will learn nothing on any given day. (if you're pretty good at spanish overall take this class, don't do anything during it and you'll get by fine, if you have no knowledge and want to actually learn something, find another teacher).\nOscar is super nice and you can tell he wants to be a cool dude that is fun etc - at times he is and its great - but at other times nothing is conveyed in a straightforward manner, nothing is organized he can be a little rough and confusing, did I mention nothing is organized? There is also a lot of work to be done for such little reward.  Homework twice a week online, about 4-6 exercises each with about 7-15 questions, some multiple choice, most written, 4- one paged compositions, a project, midterm and final, a few short quizzes.  The list goes on. You'll become a work horse and won't learn anything either from him nor the work.  \nParticipation is a huge part as well and no matter if you participate he will always mark you down for not doing enough.  If you participate fine but only participate with your neighbor or those close to you, you will get marked down. No winning here.\nWorkload:\na lot \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "April 20, 2015",
            "review_content": "\nWhere do I start? I guess with the part that he's a huge fucking asshole. More assignments than any other Spanish class that I've heard about. Complete disregard for all of his students' well-being. He doesn't give even the slightest fuck about what you have going on outside of class. This is evident in the millions of assignments and ridiculous deadlines that he throws out. Fuck this guy. Stay the fuck away from him at all costs. Take Spanish with anyone else. \nWorkload:\nToo fucking much\n"
        }
    ]
}