{
    "prof_info": [
        {
            "prof_name": "Jennifer Mansfield",
            "prof_id": 4023,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Development",
            "review_date": "December 08, 2016",
            "review_content": "\nProfessor Mansfield is one of the nicest professors you will ever meet. She has such a calming presence and is truly angelic. I had her for both Molecular & Mendelian Genetics and Development, and in both courses she was so clearly passionate about what she was teaching and helps make everyone in the class be excited about the material. The content in combination with her teaching made this class my favorite class I've ever taken at Barnard.\nDevelopmental biology is an amazing field for anyone interested in genetics and molecular biology, but it also touches upon evolution and environmental effects. This course is also great for anyone hoping to learn to read scientific papers better. The material is very detailed but also interesting, and Prof. Mansfield is very clear about what she expects you to know. She emphasizes the concepts and understanding the material on a deep level as opposed to memorizing specific examples. Overall, she is just a really wonderful and extremely clear professor. \nThere is a textbook for the course but Prof. Mansfield will never test you on anything you didn't go over in class. The textbook is useful for when you want to look at something in greater detail for your own intellectual curiosity, but you won't spend hours a week reading the textbook or anything like that. You can definitely do well in this class by just studying the lecture material really well. \nWorkload:\nWeekly journal club articles (read the article and post a discussion question on courseworks)\n2 15-minute presentations: one going over a journal article, and one going over a next-steps idea\n1 midterm\n1 non-cumulative final that is essentially a second midterm but with an added section discussing a research article. \n"
        },
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "May 04, 2014",
            "review_content": "\nMansfield is a really great professor! She's SO nice and really loves to challenge her students. Take Genetics with her if you can help it! She makes this relatively dry subject interesting and really knows how to engage her students. It's not one of those read the whole textbook and all's fair kind of classes (thank goodness). She puts all that you need to know on her slides and even posts them online! You can tell she really cares a lot about her students. Only thing is is that her problems sets are really difficult. I recommend going to office hours and working on it with friends. Otherwise, the class is really interesting and crucial to your understanding of all other biology courses. Mansfield rocks!!\nWorkload:\nProblems sets every 2 weeks (5 total). 2 midterms. 1 final. Extra credit quizzes every few weeks.\n"
        }
    ]
}