{
    "prof_info": [
        {
            "prof_name": "Edward Lincoln",
            "prof_id": 12718,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Economic Organization and Development of Japan",
            "review_date": "May 23, 2016",
            "review_content": "\nConsidering the reviews below, I thought this was going to be a terrible class, but I wanted fulfill an econ elective and a global core. And honestly, for me at least, this class wasn’t bad at all. It was definitely worth it.\nThe midterm and final consists of short answer questions (just need to write a phrase or a sentence or two). These questions pretty much all came from the powerpoint lectures and readings (the slides discuss the readings, so you don’t need to do them). I thought this was pretty great- nothing confusing, you just need to read the lecture slides. Yeah it requires memorization, but so does every other class. In other econ classes, you need to memorize formulas, how to solve problems, and concepts. If you don’t like reading slides, then don’t take this class.\nThe guy below is complaining about it being an 8:40- no one is forcing you to take an 8:40. Just get a friend to sign you in if you don’t want to go, or alternate. You can sign in and leave or just go at the end of class.\nProf. Lincoln is very knowledgable and his interest in the topics is very evident. He does follow the lecture slides, but he definitely adds explanation and other information. I thought the material was pretty interesting; I learned a lot about the history of Japan and their economic progress. Yeah it sucks at 8:40, but you really don’t have to go.\nThe paper can be about any topic involving Japan and economics, whether modern or historical. You have pretty much the whole semester to write it, but you’ll probably write it a couple days before. But make sure to talk to Lincoln about your paper topic, because he’ll give you good feedback.\nFrom the guy below- “This class was literally the bane of my existence this past semester.” I can’t really see how this is possible; the class is just a straightforward midterm, final, and a paper. The attendance factor is annoying, but if you get someone to sign you in, alternate, or just sign in and then go back to bed, then it’s really not a big deal. Definitely worth it for double counting a class.\nWorkload:\nSee above\n"
        },
        {
            "course_name": "Economic Organization and Development of Japan",
            "review_date": "January 16, 2015",
            "review_content": "\nAVOID THIS CLASS AT ALL COSTS!!!!!! AVOID! AVOID! TURN AROUND! \nIf someone tells you this class is NOT THAT BAD, THEY ARE BULLSHITTING YOU. I like probably everyone else in this class figured it'd be worth the sacrifice to knock an Econ elective and a Global Core out with the same course, and how bad could it be?\nAnswer: really fucking bad.\nThis class was an exercise in torture, honestly. Prof. Lincoln is actually quite a nice guy, approachable, knowledgeable, but lectures are a fucking PAIN IN THE ASS. 8:40 am and you have to haul ass to Mudd, only to watch the prof read off his lectures and summarize the readings (so don't bother doing them) and contribute nothing that makes the lecture itself worth going to. And worse: he passes around an attendance sheet. Better hope you have a decent number of friends in the class so you can share the sign in process and never attend more than say 5 lectures total. I've always thought profs who pass around sign in sheets are too lazy to make their lectures worth going to -- I only skip classes that aren't actually helpful with the course material; I never skip lectures that are enjoyable or actually help me understand the material beyond my just reading the textbook/lecture notes on my own time -- and this course is a PERFECT EXAMPLE of this.\nThe exams are hard -- entirely open-ended questions in which you need to write certain terms in the answers to receive credit, or remember not just the specifics about what happened but what specific economists say about events (for example, easily could see a qu that is like, what did X economist think caused Y event; and the next qu would be, what did Z economist think about the same Y event), and partial credit is virtually nonexistent. The tests are based entirely on memorization -- of Japan's entire economic history from like the year 1600 to the present, AND what economists think about it!\nBulk of your grade comes from a final paper that everyone pretty much writes two days before it's due. You can pick any topic you want, as long as it's related to the course in some way, essentially. It's a good experience (especially in preparation of writing an Econ seminar paper) since no other Econ class I've ever taken/heard of requires a 3000 word analytical paper. But like everything else in this course, it'll blindside you. I skipped class for weeks and weeks and then had to pull an all nighter for the midterm, promised myself it wouldn't happen again, but it happened again for the paper and then for the final. That is all definitely my fault, but if the lectures/teaching had been worthwhile at all I wouldn't have felt like i was learning an entire country's history in a night before each exam. \nAlso prof is just weird. Collected all the final papers on the last day of class (as in like December 7) and said we wouldn't be getting our final grades until \"after January 7\" because he was \"going home to DC to spend time with his family.\" The TAs proctored and graded the final exams I am pretty sure and did a first read on all the papers. He commutes from DC for lecture every week so I doubly don't understand why it is that early in the morning, and he only holds office hours immediately before/after class.\nThis class was literally the bane of my existence this past semester. If you're convinced you want to take it, don't take it as a senior. By the third week of class I didn't even bother pretending I would try to show up for Thursday morning lectures. Many thanks to all my friends in the course who signed me in at least once (or in some cases over and over again) -- I owe you a meal.\nWorkload:\n20% midterm (something like 25 open ended qus)\n30% final (something like 40 open ended qus + an economic model question of some sort)\n40% final paper (2500+ words not including graphs)\n10% attendance \nNo problem sets which makes it impossible to keep up with coursework unless you have literally nothing else to think about. \nAs far as I can tell, there was essentially no curve. The numerical calculation of my grade based on the breakdown was <0.5% from the letter grade I received.\n"
        },
        {
            "course_name": "Economic Organization and Development of Japan",
            "review_date": "January 02, 2014",
            "review_content": "\nIf you like history and economics you'll like this class. It's not all that much work. All you really have to do is go to the lectures, sit back, and pay attention, which isn't that hard to do since the material is often really fascinating. Lincoln is an good speaker, and often provides interesting anecdotes from his personal experience working with the US and Japanese governments. \nThe class is sort of split up into two parts. The first part focuses more on Japanese history, with an emphasis on economics, mainly starting with the Meiji Restoration in about 1867 (with one class about the Tokugawa period from 1600-1867) and ending at present day. For this section, the reading is a bit more important than in the second half. It's also pretty interesting. If you pay attention to the lectures and do some of the readings, you won't have to do much work to prepare for the midterm. The midterm is just 25 short answer and one explanation of some economic model. He will ask some questions like 'What did X author say about Y', so be prepared for that. \nThe second half of the class is more economic-heavy. He basically reviews a number of economic topics, then applies them to Japan. We had a class on fiscal policy, monetary policy, exchange rates, etc. If you want to finally apply all of the economics you've learned at Columbia, you'll appreciate this part of the class. The readings get super technical in this part, and he does a good job of reviewing them in class, so I wouldn't advise spending too much time on them. The final just focuses on this section and isn't all that hard. It's just 40 short answer.\nOverall, I felt like I learned a ton about how economics is applied in the real world and about Japan; I really feel like I completely understand any article I read now about Japan's economics situation. Lincoln explains things really well, so it's easy to pay attention in class.\nAlso, if you're interested in finance, since Japan had to essentially invent a financial system during the Meiji Period, you'll learn a lot about the financial system and why certain institutions exist.\nI haven't got my grade back yet so I can't speak much as to the curve.\nWorkload:\nSome reading, midterm, final, 10-page paper about whatever you want\n\n"
        },
        {
            "course_name": "Economic Organization and Development of Japan",
            "review_date": "November 26, 2013",
            "review_content": "\nI know that most people went into this class thinking it would be a nice way to full multiple requirements at the same time, as this counts for economics department requirements as well as for Global Core requirements.  This class might look like a slam dunk from that perspective, but I found it unenjoyable to an extent that offsets any of these benefits.  It might have been more enjoyable when David Weinstein was teaching it, but Edward Lincoln has taken over the class since Weinstein became department chair.  \nProfessor Lincoln makes the point on the first day that this class is as much about Japanese history as it is about economics, as the two are substantially interrelated.  In my experience, this class was almost entirely historical, and the emphasis is on memorization rather than understanding.  For example, on the first day, he told us the three S's that explain why most of the western world cares about Japan: Sony, sushi, and Samurai.  He seemed almost disappointed on the first day that the class contained so many economics majors and very few Asian studies majors.  That's not to say there was anything surprising about this, as this class is listed a 4000-level economics class with several economics prerequisites, and the economics major is much more popular than any program in Asian studies.  He also had no idea that this class was a Global Core class, or what that requirement even was, which just seemed downright funny to me, especially since this was his second year teaching the class, as it seems like the audience of a class is the most important thing to know before teaching it.\nLectures tended to be very boring and monotonous.  I didn't really feel that he was teaching us so much as giving a presentation.  The only time he ever tried to involve the class at all was to ask if had been to or recognized some landmark in Japan, or if we knew about so recent Japan-related news.  Despite this, attendance was required and he passed around a sheet every lecture to take attendance.  He told us on the first day that if we weren't going to be able to make it to class due to some extenuating circumstance, we should let him know.  Then he told us that one time when he was teaching a class at another school, one student just stopped showing up after the midterm with no explanation.  He told us this in a way that suggested that he expected us to be shocked.  I don't think many people took well to this attendance policy, as I often saw people who had a list of five friends who they also signed in.  It wasn't rare that the back rows of the classroom were the first to fill up.\nWorkload:\nThe workload is identical to how David Weinstein ran the course, and the syllabus and powerpoint slides are copied verbatim from David Weinstein's class.\n"
        }
    ]
}