{
    "prof_info": [
        {
            "prof_name": "Frances Champagne",
            "prof_id": 3093,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Neurobiology of Reproductive Behavior",
            "review_date": "July 31, 2015",
            "review_content": "\nProfessor Champagne is terrific. She's extremely knowledgeable and keeps up with current research on every subject we cover, which makes for some interesting revelations. Always open to questions and does a great job of presenting some of the uncertainties and nuances that go into neuro research.\nObviously you're going to have some less-than-interesting presentations from your classmates, but it's a seminar, so what can you expect?\nWorkload:\n2 presentations, a short answer midterm, and a final 8-10 pg research paper on the topic of your choice \n"
        },
        {
            "course_name": "The Developing Brain",
            "review_date": "March 26, 2015",
            "review_content": "\nThis is a solid class for anyone interested in the neuroscience behind brain development. The first half of the course focuses on the neuroscience specifics and biological processes involved in forming the infant brain. The second half touches on a variety of issues related to brain development like parental substance use, epigenetics, abuse and neglect, and how life experiences can actually biologically change brain structures as well- especially during development. While the focus is on the infant and young child's brain, the course does cover some issues related to adolescence. \nProfessor Champagne is not an exciting lecturer, but she is clear, organized, and obviously very knowledgeable about the subject matter. She has power points for each lecture- though going to class is important since the power points alone are not enough to fully understand the material, and we followed the syllabus exactly, never veering off-topic or falling behind. You always had a clear idea of what her expectations of you were and where the course was going. \nOnly drawback, again, is just that Professor Champagne is not a very engaging lecturer, nor is the class incredibly exciting even though it does touch on fascinating topics. \nDefinitely recommend it for someone looking for a good introduction to various brain development issues who wouldn't mind being a bit bored sometimes. \nWorkload:\nshort answer midterm, multiple choice final, brief research paper on topic of choice, weekly readings that are not necessary though can be helpful in providing more background/info on the material \ncompletely reasonable \n"
        },
        {
            "course_name": "Neurobiology of Reproductive Behavior",
            "review_date": "May 12, 2011",
            "review_content": "\nI think Professor Champagne paid attention to the last couple of course evaluations she received because this class had a nice balance between her mini-lectures and student-led presentations on pertinent research papers. Overall the class was excellent and Professor Champagne was knowledgeable and kept things interesting. A background in Biology is nice to enrich the readings, but not at all required. In my opinion, the biggest downside was that 50% of the final grade was based on class participation which led to a lot of painfully forced comments and questions. Also, don't even buy the textbook - the midterm was 100% based on in-class material and you aren't tested on any material after the midterm. \nWorkload:\n20% midterm, 30% Final 10-page paper (review of 6 articles), 50% participation (present two research papers + attendance/discussion). Lots of A's\n"
        },
        {
            "course_name": "Neurobiology of Reproductive Behavior",
            "review_date": "April 20, 2009",
            "review_content": "\nI love Prof Champagne but her seminars are pretty awful.  I am genuinely interested in the material, too, and really wish it was more fun to go to class because it is hard to make sexual behavior boring...but she does.  Some of this is due to the seminar system in psych where students have to do presentations...but most of the students she accepts to the seminar have no ability to do a presentation so sitting through 2 hours of this a week made me want to just take a nap.  When she finally says a word or two it is much more enjoyable, but most of the time Prof Champagne just laughs to herself as her students say stupid crap and she twiddles her thumbs until she is done with her two hours of teaching. Take her lecture because she can't get control of a seminar class.\nWorkload:\n2-3 presentations, 10 page paper.  Reading.  Not hard work-wise but CLASS SUCKED.  And the whole point of a seminar is to enjoy class.  you shouldn't like reading the textbook more than sitting through a discussion...but i did.\n"
        },
        {
            "course_name": "The Developing Brain",
            "review_date": "January 16, 2007",
            "review_content": "\nProfessor Champagne is fantastic!  Her lectures are very thorough, direct and clear.  The textbook she assigned is very good and straightforward.  She is very helpful when you come to her office hours and she is genuinely interested in her students.  The subject matter is fascinating as well: first half of the lectures concentrates on the neurobiological aspect of the development and the second half - on the role of parents in development, developmental problems, i.e., on a psychological aspect of development.  I definitely recommend this course the the students who are Neuroscience and Behavior majors and who want to get a better idea of the brain development.  \nWorkload:\nA midterm, a final and a 6 page paper.\n"
        },
        {
            "course_name": "The Developing Brain",
            "review_date": "December 23, 2006",
            "review_content": "\nProfessor Champagne is a really good professor. The material is really interesting stuff and she does quite a good job of presenting it clearly so all can understand it. With that in mind, the first exam was alright - all free response. The final was 100 multiple choice, and VERY DIFFICULT. The essay assignment wasn't difficult but Professor Champagne is a very tough grader. I recommend the class, just be aware that the exams are more brutal than one is led to expect.\nWorkload:\n1 midterm of so-so difficult, One 8 page paper with tough grading, and one very very difficult exam. All lectures are posted online but it helps a lot to go to class for study varifications\n"
        }
    ]
}