{
    "prof_info": [
        {
            "prof_name": "Jonathan Voris",
            "prof_id": 12783,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 24, 2013",
            "review_content": "\nJonathan Voris was hands down the worst professor I've had in the Computer Science department (although I suppose I use the term 'professor' lightly here, because I believe he was a post-doc who was teaching Artificial Intelligence for the first time), and among the top 3 worst professors I've had at Columbia (which is surprising since he speaks perfect English).\nThe Good:\nThe first day, I was rather excited to be taking this course, because Artificial Intelligence is a subject of great interest to me, and I was pleased to find that Dr. Voris was very enthusiastic about the subject matter, and the first three introductory lectures, while sometimes rambling, were at least engaging. \nThe Bad:\nUnfortunately it was all down hill from there: it became incredibly difficult to determine what information from lectures was relevant. As a result more than half of the class stopped attending lectures (Voris began giving pop quizzes in class around 3/4's of the way through the semester).\nThe Ugly:\nProgramming Assignments: The programming assignments were long. I mean incredibly long. The assignments consisted of single page pdf files describing a task in vague detail. There were no suggestions for completion strategies (fine, you don't get these in real life) but more frustratingly, there was absolutely no framework given. The projects often required large amounts of infrastructure (e.g. coding of 5 search algorithms) before any part of the conceptually interesting portion of the assignment could be tackled (algorithm design, heuristic/evaluation functions). Voris was a hard-ass about deadlines, which is reasonable, although perhaps less reasonable was his choice to assign the 4th project and the in class final due 4 days apart. \nExams: The material on the exams was not very difficult, however the exams themselves were incredibly confusing. The midterm was almost as if he had never before written an exam, for practically every question it was difficult to tell even what the question was asking. On top of this, the TA's couldn't answer questions because only 1 of them could speak reasonable english, and the Professor refused to answer questions because he might give away the answer. The final was in class on the last day, and the questions were more clear, however the exam itself was pretty long and somewhat tedious in nature.\nMiscellaneous: The professor, in my opinion, had a patronizing tone throughout the class and routinely treated students as if they were stupid. On top of that he did very little listening and a whole lot of talking when students expressed their concerns. No review or example materials were provided for any assignments or tests. And, more of an annoyance compared to the rest of what was going on, the Professor would often engage in pointless discussions (read: arguments) with students about a very specific point of no importance that would last for 10-20 minutes.\nJonathan Voris is clearly knowledgeable and passionate about Computer Science, but in no way qualified to teach this course.\nOne Caveat: I don't know how much he changed the material from Professor Stalfo's version of the course. It is possible that the assignments and lecture notes were entirely the same. This does not change the fact that Voris was an insufferable asshole, who seemingly refused to listen to his students and insisted on wasting class time on pointless and pedantic arguments with students.\ntl dr: Course was horrible, Professor was horrible. If you value your time and sanity I recommend you steer clear (although I don't know if it is being offered again, so it's probably a moo point.) I give this course a 1/10.\nWorkload:\n4 Programming Projects: Incredibly unclear on the specifications, disorganized and time consuming. Unless you exclusively code in your free time you should get started sooner rather than later.\nMidterm: Incredibly simple material, incredibly confusing test. See above.\nFinal: In class final. Still relatively easy on the material, but still confusing and above average in length.\nTest Averages: Mid 60's\n"
        }
    ]
}