{
    "prof_info": [
        {
            "prof_name": "Muhsin Ali (al-Musawi)",
            "prof_id": 2605,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Islamic Context of a Thousand Arabian Nights",
            "review_date": "May 07, 2013",
            "review_content": "\nYes, Musawi is disorganized and sometimes it is actually a challenge to find the reading because it is not really clear on the syllabus what the reading and then you have to google it and hope it's the right translation...\nBut that being said, he is a really nice man (and he actually kind of looks like a teddy bear), and he really wants his students to learn. He is really accessible at office hours and very helpful. Which is really amazing, considering how famous he is (but actually in the Arab World, he is really important). I would recommend however, that this class only be taken by students who have some good foundational knowledge of Islam or you can really get lost. Musawi is very knowledgeable, but as someone once said, \"he is a wealth of knowledge-- with no index\". You really have to know what to ask in order to get the best responses out of him. \nThe class and the readings we read were really great and interesting, and a Thousand Arabian Nights is such a great read. And many of the supplementary readings were really great (especially the ones by more modern Arabic writers, playwrights, and poets). I'm actually going to read more of their works because of this class. \nSo overall, take this class. You learn a lot and literally everyone gets an A (unless you really screw it up, so don't). \nWorkload:\n1 intervention (which from my understanding, is like a paper or a presentation? I still don't really know). 1 presentation about a set of readings done for the class. And a 20 page research paper, which is graded really leniently. You learn a lot when writing and researching for it.\n"
        },
        {
            "course_name": "Arabian Nights in Narrative Tradition",
            "review_date": "March 12, 2009",
            "review_content": "\nThis class far exceeded my expectations, which were already quite high.  I had never before realized how rich the stories in \"The Arabian Nights\" are, how much we can learn from one single story.  I wish this class could have been two semesters long, for, although we covered great depth, there is still much more to be studied.  Prof. Musawi was excellent in his knowledge, presentation, and engagement of us as students. \nWorkload:\n1 final paper, 1 intervention, 1 presentation, class attendance and discussion\n"
        },
        {
            "course_name": "Andalusian Symbiosis",
            "review_date": "December 22, 2008",
            "review_content": "\nProfessor al-Musawi has taught a class like this before, and this comes across in his far-reaching knowledge of the material. He is slightly disorganized and he tends to get on tangents during lectures, but they are usually really interesting and end up being relevant in some way or another. Professor Grieve's matter-of-factness helped the class to move along and I get the feeling that with only Professor al-Musawi we might have stayed on Week One forever. He shone most when talking about literature, which is his area of expertise, and he didn't actually grade the material so I don't know how he is for grading. However, he is really nice and very knowledgeable. I enjoyed taking a class with him\nWorkload:\nLots of reading, two \"interventions\" which are basically short presentations and a 2-3 page paper detailing some kind of investigation into a topic from the reading, one short written response, one longer 35-40 minute presentation, a take home midterm and a final 20 page paper. All in all manageable, because it's only once a week, and really fascinating.\n"
        },
        {
            "course_name": "The Post-Colonial Arabic Novel",
            "review_date": "April 14, 2008",
            "review_content": "\nI had high hopes for this class based on some of the earlier reviews, but they were mostly dashed.  Musawi rambles quite a bit; some of his anecdotes are funny, but rarely all that illuminating.\nThe reading list was mostly good and was what finally induced me to take the course.  In that sense, I don't regret it, since I spent a lot more time on the reading than on the class, and we covered some important novels.\nOverall: boring class, good readings, not too much work; a good way to top off a schedule with other, more challenging classes.\nWorkload:\nReading: one novel per week, between 150 and 400 pages.  Plus one paper, one presentation, one critique of another person's presentation (delivered in class; usually no one in our class got to do this since after a single sentence Musawi would cut the person off and drone on).  You can skip the reading occasionally.\n"
        },
        {
            "course_name": "Culture and Power in Iraqi Literature",
            "review_date": "April 10, 2007",
            "review_content": "\nThe old man is nice, but beware, he will lull you to sleep. \nBoring, yes indeed. He drones on for hours and if you're smart you'll just nod your lil' head. \nI learned a little about Iraq, but not much. Easy A though!\nWorkload:\nOne 20-page paper, that's it. Reading is optional. A's for everyone!\n"
        },
        {
            "course_name": "Culture and Power in Iraqi Literature",
            "review_date": "October 31, 2006",
            "review_content": "\nMy favorite professor is Prof. Al-Musawi.  I don't say that just because he has such an engaging, helpful, and encouraging personality (though that helps!).  \nI say that because he is so intelligent, has such a command of the material, and the passion in his teaching translates into the most fascinating lectures and discussions.  I have learned so much in this class, not just about Iraqi literature, but what makes good literature in general.  I have learned more on literature from him than I have in countless English and World Literature courses.  \nThis course was immensely thought-provoking, challenging us to vicariously live through the trials that the Iraqis have lived through, and really helped us to better understand Iraqis as a culture and a people.  Given the Iraq War, this course was especially timely, and I only wish that those who thought of invading Iraq had taken this course.  The world might be so different today!\nAlso, Pro. Al-Musaiw is very diligent at responding to e-mails and making time to meet with students.  I would encourage everyone to take a class with him.  You will find yourself enlightened.\nWorkload:\n1 presentation, 1 review of a classmate's presentation, final paper 15-20 pages\n"
        },
        {
            "course_name": "Arabic Poetic Consciousness",
            "review_date": "May 20, 2006",
            "review_content": "\nA great course. Amazingly organized. Prof al-Musawi taught with love and passion and an enormous knowledge of the field. Prof. al-Musawi encouraged dialogue and argument to further students' critical responses and encourage their interaction through a pleasant mood and sweetness of vision that are rarely available in the academy. Like other students, i felt always after each session, i have learned so much from the method of teaching as well as the amount of material which has made me aware of Arab poetic sensibilties. A great professor and a great course.\nWorkload:\nOne major paper, a review, and a class discussion\n"
        },
        {
            "course_name": "Culture and Power in Iraqi Literature",
            "review_date": "August 25, 2005",
            "review_content": "\nI love this man--he is a fabulous professor and I am shocked that I am the first one to review him!  I loved going to his class--looked forward to it every week and always hoped to bump into him in between just to talk to him.  He is a sweetheart who cares greatly about his students and the material he is teaching.  He is so passionate about the subject (so much so that sometimes he goes into these long rants and tangents that lead to no where, but they're always interesting just the same) that you can't help but get drawn in.  He is also THE MAN when it comes to Arabic literature (he's oddly modest about it, though he certainly name drops--but it's hilarious to hear him say \"oh yes, and I had a beer with this super-duper-famous author and he told me X and the this other way famous and very prolific author told me Y).  He is the editor of the Journal of Arabic Literature, has written a great deal and, like I said, knows everyone.  Take a course with him--anything you can!\nWorkload:\nFor this course it was a book a week--it helps to do the reading but if you don't do it once or twice, it's not the end of the world.  We had 1 presentation and 1 paper to write.  I think everyone got an A\n"
        }
    ]
}