{
    "prof_info": [
        {
            "prof_name": "Carl Wennerlind",
            "prof_id": 613,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Merchants, Pirates, and Slaves, and the Making of Atlantic Capitalism",
            "review_date": "May 05, 2015",
            "review_content": "\nHands down, my favorite course of the semester. Professor Wennerlind knows exactly what he's talking about, and it is truly enjoyable to listen to him lecture. I'd come in even when I was sick, purely because I wouldn't want to miss out. He gave me a lot of insight into Trans-Atlantic relations and I really came away feeling like I had learned something and that it would stick with me.\nThe first half of the semester was an overview of the time period and the set-up for each of the different groups, the merchants, the pirates, and the slaves. It gave context to all the countries involved, from political to economic to religious reasons. The second half of the semester focused on these different groups of people. The most time was spent on the merchants, than a bit less on the slaves, then the least on the pirates. Professor Wennerlind tended to repeat himself a lot, but I think that was merely for emphasis rather than filling up time. \nThere was a heavy workload, with perhaps a hundred pages due per class, but it was a lecture style class, so while doing the readings enriched the lecture, they weren't necessary for your survival in class. There was very little class participation, though Professor Wennerlind would encourage it sometimes, and was very good at answering questions to the best of his ability. There were also three short essays, and one final essay, along with an in-class midterm and final. My only qualm with him is that while we were a class of around thirty students, he never bothered to learn anybody's name. \nOverall, I would definitely recommend this class, even to someone who did not have that much background in history. \nWorkload:\nOn the heavier side, a hundred plus pages of reading a night, three essays, one final essay, a midterm, and a final\n"
        },
        {
            "course_name": "Merchants, Pirates, and Slaves, and the Making of Atlantic Capitalism",
            "review_date": "January 22, 2015",
            "review_content": "\nI was looking for a course that could either fulfill the History or Cultures in Comparison requirements of Barnard's 9 Ways. Admittedly, the title of this class is what first intrigued me, and I'm no history major type person (far from it- I'm a physics major). Also that review where it states that they took this class for two reasons, the latter being to learn cool things about pirates (which you do). \nI stayed in this course purely because of Professor Wennerlind. He is an amazing lecturer. I will say that it is difficult to write everything he says, so I recorded all of his lectures for this course after the first class. This helps a lot when you are reviewing for the midterms and finals, because he sometimes answers the essay prompts verbatim during his lecture, and points to authors that answer the question as well. Very useful for when you vaguely remember an essay topic and wrote less than perfect notes on a certain day (please date all your notes if you are recording his class, it makes finding information so much easier) and suddenly you have a professor given summary of the topics you should hit from a lecture a month ago you don't remember too well.\nHe is very engaging, and knows little details about this course that is frankly stunning. He gives a lot of reading per week, but he very rarely asks about it in class. He will stop to ask people about ideas and topics during the class, to sort of bring student-input, but he is fast to make sure that a student doesn't go on an unrelated sort of tangent. \nIt's better to speak up only if you're sure you know what you're talking about. Which is intimidating sometimes, but only because you want to prove to him that you've gleaned some critical insight, if only to see him nod approvingly and bounce off of your work as a conversational jumping point. \nThis class is also remarkably low-key. I am not sure if all Barnard history courses are like that, or if it is just this one, but I enjoyed the relax nature of the actual class; where I can sit back and listen to a very-precise-with-his language professor speak about a subject he is obviously very knowledgable of and appreciates. \n\nWorkload:\nAround 100 pages or so of reading a week, but not checked very often if you read. Certain texts he will focus on for in class discussions like Equiano or Captain Singleton, but he will tell you in advance to make sure to read a certain text, so you better do so. Three movie/reading responses that I believe factor into your participation grade, since very few people would rise to the occasion to speak during class. You watch 3 different movies (1 on merchants, pirates and slaves individually) and write a reflection and connect to your reading. Don't be afraid to discuss more esoteric subjects on these and have fun. if it's interesting to you, it will be interesting for him as well. Not going to I wrote an essay on a text from 1882 I found 1882 while looking for \"cheese pirates\" (if you watch the pirate movie Treasure Island with Eddie Izard and Elijah Wood you'll understand why I pursued this topic; for the record I got a check plus plus on that response, despite him telling us that the \"grades\" were check minus, check, and check plus. Think outside the box). \nThere is one midterm and one final, and he gives the essays you will write for this a week in advance (or more). He gives you like five essays, says he will put three on the exam, and you write two (something like that). You write a total of 5 essays on the midterm and another 5 on the final, with more essay prompts on the final. You will feel crunched for time on the midterm, but don't worry. If you jot down an essay outline for what you don't finish you get credit. \nThere is also an essay due about a two weeks before the final. Think about your essay early and often. Please email him about sources because only good things happen when you can jump off of the work he sends you to. He is so helpful with this, and asks his coworkers. Pick an interesting topic that wasn't covered in class, or something you want to know more about.\nThis class is doable, trust me. I'm not a history person and I got a solid A, with A- on both the midterm and final and an A on the essay, and great participation. \nYou can do this class! Super interesting topic, work load not bad compared to what other classes are like, and the Professor is engaging. \n"
        },
        {
            "course_name": "Filthy Lucre: A History Of Money",
            "review_date": "December 23, 2014",
            "review_content": "\nProfessor Wennerlind is a fairly engaging lecturer. I was able to focus in his class pretty well and he obviously knows and communicates a lot about the topics we cover (especially the early history stuff). He also has a lot of cool/bloody/interesting anecdotes about specific economic developments.\nHowever, I had a really hard time getting through the readings -- some were informative and enjoyable, but most were extremely heavy and long. Doing the readings is really not enforced during the semester, but you need to know a lot of details for the exams, so I (and a lot of the other students, I think) ended up reading everything in the span of the 3 days before the exam. Not the most effective way of learning. I'd recommend trying to do more readings during the semester, you'd probably get more out of the course in general.\n\nWorkload:\ntons of readings (but no discussion or anything). 7 page research paper. pretty intense midterm and final.\n"
        },
        {
            "course_name": "Merchants, Pirates, and Slaves, and the Making of Atlantic Capitalism",
            "review_date": "February 12, 2013",
            "review_content": "\nI took this class with two hopes:\nthat I would get to examine the development of capitalism from a new and interesting angle.\nthat I would learn cool things about pirates.\nIt was extremely successful on the first count.  I learned plenty of cool things about pirates too, but I will warn you that of the three major sections of the curriculum (merchants, pirates, and slaves), the pirates section is by far the shortest.\nPerhaps more than anything, I learned about the development of concepts of race as we know it.  It is also a very human history class, with a lot of attention to the day-to-day reality of being a merchant, a pirate, or a slave.  I also learned about colonialism, democracy, creolization, the development of naval technology...I think there's something for everyone in this class.\nProfessor Wennerlind is a good lecturer.  He speaks clearly and conversationally, but isn't the best at soliciting class participation (though he tries) because he finds whatever is wrong about your comment and focuses on that, rather than reassuring you that other parts of your comment are right.  The plus side of that is that you as a student don't get confused about whether there is truth to what your peers are saying.  He gets a bit thrown off when there is a disturbance, like someone walking in late, but overall the lectures flow very well.\n\nHe is at his best in office hours, where his friendliness gets across.   He has respect for all of his students as fellow historians and scholars.  Definitely meet with him to discuss your paper topic.  He will point you to all the right sources, and offers to connect you to his colleagues on subjects of their expertise.  \nHe also has some great outfits.\nWorkload:\nAbsurd amount of reading which you can skim.  A midterm and final, for which he gives you a list of potential questions a few weeks in advance (a subset of the questions on the list actually appear on the test, and you get to choose which of those you answer).  A 5-8 page completely open-ended final paper.  Three short film reviews which I think figure into the \"participation grade.\"\nGrading is not too tough, and because you get exam questions ahead of time and get to meet with him about the paper there are no surprises.\n"
        },
        {
            "course_name": "Intro to European History: Renaissance to French Revolution 1500-1789",
            "review_date": "December 23, 2011",
            "review_content": "\nI would like to start off with noting that when I read the reviews before I wanted to take this class I thought it would be a piece of cake and it was NOT. I loved European history in high school and thought that this class would be interesting and a new take on Euro but that thought was a total fail. While Professor Wennerlind is pleasant to look at, his lectures were disorganized and kind of covered a bunch of things with no uniform guide. He assigned a million readings that were not necessary to do and the TA's SUCKED (try not to get Peter is you take this class). It really should have been an easy class, but I guess Professor Wennerlind knew that people didn't take it so seriously in the past and made sure to make the grading extra difficult. Overall, I was not impressed with this class at all. I came into Columbia wanting to be a history major and this class made me regret ever thinking about majoring in history. \nWorkload:\nA ton of reading. One 4-6 page paper where you have to go to the Met and pick a piece of art work. One 4-6 page paper on comparing Hume and Rousseau. (Both graded extremely harshly). One midterm and one final. For both he gives the essay questions and Id's in advance so you can outline but even if you know the information cold, they are graded very arbitrarily by your Ta's...\n"
        },
        {
            "course_name": "Intro to European History: Renaissance to French Revolution 1500-1789",
            "review_date": "December 20, 2011",
            "review_content": "\nThis may be an intro course but it's easily one of the best lectures in the Barnard history department. Wennerlind is engaging, funny, and surprisingly organized--despite his apologies for occasionally getting behind on material, we managed to cover a huge time period filled with major historical shifts in way that was thorough and that made sense. He even starts each lecture off with a little summary of the previous one. Readings are well-chosen and actually pretty interesting.\nThe best thing about the course is that it's targeted at first-years, but Wennerlind keeps it interesting for upperclass students too. He makes a real effort to tie in film clips and slides to his lectures, as well as the occasional Adorno reference. \nAll in all, a great course, especially for history majors looking to fulfill a requirement in a completely painless way. \nWorkload:\nMinimum. Midterm, final, one partner assignment involving going to the Met and writing about an object, one paper. Weekly recitation sections are pointless. \n"
        },
        {
            "course_name": "Merchants, Pirates, and Slaves, and the Making of Atlantic Capitalism",
            "review_date": "September 06, 2007",
            "review_content": "\nI don't know what the other person is talking about--the full title of the class is Merchants, Pirates, Slaves AND THE MAKING OF ATLANTIC CAPITALISM. A traditional history class this surely is not, and Wennerlind does not for a minute pretend it will be.It is a sort of economic history (it does, after all, have the word \"capitalism\" in the title), but Wennerlind incorporates novels and primary documents as well as the regular history textbooks. He takes pains to put together interesting powerpoints and tries to find films that the class will find entertaining. He always seems to have time for his students and takes a genuine interest in their concerns. That being said, he can get a little monotonous during lectures, but as English isn't his first language (don't worry, he is perfectly understandable, doesn't even have an accent) maybe we can cut him some slack. Not so great on the facilitation side, but as this is a lecture class, maybe that's not a bad thing.\nWorkload:\nA midterm and final paper, 5-10 pages, as well as easy final exams which he will give you answers to a few weeks in advance; all you need to do is study. Reading is on the heavy side and can be boring should you chose to do it, but he says everything you need to know in class.\n"
        },
        {
            "course_name": "Merchants, Pirates, and Slaves, and the Making of Atlantic Capitalism",
            "review_date": "August 06, 2006",
            "review_content": "\nWhen I signed up for this HISTORY class, I was unaware that Prof. Wennerlind was part of the economics department, a fact which might have discouraged me from taking it. Fortunately, I had no idea because the class proved to be pretty interesting. Professor Wennerlind is organized and concise when it comes to his syllabus and lectures. When he ran out of time for his lecture, he was always sure to pick up where he left off at the beginning of the next class. His lectures were always interesting (if nothing else, his quirky accent and manner of speaking kept me interested), but many of the readings  tended to be rather dense. You can get away with skipping some of them, as long as you know which ones you will be writing papers about. The paper topics were pretty straight forward and he is always happy to talk to students about them. He is a very fair grader and the exams were pretty easy if you study for them. He gives study guides with lots of questions on them, from which he chooses very few for the exam. This method forces you to really prepare, but I thought it was pretty decent of him to give a study guide at all. Carl Wennerlind is helpful, likeable, and humble. Overall, I would recommend taking a class with him.\nWorkload:\nAn unnecessarily large amount of reading, much of which should be skimmed, not read. Two exams of reasonable difficulty and two papers with very flexible and interesting topic choices.\n"
        },
        {
            "course_name": "Filthy Lucre: A History Of Money",
            "review_date": "December 27, 2005",
            "review_content": "\nI really did not enjoy this class at all. While I guess it was easy in some respects, the entire thing was done on a powerpoint project of which he sped through, explaining very little. In the beginning we repeated things over and over and over until I just found it unnecessary to go to class. I am a huge fan of history, but Professor Wennerlind turned me off to economic history entirely. He isn't very friendly, and not incredibly helpful when you email him. \nHe also is concerned in getting through his lecture, and not as concerned about whether or not the students are following it. He thinks everyone understands what he's saying, and just keeps on going to the next powerpoint page, barely giving you time to copy the notes. I was extremely bored and displeased with this class and found it hard to motivate myself to ateend, as did the rest of the 60 some-odd students of whom 3/4 did not show up except for the midterm and final.\nWorkload:\nmidterm and final (id's given as well as essays that are complicated and tedious), term paper (of which he hardly helps)\n"
        },
        {
            "course_name": "A Revolution in Culture",
            "review_date": "December 29, 2004",
            "review_content": "\nThe object of this course seemed to be to investigate anything and everything about London in the 1700's.  While we did learn some things about the way people lived and their institutions (very important vocab), a lot of the information became a defunct muddle.  The novels were readable, but the articles and writings of historians and eighteenth-century scholars were usually the source of the trouble.  These latter texts came from the infamous readers that we were periodically forced to buy or copy.  The ideas and concepts that Professor Wennerlind seemed to expect us to glean from these writings were completely lost on most to all of the class.  Frequently the readings would be followed by a crash course in some facet of economics- a lesson that would have been helpful before the reading was assigned, perhaps, and the content of which remained incomrephensible to many of us.  Most of the classes were student-led, which seemed more like a way out of finding ways to make the material interesting than anything else.  There were some isolated, interesting moments and a couple of fulfilling classes knowledge-wise, but nothing managed to justify the way I dreaded going to this class.  \nWorkload:\nA few novels, 3 fun-filled course readers (/sarcasm) + 100 photocopied pages, 3 6-page papers, one class-long presentation on part or all of a novel/reading\n"
        },
        {
            "course_name": "Intro to European History: Renaissance to French Revolution 1500-1789",
            "review_date": "December 21, 2004",
            "review_content": "\nProf. Wennerlind taught this as a joint course with Prof. Plaa. He taught the second half of the course and had his own teaching style and paper assignment. Compared to Prof. Plaa's half of the class, I definitely learned a lot more from Prof. Wennerlind. His lectures were more structured and more relative to the paper assignment and the final exam. You actually had to be at the lectures if you wanted to do well on the paper and the final. It seemed that, unlike Prof. Plaa, Prof. Wennerlind's material was much more useful and clear in terms of understanding the general scope of the era. \nUnfortunately he tended to expand on too much in certain parts of the lectures, so they always ran over class time. Towards the end of the course, he rushed through the Scientific Revolution and the Enlightenment, which were probably the two movements I was most interested in coming into the course, so that disappointed me.\nI definitely found his paper assignment to be extremely insightful and educational. We had to read a book about the slave trade through the voyage of a French slave ship and then compare their practices to the ideas of the Enlightenment about luxury and social discipline. It was a time-consuming but very worthwhile assignment. I really enjoyed it.\nOverall Prof. Wennerlind is a really nice and knowledgeable professor. He's not bad to look at either. I would definitely take one of his classes again.\nWorkload:\nWeekly Recitations with TAs, Two 5-7 page papers, Midterm, Final.\n"
        },
        {
            "course_name": "A Revolution in Culture",
            "review_date": "November 10, 2004",
            "review_content": "\nThis class seemed normal enough when i was picking it...but i knew it was all downhill the first class.  I have no idea what the class was actually about because the reading was incomprehensible and when you could decode the meaning excrusiatingly boring.  The discussions were student-led, which is a code word for disorganzied and filled with frequent awkward silences.  The papers were graded completely arbitrarily, so it doesn't make any sense to spend any actual time working on them...he'll probably hate it either way.  The only way to suceed is to mercilessly kiss ass...its what he responds to best.  he makes you buy three course readers at random points throughout the semester-\nthe readings are horrible and only one person will actually do them so don't waste your money and let that one sucker in the class answer his inane questions.  He'll ask for feedback during the last class but don't be fouled..he'll cut you down for any minor criticism.  In a class of about 12 at least 5 people burst into tears due to his insensitivity and general assholishness.  Avoid this class like the plague-which may have been the topic of some of the reading if i'd actually done it\nWorkload:\n3 6 page papers-and about 100 pages of reading a week, but no one does it so don't worry\n"
        },
        {
            "course_name": "A Revolution in Culture",
            "review_date": "September 05, 2004",
            "review_content": "\nI decided to give myself the entire summer to recover from this class in order to write a rational review. I myself was one of the poor, unsuspecting souls who read the class description and said to myself, \"swell looking class.\" I'm going to make a wild guess that this course will not be offered again...hopefully ever ever ever.. Nice guy though...if you're making small talk after class or passing on the street. He jogs a lot.\nWorkload:\nagh. agh squared. I don't think i've ever willingly muddled up my brain as much as some of the readings he assigned did.  Oh, and he may have you completely redo a paper by mere whim. Many tears shed. Don't allow yourself to procrastinate either...\n"
        },
        {
            "course_name": "A Revolution in Culture",
            "review_date": "August 21, 2004",
            "review_content": "\nNot. Good.\nFailed attempt at an inter-disciplinary course. Mangled love-child of english and economics looks a lot like Carl, and Carl's biases, and Carl's uncompromising squint, andÂ… It may have looked good on paper, but was awesomely-bad when worn, erÂ…as a class.\nTypical class involved a student leading the discussion, having been coached by Carl beforehand, which means a lot of heavy silences when the discussion was not going Carl's, I mean. The Right. direction.\nYou're smart so you know where this is going. 3 6-page papers.  If you want a good grade.  Just do it: Carl's Way.\nHe likes class participation because without it, it would just be 1:25 min of awkwardness.  Oh wait. Even with intelligent, funny comments this class was Dark Dark Torture, which also goes by the title of A Conspiracy of Papers by David Liss.\nMy advice if you decide not to stick it to the Man.  Take notes on skills of grade-grubbing classmate #1, 2, and 3 rather than on mispronounced big words during lecture.\nAlso. Please protest Carl's lack of environmental awareness and apparent disregard for the low-budget of students.  He makes you buy 3 readers.  Courseworks 101, Carl.\n\nWorkload:\n3 6-page papers. Discussion leader for a day.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "May 14, 2004",
            "review_content": "\nVery fair professor. He's really nice. Holds a review sessions and gives last year's exam as a practice exam. Very nice as well. He really likes applying what he teaches to real life, so it's always good to know the current conditions of the economy for any exam. On the final, he made us read two short article on the economy and then asked us essay questions on them.  Go to his office hours and get to know him. He'll remember your name and it matters!! When he knows you and sees that you're a good student, he may grade you in a more lax manner. Overall, good class. The class is much smaller than some intro classes at columbia. I thought this class was much more understandable than the Principles of Econ i took with Brendan O' Flaherty at Columbia. \nWorkload:\nManageable. Overall 5 problem sets. Midterm and Final. He holds review sessions and gives practice exams for both. Also, the TA holds review sessions. Do a lot of problems to prepare for the exams!! \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "May 13, 2004",
            "review_content": "\nI'm not exactly sure what the last person was talking about.  There was absolutely no math in this class unless you consider high school (or middle school) level algebra to be math.  While the textbook isn't the most exciting thing  I've read this semester (you also don't really need to read it, let alone the study guide), we also got to read a really good and interesting Stiglitz book.  As a Columbia student who's taken Columbia econ classes, Wennerlind's approach to the subject is really fresh and exciting.  I highly recommend this course to anyone interested in learning about basic macroeconomic policy issues facing our country.\nWorkload:\n1 midterm, 1 final, 2 group projects, 5 problem sets.  The group projects were really the only bad part of the class.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "April 26, 2004",
            "review_content": "\nProfessor Wennerling is extremely interesting in class and the course seems fun from the beginning but when he starts drawing graphs it becomes a pain in the neck. \nTake this class if you are good in math and like boring books, because the assigned book was tough and very unclear. \nHis group projects take a lot of time and homeworks are boring, although they help to revise the material for the exam.\nOverall not bad but beware, the exams are challenging.\nWorkload:\n2 group projects with graphs and essays, 5 homeworks, challenging half multiple choice half essay inclass midterm and final\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "May 12, 2003",
            "review_content": "\nHe's a good professor. In my class, he gave a lot of group projects. So if you don't like group work, you might not want to take him. One good thing, we did not get pop quizes!\nWorkload:\nNo homework collected except the group projects. However, make sure you read the book and do problems in the study guide. \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "May 12, 2003",
            "review_content": "\nThis was a really cool class to take because it teaches you quite a bit about economics in one semester.  I went into it knowing absolutely nothing about the economy and yet had no problems with understanding the materials. Professor Wennerlind is really nice and keeps the class interesting with his witty (albeit sometimes corny) sense of humor. \nAlthough he does have a tendency to add his personal opinions in about theory, policy, etc---it makes the class interesting and adds a different viewpoint.  The reading isn't necessary at all because his notes are quite comprehensive.  While it's clear that he knows the material he's covering, he does tend to skim over important things rather quickly sometimes leaving you feeling lost and confused. But he has a habit of repeating things from class to class so that helps to clarify things. And if you still have trouble understanding he is always available in office hours and is quite approachable, although he is sometimes awkward in interaction.\nWorkload:\nThis semester he gave us 3 problem sets (the 3rd of which he tacked on right at the end of the course because he forgot to assign in earlier), 2 midterms, and 2 projects (the Fed Warm-up and the Fed Challenge).  Not bad at all. Although he is known for pop-quizzes, he gave us none.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "August 15, 2002",
            "review_content": "\nreally very enthusiastic professor. keeps it interesting. he always goes over what he taught in previous class in beginning of class. so if you realized during reading that you didn't get something he'll be more than happy to go over it. he goes at a slow-medium pace so it's easy to follow along. pretty good prof. gives partial credit on exams for just writing down the correct formula ! so make sure you know them !!\nWorkload:\n4-5 problem sets, one midterm and one cumulative final\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "January 06, 2002",
            "review_content": "\nGreat teacher, Hard Hard class, this is not the class you want to take if you really don't find the material that interesting... He is great to look at that is certain , however expect a heavy workload to achive success... take it pass fail for a fun class or expect to do 2 hrs each day for a decent grade.\nWorkload:\nPop quizes, a few problem sets, two midterms and a final... a lot of work.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "December 17, 2001",
            "review_content": "\nI really enjoyed this class. I feel like I have a better understanding of the economy which is cool, and the material was challenging but logical. Wennerlind is a great guy. He is relatively funny, understanding, and accomodating. The only problem is that he is a little unclear when he teaches. You really have to keep up with the reading in order to be able to follow in class. But the book is really good, so it's not so bad. Added bonus: he's really good looking.\nWorkload:\n3 problem set homeworks that you can do with a group, 6 \"pop\" quizzes that he usually hints at and require minimal review, 2 midterms, one final.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "December 15, 2001",
            "review_content": "\nAlthough he did make an effort to disguise his own personal opinions on the subject matter, his standpoint was fairly clear. As far as papers were concerned, I think he happens to be one of those teachers who only gives A's to people who tell them what they want to hear. It seems there is little room for creativity. In some senses this is beneficial, because it is clear how you should write your paper, however, in at other times it is problematic. I will personally never take another class with this man again. I would advise the same if you value a teacher who respects his/her responsibilities as a professor and who respects your responsibilities as a student.\nWorkload:\nCompletely reasonable. For the most part, I have nothing to complain about as far as material is concerned.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "November 10, 2001",
            "review_content": "\nWennerlind is not a good professor, but probably better than most. In the beginning of the course, he blamed several students for asking too many questions (this was true) and we didn't get through a lot of the stuff. Of course, this was partly his fault too, for fielding too many questions. As the course went on, we still had problems, or rather he had problems getting through the material in class. He oversimplifies the course material and while this is in some cases good, in this class it is not. Not only does he take too much time explaining the material and oversimplifies it, he gives additional material--the history of the U.S. economy, so that it becomes impossible to get to the important material that is actually hard to explain, and that is on the test. His tests are difficult in comparison to the way he explains the material, so he is very misleading. As other reviewers have advised, make sure you do the study guide! He's a really nice guy most of the time, but he really oversimplifies many of the concepts and doesn't really get to the important ones. For example, he gave us a problem set due and a pop quiz on the Monday before our midterm. (He did this for both midterms, btw.) He also, as I said above, teaches the last two chapters the monday before the exam, and then provides a huge and very vague essay question on them. Overall, he may be better than the alternatives (check the reviews of the other professors), but that's not saying much.\nWorkload:\nSix pop quizzes (usually given right before the exam because he forgets to give them until then) Three problem sets, two midterms and a final.\n"
        },
        {
            "course_name": "The Theoretical Foundations of Political Economics",
            "review_date": "May 10, 2001",
            "review_content": "\nThis is a pretty easy class. You don't need to do the readings if you go to class. You read Smith, Marx, and Keynes. But Carl loves Marx, so he spends most of the semester talking about Marx...make sure you write what Carl thinks on the papers...he doesn't hide his political views at all. Short papers, only about 4-5 pages each, and they're basically summaries of what the thinkers said. Not a bad class, enjoyable, and Carl's really nice and approachable. Easy A if you write what Carl wants you to write.\nWorkload:\n3 short papers (4-5 pages, and one on each economist), final, short presentation (which essentially counts for nothing)\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "April 22, 2001",
            "review_content": "\nWennerlind is nice, funny, and fair. One thing that really bugged a lot of us: he is not good at hiding his personal partialities when it comes to politics and political economics. Though he will not come right out and say what he thinks, it is in his tone, right beneath the surface of his words. This was annoying, especially since you couldn't argue back if you disagreed, because it's an economics class, not a philosophy class. Also, many thingsmare not clear in class unless you have read the book beforehand. Overall good class, though.\nWorkload:\nsix \"pop\" quizzes, three homework assignments, three midterms, and a final\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "April 21, 2001",
            "review_content": "\nWennerlind is a sweet and funny guy. Problem is, he's not much good at teaching. Course starts off fine and easy to follow, but when the material turns difficult, Wennerlind is not very good at explaining it. As an economist, he probably knows the material, but he cannot seem to transfer it from his brain to the students'. Class is not boring; Wennerlind keeps it light and entertaining, but the material can get heavy, so you'd better keep up with the reading where he comes up short but I guess that's a requirement in every class. One drawback - he's a fan of pop quizzes.\nWorkload:\nSix \"pop\" quizzes, three homework assignments, three midterms, 1final, and group presentationsof current economic events.\n"
        }
    ]
}