{
    "prof_info": [
        {
            "prof_name": "Alexander Gil",
            "prof_id": 13126,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 04, 2015",
            "review_content": "\nBeware of this class.  I'm not going to say take it or don't -- just know that this section is not for everyone.  The class is basically a debate class, so if you like that sort of thing then this is the CC section for you.  If you prefer a class where you will learn about the themes and complexities of the texts (which, in my opinion, is the point of CC) take someone else.  The basic setup of this class is this: every class period, students are required to come prepared to speak about a short passage (like 1-3 lines) and pose an opinion on that passage, at which point the class becomes a discussion over the various opinions about that passage.  Alex doesn't seem to prepare for class at all because, honestly, he doesn't need to since the entire discussion is dictated by the passages students pick and the opinions formed about them.  The workload is very different from most other sections with the blog posts and C3 experiment (explained below), but neither the syllabus nor Alex himself were ever very clear about requirements, so there was a lot of student discussion outside of class just trying to figure out what was required from us to get a good grade, which was insanely frustrating.  I felt like this class was a waste of my 2 hours 2x/wk, but I know there were students in the class that really enjoyed it so maybe it's just me.  Just know that this is not a traditional CC class in that you will not even attempt to unpack what the text is saying -- you will only talk about very little snippets at a time.\nWorkload:\nNo midterm or final (the only reason I even stayed in this section but I'm honestly not sure it was worth it), 6 blog posts between 400-600 words arguing something about the text, 1 context post on the blog (5 headlines and 5 cultural artifacts contemporary to the text as a way of providing historical and cultural context), participation in C3 Experiment (an online blog with 2 other CC sections that opened 3 different times throughout the semester where you pose opinions about a given topic, then for each of the 3 there's an optional meeting with the 2 other sections where you discuss the topic), and a final paper 6-8 pages long\n"
        }
    ]
}