{
    "prof_info": [
        {
            "prof_name": "Walter Neumann",
            "prof_id": 506,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Topology",
            "review_date": "January 10, 2017",
            "review_content": "\nI would not call this class a success. Neumann had trouble proving any non-trivial theorem successfully; he almost always failed to finish the proofs, and had to revise them later or refer us to the book. This is very disappointing, as the whole point of a math lecture is to prove theorems. At times, he attempted to present topics that are not standard to an intro topology class, for example, CW complexes, the classification of 2-surfaces, and ultrafilters. These lectures were interesting, but felt out of sequence; I was not prepared enough to get much out of them. By the time we got to algebraic topology, lecture was spent on excessive examples of graphs, their covers, and their fundamental groups. This was not very conducive to learning the material as he did not effectively connect the examples to the relevant theorems.\nWorkload:\nThe course followed a few chapters in Munkres fairly closely. The homework was weekly, fairly easy, and varied greatly in length, though it was always graded forgivingly. The midterm was easy, and the final exam, though long, was reasonable.\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 19, 2014",
            "review_content": "\nModern Algebra 1 with Professor Neumann was a pleasant and fairly easy class (and I say that as a CS major -- math majors presumably breeze through), although it may be tougher in semesters where one particular student doesn't hold up the entire class with dumb questions.\nNeumann prepares well for lecture, doesn't make mistakes, and is reasonably engaging. He only kinda-sorta follows the textbook (Dummit & Foote) which can get frustrating at times, but normally he's just skipping the toughest material. \nHe'll often provide lecture notes along with the week's homework assignment, and the homework often consists of things that are proved in the book, so just digging about a bit will give you the answer. That said, it's worth doing the homework to make sure you're familiar with the material.\nWorkload:\nWeekly homework (25%), 2 midterms and a final (25% each)\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "December 01, 2013",
            "review_content": "\nWalter Neumann is a really approachable professor who will take time to help you out if you do not understand class material. His exams clearly follow his notes and if you study hard enough, you can scrape by with at least a B regardless of your level of ability. \nEach problem set he assigns comes with an Extra Credit problem, and if you rack up enough of those (provided you answered them correctly) I think your grade can get bumped up by at least 1 threshold (think B to B+, B+ to A-, etc)\nModern Algebra I and II are hard. They demand your time and attention, and Neumann explains the subject well.\nMy only criticism of Neumann is this: he seems to base his lectures on the Dummit & Foote book, but does not follow the book explicitly. This drives me crazy because, having read the book as a study aid myself, I can say that the book is an ENORMOUS help to those who have trouble with M.Algebra, though Neumann seems to dismiss it.\nI say this is a 'criticism' of Neumann because the way he explains things is not for everybody, and it would've been very helpful to a lot of students in his class to have followed the book, instead of simply trying to absorb Neumann's notes, hoping for the best.\nWorkload:\nWeekly, routinely challenging, 5-6 question problem sets with an extra credit problem (do yourself a favor and do it)\n2 midterms, sort-of-cumulative final\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "January 13, 2009",
            "review_content": "\nThis class was a never-ending source of stress and a major contributor to a moderate depressive episode for me.  It's a 2 semester sequence, and the first semester was a lecture of about 60 kids.  Second semester, we were down to about 10.  I know that a lot of people like Neumann a lot, and he is basically a nice guy who is pretty approachable, but in general I found his lectures to be quite vague.  He didn't state definitions or theorems clearly enough, and often returned to a concept later in the course using a slightly different formulation.  Expectations and grading were also not clear enough.  Second semester's midterms were not scheduled until the week before they were given, and even then only after I asked 3 class meetings in a row when they would be - although he did let the class choose the dates.  Neumann does seem to be a major proponent of grade inflation, however: first semester, I failed the second midterm and still pulled through with an A, and second semester my homework grades were dismally low (enough to make me take the pass/fail option) and I ended up uncovering the grade.\nWorkload:\nWeekly problem sets (which can be very difficult), 2 midterms, and a final.\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 24, 2007",
            "review_content": "\nProf Neumann is the best.  Really.  He is always willing to help you out: answer questions before, during and after class and meet during office hours or at another time.  He even scheduled an office hour every day of reading week to answer our questions before the final exam.  He's also very pleasant and never makes you feel stupid, even if you are completely ignorant about a topic.  I came to appreciate and love theoretical mathematics by taking this class.   \nWorkload:\nweekly problem sets.  2 midterms and a final.  one piece of advice- after looking at the problem sets and trying to solve them on your own, GO TO THE MATH HELP ROOM.  The people there love math and especially proof based classes like modern algebra.  They will help you with your homework and also help you get a much better understanding of the material in general.\n"
        },
        {
            "course_name": "Fourier Analysis",
            "review_date": "March 01, 2007",
            "review_content": "\nA very interesting and well-taught class (as math classes go). Dr. Neumann has a real knack for explaining complex problems, attacking them with rigor, and solving them with thoroughness.  You will very rarely, if ever, hear Dr. Neumann utter the dreaded phrase \"I leave the details as an exercise\" when half-way through a complex problem. \nThe material itself is somewhat difficult, but the quality of the instruction and the book made it worthwhile.\nWorkload:\nWeekly homeworks that were often quite hard and time-consuming, but generally enough fun that I didn't mind spending the long hours required to complete them.\nMidterm and final. The material tested was quite a bit easier than that on the homeworks, though both tests pressed me for time.\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "February 10, 2005",
            "review_content": "\nGreat professor, great class.  Though his tone and accent are a little too soothing, he's very clear and understandable when teaching, both in diction and in content.  More importantly, he's incredibly accessible outside of class.  He will recommend other books if you don't like the textbook's approach, explain things several different ways until you're able to explain them to him just as well, and give leading hints to tricky homework without giving away the farm.\nHe's a very understanding guy, and when I lost confidence in what I was doing towards the end of the semester, he wasn't a jerk when I'd go into his office with my homework done and say, \"I did this, and it works, but I'm not sure how or why.\"  To me, it seemed like he really wanted all of his students to understand what they were doing, not just mechanically churn out repetitive proofs week after week.  In case you couldn't tell, I really liked Prof. Neumann and wish more professors were as devoted to teaching as he is.\nThe material itself is interesting if you have the slightest logical leaning.\nWorkload:\nReasonable for the course.  Homework assignments ranged from quick  to a couple of hours, depending partially on how comfortable you were with what you were doing.  Some people prefer to work on it in groups, but I did fine on my own with the occasional visit to Prof. Neumann's office.  The tests were fair, but easy to make stupid mistakes on the 20 true/false questions on each test if you weren't really paying attention.  The rest of the tests were 2-3 (not terrible) proofs and another multi-part question or two about some of the short-answerable material (basic examples: which group does this table represent, find all of the subgroups, interpret this digraph, count the symmetries, etc...)\nI found the final a lot easier than the midterms, as it was very similar in structure and content to the sample midterm he gave to the class and I was never sure what to expect on the midterms.  In retrospect, though, he didn't spring any surprises on us.  If you get mostly perfect homeworks and stay reasonably above the medians on the tests, you'll be fine.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 20, 2005",
            "review_content": "\nProf. Neumann is a calm professor and unfortunately, this can regularly put you to sleep during his class. This isn't realy an issue, however, because if you keep up in the book there is really no need to attend lecture, as he merely reviews the material and does examples. All in all a fairly easy grade if you keep up in the textbook.\nWorkload:\nWeekly problem sets (3-4 problems with multiple parts), midterm, final\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "January 02, 2005",
            "review_content": "\nA very good professor, knows his material very well, can lecture without notes, and is never stumped by a question. A required course for math majors, but not a bad one. Group theory is quite interesting.\nI would recommend this course even to those who do not have to take it. (Computer Science majors, for instance, would find it very applicable)\nWorkload:\nBasically, the first 2/3 of the semester are trivial, the last 1/3 is hard. This is reflected in the weekly problem sets (the first 2/3 are really easy, the last few are quite difficult), and in the exams (the midterm is a snap, the final is tricky, though fair). \nMore complex proofs on homeworks are always accompanied by hints, and nothing too hard is asked to be proved on exams.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 24, 2004",
            "review_content": "\nI liked Neumann a lot. He's not a fabulous lecturer but in class he presents the material clearly and in an organized fashion, so if you go to class you don't have to read the textbook. He's an extremely nice guy and helpful if you're having any problems. His midterms and finals were very easy, requiring only basic manipulations and understanding of the material. I would highly recommend taking Calc III with him if you can.\nWorkload:\nOne problem set a week, two midterms and a final- all fairly easy with a generous curve.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 15, 2004",
            "review_content": "\nI think that the other reviews on this page have been pretty unfair to Prof. Neumann.  He is an extremely warm man who loves the subject that he teaches.  I've never experienced any sort of disorganization on his part--the syllabus and all of the problem sets are posted online (pretty straightforward, if you ask me), and the sets are always graded and ready to pick up within a week of turning them in.  His TA is definitely a difficult grader, but Neumann himself does not seem to be so harsh (he graded my midterm, and I didn't get points taken off on a couple of questions that the TA graded wrong on others' tests).  I understand everything he teaches us in class--there are plenty of examples, and he will stop to answer questions.  He is probably one of the only Calculus III teachers who speaks English without a horrible accent (his is British--very easy to understand).  Additionally, his exams are (so I've gathered) the easiest out of the entire Calc III department--most of the questions are easier than those in the assigned book work!  I would absolutely recommend taking Neumann for Calculus III.\nWorkload:\nOne problem set a week (~3 multi-part problems)--drops lowest two or three, two midterms (easy), one final\nBookwork also assigned--helpful in studying for exams, not checked/graded\n"
        },
        {
            "course_name": "Modern Algebra",
            "review_date": "August 30, 2004",
            "review_content": "\nAn execellent lecturer and a man who truly understands the field of algebra. It wasn't until the end of each semester that I understood how solid Neumann's lecturing style was. The true test that he passed is that he presents the material in an order and in a fashion so that the proofs of theorems and propositions are almost blindingly obvious. The notes that you will get from this class will be amazing. The course text, Fraleigh, that we used was utterly horrible; however, if you would like to learn from a better text, choose Algebra by Artin. I wouldn't spend too much time with a text, but rather with his notes. Another plus, Neumann is British and he has a pretty cool accent and speaks immpecable English. Finally, unlike most math professors, he is rather personable and approachable, but does tend to space out during conversation from time to time.\nWorkload:\nRead his notes. Problem sets each week that can vary in length, anywhere between 3-4 hrs usually. Two midterms and a final. No surprise material, just study and you'll be fine.\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 14, 2004",
            "review_content": "\nThe subject material is very, very interesting.  The professor is very, very boring.  However, the textbook you use is enough to learn everything for the course- you DO NOT NEED to go to class.  You just need to go to hand in homework and take tests.  The subject is still worth learning even if you just read it out of the book.  The professor is very, very, very, very boring.  The tests and grading are very fair.\nWorkload:\nWeekly problem set (not too hard, just hard enough to be interesting).  They are doable in 2-3 hours (or less if you work fast).  Two midterms, a final, all pretty fair.  \n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "May 14, 2004",
            "review_content": "\nProfessor Neumann means well. He's a nice guy who wants us to learn algebra. Unfortunately half the class never comes to lectures, and the people who come are all dozing off. Neumann is a mediocre teacher - not excellent, but he knows his stuff, knows English, and tries. I was a bit sad that though he was available for office hours and such, he wasn't very helpful - not wanting to just tell me the answers but also not really being good at indepth explaination, he pretty much gave me a slight hint and told me that I'll get better at it if I keep at it. He paces a lot during lecture, which is kinda annoying. The tests are pretty fair (not easy mind you, just fair)- the homework is very time intensive and hard. Personally, I spent a lot of time in the Math helproom, and I saw A LOT of our class there on a regular basis hehe. He grades according to what you did - he won't screw you, but also won't inflate your grade. \nWorkload:\nlong problem set every week, two midterms and a final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 24, 2003",
            "review_content": "\nI generally agree with the other reviews.  Neumann's pacing will get on your nerves, and he doesn't explain things well.  If you can't learn from the book, or haven't taken Calc IIA concepts before in high school or something, you're probably better off with another professor.  He's nice and tries to help his students, but he's kind of flighty and disorganized.  I would recommend him to someone who would only be reviewing these concepts or who has no problem learning math from a textbook, as he's pretty nice and you can miss class if you keep up with the book.\nWorkload:\nweekly or twice-weekly webworks (don't miss these, or that can severely lower your grade), a few written assignments, and somewhat \"creative\" tests, to echo an earlier reviewer.  2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 31, 2002",
            "review_content": "\nThe biggest mistake of my short math career. Had I not taken this class I would have been a math major  for sure, rather than a dual major in math and econ. Yes, his pacing is unbearable, but so is his method of teaching-which he constantly prides himself on in comparison to the way math is taught in the U.S. of A. (Not very welcome if you're American, thank you very much.) Well, and it can't be that I'm an awful math student. I made it to Modern Analysis somehow, but the only thing I'm willing to use from CalcIA is L'hopital's Rule. \n\nWorkload:\nI think reasanable homework, but tests that must have fallen out of the sky.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 19, 2002",
            "review_content": "\ngood things first: prof. neumann is a nice person.  he attempts to answer your questions (for the most part) and allows extensions on his homework assignments and webworks when there is mass confusion over problems.  trust me, there will be mass confusion.\nBAD THINGS: this professor is unorganized and confusing!  he tries his best to follow his syllabus, but it is pointless.  everything he covers needs to be explained at least twice - and most people still won't understand it.  it is tough to follow what he says because he works and walks in circles, pacing around and around.  my class got stuck in the worst part of calc, sequences and series, because he did not explain the ideas at an understandably.  \n*if you are not incredibly strong in calculus, GET OUT OF THIS CLASS.  mass confusion ahead. X(\n\nWorkload:\ntwo webworks weekly (if on schedule), weekly bookwork turned in, two midterms, and final \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 08, 2002",
            "review_content": "\nNeumann reminds me of Newman on Seinfeld. He seems harmless on the outside, but he pulls fasts ones. Firstly, he lectures from the book (and he paces back and forth in lecture, which seems harmless, but will drive you crazy too), but then his tests are \"creative.\" A bit too creative for CAlc IA. I didn't really feel I got the main concepts down. I still inch away from Calc I stuff eventhough I'm taking Fourier at this point. \nWorkload:\nAs far as I remember, it was reasonable.\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 24, 2002",
            "review_content": "\nThere's nothing particularly amazing about him. In general he follows the textbook's notation and formality in his lectures. He is very approachable and has ample office hours. The grading was fair bordering on generous on the quizzes. Grading was excessively harsh on both midterms, but he was very nice about sorting out problems with test grades.\nWorkload:\nThis may not be the same for all of his calc courses, but it was 1-2 problem quizzes every wednesday, suggested homework problem sets, two midterms, a final, and Mathematica recitation (all 2s classes).\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "December 16, 2001",
            "review_content": "\nThere is nothing great or awful about Professor Neumann. His lectures can be pretty boring. He does have a tendency to talk into the chalkboard so sit up front. You have to keep up to date on the material (do the homework/study each week) because of the weekly quizzes. The tests are challenging but not impossible.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 31, 1999",
            "review_content": "\nA very innocent and harmless looking man, Professor Nuemann is the serpent lurking beneath the flower. His lectures are devastatingly boring and (I swear) intentionally abstruse. He has a tendency to talk into the board in his usual monotone and to do complex equations in his head not realizing that his students cannot follow his logic. Worst of all, his tests are very difficult and he does not believe in curving. If you have never taken calculus before, steer clear of this class. If you are a good calculus student, you should be okay though you may not get the high grade you expected.\nWorkload:\nHe gives two problem sets a week which are graded very harshly by TA's. \n"
        }
    ]
}