{
    "prof_info": [
        {
            "prof_name": "Elke Weber",
            "prof_id": 586,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "January 28, 2011",
            "review_content": "\nUnfortunately this class is a mess because you can see the teacher putting a lot of energy into it....but it does not work for her.\nFirst of all the teachers slides seem organized but if you compare them to what is coming out of her mouth you will be very confused. Her thoughts move faster than what she can talk about so even note taking is confusing if you are trying to follow her.\nIt does not have any requirements but you have to have a heavy background in Economics to understand the first month of class. Even the TAs were trying to help us but they seemed even more confused.Don't even mention the little math that you have to use. So confusing.\nThen, you have to have a good knowledge of Social Psychology in order to at least have a moment of breath in this class and understand al the biases humans have. \nOnly then  the topic starts. Desicion making is a very open, subjective topic. She makes it boring , confusing and the book is a horrible companion. I ended up not reading it. Everyday you have to sit in the class, thinking it is going to get better or clearer but....false! It just gets worse and worse. Its like a sinking ship.\nThe video project is useless but I met great people and less than 3  hours were enough to film it. Many people just read from a paper to the camera....boring.\nI threw my notes away as soon as the semester ended.\nWorkload:\nTwo exams. Midterm material is heavy but the test was fair. The final took 3 hours to complete and I had to go walking for one hour to forget about it. 2-3 lttle essays and one 3 min video about an environmental topic\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "December 21, 2010",
            "review_content": "\nYes, this class is ridiculously boring.  The first half of every lecture is spent going over what we talked about last lecture.  Popping into class a few times a month is enough. If you go more than that, at least bring your laptop. You and everyone else will have to flip to Facebook every once in awhile to stay awake, which is sad considering how sweet Elke is. The assigned book chapters are usually only barely connected to what we are currently talking about. The TA's are very disorganized and can't even agree on which lessons/book chapters will be on the midterm.  And, the group video project was the most ridiculous, waste of time high school project EVER.  But, despite all this, is it hard to get an A is this class? Not really.  The average on the midterm was an 85. The study guide Elke hands out before the midterm and final basically are the the midterm and final.  If you do it and memorize it, review the lesson slides and have a bit of common sense you can get an A- on the exams.  The writing assignments are a bit harshly graded, but if you put effort into them and throw in a bunch of psych words you'll be fine.  The video project was the dumbest thing ever and hopefully they get rid of it by next year. This class also turns into an Econ class after the first semester, just FYI. \nWorkload:\nTwo short written assignments (1-3pgs; 20%), Video project (10%), Midterm (25%), Final (45%). \n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "April 06, 2007",
            "review_content": "\nplease dont take this class. was so boring for me i had to leave during class sometimes. we just pass failed it because we could not stand going to her class. taking the class will help you in some other classes becuase the material is universal in psychology\nWorkload:\nnot that bad, but lectures and the material is painful\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "December 30, 2006",
            "review_content": "\nThis was a fantastic class and I worked really hard, but for once it actually paid off.  Prof Weber is a fair grader, her lectures, while sometimes seeming VERY long, were well organized, well presented, well articulated, and she even gave us power point printouts for the whole course. This meant I didn't use my laptop for notes so I actually paid attention.  The material was interesting, the papers were easy, and the best part of the class was the TAs.  At least Kerry, she was fantastic.  She would answer questions by email, meet with you whenever, and even read drafts of papers.  The test review guides were comprehensive and super helpful, and we even got the essay questions ahead of time.  If you need an awesome psych class, go for this one, it'll actually make you think a little.\nWorkload:\nmidterm/final, both take less than the time given.  3 papers of 4 pages, very easy if you prepare correctly.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "December 23, 2006",
            "review_content": "\nDisregard the previous reviews. The class has cracked down hard on grade inflation, turning very easy material into unnaturally hard material--papers which would earn A's if the class were half the size earn C's. The mean of our first paper, in a class of 66, was a 5.3/7.5! The test grades fell around a B-/C+ range, and if they don't curve final grades, a lot of people are going to wind up with GPA breaking scores in what was a fluff course. The material was worthless--I gained more from my AP Macroeconomics class in 12th grade. If you have an interest in decision making, take a basic econ course. Unless you enjoy sitting in half-empty lecture courses listening to material you could have learned in 3 hours from the assigned 100 page/10th grade level coursebook, avoid this course. \nWorkload:\n3 decision diaries, 4-5 pg.  Midterm. Final. \n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "January 02, 2005",
            "review_content": "\nI've read all of the reviews about Professor Weber and I don't understand why people think she is such a good lecturer.  She is very nice and understanding (especially when it comes to the TA's horribly subjective grading on the definitions on the midterm), but as a professor, I can't say that I found her to be all that great.  Maybe it's just me, but I found her accent to be distracting and her incredibly incoherent, disorganized manner of teacher to be very uninformative.  Sure she has powerpoint slides, but unlike other professor's, some of her slides make no sense.  You look at her review sheet that she gives to you near the midterm and final, look back at the powerpoint slides, and realize that even with the slides and your lecture notes, you still have no idea what the concept means.  She never manages to give an actual definition of a concept but rather provides an obscure, not very clear \"example\" of the concept.  Yes this class is fairly easy and you don't really have to do any of the readings, but I have learned almost nothing from this class.  The final is all about little cartoons and vignettes where you are supposed to give the concept that it is using--but more than three concepts can apply to the same vignette.  If you want to fulfill an easy major/minor requirement, take this class--just study the review sheet, glance at the readings, and hand in the final paper.\nWorkload:\nmidterm and final (you get a pretty comprehensive review sheet before both, so make sure to study the concepts and prepare answers for the possible essay questions), a final paper, and 3 decision diaries (each take less thn 15 minutes)\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "January 01, 2005",
            "review_content": "\nPERFECT class for people with no interest in science who want to get through the science requirement relatively painlessly. This class is really more of a marketing class than a science class. Its true what other's have said, that a lot of the stuff seems relatively common-sensical (in making a decision, you evaluate your choices, and make the decision you see as best, etc.). And that the book is very interesting and short. \nElke is an incredibly sweet, interesting, well-spoken, engaging lecturer. She delivers a well-run and informational lecture on a somewhat boring topic. The information on the notes is everything that will be on the midterm and final, but you still HAVE TO GO TO CLASS. Don't think that those are a get out of jail free card for studying. She gives extra information and examples that back up what those notes say. Overall, very interesting class. I feel like I learned a lot from it, and the thought of the professor still makes me smile.\nWorkload:\n3 decision diaries (very easy), research paper (somewhat difficult) and a midterm and final that definitely expected you to know your shit. And I repeat, GO TO CLASS.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "December 26, 2004",
            "review_content": "\nWell the name of the class makes it sound really cool, but, ummm, not so much.  It's hard to pinpoint why exactly this class is such a waste of time, but it is. Honestly I learned a lot, but I really didn't need to take the class to learn it.  One day spent reading the textbook--and it could be read in one day, really it's just plain fun--would have been sufficient.  \nThis class is good for English majors who want an easy way to fulfill the science requirement.  Basically you just have to memorize a bunch of names for concepts that you already intuitively understand.  The exams do very little to test any real comprehension, and though there is some (very simple) math in the course almost none of it makes it on to the exams (really, you can get those questions wrong and still get an A).\nThe only people who really should take this class are those who want to go in to marketing.  \nProf. Weber is very nice and a fairly dynamic lecturer, but in my opinion this class is living proof that the social sciences are not real sciences.  Every interesting study is just telling you something you already know, and some of the conclusions that these so-called scientists draw from their studies are so obviously without foundation that it's not clear why anyone would take them seriously.  \nThis class could have been condensed into two or three very interesting lectures, but to sit through a whole semester was none too much fun.  ItÂ’s a pretty easy A though.\n\nWorkload:\nmidterm, final, 7-9 page paper, 3 short decision diaries\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "February 16, 2003",
            "review_content": "\nProfessor Weber takes the guesswork out of an obscure topic and runs a well-organized and extremely informative class.  Her class provides an easy-to-grasp introduction to the psychology of decision making; while some of the information seems self-evident, this class will change the way you look at the process of making decisions.  Don't be surprised when the word \"utility\" takes over your entire vocabulary and you wonder how you ever got by without knowing how to determine it for a given scenario.  The course itself has very high utility for students of a variety of academic interests and is a great way to fill that second part of your psychology sequence if you've chosen psychology for your science requirement.\nWorkload:\nLight.  Midterm, non-cumulative final, three decision diaries of one page each, one term paper of 8-10 pages on the topic of your choice.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "February 06, 2003",
            "review_content": "\nI truly thought this was the best class I've taken at Columbia, in any department. Prof. Weber is from the business school, so it's sort of like an economic psychology class, covering game theory, probability, and many other real-world topics. Teaching is done with really interesting examples, such as segregation in schools and the Challenger shuttle explosion. Weber is an absolutele delight--enthusiastic, clear in her lecturing, and open to all questions. Cute German accent, too. Her TAs weren't great due to arrogance and random grading, but that could change next year. Take this class if you're a psych, econ, or poli sci major!! It's great! You'll be interested in what she has to say and will never get bored.\nWorkload:\nNot too bad--midterm and final (both easy), 3 decision diaries (1 page each, takes about 15 mins each), and a 10-pg research paper on absolutely any topic realted to the course material.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "January 11, 2003",
            "review_content": "\nYes, it's an easy class. Memorize the handouts and ace the tests. Weber's not an engaging lecturer, her TA (Eric) is a mean grader, and decision making is way less complex and interesting than you're led to believe.  Not the worst class I've ever taken, but far from the best.\nWorkload:\n4 decision diaries (aka busywork), 10 page paper (harshly graded), midterm and final (easy if you memorize the prof's handouts)\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "December 18, 2002",
            "review_content": "\nProf Weber is a decent lecturer.  She presents her information clearly and even gives out her lecture notes for each section of the course.  A review sheet was also given out for the midterm and final, but it was extremely comprehensive.  The final included information from the first section of the class, with some of the stuff pretty obscure and not what was focused on in class.  While the course itself is not difficult, the TA's were ridiculous.  There was no standard given for grading, either for the paper or the exams.  \nWorkload:\nThree short decision diaries, midterm, final and ten page paper.  Not necessary to do reading.  \n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "November 17, 2002",
            "review_content": "\nProf. Weber is animated and very deeply cares about what she teaches, and wants you to care about it too. It is not difficult information, but it is very interesting, and Prof. Weber gives good examples to help conceptualize the information. Her primary TA this semester, Eric, taught part of the class, and he is a very fun lecturer... he makes the class interactive, and also very obviously cares about the information. I highly recommend this course.\nWorkload:\nMidterm, final, term paper (10 pages)... the new text used is easy to read and clear.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "May 10, 2001",
            "review_content": "\nEasy easy easy. Get out of jail free card for nonscience majors' science requirement. The other reviewer is correct to say that lectures are not necessary to ever attend. I learned half a semester in one night by flipping through the lecture notes printed out for me in advance by the Prof. As for the Prof., Weber is enthusiastic about her subject; I'll give her that. There's just not much to the subject.\nWorkload:\nmidterm, ten page paper, final. Multiple opportunities for, yes, extra credit.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "May 10, 2001",
            "review_content": "\nThis class was extremely boring, but very easy. Professor Weber knows her stuff down cold, but the topics are uninteresting and often common sense. The lectures are boring, but you don't need to worry about taking great notes because the TAs hand out most of the notes you will need. There is a lot of reading, but it's not necessary to read it in order to do well on the exams. Professor Weber is nice, pleasant, and does her best to make a boring class seem interesting. I would definitely recommend this class as an easy way to complete the science requirement, but if you want something interesting, look elsewhere.\nWorkload:\nmidterm, final, 1 8-10 pg research paper (not hard)\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "May 10, 2001",
            "review_content": "\nThis class was extremely boring, but very easy. Professor Weber knows her stuff down cold, but the topics are uninteresting and often common sense. The lectures are boring, but you don't need to worry about taking great notes because the TAs hand out most of the notes you will need. There is a lot of reading, but it's not necessary to read it in order to do well on the exams. Professor Weber is nice, pleasant, and does her best to make a boring class seem interesting. I would definitely recommend this class as an easy way to complete the science requirement, but if you want something interesting, look elsewhere.\nWorkload:\nmidterm, final, 1 8-10 pg research paper (not hard)\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "April 19, 2001",
            "review_content": "\nQuite possibly the most boring class I have ever taken. I have learned nothing except the technical terms for concepts that I already know. Every class we spend the first 30 minutes rehashing what we did last class. She gives the same examples every day because she seems not to know any others. There is so much possibility in this class but Weber is simply an incredibly boring teacher. The class is always at least half missing and those there sleep. This is a waste of time, and the midterm and final both consist of memorization of definitions, which is actually difficult giving the arbitrary grading.\nWorkload:\nMidterm, final, and paper. Not much work and the readings are simply water-down in the lectures. Not that hard but not worth the effort.\n"
        },
        {
            "course_name": "Thinking and Decision Making",
            "review_date": "April 09, 2001",
            "review_content": "\nGive yourself a treat and take the class. The material is a combination of psychology and economics and has great applications in students' lives as well as implications for political science and political theory. Weber is extremely well organized and the lectures are interesting. Grading is fair. A limited background in psych and statistics are assumed, though Weber and the TAs often stay after class to patiently answer stupid questions from people too dumb or lazy to read a book.\nWorkload:\nMidterm, term paper (10 pages), final.\n"
        }
    ]
}