{
    "prof_info": [
        {
            "prof_name": "Stephen Murray",
            "prof_id": 1205,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Medieval Architecture",
            "review_date": "January 01, 2011",
            "review_content": "\nWhat an amazing course! \nMurray is one of the world's foremost scholars on the subject, and generally brilliant. He often shares current projects with the class, giving you insight into current events in Medieval architectural history. Importantly, he also can teach. I admit that for the first part of the semester I felt completely lost. The powerpoints jump around from building to building (organized by idea instead), Prof. Murray often expects some knowledge of nomenclature, and I wondered why he would spend time listing minutia without getting to any overarching significance. But then it all clicked. Once you begin to follow his way of thinking (and thus teaching), the material really comes alive. Prof. Murray goes beyond the usual description and analysis, and discusses historiography as well. He asks you not simply to memorize facets of buildings, but also to ask larger questions about the social framework that built them. The class sort of feels like an induction into serious architectural history. \nHe is also entertaining, cracking jokes and taking the class to St. John the Divine one day during class. His TAs are great as well, but discussion section was a little boring, if necessary. \nLike the reviewer below said, however, you might not like the class so much if you're not really interested in buildings. A lot of time is spent of \"this type of arch versus that\" and \n\"this roof looks just like that one, hundreds of years before it.\" If you are an architecture enthusiast, however, you'll love it.\nWorkload:\nweekly reading, a short paper (worth little), midterm and take-home final. Work hard and you'll be fine. I was nervous having read the CULPA reviews and did better than expected.\n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "December 22, 2010",
            "review_content": "\nProfessor Murray himself is like an incredibly knowledgeable marshmallow Peep, all soft and bearded and spouting trivia about French illuminated manuscripts on the side. He's what you want your grandfather to be.\nBut the class material is less accessible, especially if you're not an art history major. It's not that it's so hard, but the opposite - he spends so, so, so much time giving seemingly trivial details about each cathedral that by the end of class you're left with half a page of notes and a sinking feeling that once again, you've missed the point of the day's lecture. If you're on the fence about the importance of art history as a field in general, don't take Medieval Architecture. It will only encourage the worst, why-don't-you-get-a-real-job instincts in you. On the other hand, architecture people loooove this class, because building adoration is building adoration, you know?\nWorkload:\nOne threeish-page non-research paper; standard midterm of IDs, comparisons, and essay; aborted ID quiz; fairly boring but light reading for section; blessedly short take-home final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 15, 2010",
            "review_content": "\nI took stephen murray's arthum class and it was amazing! stephen murray really makes the core curriculum everything it is idealized to be. He really finds a way to engage every single student. Even if you think you don't like art, you will after this class.\nHe's so knowledgable about everything in his awesome british accent--especially cathedrals and architecture--but he never makes you feel ignorant/unprepared. The best thing about him is that he's not some lame professor; he's travelled all around the world and experienced his area of study first hand. He's really open to all suggestions and loves to hear about student's lives and opinions too. If you're some kind of art history major you should definitely take his class because he really does everything he can to help. The last day he offered us all advice, rec letters, everything...sadly no one in my class was actually an art history major, but I almost wish I was.\nOverall, awesome class, inspiring teacher. \n\nWorkload:\ntwo papers, one in class presentation (but really chill), midterm, take home final...the readings don't matter much, you just use them for the midterm and final. its not that much work compared to most humanities classes.\n"
        },
        {
            "course_name": "Gothic Architecture",
            "review_date": "May 02, 2009",
            "review_content": "\nI just finished the Spring (2009) in Professor Murray's Gothic Architecture.  \nI think he is wonderful.  He is thoughtful and intelligent in his analysis of Gothic architecture.  He is modest and welcomes input, on an ongoing basis, from his students on which approaches to looking at architecture work and which do not.  His love of what he does is infectious, and his students, both undergrad and grad, seem to really admire, respect and simply, like him.  He has a wonderful sense of humor, and every once in a while, inserts a comment on local and world politics into his lectures.  \nThe work load isn't the hardest and isn't the easiest I've had at Columbia.  The mandatory reading was for section discussions, but he does have a suggested reading list which he refers to from time to time (Jean Bony, in particular).  Your knowledge will be enhanced if you read these other books, but you are not required.\nI learned a lot, and had a genuinely pleasant experience in the process.  I highly recommend Professor Murray, and, I wish him all the best.\nWorkload:\nWeekly reading, usually articles written by art and architectural historians; approximately 50-100 pages per week.\nWe had to write a paper (he gave us one week's notice); a visual analysis of a gothic structure. The paper was due the 2-3rd week of February.  \nWe had a midterm, for which, he handed us the essay questions a week in advance and we could do whichever one we chose.  The Final was a take home with slide identifications and then an essay.  Again, we could choose from several topics for the essay.  \n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "January 06, 2009",
            "review_content": "\nI think Prof. Murray needs to be upgraded to a gold nugget. This man encompasses everything Columbia wants in every professor: not just a brilliant scholar (check out all his publications in Avery) but a very able teacher. Even though he looks like he's skirting 65 (70?), he had better knowledge of how QuickTime works than I did. He is one of the champions for including more technology in the teaching of Art History in the future and has always been involved in all sorts of projects to visually capture the beautiful buildings in France either on video or through a navigable QuickTime interactive video which is made available free to the public. Throughout the course, our slides were accompanied by these videos so we could actually experience what it was like to stand in the building and have Prof. Murray point out what we would have seen. He brought medieval architecture to life for me, and made each and every building individual and unto itself, which gets hard because we studied over a hundred buildings and all of them are churches and things start to look the same past the 6th week. The way he blends teaching the primary material by looking at the building's features with the theories of past art historians is excellent, and we never get bogged down solely in theory, or just looking at buildings without a context of how they have been viewed. His powerpoints are all posted online for easy reference but I attended class just to experience the sheer charisma that was his style of teaching. An Englishman who's humour is understandable to a largely American audience is truly hard to find. I had a great time.\nWorkload:\nEasier than what I expected. Only 1 5 page paper, weekly sections, non-cumulative midterm and final, and final was a take-home anyway. Suspiciously easy, but the TAs and Prof. Murray graded hard. Few A- get upgraded to an A at the end of the term. \n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "November 15, 2005",
            "review_content": "\nMurray is great. He is funny and an enjoyable lecturer. The readings are a bit dry, but it is Medieval Architecture. In his own way, he is \"cunning\" and subversive. Putting pictures up on powerpoint of his eminent collegues in various states of inebriation is wicked. His dog makes the powerpoint too. This guy is great fun. The lectures are cool. Don't miss the trip to St. John the Divine (he will gallumph for you, don't ask, but it is really something to see.)\nWorkload:\nMid term.  Final. Take home. If you have a decent TA, you will get a B+ for hard work. Don't blame Murray. Medieval TA's have something to prove I guess. But don't let that turn you away.\n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "May 18, 2005",
            "review_content": "\nI enjoyed this class and prof murray is a pleasure. he has a sense of humor, which is always a plus. The prof is also very interested in cutting-edge art theory, which is really neat to hear. he is really willing to let you inside his process- and since he is actively writing, researching in the field, its pretty neat. i found that the grading was typical of a 2000 level class with TA's- ie- B+'s abound.\nWorkload:\nmidterm, final- take home.\n"
        },
        {
            "course_name": "Gothic Architecture",
            "review_date": "December 29, 2004",
            "review_content": "\nHe does have a beautiful accent and he post the picture of his new dog on his powerpoint for fun. No doubt he is the expert  in his field. As for his class, like all other art history class, it's about slide after slide in a dark room (most people would fall asleep). \nAs for the class itself (he was experimenting with our class) first half of the semester is about theories on how to look at art history in general. He likes to see everything as story telling. Not much memorizing needed for the first midterm. Second half of the semester is racing thought catherdrals. There is a discussion section that talks about the reading for the week, usually understand the author's argument and poitn of view.  The exam have 2 slide comparison and one essay. He gives 5 essay questions a week ahead and put them all on the exam so you can pick one and do it ahead of time. Some of the question is really open. Others aim towards the readings for the class. NO need to purchase any books for this class.The Readings consist of mainly articles and of couse it includes his own articles and sections of his books. He did want us to read one of the small small book he just published for thanksgiving break.     \nWorkload:\nresearch paper (15 pages, not easy, hope to god you have an easy TA), one midterm and final (exact same formal for both) \n"
        },
        {
            "course_name": "Gothic Architecture",
            "review_date": "November 11, 2004",
            "review_content": "\nOiy. First, let's list the stuff that is actually good about the professor:  he's smart, he's probably the leading thinker on Gothic Architecture in this country, he's lectures are power point and posted online, and he has a british accent.\nNow that that is out of the way - I have to regrettably say......don't take this class. He begins the term with a very theory based way of looking at architecture  that is totally incoherent, useless, and not tested on. Then the second half of the term rolls around and he bowls through the different cathedrals and abbeys like he is trying to finish a race. It's ridiculous.\nIt's sad - the churchs are gorgeous and he is so brilliant. I just wish he had a better way of teaching. \nWorkload:\nmidterm, final, research paper (not a walk in the park)\n"
        },
        {
            "course_name": "Medieval Millenium: Object of Desire",
            "review_date": "May 22, 2003",
            "review_content": "\nA fantastic professor. Not only is he witty, engaging, and in possession of a fantastic British accent, but nobody knows medieval art like Professor Murray does. He has an encyclopedic knowledge of Gothic architecture, and seems to really enjoy what he does. He was always willing to take questions in class, and though his office hours are a bit early (8 AM!), if you set your alarm and hike over to Schermerhorn, he's more than happy to talk to you. The TA's were also knowledgable and friendly, if a little bit timid in leading discussions. Overall, I highly recommend this class to both Art History majors and non-majors.\nWorkload:\nVery light. 1 8-10 page paper, graded generously. Midterm and non-cumulative final, both consisting of ID/comparison questions and an essay (topics are given out in advance); no surprises at all. Readings assigned every week, but not really necessary except for the exams, and even then hardly so.\n"
        },
        {
            "course_name": "Medieval Architecture",
            "review_date": "January 20, 2003",
            "review_content": "\nThis class is for you if you LOVE cathedrals. Prof. Murray knows his shit ranging from the first abbey's built 2,000 years ago in Italy to the Hagia Sophia in Istanbul. Don't take this course if you don't like to get technical, he will throw in a few terms that you will have to look up on your own time. The work isn't too hard. BUt pay attention. You go on a field trip to St. JOhn's where he gives you a detailed history of the building. He is hard to get in touch with but is very open to re explaining ideas from his lectures. The best part of his class is watching him in videos, stumbling around in old cathedrals, quarry yards and abbeys throughout Europe. \nWorkload:\nONe- 8 pager, mid term and final - not too hard a grader expect a B without too much work\n\n"
        },
        {
            "course_name": "Paris in the Middle Ages",
            "review_date": "January 01, 2003",
            "review_content": "\nI dropped this class midway through the semester.  It never ceased to amaze me that lectures given using PowerPoint could possibly be so confusing, poorly organized and typo-ridden (there were often so many typos that what he had written was almost illegible).  Murray would spend days talking about a single cathedral using terms he hadn't explained and jumping around from facade, to interior, to arches, and back to facade again until students were hopelessly confused.  He would introduce and reintroduce confusing arguments sporadically and perfunctorily.  By the time I dropped the class there were about a third of the people there had been on the first day of classes.  The last straw was when he announced that most people had received bad grades on the midterm.\nWorkload:\nMidterm, final, research paper.\n"
        },
        {
            "course_name": "Gothic Architecture",
            "review_date": "September 03, 2002",
            "review_content": "\nDon't leave Medieval Art to the dorks-- Prof. Murray's too cool for that. Take Paris in the Middle Ages. You won't regret it, and you'll get an A, and maybe then the secret will spread that you can actually do more than memorize in a class on older art (are you listening Prof Beck?)-- you can think critically and read cool stuff. Visigoths? come on. Bitchin'. You'll be hard pressed to find a more engaging professor or subject in the Art Hist dept. \nWorkload:\nchill\n"
        }
    ]
}