{
    "prof_info": [
        {
            "prof_name": "Suzanne Laizik",
            "prof_id": 1287,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "First year english",
            "review_date": "November 11, 2007",
            "review_content": "\nWithout a doubt an amazing class, Ms. Laizik was very knowledgable, considerate, and easy going (she had no problem pushing back deadlines). Her insights on the texts were very original and in-depth, and she's definitely helped improve my essay writing. She is also a very available person, you can speak to her during office hours about anything, whether its about an essay or just to compare the texts to other books you've read. She's the way to go for First year english.\nWorkload:\ntwo 3-5 page essays, one 8-10 page research paper, required attendance to first year english lectures and two class trips (the MET and to see Richard the III)\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "November 08, 2005",
            "review_content": "\nMs. Laizik was one of my favorite professors this semester.  She has a great understanding of all of the readings that we did, does not give busy work, and facilitates good class discussion.  She does not give any quizzes or tests as long as discussions in class show people are reading (she didn't give any during the time I took her class).  She is extremely understanding about moving deadlines if people are feeling overwhelmed and giving extensions, and she's extraordinarily nice.\nWorkload:\nTwo 4-6 page papers, one 8-10 page research paper and reading is moderate, very managable.\n"
        },
        {
            "course_name": "World Literature",
            "review_date": "August 18, 2004",
            "review_content": "\nSuzanne really helped me with my writing. She went over all my papers several times and gave me helpful feedback. She even read on e of my papers for another class. If you take her class go see her during offices hours. She's really nice.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 08, 2003",
            "review_content": "\nMuch better second term. She started connecting the books together and bringing up repeating themes, which made the classes more interesting. The discussion got better, too, because she let the class direct it more, though one or two people in the class always talked endlessly and she could have cut them off sooner. \nWorkload:\nTons of reading. Three papers, midterm, final, other homework (questions for class discussion). She lets you pick your paper topic if you want and allows revisions to improve the grade.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 25, 2002",
            "review_content": "\nLaizik's not so bad. Her class is extremely boring, though. The conversations rarely get anywhere, and when they seem about to, she pulls it back to her own agenda, which isn't so exciting. She's pretty smart, just not great at leading discussions. Nice lady. Wouldn't recommend her, though.\nWorkload:\nPretty light. 2 short & 2 medium papers. Standard reading. Easy grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 25, 2002",
            "review_content": "\nLaizik's not so bad. Her class is extremely boring, though. The conversations rarely get anywhere, and when they seem about to, she pulls it back to her own agenda, which isn't so exciting. She's pretty smart, just not great at leading discussions. Nice lady. Wouldn't recommend her, though.\nWorkload:\nPretty light. 2 short & 2 medium papers. Standard reading. Easy grader.\n"
        }
    ]
}