{
    "prof_info": [
        {
            "prof_name": "Kathy Eden",
            "prof_id": 417,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "English Lit 1500-1600",
            "review_date": "January 04, 2013",
            "review_content": "\nProf. Eden is one of the best, if not the best, professor I've had so far at Columbia. Her English Lit 1500-1600 just seemed impeccably composed--every reading built on the other; and every concept related back to each reading in a way that gave me goosebumps sometimes. Prof. Eden is very organized in her lecture. The way she explains things is very thorough; in fact, she is always SO thorough that we run out of time. Always. She keeps the class engaged, makes sure everyone understands difficult and abstract questions, and is very approachable. Just generally fabulous. She knows everything there is to know.\nWorkload:\nSuprisingly light--only one paper and one final. But the readings for each class tend to be heavy and take a while to get through because the language is older and the concepts more abstract.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 13, 2012",
            "review_content": "\nThis is what a CC class should be about. First off the discussion in this class was great, which is due to enough people in the class wanting to participate and the professor's ability to stir the pot and get a good debate going. But as important (or perhaps even more so) was the way concepts just seemed to stick in our minds. Sounds weird, but this is very important on the final exam and at the cocktail parties you go to with your hedge fund or neurosurgeon buddies. By just paying attention in class and taking notes you will understand so much. \nOverall, brilliant class and brilliant professor. It's exposed me to philosophy and once-arcane topics like epistemology and metaphysics. The sheer amount of knowledge you will have obtained from walking away from this class is incredible, and Professor Eden makes it quite easy and painless.\nWorkload:\nReadings as usual [Hint: given her superior ability to teach, I found it better towards the end of the semester to read sparknotes and/or wikipedia instead of the reading, go to class, and do the reading afterwards. It stifles discussion, but reading will be so much more manageable (and actually fun)]. 2 papers (basic, 7 pages each, less than most classes). Midterm and final that are essentially the same: 10 passage ids that need to be id'ed and explained/analyzed. Sounds horrible, but she's been giving this type of exam for decades and so far people (including me) have emerged relatively unscathed. I've taken both and it is surprisingly not as bad as it sounds. In short: take this class. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 10, 2006",
            "review_content": "\nProfessor Eden is by far the best professor I have had at Columbia.  Though she is brilliant (Professor Eden speaks Spanish, Latin, Greek, Italian and German, among other languages), she is not at all pretentious.  Instead of lecturing, Professor Eden asks questions so as to draw the information from her students--and even when a student gives a blatantly poor response, she replies with an encouraging remark.  Also, she always allows for student discussion about controversial topics.  The result of this is that she truly inspires in her students a love of the subject matter.  What is perhaps most helpful is that she places each work that we study in cotext, so that the students leave with a foundation for further philosophical study.  Before this class, I absolutely hated philosophy; now, I find myself using what I learned in this class in other courses, as well as on a daily basis--and I can't wait to take other philosophy courses.  Take any class you can with this professor!\nWorkload:\ntypical CC reading + paper, midterm, final per semester...VERY manageable, though grading is slightly subjective.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2006",
            "review_content": "\nI have to say I expected a little bit more out of Prof Eden after reading the reviews here. Not to say she's not good, because she is. I'd say she's definitely in the upper tier of CC profs. She makes sure that everyone has a clear understanding of what each philosopher's position is, which is more than most people can say about their CC profs. However, doing this means that the discussion aspect of the course has to suffer. Most of the questions prof Eden asks are factual, right or wrong type questions. Occassionally we veer off into interesting discussions. I cant really complain too much because she really is a good professor, but there is still room for improvement in the discussion area of the class.\nWorkload:\ntypical cc readings, two papers, midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 16, 2004",
            "review_content": "\nProf. Eden is awesome! Her lectures are very concise. She  always encourages class discussions, but doesn't get annoyed if people don't understand the text very well. She is laidback (class attendence was very rarely taken). Is extremely enegetic about the material. Her energy makes the material more interesting and fun.\nWorkload:\n2 papers. Grading is pretty leniant.  midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 13, 2002",
            "review_content": "\nProfessor Eden is one of the best Lit Hum profs you can have. She's really relaxed in class which can make a big difference in a two hour class. As long as you do some of the reading and pay attention for half of the class, not only will you learn something, but actually do well.\nWorkload:\nNot much compared to other profs- two papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 11, 2002",
            "review_content": "\nIf you are assigned to Eden's LitHum section, you're in for a treat. Professor Eden is extremely well-knowledged in every work, and presents the works in a way that encouages class discusson and participation. If you are in her class, DEFINITELY read all of the works by the deadlines... otherwise you'll feel very unprepared in class and may possibly find the discussions unstimulating and boring. Discussions can get very intense, and the class may seem more difficult than the lithum classes your peers are in, but at the end of the course you'll feel as if you got a lot out of this core requirement... and you'll know how to read some of the greek words that Eden puts on the board. She is very accessibly during office hours, especially before a paper is due, and she is very considerate. \nWorkload:\n2 papers (1st one around 5pgs, 2nd one 5-7 pages)... relatively difficult topics, but you can discuss your ideas with her during office hours. Midterm (identifications) and departmental final. She's a tough but fair grader, and is willing to show you where you need to improve.\n"
        },
        {
            "course_name": "History of Literary Criticism",
            "review_date": "November 17, 2002",
            "review_content": "\nI absolutely love Kathy Eden. I was a little daunted coming into this class because the syllabus was loaded with the same texts that fill CC: Plato, Aristotle, etc.. All of those Greek guys. But Prof. Eden made them exciting, distilling them for us. Her lectures were very organized and she encouraged discussion even though the class had about 50 people in it. Not one usually prone to discussing philosophy, I found myself contributing regularly in class. Prof. Eden gives a new spin to classic texts and shows how they function in modern culture. I developed a friendship with Kathy and whenever I see her she greets me with a hug and tells me to come by her office so we can gossip. She is the best.\nWorkload:\nTake-home midterm and regular final. If you go to class, you'll be fine. You don't necessarily even have to do all of the reading.\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "July 23, 2002",
            "review_content": "\nI have to agree with the reviewer who complimented her intelligence and organization but also levied a warning. This woman has a deep and wide mean streak in her.\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "May 30, 2002",
            "review_content": "\nTrue, Professor Eden is one of the best organized and clearest teachers at Columbia. There's a lot to be said for that. A lot. And she's smart. A word of warning is also in order though, for graduate students. You don't have to push very hard at all in order to get her to remind the class that she reads Greek and you (probably) don't. She has the embarassing habit of attacking graduate students who ask questions for which she doesn't have an easy or immediate answer. Don't be fooled by her pint-sized physical stature. You don't want to be the object of Eden's mocking derision, so after a couple weeks everyone learns to be silent and just take notes, which is how it went for the rest of this somber year-long course. \n"
        },
        {
            "course_name": "History of Literary Criticism",
            "review_date": "May 12, 2002",
            "review_content": "\nProfessor Eden is probably the most well-organized, effective professor I've had here at Columbia. She, unlike so many professors, obviously has a precise idea of what she's going to do in every class, and she gets it done. Her lectures are clear and well organized, and she keeps things going at a fairly relaxed pace--occasionally she's a bit too slow, but this usually happens when she tries to involve student comments, for better or for worse. The only objectionable things here are the sometimes very dull texts (not that they're not worthwhile). In any case, certainly a recommended professor.\nWorkload:\n1 take-home midterm (3 essays of 3-4 pages), 1 final.\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "December 11, 2001",
            "review_content": "\nAs another graduate student who took the course, I feel compelled to respond to the previous review of Eden's \"Principles of Literary Study,\" because the person who wrote it obviously had no idea what s/he was doing for an entire semester.  Most of the complaints in the previous graduate review are completely unfounded: the course is not intended to be a graduate seminar in the usual sense and it is certainly not intended to be a forum for graduate students' personal readings of the texts. Eden states up front that the course is in lecture format and that the readings are her own. Anyone who understands the purpose of the course attends in order to benefit from Eden's considerable knowledge and experience (which is obviously much greater than that of the previous reviewer). I, for one, did not spend my energy in class working myself into a snit if I disagreed with a particular point; I listened respectfully and then, as an independent thinker and career academic, I felt free to take it or leave it as I saw fit. Given the ultimate purpose of the course, I couldn't ask for anything more -- Eden was knowledgeable, prepared and personable. \nCertainly she has an investment in her own readings of the texts, but she never crammed them down anyone's throat (how could she? we're advanced graduate students, and we didn't even write anything for her), and I certainly never saw her practicing \"McCarthyite tactics\" -- such language says much more about the reviewer than it does about Eden. I can safely say that I would much rather be in one of Eden's courses, however conservative the content...\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "August 06, 2001",
            "review_content": "\nKathy Eden is probably a great teacher for undergrads, but graduate students should beware of her control freakiness and intellectual shallowness. Her erudition can seem impressive at first, until it becomes clear that Greek and Latin rhetorical categories presented in September will be trotted out weekly until May. Every literary work ever written must comply with her radically conservative ideas (which are not even hers) and any disagreement will be mocked and crushed. Her intellectual agenda, if that's what it is, involves proving that there has never been anything new under the sun, that no text ever demonstrates a new idea and that you shouldn't either, or else. Every class includes the inevitable presntation of a binary formula--black vs. white, 'community vs. continuity', whatever--but it soon becomes clear that these are just variations of the basic binary of right vs. wrong; if asked, make sure to say that Kathy is right. Discussion is aggressively discouraged in seminar, instead Eden lectures from her notes for two hours non-stop. The content of these lectures is painfully banal; irrelevant facts and uninteresting analysis make two hours seem like eternity. Eden seems incredibly incurious and is actually hostile to any creativity or originality. Worst of all is her McCarthyite tactic of denunciation by innuendo: anyone who disagrees with her or is otherwise an independent thinker will be relentlessly teased and mocked. Eden's \"Principles of Literary Study\" will send your mind back to junior high school; you can doodle while she babbles or write letters while pretending to take notes. If you are forced to register for this pathetic seminar, it's best to mentally tune-out while physically nodding in agreement.\nWorkload:\nLots of boring old-fashioned articles to read, or not, as there is no discussion. (Just make sure to sign for the photocopies in the Core office, she actually checks to sign-out sheet.) Mandatory attendance strictly enforced. Eden is interested in three things only: punctuality, obedience and repitition. Don't mess with Kathy.\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "August 06, 2001",
            "review_content": "\nKathy Eden is probably a great teacher for undergrads, but graduate students should beware of her control freakiness and intellectual shallowness. Her erudition can seem impressive at first, until it becomes clear that Greek and Latin rhetorical categories presented in September will be trotted out weekly until May. Every literary work ever written must comply with her radically conservative ideas (which are not even hers) and any disagreement will be mocked and crushed. Her intellectual agenda, if that's what it is, involves proving that there has never been anything new under the sun, that no text ever demonstrates a new idea and that you shouldn't either, or else. Every class includes the inevitable presntation of a binary formula--black vs. white, 'community vs. continuity', whatever--but it soon becomes clear that these are just variations of the basic binary of right vs. wrong; if asked, make sure to say that Kathy is right. Discussion is aggressively discouraged in seminar, instead Eden lectures from her notes for two hours non-stop. The content of these lectures is painfully banal; irrelevant facts and uninteresting analysis make two hours seem like eternity. Eden seems incredibly incurious and is actually hostile to any creativity or originality. Worst of all is her McCarthyite tactic of denunciation by innuendo: anyone who disagrees with her or is otherwise an independent thinker will be relentlessly teased and mocked. Eden's \"Principles of Literary Study\" will send your mind back to junior high school; you can doodle while she babbles or write letters while pretending to take notes. If you are forced to register for this pathetic seminar, it's best to mentally tune-out while physically nodding in agreement.\nWorkload:\nLots of boring old-fashioned articles to read, or not, as there is no discussion. (Just make sure to sign for the photocopies in the Core office, she actually checks to sign-out sheet.) Mandatory attendance strictly enforced. Eden is interested in three things only: punctuality, obedience and repitition. Don't mess with Kathy.\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "August 06, 2001",
            "review_content": "\nKathy Eden is probably a great teacher for undergrads, but graduate students should beware of her control freakiness and intellectual shallowness. Her erudition can seem impressive at first, until it becomes clear that Greek and Latin rhetorical categories presented in September will be trotted out weekly until May. Every literary work ever written must comply with her radically conservative ideas (which are not even hers) and any disagreement will be mocked and crushed. Her intellectual agenda, if that's what it is, involves proving that there has never been anything new under the sun, that no text ever demonstrates a new idea and that you shouldn't either, or else. Every class includes the inevitable presntation of a binary formula--black vs. white, 'community vs. continuity', whatever--but it soon becomes clear that these are just variations of the basic binary of right vs. wrong; if asked, make sure to say that Kathy is right. Discussion is aggressively discouraged in seminar, instead Eden lectures from her notes for two hours non-stop. The content of these lectures is painfully banal; irrelevant facts and uninteresting analysis make two hours seem like eternity. Eden seems incredibly incurious and is actually hostile to any creativity or originality. Worst of all is her McCarthyite tactic of denunciation by innuendo: anyone who disagrees with her or is otherwise an independent thinker will be relentlessly teased and mocked. Eden's \"Principles of Literary Study\" will send your mind back to junior high school; you can doodle while she babbles or write letters while pretending to take notes. If you are forced to register for this pathetic seminar, it's best to mentally tune-out while physically nodding in agreement.\nWorkload:\nLots of boring old-fashioned articles to read, or not, as there is no discussion. (Just make sure to sign for the photocopies in the Core office, she actually checks to sign-out sheet.) Mandatory attendance strictly enforced. Eden is interested in three things only: punctuality, obedience and repitition. Don't mess with Kathy.\n"
        },
        {
            "course_name": "Principles of Literary Study",
            "review_date": "August 06, 2001",
            "review_content": "\nKathy Eden is probably a great teacher for undergrads, but graduate students should beware of her control freakiness and intellectual shallowness. Her erudition can seem impressive at first, until it becomes clear that Greek and Latin rhetorical categories presented in September will be trotted out weekly until May. Every literary work ever written must comply with her radically conservative ideas (which are not even hers) and any disagreement will be mocked and crushed. Her intellectual agenda, if that's what it is, involves proving that there has never been anything new under the sun, that no text ever demonstrates a new idea and that you shouldn't either, or else. Every class includes the inevitable presntation of a binary formula--black vs. white, 'community vs. continuity', whatever--but it soon becomes clear that these are just variations of the basic binary of right vs. wrong; if asked, make sure to say that Kathy is right. Discussion is aggressively discouraged in seminar, instead Eden lectures from her notes for two hours non-stop. The content of these lectures is painfully banal; irrelevant facts and uninteresting analysis make two hours seem like eternity. Eden seems incredibly incurious and is actually hostile to any creativity or originality. Worst of all is her McCarthyite tactic of denunciation by innuendo: anyone who disagrees with her or is otherwise an independent thinker will be relentlessly teased and mocked. Eden's \"Principles of Literary Study\" will send your mind back to junior high school; you can doodle while she babbles or write letters while pretending to take notes. If you are forced to register for this pathetic seminar, it's best to mentally tune-out while physically nodding in agreement.\nWorkload:\nLots of boring old-fashioned articles to read, or not, as there is no discussion. (Just make sure to sign for the photocopies in the Core office, she actually checks to sign-out sheet.) Mandatory attendance strictly enforced. Eden is interested in three things only: punctuality, obedience and repitition. Don't mess with Kathy.\n"
        }
    ]
}