{
    "prof_info": [
        {
            "prof_name": "Katja Lindskog",
            "prof_id": 4581,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 10, 2015",
            "review_content": "\nKatja is a very straightforward Lit Hum professor. She expects you to have done the reading, but will often ask about simple plot points to catch people up (which is a great way to get class participation points). She's good at facilitating conversation and leading people to the conclusion she wants the class to make--her lesson plans are all quite structured. There's food every class during break, provided by student sign-ups, which is nice. She's a reasonable grader, and expects straightforward essay structure and content. She's never woken anyone up during class (definitely guilty of sleeping through a few), though she does get frustrated if you're habitually late or absent, or use your phone during class. She doesn't hold regular office hours, but is happy to talk after class or by appointment.\nWorkload:\nExactly the same as other Lit Hum classes, though she moves faster and tends to cut the boring works. 2/3 essays a semester, a midterm, and a final. Sometimes quizzes, which ended up not counting for a grade.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 10, 2015",
            "review_content": "\nKatja is a very straightforward Lit Hum professor. She expects you to have done the reading, but will often ask about simple plot points to catch people up (which is a great way to get class participation points). She's good at facilitating conversation and leading people to the conclusion she wants the class to make--her lesson plans are all quite structured. There's food every class during break, provided by student sign-ups, which is nice. She's a reasonable grader, and expects straightforward essay structure and content. She's never woken anyone up during class (definitely guilty of sleeping through a few), though she does get frustrated if you're habitually late or absent, or use your phone during class. She doesn't hold regular office hours, but is happy to talk after class or by appointment.\nWorkload:\nExactly the same as other Lit Hum classes, though she moves faster and tends to cut the boring works. 2/3 essays a semester, a midterm, and a final. Sometimes quizzes, which ended up not counting for a grade.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "December 10, 2013",
            "review_content": "\nI had Katja for LitHum. She's a very nice person and believes in lecturing a bit before moving on to class discussion, which I really appreciated. Context is always welcome.  She also favors a more structured class format than some instructors do. For the most part she asked us direct questions and had us spend part of the class having discussions or completing activities in small groups that we then had to share with the rest of the class. I hated having to do this, but I just hate group work in general, so take that with a grain of salt. \nFor the most part, the class was pretty innocuous. I don't feel that I learned much especially or overly enjoyed it, but it could have been worse. I did feel that she had unrealistic expectations about how much each person should participate during the class session. We had a big class and a gaggle of people who liked to ramble (and whom Katja never cut off), so it would have been literally impossible for everyone to have the opportunity to make three or four separate points during each session. Except apparently, that was what Katja expected us to do. I was unpleasantly surprised to find out late in fall semester that I did not have a very good participation grade, despite talking around twice every session. So in the last month I became one of the resident loudmouths in class and sapped up time other people could have used to say perhaps more salient things.  But at least I finally got full credit for participation during those weeks.  \nSimilarly, others in my class felt she had overly high expectations for our written work.  I didn't feel that way, but I was in the minority.  You definitely can't just turn in bullshit to her and expect to do okay. \nAgain, she is very nice and approachable, and often brings in food. You could do a lot worse for a LitHum professor. \nWorkload:\nNormal. Short paper in the first month, second longer paper in the middle of the semester, and a final paper, in addition to the final exam and a pretty standard and completely manageable midterm.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 23, 2009",
            "review_content": "\nKatja was an amazing UW teacher! Her assignments were always clear, not too lengthy, and her feedback in class was always really helpful. She was very nice to me after class when I had questions about topics and for the mandatory meeting with her on the first essay. She was never rude in class, and even when people would be flaky or late she would just not make too much beans about it. She was also very understanding. When I was sick and couldn't get in my full first draft in on time, she excused me because I gave her notice and  wished that I'd feel better. The only downfall on her part is that she won't get too close to her students. Whenever my classmates would interrupt with a joke she would, within seconds bring it back to the task at hand. It made class efficient, but not as easygoing as it could have been. Overall, she was an incredibly effective teacher and a pleasant woman. I gave her a big hug when on the last day of class. She even brought us cookies!\nWorkload:\nStandard UW. 3 Papers, no more than an hour's worth of HW per class, sometimes 1/2 hour. Chance to make up one paper and a final presentation on your research topic. Very doable.\n"
        }
    ]
}