{
    "prof_info": [
        {
            "prof_name": "Patrick Zimmerli",
            "prof_id": 5596,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Ear Training I",
            "review_date": "December 23, 2010",
            "review_content": "\nWhat a terrible class. Professor Zimmerli had a reclined attitude that consistently mocked his students for not meeting his exceedingly high expectations for a level one class. His vast knowledge for music hindered his teaching ability, where every new concept was introduced poorly as if his students should already know it because it is \"so easy.\" This caused immense frustration and a high feeling of anxiety. I would not recommend this class to anyone because it made me change my mind about becoming a music major. \nWorkload:\nNot defined or explained. Non existant?\n"
        },
        {
            "course_name": "Ear Training I",
            "review_date": "November 22, 2010",
            "review_content": "\nEar Training I with PZ was a pleasure. The workload is light, and he is genuinely invested in making sure his students learn the material. Without a real class syllabus, he completely went at his own pace, and we skipped around topics throughout the semester. This however, wasn't detrimental at all to our learning...because PZ was more interested in learning than grades, class was engaging, useful and low-key. \nI came into the class with a strong music background, and Zimmerli made sure that I was always challenged, regardless of the pace of the rest of the class. Certain topics I fell slightly behind on, and others I was ahead of the other students, and he adjusted accordingly. He was able to individualize the class to our own strengths and weaknesses. If you can, I suggest him! He is funny and caring, and a wonderful professor.\nWorkload:\nVery light. If you have a musical background, you can away with doing little to none of the homework, and just studying for the exams. \nOne midterm, one final. A few short quizzes in between. The only time-consuming thing is that you must be somewhat proficient in playing the piano-- chord progressions and such-- so that takes a while to learn with no previous experience. \n"
        },
        {
            "course_name": "Fundamentals of Western Music",
            "review_date": "January 03, 2010",
            "review_content": "\nI highly recommend taking Fundamentals with Zimmerli. He is pretty much an awesome guy, and he may not be around at Columbia for that many more years. While he puts students on the spot sometimes, and it can be intimidating or embarrassing, it's never ever meant in spite or in a mean way. PZ just cares deeply that his students pick up the material thoroughly. I found his lectures captivating and highly engaging. His sense of humor is fabulous, and if you invest a little energy in having a good relationship with him, it will pay off 100 fold. If you have a background in music, PZ will be a pleasure and a treat. If you're starting completely at square one, be prepared to work (he goes a little fast at times) but he's eager to meet with students and spend extra time on confusing concepts. I had pretty sizable holes in my theory background that I wanted filled in, and I felt like Professor Zimmerli did a stellar job at making concepts understandable and simplified. Fundamentals with Zimmerli was probably my favorite class last semester.\nWorkload:\nThe occasional homework assignment (reading just repeats class lecture but reading it and doing his suggested exercises was hugely helpful for internalizing the material). Two midterms, plus a final. Exactly what you'd expect on a test, no trick questions. If you study hard, or more importantly if you learn and memorize/understand the concepts he lays out, there is no reason not the excel in the class.\n"
        }
    ]
}