{
    "prof_info": [
        {
            "prof_name": "Maya Sabatello",
            "prof_id": 9677,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "International Human Rights Law",
            "review_date": "July 09, 2012",
            "review_content": "\nProfessor Sabatello is one of the best professors I've had while at Columbia. She is one of those teachers who takes a personal interest in pushing each student, and kind of effortlessly sees you for where you are and asks you very pointed questions to put cracks in whatever arguments you have that aren't strong. \nShe is thoroughly logical and sees so many possibilities coming out of every commitment, and she will challenge you (tirelessly) to look at your assumptions in the same way. Plenty of people in the class (like me) were taking this as a required core class for our program and were apprehensive about doing a law class. The attitude when we all left the class was one I would call triumph - we walked in knowing nothing, and when I left, I felt like I actually had a pretty good handle on the basics of IHRL and (more importantly) the way that a student is meant to approach legal questions in this field. Sabatello changed the way I analyze things, and I was already a logical thinker. She also is very intense and rigorous in her style, so going to that class was kind of like going to the gym and putting on crazy pump-up music and ... uhh... who am I kidding. I can't follow through on this analogy. I've never worked out in my life.\nWorkload:\n-Two 5-page legal memos. The first one is terrifying, but you can work together with your classmates so that helps. She grades the first ones very gently.\n-Final take home exam: three essay questions and a 5-page legal memo. If you do all the readings (you must!) and take great notes during class, you will have everything you need to get an easy A. If you skimp during the semester, god help you.\n-Readings load: medium to heavy but interesting stuff. she doesn't assign any fluff or repetitive material, which at Columbia is kind of like finding a unicorn hiding in your syllabus. \n"
        },
        {
            "course_name": "Human Rights & Public Health",
            "review_date": "April 25, 2012",
            "review_content": "\nMaya Sabatello is a great teacher and certainly very knowledgeable about her field. This was one of my favourite classes largely due to her ability to sum up information in a way that is informative and to engage the class in discussions. Her lecturing is very organized and touched upon very different subjects over the course of the semester (every class has a certain topic, e.g. Women's Rights, Physicians' abuses of Human Rights etc). During discussions, she loves to fire back counter arguments at most things that people say, but it is obvious that this is because she wants us to think about these issues from different angles, and she definitely succeeded at making us do this.  She's also a very nice with interesting stories and quite approachable outside of class (always responded to my e-mails very quickly). I think I got a lot out of this class and I definitely recommend taking a class that has her as teacher.\nOne thing to note is that while she's very nice she's also strict in an academic sense, meaning she's serious about things like handing in work on time, not coming to class late, correct form used in written assignments etc. She applies the same ethic to herself so it's only fair.\nWorkload:\nTypical seminar reading load.\nOne 5-page book report on a book you can choose yourself.\nOne final paper (15-20 pg.) including a 10-minute presentation about your paper. \nOverall very doable/standard seminar workload \n"
        }
    ]
}