{
    "prof_info": [
        {
            "prof_name": "David Stark",
            "prof_id": 2661,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Organizing Innovation",
            "review_date": "December 18, 2016",
            "review_content": "\nOverall this was a very fulfilling class and it's brought new perspectives into my life. Professor Stark is a very animated and interesting person. Class meets twice a week but Professor Stark tried to only lecture through one of them, with the second one focusing on discussion. He really tries to engage everyone and make the class a collaborative learning effort, rather than him just talking at you, granted he does go on tangents at times. Material is very applicable to a variety of interests--psych, economics, sociology, business and you get a mix of new faces in the class, which is nice. There's a good amount of reading, but it's only per week rather than class and it's all interesting/relevant. Professor Stark and the TAs also really encourage you to explore something that interests you for your final paper, which allows you to get really creative. The class is not particularly hard but worth investing your time in if you do choose to take it.\nWorkload:\nWeekly readings, short postings, in addition to a discussion section. Participation is highly encouraged.  Readings are interesting and definitely worth doing! Take home midterm is straightforward (2 essays). You get to choose between a take home final (~10 pages) or a final paper of the same length.\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "December 08, 2016",
            "review_content": "\nThis class is GREAT! \nVery interesting, not very demanding, class. \nIt's a wonderful course that really stimulates your mind.\nI learned many new terms that help me understand my experience in an academic context.\nI can now better explain my practical observations and I know what are the conditions that are essential to enable innovation!\nThe professor is full of interesting stories that help understand the material and his lectures are very interactive. The examples help you think about the subject discussed. I like the way he explains a concept with a combination of abstract ideas and very concrete examples.\nThe students are expected to participate and contribute to the class content with questions and examples. Its suitable for students who like to think seriously and participate in classes and discussion sections.\n\nWorkload:\nThere is a lot of reading materials, most of them are very light (NY Times articles) and very interesting. \nYou should send a short response of the reading every week, but you don't really need to actually read all of them.\nThere is a take-home mid-term that requires some thinking, but its 2 short essay questions and a final paper you can write about whatever you want.\n\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "April 17, 2014",
            "review_content": "\nAwesome professor!  \nAs an engineering, this class has helped to glue my varying ideas and ways of doing things well when framed in our analysis of popular culture.  \nProfessor Stark is very encouraging and supportive in presenting us with resources to explore our interests.  \nSometimes it seems like each lecture is variable depending on what questions students ask which I was not used to but I definitely now welcome and appreciate.  This just means that if you miss class sessions, you can never really get a full understanding of what was covered unless you go over a friend's notes with him/her and review the discussion topics.  This is not completely necessary as we will not ever be tested on what we fully talk about but more what we can grasp from readings.\nI highly recommend this course before you graduate from Columbia, in any major.\n\nWorkload:\nReading + paragraph response weekly, 1 take home midterm of ~4 page total response, 1 take home final ~10 page total response, Participation (he remembers your name!)\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "May 24, 2011",
            "review_content": "\nI read the old/new reviews and would like to offer my own opinion for consideration...\nI too found Professor Stark often repetitive. Some lectures I felt were a complete waste of time, and I got the impression that more than one lecture was used to review the material for the class so he could say \"we will look at Silicon Alley and Mega Churches,\" maybe like another reviewer said to create a feeling of a TED talk. Since I don't understand what's so great about TED talks, I hated it. Finally, possibly the most ironic part was his lecture about \"presentations\" which I felt he was in no position to give, not to mention his own cellphone rang and he turned it off as we all watched. I think this class is a little bit hyped, maybe thanks to some past reviews and an attractive name/description. In other words, it is not what you probably expect it to be (which is why attendance dwindled), and if it is, I'm sorry for you.\nHaving said all that, I would, without a doubt, take this class again. This is one of the only classes that I've been to that offered such a breadth of reading material that if you keep up with will give you insights and perspective or at least open your mind to new ideas and things. The best I got out of this class were thoughts that came as the result of associations triggered by the amounts of different things we looked at. I think when your brain is flooded with material from the same field things can quickly become boring, but here, if you zone out and listen and let stuff form in your head and play with it a bit, instead of trying to take notes, you might get something very different than other classes. Then again, you might not, in which case I feel sorry for you, too.\nWorkload:\nNo homework. Reading that is usually light and interesting. Midterm, paper/final. I guess all are \"easy\" because there's a lot of freedom and wiggle room.\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "May 12, 2011",
            "review_content": "\nI enjoyed the class and didn't think Prof. Stark's anecdotes were repetitive at all (with the single exception of the last one about the train in Eastern Europe...ouch). Sure, he didn't explicitly reference the readings during his lectures, but I was always able to relate whatever story he was telling to either the reading or a theme in the course. Taking this class gave me an interesting framework for thinking about the world - we talked about startups, megachurches, the military, trading rooms, online shopping etc. As I described it to a friend, going to class was like going to a TED talk. Imagine that, twice a week.\nThere are some great readings in this class, but some of them were a pain (Foucault). Just read the interesting stuff and get the summary of the boring stuff from the discussion sections...as long as you can say something halfway intelligent you'll be fine.\nThe gist is, if you put in a respectable amount of effort, you will get a TON out of this course. Then again, this was my first sociology course, so take this review in that context. Sociology (or related) majors may experience diminishing marginal returns.\nWorkload:\nreading, midterm, final paper (or take home midterm)\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "April 29, 2011",
            "review_content": "\nI am writing this review first and foremost to respond to Professor Stark's challenge that less reviews seem to be written for Spring courses than for those in the Fall, due to the summer break.\nThis is a very easy course, but be sure you want to be lectured at for 75 min. before you take it, as there is not much real interaction with students, despite Professor Stark's overtures.\nProfessor Stark, while very nice, seems to have a tendency to ramble. He relates stories and analogies that are relevant, but seem to take much longer than necessary to convey a point. Many lectures could have been much more concise, and the course itself could have been more critical/analytical in nature, rather than simply being an exposition on some of Professor Stark's past research. This course had a lot of potential to be challenging and interesting, but often seemed distracted and disjoint. \nWorkload:\nLight.\nWeekly readings ( t be in the essays, it is hard to do poorly. I believe that it is some percentage of your grade, but how much is not listed anywhere.\n10-12 page final paper on any topic of your choice relating to the course, or similar length take-home exam, for which you have about 4 days to do it. Probably worth a larger percentage of your grade, but again that was never specified.\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "April 14, 2011",
            "review_content": "\nI have never written a review before but this class begs a realistic review quite unlike the other ones already posted. This class is one of the biggest wastes of time at Columbia University. The material of the entire semester could have been covered in one 3 hour lecture. Yes, it is an easy class. If you care just a little bit, you will get an A.  All of the topics are really intuitive if you are not stupid. David Stark has really good intentions, but the problem is that anecdotes are not always the mos efficient way of conveying concepts. We must have had 3 to 4 anecdotes per class all of which were repeated multiple times per semester. There is no need to go to lecture more than once a week and maybe the discussion is the only thing you need to attend. If you want an easy A, and are willing to sacrifice your sanity, then take this class. But... if you want to learn anything after the midterm, then don't bother. \nWorkload:\nEasy midterm, final paper or final. The readings are way too long and dense, and are sometimes summarized in class You never know when to read and when not to, because Stark's teaching style is so frustrating - AHHHHHHH\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "August 30, 2009",
            "review_content": "\nProfessor Stark possess one of the most brilliant minds at Columbia. The course can easily focus on anything you suggest; it was a thrill as I we were all able to remark upon the current digital publishing revolution as it happened. The final paper was actually exciting to write (any topic of your choice), and there were many fellow entrepreneurs and tech/media nerds in the class, although you DEFINITELY do not have to be either of these things to enjoy the lectures and discussions!\nLectures focused on everything from how modern mega churches function to studies of basic efficiency with Bethlehem steel in the early 19th century. \nI HIGHLY suggest the course and Professor Stark. The material was extremely thought-provoking and fit perfectly with our current times. \nWorkload:\nEasy. Readings every week (nothing too dry, some magazine articles... all collected for you and ready on courseworks!), a simple essay-based midterm, and a final paper (requirement was around 6-10 pages I believe, I ran over but it was definitely not a problem!) \n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "June 09, 2009",
            "review_content": "\nDavid Stark is a very intelligent man and is obivously very interested in and very passionate about sociology. This is why his approach to his course entitled Organizing Innovation is so maddening. His lectures are moderately interesting if you go. Not many members of the class choose to do so, as one is certainly not missing anything life-changing, or grade-changing for that matter, if one does not go. I went to most of them and let's just say that I entered a potential Sociology concentrator and I finished the term with no desire to ever take another Sociology class. It does not make ANY sense to assign readings if they are only discussed in the section and effectively ignored in the lecture. It does not do ANY student any good to have a professor who is afraid to disagree with the students that make thoughtless comments during the lecture and would rather transmogrify the students' remarks into what he wants to hear. There were many other irritating elements of this class but I would rather just succinctly say that I guess I did not expect the department chairman's class to be just another throwaway course for lazy Columbians gasping towards a Sociology degree. I did a decent amount of work and finished with a good grade, but finished the class with the bitterest of tastes in my mouth. \nWorkload:\nLight and easy. In-class midterm, final 10-15 page paper (no final exam), and weekly discussion sections with reading assignments. \n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "September 01, 2006",
            "review_content": "\nThis ain't your grandpa's sociology class.  Say goodbye to the boring topics of old-age sociology (poverty, race, ethnicity, politics) and embrace the new-age of sociology: information technology, e-commerce, networks, situational modeling. If you liked Duncan Watts' Six Degrees class, you'll love this class.  \nÂ“Organizing InnovationÂ” does what any great sociology class should: it teaches new ways to interpret the world.\nMcDonalds, facebook, sweatshop labor, google, amazon.  These topics initially appear to have nothing in common.  But Stark neatly weaves them all into a articulate tale which makes everyday topics sparkle with new life.  HereÂ’s a preview: Stark reinterprets a boring grocery store self-checkout line as a redefinition of the boundary between employee and employer.  He proposes that this trend also describes youtube and facebook (user-generated content).  Like a self-checkout line, the users of these websites do the work, while the owners sit back and reap the benefits.\nThis class doesn't teach facts but teaches a skill -- how to interpret the world and make connections.  The final paper asks you to apply this skill and study an organization of your choice.  \nStark clearly enjoys teaching and treated us like his own children.  But heÂ’s too polite! He praised every single comment made in the class -- it almost seemed condescending, as if he was afraid of hurting the feelings of puny undergraduates.  And he speaks very deliberately and slowly, as if talking to a group of young kids or non-English speakers.  He means well, but he could have controlled class discussions better.  He was too polite to interrupt students who took the conversation on tangents (one memorable discussion topic centered on whether abc is owned by viacom or cbsÂ…who cares?!)\nThese are just nitpicky complaints.  But one problem worthy of note is StarkÂ’s busy schedule Â– his office hours were overrun by graduate students and it was difficult to meet with him after class.  He made several business trips during the semester, forcing him to miss classes and cut topics from the syllabus.  He even cancelled our final exam.\nAnyway, GIVE THIS CLASS A TRY -- itÂ’s really special. If nothing else, go pick up a syllabus and see what happens.\nWorkload:\nThis is one of those classes where you feel like youÂ’re learning nothing, but in reality the learning is just incredibly painless.  The class has a light workload and a light/medium amount of reading.  No assignments!  One open book/notes midterm, one 15-20pp final paper, no final.\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "August 31, 2006",
            "review_content": "\nThis class is fantastic.  Professor Stark is an extremely engaging lecturer Â– after attending the first class, I knew I had to take this course.  He cares tremendously about both the material and the students, which is why I felt that I learned something every class.  Almost every lecture prompted me to look at an idea or an event in a new way, to see the world in a different light Â– and this was one of my favorite aspects of the course.\nThe class roughly followed a Monday lecture/Wednesday discussion schedule, so that once the readings had been hashed out, we could discuss them in-depth.  I found the readings fascinating, and am glad I took the class because many of them I would not have come across had I not taken this course. Additionally, Professor Stark is very accessible outside of class.  He wants the students to learn and to do well, and he is eager to talk about the material.  We also had a great T.A., Victor Corona, but I do not know if he will be the T.A. again this semester.  \nAs the title of the class is a little ambivalent, I think having a copy of the syllabus and attending a lecture will give you the best idea of what the course covers.  That said, I definitely recommend the course, and you should check it out.\n\nWorkload:\nWeekly readings, a take home midterm, and a 15 page research paper.  (The paper is on a topic of your choice, and I would recommend dicussing various options with Professor Stark. Though I enjoyed my topic and loved writing my paper, I also realized I had decided on a topic too early, for as the course progressed, many more, extremely interesting topics came to me.)\n"
        },
        {
            "course_name": "Organizing Innovation",
            "review_date": "August 31, 2006",
            "review_content": "\nThis class is fantastic.  Professor Stark is an extremely engaging lecturer Â– after attending the first class, I knew I had to take this course.  He cares tremendously about both the material and the students, which is why I felt that I learned something every class.  Almost every lecture prompted me to look at an idea or an event in a new way, to see the world in a different light Â– and this was one of my favorite aspects of the course.\nThe class roughly followed a Monday lecture/Wednesday discussion schedule, so that once the readings had been hashed out, we could discuss them in-depth.  I found the readings fascinating, and am glad I took the class because many of them I would not have come across had I not taken this course. Additionally, Professor Stark is very accessible outside of class.  He wants the students to learn and to do well, and he is eager to talk about the material.  We also had a great T.A., Victor Corona, but I do not know if he will be the T.A. again this semester.  \nAs the title of the class is a little ambivalent, I think having a copy of the syllabus and attending a lecture will give you the best idea of what the course covers.  That said, I definitely recommend the course, and you should check it out.\n\nWorkload:\nWeekly readings, a take home midterm, and a 15 page research paper.  (The paper is on a topic of your choice, and I would recommend dicussing various options with Professor Stark. Though I enjoyed my topic and loved writing my paper, I also realized I had decided on a topic too early, for as the course progressed, many more, extremely interesting topics came to me.)\n"
        },
        {
            "course_name": "Organizations",
            "review_date": "November 17, 2005",
            "review_content": "\nIt was hard at first to see where this class was going. There were an electic mix of people -- urban studies, political science, sociology -- and sometimes, we would get on rambling discussions that seemed to go no where. Other times, the discussions were really great. It was sort of hit or miss. He definitely encourages discussion, and he'll really listen to what you have to say. Sometimes however, Stark could become a little repetitive.\nAnother downside was that Professor Stark is a very busy man, and he's rather well known. So  he's not really accessible.\nThe readings were really great. Everything is cutting edge stuff, taken from sociological journals. Also, although it's titled \"Organizations,\" we spent a lot of time talking about technology and how it influences different kinds of organizations. \nOverall, I would recommend this class. Stark has some interesting ideas, and despite the glitches, it was worthwhile just for exposure to the content. \nWorkload:\nAverage. Weekly readings (no responses required). In class midterm, take home final, and one long research paper that's a substantial part of your grade. No one starts working on it until three weeks before it's due though, so don't stress too much.  He also really likes it if you participate. \n"
        }
    ]
}