{
    "prof_info": [
        {
            "prof_name": "Deborah Coen",
            "prof_id": 3088,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Bodies and Machines: 1750-1945",
            "review_date": "November 13, 2016",
            "review_content": "\nProfessor Coen is one of the worst professors I have had at Barnard. Her lectures are dry and filled with analysis of blocks of text not in the reading that she flashes on the screen for two seconds. She answers questions with the statement, \"Oh, that's interesting, I'll answer that later,\" and then never does or continues by saying that the point is \"an important idea that really impacts the text\" without saying how. She is obviously uncomfortable veering off her printed out pages of notes that she brings to class. I'm sure she's an excellent researcher, but she's a terrible lecturer and cannot get ideas across to save her life. If someone asks a question that's inappropriate to the course, she will say, \"Oh, that should really be discussed in office hours\" and will then spend 5 minutes talking about it. \nShe is unapproachable outside of class, so don't even bother trying to go to her office hours because she will begin by telling you that she has limited time to speak to you. \nThe workload is absurd for an intro level course. She assumes everyone has taken her History of Science class and does not cover the basics of the course. \nWorkload:\nKeeping in mind that this is an intro course, the workload is:\nShort essay 1,800-2,000 words: 10% \nMidterm exam: 20%\nResearch paper, 10-12 pp.: process 10%, finished product 30%\nFinal exam: 30%\n\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "April 21, 2016",
            "review_content": "\nI really liked Professor Coen—her lectures were clear, informative, and I was rarely (if ever) bored.  With that said, if you space out for a few minutes, you will miss information, because she doesn't put the main ideas on the powerpoint on the board.  Buy the textbook—it will fill in any gaps that lecture might leave, especially towards the end of the semester—she runs out of time occasionally. \nIn terms of workload, the essay for this class was a royal pain in the butt—it was a 5-7 page paper about a historical novel chosen from a list of 6 or 7 books.  It was spread out over a month and a half, and I wasn't able to finish the novel within 3 weeks like I wanted to in order to start planning the essay.  Other than that, the readings are fairly light, but they are necessary, since discussion sections focus heavily on the readings 5x per semester.  I tried to not do the readings, but after going to the first discussion and realizing how vital they were to the class, I did them religiously.  The midterm is fairly easy—just follow your notes, the lecture outlines and key terms she gives you, and use the textbook.\nWorkload:\n-Essay (5-7 pages on a historical novel)\n-Readings each week (fairly light but must-reads)\n-Midterm (ID's and 2 essays)\n-Final (same as the midterm but a little longer)\n"
        },
        {
            "course_name": "Bodies and Machines: 1750-1945",
            "review_date": "July 30, 2014",
            "review_content": "\nI loved Professor Coen - her lectures were detailed and engaging, and the subject matter was superb. Class discussion was pretty minor, I can think of only a handful of times she actually made us talk. She was always open to questions and would go off on some digressions if people were interested. She handed out an outline each class of a timeline and some general notes and key words that was fairly useful. Most of the time she just lectured, but she had some slide shows with interesting images or quotes that she used infrequently but were always cool.\nI did all the readings for the class, but mostly the tests took from what she lectured on. She got kind of nitpicky on those, asking for very specific dates and whatnot, but with really good class notes, you'll be fine. That said, you MUST go to lecture and take notes if you want a chance at doing well on tests. She'll say things in class that show up on tests that you'd have no way of even thinking to study without the lecture. I found her grading very fair, even generous.\nAll in all, great class. History of science is a fascinating subject, and she made me want to take more classes both in the subject and with her, so there you go.\n\nWorkload:\nFairly heavy reading, but a lot of it you can skim. Some of it is extremely interesting, some less so. \n1 midterm essay (5 pages max)\n1 midterm that I thought was super easy - class average was 89%.\n1 research-based essay (~10 pages)\n1 fairly easy final\n"
        },
        {
            "course_name": "History of Environmental Thinking Seminar",
            "review_date": "September 06, 2007",
            "review_content": "\nSome people love Professor Coen, but I don't really see why. Yes, she is sweet, funny, and has interesting ideas. She is always willing to meet her students outside of class. But that is where the good stuff ends. Her questions were vague, her assignments were unnecessarily long, and she lacked the ability to facilitate discussion in the classroom. The last was probably a result of the first two--she would ask a question that people would not understand or be unable to relate to the previous discussion or that day's assignment, a student would attempt to answer the question (because however unnerving her talking might be, her silences are worse) and she would immediately shoot down the poor brave soul, discouraging further guesses. She would then attempt to rephrase or answer her own question. As for the readings? I never really knew how she linked them all. At one point we were reading Frankenstein, then watching Gojira, and then we were reading a textbook passage on German environmentalism. While some found this to be refreshing, I only appreciate multifaceted approaches if they are just that--different facets of the same idea. I had no idea what she was talking about half of the time. Her grading scheme was also unclear. At the begining of the semester, she seemed to have a good outline of what she wanted, but the minute people wanted clarification she lost her nerve and changed the assignments. She gives you a chance to redo everything so that you can get higher grades, but good luck understanding what she wants you to change. Even with this apparent bonus I only got a B+. Meeting with her did absolutely nothing for me, as she only read her comments and waited for my reaction.\nWorkload:\nweekly \"journal entries\", several short papers, and in class responses. Reading assignments are too heavy, but she notes which ones she *wants* you to read on courseworks.\n"
        },
        {
            "course_name": "Vienna and the Birth of the Modern",
            "review_date": "August 27, 2007",
            "review_content": "\nProf Coen teaches this class by using a multitude of historical and literary sources so you never get bored. She also encourages discussion and wants her students to ask questions. Two field trips were required, Austrian Cultural Center, and a museum, both very interesting. Since this was a seminar it was more of an overview and that was cool becuase the papers and project allowed each student to study the things they personally found most interesting. Def recommend this class. \nWorkload:\nModerate, a few papers, and reading responses. semester long emigrant project\n"
        },
        {
            "course_name": "Science, Technology and Modernity in Europe",
            "review_date": "December 21, 2006",
            "review_content": "\nI am pretty sure this was her first semester teaching. Overall, I really enjoyed the class. She was always well prepared and I personally found the topic interesting. It was structured around 5 sections, grouped by technology (steam engine, statistics, aviation, electricity, etc.) and witin those topics we discussed evolution, eugenics, and other ways that science and technology changed modern european society. Since this was her first semester teaching, she really made an effort to check in with the students to see how they were doing and how they thought she was doing. Upon our suggestion, she made us a list of IDs and Essays questions that would appear on the final. Since she was new, there were no T.A.s and certain lecture classes were designated discussion days upon which a 2-3 page paper on a given topic was due. In all about 5. If you are interested in science and history - take this class. \nWorkload:\nconsistant, moderate amount of reading throughout the course (which you don't really have to do unless you are writing a discussion paper on it), 5 2-3 page discussion papers, one take home midterm, in-class final. grading is fair, a little strict but she is ready to review your grade if you think you deserve higher. \n"
        }
    ]
}