{
    "prof_info": [
        {
            "prof_name": "Saskia Sassen",
            "prof_id": 10071,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Global Urbanism",
            "review_date": "March 26, 2015",
            "review_content": "\nMy recommendation is to decide what kind of course you want to take and how interested you are in the topic. Professor Sassen is, no doubt, a brilliant sociologist with some influential ideas and interesting perspectives on globalization, urbanization, and the social repercussions of those processes. She is a passionate lecturer who is also quite funny and who very clearly knows a remarkable amount about the course material.\nHowever, this class starts off somewhat structured and devolves into chaos over the course of the semester. Eventually it seems like the lectures don't follow the syllabus or any pattern at all- making it hard to follow what exactly you are supposed to be learning about \"global urbanism.\" The readings are interesting but again, seem pretty random especially as the course goes on. Professor Sassen also doesn't even end up giving that many lectures, because she hands class over to the TA's who are supposed to lead some kind of clarification session (that you don't actually have to show up to). While it is a day off from class, it also makes you feel a bit cheated since you signed up to learn from a professor but got some random, unhelpful review sessions instead. \nAll that being said, I did leave the class with an understanding of some of the major issues in globalization and urbanization as well as new perspectives to look at this issues from, and I gained this understanding through interesting readings and Professor Sassen's engaging lecture style. If you're looking for a more structured course that really helps you grasp the ideas, engage with them, and feel like you attended a cohesive set of lectures/classes---- do not take this class. It is scattered and disorganized. If you don't mind the chaotic nature of the class and are up for having a bunch of ideas and theories thrown at you for a semester, you'll probably enjoy it. These ideas and theories are, after all, interesting, important, and vaguely related to the topic of \"global urbanism.\" \nWorkload:\nmidterm and final- both take home and consisting of 2 essay questions to answer using specific assigned readings \nother than these assignments, it's a pretty normal amount of work and you can get away with not doing the readings though you'll just have to cram them in when it's time for the midterm and final \n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "January 20, 2015",
            "review_content": "\nThere are lots of great reasons to take this course. First, Professor Saskia Sassen is brilliant, and basically created her own field of study of which she is the expert. It's a terrific experience to sit in class and listen to her speak, even if she gets off track sometimes.  Her tangents are better than most professors' planned lectures. She's also incredible nice, very available for office hours, and interested in anyone who takes an interest in her work.  Second, it counts towards the Global Core, and third the workload is very manageable.  There are few required readings beyond selections from Professor Sassen's own book, instead students are suggested to pick one or two other readings each week and focus on understanding those instead of reading a lot and not comprehending it.  As a result, each student has some control as to what areas of Global Urbanism they focus on.  Grades are 50% on the take home midterm, 50% on the take home final.  Attendance is not taken, nor factored into your grade.  Both exams are two questions, each question requiring a 4-page response. Like in the readings, students have a lot of leeway as to what they want to write about in response to each question.  You'll get as much out of this course as you chose to put into it.\nWorkload:\nTwo exams, 8 pages each.\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "January 19, 2015",
            "review_content": "\nSaskia Sassen's class was perhaps one of the best I have taken in my three years on this campus.  While her lectures mirror her cornerstone \"Cities\" book (i.e. scattered at best) she does do a good job with reinforcing main concepts.  These concepts are stressed ad nauseum and are nearly impossible to misunderstand.  I thoroughly enjoyed listening to the guest speakers she brought in, which added nice real-world examples to the topics we were focusing on.  The TA's are all really nice and will help you out if you need direction or are having trouble understanding a concept.  Overall, this is a simple class that nearly guarantees an A in with minimal effort.  If you're looking for a global core or are simply interested in the subject, I'd highly recommend this course.\nWorkload:\nAlmost too little to fathom. Many people believe that by doing the readings you will do better in the class; however, perhaps they may have simply misunderstood the point of the course.  I did almost none of the readings (just skimmed the ones I thought were genuinely interesting, like one every two weeks) and was fine for the midterm and final.  All you really have to do is read the sections that are selected for the midterm/final to write your essays.\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "December 18, 2014",
            "review_content": "\nOh man! Do not take!! The entirety of this semester included enough material for about three lectures. The reading list is huge, uneven, and hardly ever referenced in class. You don't need to go to class much or do the reading, except for her textbook, since the two examinations ask you to regurgitate her ideas precisely. It would be hard to dig further into the questions since they take the form of completely unexplained  prompts, ie \"Write an essay/analysis on inequality using the Cities book\" (real question from the final). The expectations are unclear, the TAs unenthusiastic, the curriculum lacking in any structure. Which is all a pity, because Sassen is clearly brilliant and the course material extremely interesting. You will be f*ing angry when you leave every lecture feeling like you were posed a really interesting question, and given no tools to answer it except for another summary of Sassen's thesis from the textbook and whatever was in today's Huffington Post. If you really care, buy her textbook and spend two hours skimming it. Then go take any other urban studies course.\nWorkload:\nNegligible\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "December 18, 2014",
            "review_content": "\nOh man! Do not take!! The entirety of this semester included enough material for about three lectures. The reading list is huge, uneven, and hardly ever referenced in class. You don't need to go to class much or do the reading, except for her textbook, since the two examinations ask you to regurgitate her ideas precisely. It would be hard to dig further into the questions since they take the form of completely unexplained  prompts, ie \"Write an essay/analysis on inequality using the Cities book\" (real question from the final). The expectations are unclear, the TAs unenthusiastic, the curriculum lacking in any structure. Which is all a pity, because Sassen is clearly brilliant and the course material extremely interesting. You will be f*ing angry when you leave every lecture feeling like you were posed a really interesting question, and given no tools to answer it except for another summary of Sassen's thesis from the textbook and whatever was in today's Huffington Post. If you really care, buy her textbook and spend two hours skimming it. Then go take any other urban studies course.\nWorkload:\nNegligible\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "February 13, 2014",
            "review_content": "\nShe is a very intelligent, entertaining and good-hearted person. Professor Sasses brings to class years of experience and often interjects funny anecdotes to drive home a point. Occasionally, her lectures can ramble a bit. But she always finds herself and returns to the topic. Professor Sassen knows several languages and sometimes uses words in unconventional (i.e. incomprehensible) ways. So carry with you what she jokingly calls \"her little booklet\" (the text book by her) and what I refer to as \"Sassen-English Dictionary.\"\nIf you're interested in the subject, I recommend this class.\nWorkload:\nHeavy\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "February 13, 2013",
            "review_content": "\nMy advice to anybody considering taking this class is to sign up, go to the first two lectures, do the first week of reading and then decide for yourself.\nI personally loved this class.  It's listed as a sociology class, but the material covers economics, international relations, current events, and yes, sociology.  Each week Professor Sassen covers a new topic.  Fall 2012's topics included global cities and slums, urban violence and modern warfare, urban sustainable development, the theory of cities, inequality and marginality of the poor, migratory and monetary flows, and urban technology.\nI would say the main point of the class is to explain the various phenomena of globalism (especially inequality and polarization) using neoliberalism as a theory and global cities as examples.  If this, or any of the topics listed above interest you, take this class.  It's entirely worth it.  Sassen's lectures are a little complex, but you get used to her style the more you listen to her.  She also has an intimidating habit of asking a rather vague question, calling on people until she gets the answer she had in mind, and laughing when someone is particularly off the mark.  She's not being nasty; she just finds it genuinely funny.  That said, if you disagree with her about something, she's willing to listen and respond to your opinion.\nThe midterm and exam felt to me like trials by fire.  You'll be given about four days to write three four-page essays, each one an answer to a broad question.  You get four questions (each one roughly based off of one of the weeks' topics) and the goal is to present a clear and slightly argumentative thesis and to cram as much information as possible into your four pages.  It's about being clear and concise, not elegant.  Also, my TA, Elyakim, is Israeli and learned English as his second language and especially emphasized content over style.\nMidterm weekend aside, the workload in the class was perfectly reasonable.  I found nearly all the readings to be interesting and could see why each one was selected.  I was usually able to do it all in about six hours per week.\nI highly recommend this class if you are excited to learn more about why the current global system operates the way it does.  If you don't enjoy the topics this class will be awful for you.  Professor Sassen does a good job of overviewing the first half of the semester in her first lecture.  Go and if it interests you, go to the second one to see if you can tolerate her lecture style.\nWorkload:\n100+ pages per week, both from articles and from her book.  The readings are usually complimentary to lecture so if you fall behind, you can catch up without missing out on too much.  Also, you can definitely get away with skimming articles and focusing on the ones that interest you.\nTake home midterm and final.  Four days to write twelve pages.  I found this to be very intense, but a lot of people in the class found it be much less challenging.  Both count for 40% of your grade with participation making up the final 20%.\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "December 29, 2012",
            "review_content": "\nLike the reviewers before me, I'm having trouble deciding whether or not I can recommend this course. The content itself is very interesting; it has really opened my eyes to how the world economy has changed up to the present, and how these changes manifest in socioeconomic processes of various scales, especially cities. This is ultimately what the class is about, even as Professor Sassen would probably describe it as something along the lines of \"how changes in the world economy have an urban moment, and how this articulates with the various processes made possible by Globalism.\" It should be noted that the definitions of the words \"articulate\" and \"moment\" as Sassen uses them are not found in any dictionary; they mean something along the lines of \"connect\" and \"manifestation,\" respectively. Alas, Sassen's English is very impenetrable; she uses archaic words and adds obscure meanings to existing words, or both at the same time. She uses the word \"imbrication\" (a word that I have never seen  before this class), for example, to mean \"interconnected.\"\nIt's really unfortunate that Sassen is hard to understand since she is very friendly and is an absolute genius; her contributions to the discipline of sociology are truly incredible. For example, one of the main pillars of this class is how Global Cities (New York, London, etc.) emerged with the onset of Neoliberalism; this trend explains why cities such as New York were crime-ridden and dilapidated in the 1970s even as they are now vital centers of the world economy. I was really fascinated with the material despite being a science major. However, Sassen's lectures, like other reviewers have stated, seemed arbitrary and unconnected. One week she may talk about urban theory, the following week about the environment, and the next week about urban warfare. Since the lectures are based entirely on her book, I felt that there was no point in going to lecture. It truly became a frustrating and redundant experience, especially since Sassen had the habit of asking if we \"understood\" every few seconds; she seemed to think that confusion arose from the content rather than the way that she articulates herself (and I mean articulate in the normal sense, not in the Sassen sense).\nUltimately, most of what I learned came from the readings and from writing the papers, even though they also made the class an annoying failure. The midterm and final were three four-page papers that involved connecting three readings (one of which had to include Sassen's book). The readings ranged from five-page articles and newspaper clippings to jargon-heavy forty-page scholarly papers (some were so dense that they made Sassen's book look like a children's book in comparison). It was really hard to get a sense of what the main ideas of these articles were (or rather, what the TA's claimed the main ideas to be).\nThe essays were graded rather arbitrarily, another complaint I have about this class. The TA's gave conflicting accounts of what they wanted. Jared seemed to want us to understand and connect the readings, saying that we didn't have to \"come up with anything new or extraordinary.\" He even had the nerve of spending one entire lecture teaching us how to write properly, in a manner that should be reserved for middle schoolers (though his comparison of an essay's intro, body, and conclusion to a hamburger was priceless, even as it was rather condescending).\nMy TA, Natan, however, wanted us to product complex theses. This was really frustrating because 1. the TA's kept stressing that we should be simple and succinct, and 2. they wanted us to demonstrate that we understood the material, and thus they encouraged us to define terms. In the second-to-last review session, my peers kept questioning Natan about how we could achieve balance this, since most of his criticisms stemmed from us either not describing the concepts enough (which to him meant that we didn't understand the material) or that we described them too much (which to all the TA's meant that we were ostensibly trying to hide the fact that we didn't understand the material by using too much jargon). It reached the point where we had no idea what the appropriate level was. Certainly, we \"could\" attempt to describe complex terms like Global Cities and Neoliberalism in one sentence, but even if we achieved that, Natan would just complain that we were being \"imprecise\" or \"not getting a sense of the bigger picture.\" Just look at my description of the course in the first paragraph; Natan would undoubtedly ask, \"Is manifest the right word? What processes? Why 'especially cities?' You need to be more precise.\" You can now see why I wanted to tear my hair out during this course, especially since I put extraordinary effort into what the TA's asserted was a simple, one-day assignment.\nOverall, like the previous reviewer said, you should be ready for a lot of disappointment if you take this course. It was ultimately Sassen's lectures and the annoying TA's - who were too obsessed with Sassen for their own good - that ruined the course. At the same time, however, I feel that I would not have learned as much if I had not taken the course for myself. That's why I'm having trouble deciding whether or not I can recommend this course. I do, however, strongly recommend her book, \"Cities in a World Economy\" (Jared would kill me for putting the title in quotations if this were an actual essay; he actually complained about how students did not know whether to underline or put quotes on certain works during his review session). As for the class itself, when considering the obnoxious TA's and Sassen's English, no comment.\nWorkload:\n100+ pages per week, which include \"Cities in a World Economy\" and numerous other works that were ultimately not too necessary. My recommendation is that you peruse the syllabus and get a sense of what the overlying topics are for each section (whether Global Cities, slums, the environment, technology, urban theory, etc.), pick the topic that you understand most or are most interested in, and pick two corresponding readings for each topic; this will help \"immensely\" for what I deem the most obnoxious midterm/final assignments I've ever had.\nBased on the experiences of my my peers and others who have taken the class before me, getting an A is extremely difficult. However, you can't really fail this class either. Just... no comment.\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "December 22, 2012",
            "review_content": "\nI wish I could recommend this course, but frankly I found it disappointing on many levels. You'd probably expect a course on \"global urbanism\" to have cities as the central theme, but Sassen's course is really more about the economic, social, and environmental impacts of globalization. Cities are important to the story because they are global financial centers and massive population centers, but I wouldn't say this class is about \"urbanism\" per se. There were only two lectures on urban theory, which focused on late 19th and early 20th century authors and which oddly came half way through the semester instead of at the beginning (where they belonged).\nIn general I found Sassen's lectures mediocre. She speaks (and writes) in a jargon filled dialect that unnecessarily obscures the course content. She also has a tendency to get carried away with boring, repetitious examples. Sassen changes topics each week and generally does a poor job of tying everything together, so it's often unclear what the main takeaways of the class are supposed to be. The midterm and final are basically an exercise in figuring out what the hell the class is about. As a previous reviewer said, Sassen's failings as a teacher became clear when the TA Natan would lead the class and give incisive, articulate explanations that made you wish he was the teacher.\nOverall I would say this is not a great way to fulfill the global core, but probably better for majors who know why they're taking the class.\nWorkload:\nAs others have said, 100+ pages per week, most of which you don't need to read; midterm and final are both the same format: 3 4-page papers on general themes of the class, which have to be written in about 4-5 days. Not an easy A, but also not a hard B.\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "December 17, 2012",
            "review_content": "\nI went back and forth all semester on the question of whether or not I would recommend this class. It is an interesting subject, but I think Sassen's lectures make it seem more complicated than it really is. She basically has a thesis about how \"global\" cities function in the modern economy, and most of the class is either explaining that basic idea or illustrating countless anecdotal examples. She tends to ramble and repeat herself in her lectures, which got really, really frustrating by the end of the semester. Some of the readings were helpful and interesting, but others seemed to serve no purpose at all, since they were never discussed in class or section and useless on the two written assignments. Overall I think I learned a little bit from the class, but mostly from some of the readings and from the process of writing about it, rather than from the lectures themselves or the discussions.\nAs for the TA's, I have mixed feelings as well. On the one hand, they made it much easier to understand Sassen's basic points than Sassen did herself. I found myself thinking I would have rather taken a class with Natan on the work of Saskia Sassen than taken this class. On the other hand, Jared, who was my section leader, was not very helpful. He made some questionable statements in section, and dedicated an entire review session to explaining how to write an essay Ã  la middle school. \nOverall, I would say take this class if you're willing to put up with a LOT of disappointment for a fairly stimulating topic (sorry if that's a totally un-helpful piece of advice).\nWorkload:\nTake-home midterm and final: write three short essays on various topics covered in class, synthesizing 3-4 of the readings each. This is basically the only point of doing the readings, of which in my opinion there were too many. Most readings were 10-20 pages, but some were short 2-3 page articles while others were 30-40 page academic papers. Sassen's book on cities also summarizes most of the key information in the class. \n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "February 12, 2010",
            "review_content": "\nOkay, maybe I'm absolutely crazy, but I actually enjoyed her class. I'd signed up for her class last-minute to fulfill the global core and quite honestly, I had no clue who she was until I looked her up online. \nI agree with the previous reviews that her lectures can be really hard to understand sometimes. She talks almost exactly the same way writes. After the first lecture, I was absolutely shell-shocked and had to approach her about whether to drop the class. Her response: if you have any interest, keep going ---you'll get used to it. She was right. Although Professor Sassen was never entirely understandable due to her UNIMAGINABLE brilliance, her lectures came to help understanding of the sometimes-tough readings while posing even more questions for you to wonder about. Looking back to the first day when she told us that the class was about \"unmarking\" certain connotations that various words have developed, I cannot help but think that the language she uses is part of the unmarking. The difficult language puts students outside of their comfort zone of thinking in order to avoid the path-dependency that exists in their minds.\nOverall, the readings probably taught me the most in terms of everything. However, I found that her (or the TA, Rachel's) weekly lectures were the things that really helped solidify my understanding of them, making each week's readings more cohesive.\nI would recommend this class.\nWorkload:\n100+ pages per week. I visited her during office hours to talk about some of the readings being really dense, and she advised me to focus on A FEW readings per week and skimming the others as opposed to doing semi-close readings of all of them and not really fully understanding any. \nMidterm and final questions are answer 3 out of 4, 4 pages per response. Make sure you talk to the TAs about the questions and their preferences (especially the one assigned to grade you!). She says to use 4 sources, which was a mistake I made for the first one. Use more ---around 6 is good! As long as you fit it into 4 pages, it doesn't matter!\n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "January 13, 2010",
            "review_content": "\nSaskia Sassen is a pretty big deal, and she's taught a few classes by now, so I was a little surprised not to find any reviews of her.\nI took Global Urbanism with Professor Sassen, after a few years of wanting to take a class - any class! - with her. Professor Sassen is clearly a very, very intelligent woman. She writes like she speaks, and her writing is detailed and nuanced. She mixes theory with quantitative empirical analyses in a rather beautiful fashion. But would I take this class again? I don't know, and probably not for the professor. (I have a feeling she'd be much better in a smaller seminar.) \nThe two-hour \"seminar\" (of 80+people....about 40 by the end of the term were attending lectures) was divided into 1 hour of lecture, and about 50 minutes of discussion in sections. The TAs (Rachel, Elif, and Rajiv) were great - I'd take a class with any of them - but the discussions, which were supposed to be closer examinations of the readings, only sometimes yielded greater insight into the texts. Reviewing for the midterm and final really drove home how rich some of the readings were, but I wish we'd done more with them in class (except for maybe once or twice the lectures seemed pretty far from the readings). I have some friends who thought the class was a waste of time, but I disagree -- I think there was plenty to get out of it, and I just wish that the professor/TAs had been able to make the class fit together more coherently. I generally feel pretty unsatisfied. \n\nWorkload:\nWeekly readings, generally manageable (100-150 pages, usually). Challenging midterm and final, but once you figure out the format or talk to the TAs about it, you should be fine. Biweekly (or so?) discussions outside of class, but these were announced a few weeks after school had started, and I was unable to attend any. \n"
        },
        {
            "course_name": "Global Urbanism",
            "review_date": "December 22, 2009",
            "review_content": "\nDo not take this class. Do not take this class. I know you are thinking: \"wont it be so great to learn from such a scholar, a visionary in the sociology field\"...If you havent woken up to the reality that at Columbia such things rarely work out please learn from my mistake. \nThis is basically a grad level class that she is calling undergrad. I appreciate profs encouraging independent thinking but this was ridiculous. We spent half the class trying to decode the sentences she was using. Seriously. Like she would ask \"does anyone understand what i just said\" every five mins because of the 70+ blank stares she was getting. hence we would never get through the material she had prepared. A more efficient use of time would have been if she just spoke more clearly the first time. Not that she is incoherent by any means. She just seems like one of those people who is too intelligent to say things in a way you will grasp immediately unless you have been in the field for 20 years. Just pick up one of her books and imagine someone speaking it outloud and that is basically how lectures are. \nThe class was also disorganized because it only met once a week and after the first hour we were told to go to different rooms for discussions on the readings. Not onlydid we loose a lot of time in shifting from room to room but there was little time for an indepth look at the readings. We had 90+ pages of reading each week and 40 minutes to discuss them. do the math\nAfter the midterm she pretty much stopped showing up and the class was taught by TA's. I'm sure she had plenty of important things to do but really if you know you will not be available to teach a class let students take classes from those who are available. Starting a class and then not even showing up is more than a bit disrespectful for the time and money students invest in it. \nMost people decided to return the favor by not coming to class anymore or checking out when we were headed for group discussions in the second half. \nIf you really want to know more about the field just ask for the syllabus and read through it  in you spare time. I really learned a lot from those I must admit. But from the class itself, not so much. Sassen is a very nice person and really would be a great person to work for/with and does care about students. But she is just used to teaching grad level and really missed the mark with this class. \nWorkload:\n3 midterm essay. 4 pages each. the readings are divided into different sections based on themes and she will ask you to pick 4 different sources to write each essay on. But she will specify what themes can be selected for each question.  She hands out the questions a week before they are due. But it doesnt really help when it is finals/ midterms week anyways. The midterm is the same as the final. Grading: i dont even know. I would say harsh..but then again the class was so random that she doesnt do the grading and another person may grade ur stuff\n"
        }
    ]
}