{
    "prof_info": [
        {
            "prof_name": "Robert Beer",
            "prof_id": 2149,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Chemistry II ",
            "review_date": "May 30, 2016",
            "review_content": "\nProf Beer isn't that bad. \nAfter reading the CULPA reviews, I was nervous to take Chem II with him and thought it was going to be a horrible experience. However, it wasn't bad at all and I actually did better this semester than last semester in Savisky's Chem I.\nChem II is a lot of problem solving so as long as you know the general concepts and how to employ the formulas you should be fine. Prof Beer also gives you all of the formulas on a sheet so there's no need to memorize them.\nMost people don't come to lecture. In my class of about 100 (?) people, at max. 30 people would come to lectures. Prof Beer writes on the chalkboard, which initially was kind of annoying because I was used to powerpoint, but you get used to it after a few classes. He also posts all of his lecture notes on courseworks.\nThe lectures can be pretty dry, especially when he derives formulas, which is unnecessary because he gives them to you on every quiz and exam. However, he usually explains the concepts well, although I'd recommend doing the textbook reading and taking notes before coming to lecture so you already have a better grasp on the material.  He also goes over problems in class that usually appear in a slightly different form on the exams, so it's important to know how to do those.\nSharon was the best TA ever. She makes sheets with important terminology and formulas and chooses problems from the homework questions that are more important. Rose was not a good TA, perhaps from lack of experience. She also speaks way too softly and isn't clear about what she's doing. So if Sharon and Rose are the TA's next year (even in Chem I), definitely choose Sharon. Her quizzes aren't easy, but you can do well.\nThe exams were a lot harder than Savisky's, but the average was also lower (usually around 15-17 out of 25). However, there are problems that you can get each time and its only the last few in each section that are usually more difficult\nWorkload:\nOptional homework problems (probably around 20 per chapter?), but I'd highly recommend doing them to prepare for quizzes and as extra preparation for exams (besides the 2 practice exams Prof Beer provides)\nTextbook reading - also optional, but helpful (look for the pdf of the textbook online before buying a copy!)\n6 quizzes (but one is dropped)\n3 midterm exams\nFinal exam\nGrading: on a Z scale with 5 equivalents (final exam is 2, each midterm exam is 1  and the 5 quizzes are 1. 1 equivalent is dropped)\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "January 03, 2015",
            "review_content": "\nThe only reason I took Gen Chem with Beer was because it was the only one available when I registered for classes. Beer is a horrible lecturer and you will find that you will be teaching yourself the whole course. Nevertheless, it is important that you go to lecture so that you know what was emphasized so that you can do well on the weekly quizzes given by the TAs (who actually do not do much to improve your understanding of material in the course). Exams are multiple choice, so if you're not great at MC or guessing you will definitely not do well in the course. Beer uses Z-Scores so you will not know your grade in the course until it is posted on SSOL. \nIf you have the option, do not take this class with him.\nWorkload:\nSuggested problems but no graded homework.\nQuizzes each week unless there is an exam.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 07, 2014",
            "review_content": "\nI will preface this review by noting that I had taken AP Chemistry before and had some grasp of some of the material, and was mostly taking the class as a refresher course (hate me if you will). I suppose it will be difficult for me to say more about this professor, and this class, that has not already been said, but let me try anyways. [exceptionally short summary at the end]\nTo note, I believe that most all of the below reviews (except the Aug 9 2007 and Aug 24 2007 reviews) are accurate almost in their entirely.\nMost everyone that I talked to had various levels of not wanting to take this course with Beer, or pity that I had to take the course with him. I mainly cited three reasons that made it desirable for me, at least, to be in this section. There is no need to buy an iClicker, there is no reason to go to lecture, and there is no graded homework. There were also the additional idea that it's a convenient time, in that I don't have to wake up early for it.\nThere is no iClicker is sort of a trivial reason. However, there is honestly no reason to go to lecture. He is a well intentioned man, and nice, and funny, and a great person like most reviews agree upon. He tries to accommodate student desires in lecture and is very responsive to trying his best to answer questions thrown his way. However, he is by no means a good lecturer. He makes weird analogies and has many personal anecdotes (the fact that I know some of them, such as the Technitium story, despite going to t snub out any like for the subject by teaching and testing it in such an arbitrary manner? The majority of people would thrive in a different environment.\nWorkload:\nNo weekly homework, though I did all of the homework despite knowing much of the material a lot of the time. It's a good way to stay on top of your stuff. I approached the class very much as if the professor didn't exist, and I'd say ~5 hours a week taking notes out of the book and doing the problem sets were enough for me. For someone with less chemistry background, much more would probably be required, perhaps up to 10 (this is assuming you don't attend lecture, which honestly wouldn't affect the workload/week because the benefits and deficits balance out).\nGrading is standardized across Gen Chem.\nFinal: 200 points (50 questions)\n3 Midterms: 100 points (25 questions)\n6 Quizzes: 100 points (Each quiz worth 20 points, drop the lowest one).\nOf the 600 points above, the lowest one is dropped (all quizzes are dropped, or one of the midterms) and then he ranks everyone in the class with their point total out of 500, and has cutoffs in terms of z-scores for grades.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 03, 2013",
            "review_content": "\nAlthough Prof. Beer is funny and makes us laugh with his anecdotes, he cannot explain things well. For example, when we learned Psi represents the wave function, he just started throwing the symbol all over the place on the board, while a more clear instructor would say something like \"Psi, the wave function, ...\" for the first few times when writing it. He tends to write things on the board as fast as he can, making too many abbreviations and not leaving time for students to absorb what he just said. The result is that it's easy to become lost if you stop listening for a few seconds to jot something down. Finally, he is bad with explaining by analogy, which is needed in a course like chemistry with so many abstract concepts that you can't see.\nThe homework assignments in this class were all optional, but without doing them there would be no way to pass the course. Yes, I have heard the \"this is a college class\" explanation -- however, it is a college class taken by many SEAS freshmen who are just out of high school. A little bit of structure (and feedback on why homework answers are wrong!) goes a long way to help students succeed in their first semester at Columbia. \nWorkload:\nprobably 5 hours/week if you want to get an A\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "August 19, 2013",
            "review_content": "\nAs someone who have had a solid science background and a great deal of understanding of Gen Chem prior to enter this class, I will not try to speak for everybody. \nIt's not fair to say that the exams are hard or tricky. How should I put this, a 40 year old vigin might find all women tricky and mysterious. A lady's man will tell you Humans in general are mysterious, but there are differences among inidividuals which can be significant. And I'm your lady's man.I usually get above 90% (raw school or ranking) on any given science exams.\nI would have to say, Beer's exam and grading schem are by far, is one of the most straightforward out there. Too straightforward for my lady's man's taste. I love getting the kicks in hard exams--Beating standardize tests is a hobby of mine. \nBeside lacking the kicks, the problem with easy exams is that you can't secure your spot high on the curve just by being on top of your materials. There are just way too many people gettiing above 23 out of a 25 point exam. You can know all the tricks and materials. But one misread of \"NOT\" will destroy your Z-score by a minimum of 0.2. \nIt's not a problem is you don't aim for above 22. For the easy exam will get you an easy B+ easily. \nBeer's lecture is perfectly sensible, logical and concise if you are prepared in advance, but I can see why it might be hard to follow if you have absolutely no clue what he was talking about. My suggestion: just quickly read through every words on the chapter PRIOR to class. It takes no more than 30mins, and you don't need to try understand anything.\nWorkload:\nRequired work load: zero as there is no collected homework. Necessary work load to B+: 2 to 3 hours a week. A or A+ require about 4 to 5 hours a week. 5 to 10hours of study prior to an exam should be more than sufficient. if you have had some Gen Chem experience, multiply the above figure by 70%.\n"
        },
        {
            "course_name": "General Chemistry I and II",
            "review_date": "March 21, 2013",
            "review_content": "\nI usually don't write reviews but I feel I have to in this case. I had two semesters with Beer because he's only teacher who teaches in the evening. Nice guy, pretty funny but he can't teach...seriously. He doesn't use powerpoints, jumps around, isn't receptive to students, and writes his test questions in a way that doesn't readily relate to what we learn in lecture, recitation or the textbook. He messes up his own tests, as though he didn't take the time to look over them at all (questions are numbered wrong, or the right answer isn't one of the choices which he admits afterwards, that type of thing). If you have questions, even about what he meant in a test question, he usually refers you to TA's. \nI really don't know where he gets his exam materials. The exam questions are related to the topics we learn in class but they're more think outside the box, critical thinking questions than anything that you'd be able to actually study and learn from the resources provided. He curves but not nearly enough considering how he teaches and tests. \nI consistently learned twice as much from my TA's in the 50 mins a week I had with them than with Beer in the 3 hrs a week of lecture. The one and only upside to Beer is that he gives good feedback after the tests, i.e. puts up solutions and class performance statistics. It doesn't at all make up for what his teaching does to your grade though. My advice, unless you have a private tutor, keep away from him. \nWorkload:\n3 tests- 25 multiple choice questions on each\n1 final- also multiple choice\n6 quizzes-multiple choice and word problems\nhomework for each chapter- optional, not graded\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "May 14, 2012",
            "review_content": "\nProfessor Beer seems like a really nice guy, but seriously -- avoid taking his class if you can. Especially if you want to major in science and actually want to learn the material. It's very hard to stay awake and jumps from topic to topic pretty sporadically. He also doesn't use PowerPoints, which is more annoying than you'd think. Sometimes you just have a gap in your notes (because he moves really quickly and isn't very good about writing down what he says on the board) and you simply want to review -- BUT YOU CAN'T! I found it incredibly annoying. Students who have already taken AP Chemistry tend to find his class pretty easy (apparently his tests are easier than most), but if you have just high school honors chemistry under your belt, it's not likely you'll get above a B+.\nWorkload:\nNo homework, just three exams and a final. \n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "May 10, 2011",
            "review_content": "\nI think the previous review was a bit harsh. Yes, he makes a bunch of mistakes in his notes. But I never had trouble contacting him by e-mail. Although I never tried to go to his office hours.\nI also think if you find it hard to learn things from him, his two TAs are amazing. I had Zak, who is really on top of his chemistry and goes out of his way to teach you anything you ask about. Zak's quizzes are tough, but the curve is generous. \nI'm a chem or biochem major, and I honestly didn't find this class bad. It's very straightforward. The notes are put up on online on the first day, and there really is no point to showing up to lecture, which I appreciated considering my other classes were kicking my ass.\nMy only recommendation is not to take this class in the evening. Taking tests this late in the evening really has an effect, and I think my grade might have suffered from that.\nWorkload:\nProblems sets that you don't have to turn in, 3 midterms (all curved generously; average is usually something around at 18 or 19 out of 25) and a final. \n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 05, 2011",
            "review_content": "\nWhen registering for classes there were two second semester chem options. The first was taught by Gonzales/Kaufman in the morning and then there was this choice: Professor Robert Beer taught Mondays/Wednesdays from 6:10 to 7:25. Me and my friends contemplated which class to take and decided we would take Beer's class, thinking that it would be pretty easy because it's a night class so there would definitely be a bunch of post back people. Let me tell you this much. Taking Beer's class was THE WORST DECISION OF MY LIFE. First semester chem was really easy. I got an A in it without a problem. I know a lot of people had Beer for first semester as well and said it was a great class so it might just be the material. But Beer for second semester is the WORST. He posts all his notes online so there was never any point of going to class because he would literally read his notes word for word. Sometimes it sounded like he didn't even know what he was saying. He could barely explain some of the material himself. \nWorkload:\nWeekly quizzes which are impossible! Both TA's were horrible! Standard chem hw/reading\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "April 25, 2011",
            "review_content": "\n  If you are a Post-Bacc, or a CHEM major, take this review into consideration.  \nRobert Beer as a PERSON: \n  seemingly amusing and funny, makes jokes in class, looks like a distant cousin of Robert Downey Junior.  I feel like I want to be his friend.\n  Robert Beer as a General Chemistry TEACHER:\n  Completely 100% Sucky, Awful and BAD.\n  He makes mistakes in lecture constantly and the TA's or, usually, other students, have to correct him.\n  He rarely returns an e-mail.\n  He is almost never on-time to office hours and often does NOT SHOW UP to his office hours.  I know two people that e-mailed to ask if they could meet him during a specified office hour and he did not respond the to the e-mail and also did not show up for even one minute of his office hours.\n  Also.  He posts his notes on Courseworks.  His notes - the ones you're supposed to study from - are chalk full of mistakes. \n  If you are someone who goes to class, doesn't have many questions, and is just taking Chem b/c you have to take it and are maybe not necessarily interested in it as a subject, then this class is just fine.\n  If you are a post-bacc, a chem major or someone who actually finds this stuff interesting and like to put in extra work, take another class b/c this professor does not put any effort into even pretending to care.\n  Oh ya, also, he scheduled the third midterm on Passover this year which was the weekend after Easter, the holiday I celebrate; so instead of getting to spend time with my family b/c usually I go home for this holiday, or even getting to celebrate Easter for more than the 45 minutes I spent in Church, I got to sit in a library all day and look at my Chem textbook. Oh, I'm sorry, was it far too much trouble for you to look at a Calendar and see that the day \"April 25\" had the word 'Passover' in Big Bold letters? Or that 'April 24' had the word \"Easter\"? I'm so sorry that was such a hassle, asking a Chem Professor to schedule exams accordingly so that they are not on religious holidays (like Columbia ASKS you to do) is really just far too much to ask.  \n  Bottom line: He should not be teaching at an Ivy. I don't care where you got your PhD (i think he got his from MIT); be responsible and show up to office hours or answer an e-mail and stop making a million mistakes in class that other students correct (how confusing is that for the students that DONT get it??).\n \nWorkload:\nassigned upgraded 'homeworks', 6 quizzes only 1 is dropped (as opposed to 2 that were dropped in previous semesters), 3 midterms, i final. All doable if you study. Easy B, A takes some extra work.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "June 01, 2009",
            "review_content": "\nIt is not difficult to do well in this class because he curves very generously.  I think something like 48% of my class ended up getting an A- or better.  I actually took C1404 with him (not 1403, but 1404 was not a choice).  I took the first semester of gen. chem with a different professor and I found Professor Beer's class helped me actually learn the material better.  He does not use powerpoint, which I really appreciated, because I thought that was more of a hindrance than a help in my first semester class.  He posts the lectures online after class, which I also liked because it forces you to pay attention and take your own notes in class.\nOverall, his tests are pretty easy to prepare for.  He gives a review outline and a practice test.  If you fill out the review outline (I usually tried to compile my lecture and text notes plus his lecture notes into a study guide for the test using this outline) and understand all the questions on the practice test you'll be fine.  Sometimes the way he words questions can be confusing, but don't stress too much about this, because if it is legitimately confusing and most of the class gets a problem wrong, it will be dropped from the test.  He is pretty fair (maybe even too fair sometimes) about this.\nI didn't think he played favorites or disdained people who needed extra help like another reviewer mentioned (I am basically science-retarded, so I needed a lot of extra help).  Sometimes he makes mistakes in lecture, but he or the TA always caught the errors. \nOverall, I found him much more approachable than other professors in the chemistry department, and though there are parts of him that are unimpressive, I thought he was a good professor and as far as general chemistry goes, I think his class is a good choice.\nWorkload:\nHomeworks corresponding to the chapters you're doing (about once a week to once every two weeks - he does not check it), 6 quizzes (2 are dropped), 3 midterms, and a final.  Quiz total and midterms are each worth one equivalent, final is worth two equivalents. You get to drop your worst equivalent.  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 23, 2008",
            "review_content": "\nI have to disagree with aspects of the previous reviews.  I was in both sessions of the class, and found him to be quite unhelpful.  \nHe has a tendency to play favorites with the people whom he likes because they're on top of the material and helps them further, while being less helpful to those who are having issues with the material.  Oddly, he even played favorites with the classes (term I vs term II), telling the term II class that he liked them better.  I found this bizarre for a professor and indicative of his general attitude.  \nAs for his exams, in this case, I do actually agree with the previous reviews.  His tests were generally fair, had the occasional mistake and he adjusted them based on the experiences of the students.  The material is dry, but he does an OK job with what he has to work with.  He occasionally deviated from the material in the book by going into more depth (ex: heisenberg principle of uncertainty), but nothing major. \nOverall, fair, but I found his attitude towards those who wanted/needed help contrary to what one would want in a teacher. \n\n"
        },
        {
            "course_name": "General Chemistry (Summer Session)",
            "review_date": "August 24, 2007",
            "review_content": "\nOverall, a good/fair professor. After reading the first few reviews on CULPA from 2004, I was frightened of him. In reality, he was a pretty nice guy. His lectures were dry and straight from the book, but that's expected of a gen chem professor. He knows his stuff, and tries to answer any student questions. He takes student input seriously, as he would take in student comments and adjust his tests accordingly. The tests were fair and didn't have many mistakes (they were usually minor: spelling/grammar errors, etc). Overall, I found it to be a fair class. \nWorkload:\nTwo p-sets a week (only 5-6 problems), 2 quizzes, 3 tests, 1 final. Study and you should be fine.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "August 09, 2007",
            "review_content": "\nProfessor Beer is an excellent teacher. I was a little worried going into this class based on past reviews, but it seems he has taken in a lot of feedback and changed his methods. He genuinely cares about the success of his students, a rare quality in freshman lectures, and asks for as much input as possible to make his students happy. \nHis grading was extremely fair, and even adjusted it after the class had started to accommodate students' schedules and workloads. He teaches the class much like a high school class, which some students may not like. However, the fact that he takes the time to write notes on the board instead of just throwing up some powerpoint slides is a better method of teaching, in my opinion. It gives you time to absorb the material, rather than just scribbling down notes and trying to understand them later.\nBy far one of the best teachers I've had so far. Great guy. \nPlus, his stories are amazing and keep class interesting.\nWorkload:\nSummer class, so workload is kind of heavy.\n2 homeworks and a quiz each week (10%), except exam weeks (can drop lowest two grades). Exams every 2 weeks (20% each). Final is 30% of your final grade. As long as you stay on top of the work and don't put it off, it's easy to keep ahead.\n"
        },
        {
            "course_name": "Gen Chem (summer)",
            "review_date": "September 03, 2006",
            "review_content": "\nSo I'm not sure if Prof. Beer read up on previous culpa reviews, but my experience wasn't that bad.  Everything was completely fair (tests/ quiz/ hmwk).  The only thing that can be particularly difficult is the material.  His tests were doable (there were mistakes every once in a while, but really not a big deal).  And he is a very nice guy.  He really wants people to learn the material.  Like most science courses, his lectures can be quite dry.  So, don't fear this class if you have to take it.  Just do the work and you'll be fine.\nWorkload:\nalot (but it is only a month)... almost 2 problem sets and 2 quizzes a week... a test every other week.  \n"
        },
        {
            "course_name": "GChem Summer Session",
            "review_date": "November 08, 2004",
            "review_content": "\nThe problem with Prof Beer's tests wasn't even so much that they were difficult, unpredictable, and often vaguely worded, but that the number of mistakes in the question statements and his later refusal to admit said errors rendered the tests impossible to complete. I don't believe that he managed to write a single exam in either semester that didn't have at least one major error in it that was caught either during the test (after most students had expended a lot of time fruitlessly struggling to solve it) or afterwards, when the TA went over the exam in recitation.\nPerhaps it would have helped if prof beer actually came up with an answer key instead of handing off that task to the TA  after the test had been administered or even if he had just, you know, read over the exam once before giving it. \nThe worst example came up during one of the later exams of the second session when he provided a table of data which did not include the necessary information to solve the problem because he'd copied the wrong stuff. When this was brought to his attention after the TA and class discovered it while going over the test solutions during recitation, did Beer throw the question out or give the points to everyone free? No and no. He had the TA grade the question according to \"how much it looked like the student would have been able to answer it had the table been correct.\" What the hell is that? I felt bad for the TA.\nWorkload:\nfrequent impossible exams, lengthy  final\n"
        },
        {
            "course_name": "GChem Summer Session",
            "review_date": "November 08, 2004",
            "review_content": "\nThe problem with Prof Beer's tests wasn't even so much that they were difficult, unpredictable, and often vaguely worded, but that the number of mistakes in the question statements and his later refusal to admit said errors rendered the tests impossible to complete. I don't believe that he managed to write a single exam in either semester that didn't have at least one major error in it that was caught either during the test (after most students had expended a lot of time fruitlessly struggling to solve it) or afterwards, when the TA went over the exam in recitation.\nPerhaps it would have helped if prof beer actually came up with an answer key instead of handing off that task to the TA  after the test had been administered or even if he had just, you know, read over the exam once before giving it. \nThe worst example came up during one of the later exams of the second session when he provided a table of data which did not include the necessary information to solve the problem because he'd copied the wrong stuff. When this was brought to his attention after the TA and class discovered it while going over the test solutions during recitation, did Beer throw the question out or give the points to everyone free? No and no. He had the TA grade the question according to \"how much it looked like the student would have been able to answer it had the table been correct.\" What the hell is that? I felt bad for the TA.\nWorkload:\nfrequent impossible exams, lengthy  final\n"
        },
        {
            "course_name": "General Chemistry (Summer Session)",
            "review_date": "August 10, 2004",
            "review_content": "\nThis is not a class to take. I mean NO. The exams don't test your knowledge. Hard work does not make a good grade, in fact, if you work hard, you'll do worse. If you study from the book, the book is wrong, if you study from the notes, the prof had a bad day,and those are wrong as well. \nWhen you sit for the test, sit in the front so you can't hear the mutters of disaproval in the back, and so you can leave after you realize you don't know what you're doing. He's a good guy, he buys you doughnuts so you can have a full stomach while sinking in the pit of despair. \nhe wants people to do well, but he doesn't understand that if we dont learn the material that he tests us on, then we cant do well.\nIf you are taking chemistry because you want to get ahead, its better to just deal with Mc Dermott or Brus, atleast you wont be covering the material in 6 weeks.\nWorkload:\n(3) tests 20% final 35% homework 5%\n"
        }
    ]
}