{
    "prof_info": [
        {
            "prof_name": "Seyhan Erden",
            "prof_id": 13635,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Econometrics",
            "review_date": "May 04, 2021",
            "review_content": "\nI want to set the records straight before my review that I passed the class with an A so my review is objective. to state it bluntly if you care about acquiring a decent knowledge about econometrics and its application to your field of study and of course your grade stay away from professor Erden. \nAlthough she seems pretty responsive and always ready to answer questions that are a trap in disguise. First of all, you need to do all the work on your own from reading the book to understanding the application of state and its command and the intuition behind every single interpretation and command and its relation to the real world because if you think you will understand one concept diligently by attending the class you are tremendously mistaken! \nAt first, she was going at a slow pace and it seemed like a breeze and unlike what everyone else before described but man once we hit the third chapter she only cared about finishing the program despite most of the TAs being absent because of the strike and she knows how crucial the understanding of state is crucial to answers the problem set in a decent way of assimilation but she kept on rolling with the lecture and the material while brushing through her notes with a total disregard to our understanding of the most important part which state and its interpretation. I found the material of the class pretty interesting and gripping and I was eager to learn at first but her utter lack of pedagogy disorganized way of teaching and lack of practice when it comes to the real shit was an incentive to never come to class and learn the material elsewhere. You have to do your due diligence outside the class in order to get a slight grip of what is rumbling through during the class and that if you are a quick study. Let's not mention the disastrous and fiasco around her problem sets that keep on repeating themselves every single semester with the answers already published which make the grading unbearable to approach. The question is nothing close to what we covered in the lecture and the level of sophistication of proof demonstrations that are being asked are outside of the scope of what was covered in class! \nShe is also very inconsiderate when it comes to answering emails that are noted as important or urgent or time-sensitive. she is also very insensitive and inconsiderate when making extremely disrespectful and rude comments in front of the whole class. the midterm was a disaster and she did not take into consideration the condition of the exam and its impact on students which made it hard to even skim through each question. For the final, the fiasco was indescribable as she shoved 4 additional chapters that were barely covered in class. it's ironic how she mentioned in class the fact that she makes it hard for us to earn decent grades and it's because she wants us to learn but the vast majority ended up scarred for life hating the subject and neither learning nor earning good grades. I was an exception because I basically busted my b** and it felt like a 3 class, not one.\nfor the midterm and the final she prepares a slide with note lecture that she regurgitates and read in a lousy way without any practice or any chance to practice your mistakes and she calls it a review don't expect to get any sample exam or test.\nOne of the worst classes I've had so far and I've had my shares of bad ones.\n\nWorkload:\n8 horrible problem sets unrelated to class material\n1 midterm without any practise or review\n1 final without any review\npoll questions that beyond stupid and nothing close to what you ll have in the tests or pb set\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "April 29, 2021",
            "review_content": "\nProfessor Erden is a good professor. She listens to student input when she can but also respects the boundaries that have previously been set when necessary. I was very nervous about taking Econometrics, but I ended up okay. I was a little less than one standard deviation above the mean on the midterm and final, and I ended up with an A- in the class. \nIn an online world, this course tests knowledge and application of Stata/R commands in exams. In in-person format, Prof Erden says proofs are tested on exams. Taking an online exam on Stata/R was a bit difficult, but she made the final a bit easier on us and gave us enough time to complete it. \nPSets take a long time to do, especially if you have no Stata/R background. Find a TA with a teaching style that matches your learning style, and this will help. Of course, the TA strike did affect me, but somehow I ended up doing okay in the second half of the semester. \n\u2028Erden seems to care about students more than most professors. I appreciate her ability to cut off certain students who monopolized class time by frequently interrupting with questions. \nIt is unfortunate that the lectures were not recorded for students in different time zones. She also does not post lecture slides before class, but she provides fair reasoning for it. It did help me take better notes during class. \nIn summary, I’d recommend you take her section. \n\nWorkload:\n8 PSets for 30% (expect to spend 4+ hours on these, lowest score dropped) \nMidterm \nFinal (non-cumulative)\nPoll Questions in Lecture for 5% (1 point for answering + 1 point for correct answer)\nGrade Breakdown: 0.30*PSets + 0.30*(min Midterm, Final) + 0.35*(max Midterm, Final) + 0.05*Polls\n"
        },
        {
            "course_name": "Econometrics of Time Series",
            "review_date": "April 09, 2021",
            "review_content": "\nI went into the class worried that I was over my head, considering how scary the name of the course sounds. However, I couldn't be happier with the class and with professor Erden. Her Psets are very fair and easy to accomplish. She teaches pretty well too, a good mix of slides and \"whiteboard\" writing. She emphasizes the application of the material through STATA instead of pure theory, which makes this class one of the most useful and applicable classes Columbia has to offer. She's also very attentive to class feedback and is willing to offer options so the class does well, appreciate it.\nThe only negatives are that her quizzes (two total, one taken so far) are difficult to finish in the time constraint since it is a Pset-sized exam that requires STATA, which isn't very cooperative at times. Also, class attendance is required since she doesn't post zoom recordings. \nWorkload:\n7 Psets, about once a week. About 1-3 hours to complete. Fair quizzes with limited time and the choice of a paper or exam for the final.\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 11, 2021",
            "review_content": "\nProfessor Erden is a very reasonable and approachable professor. Her lectures are clear and slides are comprehensive. The textbook is well written, and follows the course closely. \nThat said, Econometrics can be a challenging subject given the nuances of implementation in STATA and the amount of math. Furthermore, the grading can be rather arbitrary because very little partial credit is offered. If you are meticulous and follow along with each lecture, this is a standard difficult course. Lots of the learnings around causality, regression, difference in difference are needed for learning economic papers and doing more rigorous work in later classes, so the content is actually quite useful. The curve is not generous about 1/3 A, B, and C or worse, but this is a department policy. Too many people inappropriately displace their anger at the subject matter, TA grading, and departmental curve towards Professor Erden. She's fair and good at explaining concepts, especially the big ideas. \nWorkload:\n8 Problem Sets (4 to 8 hours each, 1 dropped) + Weekly Recitation + Midterm + Final (Studying for exams can take some 10-20 hours to do well), try to stay 1 standard dev above on exams and slightly above on psets to get an A\n"
        },
        {
            "course_name": " Introduction to Econometrics",
            "review_date": "August 19, 2020",
            "review_content": "\nErden is the best!! She makes econometrics understandable and approachable with examples in life, and her humor is a bonus point. She cares about students' well being and is approachable for office hours. I never regret taking her econometrics class.\nTA's recitations are not mandatory but necessary for you to do your problem sets. Erden's lectures and exams go with STATA, which will be taught by TAs. No prior programming skills needed.\nWorkload:\nHeavier than general econ classes (i.e. Stats, Calculus III, Micro, Macro).\n8  problem sets: 25%\n1 Midterm: 30%\n1 Final: 45%\nIf midterm score > final, midterm =45%\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "December 23, 2018",
            "review_content": "\nDon't do it. You'll be regretting to rambling lecture with homework you'll have to try to mine the book in order to understand, and then be blindsided by tests which are way beyond what's been discussed in class. Pretty difficult to get even an A-.\n\nWorkload:\nToo heavy\nWithout spending at least 30 hours a week, never possible to get an A\n"
        },
        {
            "course_name": "Advanced Econometrics",
            "review_date": "December 18, 2018",
            "review_content": "\nSeyhan Erden is a horrible instructor (self-claimed \"professor\") and possibly the worst out there in the Department. She is good at acting and equivocating. She did not carefully proofread her slides beforehand, which were shambolic and full of errors. She called upon students to proofread for her and told them she would give them credits, while in fact the vast majority of her slides were simply copied from Greene's textbook (very intriguing that she could copy it erroneously) and she did not even bother to give Greene the deserved credits. Her exams were not error-free and the questions she chose to test did not represent well the content she covered in class. She jammed students with extra slides to study on their own, yet refused to answer clearly questions on her slides. She dictated the grading of the exam - adding points to students' exams on a random basis. She also threatened the TA for not standing on the same side with her.\nBeing her student for one semester is the most interesting experience one could ever have. One has the opportunity to witness jokes every lecture - seeing someone pretending to know everything but every five or ten minutes being stuck in basic course-related questions and mistakes on the blackboard.\nIf you have extra money and time and just do not care, take this course.\nIf you truly care about econometrics or the scientific approach or pursuing a Masters or PhD degree in economics, stay away from this \"amazing\" \"professor\". Her very teaching has indeed brought Columbia's education to the next level.\nWorkload:\nLittle during the academic weeks - because she deleted her own PSs on a frequent basis.\nHeavy during the final review week - she uploaded all the slides she had, only 50%-60% were actually covered in class. Most of the time, she just glossed over the contents and jam the students with basic ideas. But for the final, you are supposed to know everything that is on the slides except for the ones that have been ruled out by her on Canvas.\n"
        }
    ]
}