{
    "prof_info": [
        {
            "prof_name": "Severin Fowles",
            "prof_id": 2865,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 09, 2017",
            "review_content": "\nRead the other reviews. Sev (he's not one for formality) is a phenomenal professor and engaging lecturer who has changed the way I see human history. (Sounds dramatic, but take the class, pay attention, and it won't sound so crazy.) I'm not gonna spend my time going into this, because I mostly want to talk about the workload. There was a LOT of it, but not all was necessary. The key to doing well is actually paying attention in lecture and taking good notes (big surprise there). Since he goes over everything important in class, and the stuff he talks about for a long time is generally what's on the exams, it feels pretty straightforward. \nFeels like a lot for an intro, but if you don't do all the reading, the bulk of the work is in the end when you need to write a total of between 4500-5500 words in the last couple weeks. Definitely doable, and it was way too interesting for me to mind that much. Take this class. \n\nWorkload:\ndaily (long, often dry, but sometimes unexpectedly cool) readings that he supplies and goes over in class. I'm pretty sure that I didn't read a single reading after the midterm and still got an A\ntwo books that you might or might not like (I read between 50-75 pages of each and did not need to read more)\n3 short (900 word) essays whose prompts are very vague and open-ended (these are graded generously and only worth 5% each) \nan in-class midterm (3 short answer, 2 long essays with the long essay prompts given ahead of time)\na 2500-3500 word term paper on literally anything you want\na take-home final with two questions, 1000 words each, collaboration allowed. \n \n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "November 07, 2013",
            "review_content": "\nI took Origins my first semester of my freshman year to fulfill part of my major requirement. I am an anthro major so I was really excited to take this class, and Sev didn't disappoint. The beginning of the semester is more sciencey in that it focuses on the physical differences in hominin species. But then it becomes really deep and philosophical when it comes to tool making and cave art. Sometimes, I felt lost because it was just too vague and there weren't many concrete facts. Sev is a really great guy though, he doesn't just lecture at you. He answers questions and makes jokes, and I would highly recommend taking at least one class with him.\nWorkload:\nTwo film-based responses, a midterm, a term paper and a final. The film responses were 3 pages each and counted for 5% of our grade. He gave us a lot of freedom when writing them, which I personally struggled with. But as long as your responses are well-written and thought out, an A is easy. \nSome readings aren't necessary, but there are a few that you really should. He'll let you know which ones are really important because he refers to them in class.\nI never really felt burdened by the workload. It's only annoying to catch up if you haven't done important readings but he does go over the important ones in class.\n\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "November 20, 2012",
            "review_content": "\nI really assumed that this class would be a great way to try out Anthropology, a subject I'd never studied before, and after reading the reviews, I was confident in my choice. However, this is NOT an introduction to anthro whatsoever. It is confusing and unclear. The readings are extremely lengthy, and despite the fact that there is not much graded work, I constantly feel bogged down. The expectation in this course is that everyone will go on to pursue a career in either anthropology or archaeology, neither of which I have any interest in. I also have a problem with the way in which Sev organizes his lectures, specifically there is no organization. He is obviously very passionate about it, but he jumps around, goes too quickly, and talks at the same time as having something obviously important written on the powerpoint without explaining it. We will talk about something very vaguely for probably 3-4 class sessions and then finally he will explain it clearly by the end, but it's all very confusing. In other words, unless you want to be an anthro major, I would not recommend this class. \nWorkload:\ntons and tons and tons of reading. midterm that is easy to do well on since he gave us the essay questions beforehand, ridiculous research paper (how are intro students expected to rewrite Rousseau's discourse on inequality...) and final\n"
        },
        {
            "course_name": "Pre-Columbian histories of america",
            "review_date": "May 16, 2012",
            "review_content": "\nSev is a glorious teacher. He is inspired and inspiring. He teaches using slides of funny, insightful, problematic, and thought-provoking images to supplement his knowledgeable discourse on the native american peoples who inhabited this continent before european colonialism. he is intimately familiar with this area of study. \nhe is good at being responsive to student input while not compromising the facts (he'll tell you when an idea is brilliant, or interesting, or wrong). he is very friendly and very helpful, so talk to him about your interests/research/assignments. He also gives good feedback--useful feedback that will help you work better in (and out of) his class. \nhe is not a harsh grader and it is very possible to do well in this class if you read the assigned texts and if you're a decent writer. \nwe covered fascinating, surprising native american cultures and examined their relationships to our world today. when you take this class, you'll realize how bizarre it is that most americans know so little about real native american civilizations. highly recommended. \nWorkload:\nkind of heavy. about 3 articles a week plus 5 short essays (2-5 pages each). the main heft is at the end of term--both a 12 page term paper and a take home essay-based exam. \n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 20, 2011",
            "review_content": "\nSev is absolutely unbelievable. He and this class changed how I view the world. I know that sounds cheesy, but it's absolutely true (and it's not something that happens often). If you have the opportunity to take a class with him - take it. I took this one because it was a major requirement; I expected it to be a run-of-the-mill intro level course. It ended up being my favorite class at Columbia so far.\nWorkload:\nHeavy for an intro class. We read a textbook and two other books (those other two in their entirety). One was okay (After Eden) and one was phenomenal (Hierarchy in the Forest). One 10-page research-based term paper (rather thought provoking and by no means easy), mid-term (questions distributed far in advance), final (questions distributed in advance)\n"
        },
        {
            "course_name": "Archaeology of Idols",
            "review_date": "October 29, 2009",
            "review_content": "\nawesome awesome class. this anthro department is really balanced out by Sev Fowles. It seems that everyone is writing good reviews on him, so I will focus on the class.\nThis class moves from idol worship through fetishism and anthro theories on magic into iconoclasm and art theory. its awesome\nHe loves archaeology, but really engages in a ton of other theory- and never fails to make it relevant to us and whats happening in our world. current events are not tangents, but rather excellent illustrations of what we are talking about and great ways to tie the theory together and animate it.\ni love him and his classes. couldn't praise his classes enough\nWorkload:\na lot---------- a lot of enjoyable work. \nweekly blog posts, midterm paper and hefty 15-20 page final.\nbe creative!!\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 20, 2009",
            "review_content": "\nSev is absolutely fantastic. I took this class not really knowing anything about anthropology and left it seriously considering a major/minor. Somehow, he manages to make lectures full of the same stone tools and unrecognizable old bones fresh and intriguing. He has a great sense of humor and goes out of his way to be available to students (great considering how large the classes is: 100+ students). You can tell that he absolutely loves his work (he focuses in archaeology) and wants to spread that. He's an incredibly fair grader and is willing to recognize tests and due dates that are unfair. \nWorkload:\nIt's an anthro course, there's lots of reading involved (it's usually pretty dry and boring, but he'll go over the important stuff in class). There are discussion sections (NOT mandatory, but helpful) that are led by the TAs and meet every week.\n2 essays with very vague, open prompts--you have to think outside of the box, which can be difficult for students used to the basic thesis-reword whatever the professor's opinion is-conclusion essays that we usually write. He's a fairly easy grader on these. He assigns some one page response papers to articles as well, but nothing difficult.\nThe midterm and final were a bit difficult (the class covers a couple million years), but he's a fair grader.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 13, 2009",
            "review_content": "\na very engaging professor. he combines archaeology with a lot of philosophical questioning to make for a fascinating class. the papers and exams were well-designed to encourage that fascination. it's possible to not do the readings because he covers them well in lecture, but you'll want to anyways. this class made me decide to major in archaeology.\nWorkload:\naverage reading. midterm and final papers (5-7 pp.) and exams very manageable.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 10, 2007",
            "review_content": "\nSev's basically a rockstar professor. So organized in lecture, accessible outside of class, totally into his material/loves teaching it, very fair in terms of grading, and just overall rad. He presents sometimes boring material in the best way he can, really wanting you to learn. He calls archaeological sites sexy, and just gets generally excited about the material. The paper topics were cool, and the midterm/final reasonable. Reading was what you'd expect for an anthro course, but he picks really interesting articles/texts that you don't mind reading. I oftentimes treated the readings for this class as reprieve from my other classes. I'm hoping to take more classes with him.\nWorkload:\nreading: a lot, but interesting; midterm: long, somewhat hard, but he gave extra time in the end; final: 4 essays, non cumulative; essays: 2, both 6-8 pages, interesting topics that really make you think.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "April 06, 2007",
            "review_content": "\nSev is great.  He asks you to call him that by the way.  He's very friendly and open with students and always willing to help out after class or meet with you elsewhere.  As far as the lecturing goes, it gets a little boring at times, but most of the matieral is very facinating, you just have to get beyond his quiet voice and dry humor.  As far as grading goes, he's easy on the papers and hard on the exams.  The exams are extremely hard and encompass every single thing you learn in class, so when studying, dont leave anything out. Other than the hard grading, he's a wonderful teacher and great friend, actually!\nWorkload:\n2 papers and in class mid-term and final (small curve, if any)\n"
        },
        {
            "course_name": "Anthropological Theory I",
            "review_date": "January 22, 2007",
            "review_content": "\nThe material for this class is boring and dense, but Sev really does try his best to get through it.  He always runs out of time, and he seems rarely to make a succinct, clear point about any of the theorists' work--not that any of their work can actually be translated into simple terms--but the personal responses he wants in the papers demonstrate his desire to make the class applicable to students' own interests and experiences.  If you have to take anthro theory, you're probably better off taking it with Sev than with anyone else.\nWorkload:\nWorkload is as described by others reviewing this class: 4 papers and a 5th rewriting of one of those 4, a presentation on a scholar, no midterm, no final.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "January 02, 2007",
            "review_content": "\nSev is a great teacher, an amazing lecturer and the nicest person I have ever met. \nHis lectures are very well-structured and his presentations are so interesting that the attendance was almost 100% on every lecture (something that is extremely rare for a class of over 100 people).\nWe covered a lot of material and millions of years of human history so expect lots of reading. BUT every single assigned reading is so interesting that it was hard to put the book down. \nGrading is fair, exams and papers are enjoyable and fun.\nOverall the best course I have ever taken at Columbia!!! If I wasn't a graduating senior I would have definitely become an anthro major after this class!! He is THAT GOOD!!!!\nWorkload:\nMidterm and Final that are similar in structure(multiple choice, short answer, image (tool and skeletal!!!!) IDs and 2 essays (he gives the topics in advance);\n2 papers - 6-8 pages each (very cool topics!)\n"
        },
        {
            "course_name": "Anthropological Theory I",
            "review_date": "December 22, 2006",
            "review_content": "\nI love Sev because he is genuinely interested in the contributions of his students. He speaks to us like we are the next generation of anthropologists.  He also tries hisdamnest to make dusty old texts relevant - omissions from the anthropology canon and more nuanced sentiments of particular anthropologists uncovered and contextualized within his meta-narrative of the field (he draws great ugly pictures of the ever-receding homunculus and diagrams of \"the third thing\" to boot). Sev's enthusiasm and investment in the class compelled me to think deeply about the material.  Class often ran a minute or two late but I usually wanted to stay longer. Sev hand-grades all submissions and gives each one considerable thought (5 4-5 page response papers responding to different units in the class, worth 50% of grade. 30% of grade is class participation, 20% is a profile of a scholar, presented in collaboration with a couple other students via power-point the first ten minutes of class. All of this is highly doable, especially because with deadlinesSev is fuzzy around the edges).  He is generous in his feedback, provided you put a real effort into your ideas.  As a teacher, Sev is humble, well-read and idealistic - these qualities trounce any delay in handing back writing or forgetting to look at the clock.\n\nWorkload:\nA lot of reading which is negotiable - tell him if you are being overloaded!\n4 5 page response papers responding to different units in the class, worth 50% of grade. \n30% of grade is class participation\n20% is a profile of a scholar, presented in collaboration with a couple other students via power-point the first ten minutes of class (ran longer in general). These cover the life, major theories, and critiques of the anthropologist we read for that day.\n"
        },
        {
            "course_name": "Anthropological Theory I",
            "review_date": "December 18, 2006",
            "review_content": "\nSev is a great guy--no question about that.  He loves the material, is excited and engaging, and really cares about his students.  At the same time, however, I absolutely hated this class.  The material is boring and repetitive; Sev's lectures were longwinded and always got derailed by unrelated student questions; the student presentations were a joke--obviously just copied off wikipedia.  Every class we ran out of time and as Sev struggled to get in a last few thoughts I looked at my notes and realized he'd been talking for 75 minutes but I hadn't learned a thing.  It's a requirement for the Barnard Anthro major, so there's no way around it, but hopefully they'll come to their senses soon and revert back to \"Living in Society\" which apparently was the one mandatory course they offered that uses contemporary ethnographies and theory that still is useful and relevant today.\nWorkload:\n4 essays, a presentation, and online postings...all graded super leniently.  deadlines very flexible.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 13, 2006",
            "review_content": "\nThis man is amazing- great professor, always accessible in and out of class, funny, organized, and a clear lecturer. This class covers A LOT of material (around 8 million years worth), and some of it can be a little dry. Although I have little interest in prehistoric humans and communities, I enjoyed this class because Sev's passion for the subject overflowed into every single lecture. He showed us clips of \"2001: A Space Odyssey,\" organized a flint-knapping day AND a field trip to Baker's Field for an atlal throwing contest. Needless to say, he is enthusiastic and dedicated to his students. Always open to questions in class (which is rare in classes of 100+), very organized lectures, but since there is so much material sometimes it moves very fast. Take this class not for the subject but for the privilege of experiencing Sev.\nWorkload:\nlots of reading, but Sev takes the time to choose very interesting and sometimes controversial books and articles- and most of it will help you on exams. 2 papers (6-8 pgs), midterm, final which are challenging but not impossible if you attend class (why would you skip, this guy is awesome) and generally keep up with readings\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 13, 2006",
            "review_content": "\nThis man is amazing- great professor, always accessible in and out of class, funny, organized, and a clear lecturer. This class covers A LOT of material (around 8 million years worth), and some of it can be a little dry. Although I have little interest in prehistoric humans and communities, I enjoyed this class because Sev's passion for the subject overflowed into every single lecture. He showed us clips of \"2001: A Space Odyssey,\" organized a flint-knapping day AND a field trip to Baker's Field for an atlal throwing contest. Needless to say, he is enthusiastic and dedicated to his students. Always open to questions in class (which is rare in classes of 100+), very organized lectures, but since there is so much material sometimes it moves very fast. Take this class not for the subject but for the privilege of experiencing Sev.\nWorkload:\nlots of reading, but Sev takes the time to choose very interesting and sometimes controversial books and articles- and most of it will help you on exams. 2 papers (6-8 pgs), midterm, final which are challenging but not impossible if you attend class (why would you skip, this guy is awesome) and generally keep up with readings\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "October 30, 2006",
            "review_content": "\nSev is absolutely amazing!  He made this lecture class come alive with material that could have been brutally boring with the wrong professor.  I knew nothing about archaeology before this course and had no problem with the material. \nSev is incredibly approachable and always answers e-mails within an hour or two of sending them.  This class is also extremely interesting, and definitely not slide/memorization based.  There is a lot of reading, but it's pretty cool and very thought-provoking.  Highly recommended!  Sev is an excellent professor with a huge enthusiasm for archaeology. \nWorkload:\ntwo essays (6-8pgs), midterm, final\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "September 13, 2006",
            "review_content": "\nSeverin Fowles (a.k.a. Sev) is awesome. He is a very organized professor and incorporates loads of interesting facts and images to enhance the world of anthropology. Though his classes are sometimes extremely large, he always takes the time to answer questions and concerns especially during office hours. The workload is what one would expect from an anthropology course...lots of reading. He's very fair in what he assigns and spreads the work out over multiple sessions. \nWorkload:\nLots of reading, but fair in terms of given time to do it in.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "March 21, 2006",
            "review_content": "\nSeverin Fowles, nicknamed Sev, is an AWESOME visiting professor. Please take advantage of his classes while you can!! He is very passionate about his work and really tries to convey what he loves about it to the class. He wants you to like his subject too! He is perfectly fair in everyway, grading wise and workload. For my course, he had a very organized powerpoint presentation every class. He makes the dullest topics interesting! He also encourages people to visit him during office hours for help or just to have a debate on some theory. highly recommended!\nWorkload:\nThis is an Anthro course so of course there is going to be quite a bit of reading but the workload is manageable and very fair. \n"
        }
    ]
}