{
    "prof_info": [
        {
            "prof_name": "Tor Wager",
            "prof_id": 2644,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "September 29, 2009",
            "review_content": "\nAlthough he's great and seems like a professor who a) cares about his subject matter and b) cares about his students, he ends up going into minute detail on the easiest concepts that most people have already had from any high school math class, and skims in a very confusing manner over more complex subjects that are nonetheless tested on/the subject of homework. Lab is alright, but its two hours of excel and SPSS and if you understand how to use them (aka how to follow step by step instructions) you might as well stay home. \nWorkload:\nhomework each week of varying length, but involves basically teaching yourself concepts so is more difficult than necessary\n"
        },
        {
            "course_name": "Neuroscience of Cognitive and Emotional Control",
            "review_date": "April 25, 2006",
            "review_content": "\nTor is a really awesome guy and clearly brilliant beyond comprehension. However, the seminars generally tend to drag on and discussion is never too stimulating. The topics are interesting but the class is just very poorly run overall.\nWorkload:\nOne 10 page paper at the end of the semester, a class presentation that doesn't require TOO much preparation, an article once a week and a half-page write up to go with each article\n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "January 17, 2006",
            "review_content": "\nTor is an extremely nice guy who seems to geniunely care about his students and their concerns.  With that said, I think he was a very difficult professor to have for this class. \n The book is great--very comprehensible and full of examples. His lectures are very well structured and he has detailed and entertaining powerpoint presentations for every class. However, many of the lectures did not follow the book at all.  It was almost as if he was not reading the book.  Halfway through the semester we were asked to give him evaluations of the course and it was obvious he took the suggestions seriously.  His lectures became much clearer and on target (though some were still very obscure and after class many of us were more confused by the concepts than we had been before we showed up). \nThe main problem seems to be that Tor is way too smart to be teaching an into stats class. His knowledge of the subject matter is way over most students heads and teaching basics/breaking down the concepts seems almost frustrating to him at times.  \nlab was helpful--a good way to solidify the concepts or learn them over again if no one understood what had been taught in lecture. learning spss is very useful.\nThe bottom line is that he is a good guy who is brilliant and would be much better teaching a more advanced stats class. Unfortunately, he's teaching an intro class, so its the students who end up with the major frustration.\nWorkload:\nlots and lots of homework--1 assignment every week that takes many hours to complete (sometimes the work is very useful and sometimes it is extremely tedious), as well as having to read 1-2 chapters for every class. there is a lab as well and if the work doesn't get done during the lab period, that becomes homework due the next day. 1 midterm and 1 final.\n"
        },
        {
            "course_name": "Stats for Behavioural Science",
            "review_date": "November 30, 2005",
            "review_content": "\nI'm not sure which class the person above goes to, its certainly not the one the rest of us are in. Tor is a nice guy, and he does try to make the lectures interesting, his examples are relevant, but it is stats after all. We go through two chapters in every class so its four chapters a week- that takes a while given that the lectures and the book do not corelate at all. I have never taken a Math course like this one. We learn the theory behind the problems, but dont actually learn how to solve them! Go figure! The TA lectures were far more comprehensible. Zeljka especially, is awesome. She knows her stuff and is always willing to help. She is incredibly patient, and her bluntness is funny and adorable. The exam was way too long and most of us didnt finish it, apparently it was a similar case last year. I suggest you take the Stats course offered by the Math dept. and take Tor's seminar - he probably does a better job with that. \nWorkload:\nA mid-term and final. Homework every week which takes almost an entire day to complete because there is lots of self- teaching involved. \n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "November 09, 2005",
            "review_content": "\nAs a neuro major, I found this class easy and relatively painless (though I can't speak for people who have never taken calculus).  The math is simple, the work-load lite, and the material immediately useful.  Torr himself is a lively, approachable young fellow who tries to make the statistics intersting by giving relevant examples. However the class covers material very slowly, so going to lecture is entirely optional.  The homework, however, is graded, so be sure to find out when assignments are due from someone who actually attends.  Overall, an easy way to fufill the lab requirement for the Neuro major and the information is actually useful.\n"
        }
    ]
}