{
    "prof_info": [
        {
            "prof_name": "Wendy McKenna",
            "prof_id": 183,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 30, 2013",
            "review_content": "\nProfessor McKenna is pretty bad, but at least her class isn't difficult.  Other reviewers covered what is frustrating about having her as a professor: she doesn't like it when people ask questions, gives uncomfortable and unnecessary examples about sexuality, is a bit of a jerk.  I would say that, while she does cover material very slowly, if you just role with it and remain engaged, what she says will stick and you won't really need to study for the tests.  The tests are very predictable based on what she emphasizes in lecture.  Pay attention to what she bothers to write on the board, definitions she repeats, stuff like that.  If she tells a story, remember the moral, not the minute details.\nI don't think people normally put a lot of thought into whether or not to take Intro Psych.  Either they're thinking about majoring or they want to take the easiest class fulfilling the science requirement. (And yes, this is the easiest class fulfilling the science requirement.  I've every intro science sequence but Astronomy.)  But, consider taking something else.  You can pick up on basically everything we discuss in the class just by talking to educated people.  You're going to talk to a lot of educated people as a student at Barnard or Columbia, and things like the Stanford Prison Experiment and multiple intelligences and whatever else will just come up in conversation.  You can read about them on wikipedia.  This class is not giving you any deeper knowledge than that.\nWorkload:\nWe had three tests (none cumulative, not even the one during Finals), a short paper where we observed people in public places and used psychological terminology to describe what they were doing, and a participation grade.  Yes, a participation grade, she takes attendance and it is annoying as shit.  I missed three or four classes and it didn't affect my grade, though.\nThe textbook is very well written and interesting, but reading it is not necessary if you go to the lectures (and you sort of have to because there's a participation grade).  I got a very solid A just by re-reading my notes, memorizing a few key lists, and skimming some of the chapter summaries in the appendix before each test.  The only chapter I read was the one she told us to more carefully study because she had to skip the lecture on it, and I would've been fine just reading that chapter summary too.  \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "October 03, 2012",
            "review_content": "\ni'm actually in this class right now, not actually listening because this woman is just terrible. in every way possible.\ni write this at the beginning of October, and i am already suffering. i read the CULPA horror stories before taking the course with her, but i had no choice: this section was the only one that fit into my schedule, and i needed to do my science requirement. my friend who is a psych major warned me that this woman is awful. i underestimated this assessment.\nnot only is Professor McKenna a terrible lecturer who wastes a ton of class time by drawing out often creepy examples for an inordinate amount of time. i can't help but be horrified and puzzled when she constantly brings up scenarios, discussed in depth, about weed, masturbation, etc. (we are actually behind now - she told us at the beginning of class, and our midterm has to be pushed back a day. well done, lady.) and these examples aren't even scientific-sounding, in which case i would be a little more forgiving and less weirded out. case in point: \"are people who meditate better kissers?\" why? of all examples to use when you're first teaching variables. i know this probably doesn't sound like a big deal, but because this woman is also a raging bitch and looks pretty miserable, it feels...disturbing.\noh well, at least the workload is light. i wish i could get these wasted hours of my life back, though.\nWorkload:\nlight. the textbook is actually delightful though, thankfully.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 18, 2011",
            "review_content": "\nIf you go to every class, take careful notes, memorize definitions and regurgitate them on the exams you will do fine.\nShe is very organized in her lectures, but she is defensive when students ask her simple questions about the material. She gets a lot of terrible reviews, but I don't think she is terrible; she just seems to think she is much better (in every way) than her students.\nA positive aspect of taking Intro Psych with McKenna is that her classes are typically much smaller than the other intro psych classes, like 40 students smaller.\nWorkload:\nvery light, do the reading before the exam and study the book and notes\n3 exams and one paper [4-8 pages?]\n"
        },
        {
            "course_name": "Psychological Aspects of Human Sexuality",
            "review_date": "January 15, 2009",
            "review_content": "\nProfessor McKenna was the most disappointing professor I've had at Columbia to date. She gave dated information in her lectures and was not up to date on current issues in the field, which made her lectures especially impoverished. With a topic as dynamic as the psychology of human sexuality, her archaic approach to the subject was sorely disappointing. \nWorse, she was extremely narrow-minded and not open to even conisdering competing arguments to her views. McKenna seemed to take personal offense to students questioning her views, becoming very terse, and defensive and without offering any reason for why she would dismiss other arguments, she simply said, \"No\". Her class was not worth the the three-thousand dollars I paid per credit- not that I am bitter about my loss.\nMcKenna is an insult to academic endeavor and  she disgraces the spirit of intellectual curiosity at Columbia.\n\nWorkload:\nsmall, easily do-able\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 17, 2008",
            "review_content": "\nProfessor McKenna is the least helpful professor I have encountered at Barnard.  She is part time, so she has one day of office hours, and refuses to answer any questions after class: she forces you to e-mail her which, if you have questions about your research paper, does nothing for you.  She is unsympathetic to any problems you may have, and does not accept any level of criticism (She told me that her lack of office hours wasn't the problem, it was my lack of planning. Which was untrue, because she had given us two and a half weeks for the paper, given the week before thanksgiving and due after break.)\nHer lectures, and tests, are entirely subjective.  Write down everything she says in class, especially definitions, because they often don't match what the book says.  It is in your best interest to just regurgitate her definitions in the short answers, because if your answer isn't *perfectly* clear, she'll take points off.\nOccasionally, she'll say something funny or bring up an interesting tidbit, but for the most part, her lectures are boring and monotonous.  You don't have to read the book to follow the lecture, but you should read it before each of the 3 exams.\nDon't ask questions, because she will either: cut you off, say \"I'm not talking about that right now\" or say \"Ask me at the end of class.\" She doesn't really respond well to questions.  Not that she won't answer them, but she tends to make people feel stupid, even if there question isn't. \nThere are 3 exams, instead of the traditional midterm and final.  They aren't bad, about the same difficulty of a high school test.  About 45 multiple-choice questions, and then probably 7-10 short answers, which range from definition/explanation to abstracting one topic into real-life examples.  Pretty easy to finish in the 90-minute period, unless you're a really slow test-taker.\nOverall, if you don't have a choice, her class isn't the worst thing that could happen to you, but if you can get into another Intro class, DO IT.  Your general self-worthiness will thank you.\nWorkload:\n3 exams, about 45 multiple-choice and 7-10 short answers.  Not hard, but short answer grading is highly subjective.\nOne 4-page research paper, where you had to design your own observational study.\nTextbook reading for every class, but the book is really good and not hard to read at all.  Not entirely necessary to read until before the exams.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 06, 2007",
            "review_content": "\nProfessor McKenna is a good teacher.  She engages the class by asking lots questions and other ways to get us to participate. It is rare that she will lecture the whole time without bringing up some way to get us involved, such as by providing many many examples, whether it's for illusions which she draws on the board, shows us photocopied examples, thinking up examples of experiments and what is wrong with them...\n  If you are interested in psychology, it is a fascinating class.  Even just the intro level will change the way you think.\n  She takes attendance every day, so i recommend actually going.  Also, her lectures skip a lot of the info in the book, so you are making more work for yourself if you skip class and just read the book.  Take notes and study those.\nWorkload:\nLots of reading in the textbook, but it's not totally necessary.   Three tests rather than a regular midterm and final.  Not cumulative! Her tests mostly focus on what she says in class, so make sure to attend and take notes.  Still kind of difficult.  Need to study a lot for the tests.  Our class got back our first test and i think only two people had gotten an A-, and some people had definitely failed.  She said that intro to psych is the hardest intro class.    No quizzes or other graded/checked homework.\n"
        },
        {
            "course_name": "Psychology and Women",
            "review_date": "February 14, 2007",
            "review_content": "\nSO BORING. Need I emphasize that more? Fair grader but also one of those professors who think that a C is average and no one should complain about it. \nWorkload:\nReading which I stopped doing after the first week when I realized there's no need to. One in-class midterm (4 short essays) and final 12-15pg paper.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 26, 2007",
            "review_content": "\nProf. McKenna isn't the greatest lecturer, but she is a really nice lady.  Although she has a really unfortunate, droning voice, you can still see that she likes what she teaches.  Her lectures are organized and overall I got a pretty good intro to psychology.  In response to the other reviews, her tests never seemed unreasonable.  The paper was a pretty interesting experience, and easy.  Just read the material and pay attention.  This class is not half bad.\nWorkload:\nVery manageable.  Tests are non-cumulative.\n"
        },
        {
            "course_name": "Psychological Aspects of Human Sexuality",
            "review_date": "May 12, 2006",
            "review_content": "\nWendy McKenna is a mediocre professor who teaches an inevitably interesting subject. One suspects she's been teaching the same exact class for the past 25 years (the length of time she'll inform you of with a smug smile). Her lecture oftentimes begins with a list of \"shocking\" statistics (she doesn't always give a credible source). Then she'll attempt to incite a debate amongst the class about some sex-related topic, which can go on for needlessly long considering the yappy, uninformed nature of your typical Barnard psych student, aided only by her occasional clarifications. At one point, taking this class, you think to yourself \"it can't be that bad-- the class is about sex and that will always be interesting.\" But then you take the test and realize just how vague, biased and subjective McKenna can be with test writing and grading. \nTwo bits of advice: Don't question her logic during a lecture. In my experience, even if she seems to be saying the most stupid thing in the world, she'd rather have you spit it back to her on the exam than give her any reason to think she's wrong. Second, everything she teachers relates back to the Double Standard-- even if you don't think it does. \nWorkload:\nAnonymous paper, 3 page response, 6-8 page paper/\nproject, Midterm, Final\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 08, 2006",
            "review_content": "\nnot to be cliche, but \nDO NOT TAKE THIS CLASS WITH THIS WOMAN. \nif you have any dignity or respect for yourself or the time you have on this earth, and wish not to waste it, do not spend it on this woman.  the point of the class is for her to assure herself that she is, in fact, more intelligent than undergraduate students (mostly first-year, as well), for her to do her best to convince you of the same, and for her to test out new modes of tricking her students into getting the wrong answer.  now this is only in class; if you are positively desperate for a reasonably easy way through this intro class, go ahead; i rarely took notes, and when i did, they were only useless for her little snippets of information that she put on her tests, no matter how irrelevant they were.  the workload is fine, as long as you do the reading at some point, the text book she chose was juvenlie, and she is insufferable. \nWorkload:\ntwo midterms, exam, one short paper, none of which are straightfoward or decipherable assignments because, as i said, she tries as hard as she can to trip up her students. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "November 28, 2005",
            "review_content": "\nProfessor McKenna acts like she's doing a favor to her students when she lectures. She doesn't write anything down on the board, she hands out no outlines or guides, makes no courseworks postings (unlike many other social science teachers) and glosses over significant concepts. She takes some questions from the class (which is stupid because we're all first years and listening to our class hypothesize about disorders we don't know about gets old FAST). Her refusal to actually answer student's questions, combined with her ONE office hour make her class hard to do well in (and who wants a B or C in intro pysch?). She canceled class two hours before we were supposed to go (half the class ended up in the room confused), changed the syllabi multiple times and was often late to her own class. \nHer tests...She might tell you that it's mostly multiple choice and short-\nanswer, but she really means that division is like 30/70 (wayyy more writing, and thus wayyy more subjectively graded). Oh, and by the way, she doesn't curve, as in, not at all, no extra points, no extra credit, etc.\nThe class is mostly first years with a couple sophomores and a postbac here and there. I would recommend switching out of her class if there's anyway possible, especially as all my friends who took psych with other profs (stroessner, mccatskill, stokes, etc) loved it. \nWorkload:\none paper, 3 non-cumulative written & some multiple choice exams. 5 hours of \"volunteering\" for psych experiments. reading that you should do word for word. \n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor McKenna really is not as bad as everybody on here says she is. She is actually quite nice with grades although her tests are semi-confusing...if you are good with multiple choice though and good at guessing the best answer, the tests will be easy. I think the hardest thing about the tests is that the questions seem too vague or general so several of the multiple choice answers will appear to fit. She's very good with credit on the short answer part. There's really no final exam--we just had three different exams and two easy papers to write.\nProfessor McKenna is actually a sweet lady. I got away with coming in late to every class, not going to several classes, and handing in a test and a paper late, getting the highest grade of an 85 on an exam, had 3 noshows for psychology experiments, and did not complete all the needed credits and still managed to get a B in the class...maybe that's not good for you but that grade is great for me! \nThe only thing is that the class is very boring. She is funny at random times but I felt like a lot of class time was very useless although she did make sure to answer everyone's questions. The only thing I would suggest to her is to research the questions she did not know how to answer in class and come in the next week with them.\nThe book was amazing though! I recommend buying that book just for reading. It was a hundred times more interesting than the lecture.\nWorkload:\nReading (the reading schedule is achievable), Three evenly spaced out Exams, 2 Easy Papers\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 04, 2004",
            "review_content": "\nMc Kenna's not that boring. You dont have to do the readings until exam time, and yes, don't rely on your notes (except for the last exam). Little known secret: she likes to switch it up. The first two exams are mostly based on the readings (albeit the seemingly least important facts); on the last test she bases her exams on the notes. \nDo the experiments on time. AND FOR THE LOVE OF GOD: ask the woman exactly what she wants on the paper lest you be surprised with your grade. Oh, and do attend lectures--she takes attendance and memorizes faces. \nWorkload:\n1 paper; 3 exams\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "October 01, 2003",
            "review_content": "\nWell, I'm a first year and i'm only a month into her Intro to Psyc class, but it's not too great. She's not a mean professor, but yes, she is boring. Her first exam is coming up in like a week and I'm gonna have trouble studying for that seeing that the previous reviewers said that she'll test us on obscure points in class. Anyways, yes, her class is boring almost all the time. Her workload is not bad at all. You like never have homework. YOur homework is just your reading. Oh, and when you do your psyc experiments, be sure to be on time!!! I didn't take that too seriously and I missed 2. I'm so stupid and now my grade will get lowered. Oh well, enjoy her class if you get it. I'm not enjoying it too much. It's not unbearable, but she's not bringing out the best of what intro to psyc could be. From 1(worst)-10(best), I'd rate her a 5. \nWorkload:\nreading, 3 major tests, 2 papers\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "May 18, 2003",
            "review_content": "\nI really did not like Professor McKenna.  First of all, she was the least enthusiastic of any professors I have ever had.  During lectures she looked as if she would rather be some place else, some place more interesting.  She was bored thus we were bored.  I had trouble keeping my eyes open for the entire lecture because she spent most of the time trying to get herself organized and trying to decipher her notes from 1975.  The tests were reasonable in difficulty, but if multiple choice is not your thing, do not take this class.  Most of the test is on a scantron and the other, smaller part is short answer.  \nWorkload:\nNot a huge workload at all.  Two tests and one pointless paper on observations that no one actually did.  You must participate in 5 experiments outside of class.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 16, 2002",
            "review_content": "\nI don't know what the previous person was talking about with Prof. McKenna being the \"model teacher.\"  This woman has the most disorganized lectures in the world, and you might as well not even buy the book because she certainly doesn't use it to write the test.  Instead, she based her LONG, ridiculous tests on obscure points she mentioned ONCE in class.  She even makes up her own terms for things SHE thinks you should know about.  You spend all your time trying to keep up with the reading, only to realize you have two days to prepare for the test she's about to give you.  You read over your notes and start scratching your head....why do these notes sound so incoherent.....oh yes, that's right.....because Prof. McKenna's lectures don't follow any logical path!  When you're not drooling on your book asleep, you're trying to read over the notes you COULD get down amidst her nasal chatter.  Don't even bother.... you won't get it all the simplfied BS written down fast enough anyway.  But don't worry guys, the points you don't get down ARE the ones she'll test you on.  I also love telling people about the paper she gave us on rating the book's accompanying website!  Please.....as if we don't have enough busy work trying to fall out of our desks due to the most immense boredom one could possibly experience.  Skip McKenna....or if you are Freshman and wondering why you keep staring at the clock during Intro. Psych....get out of that class fast! \nWorkload:\nTwo of the most pointless paper's I have written in my life.  Fill in tests and random scan-tron questions.  A crap load of reading you never end up using.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 14, 2001",
            "review_content": "\nProfessor McKenna is an outstanding example of what a teacher should be. Her enthusiasm for her subject is contagious and her classes so interesting they seem to be over before they begin. She is patience personified, open and willing to discuss the topic at issue until everyone is heard. Professor McKenna forces one to THINK and QUESTION (certainly about the variety of psychological perspectives), creating the kind of mental stimulation one hopes for in an environment designed for learning. Despite the broad range of information and short time in which to present it, she presents a calm and steady demeanor while maintaining a dry wit and quick sense of humor. Professor McKenna is generous in her grading and gives students every opportunity to attain the highest grade possible. Although she seems disorganized at times, this characteristic makes her all the more \"human\" - a great quality in someone teaching psychology! I certainly hope to take additional classes with Professor McKenna and recommend her to all students who are seeking knowledge, not just high GPAs.\nWorkload:\nAlot of reading and retaining dense material (but an excellent textbook so it's well presented), a quiz or two, one paper, the midterm and final. Certainly a very reasonable work load.\n"
        },
        {
            "course_name": "Psychological Aspects of Human Sexuality",
            "review_date": "December 31, 1999",
            "review_content": "\nShe's a decent lecturer, except for her nasal and irritating voice. In addition, as a human being, she's obnoxius. You may not enter or exit if she's talking, and there is no way to pre-register. She'll force all the sophomores exit the room on the first day, and automatically kicks them out. The papers she assigns are mostly anonymous and ungraded, so you work your tail off for really nothing (you still have to do them and sign in that you handed it in). She refuses to discuss the exam until it's over. She conducts in-class experiments with surveys that many feel are unethically handled and have questionable ethics.  Workload: a slew of anonymous, ungraded papers, an ungraded paper that is not anonymous, a midterm, and a final project for which you must go to some unusual place, such as a strip joint, an abortion clinic, or a meeting of a support group for those who participate in S&M;/B&D...and; a final.\n"
        }
    ]
}