{
    "prof_info": [
        {
            "prof_name": "Grace Kodindo",
            "prof_id": 5915,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Public Health & Humanitarian Action",
            "review_date": "December 23, 2011",
            "review_content": "\nThis class was every reason why I came to Columbia for grad school. I mean, where else would you get the pleasure to be taught by classroom filled with people who have worked (and who continue to work) at the top ranks in some of the most high-profile and devastating emergencies: Rwanda, the Congo, the Asian tsunami, etc, etc.? Do a quick Google search on each of the five professors and you'll see what I mean.\nThe course is broken down into themes: Water and Sanitation, Nutrition, Health/Communicable diseases, Reproductive Health, Humanitarian protection and Human Rights and Psychosocial interventions. Each of these themes is taught by an expert professor, with the help of PowerPoint, case studies and class discussions. The profs obviously try their best (and succeed) in making this course a positive learning experience and genuinely want us students to succeed. The environment is pleasant and friendly. Sometimes the class was really quiet, but perhaps that was because it was a 9 am class... \nTake it if you can - you won't regret it. You'll definitely come away feeling more aware of what's going on in the world, and you'd thank yourself for it. If you ever dreamed of being a humanitarian aid worker and have wondered what it's like to be out there on the field, experiencing poverty, disease and conflict first-hand, you MUST take this course (even if it doesn't count towards your \"concentration\" requirements). You owe it to yourself.\nAnd as long as you do everything that you're supposed to do, it's not that hard to do well (though I didn't manage to get an A... totally bombed the op-ed and one of the quizzes... yeah, I'm horribly disappointed, but that doesn't detract from the fact that this is a gold-star class). \nWorkload:\nVery reasonable. One 700-word op-ed, two take-home tests, class participation, mid-term crisis simulation exercise, Courseworks discussion boards. Readings are generally interesting and very doable. \n"
        }
    ]
}