{
    "prof_info": [
        {
            "prof_name": "Fumiko Nazikian",
            "prof_id": 2580,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 24, 2008",
            "review_content": "\nI don't know if anything negative can be said about Nazikian-sensei... she is a very lively, engaging professor. And she actually cares about how her students are doing. She is the only professor I've had that I feel has given me the most individualized attention (she actually remembered my name and background information!) while still doing her job (teaching Japanese, which she does extremely well).\nAs for the class, Japanese isn't the kind of language you take just to fulfill the language requirement... a quick scroll-down to the \"workload\" section should give you an idea of what you will go through. Each section covers the same materials and takes the same tests, the only difference is the instructor.\nFortunately, with Nazikian-sensei the class isn't as bad as it appears to be. She is pretty laid-back during class, and makes classes seem like they go faster than they really do with her energy and enthusiasm. Class isn't just her standing at the front and lecturing, however. Most of the class is spent doing grammar drills and conversing with both sensei and your fellow classmates. Classes aren't boring at all (they're quite interesting), and Nazikian-sensei even incorporates Japanese pop culture into lessons every now and then.\nBy the end, you'll only realize just how much you've learned... everyone was able to hold short conversations in Japanese at semester's end! Nazikian-sensei's class was the one class I looked forward to going to every day, and the one class I always left feeling happy. I cannot say that about any other class at Columbia.\nIn short, if you're willing to take on Japanese, I highly recommend taking it with Nazikian-sensei. I'd even go so far as to arrange my entire schedule around her class...\nWorkload:\nStandard Japanese Workload:\n+ Classes every day\n+ Homework every night (grammar exercises, readings, etc)\n+ Vocabulary/Kanji quizzes every day\n+ Various Projects (blogs, podcasts, etc)\n+ Language Lab exercises once a week (takes about an hour, speaking and listening)\n+ 2 Exams (listening and written)\n+ 1 Midterm (listening, written, and oral)\n+ 1 Final (listening, written, and oral)\nSyllabus is posted on the Japanese Language Program's website if you're seriously considering it.\n"
        },
        {
            "course_name": "Fourth Year Japanese I",
            "review_date": "May 15, 2007",
            "review_content": "\nNazikian sensei's class accomplished what I wanted it to--introducing and reinforcing kanji, grammar, and critical analysis through reading essays, newspaper articles, interviews, news clips, and documentaries.  There were moments in which I suddenly realized something new, thanks to the way the class discussion was leading or Sensei's explanations.  However, there were also many moments when Sensei failed to answer questions in the capacity the student was seeking.  Her answer wouldn't really address the question or lead in an unrelated direction, or she wouldn't really listen closely to understand what the student was asking, whether the question was content- or logistics-related.\nI agree with the other reviewer's assessment about her being unclear about due dates and expectations.\nHer class wasn't bad; it was pretty good.  I appreciated Nazikian sensei's enthusiasm and relentless stream of questions.  I was disappointed because I hear she's a great scholar in her own right, but I found the way she answered questions lacking.\nWorkload:\nKanji quiz every class day (3x/week), reading done and homework due every class day, two tests, one midterm, one final, one oral presentation\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "April 12, 2007",
            "review_content": "\nNazikian sensei is a sweetheart, she cares about her students and is actually very funny.  Class was fun with her almost everyday, except when the grammar got too repetetive.  She's laid back, though has slightly higher expectations than the other japanese teachers I've had.\nWorkload:\nNormal Japanese workload\n"
        },
        {
            "course_name": "Fourth Year Japanese I",
            "review_date": "December 25, 2006",
            "review_content": "\nOverall, I'd say that Nazikian-sensei is a good teacher; however, I did find some problems with her fourth-year class.  My biggest problem with her was that she was not very clear about assignments, due dates, and quiz material.  I was occasionally confused about what would be covered in the daily quiz, and I know I was not alone.  Eventually, I just started guessing that the next 20 vocab words would be on the test, and that the assignments went sequentially, and though I missed a few assignments and kanji using this method, I thought it worked out pretty well.  I did think that she had trouble properly engaging the class.  There was a lot of dead time, and I thought that she could have called on people at random to make things run smoother.  \nNot being a native Japanese speaker, I had some trouble with the readings, but I think that if you go to the class, you can get the general idea.  Nazikian's setsumei can only go so far though, so you really need to spend some time going over them at home.\nWorkload:\nMedium to high.  Lots of kanji... lots and lots of kanji.  There are fewer exams than the first three years, so each exam encompasses more material.  There's a research presentation at the end of the class, two exams, a midterm, and a final.  Daily quizzes.  \n"
        },
        {
            "course_name": "Elementary Japanese A",
            "review_date": "June 17, 2005",
            "review_content": "\nNazikian sensei is a wonderful teacher--she's funny, caring, and most importantly, a great teacher!  She goes at the right pace, constantly reviews materials, and her sense of humor just adds so much color and fun to the class.\nHighly recommended if you'd like to learn the language well and at a relatively slow pace.  Honestly, I walked out of every class feeling happy =)\nWorkload:\nRoughly one quiz per class, 2 \"exams,\" midterm, and final.  No surprises; questions all come from the text.  Listening sections could get tricky because of the speed.\n"
        }
    ]
}