{
    "prof_info": [
        {
            "prof_name": "Eugene Vydrin",
            "prof_id": 2003,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "November 20, 2012",
            "review_content": "\nI should start off by saying I was put into this class after having a scheduling conflict and I didn't even want a Legacy of the Mediterranean class. I was scared of the workload and the intensity of the texts as I'd read a few before. I could not have been luckier. Eugene is one of the best English teachers I've ever had in my life! He is extraordinarily, involved in every class discussion, making anything and everything you say both relevant and intelligent (even if it wasn't originally). Not only is he fairly lenient when it comes to handing in papers, but he is flexible with his office hours and always gives 200% when you meet with him. Whenever I go to his office hours I always felt he was just as engaged (if not more) in my paper as I was and extremely helpful in terms of the direction I should take my paper in. Aside from that I actually have learned a ton about writing in his class and I honestly believe I've become a better writer because of him. If more teachers were as passionate about what they taught as Eugene, everyone would love English. Take this class weather you're good at English or not- I promise you will love it.\nWorkload:\nYou go through a lot of books, but you never read the entire thing. The chapters/sections that are assigned you should read because it honestly makes the discussions fun. I'd say moderate work load. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 23, 2012",
            "review_content": "\nHE IS AN AMAZING TEACHER. He weaves any and every comment you say into gold and its really a confidence booster. He leads discussions which really help you think about the text and he is obviously extremely knowledgeable. He doesn't give a massive amount of work and is always VERY flexible for when you can hand your papers in. I would tell every single Barnard girl to take his class because he is really the only one you want to teach you an english class. My other professors since him are no where near as insightful, friendly, dynamic, or laid back. \nPS. He says \"RIGHT?\" alot and may go on small 7 minute monoloues about his favorite scene in the book but it becomes quickly endearing.\nWorkload:\n6 on a 1-10 scale but what do you expect? its an english course!\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "September 05, 2011",
            "review_content": "\nBest english teacher I have ever had. Not only is he brilliant but he is also a great teacher and leads dynamic class discussion. He is also just a really sweet guy.He was willing to meet with me whenever in office hours etc to discuss ideas and essay structures. He is both a great thinker and writer but isnt pretentious at all and really respects student ideas. My only criticism is that in class discussion he was so effusive about EVERYONE's comments that it at times seemed he was just trying to be nice. Maybe he was. Either way, I highly reccomend taking him for anything he teaches. WIsh he taught more!\nWorkload:\nUsual for an english class. 3 essays all with 2 drafts. Heavy reading.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2006",
            "review_content": "\nDespite hating writing courses in general, Eugene was by far the best writing teacher I've ever had.  Goals were clearly defined, and he actually wrote complimentary remarks on the things we did well.  And we read some great pieces too (go Lorca!).  Would highly recommend him to anyone taking U Writing.\nWorkload:\nVery reasonable\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 09, 2006",
            "review_content": "\nBest instructor you could pick for university writing! He understands the student's and is very encouraging. I thought I'd hate taking a writing class, but ended up getting the most out of his class. You should take his class even if it is at an inconvenient time. You won't regret it.\nWorkload:\nWeekly exercises.. not graded. Four uni writing papers.. one very small presentation with group (5%)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 14, 2004",
            "review_content": "\nEugene is a fantastic teacher.  I can only agree with the only other review of him.  He is a little quarky, but it only adds to the flavor of the class.  You can tell that he is passionate about what he is doing, and it truly is engaging.  You go into class after having done the readings, and you find out a whole new way to think, a way to analyze.  You learn theories, you learn concepts, you learn!  This is not a high school english class, it is completely about learning how to think!  And in the end how to find your own voice.  It is a shame that what I learned there is not appreciated in other classes.  Because after his class I truly began to learn how to write.  I was able to understand a sense of purpose in each sentence and the sentence construction.  That is to say, nothing was written without my strong belief that it should be written.  It has been the single greatest experience I have had in school so far.  I just was intoxicated by the subjects we discussed.  I spent more hours working on one essay than I probably did working on all essays in my previous 'english' classes.   I can only hope that all the rest of my classes could be like this.  Eugene is engaging, truly brilliant, and if you thought going to class was fun, it is even better to go in during his office hours and talk about your essays.  He is fantastic one-on-one  During his office hours, time passes so quickly as you get off on tangents on literature, literary theory, writing, what it means to write.  Learning is fun with Eugene.\nHe will make a fantastic professor one day.  I say if you can get a class with him...take it.  If he is TAing in a class...take it.  You will not regret it.\nWorkload:\nThe 4 UW papers, and daily excercises that are not graded, but definately worth your time.  If you chose not to do the work, you definately lose out on a lot.  It is worth it.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 04, 2004",
            "review_content": "\nEugene is an excellent instructor. He has vigour and passion in what he does. He knows the readings well, but is not strict about THE interpretation. That is to say he ll always look into new ideas and perspectives, and this he does without going off topic or no longer making sense.\nHis approach to writing and learning about writing is great. through the readings he has taught us to close read and analyze liek no one else.\nIncredibly smart, and nice in a slightly goof way, this instructor also can understand students, their demands and concerns when homework is due. He makes the class thus enjoyable, and I actually like pumping out papers for him.\nIf he's teaching UW again and you haven t taken it, take it with him. Watch an eye out also on what classes he may TA in the English dept...\nWorkload:\nExercises every week or so; short, flexible. UW papers. Participation, though he never expects yuou to underestand something too difficult until he s given you the explanatory background.\n"
        }
    ]
}