{
    "prof_info": [
        {
            "prof_name": "Mladen Laudanovic",
            "prof_id": 3321,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 23, 2007",
            "review_content": "\nIf you're an econ major in the college, you will most likely need to take this course at some point. For those of you who are mathophobes, statistics will be a tough subject, and no teacher can really help change that. However, the good news is that Mladen is a very generous teacher. He will slow down with material if everyone isn't getting it. For example, the second midterm contained less material than a previous semester, but that material was then put on a take home final at the end. Also, his tests are open book, so there is no need to mindlessly remember formulas. Overall, I think more than half of the class received grades in the A range, so it's not so bad.\nWorkload:\n8 homeworks, lowest 2 dropped2 midterms (25% weight)1 final (length of 2 midterms, weighted same)\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 09, 2007",
            "review_content": "\nThis course is horrible.  There is just no way to not say that - it is way too hard.  Mladen will curve your grade to try and help, but if you are looking for someone to teach you the material look elsewhere.  If you want to teach yourself the course, take this class because the final and midterm are the easiest (i.e. open book/laptop) - but I don't recommend it because the book is bad too.  Good luck with this one...get a stress ball.\nWorkload:\nAssignments are hard but not worth too much.  Mid-term and Final are open book/note/laptop - but it doesn't really help THAT much because the stuff is so hard anyways.\n"
        }
    ]
}