{
    "prof_info": [
        {
            "prof_name": "Yuri Gorokhovich",
            "prof_id": 3574,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "GIS for Resource, Environmental and Infrastructure Management",
            "review_date": "December 21, 2008",
            "review_content": "\nAs a caveat, I am not an engineer. In fact, I was the only social science major in the class. Nonetheless, GIS should not have been as difficult as it was. Professor Gorokhovich is an approachable, jovial man but he threw us into the computer mapping fray at the start of class without explaining the fundamental concepts thoroughly enough for ensuing instruction to make sense. I felt lost on terminology and the different functions of the GIS computer program, which meant minor problems in mapping homework cost me hours of time. The program itself is impressive, the fundamental software behind GoogleEarth and the like, but I found it frustrating and uncooperative, which I attribute to my lack of understanding about the basic process of setting up maps and coordinates. Labs varied from tedious but doable, to incompletable without significant help from Yuri, the TA, or group work. Class attendance was necessary through the midterm because of regular quizzes, but afterwards was not much more helpful than the textbook. However Yuri was responsive by email throughout the day and weekend, and approachable one-on-one. His jokes and general light-hearted attitude can be hilarious which makes life more pleasant, until you leave class and find yourself four hours into a lab assignment and no farther along than you were when you started. But get through it if you need to, because the program is useful for engineers, and environmental and urban planning careers.\nWorkload:\nNot always heavy, but usually hard; weekly labs with some textbook reading; very difficult midterm and final but they are both take-home, open-note, and you can work with other students; weekly quizzes through the midterm.\n"
        }
    ]
}