{
    "prof_info": [
        {
            "prof_name": "Mingfang Ting",
            "prof_id": 4369,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Quantitative Models of Climate-Sensitive Natural and Human Systems",
            "review_date": "December 13, 2009",
            "review_content": "\nThis class is part of the Climate & Society masters program.  I strongly discourage DEES undergrads from taking it.  This course is essentially remedial statistics and the amount of material taught is laughable for a 4 credit course.  Tony teaches very simple statistics during the first half of the class and then Mingfang teaches decision-making models and supervises the final project.  Tony is very nice but he sets the bar too low.  Statistics is listed as a prerequisite which must be some sort of joke.  We spent the first few weeks learning how to calculate the mean and determine the probability of getting heads when you flip a coin.\nToo much class time was dedicated to testing (4 class period + lab in total).  Spending three entire class periods to see if we could copy stat practice problems was a waste of time.  The midterm did not test whether we truly understood the statistical methods we had learned.  It was open computer which was ridiculous as it not only allowed for, but facilitated cheating.\nThe group decision-making projects were valuable, but the presentations took more than 5 hours because each group got 25 minutes to present.  It was unreasonable to make everyone stay so long.  Expectations for the projects weren't made clear.\nTo summarize: very easy A, but avoid if you want to learn anything useful or be challenged.  Fortunately the lecture notes are posted so you don't have to go to class or necessarily look at them until you are taking a quiz. \nWorkload:\n3 full class quizzes, open note/open computer (25%), 4+ hour stat midterm (25%), lab every week (you don't have to produce a formal lab write up, just answer questions) (25%), group project + individual final report (25%)\n"
        }
    ]
}