{
    "prof_info": [
        {
            "prof_name": "Jung-Chi Liao",
            "prof_id": 5524,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Mechanics of Fluids",
            "review_date": "March 30, 2012",
            "review_content": "\nThis class was definitely not as tough as it may seem. Class is okay, but nonetheless useful and you should attend. If you don't attend class, you'll most likely miss hints on tests or concepts not gone over in the book. That being said, the book is pretty darn good. His lectures are brutal in the sense that you'll break your hand. I recommend not writing down every equation he writes and so follow along in the book since they'll be there. His exams are excellent in the fact that he allows you to bring your own equation sheet, thus, if you understand what's going on, you're going to put the relevant stuff on there. That's why class/homework is important. Doing homework though is optional as long as you understand how to go about it, I passed half of them in and still got an A. Test 1 had a tricky problem, but he graded leniently on it, curves nicely. Test 2 straight forwarded, but made easy to compensate for Test 1, had a problem you had to be in class to understand, but could guess. Final was straight forward as well. \n*Key thing is structuring your equation sheet, if he continues this, you'll breeze by this class \nWorkload:\nTwo Tests, 25% 30 %\nWeekly homework (4-5 problems) 5% \nFinal 40% I think that's right\n"
        },
        {
            "course_name": "Introduction to Mechanics of Fluids",
            "review_date": "December 30, 2011",
            "review_content": "\nAs I write reviews, this school just makes me wanna cry. Liao is a terrible teacher. I heard that he thought this was a \"weed-out\" class until we finished the 2nd mid-term. After this he realized this wasn't a weed-out class and he \"calmed down.\" In class he mainly goes over derivations (which are useless for the tests/anything) and a few examples. He's a typical wanna-be hard-ass teacher. It's worthless to go to class, over half the class didn't go to lecture after the first few classes and I deeply regret going to them. It's better to go over the stuff on your own. The final was bat-shit crazy and though he curved, i dont think he curved as nicely as he should have. \nsummary: he's a guy who knows his stuff, but his teaching is the typical piece of crap style where you dont learn anything. Didn't curve enough. Everyone hates him.\nWorkload:\nlike 11 or 12 homeworks (worth 10 percent of the grade) one mid term (worth 25 pcnt) another mid term (worth 30 pcnt) and the rest is the final. Curve isn't very generous at all.\n"
        }
    ]
}