{
    "prof_info": [
        {
            "prof_name": "Mona El-Ghobashy",
            "prof_id": 2322,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 11, 2016",
            "review_content": "\nAn absolutely incredible professor, and the other reviews are correct - one of the smartest people you'll ever meet. Class was mostly discussion-based with occasional mini-lectures. She does a great job bringing out the significance of each text in context, without forcing tenuous modern-day connections. Because her main field is political science, discussions about the political implications of the texts were always pretty interesting. Although CC has its drawbacks, she makes it a worthwhile class.\nThere are four essays throughout the year (two per semester). For each one, you hand in a first draft (worth 5% of your final class grade), she gives it back with extensive comments, and then you hand in a final draft (worth 15-20% of your final grade). Her feedback is very helpful in refining your argument for the second draft, and it's definitely a great way to improve your writing skills.\n\nWorkload:\nProbably a standard amount of reading for CC. The two-draft essay model means a lot of writing, but in total not much more than that of a single, polished essay.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 02, 2014",
            "review_content": "\nI came into this class with extremely high expectations based on culpa reviews, but found myself extremely dissatisfied in a number of different ways. \n(1) If El-Ghobashy is a \"genuinely nice\" person as other reviewers have said, it really did not come across in her class. Instead, her demeanor was invariably condescending and just flat-out annoying. Constant reminders about how she was \"going to teach us how to think\" and about how we should or should not take notes were honestly just ridiculous. I think El-Ghobashy really epitomizes the self-aggrandizing academic...if that doesn't bother you, then pay no heed to this point, but I really found it incredibly annoying.\n(2) I think the first complaint about the way she handled lectures really carried over into all other parts of the class. The main assignment, the \"research design,\" is basically just a fake research paper, and the reason she assigns the dumb thing instead of an actual paper is because she doesn't think you're smart enough/competent enough to actually write a research paper. Then, on the first draft of the assignment, she only gave an A-range grade to one person in the entire class of 150 students clearly just to make the point that we need to pay attention to her class (I mean, really, who does that? High school teachers maybe?). She actually graded my first draft, and I swear she didn't even read the whole thing...so much for her \"detailed comments\" bs. This assignment really just made me super frustrated, although granted I've taken several polisci classes before... but even if you haven't, the only way you learn how to do research is by DOING IT, not by doing some pseudo research assignment. \nI'm still glad that I took Intro to comparative with her instead of kasara, because I've heard Kasara is actually terrible. But if you don't have to take it for major requirements, I would highly consider just passing on it and taking a better comparative class like Latin American Politics or Politics in Russia or literally anything else. \nA few other points:\n- class was well-organized, deadlines/syllabus were clear.   \n- she is kind of a ramble-y lecturer. She is engaging body-language-wise, but she often goes off for 20 minutes talking about something that could be said in 2. She acts like the stuff she's saying is so nuanced, interesting, and unexpected, when it's really not very complicated at all. Also, slides did not really go in any logical order, and she constantly confused herself about where she was in the presentation. \n- One other thing about her lecture-style which I found incredibly annoying was how she tried to get so much class participation in a huge lecture. This is just dumb. Nobody in the class wants to hear their peer who didn't even do the reading talk! As much as I found her annoying, at least she actually knows the material and is worth listening to. I know this is kinda mean, but it really got annoying honestly. That's what section is for (although I admit it's still painful there too). \n- sections are PAINFUL. half of the people never talk and just pray that you don't get one of those people in your section that can't articulate anything but likes talking. My TA, Giancarlo Visconti, is awesome, though, so if you can take it with him, definitely do. \n- Haven't gotten any final grades back yet, but it's definitely possible to get an A in the class. \nWorkload:\nOverall very standard. readings normal for polisci. tests not bad. super annoying (but not hard) research design. \n"
        },
        {
            "course_name": "FYS Politics in the Novel",
            "review_date": "December 12, 2012",
            "review_content": "\nProf. El-Ghobashy is a rockstar. Her seminar was always interesting and she helped improve my writing tremendously. I enjoyed every class discussion and learned a lot about politics in literature, as well as about politics in general. I really recommend going to her office hours. She is fun to speak with and will offer guidance on your papers and will send you away with chocolate. \nThe workload was harder than most of my friends' English seminars, but I was so pleased with the class that I've almost forgotten about the difficult papers.\n\nWorkload:\n3 papers with drafts and finals copies. (essentially 6 papers)\n5/6 books to read all semester\ngrading: fair.\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "May 05, 2011",
            "review_content": "\nProfessor El-Ghobashy is a brilliant woman.  She knows the course material backwards and forwards, and she makes an effort so that you understand the course material through her clear lecture style and her visual aids.  Her voice is also incredibly pleasing to listen to, and she always finds a way to empathize with her students, which often gets a laugh out of a class.  That's not to say that the course is easy; the material is difficult, and it's definitely a comparative politics class that you WILL want to have taken the intro class for.  Professor El-Ghobashy makes what would in other classes cause weeks of migraines something you can understand.  \nThat said, do not be fooled by the lack of a final exam or a midterm; her essays are, as previous reviewers have said, difficult and force you to think.  She is genuinely nice and wants her students to succeed, and she will work with you to develop your ideas into a great essay.  Thus she expects that her students make the effort in return, and her mind can sift through bullshit a mile a minute, though she does appreciate an honest effort to make an argument.  \nThe bottom line- do your work, and she will do what she can so you can succeed.  She's an excellent professor and deserves your effort.\nWorkload:\nThree papers, one map quiz.  Lots of readings, but it is possible to get by without doing them except for papers.  Papers are difficult, but without a final or a midterm, that's only fair.\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "August 12, 2009",
            "review_content": "\nshe's fantastic. poli sci major or not her Comparative Politics course is worth taking. the course is interesting, the expectations are clear, and she is unbelievably smart, precise, and engaging. make sure not to mess around with any of her rules though because she is tough. discussion section with TA was mandatory but absolutely pointless, if anything that was a negative experience. that said, i absolutely recommend this course. it's challenging and interesting and it's also very possible to receive a good grade. an A- requires work but is totally possible. \nWorkload:\nfirst of all you don't have to buy any books for the comparative politics class which was nice. a reasonable amount of weekly reading- it's possible to do it all and i did do most of it but it's also not necessary- she really just wants you to get the main argument out of each article. 3 quizzes- these test your understanding of readings- one quiz covered one reading. she really makes you be as precise as she is- so make sure you really get the main argument- meaning know the key terms, be able to define them, and then just get the main thesis of the reading down. these quizzes can be a bit annoying and it's possible to mess them up if you kind of miss the point but htey are totally doable. the research design is the main assignment-- there is a ton of time to work on it, meet with her to get her input and to get ideas, and there is a rough draft that you submit and is graded. the final was totally manageable. there were IDs with lots of room for choice. there was also an essay- she gave us 4 in advance and then 2 of them were on the final.  essays were very straightforward. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "December 22, 2008",
            "review_content": "\nThus far, Professor El-Ghobashy has been my absolute favorite professor at Columbia. I took Dennis Dalton's Political Theory and classes with Pious, but I never felt as though I learned anywhere near as much as I learned in this class. \nProfessor El-Ghobashy (or Dr. Mona as some call her) is extraordinarily well organized and each class clearly follows the readings. She uses powerpoints for lecture (which I loved for organizing my notes), but she doesn't just talk right from slides and always gives interesting points that aren't in the notes. Any questions that are asked in class are fully addressed - which is very important for an intro course - and the discussion sessions only further help this. Also, as professor accessibility is important even in an intro course, Professor El-Ghobashy makes herself available to talk to and is very approachable and personable. However, she is pretty strict (no cell phones in class or you will be made an example of, don't come late/leave early, etc.) and doesn't like to waste time (if you write her an email about something that is clearly stated on the syllabus, she'll respond telling you to look at the syllabus). \nIn lieu of the course itself, it is a very important course for any Political Science major to take at some time in their college career. The approach of the course is very systemic and practical and will give you a completely new (and extremely valuable) view of how and why political systems function the way they do. Focusing on independent/dependent variables and examining cases like scientific experiments, you get to see the \"science\" part of political science. Political philosophy is important, but this class is more useful for those who want to take a more practical approach. The \"comparative\" aspect comes in when trying to determine what factors cause the outcomes (revolution, democratization, voting, etc).\nThe course covers:\n- How to read/examine from a comparative politics perspective (it's an intro course, so this is important and believe it or not, very useful)\n- State formation\n- Nationalism\n- Democratization\n- Revolution\n- \"Why do dictators care to dress their windows?\" (Hybrid regimes)\n- \"Why are Some States 'Predatory' and Others 'Developmental'?\"\n- \"Why are Some Countries Resource-rich but Poor while others are Resource-poor but Rich\"\n- \"Why do citizens vote?\" (very interesting articles and discussions!)\n- \"What explains civil wars?\"\n- Political corruption (didn't get to this in time because of review sessions)\nOverall, it is a WONDERFUL course!\nWorkload:\n- 3 in-class quizzes over individual readings - the 3 quizzes make up 15% of your grade (each being worth 5%) You're told about them on the first day of class - no surprises. The quizzes aren't too horrible, though you need to read the articles a few times before hand because the definitions need to be pretty accurate\n- Research Design - 35% of your grade. Very easy to do as long as you don't put it off to the last minute - only difficult part is keeping under the 7 page maximum. Essentially, you plan out a research topic by forming hypothesis, arguments, and refuting 2 other arguments.\n- Final exam - 35% of your grade. ID section (defining theories and telling who wrote them) and essay section (must mention 3 theorists and use 2 specific examples)\n- Class/section participation - 15% of your grade. (Attendance is taken in section.)\n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 27, 2007",
            "review_content": "\nMona is a fantastic professor from her immaculately organized lectures to the chocolates she feeds you when you visit her at office hours.  Yes, she (and her crew of finely hand-picked TAs) does expect a lot in return...class participation, completion of the intensive readings, and scholarly essays.  She may seem intimidating at first, but you can definitely tell that she cares about you.  She will ardently invite the class to attend office hours, and from my experience, it is an offer worth taking up.  Not only does she give you chocolates there, but you will also gain a good deal of wisdom about comparative political science or any other subject your conversation may wander off to.  Also, I would attend the movie screenings as they are always followed by a really insightful discussions.  I found that these casual and impromptu discussions helped me solidify what I learned in class the most.  The films are all interesting too, so you won't find yourself suffering for two hours.  This definitely isn't an easy class.  In fact, I will be surprised if I even get any form of an A, but with the knowledge and critical skills I've gained, I could really care less.  Mona will push you hard and mold you into a more intelligent being in the end.  I highly, highly recommend this class to all students, even non-political science majors (who can pass/fail it and just gain all the wonderfulness that is this class).  This Mona will make you smile.\nWorkload:\n4 in-class quizzes (each on 1-2 readings for that week...she will tell you which ones beforehand), 2 midterm take home essays (3-4 pages of double-spaced responses each), and a final research design...don't be fooled by the take home midterm and the final research design--they require a lot of work and thinking\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "April 24, 2007",
            "review_content": "\nMona is, without a doubt, the most amazing professor I've encountered. SheÂ’s very young, in fact just finished her dissertation (that won best dissertation in the social sciences for that year), yet her knowledge seems almost limitless Â– it often appears like there is nothing she has not studied, no topic she will not be able to delve into and expand upon. And she is Â– everyone I've spoken to agrees on this Â– simply brilliant. She has analytical capacities that are at times even discouraging, when you realize that you will never be able to be as smart as her. She has a way of taking your remarks and rewording them to make what you meant to say sound much smarter than you intended it to be. And yet, she will always make you feel capable, never make you feel like you are not every bit as talented as she is. \nSheÂ’s also a great lecturer, putting concepts into clear language, often making you wonder why your other professors donÂ’t have that rich a vocabulary. She puts in astounding amounts of thought and effort into every student: her choice of readings is always intentionally diverse and brings out all sides of intellectual debates; and if you go see her during office hours she will make you feel like she was waiting just for you, and beside being friendly, you will always leave her office feeling less stressed and more focused, with a clearer grasp on what it is you need to do. \nBut mostly, she teaches things that are not necessarily part of her job description. In her lecture class Â– a 4000-level lecture Â– I learned more about social science writing than I did in any of my other classes, including writing classes, and probably more than about Middle Eastern politics. That she cares enough about students to digress from lecture and point you to the right direction in your writing is commendable, and should be done more often. In such a high-level class she has every right to expect that students should have enough training in writing, and yet she knows that is nearly never the case, and is flexible enough to make time to teach such important skills.\nIf you like to bullshit Â– stay away. ThereÂ’s no place for that with Mona; she reads straight through you, and it can be a bit intimidating, especially for those of us who are used to getting good grades by choosing easy ways out. Then again, I've discovered that I've usually learned very little in classes that were easy. SheÂ’ll challenge you, put you to an incredibly high standard, but will guide you through the process. If you want to get something out of this degree, if you want to feel like your time wasnÂ’t spent chasing AÂ’s and getting an Ivy League name on your resume, do not skip her classes. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "April 11, 2007",
            "review_content": "\nits a good class but heavy workload. do not think of this class as an intro, you must have some background knowledge in the field. she is very passionate about what she teaches but grading is usually harsh. if you want to do well, be prepare to spend hours weeekly doing all the readings. the class structure is a bit displaced, its a good class to take if you want to get indepth into the field if not, do not choose it just to fulfill a requirement! \nWorkload:\n4 quiz, 1 take home midterm, 1 take home final, recitation and mandatory discussion\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "January 09, 2007",
            "review_content": "\nYes, she's nice and incredibly smart... but her teaching style is not for everyone.  She's totally inviting and welcomes class comments (too much if you ask me.. the grad students and life time learners especially would go on and on about whatever they wanted) but this class is not (as she claims on the first day) for people who know nothing about the Middle East.  I really did know nothing about the area, and I think I left the class feeling the same way.  The problem was that she assumes a certain level of competence (in terms of history, background, etc) and then applies lots of theories to the region (maybe I'm the idiot for taking a 4000 level poli sci class on a region I knew nothing about).  The class was more organized in the beginning but then turns into a free for all class conversation without much substance toward the end.\nWorkload:\nA LOT. a ton of reading (understandble for a 4000 level class), a map quiz (easy), weekly section (great TA- Brooke Greene),2 take home midterms (hard hard hard) and a take home final (also hard)... not for the inexperienced/lazy...\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "December 13, 2006",
            "review_content": "\nWow. She is an incredibly intelligent woman (who has the power to intimidate me despite her continued efforts to invite people to office hours).   Another really great aspect of the course was the attention both the prof and TAs gave towards improving your writing.  They're tough graders, but if you never expect to get an A, you will be grateful for everything you learn during the writing process. \nI think the main problems I had with the course, are the same problems I have with every poli-sci class.  Too much assigned reading for each class makes it often impossible to do, and then you are left confused for the majority of the time. Also, the study of a region, starting with relatively no historical knowledge, makes it difficult to contextualize the case studies and learn from them effectively.  Despite the prof's attempt to provide historical background for each case, specific to each country, I had difficulty assesing each case in the context of the whole of what we were learning in the course.  That said, the readings were great and my TA, Brooke, did an amazing job at explaining them.  \nWorkload:\ntooooo much reading for each class. papers take a long time, because the expectations are high. \n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "January 01, 2006",
            "review_content": "\nProf. El-Ghobashy is, hands-down, one of the best professors I have taken at Columbia.  Not only are her lectures extremely stimulating, but they are highly organized and structured.  Although she's a pretty tough grader, the readings are of average length for a 4000-level political science class and the work is well worth it.  Take whatever class she offers--you won't be disappointed.  \nWorkload:\nTwo 1500-word papers, graded pretty strictly, and one longer final paper.  No tests.  Average reading for a 4000-\nlevel polysci class. \n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "January 01, 2006",
            "review_content": "\nProf. El-Ghobashy is, hands-down, one of the best professors I have taken at Columbia.  Not only are her lectures extremely stimulating, but they are highly organized and structured.  Although she's a pretty tough grader, the readings are of average length for a 4000-level political science class and the work is well worth it.  Take whatever class she offers--you won't be disappointed.  \nWorkload:\nTwo 1500-word papers, graded pretty strictly, and one longer final paper.  No tests.  Average reading for a 4000-\nlevel polysci class. \n"
        },
        {
            "course_name": "Comparative Politics Seminar: Authoritarian Regimes",
            "review_date": "January 12, 2005",
            "review_content": "\nThis class was a seminar that examined various types of auth. regimes and methods of resistence.  Mona is an extremely thoughtful and organized professor.  The syllabus was well-designed and the readings spanned the entire world in terms of case studies.  She guides discussion well although at times she'll lecture.  You can tell she's very opinionated and holds back (or doesn't at times) what she thinks.   She's finishing up her PhD and will make a great professor one day.  She's also accessible outside of class and  great to just chat with.\nWorkload:\nSix 2-3 pg papers on weekly readings.  Take home midterm and final (difficult questions that made you think).\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "December 25, 2004",
            "review_content": "\nProfessor El-Ghobashy is one of the more organized lecturerers I've come across.  Maybe it was the nature of the course (intro level SIPA), but the amount of material we covered-both theoretical and historical-beat most classes at Columbia.  Plus, she was accessable and friendly (unlike our TA), and genuinely concerned with improving our expository writing abilities, not just with handing out a grade.  I would recommend it for those who have never had a survey course on the Middle East; this is as good as it will ever get.  \nWorkload:\na few hundred pages reading per week, map quiz and three 1500 word essays (the hard part is squeezing all the of the readings into five tiny pages)\n"
        }
    ]
}