{
    "prof_info": [
        {
            "prof_name": "Celine Marange",
            "prof_id": 4872,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French II",
            "review_date": "January 09, 2013",
            "review_content": "\nShe is an excellent teacher. She is the best language teacher I have ever had at Columbia, and probably the best teacher I have had at Columbia. She cares immensely about her students. She goes at a quick pace, but she explains everything very clearly. She makes sure that everyone is on the same page. She is constantly reviewing the material with the students and she constantly reminds her students to review themselves and exactly what to review. She is so patient each class and she is so positive and happy that I looked forward to each class. Your french will improve so much after one semester. I highly recommend taking Celine's class. \nWorkload:\nChapter tests after two weeks or so and essays every two weeks or so. Make sure you do not fall behind in this class, but this applies to all language classes. \n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "May 07, 2012",
            "review_content": "\nI have never written a review for an instructor before but the night before her final, I feel compelled to do so. Celine is indeed, the best language instructor you will ever have. I have never seen classes so thoroughly prepared. She obviously spends a ton of time balancing every class with speaking exercises, pronouncing exercises, and reviewing grammar etc. You will speak French at the end of this class, whether you like it or not. The complete opposite of a slacker class, only take if you are looking to actually speak French and not just pass the language requirement, as you will be drilled on conjugations, accents, exceptions to the rules etc. until you hear them in your sleep. Since Celine puts so much energy into her classes, she expects you to put the equal amount. Even though all Elementary II classes had the same test, there is no way that any one was a harsher grader in terms of accents and other nuances than Celine. She also makes sure you are comfortable speaking. She allots time to talk to a classmate for like 4-5 minutes about 3-4 times every class with conversation prompts and makes sure you are speaking that entire time. She also is a big fan of randomly calling on students. I am getting a C in the class and have put an equal amount of work into every other language class I've ever taken here and gotten a B+ - A, however, I have learned more French this semester than I've ever learned in so short of a time. \nWorkload:\nWeekly compositions, a test every two weeks, 2-3 long term projects, midterm, final. Daily workbook exercises. Most intense workload I've ever had in a language class. \n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "December 12, 2010",
            "review_content": "\nCeline is a real delight, and perhaps the best language teacher you will have at college. My judgements are not purely based in her cheery and lighthearted disposition - Celine will challenge your oral and written proficiency and bring you miles in your French comprehension in a very short time. She's always welcome and encouraging to students to come see her after class for extra assistance, and does not feel bad to correct your pronunciation even when you are asking her a question. Her course load is the same as the rest of the Elementary II courses, but she adds a flair to her homework assignments with special music video and television program recommendations which we discuss during class. I could not recommend her more highly. \nWorkload:\n5 short compositions, 4 in-class tests, one oral interview and one oral presentation, final. \n"
        }
    ]
}