{
    "prof_info": [
        {
            "prof_name": "John Salyer",
            "prof_id": 11074,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Social Contexts of U.S. Immigration Law and Policy",
            "review_date": "November 11, 2013",
            "review_content": "\nAlthough I had this class on a Thursday afternoon which made it really hard to focus, I loved this class. It's pretty low pressure allowing you to enjoy the readings and not worry too much about the couple readings you'll inevitably find too boring to read. Most of the readings were incredible and they were organized in a cohesive way. I enjoyed the discussions and Professor Salyer is good at facilitating discussion. The reaction papers are graded very easily. As long as you come up with a thesis and don't get summarize all the readings (and you actually do all the readings...) you'll be great. Same with the midterm--as long as you have read and know the material, you'll be fine. Salyer seems to mostly just use assignments as a check in to make sure people are keeping up, not necessarily to grade you harshly. If you're interested in the subject I highly recommend this class. I don't find Salyer's lectures to be boring like some people have suggested. He's also obviously very knowledgeable about the material which is helpful since immigration law is so complex. \nWorkload:\n4 reaction papers (open ended assignment about the week's reading, you choose the topic/ thesis) and in class presentation of one of those papers (40%), in class midterm (40%), final summary paper for last week's readings (10%), participation (10%)\n"
        },
        {
            "course_name": "Social Contexts of U.S. Immigration Law and Policy",
            "review_date": "April 05, 2011",
            "review_content": "\nThe readings for this class are really interesting but Professor Salyer is SO boring. His voice is incredibly monotone and his lectures are just him reading his notes. I was really disappointed in how he lectured because his readings were great reads. You will find most of the students on their laptops playing Tetris or checking Facebook. In the end, you do learn a lot from his readings if you do the work he assigns. It is a really easy class that meets once a week. I recommend it if you are looking for an Easy A. \nWorkload:\nWeekly readings.An in class midterm and final, and a research paper (15-20 pgs) - I wouldn't doubt if he only skims the research paper so don't stress over it\n"
        },
        {
            "course_name": "Social Contexts of U.S. Immigration Law and Policy",
            "review_date": "December 22, 2010",
            "review_content": "\nNew seminar this semester (Fall 2010). If you're at all interested in immigration, this course is pretty good. Some of the books on the syllabus I'm actually planning on reading over winter break just because they seemed interesting and I never got around to reading them when they were assigned. The professor is new to Barnard (very liberal) and extremely laid back. Hopefully Barnard is smart enough to bring him back. He has a lot of knowledge from working for the ACLU and from being an immigration lawyer. Like any seminar, class can drag on a bit, but overall a fairly easy class and the reading isn't too heavy, mostly likely lighter than other seminars (of which I have none under my belt to compare it to). He does come to class though with his lecture essentially already written out, but decently animates his reading. I'd recommend it. \nWorkload:\nWeekly readings; in class midterm and final, and a research paper (15-20 pgs)... we were supposed to have a project... but he basically forgot to plan it. \n"
        }
    ]
}