{
    "prof_info": [
        {
            "prof_name": "William Lowe",
            "prof_id": 3622,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "History of African American Music",
            "review_date": "June 08, 2012",
            "review_content": "\nThe first day of class, the professor blasted Jay-Z's \"Empire State of Mind\" and made us do some sort of soul clap. That was why I decided to not drop out of the class. It was clear from the first day that Professor Lowe was very improvisational. He was very entertaining, but I don't know if I actually learned something substantial from the class. I felt that each lecture was about the same thing: racism against African-Americans. I felt like I didn't learn about the history of the music at all. Most importantly, I was often confused. There seemed to be no structure within the class. Yes, we were following a syllabus/reading list, but we never talked about any of the readings in depth. We sort of just talked about whatever the professor felt like discussing (which was usually about racism in America). As far as grades are concerned, I happened to get an A in the class, but I don't really know how. Grading procedures were SUPER unclear. The professor said in the beginning that he doesn't \"do percents.\" If he felt a student worked hard then he would give them a good grade. But he was not going to make the midterm weigh more than the cards&letters; assignments because he wanted us to put effort into everything we handed into him. \nI enjoyed the cards&letters; because it made me venture out into the City and actually experience live music. Nowadays, I feel stuck to Youtube or Vevo when I want to catch a performance. The midterm was EXTREMELY confusing. The questions were open-ended and seemed impossible. As far as the final goes, I actually really enjoyed it. It was super easy! You just form a group, pick a topic, and present during exam week. Since there were many groups, we stay the entire 3 hours. The professor ordered food for us, and allowed us to blast our music while we ate. I've never seen such a chill professor.  \nOverall, this class is very easy-going-- although the reading is extremely heavy, and how we were graded was confusing and unclear, I enjoyed the class. I would recommend it if you're interested in race, ethnicity, and jazz (little bit of hip hop). It's a fun class to take if you don't have any requirements left to fulfill. \nWorkload:\nHEAVY READING! A book a week! 4 cards and letters (you must go to live concerts and report about it in any form...essay, poetry, photo, collage, etc due at the end of the semester.), a midterm approx 15 pages take-home essay (you have a month to write this, but beware! the questions are INSANE!!!!), final (group presentation about a self-select topic).  \n"
        },
        {
            "course_name": "History of African American Music",
            "review_date": "August 07, 2011",
            "review_content": "\nI understand that MANY people will disregard my review because I seem bitter but William Lowe is by far, a phony. He comes off as a very intellectual, well rounded person (which, I have no doubt that he is) BUT his teaching \"style\" relies on the assumption that every single CC/BC/SEAS/GS student is somehow privileged and ignorant to the plight of the racial minority.\nAs a young black woman, I watched class after class nothing more than Lowe loosely stringing fictional novels (as well as a few biographical text) to the creation of \"jazz\". More than 2 classes seemed to just be us watching a movie. No response. No discussion. Just watch the movie. Was there ever a discussion of the black female outside of the context of her objectification in the early 20th century? No. Did we read more than 2 books by female authors? No. As far as Lowe was concerned, Jazz revolved more around the male black figure than any other prominent female singer (which, without trying I LEARNED ABOUT ON MY OWN). \nThis class is a joke. I can't remember a single lesson plan and, skimming through my notes most of the time he spent \"lecturing\" revolved around civil rights abuses and the use of jazz as a way to signify culture happenings.\nIf you want to learn about ACTUAL music, just avoid. AVOID AVOID AVOID. But I know no one will listen because I didn't either. Enjoy that.\nWorkload:\n1 book a week ranging anywhere from 100-300 pages. Each week discussion questions are posted by a random assortment of 5 people that he claims greatly influence his lectures (no). 4 2-page somethings (he never specifies the structure they should take) responding to live music. A take home midterm with no page limit or maximum nor concise prompts (If I could upload one of the questions I would). A final that builds on your midterm. How all of these affect your grade? Who knows! Everything seems very subjective to how much you attended his class...\n"
        },
        {
            "course_name": "History of African American Music",
            "review_date": "August 11, 2010",
            "review_content": "\nBill Lowe conducts a good class. The reviewer below me aptly described his teaching style as \"improvisational.\" The class is fun, and as a newcomer to African-American Music (I knew Billie Holiday's name, but didn't even know she was a \"she\" -- disgraceful, I know), I learned a lot. Although I took it mainly to fulfill my art requirement, I'm really glad I did.\nThere was a lot of reading, particularly biographies (Billy Strayhorn, Thelonious Monk, Billie Holiday), but they read quickly and were enjoyable. The class offered solid, mind-opening discussion. Don't skip class -- Lowe commutes from Boston once a week just for us (on the Bolt Bus!), and anyway, it's in class rather than in the readings that you are going to learn.\nLowe is a very kind, very approachable man (he calls himself \"the bald guy\"). Enjoyable class.\nWorkload:\nApproximately a book a week (some short, some looooong), usually a novel or a biography. One long paper, called a midterm, but really more of a term paper (about 15 pages), to be written in a creative fashion and reflect that you actually read something and paid attention in class. One presentation with a partner on one of the assigned books. For the final, group presentation on one of the questions comprising the midterm paper prompt -- so if you did the midterm, then you've already done the final.\n"
        },
        {
            "course_name": "History of African American Music",
            "review_date": "November 06, 2009",
            "review_content": "\nI was in the same class as the reviewer Spring 2009 and I have to disagree on a few points.  Although the class was not what I expected, I did learn a few new things.\nFirst, Bill Lowe canceled class because he was at the inauguration of our new president like many other professors.  He is NOT crazy.  My classmate also didn't qualify the crazy claim.  Bill Lowe happens to be very eloquent and is a very articulate professor.  If we wanted to drop the course, we could have.  But for 4 credits, one night a week, I could sit through anything for an elective.\nHis teaching method is not syncratic like we Columbians are familiar with.  His teaching style is somewhat improvisational, like the musician he is.  His teaching efforts should not be mistaken because he wants us students to think outside of the boxes which are defined by a few in power (and are often too limiting).  The novels were not only about racial injustices but included:  the perpetuation of stereotypes, gender bias, sexual discrimination, interracial prejudice as well as intra-racial prejudice.  It sounds like my classmate didn't read the books (learning is reciprocal).   \nBill is flexible with his assignments and his intentions were good.\nHis syllabus gave one (maybe two) of his own authored essays as a possible source for the take home final.  He didn't make us read them as they were very small parts of the curriculum. \nYes, Jazz is the primary music that is covered.  I would have liked to cover blues and gospel more and was disappointed that we did not.  Some of the book choices were awkward but overall they were interesting to say the least.  \nHis personal anecdotes about the music industry (in general) and more specifically, the jazz business were quite funny and informative.  \nMy biggest gripe with Bill Lowe's class is the title.  The title of the course is a misnomer.  I think if the course title emphasized Jazz instead of African American Music, his course would have been more enjoyable.  The students would have a better idea of what to expect.\n\nWorkload:\nOne novel per week.  Some documentaries and off-broadway (plays recorded to DVD).  One take home mid-term and final.  Workload is medium to heavy (its 4 points)\n"
        },
        {
            "course_name": "History of African American Music",
            "review_date": "September 04, 2009",
            "review_content": "\nLowe canceled class the first week, so by the time we realized he was crazy it was too late to switch out. You don't listen to any music, really. You just read some novels and talk about racial injustice. He then tries to tell you that the composition of the novel each week is \"like music.\" He makes you read his own essays and listen to his own compositions, despite the wealth of material available. Also, Jazz is apparently the only African American music.\nWorkload:\nOne novel every week, and a poorly written take-home final.\n"
        }
    ]
}