{
    "prof_info": [
        {
            "prof_name": "Bradford Garton",
            "prof_id": 298,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "October 03, 2013",
            "review_content": "\nCongratulations, you just won the lottery! This is easily the easiest AND most fascinating class I have ever taken at Columbia. Brad tells you on the first day that he really, really, really wants to give everyone an A... and he does! Unless you royally screw up aka don't come to class, you will get an A. There is NO homework. That's not a joke. He tells you straight up not to buy a textbook and that this will be the easiest class ever. His son is a student at Columbia, so he is all about alleviating the average CU student's homework plight and really teaching you for the sake of teaching you. Just because there is no work, though, doesn't mean you don't learn anything. Brad is so so so smart, and just BLOWS your mind away with great music and facts. He doesn't ask you to memorize artists, pieces, etc, but rather asks you to just be able to differentiate the different time periods of music. This is super easy if you go to lecture, as he makes an outline every class about what makes a time period distinct.\nWorkload:\nNO textbook. NO reading.\nMidterm and final- totally easy. Brad plays a song and you have to tell him what time period it is from and why. Even if you're wrong, he will give you near full credit if you justify your reasoning. \nYou also have one three-page paper due at the time of the final. Super easy. He just asks you to describe a musical experience. Totally lax... he said his favorite paper was about a person describing the sound of an airplane flying overhead. My friend wrote about listening to music on the subway. It's super fun to write!\n"
        },
        {
            "course_name": "MIDI Music Production Techniques",
            "review_date": "January 02, 2011",
            "review_content": "\nTotal G. The TA, Bryan, who will probably be teaching the class too is also just as much of a G. This is a fantastic class to learn some useful and not-so-useful (yet still fascinating) aspects of electronic music. For the most part, I think it's an underappreciated side of music and this course will be eye-opening. Truly fascinating and taught by total music fanatics. Enjoy this class, you lucky bastard. Check the syllabus on the Computer Music website but you'll learn some Logic Pro, Ableton, Max MSP, and some other quirkier things. Prentis Hall has a lot of serious history so it is really a special place to be. A bitch of a walk to 125th, but use the shuttle buses at 116th, which for some reason nobody seems to know about.\nWorkload:\nTwo major projects -- midterm and final. Attendance is crucial. Use the projects to explore your creativity. Don't worry about the grade... Trust me.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 06, 2006",
            "review_content": "\nall the good things former students say about him are true. he is freakin awesome! one of the best profs at columbia--easy, interesting, nice. \n"
        },
        {
            "course_name": "MIDI Music Production Techniques",
            "review_date": "January 16, 2006",
            "review_content": "\nBrad Garton is by far the nicest, most understanding, weirdest, most thought provoking professor I have had at Columbia. Any of you who are able to get into any of his classes are in for a treat where you learn, in a hands on environment exactly what you need to know about MIDI music. Brad is great because in addidtion to teaching you the practical aspects of the course he actually gets excited. \nHis passion for the music that you can create is more than commendable\nWorkload:\nTwo projects\n"
        },
        {
            "course_name": "Basic Electroacoustics",
            "review_date": "November 02, 2004",
            "review_content": "\nBrad Garton is the man... enough said.  Find the chance to take one of his classes and explore the wonderful world of computer music.  One of the coolest people I have ever met.  Never would I ever bother to write for this thing... But for Brad.  The world.  \nWorkload:\nAt your own pace\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 15, 2003",
            "review_content": "\nif you have him you are incredibly lucky. he's really smart and really cool and so enthusiastic about the subject matter. he's also easy, very little work, generous grader. there should be more profs like him at columbia.\nWorkload:\nconcert report, midterm, final, class participation\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 23, 2003",
            "review_content": "\nThis man is the best teacher I've ever had. All you do is listen to music: music Brad likes, music he doesn't like, and music you'll both like and dislike. It's fantastic. He wants to give you an A, and you'll have to really screw up not to get one. But it's not just about the grade; you'll love going to class, you'll love listening to Brad and his stories, and you'll love (some of) of the music you listen to. He's also a very talented composer, and an all around great guy. Consider yourself lucky if you got Brad for Music Hum.\nWorkload:\nNone to speak of. The midterm consisted of identifying a couple of easy music pieces; I got 2 of 3 right, and got an A on the midterm anyway. One paper which I enjoyed writing, and a final consisting of listening to a piece of music and writing about it. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 19, 2003",
            "review_content": "\neveryone loves Brad--he never dresses up like other profs but students love him more than all others,,perhaps the best prof. in music dept. after Ian Bent. \nmost of all--he wants you all love the music, that's it. he is really down to earth, and it is one of the relaxing classes of the week--i tell ya, if you lucky take his class.\nWorkload:\nfor brainers--none but a concert review; for morons--show up and memorize a few musical terms and rest time is up to you, but most students do not want to miss a fun class exchanging for napping\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 09, 2002",
            "review_content": "\nBrad rocks. He is a genius (he'd hate that appellation). Brad's also sweet and kind and generous...he'll do anything to make you love and understand music. This includes forgetting all about the textbook and the rest of the BS. \nWorkload:\nNothing\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 09, 2002",
            "review_content": "\nThis is what Prof is supposed to be. He LOVES teaching, even in a course that he knows most people are being forced to take. He makes the topics very exciting, demands participation. Even if you don't care about music you'll like his class. He should run a seminar on teaching for all the depts.\nWorkload:\nmidterm, final, 1 paper. Requires listening to the music (he puts it on the web) but reasonable amount of work.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 09, 2002",
            "review_content": "\nThis is what Prof is supposed to be. He LOVES teaching, even in a course that he knows most people are being forced to take. He makes the topics very exciting, demands participation. Even if you don't care about music you'll like his class. He should run a seminar on teaching for all the depts.\nWorkload:\nmidterm, final, 1 paper. Requires listening to the music (he puts it on the web) but reasonable amount of work.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 09, 2002",
            "review_content": "\nThis is what Prof is supposed to be. He LOVES teaching, even in a course that he knows most people are being forced to take. He makes the topics very exciting, demands participation. Even if you don't care about music you'll like his class. He should run a seminar on teaching for all the depts.\nWorkload:\nmidterm, final, 1 paper. Requires listening to the music (he puts it on the web) but reasonable amount of work.\n"
        },
        {
            "course_name": "MIDI Music Production Techniques",
            "review_date": "December 31, 1999",
            "review_content": "\nWhat can I say? Brad is the man. He knows an incredible amount about the ever-growing field of computer music and is enthusiastic about it when he teaches. I came away with my eyes opened to an entirely new world of music. The class is just plain cool.... highly recommended. Word to the wise: e-mail Brad immediately if you want to take the class; the waiting list is HUGE\nWorkload:\nFun and easy: you just create your own masterpiece using lots of cool expensive toys. You do have to go to class though, so don't register if you're planning to skip a lot\n"
        }
    ]
}