{
    "prof_info": [
        {
            "prof_name": "Carlos Montes-Galdon",
            "prof_id": 11105,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 18, 2014",
            "review_content": "\nI would have to say that Dr. Uribe is the complete opposite of a great approachable professor. His teaches style is like talking to a brick wall in a monotone voice. He drones on with a succession of derivations and equations on the blackboard without ever letting students appreciate the big picture. Contrary to what a reviewer wrote below, Uribe's accent is not at all the issue: His intonation and demeanor is. There is absolutely zero engagement with the class. He does not pause to emphasize important points, and refuses to answer any questions during class (even though only about 40 students show up). By the time you ask him after his lecture, most of what he's said has gone in one ear and out the other. \nIf you want to have an enthusiastic, entertaining professor who illuminates and contextualizes the numerous equations you will have to learn, avoid Dr. Uribe with a ten foot pole. Uribe is undoubtedly an expert in his field, but is too absent-minded to effectively share his lessons with a room full of undergraduates.\nIf you can motivate yourself to regurgitate the equations that Uribe writes on the board and translate them into intuitive concepts, you might get something out of the lectures. I, like many others, learn everything from Carlos' recitation. Carlos is hands down the best TA any student could possibly have. His teaching style is everything that Uribe is not able to do. He is personally invested in his students and actually wants us to succeed. I definitely would have stuck with a major in econ if Carlos had been the excellent professor and Dr. Uribe had been demoted to being a mediocre TA. \nWorkload:\n40% midterm, 40% CUMULATIVE final, 20% homework\nMidterm had 8 problems. Final has about 16. You will have to memorize a lot of equations for the exams, but even then you will not do well unless you have an intuitive understanding of them. Average on the midterm was about 45%. Weekly homework problem set. It is necessary to give yourself some time and go to TA office hours if you want to do well on the homework. Partial credit is not generous on the homeworks or exams. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "October 27, 2013",
            "review_content": "\nI took a summer class in Intermediate Macro with Carlos and I was initially pretty hesitant cause I thought maybe a class taught by someone not yet a 'professor' wouldn't give me as much in terms of learning.\nHOLY SHIT WAS I WRONG. Carlos, is by far, BY FAR, the most amazing TA I have ever come across. Many, many, many people have told me ( and I agree) that Carlos is better than Xavier himself. I've sat in on a few of Xavier's lectures, and while they were pretty tolerable, listening to Xavier lecture after the awesomeness of experiencing Carlos is like eating Panda Express after having dined at a classy Chinese restaurant.\nCarlos cares so much about his students learning the material, and his ridiculous descriptions of vodka, cheesecake and Bieber kept me awake the entire time. His lecture notes are fantastic, they're fantastically drawn and they look like the physical manifestations of a lot of dedication and love. He has his economic concepts carved into his heart, no question we asked ever fazed him. Also, go to his office hours! And send him emails if you don't have the time for OH. Emails are replied to promptly.\nPS: He's also a massive Game of Thrones fan, so that was a bonus point on my end.\nWorkload:\nPretty standard, about 6 problem sets (he drops one), midterm and a final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "October 08, 2013",
            "review_content": "\nThe BEST TA I have ever had!\nCan compete with Javier himself which is pretty hard to pull off.\nVery approachable and helpful. Funny in his emails(funny in person, too).\nThere is no textbook for the Intermediate Macro course yet Carlos gives out his notes which are all you need or want to know and serve well as a textbook.\nRecitations are always full and many people have to sit on the floor(it is worth it even if you are sitting on the floor).\nBrought cookies for us on his birthday which the recitation fell on. I wish somebody remembered about his birthday(October 8th!!)\nWorkload:\ntypical intermediate macro\none problem set a week+ midterm+final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 14, 2013",
            "review_content": "\nHow this man doesn't have a golden nugget by now I will never know. \nHe is one of the most caring and insightful teachers I've had thus far, and while he has relatively high expectations for performance, doesn't judge based on ignorance or confusion. \nHe puts an extraordinary amount of work into making notes and review questions for exams; he basically reteaches the course every week, so if you have Carlos, it's more often than not more valuable for you to go to his recitations than it is to go to the lecture.\n\nWorkload:\nStandard macro workload (PSet once/week, one midterm, one final)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "July 22, 2012",
            "review_content": "\nCarlos is the best TA I have ever had, and I frankly can't imagine having a better one anytime in the forseeable future.\nHe has already developed a stellar reputation among those students for whom he has been a Macro TA, and it is well deserved.  I really don't need to write this review, but I just want to see him get his gold nugget (because he deserves it) and hopefully get hired as a professor by Columbia (because Columbia needs him).\nTo briefly rehash what other reviews have already said, Carlos is incredibly helpful, both in individual meetings and correspondence as well as in his very popular (and very helpful) recitation sessions. As a disclaimer, I thought macro was moderately difficult--not especially brutal, though i had to put in some effort for my b+--but it was Carlos's notes and recitations that pulled me through. Plus he was willing to explain any issues I had with problem sets, and he even sent me an individual email to check in when one of my problem set scores wasn't as high as usual (which mostly due to a few careless errors, but still, i appreciated his concern).\nIn short, Carlos cares and is a fantastic teacher who knows his Macro concepts cold. I don't write many reviews, but I have to give credit where it's due.\nWorkload:\ndepends on the professor, but not the point \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 26, 2012",
            "review_content": "\nBoth sharply intelligent and viciously good-looking, Carlos is a huge asset to the Economics Department and a gold nugget instructor if I've ever had one. He has got to be the friendliest and most approachable person I've ever met at Columbia, sending us frequent e-mails during the semester with reminders, notes, tips on the problem sets etc.  He holds weekly recitations which you should most definitely attend as he managed to be twice as useful as each week's lectures in half the time. He writes copious notes for every one of his sessions which cover all of the week's material and are understandable on their own, but you don't wanna miss his tangible (if slightly hilariously awkward) explanations involving copious amounts of cheesecake and vodka, not to mention his puppy dog face when he's not sure if we're giving him our full attention (as if we all don't love him). \nOn top of all this, Carlos is just super nice and incredible as a person. One week, he brought all of us Westside Cookies, just because \"he was tired during recitation the week before, and his explanations didn't really make sense\". I don't think anyone had really noticed a difference in his teaching as he always seems to have boundless energy, but hey, free cookies. Not to mention that he would sometimes even hold two office hours a week just to accommodate all of our questions. I think you would be hard pressed to find any other teacher who cares as much about his students really learning the material as he does. The fact that his recitations packed more students every week than the actual lectures, and an additional 10-30 students would show up to his office hours speaks volumes about him as an instructor. \nI almost forgot to mention that Carlos also has a fantastic grasp on all the material; he's clearly taught this class before and no question ever posed fazed him, no matter how tangential. Even more, if anyone had a question, he would make up a graph on the spot or find another, crystal clear way to explain. I really can't find enough praise for him; if you're in class where he is the TA, make sure to make use of him, go to recitations and office hours, and send him e-mails (he responds within approximately 2 seconds). I almost think it's worth it taking a class just to have him as a TA; even in that role he is as useful as a full-blown professor, if not more just because he is so approachable. \nWorkload:\nWeekly Problem Sets (short for the econ department) that he helped us with tremendously (although he doesn't tire of mentioning how he \"shouldn't be doing this\" ;))\nMidterm + Final, very standard for Econ department. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 25, 2012",
            "review_content": "\nProfessor Uribe is the best professor I've had so far at Columbia. Yes he is a quiet man, but he is completely approachable and always tries to add little jokes and anecdotes to his lectures so that his students can connect to the subject matter or at least get a laugh.He made me learn to love macroeconomics.  There were 9 problem sets which were all really easy (average ranged from like an 85%-95%). \nCarlos was AMAZING. Best TA in the world and I really hope that Columbia hires him right after hes done with his PhD. He is so caring of his students, teaches everything step-by-step, and does anything to accommodate your needs. His recitations are indispensable so GO to them, you wont regret wasting the 90 minutes each week. He's such a sweet and handsome man. \nWorkload:\nThere were 9 problem sets which were all really easy (average ranged from like an 85%-95%). Midterm was pretty easy but the class didnt do as well as planned (nerves kicked in). \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 25, 2011",
            "review_content": "\nI wasn't planning on writing a review of this class, but after reading the review immediately below I felt a duty to save you, future macro taker, from the TRAP you will fall into if you take this class. I learned more about macroeconomics from my principles class than I did from Xavier's class. To give you a little over-view, we spent over two months discussing and REVIEWING the solow-swan model ad nauseam, something that we could have easily spent two weeks, if that, learning. Xavier dedicated a weeks worth of lectures to \"ideas\"--now I know Zara makes clothing faster than H&M;, thanks Xavier--and even spent a lecture talking about the history of money... did you know ancient civilizations used animal bones and feathers as mediums of exchange? Yup, that happened. Also, as technically the last macroeconomic requirement for econ majors we talked about government spending for 30 minutes in the final lecture of the course. Not only can Xavier NOT teach, but he is also NOT funny. Every time he simplified an equation or gathered terms he, in attempt to get some laughs, called it an \"old Japanese tradition\"...the only \"old Japanese tradition\" I wanted to commit in that class was Seppuku. \nThe only redeeming feature of this course was Carlos, our head TA. He was FANTASTIC, and everything I got out of this macro class was due to him. He put together excellent lecture and review notes with extra problems that challenged us and were great review for the midterm/ final.\nBUT, that being said, if you have the choice between this and ANY OTHER macro class, I would go for the other, it was PAINFUL sitting through Xavier's lectures, and can confidently say I learned next to nothing about macroeconomics. \nWorkload:\n8 Problem Sets, Midterm/Final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 19, 2011",
            "review_content": "\nTake this class.\nXavier is a superstar. And I don't just mean that he is incredibly famous and talented-- he dresses and acts like one too. He wears funky blazers to class and has a sense of humor that will crack up the entire hall and lighten the mood, especially during a confusing lecture (like when he is deriving the Solow-Swan model, or explaining the income and substitution effects). On top of that, he's a great economist. A lot of the reviews say that yes, he's funny and all, but he doesn't know how to lecture. I did not find this true at all. Xavier is very passionate and knowledgable about the material, and goes through everything in an orderly and gradual manner. Even if that leaves you a bit confused, he will go over the main points of the concept during the next lecture to make sure you're up to speed. He has a great way of relating everything to real world issues, and will constantly give you present-day examples or anecdotes that keep the class interesting and relevant.\nThat being said, the class is 300+ students and Xavier is a busy guy. The TAs are very helpful and extremely approachable, especially Carlos. GO TO HIS RECITATION. This guy is indispensable. He wrote notes for every topic we took (which practically became the textbook for the class, as Xavier doesn't assign one), and held weekly recitations that went over Xavier's material and helped solve the problem sets. Trust me, you will be completely lost in the class without Carlos. He is very nice, holds extra office hours, and always responds promptly to e-mails. He also held 3 hour review sessions for the midterm and the final, which were extremely helpful. Most of the questions on the exams were similar to those he did in the sessions. Seriously... make use of this guy. You will not survive the class without him. \nAll in all, I loved this class. It was challenging and the problem sets were sometimes annoying, but there were always TA sessions and office hours that helped. I came out of this class having learned so much and not regretting any of the effort I put in. If you love macro and want to have a fun, interesting, and engaging semester, take Xavier's class.\nWorkload:\n8-9 problem sets, assigned almost every week-- usually a week before they are due. The TAs will hold recitations going over the problem sets before they are due, as they can sometimes appear endless and irrelevant to Xavier's lecture.\nEasy midterm. More challenging final, but you'll be fine if you get the material. Curved to a B+ (I think). \n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 18, 2011",
            "review_content": "\noverall the course was actually pretty good. most of the people who take it want to go to wall st., and im sure the modeling that stephanie taught us will be useful for that. on that note, the actual usefulness of the topics that she taught was somewhat low. the growth theory stuff was ok, but then she spent what seemed like half the semester on cagan model, which is (at least what i thought) useful for hyperinflation only. the conclusions were that hyperinflation occurs only when the gov't prints money to finance its spending. \nreally? did we need 6 weeks to get to that concept? sure, the mathematical modeling was ok but conceptually, not too much substance. the midterm was sort of weird, b/c the focus of the class seemed to be mathematical modelling yet the questions required 'intuition,' not math (for which you were supposed to attend the lectures for; example, if half a country gets invaded, what happens to money supply?). \nthe final made up for the midterm as it was pretty much strictly math-based. the questions were a little.. weird (the combination of concepts, that is) which made it somewhat difficult. a frustration was, for example, she spend ~2-3 weeks on intl trade/macro (for which she wrote her own notes for), yet there wasn't even a single question about it. \noverall, a good professor. she's really nice and does take into account what the students want, but i think the main frustration is the coverage of topics (I don't remember hearing AS or AD even once in the class, plus 1 day of labor markets in a model). also, she taught the IS-LM model but I don't think people in the class actually realized that's what they learned. \nas a side note, Carlos has got to be the most incredible TA at Columbia. i'm sure he put in more work into the class than maybe half the students combined. i hope someone in the economics dept has enough common sense to give him his PhD immediately and tenure him with the condition that he stays at Columbia forever\nWorkload:\na pset per week, takes anywhere from half an hour to four hours. midterm and a final that, if i didn't study for either, i would have received the same grade (which is not necessarily a good or bad thing). got an A for the course, but that's only b/c the psets made up for my exams which i did pretty poorly on\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 10, 2011",
            "review_content": "\nStephanie's class is very difficult and very unusual.  She spends around 1/2 of the lectures going over the intuition behind the economics theories, and the other 1/2 in the derivation.  She teaches topics like seignorage but then totally ignores unemployment until the last lecture and tells you it's not going to be examed. Her homeworks are rather straightforward, but her exams are VERY different.  The midterm was largely based on intuition. More writing than math.  People in class complained about the midterm, and the final was largely math.  However, she exams you on very unexpected topics.  Topics that she spent 2+ weeks on are surprisingly not covered at all...  It doesn't help that she does not post solutions to the homework and does not give any practice exams. \nCarlos, the TA, is ABSOLUTELY AMAZING.  I think it's worth taking a class just to have him as the TA. he attends every lecture and takes meticulous notes for the class. He's able to explain everything in a really clear and concise fashion.  He even took almost five hours out of his own time to write practice exams for the class of what he thought could be on the exam.  He's enthusiastic, knowledgeable, helpful, and better than any econ professor i've previously had, even gulati, and i loved gulati \nWorkload:\n9 problemsets, 1 difficult midterm.  1 impossible final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 12, 2011",
            "review_content": "\nDid I miss something? Sure, Xavier is a smart guy. Sure, Xavier is kind of funny sometimes. Sure, he's famous. But is he a good teacher? I didn't think so. And here's why.\nThe design of the macroeconomics course is insane. There's no textbook-- meaning it's, like, impossible to have certain things directly defined in a completely go-to source. Also, Xavier sometimes repeated entire lectures. Don't get me wrong; he is a decent lecturer. But there was little sense of direction. Problem sets were indiscriminately distributed; we were given one on a Sunday night during midterms due that Wednesday. Were we ever given our problem sets back? I'm still not sure. The midterm and final were very harshly graded and needlessly nit-picked (though generously curved). This course was designed such that concern for student learning was completely absent. Oh yeah, and you're sitting in a class of 300+, so you really won't get any attention from Xavier, unless it's to ask some douchey question to pet your own ego, as many in the course were wont to do.\nThe TA that everyone came to know and love, Carlos Montez-Galdon, was absolutely indispensable. Honestly, it's unbelievable how much he cared about us learning. He singlehandedly crafted a textbook from the lectures and provide his own lectures with notes. And he was highly approachable. And helpful. Without him, I wouldn't have learned macroeconomics. And he routinely sent us e-mails apologizing for Xavier's faux pas, empathizing with us when we were expected to jump through ridiculous hoops. Why can't he create a macroeconomics course and teach us? He certainly cared more about us learning than Xavier did. \nIn short, If you have a genuine intellectual interest in economics REALLY want to learn macroeconomics-- not just scrape by, but REALLY understand it and, above all, be taught in a course designed to teach you, I don't recommend this class. If you want to be a Wall Street suit and are content scraping by with Bs and As with relatively little actual understanding of how things work, this class is decent. It's certainly not unreasonably difficult. It just wasn't created with your learning as the top priority.\n\nWorkload:\n10 problem sets; midterm; final.\n"
        }
    ]
}