{
    "prof_info": [
        {
            "prof_name": "Elizabeth Auran",
            "prof_id": 2729,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 08, 2016",
            "review_content": "\nElizabeth Auran is an absolutely amazing woman with a heart of gold. I adore her more than anything in the entire world, and genuinely think that she is too good for this world. She is so engaging and amazing. Coming from an inner city public school with little to know knowledge on how to really write a good analytical paper on literature, this woman helped me learn more than I could ever imagine. The entire class was always engaged, always learning, and fell in love with Professor Auran more and more each class session. I feel so #blessed to have been able to take this class with her\nWorkload:\nReadings for every class session, two essays with rough drafts due a week and a half or so before the final draft, meetings with professors for revision, and a final research paper. Pretty typical of Women and Culture. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 08, 2016",
            "review_content": "\nElizabeth Auran is by far the best english teacher I have ever had. She is incredibly supportive and friendly, and I can honestly say that my writing improved in her class. The texts we read are extremely interesting. Auran is always saying that she \"learns from us\" - she encourages different perspectives, even ones that differ from her own. The class is very discussion based, so it not like she's just lecturing us. It's much more of a conversation between everyone. \nShe is also a very intense editor - we have conferences and rough draft before turning any paper in!\nWorkload:\nVery manageable - we have readings for every class but they are usually not very long (some are just like poems that are 2-3 pages long). You just have to show up to class and participate in the discussion (you can talk to her if you are not comfortable with talking in front of others and she will be super supportive and work something out with you). We wrote 2 essays and one research paper. \n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 08, 2016",
            "review_content": "\nElizabeth Auran is a goddess. She is thoughtful, kind, brilliant, and supportive. She will take your writing and help you mold it into something to be proud of and will make you think of literature in a new way. Taking Women & Culture with her is a truly Barnard experience and one I'm so happy to have had. If you can take a class with her, do it. \nAs far as class goes, she assigns difficult texts but ones that she will help you unpack. Class is discussion based and she holds back from over-sharing her own analysis. She grades based on participation partially, and so it is in your best interest to participate - but also you will want to talk. She stimulates fascinating discussion and pulls in background from other disciplines. She also studies Biblical texts, and brings that context into some of the texts. \nShe dedicates a huge amount of time to editing essays. She does the most intensive edits I've seen FYW professors do, and they were incredibly helpful to me. Auran will also meet with you for every draft, and first drafts aren't graded on quality. \nAuran is the kind of woman who you will wish you could have as your mother. She is loving and generous and a brilliant mind, and has been the highlight of my freshman year. I cannot recommend her enough. \nWorkload:\n- 2 essays about a text covered in class\n- 1 final research paper about a text from the semester, but text is your choice and so is the argument \n- Readings for every class (medium difficulty)\n- small assignments leading up to research paper, but not bad. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "August 19, 2014",
            "review_content": "\nProfessor Auran is an incredibly dedicated and challenging professor. She tries her best to focus most of the class time on open discussion between the students in regards to the readings while offering guidance when needed. This was greatly appreciated and helped make the small class an easy and safe space to discuss complicated subjects. In terms of work load, there is a decent amount of reading to be done for each class, but nothing overwhelming. Most of the texts are easy to get in to and will end up being more enjoyable than a burden. There were several papers over the course of the semester, including a final research paper. Auran conferences with students for each paper and offers an abundance valuable critiques in her notes and conferences (she isn't light on the pen when marking up papers.) As a person, Auran is a fabulous lady boss. She will love you back if you participate in class, actually take her corrections seriously, and eat all of her candy. FYE was one of the best Barnard courses in terms of being able to openly discuss subjects that tend to be glossed over in traditional English courses; take full advantage of the liberty Auran will give the class in discussions.\nWorkload:\nReadings for each class, two papers, one final research paper\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 18, 2011",
            "review_content": "\nHonestly, my entire class became OBSESSED with Professor Auran! As a first year, Barnard could seem like an intimidating place especially because it's a school known for producing strong writers. Professor Auran is a brilliant teacher with the ability to make Barnard feel like a welcoming and comforting place. She is passionate about the subject matter and can get anyone interested into the literature. You don't have to be a radical feminist to appreciate the course because of the incredible way she teaches the class. She explains everything very thoroughly while allowing students to explore and think about the works on their own. She encourages deep discussions, but does not put negative pressure on students. In terms of workload, it is really fair and she lets you turn in rough drafts which she doesn't grade. She edits them like crazy and also holds conferences with each and every ones of her students to prepare for the second/final draft. She could not have been a more supportive teacher and I feel so lucky to have had her. \n\nWorkload:\nextremely manageable. 2 short essays(5-6) and 1 research paper(6-8) pages. Readings are light with the exception of Shakespeare's As You Like It. The literature is so interesting, you want to read it!! \n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 12, 2008",
            "review_content": "\nElizabeth Auran is a nice enough woman, but if you're looking for an English class that will improve your writing, look elsewhere. Granted, it was a first-year english class, but I can confidently say that all of my high school english classes were better. I actually felt like my writing regressed. \nHer writing topics tend to be pretty interesting, however, and you do read some literature you might not otherwise have picked up, such as \"the Lais of Marie de France\". Unfortunately, most of the texts read for this class are translations, so it is very difficult to truly analyze them. Perhaps this is why this class felt pretty superficial.\nShe does spark some interesting discussions, but they tend towards generalizing feminist statements. (Note: this is a female reviewer).\nOverall, it's a pretty good class to coast through, but if you want a challenging course that will develop your writing and analyzing skills, find a different class.\n\nWorkload:\nrelatively light:\nreadings pretty much every class, an essay every week or so, one 8-page research paper at the end of the semester.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 13, 2008",
            "review_content": "\nProfessor Auran was one of the best English teachers I have ever had.  She is extremely passionate about the topics she teaches and extremely devoted to her students and to their growth.  \nShe will sit down with you as many times as you like before any paper is due and help you understand how you can make it better.  She will raise the level of your writing.\nProfessor Auran made texts that I never would have touched on my own seem modern, universal relevant, exciting and interesting.\nEven if you are not particularly interested in Woman's Studies, you can learn a tremendous amount from this class.  Also, she never comes even close to bashing women - she is a feminist in the best way possible.\nWorkload:\nNot bad.  A couple of papers but she gives you plenty of time for each and the first draft doesn't get graded - she just uses it to help you better your paper and thus better your grade.\nThe reading is very enjoyable.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 23, 2006",
            "review_content": "\nProfessor Auran seems nice and helpful at first, but she's a harsh grader and doesn't seem to give enough feedback so that you can successfully improve your papers to her liking.  She's relatively enthusiastic, but also a little condescending when the class gets slow (it was at 9:10- come on!).  The readings weren't great, and I didn't think the discussion was very stimulating.  I'd avoid her if you can; she wasn't horrible, but not a great first-year experience. \nWorkload:\nNot awful: 3-4 papers and one final research paper, one time spent as discussion leader, regular readings\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 19, 2005",
            "review_content": "\nThis was an absolutely terrible course. The content and material could have been very interesting, but the Proffesor was just boring. It was supposed to be an English type seminar, and instead it was her lecturing the entire time. Her lectures were boring and self evident, and to top it off she is a nasty person. She is an extremely harsh grader, but is sly. She gave certain grades during the semester and then a completely lower one as a final grade. I do not recommend this coursae to anyone if you take it with this proffesor.\nWorkload:\npapers\n"
        }
    ]
}