{
    "prof_info": [
        {
            "prof_name": "Richard Anderson",
            "prof_id": 3075,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 13, 2013",
            "review_content": "\nI got a B in Art Hum, but not because Ricky is unreasonable. He expects you to do your work which entails coming to class and participating thoughtfully, reading prior to class (though relatively short, the reading assignments were often dense), and writing three to four short papers (we had two 2-page papers and one 4/5-page paper). Now and then, we had media assignments (these are meant to help you visualize and remember) on the Art Hum website. While I wouldn't say this class is easy, the workload is doable. If I didn't have an overwhelming semester, I think I could have gotten an A. Ricky is a fair professor who expects you to do your part. He is not heartless.  Also, I loved his professional demeanor. \nWorkload:\nGRADING:\nattendance & participation (20%)\nmidterm & final (40%)\nwriting assignments (40%)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 21, 2013",
            "review_content": "\nThe perfect Core professor: incredibly smart, loves his subject, friendly but not chummy. He'll keep his distance from students to make sure everything is always focused on the work; once, he sent us home 20 minutes early because it was clear no one was listening and he didn't care to waste time. He's tough but loves the discussion, and will do his best to make sure everyone gets a turn. I adored this class because he was so effective at teaching it.\nWorkload:\nThree/four short papers, all straight-forward and easy to do well on.\nShort midterm and final, also not hard to handle as long as you review your notes and come ready to write hard for an hour.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 13, 2009",
            "review_content": "\nRicky is just plain smart. This class is easy and he makes it interesting (his blue eyes do most of the work. ) Sigh!\nWorkload:\nFour 2.5 page essays, museum visit, midterm with IDs and final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 09, 2006",
            "review_content": "\nRichard, who asks that you call him Ricky, is probably one of the best Art Hum instructors. He tries to ask questions that really get the discussion going, while acknowledging the class's skepticism about some of the works. He is not one of those instructors who gets visibly angry and offended when he you don't like the art. He's interested in knowing which materials we like or hate, and doesn't force the discussion when it is obvious that there is no interest. Participation counts and he does call on people, but it isn't annoying like some instructors. Papers are reasonably graded and exams should not be difficult if you paid attention to class discussions. As long as you attempt to analyze the works and give information that is actually relevant and thoughtful, you should do moderately well. Exams are art IDs of both studied and unstudied works, comparisons of works, and analysis.  All in all, the class is enjoyable even if you find Art History completely boring.\nWorkload:\nThere's a midterm, a final, and 4 2.5pg papers, 3 of which involve museum visits.\n"
        }
    ]
}