{
    "prof_info": [
        {
            "prof_name": "Julie Patterson",
            "prof_id": 11417,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "December 17, 2012",
            "review_content": "\nThis is my favorite professor at Barnard by far. It is so clear that she genuinely wants her students to do well and she works hard to help her students achieve their goals. She is ALWAYS available through email (even during the hurricane this year!) and answers very promptly. \nThough statistics can be boring to many, she makes it as interesting as possible and really tries to connect it to psychological concepts often. She publishes her powerpoint slides after class, the homework keys after their due dates, and helpful outlines for notes before class. It is super helpful to print out the notes so you can follow along better.\nHer tests are open note and very fair, so as long as you go to class, organize your notes, and understand them before the test, no memorization is necessary and you will do well. The homework is not hard and you have time to do it and ask questions about it during lab. Lab usually ends in less than a half hour and then you can choose to stay and finish the homework or leave and do it later. \nProfessor Patterson (students often call her Julie) is super approachable, fun to talk to, and really just wants to see students succeed. Take her class!\nWorkload:\n2 open note exams, 1 take home final, 10-11 homework assignments. Very light, I worked less than 2 hours per week for this class.\n"
        },
        {
            "course_name": "BC 1001 Statistics",
            "review_date": "October 02, 2012",
            "review_content": "\nJulie Patterson is by far the nicest, clearest professor I've had in college. She is so smart and knows the material well. She wants to hear student feedback and wants the students to do well. She is incredibly friendly and outgoing, and understands that psych majors are taking this class to understand psych articles so she tailors the class to that group.\nThe tests were all open notes, and the homeworks weren't too difficult. If you put the work in, you will get an A.\nJulie is awesome. Take her class! \nWorkload:\nNot bad at all. Problem set once a week, two \"essays,\" and three exams. \n"
        },
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "April 10, 2012",
            "review_content": "\nI came in COMPLETELY nervous about taking statistics because my advisor told me that I would have to \"hit the ground running\" if I wanted to do well with this class. Patterson completely caught me off guard, though.  This class was amazingly simple and perfect for psych majors. Even though, I was at first very frustrated with her slides - they usually have errors in them - she apologizes in a very friendly manner and usually follows it up with \"awe, darn-it... I really thought this slide would be good. Oh well, maybe next time we'll get it right.\"  It's adorable.  She kind of makes it hard to be mad at these slides since you know she is very busy outside of class.  \nShe knows the material, though, and she creates worksheets that you just have to print out every day before class and it is basically fill in the blanks to understand the terms and formulas.  There are also examples on the worksheet that she uses to put the notes into practice.  I didn't realize in the beginning, but these notes were actually VERY helpful.  If you want to do not only well, but REALLY well on exams you have to be organized.  \nI have never been to office hours, but you can do your homework after lab (which is usually around 15-20 minutes long) and she will help you completely.\nShe makes it very easy to get an A in this class.  She is too busy to really stump you, but she also seems to genuinely care about her students.  \nWorkload:\n4 exams the first week of every month.  They're very long but open book.  If you review the day before you will be fine and get an A with out any issue. \n2 written portfolios. One is just a get-to-know-you type essay, and the other is a bit longer and makes you go find an article and discuss the statistics that was used.  \nHomeworks due once a week or once every two weeks.  These are just worksheets and have SPSS problems that you work on during Lab and you can finish the hw after the 15 minutes of lab. She will help you the entire time and even lend you her calculator!\n"
        }
    ]
}