{
    "prof_info": [
        {
            "prof_name": "Mikael Hornqvist",
            "prof_id": 11002,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Liberty and Empire",
            "review_date": "February 17, 2012",
            "review_content": "\nDespite the last positive review, I would like to return to the tone of the previous reviews. I'm not going to say don't take this class because ultimately my experience will not be the same as that of every single individual who takes this course. However I think you should have strong reservations about taking this class if you are an intellectual risk-taker and, throughout your entire college career, have gained favor by writing papers, not to please your professor's selective taste, but rather to make insightful connections of which he/she might not have previously thought.\nMy problem with the professor is that he writes off any argument that does not conform to his narrow taste as invalid. I thought some of the reviews for this professor were a fluke so I decided to take the course, however, for once I think people's negative experiences were perfectly on point.\n1) The professor's grading system is, for lack of a better word, stupid. After going to his office hours to object to the final grade he gave me, I spent 20 minutes trying to explain to him what \"weighted grading\" is and why his system misuses numbers to compose an arbitrary grade. However, the only conclusion he came to was that he was not going to waste his time arguing with me about \"what adds up to 100\" and that nobody had ever complained about this before. I agreed that the discussion was a waste of both of our times (but ostensibly a bit more sad on his end), and told him to read his CULPA reviews for honest opinions on the matter.\n2) I believe this quote from one of the professor's lectures perfectly exemplifies what he is looking for from a student in this course, and why you should not take this course if you somewhat disagree with this philosophy: \"You should to a certain extent try to figure out what I had in mind when I made the topic...\" (11/16/11). In fact this is not just a suggestion but a requirement; the professor will automatically start your grading from the point of an A- if he \"likes\" your argument - that is to say if you make an argument he would have made. I never realized that I have been lucky to consistently have professors that can admit to the integrity of an argument, even if it does not entirely align with what they believe/would have written themselves. I Feel strongly that this philosophy as an exclusive barometer on which to base grading is completely contrary to the educational experience we seek here at Columbia. \nThe workload in this course is standard, most of the readings were engaging, the lectures are even interesting for the most part despite the professor's occasional tendency to butcher the English language. But if your philosophy about learning and writing papers is anything aligned with the reasons why I object to this course, then I think you should think twice about taking the gamble on having your grade determined by two EXTREMELY subjectively graded papers. \nPerhaps you might write this off as the impassioned rant of a hostile student, but I have never received less than an A- in a high-level political science course, and somehow as a senior I received my first B because of my \"inability to write a clear paper.\" This seems to have been the experience of previous students as well. Of course this cannot be everyone's experience in the course, and I believe that many relinquished their right to produce an intellectually stimulating paper for a good grade, or perhaps never aspired to write an intellectually stimulating paper in the first place, but just keep in mind that next semester this could be you...\nWorkload:\nStraightforward: Weekly readings, weekly discussion section and 4 two-page discussion papers (for 30% participation grade), two 5-7 page papers each worth 35%. The only thing to be aware of is the fact that in discussion sections there was something called the \"lottery\" in which at the beginning of each class someone's name was drawn from a bowl to present on that week's text. From observation, those few seconds before the drawing can become pretty tense if you haven't done the reading, so if you're someone who doesn't keep up with them just make sure to take 15 minutes to gather a synopsis of the reading and its main theme's/tensions before the discussion or you just might find yourself looking foolish in the hot seat.\n"
        },
        {
            "course_name": "Liberty and Empire",
            "review_date": "December 29, 2011",
            "review_content": "\nEither Prof Hornqvist radically changed his approach to grading or these 2 reviewers are outliers, because I really enjoyed his class and I did alright.\nThe content itself was really interesting and very diverse material. We read some of the ancients, some medieval writers and modern thinkers, so that's some of (in random order) Plato, Thucydides, Polybius, Aristotle, Shakespeare, Machiavelli, Arendt, Said, Camus, Fukuyama, Qutb, Tocqueville and Nietzsche.  There were also four films.  He's a smart guy and he clearly knows his stuff, and drew interesting connections between each of the writers. It's a lecture style of class but he opened it to discussion most days. \nIn terms of the work--he was very clear on what was expected of us in each of our papers. I'm pretty sure we spent at least half a class discussing paper topics each time he handed them out, and was available by appointment and during office hours. I dont think he was a tough grader at all. I actually scored less on the paper graded by Andreas (the TA) than the one graded by Professor Hornqvist (which was almost perfect). \nOverall, I highly recommend the class. You'll learn a lot and, if you work at it, prob do well.\n\nWorkload:\nsome reading, 2 papers (70 pc) and 4 discussion papers (30 pc)\n"
        },
        {
            "course_name": "Liberty and Empire",
            "review_date": "January 23, 2011",
            "review_content": "\nOk, my point is that 1) the fact that a professor says that he needs to figure out the university's grading policies in order to figure out how to grade our papers in the middle of the semester places high doubts on his objectiveness as a grader; 2) the fact that he gives 10 extra points for the second paper if \"he really likes our argument\" does not guarantee that we get them on objective terms; 3) at least a couple of people who did get A-range grades in the class only managed to do so because they gave up on writing something intellectually challenging and interesting in their opinion and simply adhered to whatever he told them he liked. My only fault that I got discouraged by the unproductive office hours with him in which he confused me even more about what exactly he was expecting from us and his claims that he does not look at rough drafts. I should have bombarded him with my rough drafts and allowed him to write my paper for me. But I didn't. How stupid I was.\nWorkload:\nNot bad, but that's not the point. Pr. Hornqvist should really review his grading policies or not be allowed to grade papers whatsoever.\n"
        },
        {
            "course_name": "Liberty and Empire",
            "review_date": "January 10, 2011",
            "review_content": "\nSo my review is intended to extract some of the bias that I find when I read the previous comment. First, I would like to talk about the grading. Yes it is true the grading is harsh because he expects you to really develop an intellectual paper that proposes something new, something he hasn't seen (he is an expert in the field). So yes it is challenging but it is whether you are willing to take on the challenge and show you can do it. AAANNND you CAN when you put effort into it. \nFor the second paper, he gave 10 extra points available and the 3 discussion papers are a sure full 30 points since he will tell you what is wrong with them and give you the opportunity to have full points in that. \nHe is a very interesting guy and his lectures are very good, although he does use a monotone voice (but i really don't care, the voice doesn't change anything for me, i don't need an entertainer to keep me up.) He is a very good teacher with a lot of knowledge and I really enjoyed the class and the perspectives I learnt from it.\n\nWorkload:\nLot of reading but it is really interesting and if some overlaps with CC. Most weeks it is fine except for a couple books that take forever. \n"
        },
        {
            "course_name": "Liberty and Empire",
            "review_date": "January 05, 2011",
            "review_content": "\nOh, how much I regret taking this course... Professor Hornqvist is a wonderful person, very intelligent and even funny at times, but, as the last review said, he had a great difficulty communicating what he actually wanted from us in the course. The readings were excellent, I have no complaints, the discussions were thought provoking for the most part, even the 4 small discussion papers were fun to write because they had a really free format and were graded very generously. However, the 2 7-page papers, which were worth 70% of the grade, were a disaster. For the first one he gave no instructions, except for giving us 5 very-very-very broad topics, and saying that 70% of the text has to be based on at least 4 texts studied in the first part of the class. No idea whatsoever what we were going to be graded on. After practically everyone got terrible grades for the first paper, he explained to us that he was looking for a clear argument and some kind of unresolved problem in the second essay. That didn't help either. What I think was the major problem with those papers was that we were given very broad topics and instructions on the one hand and little freedom to write about something interesting and meaningful, given that around 90% of the paper had to be about the texts themselves, on the other. It would have been better and more interesting and helpful for us as students to be able to choose our own topics, in consultation with him, and to be allowed to make more connections with the contemporary world. For example, I think that we would be able to produce a lot more meaningful and thought-provoking arguments by looking at similarities in totalitarianism and democracy rather than ancient tyranny and totalitarianism. I think the problem is that Professor Hornqvist has his own particular way of writing that he might be used to, maybe in Europe, but it does not mean that his way is the only way to show what we have learned from the readings and how those readings can be looked at in a an unusual and critical way. I am usually an A/A+ writer (in political science and in general) but for the first time I found myself crying like a baby over those papers, unable to figure out what exactly am I supposed to write about. Overall, it has been a very unpleasant experience for me.\nWorkload:\nNot too bad for poli sci, although some weeks were loaded significantly more than others. The four 2-page papers are a piece of cake, but they are worth practically nothing, compared to the two 7-page papers for which it is highly unrealistic to get even an A-.\n"
        },
        {
            "course_name": "Liberty and Empire",
            "review_date": "November 10, 2010",
            "review_content": "\nDO NOT TAKE THIS CLASS unless you can mind-read whatever the hell this professor has on his mind when he tells you to write a paper. He easily hands out C's for papers. I have no idea what he wants with the paper, and he won't allow any re-writes or improvements. I have NEVER gotten a C on a paper, and I can say that if ALL my professors from other classes deem my papers worth mostly As and occasionally Bs then I have no idea why I would get a C minus on a paper in this class, when I put in similar effort and use my usual way of writing. It's not like I don't take similar classes. Being a History and Political Science double major I have written a crap load of papers, and all my other professors seem to deem my work perfectly fine. I have no idea whatever the crap Hornqvist expects, and that's what's scary about a class. Not knowing what a professor wants, even if you put in the effort. Does he have weird expectations from papers or just plain hate giving at least reasonable grades?\nThat said, Hornqvist is quite a nice person, even though he does lecture in a monotone for at least an hour. It is extremely boring, unless you like political theory a lot. You know, Plato, Polybius, Arendt, and those people. Even though the course should focus on liberty and empire, for most of the first half it gets bogged down in domestic stuff and democracy and all that crap. Empire is quite absent. \nThis is a paper based class. There are no exams, just 6 papers shoved down your throat. And if he's going to keep grading my papers like this, I'd be lucky to even keep that C. That's the problem with a paper-based class. There are no definitive right answers like in an exam. Your paper is being read from an extremly subjective view and hey, everyone has a different taste for writing, and Hornqvist just happens to hate mine. So don't take the class unless you're willing to take that risk. This class will make you miss the good old conventional exam. \nWorkload:\nLots of reading, reasonable for this level course but could get crazy some weeks (ex: entire book of Culture and Imperialism in 2 days...). Lots of writing, reasonable load since there are no midterms or finals. 4 discussion papers 1-2 pg long. 2 essays 5-7 pg long. Beware of these papers...\n"
        }
    ]
}