{
    "prof_info": [
        {
            "prof_name": "Emily Austin",
            "prof_id": 3350,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 25, 2009",
            "review_content": "\nOne of the best teachers I had my freshman year. She really opened my mind up to exploring writing in a new way. Without her instruction, I don't think I would be as curious with concepts and ideas and how to employ that in writing as I am now. My paper grades improved greatly. Overall, a wonderful class with a wonderful instructor. \nWorkload:\nnormal university writing class.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 18, 2009",
            "review_content": "\nEmily is a tough grader, but she really cares about her students. She is very passionate about writing and hopes this rubs off on her students. I had a really great time in this class.\nWorkload:\nNormal U. Writing Amount\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2009",
            "review_content": "\nAlthough this is Emily's last semester teaching, I thought it be fair to give her justice. First off, Emily is not an easy teacher and grader. What she is however, is a dedicated instructor who cares thoroughly about her students, At first I had no idea what was going on in the class, but I worked with her and raised my grade from a C to an A-. All in all, a great teacher and person. \nWorkload:\nJust like any U Writing Class\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 30, 2007",
            "review_content": "\nAwesome, really. I think this semester was her first time teaching a UW class, and she couldn't have done a better job. Emily is one of the nicest, most enthusiastic UW professors you could possibly meet on campus. At times, you feel slightly overwhelmed by her earnestness, but it becomes something you grow to appreciate once you're in the midst of papers/midterms/etc. She is lenient on deadlines and understanding of whatever situations may arise, which may cause people to slack off on turning in drafts (or quality ones, for that matter) -- but it's honestly to your advantage to give her your best work, regardless if it's a draft or not, because she takes the time to read through (and INCREDIBLY thoroughly) anything you give her. Literally, she spends a good half hour or more reading, commenting, and critiquing all of it... AND she'll even include a letter at the end that fully explains her questions and concerns, and suggestions for improvement.\nI'm pretty sure a majority of the students enjoyed the class, and the entire class appreciated the fact that she wasn't an uppity, condescending professor whose 75 minute session is one of those classes you dread. She goes on tangents sometimes, and tends to get off-track, but it doesn't really prove detrimental to the class, overall.  The readings are a bit tedious sometimes, but interesting; she knows them inside and out.\nAll in all, she's a great prof. You'll be lucky to have her teach UW.\nWorkload:\nThe standard essays and weekly readings. She likes the portfolio method, which means a little more work (in terms of compiling), but it's nothing excessive.\n"
        }
    ]
}