{
    "prof_info": [
        {
            "prof_name": "Susan Boynton",
            "prof_id": 514,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "History of Music I: Middle Ages to Baroque",
            "review_date": "December 11, 2013",
            "review_content": "\nThough I wouldn't say I thoroughly enjoyed every class we had this semester, I 100% learned from Professor Boynton. She can be a bit scattered in her lecturing, but I always come away from class or from an assignment with new knowledge that is directly relevant for what we are learning. I find this extremely helpful and it is much appreciated.\nThough she can be a bit odd sometimes, she is very, very endearing and very sweet. She always lets us know when there is a concert, museum exhibit, or performance of some sort that we may be interested in -she even led us on a class trip to the Cloisters. She also invited our whole class over to her house for a home-cooked dinner -a good one. She is one of the few professors I have had here who really, truly cares about her students.\nWorkload:\nWeekly reading, listening, and written assignments -sounds like more than it is. Most people can get away with only skimming the readings, but definitely listen to the pieces and read the analyses in the anthology -they will really help with assignments.\n2-3 piece ID quizzes to prepare us for the midterm and the final.\n1 midterm and 1 final; piece IDs, short answer questions, and an essay. The final will have a score analysis. \nProfessor Boynton is a very fair grader, often airing on the easy side. For her, it seems like the more you write, the better your grade will be.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2010",
            "review_content": "\nProfessor Boynton made Music Hum a really valuable course. She is approachable and willing to answer any questions - no matter how elementary. I really appreciated her historical contextualization of all the works. We focused on five pieces in depth rather than doing a more general survey like other sections. By the end of the year I felt like I had actually learned something and had a new way of thinking about and talking about the things we studied. She does a good job of navigating the difficult territory inherent in this course - engaging rather than alienating both those with no musical background and those with extensive musical background. All in all, a great Music Hum experience. \n\nWorkload:\nStandard - very fair grader...gives essay questions before the exams - it's great b/c you're not caught off guard, but also because it forces you to synthesize the ideas that have been floating around all semester - so you actually learn something from your exam prep. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 03, 2006",
            "review_content": "\nIf you have the chance definitely take Music Hum with Professor Boynton.  She is extremely knowledgeable and also, unlike may instructors, able to impart her knowledge of and interest in the subject to her students. Class time was engaging and always went quickly. Moreover, she had reasonable expectations of her students and was a completely fair grader. Though we learned more than in other music hum classes and she actually situated the music in its social and historical context (which other teachers are supposed to do but don't) she didn't expect an unreasonable amount of knowledge on tests.  In fact, the extra we learned just helped us understand the basic concepts we were supposed to learn. She may seem standoffish at first but she's really an incredibly caring woman.  You don't really have to do the daily homework because she gives you a review sheet before the midterm that tells you exactly what you have to learn.\nWorkload:\nMidterm, Final, listening report, concert report, opera report, attendance\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 08, 2006",
            "review_content": "\nSusan Boynton seems to be well intentioned, but she fails to make Music Hum the great course it could be.  As another reviewer mentioned, her explainations of simple concrete concepts and ideas are vague, and she uses terms without ever defining them, managing to alienate the non-musically inclined folks, and to bore the ones who knew what a \"chord\" was.  Everyone in class stopped doing the reading a couple weeks into the class, and since she didn't enforce it at all, no one had any idea what was going on.  She would ask the class about the reading - no one would answer - and then she'd threaten us with something like \"I'll just sit here until someone answers\".  She seemed to be in denial that no one read.  This \"no reading\" attitude continued after the midterm, as she gives out a specific sheet of things to know about each song, and GIVES you the 2 essay questions beforehand.  Basically, you'll ace the tests if you spend 5-10 hours reading / listening / preparing before the midterm and final (exactly the same, just different songs).\nAlso, she left for Europe before the last class (which was taught by the great TA, Amber) and never came back.  Kinda seems like she couldn't care less.  She was very stringent with deadlines for papers also, don't be late.\nThe papers are also not as great as rumored in other Music Hum sections.  One 5-6 page Opera Report on Don Giovanni (which we were not prepared for, and it was unclear what she was asking on the paper).  One Classical concert report (5-6), and one listening paper   (3).  So, none of this \"go see a cool Jazz show and write on it\".\nOn the positive side, she had many guest musicians come in and play, which was great, free concert during classtime.  All in all, find someone better.  If you really don't care, and don't think that you'll mind her knawing away at your time all semester, then it's an easy A, as she gives you EXACTLY what you need to know for the midterm and final.\nWorkload:\nMidterm and Final, both fairly easy.  3 Papers.\n"
        },
        {
            "course_name": "History of Music I: Middle Ages to Baroque",
            "review_date": "November 10, 2004",
            "review_content": "\nProfessor Boynton is a very nice person who would who help you a lot if you're having trouble or just have general questions. She has an air of a good teacher, however I find her very hard to follow and confusing. I think she uses the hardest ways to explain the simplest things, and I think which is why class gets bored sometimes. In general i think it's not a bad class to take as a requirement.\nWorkload:\nmedium amount of workload. 2 quizzes, 1 midterm and a final. have to listen and identify music on tests.\n"
        },
        {
            "course_name": "Music of the Middle Ages and Renaissance",
            "review_date": "June 22, 2003",
            "review_content": "\nI agree with the other reviews that Boynton is a nice woman, however, I do not agree that it is not her fault that this class is boring.  Sure, the subject is not exactly immediately grabbing, but with the right approach it is possible to make almost anything interesting, or at least good enough to keep the class from doing crossword puzzels, reading and passing notes.  It's a tragedy that with all of her enthusiasm and knowledge, not even a trace of it comes across to the students.  The bigger tragedy is that so many of us had to waste a semester with this class just to be able to major in music.  The good news is no one will ever have to sit through it again thanks to the change in requirements!! Thank your lucky stars new music majors, and think seriously before taking any other classes with Prof. Boynton even though she is a nice woman interested in her students, although not in her teaching.\nWorkload:\nLots of really boring reading but--you don't have to do any of it! Boring work, extremely easy, mind-numbing-to-study-for exams.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 13, 2003",
            "review_content": "\nExcellent teacher. She makes the course a lot of fun, and is very open minded to suggestions of the students. The workload is more than manageble, she is very flexible and accomodating to students needs, and I feel she made the overall experience of learning music fun and enjoyable. She is definitely high on my list of recomended teachers for this course.\nWorkload:\nvery moderate. 2 Papers, one operah, and a small project. Final and Midterm very manageable. oh and one short answer due like once a week, just 10 multiple choice questions.\n"
        },
        {
            "course_name": "Music of the Middle Ages & Renaissance",
            "review_date": "December 23, 2002",
            "review_content": "\nWOW. Ok, here's the deal. She's a very nice woman, who knows a shit-load about her subject, but she is not a lucky woman. This is because there is not one student in the university who finds her topic interesting, or who would take this class by choice. (ok, maybe one--) It could be a perfect twilight zone episode. And I dont think she is at all condescending, I think its just that she is so wrapped up in her subject. The real problem is that this course is required for majors, which is a travesty. Do you enjoy transposing chant from medieval clefs to modern clefs? If so, this course is for you! But seriously now, she is such a nice person, and she knows EVERYTHING about this music. But again, we're in the twilight zone! doo-doo-doo-doo/ doo-doo-doo-doo/ doo-doo-doo-doo/ doooooooooo....(is that in dorian?)\nWorkload:\n2 short assignments, 1 paper, midterm, final, (all busy work, all very manageable)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 16, 2002",
            "review_content": "\nThe most awful experience I have had in school since kindergarten.  Professor Boynton, although very knowledgeable and serious about her work, is unbelievably condescending, to a degree you only see on television.  She wastes a lot of class time on petty little details, like checking to see that we did workbook exercises which ask us to fill in the exact minute and second at which the trumpets enter in a certain piece, etc.  She is also incredibly boring, and will not only wither up any enthusiasm you have for music, but also any enthusiasm you have for life.  In my opinion, she is too rigid and arrogant.  She cannot tolerate the TA teaching because the TA was a wonderful woman who got really good responses from the students.  Professor Boynton is also not very good at explaining things.  Students were usually confused by what she said, but when the TA explained it, they understood immediately.\nWorkload:\nNot too much work, but because the work is pointless and the papers have to be mindless regurgitation of her lectures in order to get a good grade, the workload feels like a lot more than it is.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 15, 2002",
            "review_content": "\nAs another reviewer stated, Prof. Boynton is a very boring and, in my opinion, condescending teacher. To both the class and the TA, she would talk as if we were all 6 year olds in her music appreciation class. She values pure memorization and pointless facts over actual listening and analysis of music. Quizzes were given every single class because she didn't trust us to read the material at home. She would play pieces on the piano for long periods, some reaching 30 minutes, and with her back to the class there was nothing to stop sleeping. The TA taught incredibly well and involved the class, something Prof. Boynton didn't, couldn't, and wouldn't do. But the TA was cut off most times and wasn't given the opportunity to really teach the class like we all wished she would. I was very disappointed with this class and hope Prof. Boynton changes her attitude and style toward the material and her students in this class.\nWorkload:\n5-7 pages on an assigned topic (no room for change or choice), 5-7 pages opera report (graded incredibly unfairly), and we had to watch her sing at st. paul's on a sunday night and write about it, midterm and final were solely memorization of pieces and facts about them (although graded pretty generously)\n"
        },
        {
            "course_name": "Middle Ages and Renaisance",
            "review_date": "December 15, 2002",
            "review_content": "\nRecent reviews of Boynton are too harsh. To her credit, she's a really nice, approachable professor, though she has been known to make the occasional sarcastic joke at a student's offense. I like her very much as a person. Yes, the class is stultifyingly dull, but that's not her fault. That's the music department's screwed-up notion that the survey classes should be about memorizing laundry lists of pieces instead of studying the historical context and development of music. Bottom line? You'll get through it. It's painless and easy and you'll learn the stuff. Just bring something to do in class.\nWorkload:\nEasy A. 2 incredibly straightforward exams, 3 analysis assignments that are long and tedious but not difficult. Boynton is one of the easiest graders I've encountered.\n"
        },
        {
            "course_name": "Music of the Middle Ages & Renaissance",
            "review_date": "December 15, 2002",
            "review_content": "\nThis class was very boring, but I don't attribute it to Boynton alone. Her tone of voice is a bit monotonous sometimes, but I think I would have enjoyed her as a lecturer more if the material had been more interesting. She sometimes makes condescending comments, but I don't think she means any harm - she just doesn't realize that she's being offensive. If you talk to her in office hours, she is a very warm, kind woman. She genuinely cares about the material, but the problem is that the class didn't. I'm pretty sure the class was composed entirely of music majors, minors/concentrates, potential majors, etc. I can't imagine anyone would sign up simply because they were interesting in the material. Yawn. If Boynton were to teach Baroque or something, I'm sure it would be a better class.\nWorkload:\nBoring. Easy. Reading assignments that you don't have to do. Thee analyses/papers. Midterm and non-cumulative final. Lenient grader.\n"
        },
        {
            "course_name": "Middle Ages and Renaisance",
            "review_date": "December 14, 2002",
            "review_content": "\nThis class is reason enough to concentrate instead of major in music-- or just not major in music at all. I still haven't decided if it's totally Prof. Boynton's fault that the class was so boring (plainchant isn't the most exciting aspect of music). Her lectures were very painful; most people got through class by bringing crossword puzzles. And I'm not sure that I learned anything. Majors have to take this class, so you don't really have a choice, but try to steer clear of Boynton sections of everything overall.\nWorkload:\nMidterm, final (neither impossible), two short written assignments, one shortish paper. Not a horrible load; there had to be one upside to taking this class.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 24, 2002",
            "review_content": "\nHer arrogance is her biggest problem. She is very pretentious, and that was most evident in her condescending treatment of our TA. I think that Prof. Boynton's attitude-- echoed in her NPR-style voice-- was rather off-putting. It seemed like we muddled through class discussion twice a week and never really learned to appreciate the material. Seldom have I heard someone praise a Music Hum teacher, so I guess in the grand scheme of things, Prof. Boynton was not bad. The other reviews are generally positive, and no one the class really disliked her. However, it would be a mistake to put her on the Gold List. \nWorkload:\n1 listening assignment, 2 long papers, mid-term, final. We had to go to the opera and we had to go hear her sing at St. Paul's. The readings and listening assignments are more than manageable. If she's upset with the way class is going, she may start giving out quizzes or she may ask you to turn in multiple choice questions at the end of the readings. She's not a tough grader. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 03, 2002",
            "review_content": "\nA very nice person, Prof. Boynton makes a tedious class bearable. She's quite formal, but the class is taught with little lecturing and much listening and discussion. She understands that most people don't have a strong music background and doesn't take for granted that you know, say, major vs. minor before the first day of class.\nWorkload:\n2 papers, about 8-10 pages. Go to 2 concerts. 2 straightforward exams, both covering a lot of material and requiring a ton of memorization. But everything is graded easily, and most people end up with A-range grades.\n"
        },
        {
            "course_name": "V3124 Music of the Baroque",
            "review_date": "August 06, 2001",
            "review_content": "\nBoring class. Lenient grader. That's it. She just wants people to learn the stuff.\nWorkload:\nTwo papers, midterm, final. Throw the paper together and you'll do fine. Study for the tests and you'll do fine.\n"
        },
        {
            "course_name": "V2025 The Opera",
            "review_date": "December 31, 1999",
            "review_content": "\nI took this class for fun because I love opera, and I was not disappointed. Prof. Boynton's dry and serious manner of speaking does not accurately reflect her personality or attitude towards the material. At first I thought she was boring and stolid, but as the course went on she relaxed and even showed a sense of humor (albeit not a good one). It was her first semester at the school so she may have been somewhat nervous. The class focused on four operas, only quickly filling in the gaps with basic information. The four operas were Monteverdi's Orfeo, Mozart's Marriage of Figaro, Verdi's Otello, and Carmen. I love these operas (except for Carmen), so I was happy with the course. Overall, Prof. Boynton was an adequate lecturer and a very approachable person who let the material speak for itself, and conducted a pretty good class discussion. So if you like opera or think you might like it, then you shouldn't be disappointed.\nWorkload:\nA performance report, a very simple midterm and final, and an 8-page paper comparing Verdi's Otello to Shakespeare's play. Seemed like a lenient grader.\n"
        },
        {
            "course_name": "V2025 The Opera",
            "review_date": "December 31, 1999",
            "review_content": "\nI took this class for fun because I love opera, and I was not disappointed. Prof. Boynton's dry and serious manner of speaking does not accurately reflect her personality or attitude towards the material. At first I thought she was boring and stolid, but as the course went on she relaxed and even showed a sense of humor (albeit not a good one). It was her first semester at the school so she may have been somewhat nervous. The class focused on four operas, only quickly filling in the gaps with basic information. The four operas were Monteverdi's Orfeo, Mozart's Marriage of Figaro, Verdi's Otello, and Carmen. I love these operas (except for Carmen), so I was happy with the course. Overall, Prof. Boynton was an adequate lecturer and a very approachable person who let the material speak for itself, and conducted a pretty good class discussion. So if you like opera or think you might like it, then you shouldn't be disappointed.\nWorkload:\nA performance report, a very simple midterm and final, and an 8-page paper comparing Verdi's Otello to Shakespeare's play. Seemed like a lenient grader.\n"
        }
    ]
}