{
    "prof_info": [
        {
            "prof_name": "Erik Flatmo",
            "prof_id": 2004,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Scene Design",
            "review_date": "March 11, 2004",
            "review_content": "\nThis course is an excellent trial-by-fire for anyone considering entering the design field professionally.  Erik brings to the classroom his own knowledge and experience  from work in the professional world, and he shares this experience with his students both directly and indirectly -- he will not only tell you about what it's like to work in the field, but he will treat big student presentations as if they were an actual pitch session.  And this is great!  You really get a sense of what sort of demands are made in the outside theatre world.\nFurthermore, Erik pushes his students to think critically about the design process while exploring various design options.  He does not AT ALL put a dampener on creative and fantastical design ideas, though he will remind you to keep in mind some practical considerations (budget, discussing the vision with the rest of the design team, spitching the idea to a director).\nScene design is a great course for anyone interested in theatre design (any aspect), architecture, visual art, or theatre in general  -- it is also good for performers to be able to try their hands at design and gain an appreciation for that aspect of the creative process.\nWorkload:\nInitial, Midterm, final projects involve creating designs for plays.  Will need  to go see outside theatre & performances: opera, dance, theatre.  Write short responses papers.  The class I took met once a week for 3 hours on Fridays.\n"
        },
        {
            "course_name": "Scene Design",
            "review_date": "March 08, 2004",
            "review_content": "\nErik is friendly, smart, and not much older than you.  He is a good teacher and usually pretty serious, but pay attention because he definitely has moments of hilarity.  The class is very interesting and Erik is all over the New York theater scene; he can give you some great tips.  It's probably a moot point, but if you don't have any theater experience, you might be a little lost in this class because he makes you jump right in and design a show for the very first homework assignment.  In general, a great class for any theater major.\nWorkload:\nNot too bad at all; it helps that the class is only once a week, even though it's on fridays.\n"
        },
        {
            "course_name": "Scene Design",
            "review_date": "March 08, 2004",
            "review_content": "\nErik is friendly, smart, and not much older than you.  He is a good teacher and usually pretty serious, but pay attention because he definitely has moments of hilarity.  The class is very interesting and Erik is all over the New York theater scene; he can give you some great tips.  It's probably a moot point, but if you don't have any theater experience, you might be a little lost in this class because he makes you jump right in and design a show for the very first homework assignment.  In general, a great class for any theater major.\nWorkload:\nNot too bad at all; it helps that the class is only once a week, even though it's on fridays.\n"
        }
    ]
}