{
    "prof_info": [
        {
            "prof_name": "Edgardo Salinas",
            "prof_id": 3103,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 26, 2017",
            "review_content": "\nSuch a nice guy. Encouraged discussion and motivated the material pretty well (I still fell asleep a lot for some reason though and he called me out on it once). Definitely would recommend him if you're willing to try to meet his (somewhat high) expectations\nWorkload:\nReadings, easy to BS during discussion, but need to know for the midterm and final.\nShort papers (2): one on a song you like, on on an article you read. They're graded generously.\nMidterm: 10 out of 20 or so IDs are played and you need to recognize artist, piece, part/mvmt, harmonic texture, lyrical meaning/context, etc. You also get multiple choice questions about basically anything that was covered, and a couple essay questions on the readings.\nFinal: same as midterm but cumulative\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 03, 2011",
            "review_content": "\nProfessor Salinas is an awesome professor. He had something interesting to say every single class and was very helpful/accessible outside of class.  Also he had a great sense of humor which is always a bonus. I saw some reviews where people said prof. Salinas is hard to understand because of his accent and that's total bullshit. He speaks perfect English, nice and clear. Do the assigned readings and contribute to class discussions and you'll do fine. Also super important to keep up with the assigned readings because the listening part on midterm and final are pretty extensive. Overall great class totally enjoyable!\nWorkload:\n2 4page essays, midterm and final. Attendence and participation large portion of grade.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 09, 2011",
            "review_content": "\nMeh...OK so Prof. Salinas knows what he's talking about and I DID learn a lot but...I really wasn't expecting to actually have to learn things in Music Hum. I just wanted to listen to some awesome music!\nIf you're looking for a breezy Music Hum, this isn't the one for you. If you're looking to actually be academically challenged and know your shit, then it's perfect for you!\nDespite a thick Argentinian accent, Prof. Salinas is a very nice guy and really knowledgeable about the subject of Western art music.\nThat being said, I was kinda pissed that we had to read Plato, Hegel, and other philosophers and music critics in class. \nWorkload:\nMore than the average Music Hum; Weekly supplemental readings; Weekly book readings; Music listening.\n2 4-page papers; 1 easy midterm; 1 moderate final (both offer extra credit)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 04, 2011",
            "review_content": "\nProfessor Salinas is an amazing teacher.  I never dreaded coming to class because there was always something new and interesting to learn about.  He encouraged participation which made discussions much more fascinating.  He is very knowledgable in all disciplines.  However, the class is quite difficult compared to what my peers have told me of their music hum classes.  Be prepared for listening tests, a midterm with 10 listening IDs, 20 MC and 2 essays, 2 four to five page essays and a final.  Also, you need to read the readings he gives you before class to be able to participate in discussion and get the full participation grade.\nWorkload:\na midterm with 10 listening IDs, 20 MC and 2 essays, 2 four to five page essays and a final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 04, 2011",
            "review_content": "\nProfessor Salinas is an amazing teacher.  I never dreaded coming to class because there was always something new and interesting to learn about.  He encouraged participation which made discussions much more fascinating.  He is very knowledgable in all disciplines.  However, the class is quite difficult compared to what my peers have told me of their music hum classes.  Be prepared for listening tests, a midterm with 10 listening IDs, 20 MC and 2 essays, 2 four to five page essays and a final.  Also, you need to read the readings he gives you before class to be able to participate in discussion and get the full participation grade.\nWorkload:\na midterm with 10 listening IDs, 20 MC and 2 essays, 2 four to five page essays and a final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 04, 2011",
            "review_content": "\nProfessor Salinas is an amazing teacher.  I never dreaded coming to class because there was always something new and interesting to learn about.  He encouraged participation which made discussions much more fascinating.  He is very knowledgable in all disciplines.  However, the class is quite difficult compared to what my peers have told me of their music hum classes.  Be prepared for listening tests, a midterm with 10 listening IDs, 20 MC and 2 essays, 2 four to five page essays and a final.  Also, you need to read the readings he gives you before class to be able to participate in discussion and get the full participation grade.\nWorkload:\na midterm with 10 listening IDs, 20 MC and 2 essays, 2 four to five page essays and a final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 05, 2007",
            "review_content": "\nProfessor Salinas is very knowledgeable in his field of study, and he has energy and excitement for teaching.  It is quite possible that professional music students might not find his class interesting, because as a core class it is supposed to provide an introduction to music and emphasize its importance in history, society, and the formation and evolution of culture, NOT talk about the tiny technical details that maybe some were looking for.  There are other classes for that!  I am a science major and didn't feel an initial interest in western music and its development.  However, the variety of readings he provided from authors like Edward Said, Plato, and Nicholas Cook really tied in other elements of the core and  made for interesting discussion.  At times he lectured, at other times he asked students to come prepared to lead a discussion.  Perhaps people are so used to taking exams at Columbia that test material one was never taught in class, that they found his exams \"easy.\"  They were straightforward and completely manageable if you read and attended class.  Can you complain?  And I must say, one reviewer said there were \"communication issues\" and that he was \"hard to understand.\"  Professor Salinas was a bretah of fresh air as an instructor that came from Argentina.  His English is very good, he made himself perfectly clear, and that comment seems compeletely condescending and uncalled for.  Not ALL profs can be WASPs....hope there wasn't too much strain on your ears!!  Professor Salinas defenitely helped me attune mine to the importance and beauty of music, if you just give it a chance.\nWorkload:\n2-3 readings per class.  Hermeneutical Interpretation, Critical Analysis paper, and midterm & final both consisting of multiple choice, ID's, short answer, and essays.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 25, 2007",
            "review_content": "\nI absolutely disagree with the first review of Edgardo.  Edgardo was one of the most stimulating instructors that I have had at Columbia thus far.  He engaged the class in interesting discussions, and I found that he rarely ever lectured! I had absolutely no prior knowledge in music, either, but I left with a great understanding of both music and how it related to other sociological and historical phenomenon.  He related trends to music to trends in literature and art, too, which made the entire core curriculum come full circle for me.  I went to class every day excited to be there.  Yes, there were required readings for every class, but they were very short, and very interesting.  Edgardo is also extremely approachable and ready to help anyone who needed any extra help.  I do agree that Edgardo was an easy grader, which was another plus to taking his class.  But honestly, in addition to the GPA boost , I got more out of music hum than I ever expected--TAKE THIS CLASS!!\nWorkload:\nA couple of response papers, midterm, final (all very easy--\nhe prepares you well)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 25, 2007",
            "review_content": "\nI find the first review of Edgardo completely unfounded.  His passion and expertise in music DOES convery very well to any student willing to participate, ask questions, etc.  He is friendly, flexible, and approachable.  The midterm and final are no suprises and straight forward.  The material he presents is engaging enough, and he is willing to discuss any topic that is presented to him.  Edgardo also doesn't harp on the technical aspects of the music, so if you've never taken a music class before, or in my case, saw yourself as musically challegened in general, then this is DEFINITELY the class for you.  He teaches you enough technical elements so you sound well-versed at dinner parties, and puts what we're learning into real-world settings so we can see how it relates to things in lithum and arthum.  The workload is a breeze.  Take the class.\nWorkload:\na reading response or two, standard midterm and final which he provides review sessions (hint: go to them) for.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 22, 2007",
            "review_content": "\ni have to agree ...terrible.\nThe class was boring, communication skills -- hard to understand\nWe listened to what he liked....lots of avant garde music....ugh\nI went into the class so excited and left completely turned off.\nWorkload:\nnada\n"
        }
    ]
}