{
    "prof_info": [
        {
            "prof_name": "Maguette Camara",
            "prof_id": 1933,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "African Dance I",
            "review_date": "August 02, 2016",
            "review_content": "\nI've had the opportunity to take African dance I as well as some of his classes around the city, and I can say confidently that Maguette has an impeccable ability to explain dance moves, liven up any room with his contagious energy, and on top of that a top-notch drumming ability! This man is truly skilled at his craft. Nothing will break up the monotony of Columbia like some live drumming and dancing. For experienced dancers, or newbies alike, you will be challenged! Don't miss the opportunity to take his class that some people will dish out bucket loads of money for. \nWorkload:\nSuper minimal, but you will get out what you put in. Don't show up to class bored and lazy everyday cause you won't get anything out of it. \n"
        },
        {
            "course_name": "African Dance I",
            "review_date": "April 10, 2012",
            "review_content": "\nI HIGHLY RECOMMEND THIS COURSE! I am not a dancer but this class was one of the highlights of my week.  The drumming, Maguette's hilarious attitude, and his adorable kids make the class totally worth it.  You learn a lot of fun dances and get the chance to schedule some exercise into your day.  Take this class and get your friends to take it too - it is more fun because you can hang out with your friends during class and practice the dances with your friends at the bars on weekends.\nWorkload:\nShow up in a sarong\n"
        },
        {
            "course_name": "African Dance I",
            "review_date": "December 07, 2008",
            "review_content": "\nWonderful class, as has already been discussed.  One caution - it will be a full room of people, and you will at times have to dance solo for a few steps in front of the class!  But is all in good fun, and you are feeling so good from the entire experience that even the most shy people get out there enjoy.  Worth waking up for a 9:30 class and made the rest of my day that much more pleasant.\n\n"
        },
        {
            "course_name": "African Dance 2",
            "review_date": "August 23, 2005",
            "review_content": "\nAmazing. This class was always the highlight of my week.  Since it is African 2, the dancing is more difficult. But, if you have dance experience then you'll be able to pick up the steps rather quickly. Maguette pushes you to try the tricky movements and does not give you much time to rest. The live drumming is unreal, and the chance to cut loose in the big, glass fishbowl room in dodge gym (we all know which room that is) is priceless. \nyou have to be a fool to pass up a class like this one.\nWorkload:\ngrab a sarong and start dancing\n"
        },
        {
            "course_name": "African Dance I",
            "review_date": "May 04, 2005",
            "review_content": "\nVery funny man. Great teacher, will make learning the dances fun. The warm ups are sometimes tough, but its worth it. You are allowed to miss two classes. If you miss more you can make it up with a dance class or a paper. \nWorkload:\ndancing! \n"
        },
        {
            "course_name": "African Dance I",
            "review_date": "January 11, 2004",
            "review_content": "\nLots of smiling, lots of laughing, lots of exercise.  If you have never taken a dance class before, that's fine!  Maguette shows you the moves at a reasonable pace, and is always willing to answer questions or slow down.  He is an amazing dancer and there is always a drummer.  Maguette is enthusiastic and relaxed; this will rub off on you.  Although he is the only dance teacher I've ever had, on the scale of teaching in general, he is really at the top.\nWorkload:\ntwo great hours of a dancing every week!\n"
        }
    ]
}