{
    "prof_info": [
        {
            "prof_name": "Lawrence Chasin",
            "prof_id": 4007,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 29, 2010",
            "review_content": "\nAwful.\nHorrible.\nIt seems like he teaches for 20 or maybe 40 years now and he's so tired of the material that he doesn't wanna teach it. Going to his lecture is totally useless and also his PPT slides don't say much. I don't know how to advise people to deal with it because he was one of the worst lecturers I ever had.\nHe doesn't take question and gets very annoyed if someone has something to say in class.\nWorkload:\nInsane.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "May 20, 2009",
            "review_content": "\nHe's kinda an asshole. He isn't gentle to students who ask questions he deems \"stupid,\" he's a goddamn SHARK as a proctor (if he randomly chooses to pounce on you, don't even dare to work for 2 seconds after time is called... even if EVERYONE around you is still working). He gives absolutely NO impression of warmth and caring in the classroom (unlike Mowsh, who seems like a genuinely nice person).\nI found his section to be the drier part, but probably because I am not a chem fan at all. Elementary biochem/orgo and some stuff like glycolysis. His exam (he only teaches 1/3) is the most straightforward and possibly the easiest because it isn't full of those Mowshowitz tricks you will soon come to know (and hate).\nHis powerpoints are relatively useful, which is good,since the material is dry as fuck and you aren't going to want to go to class.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "October 09, 2007",
            "review_content": "\nHe's perfectly fine for the lectures for the first exam.  He does go a fast with the powerpoint, but you can always fill in the gaps in your notes with the Lecture notes, posted online.  Or you can print out the powerpoint slides and go into class with them and take notes directly on those, but I found that I would zone out when I did that.  The two lectures he does that are not on the first exam go way too fast.  Read the lecture notes before you go to those lectures and you will get more out of it.  \nMowshowitz is more dynamic, but there were only 2 lectures with Chasin where I felt like I was lost (the Glycolytic Pathway stuff).\nWorkload:\nDo every single problem in earnest--no cheating!  No giving up and just looking up the answer!  Do the unstarred problems in the problem book first, and save the starred problems for once you've understood all the material.  Write down each lesson learned from each problem--there's a point to each.  Do practice exams.  And get some sleep, ok?\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "October 16, 2005",
            "review_content": "\nSo Chasin just finished the 10 lectures he gives in Intro Bio. \nMan, what's wrong with all these negative people?!?!?! He's a very good lecturer. I'd say great, except for a few abstruse topics where he could have been a little better. The class is run very well; the \"problem-based\" approach keeps you honest. The web-site is great. The recitations are helpful. \nThe only thing: --and now I understand why there are so many negative reviewers-- it's hard to get an A in this class... you need to really be on top of things, and you face stiff competition, so there won't be much of a curve. \nIt's not because the instruction is bad, not because the two textbooks are bad (they're very good), not because the exam questions are unfair, not because the grading is arbitrary, etc. etc.  IT'S BECAUSE THIS IS AN IVY LEAGUE SCHOOL, AND THIS IS A SCIENCE CLASS. If you want an A just for showing up, switch to something else.\nWorkload:\nModerate for a SCIENCE class. Don't skip the lectures: it helps when you read the lecture notes later on.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "April 06, 2005",
            "review_content": "\nGuys. It wasn't that bad. I admit he was a little dry, but if you listened rather than snigger at his mannerisms and joke with your friends you'd do fine. Why be an aspiring doctor if you can't manage a simple lecture class? It gets harder. Trust me. Chasin really seemed to me to care very much about the class and the subject, even if he wasn't always the best at getting the information across. He told a story about spending hours and hours in his basement recording all his lectures from his notes to post online for his students, years ago, only to find that they turned out too short and the actual experience of lecturing was based on the interaction in the classroom. This isn't your enemy speaking! I see this guy around and he always looks harassed and depressed. Lighten up a little. \nAnyway, I thought Chasin was decent, but he's nothing compared to Mowshowitz, who's just a Force. Listen. Study. Ask questions. Check out the text book. Stop whining.\nWorkload:\n3 midterms (drop one), final, problem sets recommended. You should be working quite a few hours a week on this one...\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 06, 2005",
            "review_content": "\nI don't think most of the reviews of Dr. Chasin are fair. I think he's an excellent and extremely dedicated professor. He personally answers in detail all the questions students email him and is always willing to help in office hours where he is both friendly and concerned that you are learning. However, the class in general holds students to very high standards, which, depending on how much you enjoy biology, is extremely good or bad. His lectures are  all on PowerPoint, which may not be to everyone's taste (it takes some effort to figure out how much you should copy into your notes), but extremely detalied lecture notes provide either a backup or alterenative to taking notes in lecture. Given this, you really could skip lecture and teach yourself the course, but be advised that it takes considerably more time to teach yourself what you would absorb in a mere 75 minutes in class (and because of this it's very easy to either never learn what you skipped or leave it till just before an exam, which makes things pretty stressful with all the problems you to work on). The grading scheme is also more generous than people let on, but A-range grades aren't just handed out. \nWorkload:\nDepends. If you do ALL of the recommended problems, then the workload is the equivalent of actually doing all the second semester Lit hum readings (virtually impossible for us mere mortals). Personally, I think it's better to read (or re-read) the lecture notes, do only as many problems as you need to feel confident with the materal, and get plenty of sleep before exams. The exams require a flexibility of knowledge and a certain amount of creatiive thinking (which doing all the problems in the world won't help you with if you're exhausted), but you're given more than adequate time to think, so it's best to be on your game.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "October 28, 2004",
            "review_content": "\nRepeat after me- Larry does not care.  Why else would he speed through power point slides without fully explaining their meaning? Mumble under his breath when someone gives an incorrect answer?  His part of this class is painful- painful- did I mention painful?  Clearly I now know more about metabolic pathways than I thought was humanly possible to learn in a period of 6-7 weeks- the first weeks of an introductory level class- but it does not have to be this way.  I can work the Glycolytic Pathway and TCA like I'm their daddy- but I still don't know what the components of the cell are b/c the first 6 weeks of this course doesn't cover that.    \nWorkload:\nStudy at least 1.5 hours a day or you will get a C. 4 exams- 1 dropped-- there are budding scientists in this class (who get 99s) and the less gifted (who get 12s).\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "September 30, 2004",
            "review_content": "\nFrom the first lecture, I knew this class would be the bane of my existence at Columbia and that one thing was certain, I would end up cursing the day Professor Chasin was awarded tenure. I agree with all the previous reviews, Professor Chasin is not your friend, nor is his a competent lecturer or a nice person.  In fact, my hatred for this class and this man runs so deep, that I am writing this review after only 8 lectures and before the exam, which I am sure will be just as retarded as Chasin's lectures and lame jokes. \nMy first problem with this class was the organization, which is nonexistent. \nProfessor Chasin always arrived early to lecture but somehow we pretty much always started 10 or 15 minutes late due to various \"computer malfunctions.\" Either his computer would crash mid - lecture or his PowerPoint slides would magically disappear and we would waste class time while he scratched his head, patted his tummy and tried to figure out how to get the presentations working again. He's\nbeen teaching this class for how many years and he still can't work out the kinks in his presentation?! That's just unacceptable, if these professors expect me to bust my ass in their class and to devote myself to biology (a subject I now detest), then I expect more from them. I don't want to see PowerPoint slides or badly printed handouts that look like they are from the year of the flood. Is this what $10,000 in tuition at Columbia gets you, crappy looking PowerPoint slides and lecture notes that make no sense? \nMy second major problem with this class is Chasin himself, as he just doesn't give a shit about his students. This fact becomes very evident second week into the semester after Chasin finally wraps up talking about water and gets into the \"real\" biology. I understand that this is Columbia, but when I sign up for a class called \"Introductory Biology,\" I expected to be taught biology ground up, say we'd go over some basic concepts for the dumbasses like myself who took AP Chemistry over AP Biology in high school and then build from there and go over more complex concepts. Well if you're expecting that from Chasin, you're shit out of luck because he skips all the \"real\" biology in favor of longwinded tangents about biochemistry and nonsensical explanations of biological phenomena. For example, expect lecture to go a little something like this: \"Well if we put this and this together, yada yada yada, and then we get a peptide bond.\" Will you learn what a peptide bond is? Absolutely not, but at least you will learn that Chasin suffers from kidney stones, how enlightening! More than anything, this class and Chasin are just frustrating because from day one, you're pretty much screwed because lecture goes no where and you will be forced to pour over his lecture notes posted on the course website (which conveniently leave out crucial points I might add so you're pretty much forced to attend lecture), while frantically reading and outlining the two textbooks required for the class, while trying desperately to get all the problem sets done. \nFinally, my last problem with intro to biology is that it's unfair that both Chasin and Mowshowitz have a monopoly over biology at Columbia. If we are given the opportunity to choose between THREE orgo, FOUR G. Chem and THREE Physics professors, why are we only offered one choice for biology?! And furthermore, I know plenty of people are unhappy in biology right now (at least 10 people storm out of the lecture every class) and there have been many complaints about both professors in years past as they both are terrible professors, their tests are unfair and the class is not taught properly. I'd like to know why they are still allowed to teach this class, better yet, I'd like to know how Chasin even defended his dissertation when he says things like \"well I really can't explain this to you.\" \nUnfortunately, if you're a premed or a postbacc you have to take this class, but be warned, it's a frustrating, stressful and crappy experience that will leave you feeling overworked, jaded and wishing that Professor Chasin would transfer to another university.\nWorkload:\nRidiculous. Lots of reading, problem sets are impossible, pointless and unrelated to test material. This class will suck away all your free time and is a full time job so be prepared to pour your heart and soul into molecular biology. \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 04, 2004",
            "review_content": "\nIf you remember anything from the SAT I, you might say I am to Larry as Jeremy Shockey is to Bill Parcells. So if youÂ’re confused, IÂ’ll be simple: Larry isnÂ’t my friend, and he isnÂ’t yours either, but he's in charge, and we're not. He is the borne assassin of every aspiring doctor at Columbia, and if youÂ’re looking for a way out, youÂ’re wasting a lot of time that you should be using starting hacking away at the material 3 weeks in advance, in preparation to do 15 endless problem sets, read two brutally esoteric textbooks, study 30 hours a week for the exams doing diagrams, reworking problems, trying to keep youÂ’re head screwed on, and then reciting every prayer youÂ’ve ever heard in hopes of hitting the mean on the tests. If he teaches you biology, you should offer to give him computer lessons Â– he wastes an incredible of time on the computer setup of his presentations. HeÂ’s a bit rude as well, and if heÂ’s your exam proctor, heÂ’ll come out as a modern Gestapo, and not too receptive to student questions. I call this class Â“natural selectionÂ” for people whoÂ’ve been at it all their lives. I didnÂ’t take AP bio, and I really regret it now. You think youÂ’ve got the stuff nailed to the wall, until itÂ’s time to put the answer key away. YouÂ’ll have to break out of the traditional mold of studying a tough subject Â– get rid of the flash cards, vocab sheets, and quit quizzing each other, and devote youÂ’re life to knowing every possible situation (the problem sets will give you an intimidating start) where each little detail can even be mentioned. And itÂ’s not enough to have done the problems Â– the exams test whether or not the stuff is second nature to you, so just get going nowÂ…you can never know it too well Â– and no detail in anything you read can be passed off Â– in fact, the more ridiculous it sounds, the more likely it is to show up on the test. Even try to use the stuff in youÂ’re everyday thinking now and then Â– test yourself while you work out and see if you can remember exactly whatÂ’s happening in your body!\nSo to sum up: 2 textbooks: $230 Â– Deciphering lecture and web notes: 10 hours a week Â– Trudging through problem sets: 30 hours a week Â– failing four tests: 0.2 off your GPA Â– learning a hell of a lot more bio: priceless.\nWorkload:\n15 Problem Sets (do all of each one or you will fail), 23 lectures (you wonÂ’t understand the problems if you havenÂ’t cracked them), weekly quizzes in recitation (donÂ’t you wish those were the exams?), and 4 tests (at least youÂ’ll have a story to tell).    \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 24, 2003",
            "review_content": "\nThis class is overrated.  Dr. M's lectures are terribly vague, disorganized, and superficial.  Dr. Chasin just happily ploughs along the first few weeks that he has to teach.  He's not better than Dr M, but at least his lectures are organized.  The TA's are a toss-up.  Some are clueless and others are better teachers than the professors.  The material is very interesting, but you're better off reading the textbook instead of going to class (half the class did this after the 2nd midterm, leaving lots of room for ass-kissing postbacs to attend the morning lecture).  The problem book is only helpful if you understand the concepts.  This class is run like Communist China.  Exams are are poorly written and ambiguous, and graded somewhat abitrarily.  Sometimes all you need to do well is a little luck (for guessing the correct multiple choice answer) and a knack for giving ambiguous answers to the equally ambiguous questions.  Grading: ok, so first there's the monumentally stupid idea of handing back the exams in a lecture of 300-400 people, unless you like to get trampled by a mob.  Blatant misgrading is the least of your worries(and it happens quite a bit).  Sometime they'll lose your exam, or hand you back an exam that will have pages from someone's exam.  Don't expect them to do anything about it.  They 'll snark about the most inane to the most valid concern about grading.  Plus, there's no guarantee that, if you are pre-med, that the course will cover material relevant to the MCATS.     If you are a bio major, you ought to be good enough to opt out of this course (there have been such people who've weaseled their way out of this course).  If you are premed, take your bio prereq somewhere else, or take Pollack's class in the fall so you only have to suffer through Intro to Mol & Cell Bio for one semester.\nWorkload:\nA lot, but not overwhelming.  However doing all the problem sets doesn't mean you'll ace the exams.  Weekly quiz during 2 hour recitation.  3 midterms and a final.  Like someone said, don't count on the curve to save your grade.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "November 25, 2002",
            "review_content": "\nKids, Larry is the evil one. Do not be fooled by his amusing tinker toy models or tiny growing tummy. You cannot imagine the capacity you have to hate all enzymes, six carbon sugars and anything related to breaking them down. A question on our second exam was based on one sentence he said in one lecture at some point in the course. You think that you just have to memorize everything and apply it logically, but Larry asks questions on the exception, that one case where things DON'T work normally, and for some reason, YOU were supposed to know this. I liked Larry in the beginning; he seemed so innocent, so . . . harmless, but no, his questions which some euphemize as \"tricky\" are frickin impossible. I really have no idea why he wants so badly to screw us all over . . . \nWorkload:\na lot. problem sets, do them, i personally think the text is important for the larry section of the course because he's not a very good lecturer, often going on to long and weird tangents having hypothetical conversations between \"the biochemists\" and \"the biologists\" and one says \"no!\" and the other says \"but it's one!\" and then the biochemists said . . . . \n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "January 30, 2002",
            "review_content": "\nThis isn't AP Bio redux. Infinitely more difficult. Very organized lecturer. Verbatim Web notes may tempt you not to go to class, but this is suicidal. Sometimes he goes a little too fast, like the Krebs Cycle. I agree with the other reviewers. You end up previewing the lecture notes. Then you go to class. Then you come home and juggle 2 books and your lecture notes deciphering the material. Then you do 20 difficult/long problem sets for each section. (15 sections) Then you study 50 hours for the exam. That is the only way to get an A. All the people in the class are either pretty smart or very very dedicated and motiviated premed students. Plus there are alot of post-bac 30 year old adults who will do anything to become doctors. If you want to fufill a science requirement, you should go the biosphere, unless you love biology so much that you don't care about a .2 deduction in your GPA.\nWorkload:\nIf you want an A, Plan to work 30 hours a week. I joke not. If you slack off you will get a C or D or F. Tests are impossibly difficult and really tricky. No matter the grade you get, you will have learned alot. Do the problem sets, or you will fail the class.\n"
        },
        {
            "course_name": "Introduction to Molecular and Cellular Biology I",
            "review_date": "December 03, 2001",
            "review_content": "\nGreat Professors! Great class! You learn a lot of bio, very interesting lectures, VERY helpful website, you almost never fall asleep during lecture (if you like bio to begin with) BUT... Terrible exams! Work work work work and no show. If you didn't get at least a 3 on AP bio, save youself the heartache.\nWorkload:\n3 exams, 1 final, recitation. Practice sets (not collected)\n"
        }
    ]
}