{
    "prof_info": [
        {
            "prof_name": "Jeffrey Koberstein",
            "prof_id": 2512,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Thermo II",
            "review_date": "August 29, 2006",
            "review_content": "\nProfessor Koberstein is excellent at teaching this Thermo II courses.  It is true, he makes you do a lot of work, but when you get to the tests you realize that you really understand what you've been going over.  He cares about his students and how well they grasp the material.\nWorkload:\nThe workload is high.  The homeworks, which are at least weekly but sometimes are more than one a week, sometimes took me over 8 hours, and were rarely less than 4 hours.  The tests were hard but did test you on the material that you had learned, and if you kep tup with the homework, you felt fairly prepared for the tests.\n"
        },
        {
            "course_name": "Thermo II",
            "review_date": "May 05, 2005",
            "review_content": "\nProfessor Koberstein is a great teacher.  He is very approachable, despite being the intimidating chair of the department.  He is concerned with the students' learning and progress.  His lectures are very organized and easy to follow.  While they weren't particularly exciting, I rarely felt myself falling off to sleep during them...He gives a LOT of assignments, which can seem tedious and hard to manage, but you realize when tests come how great it was because you barely have to study if you did all the assignments.\nWorkload:\nA lot of homework (sometimes 2 in one week) which varies from a 30 minute assignment to a 5 hour assignment.  2 midterms and a final.  Also, a recitation that isn't mentioned on the directory of classes, so be aware, because it's required.  And I mean really required...every week there is an assignment and it counts towards homework grade.  By the end of the semester the recitation becomes nearly half of your hw grade.\n"
        }
    ]
}