{
    "prof_info": [
        {
            "prof_name": "Christopher Wood",
            "prof_id": 3163,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I",
            "review_date": "November 12, 2016",
            "review_content": "\nProfessor Wood is an amazing teacher. I would definitely suggest taking his class if you are interested in French. Without any prior knowledge of the language, I was able to grasp concepts and truly understand with his teaching. He would find ways to make you interested in the language as well. \nYour grades depend on how well you practice and study for the class. I didn't do well in many tests but I feel that was because of my unsatisfactory studying.\nWorkload:\nNot much- 4 tests, and oral exam and a final. There are occasional quizzes and compositions too.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 16, 2014",
            "review_content": "\nProfessor Wood is an absolutely incredible professor! I tried several Elementary French sections, and in all honesty, he was the best teacher I found! He explains the material very well and his hilarious personality makes you look forward to his class. The best part is that he emphasizes enjoying the language, which is crucial to have any apt understanding of any language. YOU MUST TAKE THIS COURSE WITH THIS PROFESSOR! Workload is definitely manageable. About 10-12 oral and written exercises from the workbook per class which are due before the written test,5 compositions(4 written and 1 oral) and 5 exams(4 unit tests and a final)\nWorkload:\nsee above\n"
        },
        {
            "course_name": "Major Literary Works to 1800",
            "review_date": "December 13, 2009",
            "review_content": "\nAs the above reviews say, Prof. Wood is extremely passionate about french and french literature and he knows a TON about every author and their time period and the cultural/political movements that were happening. He's pretty much read all of lit hum and cc and a lot more. The class is, as expected, a lot of reading, and you have to do at least most of it - there are pop quizzes. He also sends out about 10 wikipedia or other article links via email that give more background information about things we talk about in class, which he also sort of expects you to read. Oh, and then the last two weeks of the semester, he'll tell you that you also have to write a 10-15 page analytical/research paper - that at least last semester, he made due the day after the final. The paper is a complex and difficult assignment to begin with, and writing it in a foreign language is just an added bonus. He has high expectations and is not an easy grader. I recommend trying to meet with him before papers are due to figure out what he wants from it- because he has very specific expectations that he did not tell us about until after the first paper. \nEssentially, he puts a lot into the class and expects that you put in even more. I would not recommend taking this class if you are already taking a heavy course load and want to have a life. It is a great class, and Prof. Wood knows a lot and is generally a good teacher, but he has no concept whatsoever of the fact that this is not our only class.\nWorkload:\nabout 200 pages of reading a week (some of the readings are in middle french- for these, get an english or modern french translation), hard midterm, hard final, one 5-7 pg paper, one 10-15 pg paper. A lot.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "November 16, 2009",
            "review_content": "\nA great professor. He has a passion for French that clearly shows in his teaching. I may not like the Language, but I loved him as a professor. He is very reasonable, a fair grader, and good about explaining things you don't understand. He grants extensions for good reasons (and sometimes just because you forgot to bring your work to class). He likes to bring in French music to share, and will let you borrow CDs of the stuff he brings in. \nHe speaks only in French, which is normal for this level and helps students learn the language. He gives constructive feedback on assignments and curves grades on exams when everyone does worse than usual. \nI would definitely recommend taking any class you can with Professor Wood.  \nWorkload:\nNormal language class.\n4-5 exams\nWorkbook exercises (graded for completeness)\n4-5 compositions\nFinal oral presentation\nFinal exam\n"
        },
        {
            "course_name": "conversation",
            "review_date": "April 03, 2008",
            "review_content": "\nThis is the second class I've taken with Christopher Wood, and it was a deliberate choice. He has an enthusiasm for the language that is infectious, and his knowledge of French culture is impressive. I needed that joie de vivre, after a semester of 1201 with a teacher who almost put me off French for life ...\nChristopher Wood is a quirky wee soul - he sometimes comes across as a bit nervous, but he knows his stuff. \nI felt a bit sorry for him in this class, as a lot of the kids in it didn't seem to take it very seriously, presumably because it's seen as a bit of an add-on to the main - 1201 - class. \nHowever, for me the class was a godsend, after my struggle with 1201. Christopher Wood's conversation class saved me from hating French forever more. \nThe only downside is the inevitable, loathsome French presentation, but you'll have to do that in whatever class you choose. C'est la vie ...\nWorkload:\nVocab quizzes, a journal of French movies you've watched, songs you've listened to, publications/websites you've read ... as Monsieur Wood would say, serious play. Top tip, though: fill the journal as you go along, and don't wait for the midterm and then cram it all in at once!\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "February 07, 2007",
            "review_content": "\nFor the first couple of weeks of class, many of us thought Christopher Wood WAS French, he spoke English so rarely. If you believe in the immersion method, he could be the instructor for you. That said, he will explain things in English, for those who are a little confused!\nI would definitely recommend him, mainly because a sense of humor is essential when you have signed up to make a fool of yourself in public with your first attempts to speak French. He is quirky and amusing, and it is a fun and lighthearted class. It's just a shame he's not currently teaching Elementary French II.\n\nWorkload:\nThe workload will not kill you, but be warned - he WILL check your workbook while you are taking a test, so keep it up to date.\n"
        }
    ]
}