{
    "prof_info": [
        {
            "prof_name": "Rachel Eisendrath",
            "prof_id": 12800,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Shakespeare I",
            "review_date": "January 19, 2015",
            "review_content": "\nProfessor Eisendrath specializes in Renaissance poetry, and while not specifically a Shakespeare scholar is very well versed in the material. Her lectures are interesting and entertaining, and she makes sure to encourage in-class discussion despite the large size of the class (60 students). Professor Eisendrath never pushed her own interpretations of the work, but allowed students to express their own while guiding the discussions. Key passages are read aloud by the students. Participation is strictly voluntary. The class covered a new play every week, and took a field trip to see a production by the visiting Royal Shakespeare Company. If you are a casual Shakespeare lover or need a literature class for a requirement, I would recommend this course.\nWorkload:\nReading one play per week. 5 response papers (1-2 pages each), 1 term paper (8-9 pages), in-class midterm and final. \n"
        },
        {
            "course_name": "The Elizabethan Renaissance: The Lyric",
            "review_date": "December 29, 2014",
            "review_content": "\nProfessor Eisendrath is PHENOMENAL - one of the best instructors I've ever had at Barnard/Columbia. She facilitates discussions well and is incredibly intelligent, approachable, funny, kind, and attentive. She also grades very fairly, provides thoughtful and helpful comments on papers, and truly cares about her students. I highly recommend taking a class with her.\nWorkload:\nWeekly 1-2 page response papers, 5-7 page midterm paper, short presentation on one poem, final exam.\n"
        },
        {
            "course_name": "Coll: Order and Disorder",
            "review_date": "April 01, 2014",
            "review_content": "\nJust noticed the dearth of reviews for Professor Eisdendrath so I have to say that she's a fantastic professor & nobody could regret taking a class with her.\nShe's very knowledgeable in Medieval Literature & art. Before going into academia, she actually attended art school. She's so passionate that it's dorky, and this makes her really approachable. She makes a lot of time for students outside of class, even if you want to talk about something other than school. She's very reasonable in grading and will improve your writing a lot.\nShe handles discussions very well, facilitating great conversation with pointed questions. I really recommend taking a class with her in her specialty, the Renaissance.\nWorkload:\nNormal. A book and an essay a week perhaps (this is for junior colloquium) and two papers\n"
        },
        {
            "course_name": "Renaissance Drama",
            "review_date": "January 03, 2014",
            "review_content": "\nEisendrath is the most attentive, knowledgeable, understanding, funny, and fascinating professor I've ever had.  She leads really engaging discussions, knows everything about the Renaissance, and spends so many hours writing paper comments.  Her passion for all things 1600s is palpable and that's really important when taking English requirements you ordinarily wouldn't have signed up for.  The course goes beyond just the literature.  She gives you an in-depth look at the history and politics surrounding each play.  I recommend taking any course with Rachel Eisendrath.\nWorkload:\nOne play a week, weekly reading reflections, 2 short papers, open note final exam\n"
        }
    ]
}