{
    "prof_info": [
        {
            "prof_name": "Katharina Volk",
            "prof_id": 1414,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nOverall she is a great teacher.  Her knowledge about Ancient Greece has time and time again astounded me.  You can ask her the most specific question and she will likely be able to answer it, or if not, give you a reasonable, informative answer or she will look it up.  Sometimes however, I believe that she spends too much time talking about background and historical information and teaching us Greek, when she could spend some more time talking about the themes and topics of the text.  Both are important, however her classes definitely give a lot more sway toward historical content than other classes.  \nWorkload:\n3 papers (3-5 pages), no quizzes, she will call on you if you do not participate in class very often so make sure that you read the assignments\n"
        },
        {
            "course_name": "Selections from Latin Literature: Poetry",
            "review_date": "December 26, 2004",
            "review_content": "\nAmazing teacher.  Vastly knowledgeable, funny, friendly, enthusiastic, helpful.  Loved taking Latin with her.  She explained context, allusions, background info, etc etc  without overwhelming.  Totally a fair grader, offered extra help, was always there for office hours, extremely helpful during paper writing.  Really, a great professor all-around who made me feel completely comfortable and from whom I learned a lot.  I would gladly seek out and take any class she teaches.\nWorkload:\nMidterm, Final, Paper (10-15 pages).  Difficult, but completely fair.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 05, 2004",
            "review_content": "\nDefinitely take lit hum, or any other class, with Professor Volk.  She is an extremely intelligent, warm, and open-minded teacher and she made the lit hum discussions lively and interesting.  Believe me, I usually would fall asleep during any 2 hour class, but during this class I was fully attentive and engaged in the conversation.  \nWorkload:\nnormal lit hum workload, 3 papers (1 two-page, 2 4-6 pages) a midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 29, 2003",
            "review_content": "\nPretty fair grader, you won't be thrilled by this class but if you show up and do the asignments, you'll do just fine.  Meet with her for office hours that way she'll get the sense you really care to know more about what you're reading.  Just don't fall asleep in class she'll remember those who do when it comes time for grading.\nWorkload:\n4 (3-5p) papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2003",
            "review_content": "\nVolk was.....interesting. She seems to be very very smart, but as far as Lit Hum goes....I'm not too sure. In class, all we would discuss is the background to the books and authors and plot summaries-- not very interesting for those who love to discuss the deeper meaning of things. If you're like me who really doesn't care much for the course or the works discussed in it, she's the teacher you want to have-- you'll know enough to do well on the midterm and final. \nWorkload:\nThree papers, midterm, and final\n"
        },
        {
            "course_name": "Latin Lyric Poetry",
            "review_date": "January 15, 2003",
            "review_content": "\nI fully agree with the previous reviewer.  Volk is not only deeply knowledgeable and intelligent, but she is also a fantastic instructor - able to explain difficult constructions clearly and to acknowledge our own interpretations of meaning and structure, and able to review simpler grammar and vocabulary without making a big deal about it.  She seemed to genuinely enjoy teaching, and I appreciated that she took a more holistic approach to teaching intermediate Latin - it wasn't all just translation and grammar.  She considered us able to approach the texts critically, and I consequently learned more about Latin - in terms both of translation and its deeper structure - than I have in any other class.\nWorkload:\n50-60 lines per class; sometimes more, sometimes less, but we never got to it all; midterm and final of average difficulty; short memorization and recitation; and final paper 5-7 pages\n"
        },
        {
            "course_name": "Latin Lyric Poetry",
            "review_date": "January 08, 2003",
            "review_content": "\nI highly recommend Professor Volk. She was devoted to the class, interested in the subject matter, and incredibly personable and approachable. She seemed to actually want to get to know the students in the class (she took us on a field trip and out to lunch) and was always available. The workload wasn't light but it was never too much. With the proper preparation it was easy to do well. Volk was simply one of the best professors I have had at Columbia. She was the kind of teacher who, if she didn't know the answer to a question, would do research outside of class to find it. She took students' comments seriously and never dismissed new interpretations of the poetry, though she did disagree at times. She was willing to go over grammar and never made anyone feel stupid for not remembering a particular construction. Incredibly smart and quite funny but never pretentious. I fully enjoyed her class and hope that I'm able to take another. Seek her out.\nWorkload:\ntranslation for each class (50 lines of poetry?), midterm, final, paper\n"
        }
    ]
}