{
    "prof_info": [
        {
            "prof_name": "Allyson Sheffield",
            "prof_id": 10717,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 12, 2012",
            "review_content": "\nAllyson is a really nice, lovely woman. I personally found FroSci hideously boring but that might be just me - at any rate it certainly wasn't only her fault. She's very accessible both in and outside of class and more than once helped me with homework problems I was struggling with. She isn't a hard grader per se - that is, I got the sense most people get decent grades from her - but it is sort of hard to get better than a B+ on big assignments since she's kind of a stickler for details. Overall though, a very nice teacher. She goes out of her way to prepare you for assignments and give you time to complete them and is very organized which in a weird way actually helped keep me organized. \nWorkload:\nNot terrible. I'm not sure how much variation there is among frosci teachers. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 25, 2011",
            "review_content": "\nAllyson is a solid professor for Frontiers. She is generally knowledgeable about the material, grades generously, and is very approachable regarding any questions or problems that you may have.\nA few more specifics on the academic layout for this class:\nSeminar - 40% (consists of homework packets called \"WIAs,\" quizzes, answering to random questions Allyson posts online, attendance, term paper, Museum of Natural History visit)\n- For large lectures, I advise to go to them. Even if you already know the material, it helps your overall understanding to hear it from the specific professors who speak. Plus the lecture hall has wifi in case you get really bored or need to work on another assignment.\n- You should go to seminar lectures too since it counts for your grade and such\n- After each large lecture, Allyson makes you to email her a question you had about the lecture. If you don't have one, just BS a vague question about the general lecture and everything will be fine.\n- Homework is really easy if you have past science (esp. AP) experience. Even if you have a bit of trouble, just ask a friend or go to office hours. The grading goes from poor-fair-good-very good-great-excellent with good and above receiving full credit (I have never seen anything lower than a \"very good\")\n- Quizzes usually aren't too bad, but some people have trouble with them. They are usually 2-3 short response questions with one extra credit question. Just look over the lecture again if you really need to.\n- Over the course of the semester, Allyson may post random stuff online. It's worth a brief look and a brief response.\n- 1500 word term paper is annoying. Most people end up BSing a lot of it. For optimal grade, submit a draft early to Allyson for her to take a look over it and revise it.\n- Museum visit is generally enjoyable and it's worth going with Allyson and her enthusiasm. She bought us Shake Shack afterwards.\nMidterm - 20%\n- Choose 2 out of the 3 questions presented for each of the first two units and answer them fully. (So you answer a total of 4 questions which consist of smaller sub-questions)\n- Generally, they are pretty similar to the homework.\n- Standard studying is to just go through the powerpoints posted online and usually that is enough. If you need more, then go to office hours.\n- You are allowed one sheet of paper (both sides) as a cheat sheet. I've found it doesn't help much, but it you need it, it's there for you.\nFinal - 40%\n- Similar to midterm except doing the third and fourth unit (and choosing 1 of 2 questions for first two units). So total of 6 questions answered.\n- Still similar difficulty to homework\n- Essay at the end which usually is pseudo-science related. It's hard to study for this; just being generally familiar with the concepts of the class is enough though\nWorkload:\nAttendance to Seminar\nAnswering small online stuff\nHomework packets (WIAs)\nQuizzes\nTerm Paper\nMuseum Visit\nMidterm\nFinal\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 18, 2011",
            "review_content": "\nConsider yourself lucky if you are taking Frontiers (some call it Fro Sci) with Allyson! Allyson is knowledgable, incredibly approachable, and PASSIONATE about the course. Although honestly speaking most people take this course only because it is required, Allyson takes it so seriously that at the end of the semester we are all somehow got more interested in science, and better at Back of Envelop Calculations. \nAllyson explains the lecture in a clear and concise manner. She grades homework carefully and generously, and loves to answer your questions. Most importantly, she is always available during office hours! I remember one week when we were on some kind of break she went to Arizona for observation (she's an astronomer by the way!). Instead of canceling her office hours, she made it on Skype. That week I video chatted her on my term paper, and got to see the HUGE telescope and the computer lab she worked in! That was the only office hour I went to this semester, and now at the end of the semester I really wish that I could got to know her more.\nAllyson's passion on science has even motivated me (I'm arts and humanities major) to learn more about science.This is the last science course I will ever take for the rest of my life (though now I'm thinking taking more) and Allyson has made it so much better.  Take this course seriously. At the end of the semester you might even miss it! Even if you are not that into science, you can at least get to know a great professor.\nWorkload:\nWeekly WIAs and readings, and questions on the lecture. One 1500-word Term Paper, and lots of extra credit opportunities (mostly coursework forum participation and public lecture reflections)! Try your best to go to the Museum of Natural History with her. Retrospectively, not doing so is what I regret most of Frontierss this semester.\n"
        }
    ]
}