{
    "prof_info": [
        {
            "prof_name": "Joan Snitzer",
            "prof_id": 2858,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Painting",
            "review_date": "November 17, 2014",
            "review_content": "\nIf you want to learn how to paint in a technically proficient way, this class is not for you. If you're looking for a chill atmosphere where you are pushed to complete paintings because you have difficulty carving out time in your schedule to paint, go for it. The syllabus does provide suggestions, but Joan emphasizes that you're free to do what you want. One thing I wish I knew going in was that you're expected to purchase all of your own materials. This was the first painting class I've taken here, and I was surprised that the department doesn't at least provide you with canvases. The cost of it is pretty high if you don't intend on taking more art classes in the future, considering you'll have to spend over $100 or so for the basic oil paints and canvases. I guess I'm learning by doing, but there is basically no instruction given from the professor; she and her assistant make their rounds during the 4-hour block, but they stop and chat for no more than 10 minutes, tops. Outside work is definitely expected to finish everything by the end of the semester; she doesn't give deadlines besides that. \nWorkload:\n10 paintings are due over the course of the semester, plus 2 for extra credit if you wish. An \"image file\" of inspirational photos vaguely related to the prompts is supposed to be submitted at the end as well. Additionally, students split into groups to read an art-related PDF and make a 10-15 minute slideshow about the article and present it to the class. Everyone is required to do this only once, and it can be done the night before. \n"
        },
        {
            "course_name": "Painting I",
            "review_date": "December 28, 2011",
            "review_content": "\nI was really excited to take this class, but I was disappointed. The course was relaxing, but I just don't think I got much out of it. I knew going into it that it was not a technique art class, but I don't think I understood the extent of what that meant. She will come around and say something about your work once or twice in the 4 hour period. You can pretty much do whatever you want as long as you get 10 paintings done by the end of the semester.  \nWorkload:\nFinish 10 paintings by the end of the semester. That's all. \n"
        },
        {
            "course_name": "Painting I",
            "review_date": "September 19, 2010",
            "review_content": "\nJoan is great! She is genius, she really has a unique way to teach art. I had never painted before and she really helped me develop my love for art. She really has a passion to teach and that passion lead the class to a very efficient result. Everyone in my class had become an artist in the end. My classmates and I developed a passion to paint and we all became expressive. Joan is very truthful and critical of the paintings, I also found it very helpful that Joan allows for open discussion and allows students to critique each others work. It is a great class.. if you can get in. \nWorkload:\n8 paintings per semester, the studio is open 24/7. You get your own locker and a place to store all your paintings.\n"
        },
        {
            "course_name": "Painting",
            "review_date": "March 07, 2006",
            "review_content": "\nI took this course with Joan during my first semester at Barnard.  It was fairly large for a painting class (maybe 18?) but a pleasant, relaxed atmosphere.  That said--I'm not sure Joan learned more than one or two students' names during the entire semester.  She definitely didn't know mine.  She must have given every person in that class an A, though, because I got one and there's no way she could distinguish me from anyone else on paper.  A nice enough woman, but she really didn't seem to care much for us beginning students.\nWorkload:\nEasy.  5 completed paintings over the course of the semester with size requirements.  A couple very small assignments involving images in media.\n"
        }
    ]
}