{
    "prof_info": [
        {
            "prof_name": "Jason Smerdon",
            "prof_id": 4371,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Sustainable Development Seminar",
            "review_date": "December 29, 2012",
            "review_content": "\nThis class is what it is: a basic introduction to the Sustainable Development Major/Concentration. Thus, it ultimately lacks substance and can be a waste of time; this was especially the case for my class, which was full of juniors and seniors who had obviously finished their other requirements for the major and had to get this requirement out of the way.\nAt the same time, however, the class did what it was supposed to do: introduce the discipline and major of Sustainable Development and have the students think critically about the concepts that they entail. While the material is often dry, the class did a great job in achieving its purpose. Jason was a wonderful and comical lecturer, and you can tell that he is passionate about the subject even though he acknowledges that the course is a necessary evil. Rebecca, the TA, also made the class interesting with her personal anecdotes about her experience with the major. I also liked the guest lecturers such as Jeffrey Sachs and the professors from the department. Don't listen to the uncouth review below mine; the claims made about Jason and Rebecca are simply untrue.  While the class could be redundant at times, it was an overall stress-free and relaxing experience. Jason even brought homemade food for us on the last day! Just go to class and do the work and you're guaranteed an A.\nWorkload:\nAttendance, which is determined by iClicker surveys administered during class; just go to class. You don't have pay attention (even though you should, just because Jason is really friendly and cares for his students; class is only about an hour long!) or take notes.\nThere are also weekly blog posts that must be done in conjunction with replying to the posts of 2-3 students. This wasn't difficult, though the annoyance factor came from forgetting to respond to the posts of other students since the class is obviously low-priority.\nThere is also a final group video that has to be 2 minutes long. It was hard to coordinate between students since we were all busy and only had about a week or so to do it, but this class isn't based on effort anyways.\n"
        },
        {
            "course_name": "Introduction to Sustainable Development Seminar",
            "review_date": "December 21, 2012",
            "review_content": "\nIntro to Sustainable Development was worthless. In hindsight, I should have watched a documentary on YouTube concerning global warming. The weekly lectures were spent gossiping about current event, not sustainable development. Do yourself a favor and skip this class. It was just one credit, but the course's demand mirrored a traditional, three credit course. And if you're not a SusDev major, Jason and the TA assumed you were beneath them. So, do not take this class unless you're required to do so. Worthless! \n\nWorkload:\nWe had mandatory weekly participation projects, and four group projects. Coordinating the projects were awful; the class hosted forty of us, each with different schedules. In short, this course asked too much! \n"
        },
        {
            "course_name": "Earth's Environment System: Climate",
            "review_date": "December 30, 2010",
            "review_content": "\nThis class has to be my biggest disappointment at Columbia thus far.  The class was, at times, pathetically redundant with the Frontiers of Science curriculum, which itself was often pathetically redundant.  The class's makeup also seemed to be averse to learning Environmental Science itself, as most students were either Sustainable Development Majors or were there for the Science Requirement.  Thirty minutes of a class were once spent on explaining why the seasons occur, and amazingly several members of the class were still confused.  The subject matter was tragically interesting - the first half of the semester, taught by Jason Smerdon, dealt with Atmospheric Circulation and Weather Systems.  Although at times he came off as shallow, Smerdon was extremely charismatic and held the class's attention quite well.  The second half of the semester was taught by McManus, and although he came off as more intelligent than Smerdon, his lectures sometimes rambled and his class notes were not helpful with studying, consisting mostly of pictures and scanned scribblings.  His lectures focused on Deep Ocean Currents but also spent way too much time on the same 3 ideas about Climate Change.  \nI would have liked to call this an \"easy\" class due to its sparse and repetitive subject matter but this was not an \"easy\" class.  Even if you pay attention and take notes in class, and even if you read the optional readings from the textbook, I still cannot say you're going to get an A in this class.  The weekly labs were a shitshow.  The TAs came disastrously unprepared to labs, which as the semester progressed often required downloading glitchy software that the TAs did not understand how to use and also failed to tell us to download in advance.  Most labs consisted of inputting data into Excel and making graphs over and over again.  It did not matter if you understood the subject matter (which was often a painfully basic grasp of Climate Change), but a few formatting errors in Microsoft Excel or Word could cost you one or two letter grades.  The TAs often didn't respond to emails sent regarding formatting yet penalized students harshly on formatting when grading labs.  Their grasps of labs' actual content were also maddening, and they were often bitter and angry when politely challenged.  If these people are on the front lines of environmental change and study, we are fucked.\nIt is seriously unfortunate that this class is a requirement for an EESC degree, as this completely turned me off to the entire department\nWorkload:\nextremely redundant and painful weekly labs worth 30% of grade, P/F homeworks worth 10%, 30% midterm, 30% final\n"
        }
    ]
}