{
    "prof_info": [
        {
            "prof_name": "Gerard Ateshian",
            "prof_id": 4026,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Machine Design",
            "review_date": "January 07, 2013",
            "review_content": "\nProfessor Ateshian is a great professor and you will learn much from going to lecture BUT you don't have to go to lecture. The homeworks, midterm and final exam are all take home and you do not need to know what was said in class. \nMake sure that you do every single homework with a friend, there will most likely be no curve in the class. You will pass most of your time in front of ProE apart from a single project assignment in which you are asked to machine five parts.\nDo not start the homework too early. He will give hints, tips and modifications about the assignment as the deadline gets closer. \nWorkload:\nHomework Assignment on ProE takes about 4 to 5 hours depending on iteration. Midterm takes an all nighter maybe two. \n"
        },
        {
            "course_name": "Machine Design",
            "review_date": "December 27, 2011",
            "review_content": "\nIn this class, you design and build a valve for a two-cylinder compressed air engine. You can build any sort of valve you like, but most people end up with a cam-follower type valve, because that's the most reliable design. Also, there is a pre-built cam follower valve in the shop that you can look at for \"inspiration.\" Most of your grade comes from the performance of your valve - ie. if yours makes the engine run faster, with more torque, and more power, than do other groups' valves. There is a long series of pain-in-the-ass assignments in which you repeatedly submit the same drawings, slightly modified, for Ateshian's approval. He is extremely nit-picky when approving your drawings, and you're \"not allowed\" to machine any parts without his signature. In practice, many parts get machined long before Ateshian's signature has ever graced a drawing; this is the best way to do it. There is only one problem set (pretty stiff) and no tests. If you get a solid bunch of group members, who are motivated, organized and good with Pro/E and CNC milling, this can be a pretty easy class. If you want an A, though, your valve must outperform many other groups' valves. \nWorkload:\n10 detail-oriented technical drawing/dimensioning assignments, 1 gnarly problem set, no midterm, no final exam, 1 final report, 1 final presentation\n"
        },
        {
            "course_name": "Mechanical Engineering: From Micro Machines to Jumbo Jets",
            "review_date": "February 17, 2009",
            "review_content": "\nAteshian is one of the most clear and concise professors I have ever had. The class was extremely easy - it could easily have been called Physics for Dummies. We began with concepts such as F=ma, and concepts never got harder than that. It was truly an introductory course. Ateshian went extremely slowly, spending multiple class lectures on very simple concepts such as vector addition, as if he were teaching 5th graders and not Ivy League students. His writing was very legible (probably because he went so slow and wrote down absolutely every step). He followed the book word for word, so there is really no need to go to class, but like I said, listening to his lecture, however boring, will spare you from having to read 30-40 pages of the book, since he basically paraphrased it for us.\nIf you want an easy A from a very enjoyable professor, Ateshian is for you. I would definitely take him again.\nWorkload:\nEXTREMELY LIGHT\nA few problem sets, usually 3-4 problems each - will take you a maximum of 1 hour to complete, although even that's pushing it. Some weeks the homework was 300 word reviews of guest lectures - so you have to go to those, but even if you don't, you can easily BS 300 words about the topic at hand.\nOne midterm, very easy but because of that, if you made a stupid mistake, it quickly bumped you down to a B. I misread one problem, and because of that got a B- on the midterm\nOne group project about an aspect of automotive engineering. I did the entire project myself without the help of my group in about 2-3 hours, and got an A on it, so it is very easy.\nOne final, equally easy, but again, very easy to mess up on.\n"
        }
    ]
}