{
    "prof_info": [
        {
            "prof_name": "Richard Locke",
            "prof_id": 541,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary American Literature",
            "review_date": "April 21, 2003",
            "review_content": "\nProfessor Locke just rubbed me the wrong way. He wasn't a bad teacher and he wasn't even boring, but everything he did reeked of self satisfaction. His favorite thing to do was read portions of a novel (and sometimes whole short stories) outloud in terrible accents. He loved to hear himself do this, but most of the class just sat there wanting to stab ourselves. On the plus side, he knows his stuff. He's into commenting as he reads, which is interesting, but the end result is the class knows the first page really well and the rest of the novel hardly at all. Still, he manages to cover the themes and main stuff going on by the end, even if he has to just list it as the class is about to leave. Overall, you learn a decent amount about some great books, but at the expense of having to put up with his attitude. He also leaves no time for questions, which kills any kind of class/prof interaction.\nWorkload:\nmidterm and final consisting of ids. a 7-8 page contrast and compare paper with vague guidelines. reading: a quality book a week.\n"
        },
        {
            "course_name": "Contemporary American Literature",
            "review_date": "April 18, 2003",
            "review_content": "\nI loved it.  I enjoyed his lectures, and the syllabus would make up for anything bad said about them anyway.  He gives life to some more difficult novels and stories (Ellison, O'Connor, Nabokov, Barthelme, Herzog, Roth, Updike) but can fall flat on others that are straightforward enough for the student to develop his own ideas on (Heller, Paley, Carver, Kingston - basically the end of the class).  I'd especially recommend it for non-English majors, though the readings kinda heavy and you might wanna do it P/F.  For Majors, I think it's a nice break from the heavy-handed style of many other profs here to hear a guy doing an old lady's Southern accent, and it forces you to read the best stuff out there (which you would want to read anyway).  Froshes and Sophs---he'll kick you out during the first class (please come, though...it was a very amusing part of the first day)\nWorkload:\nLotsa reading, but it's all very pleasant - I ended up reading most of the assignments (except the two 600-pagers) in one or two nights because I was so engaged in them.  midterm and final (very LitHum-like)...weird paper topic(compare and contrast 2 works?), and a lot of grading by TAs\n"
        },
        {
            "course_name": "20th C. Literary Non-Fiction Lecture",
            "review_date": "December 27, 2002",
            "review_content": "\nFor graduates and fellows, etc. Excellent overview--Orwell, Wilson, White, Mitchell, Woolf, Nabokov, Didion, Sebald--of the big names in non-fiction, or at least some of them. Locke is a ninja, knows his ish cold, and loads his lectures generously with background info and close line readings. Pretty great, the only drawback being 2 straight hours of lectures compromise the ideas sometimes, and some class feedback would have helped break it up. Dude's a star, though. \nWorkload:\nMandatory attendance. One final essay, very easy, almost a gesture.\n"
        },
        {
            "course_name": "Contemporary American Literature",
            "review_date": "September 01, 2002",
            "review_content": "\nLocke is a man whose bored treatment of the syllabus could only come from teaching the same thing over and over. He teaches the same course at NYU with few modifications and never modulates his voice. Quite honestly, the only time that I enjoyed myself in this course was when he attempted to draw a WW2 fighter plane on the board (for Catch-22) and succeeded only in drawing a huge dick. The entire class laughed. Such was the level that Locke's class reduced people to. I'll say this: the course made me reconsider being an English major.\nWorkload:\nOne idiotic paper (compare and contrast two works, kids!), one midterm and final demonstrating the same pedagogical effort as the paper assignment.\n"
        },
        {
            "course_name": "Contemporary American Literature",
            "review_date": "August 31, 2002",
            "review_content": "\nA pedantic frog of a man, Locke is wholly overrated. As many dissapointed students found, his lectures were unfulfilling, even sleep-inducing. Rather than delve into topics or themes, he chooses to tiptoe through the texts, reading (ie - dramatizing) passages and tacitly patting himself on the back for his acting. Expect a headache and a hand-ache if you try to follow everything he says, and expect a bad grade even if you do all the readings. Buy the books, read them on your own time, and stay far away from this class.\nWorkload:\nMedium. Plenty of reading, but most of it is excellent. Short stories are sometimes read aloud (in their entirety) during lecture (which is not cool for students who actually do the assignments on their own time). The midterm and final may seem ridiculously easy but the grading is... well, ridiculous. One paper on any topic. \n"
        },
        {
            "course_name": "Contemporary American Literature",
            "review_date": "December 31, 1999",
            "review_content": "\nPossibly the coolest Lit syllabus at this school: O'Connor, Updike, Nabokov, Ellison, Hong Kingston, Paley, Carver, Heller, etc., etc., etc. The reading alone will blow you away. Locke, who resembles a shrivelled muppet with very large glasses, is an extraordinary lecturer and a definite expert, especially considering that he doesn't have a Ph.D. He used to review for the Times and if you buy first editions of books published in the 1970s by a prominent author, their jacket covers will inevitably include a blurb written by Locke. He'll entertain you from the beginning with his uncanny imitations of the Southern grandmother in Flannery O'Connor's short stories. He analyzes the books in a comprehensive manner from beginning to end. One of the best lecturers on campus. Ignore his final class, where his \"overview\" basically reduces all of those beautiful lectures into juvenile summaries. He grades some of the papers, but most are graded by unknown troll-like TAs from the English department (and others who don't even belong to Columbia). Oh, and to freshmen or sophomores: wait until you become at least juniors. You don't have a prayer.\nWorkload:\nmidterm, 7-8 page paper comparing two books on the syllabus, final. Paper is graded very harshly.\n"
        }
    ]
}