{
    "prof_info": [
        {
            "prof_name": "Don Melnick",
            "prof_id": 13,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Biodiversity",
            "review_date": "December 31, 2009",
            "review_content": "\nMelnick is a charismatic lecture, if a little full of himself. The material is not inaccessible, but can be deceptively easy: for the midterm and final (which compose almost the entirety of your final grade, along with a discussion section) you have to know the concepts absolutely cold. You won't need to understand complex math or serious science, but you will be graded harshly on how well your answers adhere to Melnick's lectures. Again, the material isn't complex, but you have to have a very firm grasp on the bigger picture that Melnick wants you to understand. It seems unclear how exams were graded in this class -- as some other reviewers have commented, the A seems pretty elusive. Force yourself to go to lecture and pay at least half attention.\nWorkload:\nmidterm, final, weekly discussion section. don't bother with the reading - the only thing covered on either exam is Melnick's lectures.\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "December 20, 2009",
            "review_content": "\nBiodiversity ain't easy, folks. If you want to do well, you really have go through each of the lectures, learn the concepts, think through the implications of Melnick's concepts. While this class doesn't have homework, you do have to keep up with the lectures, which Melnick (thankfully) provides on Courseworks. The midterm was difficult in terms of time, but the final was perfectly fair: if you didn't study for either of these tests, however, you probably failed, so definitely study. \nHara Woltz was a fabulous TA for this course: she's always willing to meet and answer your e-mails about questions. If she's teaching it again, I recommend signing up for her section.\nMelnick's lectures are oftentimes filled with incomprehensible graphs and a miasma of data: don't worry about the specifics too much: just go for MAIN IDEA. Keep asking yourselves, \"What is the main idea of this graph? What is this picture trying to tell me about genetic/demographic variation, etc.?\"\nThe course, all in all, was interesting, but it's not an automatic A by any means.\n\nWorkload:\nMidterm, final, weekly section.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 31, 2009",
            "review_content": "\nHey, previous people...I though Melnick was pretty good.  You guys should have just focused on your assignments when you were doing them and you would have been find.  \nBasically, Frontiers of Science is not really about Science.  It is actually your ability to roughly write down anything on an exam that mentions something you have learned.  Then you will be fine.  All you non-science people, do not worry.  When you are doing something hard, it is not a big deal, mostly because it won't be on the exam - seriously.\n \nWorkload:\nNot bad.  Just one night of the week you'll have to think a little bit.\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 24, 2009",
            "review_content": "\nThere are several problems.  First, previous posters have indicated that reading is unnecessary for a decent grade.  Wrong.  You definitely need to do the assigned reading.  Second, Professor Melnick will spend about 15 minutes in the beginning of each lecture reviewing material from the previous class.  This is a huge waste of time.  Third, he needs to post on Courseworks the 65 page or so .ppt deck prior to the class for better note taking.  Yes, the .ppt decks are that huge.  Fourth, it is ridiculous to consider how for months we learned about cells, chromosomes, DNA, plus a lot of crazy calculations.  There were so many terms to learn.  Lastly, the TAs had to be the all time worst.  They nit-picked over every single word so that it seemed they were looking for anything to not give you a point for a particular exam question.  One of the questions on the final was if there is actually more species at the equator.  Well, I think Professor Melnick mentioned that in class or did he say that there was more species diversity at the equator?  More species and more species diversity are totally different but meant to trip us up.  Bottom line is that the TAs were researchers and graded us as such.  They were not educators looking to see if we understood the concept and grade us accordingly even though we might have messed up some of the jargon along the way.  However, I'm not sure there are any classes at this point to fill the science requirement that are less crazed. \nWorkload:\nYou need to keep memoring the terms, calculations, and definitions or you'll never make it though the class.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 04, 2009",
            "review_content": "\nIt's true the course sucks but at least Professor Melnick was a good seminar instructor.  He would spend at least a half hour of each seminar reviewing the lecture details and answering questions.  It was great if you needed the review, but otherwise it seemed like doing the same thing twice.  He was always very open to questioning, and would inquire with another professor if he didn't know an answer.  \nMore than anything else, what made the class bearable was that he was very approachable and was always willing to go further into a particular area or explain something in detail.  Through his sometimes amusing anecdotes it became apparent that he is really passionate about his field.  It seems strange that he would take time out of the many things he does in order to teach a required first year class.  It's too bad Frontiers itself is such a disaster.\nWorkload:\nUsual FoS work.  Weekly handout, often confusing.  One group presentation.  Midterm and Final.  Professor Melnick made it clear he doesn't care about grading (check +/check - etc..) as long people take something away from the class.  Try to stay engaged in class and your grade should be fine.\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "December 15, 2008",
            "review_content": "\nThis  course is absolutely ridiculous.\nWhile Prof. Melnick (a charming guy and excellent lecturer, by the way) acknowledges that he is aware he is lecturing to a group of non-science students, both he and the TAs proceed to deliver a semester full of information that is totally incomprehensible to the overwhelming majority of students in the classroom. Even with a HIGHLY curved grading process, many students actually FAILED the mid-term. \nThis class is just full of jargon, inaccessible formulas and equations, and is a wonderful way to convince non-science students to avoid any science class however possible. The arrogance, the self-satisfaction, and the refusal to tailor the class to the needs and abilities of students is shocking.\nSure, there is not much actual work to be done. That is part of the problem. The Professor smugly announces at the beginning of the semester that the grade is based entirely on the mid-term and final. Maybe that is why so many students will be failing.\nAvoid this class by all means necessary.\nWorkload:\nWhat difference does it make if you get nothing out of the class?\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "April 29, 2006",
            "review_content": "\nThe Jan. 12, 2006 review gets it all right. Melnick is a nice guy, and even sort of funny, but this class is primarily for non-science majors and moves slowly. As a result, he spends a lot of time repeating slides from previous lectures and telling the same almost-funny anecdotes that quickly become irritating. No one does the reading (it's no necessary if you go to lecture), the exams are curved but most people get B+'s so it works out, and the syllabus reviews a lot from AP Bio and other high school courses. Kind of a waste of time, but harmless.\nWorkload:\nDon't do the reading... it's completely unnecessary. If you go to lecture and can withstand the tedium, you'll do fine on the mid-term and final (which, in addition to attendance at section, are the only things that impact your grade).\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 11, 2006",
            "review_content": "\nIf you have taken ecology, AP bio, or even basic biology in high school, this class is a waste of time.  It surprised me that such a distinguished scientist would take the time to explain basic science to us.  This class is for non-sci majors, and IT SHOWS.  You can technically go to every other lecture since he reviews important themes (ie repeats the same exact slides from the previous lecture) for 1/2 hour each class.  Melnick is a cool guy who cracks jokes but he can be brisk outside of class.  He goes slow but it is not his fault; it seemed like many people did not take bio in high school.  Melnick lectured for Frontiers too and basically the whole year of this class was summed up into 4 lectures in his frontiers unit!  As easy and repetitive as the lectures get, this class is not necessarily an easy A.  After he curves the midterm and final you thought you aced, you get a B.  PROS: Cool, hip and distinguished teacher.  Pretty nature and animal pictures.  CONS: Slow, repetitive, boring at times.  Mandatory disc section with sub-par TA a total waste of time.  BASICALLY HIGH SCHOOL ECOLOGY!\nWorkload:\nNO WORK!!  Assigns readings that no one reads because it is too in depth.   Midterm and final based on lectures.  Skip ever other class!!  \n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 03, 2006",
            "review_content": "\nThis is a great class for non-science majors who need to fulfill the science requirement.  The material is pretty interesting, especially in the second half of the semester and whenever Professor Melnick talks about his own experiences working in the field.  Professor Melnick spends a lot of time talking about math, but you won't actually need to do any of this math or even have anything beyond a basic understanding of it.  I didn't use a calculator once all semester.  \nProfessor Melnick is extremely passionate about this subject, and he really wants you to understand the material.  As a result, his lectures are entertaining and easy to understand, and he gives lots (and lots) of examples.  The first quarter or half of each lecture consists of a recap of the previous lecture, and this can be tedious at times.  But all the repetition did ensure that I was really familiar with the information.  I studied quite a bit for both of the exams, but besides that I did virtually no work for this class.  Both the midterm and the final were fair.\nOn the whole, I'd say this was a pretty manageable science class with the added bonus of actually being interesting. \nWorkload:\nOccasional readings (not really necessary), a midterm, and a final (both heavily curved).  \n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "December 27, 2005",
            "review_content": "\nIf you are looking for an easy way to fufill the science requirement then this is the class for you. However, it consists of 28 of the most boring lectures you will ever have to sit through. Professor Melnick may be brilliant and is definitely a big deal at Columbia and the UN but he is a terrible teacher. Every class is a powerpoint presentation. He spends the first part of class reviewing what you did last class which is ultimately a review of the week before, ad infinitum. He uses the same slides over and over again; by the end of the class you can draw them in your notebook exactly. The discussion sections are mandatory and pointless. It is an interesting subject taught incredibly poorly. Sorry.\nWorkload:\nAbsolutely no homework. Don't do the reading, don't even buy the books, you may open them once. Midterm and final of short answers and short essays; not easy but curved like crazy. Anyone should do fine in the class\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 17, 2005",
            "review_content": "\nMelnick is a really cool guy. He is active in the international community and brings a great amount of prestige to the University at large. The seminars seem to be rather informal affairs and are not like other class environments to which I have been exposed.\nThe material extremely interesting and engaging. The lectures seem to be a vaudeville type event and are accessible. The class is structured in an interesting way and delivers breadth without too much depth. Very good for non-science majors. Not recommended for science majors though.\nThe assignments are quite manageable and in some cases enjoyable. You'll actually want to do the reading in some instances.\nVery recommendable class overall. Can get a little math heavy as they hammer out foreign concepts but definitely doable.\nWorkload:\nWeekly problem set; weekly response to discussion questions (submitted via email); question of your own that is handed in at the end of lecture (a chaotic scene to say the least); final covering all subjects pertaining to class... \ndo the homework!\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "April 02, 2005",
            "review_content": "\nIt's not so much that Don's handsome so much as that he has the most intricately designed and meticulously kept facial hair in the history of evolution.  One time he wore a brocade scarf.  He keeps his laser pointer and the remote control to his powerbook in a teensy velvet bag.  He does jokes.  He's passionate about his biomes and his ecotones, and he tells a mean story about this kelp/otter dialectic off the coast of California.  He makes you want to intern for the Earth Institute even though you're an English major. He assigns very little work, and doesn't object when his TA permanently cancels your optional section.  And then he gives easy, easy midterms and finals that ask you innocuous questions about Darwin's finches on islands and why Mendel was so brilliant.  And then he gives you a Bs on them.  AND YOU NEVER KNOW WHY.  Because you did the dainty amounts of work and went to the pleasant, repetitive classes without fail.  You thought you knew the material.  You even enjoyed yourself.  And that is why Don Melnick is so James Bondian.   You think you're having cocktails but actually yours is full of poison and his is water.\nWorkload:\nThe joke's on you, my friends.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 18, 2005",
            "review_content": "\nI have to disagree with the last review. Prof Melnick is a very cool guy, extremely approachable and nice. Sure, he did go off on tangents sometimes, but who cares... He understands a lot about biodiversity and was quite honest with us when he wasn't very familiar with what was being taught. He is far from arrogant. In fact, I would recommend being in his discussion. \nWorkload:\n4 problem sets and weekly readings + questions. No midterm... kinda weird final but doable. (one page of notes allowed)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 12, 2005",
            "review_content": "\nProfessor Melnick is so full of himself that you will never learn much at all about what you actually want to know -- just about what he does and what he is interested in talking about that day.  I found myself wanting to say to him \"dude! we are Columbia students who really do care about the subject matter!  Get off of your arrogant self!\"  However, over and over, he would bore us with his little stories about himself, his own studies, his trips to Bangkok (because the first thing he will tell you is that he is part of the committee for the UN committee for environmental stability).  He was cool for about a minute and a half... but then I instantly found myself being bored to death in this class I was required to attend.  He would always remind us that we were lucky to have such a professor who is top in his field... but guess what? we weren't.  He taught us nothing, was generally unfriendly, and was a difficult, picky grader.  My favorite comment of his was: \"Among all of the other things I'm good at, I'm a GREAT editor\"... please! spare me!  spare yourself from such a haughty, arrogant man being a part of your life twice a week.  I would have much rather have had a TA or a graduate student. \nWorkload:\na lot of little assignments (pretty ridiculous and tedious actually)... felt like high school, 4 problem sets, class participation, and a final\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 10, 2005",
            "review_content": "\nDon Melnick has so much to offer. Aside from being a brilliant ecologist, he's also a very respected member of the United Nations' millenium development project. Because of his experience working outside of academia with business leaders, politicians, and the general public, he's one of the best \"communicators\" you'll ever work with. No matter what your background in ecology is, after taking this class you will really understand the fundamental principles of ecology and the forces that maintain and destroy biodiversity. You'll take from this class what you put into it; while you can get away with slacking off and getting by with a grade that won't wreck your GPA, if you really invest yourself in it Melnick's class can change the way you look at the world. Melnick is more than a \"James Bond,\" as one reviewer put it: he's one of the true champions of conservation and sustainability. \nWorkload:\n2 Exams, heavily curved. Weekly readings that no one really seems to do (they're not so great, really; his teaching is the real lure in this class)\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 06, 2005",
            "review_content": "\nPainfully repetitive lectures- each one would almost completely repeat the previous class' spiel before embarking on its own, and even those would often contain the same information we'd be hearing again and again. Despite the persistent drilling of information into our heads, there seemed to be a glass ceiling on both the midterm and final- impossible to achieve more than a B+ without having brownnosed the TAs by attending their non-required review sessions buried deep in an inaccessible recess of Schermerhorn Extension. Very little work, lectures which rarely requied attendance, but very little chance of getting a more-than-mediocre grade, for whatever reason.\nWorkload:\nExtremely short readings which parallel repetitive lectures and therefore are both repetitive themselves and unncessary, plus midterm and final (short answers and essays for the most part; math questions, unusually difficult considering the material covered in class, avoidable).\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 05, 2005",
            "review_content": "\nA great course for non-science majors.  You will begin to understand the basics of genetics and environmental science.  You will also learn how scientists are literally \"saving the world\" through environmental and biological sciences.  These issues are very current and urgent, and this is a worthwhile course for those who are looking to fill a science requirement.\nWorkload:\nMidterm and final, but NOT multiple choice.  You actually get to write answers and short essays.  You'll do fine, trust me.\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "January 02, 2005",
            "review_content": "\nEssentially this class is designed for people who like to walk into class thirty minutes after it started.  Melnick spends half of every class going over the same goddamn Powerpoint presentation he did the week before.  Some slides he repeats in every single lecture.  He truly comes from the school of boring you to death with repetition until you internalize the information.  Other than that caveat (I guess it's not a caveat if it he teaches a morning class, you can sleep in an extra half hour every day).  As far as material, it's the perfect science requirement course because it gives you a basic knowledge of the two most important issues of the next 20 or so years:  genetics and the environment.  And to his credit, Melnick does a solid job of introducing these topics and why they matter.   \nWorkload:\nDoes not exist.  Midterm/final only.  On a generous curve so that even if you're fairly lazy you end up with an A- or B+.  \n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "December 21, 2004",
            "review_content": "\nThis is an easy class and you will come away having learned things that you will remember for a long time. Part of that comes from Melnick's incessant repitition of certain ideas and concepts. This can be boring at times, but i think it really works in drilling important  concepts into the class's brains. He is a dynamic lecturer, and the material he covers is interesting. Put up with the bits of math, you don't have to understand it, as there is plenty of choice on both the tests (on the final:  answer 20 out of 30 short answer Q's and 4 out of 8 essay Q's), and you can completely avoid the math questions. You learn a lot about the environment, biological diversity, the world's ecological problems, and possible solutions. I definitly recommend this course, especially if you have an interest in the environment.\nWorkload:\neasy. readings that you don't have to do. midterm and final that are both damn easy and curved. go to the lectures, take notes, and you're set.\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "December 04, 2004",
            "review_content": "\nBeing a non major in science, I have found this class an uphill task and a complete misery. There is a fair smattering of math involved (even though we are told that we dont need to worry about the details) and Prof Melnick rarely works through the derivations with us. The lectures are coherent, fairly clear although I get the distinct impression that asking questions in class is not encouraged jusding by Prof Melnicks brusque manner when one is asked. I have found the recitation sessions with my TA to be more helpful than the class. She is willing to spend as much time as required to help me go over the concepts. I would fail the course despite having done the readings, attended all the classes, if it had not been for my TA and her help in understanding the concepts. Even though this is meant to be a class for non science majors, I wouldnt advocate this classs. Take Physics 101 if need be- on the more positive side, grading is ridiculously lenient. so u can expect a C for an almost failing grade as I have done!!\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "September 18, 2004",
            "review_content": "\nI went to the first two classes, and after that I dropped, because it was all but impossible to stay in the class.  Most of the class consists of material you learned in high school and, yes, even grade school, and Melnick teaches it as if you're still at a very basic level.  They call this a \"science for nonscientists\" class, but I'd call it a class for idiots.  Maybe at another college, it would have been appropriate, but at Columbia it's truly ridiculous to be wasting students' money on this course.  If you actually want to learn anything, don't take this course.\nWorkload:\nRidiculously easy -- 15-20pp of reading per lecture, midterm and final.  Your grade depends completely on the exams.\n"
        },
        {
            "course_name": "Biodiversity",
            "review_date": "December 01, 2003",
            "review_content": "\nMelnick is the James Bond of environmental science. He is always well-dressed, always has immaculately trimmed facial hair and is inhumanly punctual. You need no background to succeed in and enjoy this class. These are the type of classes that make you say \"oooh, I get it now\" when the lectures are through. This class teacher you how the world works. Going to every lecture is important or you will fall behind on material. The Midterm and Final cover a crapload of material- but doing a good review of your class notes should be enough to score you at least in the B range as the tests are extremely curved. Don't sweat being late to class, or e-mailing the professor with questions. The atmosphere is extremely laid back. This was by far the my favorite class this semester.\nWorkload:\n1 Midterm, 1 Final, readings for every class that aren't necessary for succeeding on Midterm and Final\n"
        },
        {
            "course_name": "The Human Species: Its Place in Nature",
            "review_date": "December 31, 1999",
            "review_content": "\nIntelligent, focused and well-dressed. As an important leader in the field of Environmental sciences, Melnick is an eco-pimp. Class participation is not valued or encouraged in large classes, a fact disceranible by his visible discomfort when answering the occasional student question. The Human Species class is a relatively painless way to satisfy the science requirement and leads into the Behavioral Bio course as a sequence. A fair amount of time is required to memorize time-lines and genus/species names. Still, his interest in the field and tight organization makes it a good class. The textbook is reminiscent of High-School science (margins loaded with definitions, pictures and the occasional illustrated guest essay).\nWorkload:\nMidterm and Final exams.\n"
        }
    ]
}