{
    "prof_info": [
        {
            "prof_name": "Terence Pender",
            "prof_id": 1586,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "MIDI Music Production",
            "review_date": "September 24, 2003",
            "review_content": "\nTerry Pender proves that there is life after majoring in music!  He has a huge understanding of recorded music and the recording process, and you'll learn alot of the history behind recording, as well as MIDI production.\nWorkload:\nFinal project (anything goes).  Don't take the class if you don't want to schlep up to 125th.\n"
        },
        {
            "course_name": "Recorded Sound",
            "review_date": "May 12, 2003",
            "review_content": "\nWell, I still learned a lot, but this wasn't the semester to take it, since Terry spent much of it in the hospital. As a result, the class didn't cover nearly as much ground as in past years, since he and his sub Graeme White overlapped a lot. None of this is Terry's fault, though, and as long as he stays in good health, this will go back to being an awesome course. The nice thing about Terry being only an adjunct, as a previous reviewer was complaining about, is that he's available to help you out all day, every day. And he will, too. He's such a nice guy, knows everything, and is excellent at imparting what he knows. This class is a great resource, and a must for songwriters and composers. (Plus you get use of the Prentis studio till you graduate!) Get on the waiting list now.\nWorkload:\nJust showing up is enough to get an A, but you'll want to give it your all because you're working on your own music.\n"
        },
        {
            "course_name": "Recorded Sound",
            "review_date": "May 03, 2003",
            "review_content": "\nTerry is a sweet and brilliant man who should be chair of the music department but is instead relegated to being technical director of the Computer Music Center.  It's a testament to how screwed up Columbia's teaching priorities are that Terry is only an adjunct and draws his main paycheck from fixing speakers and mixing boards, especially since the man has a doctorate in composition from Cincinnati Conservatory and is one of the best performing mandolin players in the country.  The class is based on learning Pro Tools and recording music yourself in a studio up on 125th Street.  Along the way you learn about music production and things like microphone technique.  Terry is also a fountain of information about music history (both pop music and classical) and you might find that you learn more about music in this class that you did in Music Hum.  He's also always available to help and will gladly spend an hour (or more) hanging out with you and talking about your creative ideas.  The class is incredibly hard to get in to (like everything at the CMC) and you run the risk of getting bumped by a grad student, so get on the waiting list now.\nWorkload:\nYou spend the entire semester working on a creative music project of your own.  Along the way the class does team recordings of Beatles songs in class, which are used as a foil for Terry to talk about the day's topic.  As with all the CMC classes, you will get an A if you show up and are interested.\n"
        }
    ]
}