{
    "prof_info": [
        {
            "prof_name": "Susan Charlotte",
            "prof_id": 280,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style II",
            "review_date": "May 27, 2002",
            "review_content": "\nSusan Charlotte insists on having all the workshopped pieces read aloud in class, which serves the dual purpose of wasting time AND pissing everybody off. The best part of this class are the days when she wears her Sir Walter Raleigh-esque blouse. Oh heck, most S & S sections are pretty terrible. At least you can tell amusing stories about this one.\nWorkload:\nstory, poem, play; mandatory pinter enjoyment every other week\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 30, 2002",
            "review_content": "\nI found Prof. Charlotte to be an incredibly inspiring teacher. She opened my eyes to new writing methods that helped me to better articulate my ideas. Every class, approximately three people would have their works read aloud and afterward Prof. Charlotte would provide constructive criticism that was never humiliating to the writer. Some people apparently did not appreciate her stylistic advice, but if you followed her guidelines you found that your writing was definitely improved. I recommend this class whole heartedly.\nWorkload:\nAbout one assignment per week and a final project. But it's fun work!\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 15, 2001",
            "review_content": "\nIf you like being force-fed 5-step formulas for great short stories and think that creative writing can be reduced to a limp set of tired maxims, then Susan is definitely the professor for you. Be prepared for her skeptical attitude toward anything that doesn't sound like watered-down Pinter. Workshopping tends to be nasty, brutish, and long, with people trashing other people's work at will until Susan at last sails in with a final judgment that admits no argument. An English professor of mine once described Susan as \"Fascistic,\" and her assignments reflect this quality, even by the standards of S&S.; Assigning a description is one thing; assigning a description of a lake from the point of view of an e.e. cummings \"is 5\" character who has just killed someone is quite another. The class does not seem to be a priority for Susan. She frequently misses appointments and \"loses\" assignments--or when she doesn't lose them, can take anywhere from a month to never in getting them back to you. Of course, never is often a good thing. Apparently, Susan's writing credits include both GUIDING LIGHT and LOVING, and believe me, the class is held to the same stratospheric level of artistic achievement.\nWorkload:\nLight, yet surprisingly inane.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 13, 2001",
            "review_content": "\nSusan is a wonderful woman, a real big playwright, who loves teaching writing. She comes up with some innovating, amazing assignments. Only problem for some was that she doesn't really make deadlines hard and fast; you never know when she's going to make something mandatory and something else optional (give it a try etc.). Obviously for some this is better than others. Light workload, interesting assignments, wonderful, capable instructor (who, incidentally, works at NYU and is difficult ot get in touch with at times).\nWorkload:\nRegular S+S, maybe a bit less.\n"
        }
    ]
}