{
    "prof_info": [
        {
            "prof_name": "Naomi Weinberger",
            "prof_id": 917,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "September 01, 2006",
            "review_content": "\nI am very surprised by the reviews that claim this class to be \"the class\" for learning about the Middle East.  As someone who has studied the Middle East for a while now, I have to totally disagree.  Here are the positive aspects of the class: no big surprises on any writing assignments or exams.  If you work hard and study what she tells you, you will certainly get a good grade.  Also, she is VERY knowledgeable about many aspects of Middle Eastern politics...VERY.\nHOWEVER, she is possibly the worst lecturer I have ever come across.  I did not take any notes all semester, though not by choice.  I simply could not follow any coherent point in class.  The only day I have good notes from is the day that the TA lectured.  Lectures were truly painful and she often takes attendance.  It is interesting material, but she somehow makes it seem terribly boring.  \nOverall, the lecture was a complete waste of my time, and I want those hours of my life back.  However, the readings were often quite good (you don't have to do any until you know what your paper topics are, but there is a discussion section to prepare for).  \nThe readings, the syllabus, the papers, etc were all well-\nplanned and interesting, but the lectures (essentially, \"the class,\") made me want to jump out of Hamilton.  If you want a great class to learn about the Middle East, avoid this course.  If you want a relatively fair and somewhat easy-to-manage class with some interesting reading, then go for it.  \nWorkload:\n3 short papers and a final (w/ or w/o taking home the essay portion)\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "March 10, 2005",
            "review_content": "\nI totally agree with the previous review. There are much better classes to take on the subject as pointed out before.\nProf. Weinberger is a wonderful person but she might well be the worst lecturer the world has ever seen--she gets sidetracked all the time and loses herself in details that seem to have little relevance to the class as a whole..I don't know--the class was a relatively easy A but frankly, I would rather take Khalidi or the graduate student that has the reputation to be really smart and really tough El Gobashy..also in my opinion the class is biased toward the Israeli-US side which would be fine wasnt there the claim that the class was neutral and there are NO conflict resolution mechanisms etc. taught whatsoever--it is basically a history course (and there we should go to khalidi and the history department)...I dont recommend this class at all..even if the grading was super lenient the lectures are too painful to get through..\nWorkload:\nnormal: take home midterm--fairly demanding final that asks you to answer question types that you have not seen before in the semester--annoying but manageable discussion board postings that can get you 5 extra points though if you do them regularly\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "January 18, 2005",
            "review_content": "\nFirst, if you are interested in conflict resolution, look elsewhere-this is really just a slightly confused overview of the middle eastern region, history and politics. Also, try el-ghobashy (fall) or Khalidi (spring) instead if you want a more rigorous introductory look at the region. \nThe structure of the course: first half was a week-by-week look at different countries of the middle east. second half was on the israeli-palestinian dispute. Readings are a selection from main texts and coursepacks. In general they are pretty flimsy; a few are good, but many are a bit pointless or really lacking in information, depth or interest-value. Some people struggled because they had no background work on the area and couldn't manage to write the midterm or final without extra reading to provide background and depth.\nWeinberger is absolutely lovely and friendly, and tries to make it all exciting, but the class often feels like high school and the paper topics on the midterm and all the final topics were poorly structured. If you want a brief glimpse into the region, the class is fine, if you want anything intellectually challenging or thought provoking, avoid. She begins every class telling you how unbiased she is and we must be, which really means the vast majority of the material on israel-palestine is presented from the standard US israel-sympathetic perspective. This is fine, and hardly ground-breaking, but be prepared for such an avoidance of controversy that the lecture material is often dull and unsurprising. It also sometimes is rather rambling. The TAs are excellent, however (see section on Joseph Parent), and section provides some fun discussion. \nOverall, the class is just a bit unsatisfying, and Weinberger kind of over-enthusiastic but a bit lacking. She has a tendency to get very passionate and run off on tangents, without really saying anything particularly relevant. But, grading is VERY sympathetic.\n\nWorkload:\nstandard. readings are medium-heaviness, but you can get away without doing all of them if you know anything about the region until exams. midterm - take home, two papers each 1000 words, questions well in advance. final, 3 hours, in class, one long essay (1000, can be take home), two mini essays, two role plays, two quotations from the reading. heavy reliance on discussion board online for debate and extra credit-easily got.  grading is fairly easy, and she tells you the finals questions (gives you a list of possiblities) long before (and constantly reassures you about them). not hard.\n"
        },
        {
            "course_name": "The United Nations and International Conflict",
            "review_date": "June 17, 2004",
            "review_content": "\nI agree with most what was said about this professor already. If you are considering taking her class, no matter which one, be sure you know at least something about Middle East. Although she desperately tries to be coherent and organized, she presents new material in a very scattered manner so that at the end of this three-hour class I got totally lost in details of so many case studies. She once mentioned her first experience in teaching that after her first class somebody said that she cannot really teach. I think it is still true today. A detailed knowledge of Middle East does not make one a great teacher. Especially when a teacher asks other students about African countries that she lacks knowledge about. She also have a tendency to bring into the discussion cases that are not at all on the syllabus. She asks questions on them and you feel a complete idiot, because you have not even heard that there was such a case. Also, I really liked the discussion board questions, but the midterm topics were boring and not interesting (e.g. how much credit does the UN get in the process of decolonization? I think it is 35%--- Stupid questions deserve stupid answers. The readings are nice and interesting at times, but with the case studies like East Timor or Sierra Leone you really get lost in details and feel like the readings are not enough, so I had to go to some more material to get the grasp of the problem. \nOverall, the class is not really difficult, but I am not sure what I got more of it: a bogger mass or knowledge.\nWorkload:\ntwo papers --take-home midterm exam, final in class, doable amount of reading, but you will need some more to do on your own, if you do not have a strong background in the Middle East and Africa.\n"
        },
        {
            "course_name": "Comparative Politics Seminar: Regime Change in the Middle East",
            "review_date": "May 13, 2004",
            "review_content": "\nThis was a good seminar, but i felt like it didn't have the coherent thrust that it could have had.  We started off by asking \"What is Regime Change?\" and i'm not sure that we continually referred back to that question enough.  The whole point of a seminar of course, is the paper, and this one is a little overwhelming.  I got the sense that no one really knew what they wanted to write until about a week before it was due.  But it was okay, Weinberger is very knowledgeable, relaxed, flexible. Definitely recommended.\nWorkload:\nReading three articles a week, two brief presentations, 20 page paper (and various annoying deadlines regarding the paper which no one paid much attention to).\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "April 27, 2004",
            "review_content": "\nAlthough she gives a strong positive first impression, Naomi Weinberger should be avoided if it all possible.   She was a poor choice to teach this course, as she knew nothing about the majority of countries we studied (this is not an exaggeration, she freely admitted it).  Which begs the question, why go to class when the professor begins by telling you that her knowledge is limited to the weekly readings? She taught the course in a manner that presented each government and nation (other than Israel) as corrupt and backwards.  However, she managed to convey this message subtly enough to keep students from being aware of her agenda.  Furthermore, many of our readings were essentially glorified propaganda pieces.  This is a very dangerous way to teach a class, especially one as topical as Middle Eastern politics.\nFinally, she's extremely unfriendly and inaccessible outside of the classroom.  She often ignores emails and refuses to make time to meet with students.  If you want a recommendation from her, ask as far in advance as possible as this woman is truly the kind who will never do a favor for anyone.  For the record, I received an A- in the class and was well liked by Weinberger, so my gripes with her aren't based on any kind of personal bitterness.  I was appalled by the way she treated many of my classmates, however, and by her unbelievably biased teaching style.  If you are considering taking this course, i beg you to first take something else to introduce you more fairly to the region.  \nWorkload:\nWeekly readings, take home midterm and an in class final.  Basically a standard workload for this type of class.\n"
        },
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "December 17, 2003",
            "review_content": "\nProf. Weinberger is quite simply the best political science professor at Columbia.  This class is exceedingly good.  There are some countries that she doesn't know about, but she makes up for it with her ridiculous knowledge of Israel, Palestine, Jordan, Syria, Egypt, and Lebanon.  Most importantly, she cares tremendously about the class and her students.  If we had more professors like her, the University would be far better off.\nWorkload:\ntake-home midterm, half-take-home final. lots of reading, that is necessary and good.\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "January 20, 2003",
            "review_content": "\nTHE COURSE to take if you want to know anything about the Middle East.  Period.  The degree of fairness and impartiality that Dr. Weinberger brings to the table is outstanding, and certainly refreshing in light of the outspoken bias of other professors at the University.  She brings all views to bare, careful to point out the biases, and her entire goal (as she states numerous times) is to get you to a point when you'll be able to think for yourself.  I would even venture to say that she is the best prof you could take on the field.\nWorkload:\nJust pay attention in class and you'll do fine. There is a whole lot of reading, but she realizes you can't do it all.  Take it from me though: you should start reading early, because it adds a whole new dimension to the course.\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "December 25, 2002",
            "review_content": "\ncourse subject is totally fascinating and covers a huge amount of material. Weinberger is unbiased and brilliant, but scattered. She gives out organized outlines, but rarely follows them. tries to cover too much material and rarely finishes a lecture. the reading list is incredible, and sections were interesting, but you will only understand much of the lectures if you've already done the reading or have some background, because she is disorganized. She will also assume you have knowledge of the subject and spent most of the time asking rhetorical questions but not really telling you concrete facts.\nWorkload:\nlot of reading, but no one expects you to do all of it. take-home midterm (2 questions, 5 pgs each), and final (on a lot of information but easy if you study).\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "January 23, 2002",
            "review_content": "\nGreat introduction to the topic. You don't need to do all the reading - stick to Tessler and then read what you need for papers/final. Animated, dynamic lecturer. Knows her stuff cold. She's overcommitted & is therefore not always easy to meet with. If you don't like her drone TA's grade, she'll regrade for you. You'll learn a lot if you don't have much background on the subjects covered. Interesting readings and paper topics.\nWorkload:\nTwo papers, about 7 pages each. Comprehensive final, with most of the questions given out in advance. Discussion sections are helpful for your grade.\n"
        },
        {
            "course_name": "Conflict Resolution In the Middle East",
            "review_date": "January 20, 2002",
            "review_content": "\n\nWorkload:\nThe reading is theoretically  enormous, but, if you go to class, it`s  not really necessary. Two papers are  assigned, both 5-7 pages. No  midterm. The final is essays and  short answer, 2/3 of which are given  to you word-for-word beforehand. If  you work hard on the assignments  you can get an A without killing  yourself. A B is a gimme in this  class.\n"
        }
    ]
}