{
    "prof_info": [
        {
            "prof_name": "Lauren Ninoshvili",
            "prof_id": 2763,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "February 06, 2006",
            "review_content": "\nAll I have to say is that I studied an entire weekend for our second midterm and got a grade 2/3 of a letter lower than the first midterm, which I did not study for at all. Ninoshvili's lecture style is pretty straightforward and boring; unfortunately the stuff that she doesn't bring up but once is what makes it onto the exams, and the terminology that is stressed to you as being important is often overlooked. If you are a musician, especially a nonclassical one, I do not recommend enrolling in her section, as her explanations of musical concepts are shaky and she pays nitpicky attention to exact terminology.\nIn terms of the concert journals, she is a very lenient grader. She'll pretty much give anything an 'A'. Also, her time slot is abbhorent: the last thing I wanted to do at 6:10 in the evening was listen to her lecture.\nOverall: Ninoshvili is pretty harmless, if not slightly incompetent. Try and get someone else if you can - the subject matter is actually pretty interesting, but she fails(i don't think she even tries) to bring it off of the textbook page.\nWorkload:\nLight. Doing the reading is unnecessary(in fact, I didn't even buy the book; she lectures right out of it). 5 concert 'journals' that don't have to be more than 3 pages each.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 27, 2005",
            "review_content": "\nIt's music hum.  Most of whether you like it is probably subjective.  She's a good enough teacher that if you like this sort of thing, you'll like the class; if you don't, you'll learn something anyway.\nShe's a good lecturer, but it was hard to figure out what was of what she said was important to write down and what was not.  She would put really important stuff on the board.  The five concert reports weren't too bad- Manhattan School of Music is at 122nd and Broadway and they have a whole bunch of free concerts.\nOverall, I guess I'd recommend this class.  The fact that there were no research papers was really good, and she graded the concert reports leniently (and the first one of the five was a practice one, basically).  Five concert reports is a lot, but you can seriously write about anything, ignoring musical detail, and get A's or A-'s on them.\nOn the other hand, there are probably other music hum classes out there with less work required.  I learned a fair amount and had a good time at the concerts, but this is not a class for the lazy man.\nWorkload:\nTwo midterms (tricky to study for, but they're not too hard) and a final (just like the midterms).  5 concert reports (2-3 pages each).  No papers.\n"
        }
    ]
}