{
    "prof_info": [
        {
            "prof_name": "Steven Baker",
            "prof_id": 5247,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 08, 2016",
            "review_content": "\nTook lit hum with Prof baker in fall 2015 and Spring 2016. \nI came in this class so out of place. Having not done much literature in highschool( am an international student), I was way behind my peers in regards of writing and literary skills. I remember shooting an email to him before even 1st class making him aware of where i stood. He worked with me and encouraged me to speak up and try. Started with a not really great first paper and ended up being the author of one of the best papers later in the course (his words). All due to guidance, encouragement and wisdom from Prof steve.\nHe is a very fair grader and you would never feel he wants to deduct points. He will be on your side, \"always\"(shameless Snape plug). In the class discussions he loves to listen to students discuss but has a plan for every class himself. You would never feel singles out but also could speak up your mind.\nI was very shy at the start but my confidence constantly grew under his supervision. Outside the class too he's one of the most genuine people I met at columbia. I would even go on to say a rare kid breed on this cut throat campus. He would listen to you enthusiastically in Office hours and could even help you plan out your full papers with him. He is a very unique sense of humor that keep class from being a bore but also not go off the hinges.\nHis exams are beautifully made and biggest pro of all , you can take on any idea and interpret it in your own way. There is no set mind map that he expects. I wrote papers exploring topics that hit me deeply and brought in current times as well as dark stuff at times and he appreciated it instead of criticizing.\nAny first year that got assigned to prof Baker is very lucky. In no time it will be the day of final and you will feel sad as you hand him your final exam and say Goodbye to one of the kindest people you will ever meet who will look at you like he sees potential in you.\nWorkload:\n3 papers each semester. A midterm and a a final. Some in class quizzes (sometimes for credit sometimes not)\nAnd participation .\nTotally manageable.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 24, 2015",
            "review_content": "\nI really have little to say about Professor Baker than that he is as close as you will get to an IDEAL LitHum professor.\nDoes he know what he is talking about? \nYes\nIs he passionate in class?\nAbsolutely\nIs he the kindest professor on campus? \nSurely\nAnd does he give fair grades?\nNO (he gives everybody much BETTER grades than we really deserve)\nIf you have professor Baker as your Lithum professor, you are blessed indeed.\n\nWorkload:\nAverage for Lithum.\n3 essays (use in depth analysis and you will do fine)\n"
        }
    ]
}