{
    "prof_info": [
        {
            "prof_name": "Patrizio Ceccagnoli",
            "prof_id": 2751,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian II",
            "review_date": "December 22, 2010",
            "review_content": "\nI don't know why this guy has so few reviews written about him.  He seriously deserves at least a silver nugget.  \nEveryone jokes about the easy A curve that's set for all Italian classes (and many Romance classes altogether, for that matter).  Patrizio is not that teacher.  He makes you work for that grade - and though you may hate him for it in the moment, you appreciate it in the end.  I learned more in this semester of Italian than I ever have in my life.  I was FORCED to research the culture, to actually prepare for my oral exams, to study for big tests, to participate and ask questions in class... and I walked out so much more confident in the language and my ability as a speaker.\nTake Patrizio.  He's bright, charming, absolutely hilarious, ridiculously understanding, and an incredible lecturer.  He loves his language and his students.  Not to mention, he's not bad on the eyes.\nWorkload:\nWeekly composition (not bad: c.300 words); nightly homework (heavy; you don't have to do ALL of it but should, because if not it makes him sad :-(); midterm and final with oral and written sections just like every other class.  Participation is strongly considered in calculating your final grade.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "September 07, 2008",
            "review_content": "\nPatrizio is one of the best Italian instructors Ive ever had. His classes were truly a joy to attend, and even though I took his Intensive course during the summer (meaning that class was held every day) I looked forward to every class. Unlike the previous reviewer, I felt that he went at the perfect pace -- if people had questions about old material he would go over it, but not extensively and never to the point that we didn't review all the material we set out to review. He is always open to answering any questions you may have, before or after class. Beware, he definitely doesn't let you slack off during this class -- be prepared to be asked a question as soon as you start to drift off (he seems to have a sixth sense for that). Overall, the workload was decent, it was a summer class so it was obviously a little more intense than the regular semester -- but I highly highly recommend this professor!\nWorkload:\ndaily homework (heavy at times- but I had him during the summer semester), a quiz every week, a midterm and a final. Quizzes and midterm/final not hard at all -- just a little long (he includes a writing section in every quiz which can take awhile)\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 23, 2005",
            "review_content": "\nPatrizio is a really cute, sweet Italian guy who is always accessible to answer any question and help you on anything you need, no matter how basic your question may be. This is both a strong point and a weakness for him, because his generosity with taking questions and reviewing old material slowed down the pace of the class, in my opinion. Though we covered the material that Patrizio had set out to cover, I lost motivation quickly when the pace slowed down, and was really let down when I realized we wouldn't be learning the future tense by the end of the semester. This may be a fault of the curriculum as designed by the department, and not by Patrizio, though I'm not sure. Either way, Patrizio is great with helping you get used to listening to the language and understanding the grammar and pronunciation, since he's a native Italian. His English needs work, but that can be expected of any recent immigrant. \nWorkload:\nProbably the same as any other Italian 1 class -- weekly collection of written and listening excercises. Quiz each week (usually very easy and straightforward). Midterm and final, each like a long quiz.\n"
        }
    ]
}