{
    "prof_info": [
        {
            "prof_name": "Alyssa Masor",
            "prof_id": 1900,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "YIDDISH- ELEMENTARY",
            "review_date": "December 19, 2004",
            "review_content": "\nThis is a great class if you are looking for a new language to learn and you want an easy workload.  She speaks Yiddish pretty much fluently throughout class- but is willing to explain things as often as you want and in English. She really has a passion for the language and she wants you to feel the same way as well. Class is long, but then again its a language class.  Make sure to participate! If you can try and take this class with people you know- that  really makes the class more enjoyable. She also likes to do alot of creative games to learn the language. For example, we played go fish in yiddish.  She is also very helpful- take advantage of her time!\nWorkload:\n2 yiddish movies- not hard at all- all you have to do is watch it and write a one page summary to make sure you watched it- really really really NOT a big deal.  Homework every night- but it isnt so bad-  and we have 2 quizes - but you can always make corrections and then she averages the scores- and two essays - same deal as the quizes. take home final- can do it with someone! If you are looking for a relaxed  class, with an easy workload- take this class! Your chances of getting an A is very very high!\n"
        },
        {
            "course_name": "Elementary Yiddish I",
            "review_date": "December 28, 2003",
            "review_content": "\nKhane is awesome.  She only speaks in Yiddish in class and has her students do the same, unlike the other Yiddish instructors.  The class is long, but she always tries to incorporate fun activities into the lessons (to learn family roles, she brought in the Simpsons family tree).  She is extremely approachable, and her number one gaol is that her students learn and love the language.\nWorkload:\nA few easy quizzes that you can correct for a higher grade, 3 short compositions that you are allowed to rewrite, 2 movie reviews, very short homework every night\n"
        }
    ]
}