{
    "prof_info": [
        {
            "prof_name": "Ana Garces Kiley",
            "prof_id": 3311,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Drawing",
            "review_date": "September 03, 2008",
            "review_content": "\nAna is obviously very smart and believes in what she teaches. Almost everything she says is valuable in some way, whether you agree with her assessment or not-she's very good with critiques. But she lets her own tastes rule and can sometimes come up with a pretty big load of crap about a pretty crappy piece of art. She's a good instructor for teaching you about your personal taste because of that, though. A class worth taking, and definitely definitely look up her artwork because it enhances the classroom experience like you wouldn't believe.\nWorkload:\nOne-page drawing assignment every other class or so, very chill in-class drawings and critiques for the midterm and final. \n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "September 25, 2007",
            "review_content": "\nI don't know if Ana Garces is even an artist in real life. Sure, she dresses like she's straight out of Greenwich Village, wears thick-rimmed Trelawney glasses, and seems to know her stuff, but we only ever saw art samples from past students rather than any of her own. Honestly, her suggestions were often helpful and she did attempt to aid students in building specific techniques that would improve the overall effectiveness of their drawings. However, it immediately becomes clear that she is much more attracted to the psuedo-abstract, meaningless junk that the more confused students of the bunch spit onto paper and pass off as masterpieces. If you're more straightforward or you actually know what you drew, it might be a good idea to wait for another section or just cling to the TA.  She also makes a point of trying to explain to you what you meant in your art and what you say about it is irrelevant. Grading is based more on progress(which means telling lots of lies,lies,lies) and being abstract (but not ironic, I think she hates that), rather than actual drawing ability. Overall, it's not a total waste of 2 and a half hours, but it made kill your actual enjoyment of art.\nWorkload:\nIn-class and out-of-class drawings every week (including outside campus drawings during class), midterm and final that include out-of-class components, group critiques every week, possibly a minor field trip\n"
        }
    ]
}