{
    "prof_info": [
        {
            "prof_name": "David Kittay",
            "prof_id": 9504,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Interpreting Buddhist Yoga",
            "review_date": "December 11, 2016",
            "review_content": "\nThe best teacher I have every had. Probably one of the most inspiring people I have ever met. His ability to engage with class discussions and stimulate an open environment created a sense of community that fostered the best in-class discussions I've ever had. The chemistry of the class is unbeatable when Kittay is your teacher. He's just the smartest dude ever, I swear to God, he knows everything about anything and is so willing to share this knowledge with you. He's open, kind, smart, and brilliant, everything a student could look for in a teacher. If you're debating whether or not you want to take one of his classes, at least go to the first seminar because you will not regret it and will see everything I've described here. \nWorkload:\nweekly reading (heavy), 2 discussion posts/week, 1 midterm, 1 final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 19, 2013",
            "review_content": "\nI am so grateful I got to take CC with Professor Kittay in 2011.  He values the seminar format. He actively creating an environment where every student contributes:  He created an open and listening class environment. This was great, because my CC class was filled with really interesting, engaged, brilliant students.  This is probably true of all classes, but since he knows how to draw people out, I actually got to benefit from their contributions. We really heard each other's ideas.  Over the summer, those of us who were in New York had \"potluck\" reunions.  I am convinced that the chemistry in the class can, in large part, be attributed to Professor Kittay's open-mindedness and genuine interest in our impressions of the texts and of the world. I think that everyone, though they didn't necessarily go unchallenged, felt validated by his open-minded listening. He is truly respectful of each person. Professor Kittay's class engages you beyond your intellect. He's interested in YOU, and your impressions. He is very intellectually smart, and knows what the texts are really saying, but, like a reviewer below said, he doesn't spend too much time on the nitty gritty of the texts. He brings them to a practical level. A super interesting, innovative thinker. You do get the intellectual history, but also, what I tried to explain above.  \nI was allowed and encouraged to write papers about topics that really interested me, and through writing them I learned a tremendous amount. I needed to hand in one paper late, and he accepted it without reprimand, (in fact, he was more calm about it than I was) with only a half-grade reduction. \nIt was an enjoyable and awesome CC experience.\nWorkload:\n2 papers,\n 1 final\n"
        },
        {
            "course_name": "Contemporary Civilization; W3491 U.S. Foreign Relations, 1890-1970; W3900 Historian's Craft",
            "review_date": "July 03, 2012",
            "review_content": "\nI don't understand why Professor Kittay doesn't have more culpa reviews. From my experience, people in the class and ex-students have a lot of (mostly positive) things to say about him... I owe it to Professor Kittay to encourage future students to take his class.\nKittay wants to be your friend. Which is good, because he's a really sweet guy and you're going to want to be his friend too. He is very invested in what every individual person has to bring to the table, and cares more about our personal experiences than the texts themselves (which is a good thing, since CC texts can be dry and overly complicated at times). Rather than get hung up on the details of the texts, Kittay wants us to develop our own voices as thinkers. Instead of two papers, he asked the class to write a 15-20 page paper in which we developed a personal philosophy regarding a topic of our own, much like one of the authors we read would have. And although this  seemed formidable, it ended up being interesting and he was very open to different types of writing. That basically sums up Kittay's attitude: flexible. \nThat being said, this isn't a lecture-style class like some other CC sections. If you are looking for a professor that will spoonfeed you all the material in the book and prepare you for technical exams, this is not the right class for you. If you, like me, want to learn about the texts but also a lot more about why these texts matter, take Kittay's class.\nBottom line- Kittay is great. He is approachable, extremely intelligent, and knows how to keep a conversation going. You'll come out of his class feeling like you know a lot more about yourself and your classmates than you thought CC could offer.\nWorkload:\nAverage. Heavy reading every week (do them-- he sometimes has surprise quizzes and it really bothers him if people don't do the reading.) \nMidterm & Final 25%\nPaper(s) 25%\nClass Participation 50%\nOverall a pretty reasonable/lenient grader. I got an A in the class and I'm sure most of the class got in the A range as well.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 20, 2010",
            "review_content": "\nI know it's mid-semester and not really an appropriate time to review a professor, but I just got the urge now because I think Professor Kittay is great. He takes the time to help every student and really has an interest in getting people to understand the material. He holds extended office hours before papers are due so people can come talk to him- definitely go to these. During the meetings he'll give you really good feedback and help you develop your ideas, and they only take 15 minutes anyway. There's no excessive time taken out of your day of Facebooking if you go. And if you email him after the meeting with more questions or a revised version of your topic, he'll get back to you really quickly with more insight. He also has close-readings periodically outside of class, which are somewhat helpful, especially if you're having trouble with a particular text. Participation is a huge part of the grade (50% I think), so definitely talk in class, or if you're shy, go to office hours and close-readings, because those give you participation points, too.\nKittay really wants to give everybody a good grade. He thinks that all the ideas students come up with are groundbreaking, and encourages people to talk without letting them ramble on (most of the time). He errs on the side of leniency in grading papers and the midterm (can't comment on the final but I assume it will be the same way). All his students appreciate this- I personally think his grading policies allow us to learn without stressing out about our GPA.\nBottom line: take his class if you can, and participate. You'll have a good experience. Oh and don't get freaked out by his intense eye-contact. He does it to everyone; you'll get used to it.\nWorkload:\nTwo 8-10 page papers, midterm, final, weekly posting of 2 questions on Courseworks\n"
        }
    ]
}