{
    "prof_info": [
        {
            "prof_name": "Maria Doubrovskaia",
            "prof_id": 9878,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year Russian I",
            "review_date": "May 09, 2010",
            "review_content": "\nFirst-year Russian is a horror show, with an absolutely tremendous workload, but having a TA as relaxed and skillful as Masha made it much easier to handle. She knows both English and Russian (her first language) front-to-back unlike some language TA's. She's also available to help whenever you need it and when you do come in for office hours they are generally extremely helpful. She genuinely wants everyone to succeed and she makes the classroom feel much less tense with her offbeat humor and chilled-out vibe. If she has any shortcomings, they are that she is occasionally disorganized and somewhat easily distractable, but they really are very minor issues. Highly, highly recommended.\nWorkload:\nIntense. An hour or two of work a night plus corrections.\n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "December 23, 2009",
            "review_content": "\nMasha is such an amazing TA! As a native speaker, she'll amaze you with both her mastery of English and her ability to communicate clearly in Russian. I've been accustomed to native speakers of foreign languages rattling off improperly in their languages, using common native mistakes. This is not the case with Masha- she's sure to speak flawless Russian. Even if she can't always explain why something is the way it is, she can give the raw information needed for more in-depth analysis. This is ideal for any budding Russian major, but her lack of ability to explain things clearly and properly could be a hindrance for someone not accustomed to grammatical complexity. If you're willing to work, however, and come with a great attitude, Masha has a personality that will light up every hour that you spend with her. Definitely a recommendable instructor for First-Year Russian.\nWorkload:\nFairly heavy- be prepared for an hour each night.\n"
        }
    ]
}