{
    "prof_info": [
        {
            "prof_name": "Sacha Spector",
            "prof_id": 4437,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Conservation Biology",
            "review_date": "April 13, 2011",
            "review_content": "\nSTAY AWAY FROM THIS CLASS. It is the biggest waste of time. Meets once a week for 2 hours, mandatory 1 hour discussion section each week, about 3 mandatory field trips, two of which are full day excursions. We learned absolutely nothing of substance.\nThe entire course can be summarized like this:\nThe philosophical basis of conservation is questionable. We don't have much data, so our models suck and our understanding of the natural system is very limited. We should do lots of research and then integrate the results with social, political, economic, cultural, and spiritual considerations to engage stakeholders and conserve the system.\nAssignment: There's a reservoir in Central Park. Let's restore it! Go!\n(what are we restoring? why? how much money? what time frame? what species live there? these are apparently irrelevant questions and we are not given the answers)\nThat's actually it. No science. None. At all. Just a lot of focus on integrating it into some kind of vague socio-politico-economic framework. This general lack substance be a lot less frustrating if the class wasn't SO MUCH WORK. It's not hard, it's just time consuming. Very, very time consuming. The sad part is, the professors are both cool and extremely knowledgeable. Matt is a plant guy, and Sacha focuses on insects; they both know a lot about generally under-studied topics in environmental bio, yet do not impart any kind of scientific knowledge to their students. They and the TAs are both really nice as well, yet the class still sucks. So frustrating.\nWorkload:\nWeekly \"exercises\" that take hours and teach you nothing except the art of bullshit (which, let's be honest, you've probably already mastered!). 2 journal articles weekly (discussed in section), generally literature reviews, opinion pieces, or modeling studies that say little. No midterm, take home final (I haven't taken it yet). There's an optional paper you can write to decrease the weight of the exercises and final exam, but if you work hard on the exercises it probably isn't necessary.\n"
        }
    ]
}