{
    "prof_info": [
        {
            "prof_name": "Samuel  Mitchell",
            "prof_id": 13048,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 28, 2014",
            "review_content": "\nSam teaches the unthemed section of UWriting, and I have nothing but positive things to say about his class. He is a PhD student and I'm not sure how long he's taught the class, but he does seem to have it down. As a disclaimer, I did well in the class (A+) and while I'm a science major I do enjoy writing, but it seems like many others did as well. UWriting is one of those classes that is hard to teach, because everyone from english majors to engineers need to take it but Sam tried to make sure that the readings for this section were recent, not unreasonably long, and interesting (for example there were two David Foster Wallace essays in the reading and some essays about New York). Most importantly, Sam is aware of the challenges of being a first year at Columbia, lightening work load around midterms, pushing back deadlines when we seemed overwhelmed, etc. His feedback on essays was always useful and helped to improve my writing, and the assignments gave us enough room to breathe and find what we were interested in within the text. Doing well in his class wasn't tremendously hard as long as you participate during class and take his feedback (important, you have the potential to raise your grade 1/3 of a letter if you're engaged, I calculated my grade without the participation bump and it should have been an A). Overall, sam is an engaging, understanding professor who knows UWriting may not be your favorite class but still grades very generously and makes it a pleasant experience. If you have the chance, stay in/switch in to this class! \nWorkload:\nFairly usual for a UWriting section, four essays (like all sections are required to have), plus occasional paragraph-long \"talk about the reading\" type pieces for maybe half of classes that aren't graded but I do believe factor in to the participation grade. He minimizes the in-class writing stuff as much as he can which the UWriting people want him to do, which is nice. \n"
        }
    ]
}