{
    "prof_info": [
        {
            "prof_name": "Paul Hertz",
            "prof_id": 1044,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Organismal/Evolutionary Biology",
            "review_date": "December 08, 2016",
            "review_content": "\nIntro to Organismal and Evolutionary Biology is definitely not the class for you if you don't read textbooks. There is a lot of information you are expected to know for each test, but all of it is in the book. I attend his lectures just to get an overview of what I will be reading about so I have a little something to guide my reading, but the lectures are completely unnecessary if you do the reading, as everything he says in class is directly from the book (he wrote the book). \nThe material is super neat though, and it is pretty well organized. Overall a great survey class that isn't too intense as long as you read and make quizlets/flashcards/study guides for all the chapters so you can cram the night before the test. It is especially great that there is no cumulative final anymore, just three unit tests. \nWorkload:\n3 Unit Exams (cover about 10-12 chapters each) - 25% each\nMindtap Online Homework due MWF - 25% \n"
        },
        {
            "course_name": "Introduction to Organismal/Evolutionary Biology",
            "review_date": "November 19, 2014",
            "review_content": "\nCan't say I was a huge fan of professor Hertz, but he is alright! His lectures are hit or miss. Sometimes they are very interesting while other times you really could have just stayed in your dorm and done the book work. This class does require that you keep up with the reading. It is very important that you stay on top of the reading!Professor Hertz does not allow you to ask questions during class because there is not enough time. SI sessions are offered with this course though if you have questions. I never went to an SI sessions so I am not sure if they are helpful. Overall, I felt Hertz was kinda mediocre. that is just honest opinion. He's not bad, but not excellent either. He is clearly a very intelligent man and even wrote the textbook for the course, but I don't think he's the best lecturer. \nWorkload:\n2 exams (midterms), 1 final, Aplia online homework due every week (I hated this because the answers were hard to get right and were supposed to go along with the text but they didn't really seem to coordinate). Reading took a lot of time and was tedious. I always went through the book and took thorough notes on each chapter and made a quizlet for each chapter which took time but it was necessary. \n"
        },
        {
            "course_name": "Research Apprenticeship Seminar",
            "review_date": "January 12, 2011",
            "review_content": "\nYou aren't going to learn very much from the Research Apprenticeship Seminar, and you will get really really bored in seminar.  The readings aren't very interesting or thought-provoking or useful, and we spent too much time going over them.  Professor Hertz is great in a big lecture like Intro Bio, but in a smaller class setting, he's just not good at keeping the ball rolling.  The lab rotation is a good opportunity, but that only takes up one month of the semester.  You don't get much say in the type of lab in which you'll work, but avoid Psychology or Physics or anything with vertebrate animals because you won't get to do anything hands-on.\nHowever, if you want to do research, you should apply to take it anyway for a few reasons...\nPoint A:  If you're in the seminar, you're guaranteed a small stipend if you get an unpaid position in a research lab for the summer.  Pending continued funding and all that jazz.\nPoint B:  You'll get a few hours of research experience to write about in your applications for those positions, and you may meet someone who can write you a recommendation.\nPoint C:  It doesn't take much of your time, at all.\nWorkload:\nIf you actually did the readings, it'd be a fair amount, nothing excessive.  But you won't do all the readings.  During the seminar weeks, you'll spend maybe an hour on average outside of class each week, skimming the readings and writing your blog entries about them.  And for a month you'll spend 3 hours a week in a lab rotation.  Your grade is mostly determined by just doing the assignments, not by how well you do them.\n"
        },
        {
            "course_name": "Introduction to Organismal/Evolutionary Biology",
            "review_date": "December 19, 2008",
            "review_content": "\nI would definitely suggest this class, it is pretty good for a survey course. The lectures are packed with information, and there is a lot to know for exams, but the course is organized and there is nothing unexpected. Hertz knows what he teaches. I would suggest going to as many lectures as you can, because even though the tests do cover a great deal of info from the textbooks, lecture material does end up on exams, and especially on the final. The tests ask very detailed questions, so study the textbook closely. The only way to do well on the final is to have lecture notes. The review material on the final comes ONLY from lecture, and the questions are pretty detailed. If you follow Hertz's directions closely, attend lecture and take good notes, and read the textbook, you will do fine in the class.\nWorkload:\nPretty heavy (depending on what you want to get in the class), with each lecture there is generally 1-2 chapters of material you should know well. Take the online quizzes, they will help your grade in the end and it doesn't matter what you get on them, only that you complete them. There are two midterms and one cumulative final (half of the final only covers lecture).\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "December 26, 2006",
            "review_content": "\nProf Hertz is a perfect professor for a survey course.  This course cannot be phenomenal as it  is a massive survey lecture, but Hertz is organised and his exams are no surprises.  The questions are tricky but if you make a point to carefully go over the book before the exam, and then his notes, you should have no problem.  It is a no surprise course.  \nWorkload:\ntwo midterms and one final. All multiple choice\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "April 21, 2006",
            "review_content": "\nProfessor Hertz is my favorite teacher at all of Columbia and Barnard.  He's really organized.  This is what people say about him, but that's not what I think is most impressive -- he really *really* cares.  He wants you to learn.  He thinks the subject matter is exciting, and doesn't look at the details as ways to bog you down, but as ways for you to tune your knowledge keenly.  I think he's brilliant.  I loved the Intro class so much that I took Vertebrate Evolution simply for the hell of it.  Vert Evo is my favorite class I have ever taken with a really reasonable amount of work and reading.\nThere is no way you will leave his class without having learned a ton -- and this knowledge is applicable to dinner conversations and the works :o)  Did you know that rabbits eat their own shit?  Their digestive tracts are very inefficient.  As Prof. Hertz said \"Mammals are disgusting.\"  And he smiled.\nHe's a really enjoyable, informative, together, open-minded, and interesting teacher.  Go for it.  Take this class (or both of the classes I took from him, for that matter).\nIf you're wondering, grading is totally fair.  Do what he says, you get an A.  Slack off, and your grade goes down proportionally.  Duh :o)\nWorkload:\nIn Intro Bio: 2 midterms and a final.  They are difficult but fair.  Take the examples and details from the textbook very seriously and listen to the \"stories\" he tells in lectures.  He may ask questions about these.  For Vertebrate Evolution: 3 trips to the AMNH with a draft about each visit (he will ask you very specific questions).  3 midterms, and 1 SHORT take-home final.  Everything is always graded reasonably and quickly because Prof. Hertz is an efficient and awesome guy :o)\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "April 18, 2006",
            "review_content": "\nProf. Hertz knows his stuff. He is a very organized lecturer which is very much appreciated when you consider how much material is covered. It's a challenging course, but thorough reading of the assigned chapters will get you a good grade. \nWorkload:\nTwo hour-long multiple choice midterms and a three hour multiple choice final.\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Hertz is very organized which is important in a class with so much information. He provides an incredibly detailed outline for each class and sticks to it. He's a good teacher who covers the material quickly and he's also available outside of class during help sessions. His test questions are sometimes very specific and it is important both to go to lecture and read the textbook as questions come from both sources. \nWorkload:\n2 midterms, 1 final, textbook readings\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "January 05, 2006",
            "review_content": "\nProfessor Hertz is very organized and does a good job of succinctly, yet fully, covering a large amount of material each class. It is unfortunate it is only offered at 9am, because it is quite difficult to take the copious notes neccessary for this class at such an early hour.\nI made the mistake of never doing the readings after having taken AP bio in high school, which was a mistake. Almost all of his exam questions are based on very minute details from the textbook, which seems rather unfair to me.\nHe definitely knows his material and seems quite interested in what he teaches. He is not bad at all, but if you are unfamiliar with more difficult bio concepts, this class is not for you. Expect to work quite a bit.\nWorkload:\nlarge readings, two midterms, final\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "March 26, 2005",
            "review_content": "\nPhenomenal professor and class! I was kind of on the fence about being pre-med and/or majoring in bio, and now I'm for sure doing both. His lectures were so easy to understand and the few times I actually had questions I went to his office hours and he had a great sense of humor and was very patient. I actually thought his tests were very fair. There's a decent amount of reading and a lot of memorization, but it's totally doable and most of the material (minus the plant bio and ecology stuff at the end) is fascinating. I loved this class. A lot. \nWorkload:\n2 midterms 1 final.\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "January 03, 2005",
            "review_content": "\nHertz is a meticulously organized professor who is thoroughly knowledgeable about his subject matter. His lectures were engaging and succinctly presented the general ideas of the course. I found that most of the exam material was covered by the book in some guise, so it was not necessary to take copious notes during class (in fact, sitting back and trying to understand the lectures was probably more helpful than attempting to transcribe them verbatim). Also, although I felt stumped by many of the exam questions (they were indeed as challenging as everyone before me has indicated), it turned out that understanding general concepts and processes allowed me to infer the correct answer in most cases. \nWorkload:\nthree exams: two midterms (each 25% of overall grade), one final (50%)\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "December 30, 2004",
            "review_content": "\nHere are the best tips i can give on this class. Always show up on time and he has question periods every week...even if you dont have questions, go to them anyway! in a large class its really good if he gets to know you, and this is the way to do that. this class is a lot of textbook work but if you take really good lecture notes it makes life (and the final) a lot a lot easier. as for hertz, he's not a bad guy but sometimes his tests dont really reflect the assigned reading. his lectures get very long and boring toward the end of the semester. also there is never really much of a curve in this class\nWorkload:\nyou have to read a chapter before each class (3 times a week), two midterms (each 25%) and one final (50%)...the final is cumulative but the review subject questions are taken only from notes. it helps to do the reading before class but you dont have to\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "December 16, 2004",
            "review_content": "\nI came to Barnard never dreaming of majoring in bio, however taking class with Hertz changed my mind. Though this class is hard, its never because of his lack of organization, it simply covers a ton of material (understanding the immune system thoroughly in one lecture is IMPOSSIBLE).  Be SURE to do the readings AND go to the lecture; you'll find questions on the exam which are uber-specific, that if you've laxed on either the readings or the lectures for more than a week, you're screwed. His lecture skills aren't exactly great, but about average, though he does manage to pack a ton of information into a 50 minute lecture; taking notes with a laptop is highly recommended, as is sitting in the front of the class. Be sure to be on time, as you can only pick up the lecture outlines before 9, and yes, class begins at 9 sharp. He'll give you the outlines after class if you were late, but having the outline during the lecture is nearly crucial. \nIf you're not a biology major but needs to fulfill a lab requirement, I'd highly recommend taking this class. You could of course take the 1000 level class, but if you're looking for a challenge, definitely take it, the lab section ( a different course) isn't that hard either. \nWorkload:\n2 midterms, 1 final. \n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "November 22, 2004",
            "review_content": "\nProfessor Hertz is awesome. He will give you an outline of every lecture, and he sticks to it. He is easy to follow and almost never boring. He tells you this on the very first day, but it's important to remember that the hard thing about this course is not the material itself, but the volume (you will have tests on 8 or 12 chapters at once). It is entirely doable, though, if you stay on top of things. His exams are not easy, but they are very fair and usually have a decent curve. Overall, I absolutely loved this class! \nWorkload:\n2 hard but fair midterms and a slightly easier final. Stay on top of the reading and you will be perfectly fine.\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "December 28, 2003",
            "review_content": "\nAlright, so here's the deal.  Prof Hertz really is as organized as they say, the hour long class is jam packed with information and will have you frantically taking notes the whole time (dont worry though its still do-able),  and you'll carry the Campbell textbook around with you so much that it will in fact become an extension of your body. This class is most def hard work, but its fair.  My main beef with Hertz, however, was not with the class, he's definitely a great lecturer, but with his tests. His question style is so specific, that if you're not good at it, you're basically screwed for the class since your entire grade is based on three tests. Oh yeah, and Hertz is also totally unapproachable outside of class, and has a strange affinity for lizards. (I'm serious, go to his office and check out the lizard posters). Basically though study your brains out for this class and you'll be fine.\nWorkload:\nmassive amounts of memorizing for the two hour-long exams and a three-hour final\n"
        },
        {
            "course_name": "Vertebrate Zoology",
            "review_date": "April 13, 2003",
            "review_content": "\nI loved his class. He is so organized and has a funny sense of humor. The tests are reflective of the material covered in class, and I like the short papers we write on each section.\nI took this class Spring 2002.\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "January 19, 2003",
            "review_content": "\nWell this class is very organized, you will always be given an outline before every class...but i give you fair warning...get there on time!!!  This class is all about havng a GREAT memory...read the text and you will be fine!  Some lectures can be highly boring..\nWorkload:\nlecture, 2 midterms, 1final\n"
        },
        {
            "course_name": "Physiology, Ecology, and Evolution",
            "review_date": "May 01, 2002",
            "review_content": "\nProf. Hertz is quite possibly the most organized person I have ever met in my life. This is a good thing- it means handouts every class that he really sticks to. Lectures are super organized and you need to be able to write quickly. Most people in the class are freshmen so they don't really know what they're doing- use this to your advantage! He writes on tests \"According to Campbell (the textbook)\" and this throws most people off. \nWorkload:\nTests require a ton of studying but if you memorize everything you will do fine, i.e. memorization not understanding is key here\n"
        },
        {
            "course_name": "Vertebrate Zoology",
            "review_date": "May 01, 2002",
            "review_content": "\nI disagree with the previous review. I found Vertebrate Zoology to be a thouroughly enjoyable course. While the three assigned museum trips were a bit time-consuming, I found them helpful and interesting, and a great way to weave an excellent NYC resource into the course. The course is incredibly well-organized; Hertz has obviously been teaching it for a long time and has developed this great lecturing style in which he forms an outline on the board as he lectures, making it really easy to take well-organized notes. Furthermore, his three exams are very straightforward, and you can leave out a question or two in each section, which is good if you blank on a topic. He also has two cool lizards (yes, real lizards) in his office. \nWorkload:\nFairly generous grader. Three midterms, three museum reports, a take-home essay, NO FINAL!!!!!!!!!\n"
        },
        {
            "course_name": "Vertebrate Zoology",
            "review_date": "April 28, 2002",
            "review_content": "\nI didn't know men could get PMS... Paul Hertz is a great lecturer, but outside of class he is totally unapproachable, intimidating, and unhelpful. It appeared to me that he was annoyed at every question he received. He was also an incredibly hard grader. If you weren't one of his advisees then he didn't seem to have the least bit of interest in what you had to say. He rarely had anything nice or positive to say on any of the graded work I received back from him. In addition, his Ecology Lab was incredibly unstructured, there was no lab manual when one was really needed. Again, he seemed not to give a shit about you if you went to him and asked for advice or suggestions for the work you were doing in his class.\nWorkload:\nVertebrate Zoology: half the material in lecture isn't on the exam, read the textbook. He makes you go on 3 field trips to the museum of natural history on your own time. They are not worth it and are nothing more than annoying. \nEcology Lab: you'll need to spend a lot of time on write-ups, more than you think you will.\n"
        }
    ]
}