{
    "prof_info": [
        {
            "prof_name": "Alan Dye",
            "prof_id": 1093,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Topics in Economic History: Globalization and In",
            "review_date": "January 11, 2010",
            "review_content": "\nOh Professor Dye. He insists on teaching this class at 9 AM, which basically means that about half the class shows up to lecture every week. The sad part is that lecture is REALLY important in this class. The readings are long, but they were usually pretty interesting, except for everything we had to read about agriculture during the industrial revolution. I don't know why anyone would take this class unless they really really had to (it's a requirement for majors). The course-load was pretty large for a 2000-level class and most of the people in the class didn't really know how to prepare for his exams, so there was a nice curve, which was kind of him. In general, Professor Dye is really nice and when he finally responds to your e-mails, he has no problem meeting with you to discuss any questions you might have from class. As long as you go to class most of the time and do the readings at some point before exams, you're good to go. The final paper is a huge pain in the butt, but it only counts towards 15% of your grade, so it's not so awful, as long as you do well on the midterm and the final, which are each worth A LOT. \nWorkload:\n1 Final paper (8-12 pages, 15%), Easy spreadsheet assignments (10%), participation (10%), Midterm (25%) and Final (40%)\n"
        },
        {
            "course_name": "Business Organization",
            "review_date": "May 12, 2009",
            "review_content": "\nAlan Dye definitely knows his stuff but has no idea how to communicate that to his students. This class was horribly boring and structured poorly. Most people rarely attended lecture. The grading was also pretty harsh and very subjective. The idea was the better you knew the professor, the better you did in the class. He ultimately turned a subject that is very simple and interesting into something very complex, difficult, and boring.\nWorkload:\nNot too bad. Weekly readings, a group project, a midterm, and a final. He gives out his lecture notes which can be helpful.\n"
        },
        {
            "course_name": "Topics in Economic History: Latin America",
            "review_date": "April 14, 2009",
            "review_content": "\nSTEER CLEAR OF THIS DISASTER!  He knows his stuff, that is for sure, but listening to his lecture is pure torture. He is extremely boring. The man also gives off this nervous energy which is enough to make anyone jumpy. He seems so uncomfortable in front of the classroom- like its his first day teaching.  His nervousness and inability to engage the class make for one bad combo.  Additionally, he is impossible to get a hold off. Never answers emails, office hours are overbooked and he can't seem to keep anything straight. Do yourself a favor and avoid this mess!!!\nWorkload:\nManageable \n"
        },
        {
            "course_name": "Topics in Economic History: Latin America",
            "review_date": "December 28, 2005",
            "review_content": "\nProf. Dye is not an exciting fellow, and he is definately not here to entertian, BUT he knows his stuff ! He is extremely proficient in economic theory and does a really good job in conveying the material. Some have accused him of being a bit pedantic in his approach, but it works because he lectures with the assumption that the material is unfamiliar to all students.\nHe is very accessible after class and goes out of his way to help and offer suggestions.\nhe is fair in his grading and very approachable if you have concerns or do not agree with him.\nIf you want personality and entertianment go take a class with Dalton or Josh Whitford, but if you want a serious and meticulous unpacking on a topic in ecinomics, take this class. \nWorkload:\nthere is one short quiz each week, one mid term and a choice of long or short essay, as well as the final exam.\n"
        },
        {
            "course_name": "Topics in Economic History: Latin America",
            "review_date": "November 16, 2005",
            "review_content": "\nIf you are not an Econ major, seriously consider not taking this class.  It is exactly what he says; the first half is heavy on the economics (theory, principles and diagrams) and the second half is more about land distribution, country studies and more historical economic themes.  However, it is boring.  He speaks fast, non-stop for the entire class, no jokes, no real discussion....if you love the subject and know somethng about economics, take it...but the proffessor adds nothing to the course and is pretty dull.\nWorkload:\ntwo readings a week, a weekly easy optional quiz, a paper, midterm, final\n"
        },
        {
            "course_name": "Topics in Economics Theory and Policy",
            "review_date": "January 09, 2005",
            "review_content": "\nThis class focused on Latin American history and was fascinating as an intro to the field of economics. If you are someone interested in the practical impact of economic theory on history, but turned off by formulas and theory divorced from history, this class is a great way to get it. Lectures could have been more interactive and/or dynamic, but I ultimately learned a great deal about history and economic theory... and didn't ever have to do any math! Professor Dye is knowledgeable if not exciting and is extremely helpful in one-on-one meetings. \nHe also clearly cares about this class and enjoys the mix of econ. and non-econ. \nmajors in his classroom. Both can do well in his class. I did, and the last time I took econ. was when I slept through it in 10th grade.\nWorkload:\nWeekly reading quizzes (optional - if you take them and pass them, you are exempt from the reading portions of the midterm and final), midterm exam (essay answers), midterm paper, final paper (or extended version of midterm paper), final exam (non-cumulative, NOT three hours).\n"
        },
        {
            "course_name": "Business Organization",
            "review_date": "June 12, 2004",
            "review_content": "\nThe material taught in this class is decent, but Dye's boring, boring, boring!!! and the class is at 9:00 in the morning!!! half of the class dropped this course after the midterm! probably only 1/4 of the class actually attended the lectures! \nWorkload:\nLight: one M&A; project, one book review, and some assigned readings.  He gives out lecture handouts too, which can be helpful on the midterm and final.\n"
        },
        {
            "course_name": "Economics of Business Organization",
            "review_date": "April 08, 2004",
            "review_content": "\nSuper nervous, grips his bottle of juice for dear life during lectures. The material is pretty interesting, especially if you want to learn about corporate management (i.e., incentive plans, transaction costs, organizational structure). To do well - make sure you read the Harvard B-school case studies and keep up with the terms (which are all defined in his slides). \nWorkload:\nPretty light: reading (but only the case studies really matter), a book report, m&a; group project, midterm and final. It sounds like a lot, but the work is pretty manageable and easy. \n"
        },
        {
            "course_name": "Topics in Economic History: Latin America",
            "review_date": "November 21, 2003",
            "review_content": "\ngood. he's not the best teacher in the classroom (you need to bring coffee) BUT he really knows his stuff and loves it.  if you can schedule office hours with him, go for it ! (you will actually get so much out of him then) .  he's readily available and honest. i would recommend taking his class. levels varied widely in the class but it doesn't matter, you still need to read because it's \"TOPICS in econ hist\"  \nWorkload:\nfair grader. weekly quiz. readings are pretty tedious. mid term, final. and a 10-14 pg paper\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "August 26, 2002",
            "review_content": "\nHe's a nervous little guy, but a good teacher and super nice. His lecturing style isn't exactly riveting, but he knows his shit. He's really accessible too, so if you've got questions about the material, he'll be there to answer them for you. Personally, I recommend taking a class with him; in general, I'd say he's one of the better econ professors at Columbia. \nWorkload:\nCourse load isn't too bad for either class. \n"
        },
        {
            "course_name": "Business Organization",
            "review_date": "August 15, 2002",
            "review_content": "\nTook his intermediate micro class. it was confusing but he curves. he follows the same logic here. he curves ! he's a nice professor. but kinda boring. the reading material isn't so bad. it's pretty interesting and it helps that every class he has handouts about his lectures. it outlines basics and has the usual graph or two. it's a pretty easy a. don't be scared away by the workload. read ocassionally (like for teh book report and harvard business studies), study up vocab, and pay attention in class= instant a. (ps-make sure you cite EVERYTHING in your group paper. he's a stickler !)\nWorkload:\none book review (5 pages), one group paper(7-10 pages), two larger combined groups papers(2 pages), one midterm and one non-cumulative final\n"
        },
        {
            "course_name": "Topics in Economic History: Latin America",
            "review_date": "May 09, 2002",
            "review_content": "\nThis class was great! Take it if you want an easy A. Professor Dye hands out typed notes every class and the midterm and final were based on these handouts. To top it all off, Professor Dye is very flexable, so can basically negotiate anywork load or quiz questions you want.\nWorkload:\nMidterm, final (which was take home), two 5 page papers OR one 10 pg paper, and OPTIONAL quizzes. There is basically no day to day work.\n"
        }
    ]
}