{
    "prof_info": [
        {
            "prof_name": "Lawrence Reed",
            "prof_id": 13587,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Evolutionary Psychology",
            "review_date": "August 16, 2020",
            "review_content": "\nOne of the most caring and funniest professor ever. He gives out his number for any student to text him with questions about the course and responds within minutes. He prepares jokes for his lectures and tries to make the class enjoyable for not only himself, but especially for his students. Professor Reed gives you everything you need to study and highlights important information on his lecture that will be on the exam.\nWorkload:\nMidterm and Final are easy if you study his lecture slides. 1 Article Discussion. 1 essay. 1 take home quiz. \n"
        },
        {
            "course_name": "Evolutionary Psychology",
            "review_date": "July 01, 2019",
            "review_content": "\nIt would be amazing if every professor at Columbia was like Professor Reed. He is levels above the two other psyche professors I've met, and levels above many other professors in unrelated disciplines. \nHe was available via text, call, email, after class, and office hours.\nHe responded quickly and accurately.\nHe followed up to insure all questions had been answered.\nHis presentations were fun, informative, and concise.\nHis presentations were available prior to class.\nHis syllabus was informative and well paed.\nHe made all quizzes and exams available with answers attached. They became learning material.\nI would take any class I could with him. \nI easily learned twice as much, in the short summer session 2019 in Professor Reed's open, transparent, and engaging Evolutionary Psyche, than I did in the entire Kafkaesque Spring session with Professor Lindeman's Experimental Psyche and Human Behavior with its opaque grading and secrecy over exam your.\nWorkload:\nThe reading is serious. There were 44 pdfs some fifty pages long of single spaced research reports and sections from various books. It was all doable, but it was far more than 15-20 per week. I'd do it all again.\n"
        },
        {
            "course_name": "Evolutionary Psychology",
            "review_date": "August 19, 2018",
            "review_content": "\nStop reading this review and just enroll in the class. Ian is a nice guy and what I love about his style of teaching is that he is very efficient in communicating the material. Honestly though, there were many moments during his class where I think to myself \"why haven't I thought of that\". He makes slides relevant by including GIFs etc. Rather easy grader too.\nWorkload:\nLight\n"
        }
    ]
}