{
    "prof_info": [
        {
            "prof_name": "Priscilla Becker",
            "prof_id": 2538,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style II",
            "review_date": "May 20, 2007",
            "review_content": "\nProf. Becker isn't as bubbly or immediately outgoing as some other teachers, but over the course of the semester, I noticed how good her ideas and suggestions were. She is a good teacher. The grades we (or me, at least) were getting back over the course of the semester seemed a little low at first, but they get revisited after revisions and the final portfolio are turned in, and I was pleased with my final grade (I know another reviewer said the grading seemed a little harsh, but I would disagree). She does have a slight problem with time management though. Overall, it was a good course.\nWorkload:\nOne short story, a play, and three poems--experpts from longer works are accepted for the story and the play, and probably for the poems too but it didn't come up. Each section is worth a third of the grade, and smaller assignments and such are included in the grade for that section. The works are workshopped and revised for the final portfolio, like most writing classes.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "February 18, 2007",
            "review_content": "\nI strongly recommend Priscilla Becker to any students interested in taking a writing course at Columbia.  She creates an incredible classroom environment which is fun and inspiring but best of all buttressed by real support and encouragement. Priscilla keeps you actively writing with in-class assignments and additional writing exercises on the weeks that you are not due to hand in a longer piece. This was vital to me as it allowed me more outlets than just the three banner assignments (poem, scene, short fiction). Priscilla made herself totally available and encouraged if not expected each student to meet with her about each of his/her three large assignments. In class she spent little time on her own comments but encouraged the group discussion instead. In addition to the texts she handed out great readings Â– some of which she was inspired to distribute by the writing styles of students in the class. Priscilla even added an extra session at the end of the semester to get that much more out of the class. She was very appreciative of the vast variety of writing styles in the class and all of her comments were constructive and postive.\nWorkload:\nin-class writing assignments, several poems, one piece of short fiction, one scene\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "February 18, 2007",
            "review_content": "\nPriscilla is a truly wonderful teacher, probably one of the best I've had at Columbia.I took Structure and Style 1 with her and then ended up (happily) in her Structure and Style 2 class as well.  Unlike other writing teachers that make themselves the focus of the class, she really runs a great workshop, where she allows students to develop and advance their own critiques of other student's work.  Her suggestions, however, are always insightful and  thorough, inspiring creative criticism from the rest of the class.  She doesn't have a standard style or subject matter that she favors, but rather allows students to improve their work while guiding them to develop their own strongest points. Often writing excercises can feel limiting or confusing, but Priscilla uses them as a way to open up new voices or ways for expressing familiar ideas. She encourages students to take risks, but also appreciates simple, well-written pieces. She is really serious about writing - she is a talented and highly acclaimed poet - but she is equally serious about teaching. Perhaps those students that reviewed her negatively mistook her seriousness for a lack of caring or openmindedness. The truth is, if you put yourself into the class - both the writing and the workshopping aspects - you will get twice as much back.  Especially if you go to office hours, as she encourages everyone to do, Priscilla really will help you become a better writer and more appreciative reader of good writing. She is not an easy teacher, but it is possible to do well in her class if you care about the work and take risks.  \nWorkload:\nTwo or three poems, one short story, and a one act (or one scene from a longer play). \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "February 17, 2007",
            "review_content": "\nDO take any creative writing class you can with Priscilla Becker. She is a writerÂ’s writer and this is reflected in the way she teaches. She considers  her students writers and demands a disciplined and respectful workshop. She seems to care deeply for words and makes you consider every one you use- she is not interested in the Â“gistÂ” of things and if you pay attention you will learn how to say what you mean. (Or at least start to really think about it). She does not condescend to students nor does she preach her own sensibilities. She listens and absorbs the dynamics of the room and offers insight and encouragement outside of class. She is not afraid to question what she does not Â“getÂ”- out of an actual curiosity- nor is she afraid to tell you that something isnÂ’t working. \nShe does not pull punches and this is a great thing if you want to take writing seriously. She assigns a lot of reading and a lot of exercises- including a poem recitation- but it seems to me that a lot of reading etc. \nis what writers are supposed to be doing. She held an extra class at the end of last semester because everyone wanted to continue meeting. It was optional but most everyone showed up. \nWorkload:\nStandard structure and style- short story, 3 poems, One Act with required re-writes. Lots of exercises, reading. \n"
        },
        {
            "course_name": "Structure and Style",
            "review_date": "February 16, 2007",
            "review_content": "\n found Priscilla to be an extremely devoted and inspiring teacher and IÂ’m taken aback by some of the other postings. I would never describe her as Â‘gruffÂ’.  SheÂ’s serious about what she does, but I found her to be relaxed, funny, and personable.   She expects students to come to class, to do the work, and to be engagedÂ— expectations that every teacher should have but that, in my experience in the writing program, some donÂ’t articulate at all.  Priscilla teaches the class like writing is important and difficult, not simply some elective you take for an easy A. She stresses the importance of learning to talk about the writing of others, her writing exercises are innovative, challenging, and productive, and she goes out of her way to help you if you are invested in improving your writing. \nThis class made me want to write. If you can take it from her, do.\n\n"
        },
        {
            "course_name": "Structure & Style",
            "review_date": "February 11, 2007",
            "review_content": "\nAfter having taken over 6 writing courses as a CC undergraduate, I feel compelled to elaborate on my experience in Priscilla's Structure and Style class. \nThere are several recurrent problems in the undergraduate writing program here. One, it is difficult to suit the needs of all the students since they come from such diverse backgrounds--CC, GS, Continuing Ed, etc. Two, considering the diverse makeup of the classroom, it is very challenging to find a teacher who can actually teach transferable technical skills while accommodating the style and voice of such a distinct mix of students. Professors tend to handle this problem by completely ignoring the individual needs of their students, teaching whatever they want to teach and ignoring the rest. Alternatively, they don't teach at all and focus solely on anomalous personal concerns, which is a true waste of time for a student who wants to learn about the various forms of poetry or how to structure a conversation. \nAside from Priscilla, I have never had a teacher who could perfectly balance these concerns. Priscilla's class is, by far, the best writing class I have had at Columbia. She managed to suit the needs of every student in the class while bringing all of us together in learning invaluable techniques regarding style, voice, form, and structure.\nIt is incredibly refreshing to have a teacher to takes writing seriously. Most students take Structure and Style as a blow-off class, hoping for an easy grade. However, with a second-rate teacher, they'll walk away having learned absolutely nothing. With Priscilla, such is not the case. Not only will you enjoy interacting with her as a person, you will thank yourself for having had an instructor who is so dedicated to actually teaching you about writing. \nConsider yourself very lucky if you have Priscilla as an instructor. She's not just some writer who is trying to make some extra cash by teaching a class or two. She's the real deal. \n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "February 11, 2007",
            "review_content": "\nI don't know why the other reviewers seem to be so harsh on Priscilla; I guess they don't know how to appreciate a no-nonsense writing instructor. I, on the other hand, found this approach very refreshing. When confronted with ambiguous poetry, she was not afraid to ask, \"What does that actually _mean_?\" She really challenged me to be a clearer, more developed writer, and did not hesitate to give her true opinion. This is not to say she was insensitive - far from it. She was just honest, and clear about how she wanted to run her class. I am grateful for her help, and know that she helped my development as a writer. Her class was enlightening, interesting, and fun. I recommend taking a class with Priscilla, if you want real concrete help.\nWorkload:\nA few poems, a scene, a piece of short fiction; portfolio of edited work at the end.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "February 10, 2007",
            "review_content": "\nThe instructor of any writing course has what I think is a very difficult job. In my opinion, there is no feasible way to TEACH someone how to write creatively. All you can really do is identify what is good about someone's, identify what is bad, and encourage good habits.\nThis is exactly what Priscilla does. She assigns several exercises and tries to workshop as often as possible during class time. This forces the students to actively work on their writing and at the same time affords them many opportunities to figure out what is working and what is not working about their writing with Priscilla. \nWhether or not you always agree with her, she is always insightful and perceptive with her comments. She forces you to think critically about your own writing. I was very impressed by how nuanced her understanding of writing was.\nAlthough she may seem standoffish at first, I think in actuality she is hiding her own shyness from the class. \nShe is truly invested in helping her students and tries to foster a safe and fun environment for the students. By the end of the semester, we all felt at ease with each other.\nWorkload:\nThree (3) poems; one (1) short story; one (1) play; handful of exercises; weekly readings.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 16, 2006",
            "review_content": "\nI do not recommend taking Structure and Style II with Priscilla.  I disagreed with all of her opinions on others people's work and found that everytime she liked something, i disliked it.  She made the class buy three books, one of which was really expensive and all were unnecessary.  She gave out tons of handouts and harped on her love of Sylvia Plath almost every class.  Her comments were occasionally helpful, but i get the feeling that if you don't change your work to relect her style, your grade will suffer.  Class was boring and painful and she went off on tangents constantly.  She even made us have an extra class during reading week because she couldn't manage time efficiently.  Nevertheless, we didn't get to workshop all of our pieces.  If you like creative writing, don't take her class because it will not inspire you and will frankly become torturous.  \nWorkload:\ntons of pointless readings, normal S&S; II load--a couple poems, 1 play, 1 fiction piece\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "September 01, 2006",
            "review_content": "\nA weird lady.  She chews each bite of food 40 times.  But a very helpful teacher if you make the time to go and see her.  She isn't around much so you have to seek her out.  She is VERY gruff and no nonsense. But this is good. She will give you HONEST feedback, so an ideal writing teacher is she!  I did well in the course, I think because she knew I worked hard and cared...probably more than she merely liked what I was writing.  She is a fair grader, nice, actually, to those who didn't deserve it, but she saves the A's for those who earn them.  The quality of the workshop will depend more on the other students than on Priscilla.  She is very expressive of her sometimes strange opinions, but an experience in herself that is not to be missed.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 10, 2006",
            "review_content": "\nUnderneath what may seem like a gruff exterior is a kind and brilliant professor who truly cares about her students. Priscilla is a great writing instructor, and her comments on student's work are always insightful, and honest without being too harsh. She fosters a great workshopping atmosphere - so great that it's sometimes hard to know when to move on from one workshopping piece to another! She does have her no-nonsense qualities; on the subject of being late or absent - don't do it. She will publically call you on it. Go to every class, and arrive five minutes early. Have all your assignments in on time, and have copies for everyone. Don't screw around. The good news is that Priscilla will make you want to work hard. I was always so disappointed when class ended - I could have happily stayed for another hour or so, and that's a rare statement coming from this compulsive classroom clockwatcher.\nWorkload:\nManageable. Three poems, a short story, and a dramatic scene or one act play. A few short assignments, nothing particularly hard. As with any writing workshop/class, you get out of it only what you put into it.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "September 08, 2005",
            "review_content": "\nAs with the previous poster I too was confused by my grade. However I don't think that the laid back atmosphere blocked any sort of improvement. Priscilla genuinely wanted to help her students and sometimes went to lengths to turn criticism from other students into something constructive. Priscilla has very subtle ways of helping, you just have to be attentive and looking out for it. Odd behavior for someone who said once that she doesn't like to know personal information about the author.\nWorkload:\n3 poems in the beginning, 1 dramatic act from a play, 1 short story (all are in the style of your choosing)\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 14, 2005",
            "review_content": "\nPriscilla's a published poet and always gives interesting handouts to read. It's my first class on writing and I didn't know how or where to start nor what I needed to focus on when revising. She only had time before class available and wasn't on campus other days making it hard to get real feedback. It would have been nice if she handed every student back her comments but you had to go see her for those. The classroom was laid back but honestly I would have liked to be worked harder so I could really learn from this experience. I felt like I wrote the assignments and that was it. When I treid to revise it, I was lost. I put more effort in than half the class (several seniors and  people who seemed to care about just handing something in). I had 1 absence, mostly went on time, revised and I ended up with a B.  If you want a laid back class, as did a lot of seniors, this may be the option for you but if you want help improving I'd look at other options. \nWorkload:\n3 poems, 1 scene, 1 short story, writing exercises, handouts\n"
        }
    ]
}