{
    "prof_info": [
        {
            "prof_name": "Ken Light",
            "prof_id": 11868,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 19, 2015",
            "review_content": "\nThe worst professor I've ever had. The worst lecturer, cares waaaay too much about his class, nitpicky, critical, dry and uninspired. He finds joy out of forcing his students to sit through his monotonous lectures for three hours. He makes you do group projects that take weeks to complete. He needs to chill. I don't know why he hasn't been fired yet. \nWorkload:\nUGH something dumb and boring every week that no one cares about\n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 19, 2015",
            "review_content": "\nAvoid him at all costs. He will harass you and threaten to fail you. He tries to find a reason to get you in trouble and will make one up if he has to. His classes are unnecessary and tedious. A total waste of time. \nWorkload:\nRidiculously long, boring and heavy. \n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 14, 2015",
            "review_content": "\nHonestly, I am outraged seeing the comments below.  I don't know how anybody can claim that Ken Light is a good professor, because frankly he is the worst professor I have had in my time here at Barnard.  The reasons are many, so I decided to number them:\n1.  Do not think that he cares at all about your success in this class.  He does not.  He can and WILL dock you about ten points for slight formatting errors, not caring at all that this is an intro class and we don't all know how to write perfectly formatted APA papers.  Today, he walked into class and announced that no one had done as well on the essays as he had hoped.  As I looked around me, I saw seventies, eighties, and nothing in the nineties.  The man does not like to give good grades, period.\n2.  His absurdly harsh grading might be understandable if he only explained assignments well.  Once again, he does not.  You would think somebody would realize, if less than half of the class got a decent grade on a paper, that he was doing something wrong as a professor.  He truly does not explain the formatting thoroughly, and WILL dock you points if you get something wrong that he didn't explain thoroughly.\n3.  His comments on papers and presentations are rude, abrasive, harsh, and bordering on unprofessional.  He has no problem telling you that your slight formatting error is \"completely and totally unacceptable\" or that you \"would have been docked more points if I wasn't being nice.\"  Simply put, he's mean.  He will make you feel bad about yourself.\n4.  Once again, I can't stress this enough - it is absurdly difficult to get good grades on certain assignments.  Often times, it seems like it all boils down to luck.  You're honestly lucky if you get all his nitpicky formatting right.  And if you have a bad lab group, good luck; he WILL decide he doesn't like your lab group, and he WILL target you and grade you unfairly.\n5.  This brings me to my next point.  If he doesn't like you for whatever reason, and it could be the fault of someone in your lab group, he will grade you unfairly.  \n6.  Come on, guys.  I shouldn't see a classroom full of seventies and eighties on papers; he obviously gets pleasure out of giving bad grades.\nThere has to be better lab professors.  If I could have not done a lab this semester and held off until I could have a better professor, I would have.  Ken Light was not worth it.  A 1.5 CREDIT CLASS SHOULDN'T BE MY HARDEST CLASS, AND IT SHOULDN'T BE THE ONLY CLASS INDUCING PANIC ATTACKS. \nWorkload:\nAbsolutely ridiculous for a 1.5 credit class.  You will have an assignment every week, and good luck not getting anything wrong.  Maybe you'll write your name wrong in the heading and get ten points knocked off...(not even an exaggeration.)  It's pretty obvious that he gives us busy work (who doesn't love making twenty graphs on Excel and learning nothing useful) because he's insecure that it's a 1.5 credit class and wants to prove that he's a big guy.\n"
        }
    ]
}