{
    "prof_info": [
        {
            "prof_name": "Keith Moore",
            "prof_id": 875,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 21, 2005",
            "review_content": "\nThis class was somewhat strange, especially after having such a positive experience with Art Hum. Not that it's a difficult class, it's actually really easy. But between Keith's baby and unexplained absences, we fell way behind in the book, and our coverage was less than complete. Prof. Moore is nice if not exactly an animated lecturer, and he really does stare nervously at his cell phone. He  Overall, the class was lackluster and I did not feel as if I got a whole lot from it. \nWorkload:\nA couple random homework assignments, 3-4 concert reports, 1 paper, 1 midterm and a final. REALLY easy grader.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 13, 2005",
            "review_content": "\nMaybe I am in the minority, but I learned a great deal from him. He is willing to go out of his way and meet with you outside of office hours, and certainly does not look down to his students. Its really what you want to get out of the class in a low pressure atmosphere which i am grateful for. Regardless of whether you are a music major or not, find a way to get in his class! \nWorkload:\neasy: couple of concert reports, and doable midtern/final. An A is def possible. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 10, 2005",
            "review_content": "\nAbout the nicest guy you'd ever want to meet.  Sadly he's too nice to make the class challenging and there was no rigor to anything.  His love and knowledge of music is obvious, but he was unable to rein in this unwieldy  curriculum.  There is too much the course tries to do, and in the end nothing meaningful is learned.     There were a few interesting classes such as analyzing music brought in by the students, but the material in general is pretty boring.   He also didn't seem to have enough time to grade things so he was remarkably lenient.  \nWorkload:\nClose to none.  2 concert reports (down from original 3), graded leniently.  Take home midterm took some time.  Final was free form piece of cake.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2005",
            "review_content": "\nWould you like an A without doing anything? Take this class. I didn't learn anything though, so be wary.\nWorkload:\nNo work.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 11, 2004",
            "review_content": "\nKeith is peacing out to Greece for a semester so he won't be teaching until Fall 2004 at the earliest.  On the first day of class, I literally wanted to shoot myself in the head at the sound of Keith's monotonous voice explaining to the class how the sound hits various parts of the ear.  Added to that, music hum is a two hour class (a 2 hour class that the CORE can very easily do without).  Anyway, I stuck with the class (few did).  Class always droned on (thank god for the Spec's daily crossword puzzles), Keith continued to mumble and I learned relatively little for a class of that length.  He's probably one of the more boring teachers, but he knows his material.  He is extremely knowledgeable about all aspects of music, but seems to have difficulty conveying that passion.  \nWorkload:\n2 concert repots, light reading, midterm, final.   Easy A if you can endure the four hours every week.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 01, 2003",
            "review_content": "\nWhat is wrong with all you people who are hating on Keith Moore?  I mean, yeah, if you really want to learn about music, you might be disappointed, but if you want an A, Keith is the way to go.  Keith is such a baller, it's ridiculous, he brings all these awesome Europeans in to class who scream and claim its music. Personally, I want a teacher who is always on his celly rather than blathering on about Western Music.  Dude, he gave us Halloween off.\nWorkload:\nShow up and sit.  Make a half-hearted attempt on the papers.  Or don't, my roomate only turned 2 of the 3 in and he got an A.  The tests are cinchy if you study a little *CULPA edit*\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 04, 2003",
            "review_content": "\nHe teaches material that is too deep and comprehensive for anyone in the class to understand.  His tests, however, are ridiculously easy.  He grades papers viciously, but those scores are curved and basically do not factor into your final grade\nWorkload:\nReading is optional, 3 papers, 3 2page concert reports\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 14, 2002",
            "review_content": "\nOn the first day of class, Keith seemed excited to teach us all about music. This enthusiam, however, quickly disappeared.  He became distracted and rambled through lectures.  Gradually, his behavior became more erratic and, at one point, he stopped coming to class altogether.  The several papers we handed in were not returned, and our  TA had no idea what had happened to them.  In the last week of class, Keith returned for  two good lectures.  These were the only classes in which I learned anything.  Overall, this was a huge waste of time.\nWorkload:\n3 concert reports, a few short papers, a midterm, a final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 03, 2002",
            "review_content": "\nMy God! Although Keith had a promising start, something serious must have happened to him somewhere mid-semester, like being abducted by aliens, because he became a walking space case. Not only do his monotonic and horribly boring 2 hour lectures (no break) invoke physical spasms of cramping pain in your back from sitting for so long, but at the end of class you realize that you have learned absolutely nothing! He didn't return our first paper(we had 6) until the second to last class, so we had no idea if we were doing them completely wrong or not, and he would mysteriously disappear for weeks, usually out of the country pursuing his career, which was obviously much more important than his professorial responsibilites. Halfway through every class Keith would take out his cell phone and place it on his desk, watching it obsessively. Honestly, I became worried about him when he abruptly left class in search of his missing backpack. If you want a hari-kari inducing experience and to totally hate western music, then take this class.\nWorkload:\n3 concert reports, 3 short papers (3-4pages), midterm (easy, but the promised ExtraCredit was never delivered), final. easy, short readings.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 21, 2002",
            "review_content": "\nIf you're looking to actually learn a few things in music hum and occasionally even enjoy yourself, take Keith Moore's class. Though his voice isn't always condusive to staying awake (it's soft and sort of soothing--at times you'll want a nap), his lectures convey he's knowledgeable and interested. Lectures sometimes go off on tangents, but don't worry; he eventually clarifies the confusing topics and tests mostly from the book. He's very approachable, too.\nWorkload:\n4 concert reports, the last one being 5 pages w/research (the others are 2 pgs). A couple of midterms (very easy if you read the book), final was short, quick, and pretty painless. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2002",
            "review_content": "\nIf you're looking to get a real expert on modern music, you'll love Moore. His lectures are not the most engaging in the world, but they are very relaxed.\nWorkload:\nA couple of midterms that are very easy if you did the studying. His final is multiple choice and true/false. You have to attend four concerts and write up reports on each of them. One of the concert reports has to be a longer paper ~5 pages long.\n"
        }
    ]
}