{
    "prof_info": [
        {
            "prof_name": "Abhay Narayan",
            "prof_id": 9819,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Mechanics & Thermo",
            "review_date": "December 30, 2011",
            "review_content": "\nThis class was so f****g hard.\nIn class, all that was taught was straight from the book. Only go for the demonstrations, which were all pretty cool; he always involved one of us as a \"volunteer\". \nThe problem sets were nothing short of the hardest problems in the back of the chapter, and were often sprinkled by totally impossible ones that he wrote. So, as a result, on such psets you'd find the class average online much lower than those when it's only from textbook - for one reason only: everyone copied the answers from widely available resources. This is an unfortunate result of Abhay's extreme assessment tactics, namely finding the hardest things to ask you. If the questions were more fair, more people would give more time to figuring them out. It came to a point where few bothered.\nThere were two midterms, and unfortunately, not one was dropped. They were, as someone else wrote here, EXTREMELY HARD, and unfairly so, because what he taught in class was so much easier (right, you have the homeworks to remind you just how hard things can be). Also the Final. It seems that he always asked the most difficult version of the most difficult topics, and this was widely agreed upon among classmates. For example, it wasn't enough that it was about rolling motion, torque, slope, etc, on the second midterm - he had to ask about something being rolled up, by a force that is magically \"turned on and off\", as a question worth 20 points. In the first midterm, it wasn't enough to test our knowledge of projectile motion; he had to ask about the Range equation, and asked to figure out the degree angles the projectile should be shot at. This is the last paragraph in the entire chapter about projectile motion... What's more important? The 85% of the chapter, or that part that is really an unfair thing to ask on the first midterm?\nKeeping up with the work is quite challenging. We covered chapters 1-14 and 18-20 in 3 months. \nHowever, what's nice (and stupid) about these kinds of courses, is that the curve is really great.\nWorkload:\nTough. You get this guy, do your best to answer as much as you can on the tests, even if you know you're off. Grading is generous because otherwise everyone would walk away with zeros.\n"
        },
        {
            "course_name": "Electricity and Magnetism",
            "review_date": "May 20, 2011",
            "review_content": "\nAbhay (he'll threaten to take off points if you call him professor), is easily the nicest professor I've ever had at Columbia.  While his HWs and Quizzes are VERY HARD, he drops the lowest few of each.  He's very approachable for a beginning lecturer, and is willing to push off HWs and quizzes for holidays, something almost no other professor would do.  His tests are standard for physics - very hard - and his teaching is pretty standard as well - from the book.  He's a great guy, took the class to the faculty house for lunch (don't expect this every year), and it was a pleasure to meet him.\nWorkload:\nStandard for a physics class, 13 HWs (2 were dropped)\nabout half as many quizzes (some were dropped)\nand a hard midterm, final\n"
        }
    ]
}