{
    "prof_info": [
        {
            "prof_name": "Catharine Nepomnyashchy",
            "prof_id": 3981,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Nabokov",
            "review_date": "December 24, 2013",
            "review_content": "\nThe Positive: \nCathy is incredibly knowledgeable. She's currently writing a book about Nabokov, and will often come to class with little anecdotes from her research. \nShe is definitely interested in her students and is great at interacting with those at different levels of background knowledge of literary criticism. There were some students in our class who knew all the critics she was referring to, and others who had no idea (like me), but I think that everyone on the spectrum came away feeling a little smarter afterwards. \n -She's just an incredibly pleasant person. I went to office hours and ended up sitting there for over an hour chatting with her about the texts and the other works that Nabokov dances with throughout his writing. She will really work with you if you're having trouble understanding any concepts.\nThe Negative:\n As the previous reviewer said, Cathy is definitely scattered. You will always know your reading assignment, but little else. You'll get courseworks questions sent to you the day before they're due in class (\"due date\" is a fluid concept with her generally though, so you're fine). \nI never personally found this, but some students could find her somewhat dismissive of their ideas on the texts. The only thing I might knock about her interpretation is that she doesn't want to talk about sexual politics which anyone who has read Nabokov will get is a huge, huge deal.\nThe Verdict:\nSomething I loved about this course is that it seems to be much less about grades and papers and much more about learning how to read and appreciate Nabokov for the rest of your life. Frankly, the reading alone makes the class totally worth it because Nabokov is a genius (i.e.: DO NOT take this class if you don't do the reading)\nDEFINITELY A COURSE WORTH TAKING.\nWorkload:\nReadings~around 200-300 pages per week, depending on the work and how dense it is. \n5-6 'rough' courseworks discussion board posts\nIn-Class Midterm (we had an 8-page paper instead because our midterm couldn't happen on the day it was supposed to)\nIn-Class Final -- Easy. You're allowed to have a computer.\nLight workload, lots of reading. \n"
        },
        {
            "course_name": "Nabokov",
            "review_date": "August 16, 2009",
            "review_content": "\nProfessor Nepomnyashchy can barely keep her head on straight. The course requirements were outstandingly vague, emails went unanswered, and sometimes the majority of a class would be spent discussing topics tangentially related to a single sentence in a book's introduction.\nThat said, the class was surprisingly enjoyable. The books are all great reads, and the insight Nepomnyashchy provides is invaluable. \nHighly recommended for anyone who never got past Lolita.\n\nWorkload:\nNot bad. A decent amount of (enjoyable) reading, weekly discussion posts, in-class midterm and final.\n"
        },
        {
            "course_name": "Legacies of Empire & The Soviet Union",
            "review_date": "January 12, 2009",
            "review_content": "\nThis team taught course was a creative disaster of epic proportions. Cathy is an affable but rambling literature professor obsessed with her first person knowledge of Russia and its scholarly cognisenti. She cannot resist to tell you one more story, and she will even as time ticks away and the ten articles read for class go undiscussed. Alex Motyl is cool and aristocratic, lays down great theoretical structures for understanding political and economic change to the post-USSR world, and gives dish about other folks in former Sovietology - he's hilarious and speaks like the cowardly lion. \nTogether they spent 1/3 of each class alternately laying out theory and blabbing, then had students give presentations on the dense, often outdated and heavily Russian focused literature. Since this class is required for Harriman Certificate folks, there were a lot of bright people from all over the world and that made the class worthwhile.\nWorkload:\nTons and tons of reading, most of it overlapping and much of it tightly focused on Russia. The upside is that one really needed read more than a few pages of it to get the gist, and that many folks in class had broader understanding of the historical events than the authors did. One in-class presentation, one response paper and one final paper. Don't expect to get your grade in a timely fashion or to get feedback. These people are busy.\n"
        },
        {
            "course_name": "Cities and Civs: Intro to Eurasian Studies",
            "review_date": "August 29, 2004",
            "review_content": "\nIt's hard to give an accurate impression of Cathy if you haven't met her or sat in on one of her lectures. That said, if you take this class with her, expect a mixed bag. The readings were generally well-\nchosen, and she and Professor von Hagen combined media like literature, photography, video, and art in an attempt to show students the flavor of each city. Having taken the class and having later visited Moscow and St. Petersburg, I can tell you that despite their efforts, no class can come close to the real thing. However as I walked through Ploshad Dekabristov and the Kremlin, I found myself reliving the stories I remembered from class. In short, it will give you a basic knowledge of Eurasian cities, and quite possibly a love for them, but will also show you just how much you have left to learn about them. Its angle is particularly valuable because it focuses not on the broad scheme of the Empire's history, but on its diverse and unique regions. I'd say if you love Eurasia, take this class with a caveat (see workload). As for Cathy, she is a disorganized and overworked, but wonderful person. She is very relaxed, and shows genuine concern for her students. She is usually late, though, so if you go to her office hours bring a book. \nIt's too bad her spaciness often overshadows how great a scholar she is. Oh, and \"her\" city is Moscow, so she's a great resource about anything from the history of the city to where to eat once you're there. A gem of a professor if you can put up with the disorganization.\nWorkload:\n*Extremely* heavy and tedious. One example of a week's reading is Crime and Punishment AND 6 handouts (print them yourself online)... plus your weekly TA session and quite possibly a movie viewing. You also have to keep a journal the whole semester, and write responses to each movie you view. I am accustomed to a heavy workload and found this class nearly unbearable in that respect. You don't have to do all the reading, but it was hard for me to figure out what to read and you've got to know your stuff at least moderately. Luckily there is room for creativity in the assignments. \nThe class was also not very well-organized when I took it, so it may improve for 2004-2005. \n"
        },
        {
            "course_name": "Cities and Civs",
            "review_date": "December 18, 2003",
            "review_content": "\nOh dear. Where to begin with this class? See the workload below... besides that, Neppmnyashchy is a very nice and understanding lady. She has a meandering way of getting through a lecture - every topic gets brought in for like 5 minutes. She kinda puts everyone to sleep. But she's nice and willing to modify especially heavy assignments. \nWorkload:\nI know people who are seniors taking major seminars and thought this class gave more work than  the seminar. It's a huge amount of reading, plus weekly journal entries and movie reviews!! AHHH!! Everyone in the class bonded through the ridiculousness of the work load. There's a midterm paper (10 pg) and an easy final but the whole class is a lot of work.\n"
        },
        {
            "course_name": "Cities & Civilizations",
            "review_date": "July 17, 2003",
            "review_content": "\nThis course was SO much fun. It was co-taught by Professor Nepomnyashchiy and Professor Mark von Hagen, both of whom have lots of firsthand knowledge of Russia, so that there were always a bunch of personal anecdotes in between the textbook facts. (Professor Nepomnyashchiy was in Moscow on the day of the coup.) The course itself is supposed to be an intro to Eurasian studies. It combines history and literature and ends up feeling like a whirlwind tour through the former Soviet Union's most famous cities. So, for example, you study about the history of St. Petersburg, and then you read Pushkin; you study the history of Moscow and read Bulgakov. During every lecture, there would be various pictures projected on the wall, so you can sort of get the \"feel\" of the city. It's definitely a must-take for anyone interested in Russia and the former Soviet Union. I took it the very first semester it was offered, Spring 2003, and, from what I heard, they are planning to make it even better. If you like to read (or write) historical literature, don't miss this. Note: There is a weekly required recitation section with your TA.\nWorkload:\nMovie reviews (but that might be cut), lots of reading (you can get away with skipping some, if you come to lectures - but there is lots of GOOD literature), basic final writing assignment, pretty easy final. The professors aren't too exacting, neither are the TAs - if you enjoy the class and do the work, you'll do well without too much trouble.\n"
        }
    ]
}