{
    "prof_info": [
        {
            "prof_name": "Andrew Nathan",
            "prof_id": 26,
            "total_reviews": 35
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 18, 2017",
            "review_content": "\nI highly recommend this course if you are a human rights major looking to fulfill your introductory course. Andrew Nathan provides a broad overview of the various aspects of human rights. The readings are really interesting, however they are very heavy and I wasn't able to do them all. Nonetheless, I still did well in the class and got an A. If you put in the work, this class is easy to do well in. There are 2 papers and a take-home midterm/final. Different TAs grade each assignment, so the grading can vary-- however, if you adequately and appropriately answer the questions, you should be fine! \nWorkload:\n(above)\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 11, 2016",
            "review_content": "\nA very interesting topic that is all but ruined by this class.  I took this class thinking I might want to concentrate in human rights. Well this class threw that idea right out the window. The professor is next to impossible to listen to (he sounds like the guy from Ferris Bueller’s Day Off), the TA’s grade weirdly.  On every thing I’ve turned in all the comments say “great!” “awesome point” etc and then at the end you get a B for not acknowledging enough counterpoints. Sorry buddy its only a 7 page paper what would you like me to do? If you’re majoring or concentrating in HR then you have to take it (I’m so sorry) but if not don’t bother. It's not an easy A even though it should be.\n\nWorkload:\ntwo papers, takehome midterm and final. each thing is graded by a different TA so you never know exactly what to write\n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "May 08, 2015",
            "review_content": "\nI literally never did any work for this class. If you're a poli sci major and you don't want to do anything (as in not attend classes, not attend discussion sections, not do readings), this is THE class for you. \nI had really high hopes for this class given Andrew Nathan's prestige and all, but I found that I was ALWAYS put to sleep by his voice. There's something about it that is so monotonous that it lulls me to sleep and there really was no fighting it. Additionally, Professor Nathan's lecture style is horrible in that the trajectory of his sentences reflect his train of thought. Horrible for taking notes--I gave up and stopped attending classes. \nI literally didn't attend lecture, discussion section and did not do any readings for a good two months. I completed two papers that were unrelated to things covered in lecture and got no points off on the take home midterm. I have never received a better score on a midterm than I did in Professor Nathan's class (keep in mind that I literally did not attend class). \nI'm not going to lie and tell you that I learned so much in this class because to be honest, I did not. I think I came out with the same amount of knowledge about China and \"Foreign policy\" in China as I had when I first entered the lecture with high hopes in January. \nWorkload:\n2 papers, one take home midterm, one take home final.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "May 23, 2013",
            "review_content": "\nI loved this course although never did any of the readings... because they are not incorporated into his lectures at all, he does not test you on the material. That being said, you MUST go to the lectures because a lot of the short answers he asks on the midterm and final are word for word quotes from what he said in class. By taking decent notes you will do well in this class. The 2 exploration papers I thought were great, no vague poli-sci intro theoretical question, you get to chose exactly what you want to write about. I chose Srebrenica for my first paper, a pretty obvious topic, and got a B+ even though I thought it was a good paper. For the 2nd one I chose the Omar Khadr case (a canadian afghan minor detained in guantanamo and tortured for being accused of working as a terrorist) which was more obscure and also current events got me which got me an A (I think because they hadnt read it 5000 times unlike my first paper). The exams are decent, I went to most of the TA sessions which were really helpful and interesting, but I basically got all my knowledge from the lectures. This class made me want to become a human rights major actually. TAKE IT! You will definitely enjoy it and it isn`t a lot of work, trust.\nWorkload:\n2 papers, 1 take-home midterm, 1 take-home final\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 06, 2013",
            "review_content": "\nI had been looking forward to this class since enrolling at Columbia. Never had a chance to formally study human rights before, and since this is one of the only courses explicitly offered by the human rights department it seemed like a showpiece for the new undergraduate major. Nathan is a nice guy, the TAs are all brilliant, and they obviously care about the students. Doesn't matter...Wikipedia scratches the surface of human rights - in theory, real-world practice or academic use - more than this class does.\nYou can skip the lectures if you're not interested in the subject. Nathan lectures, too quickly and without slides. He defines things like women's rights by pointing to the relevant UN treaty and talking about how it is bad to hit your wife or discriminate based on gender because the UN says so. I suspect that if the UN hadn't been able to pass the treaty, he would be okay with skipping it because that would mean it wasn't officially a human right. Rinse and repeat for refugee rights, indigenous peoples, and the rights of businesses. Don't expect something more complicated like delving into the prohibition on cruel and unusual punishment or the death penalty. Don't expect a thorough discussion of a framework or terms that will help you in future human rights/polisci classes.\nI even bought all the books! Not that I had to. Just wanted to ensure that I kicked ass in my major's course. This was a mistake. No one kept up with the readings, including myself. They seemed relevant but weren't integrated into the material at all. None of the previous students or human rights majors in the course with me read anything more than the one main book (Neier) at best. I also only went to one (optional) TA session and never saw the professor because I didn't want to be grilled about untouched readings.\nAs a transfer student, I don't have enough time left to change my major. After taking this class, I would if I could. THIS is the foundation of a top human rights department? An entire semester almost entirely devoted to memorizing different, transient UN bodies and treaties? Not a word about conflict resolution, or peace and justice studies, or the workings of social movements, or...?\nWorkload:\nTwo essays - either an \"exploration\" of a topic or a book review, plus a take-home midterm and final. Each of the four TAs graded one paper. One time, Nathan accepted an essay several hours after it was due when I slept through class.\nI got an A on everything and in the class. I worked hard to show off but it's probably an easy B or above even if you're not a social sciences major.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 22, 2012",
            "review_content": "\nI really took a liking to Professor Nathan, but really for no reason.\nHis lectures were interesting when I paid attention, but I really had no motivation to do so, as they had nothing to do with the readings, and the assignments had nothing to do with the readings or the lectures.\nThe reading list was the longest thing I have ever seen in my life, but was irrelevant to the class.  I think I may have done one reading the entire semester.  \nThe papers, \"Exploration papers,\"  were very fun to do, but again, had nothing to do with what we learned in class.\nI did the entire midterm by googling the answers, and got an A+.  \nIf you're looking for an easy class, take this one.\nif you're looking to learn a lot about human rights, don't take this one.\nWorkload:\nA joke - two papers on any topic, take home midterm & final that can be completed without any of the readings\n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "July 18, 2012",
            "review_content": "\nThis is one of the most interesting classes I took at Columbia. Professor Nathan is the nicest professor at Columbia and if you approach him with any questions, he would very pleasantly greet you with the answers. If you are not sure about what to write for your papers, ask him! He would help you with the proposal as well as giving you the instructions on how to best write it. Also, the TAs/Grader are nice people too as they reward you with good grades if you have worked hard enough on your assignments and they answered you inquiries (with patience) when you are in doubt. I also find their grading as well as comments for the mid-term and papers very helpful. I improved in other assignments after following their remarks.\nIf you are interested in one of the most important countries in the world, take this class! You will understand China in depth!\n\nWorkload:\nLight to Medium - two take-home exams and two light papers! \n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 26, 2008",
            "review_content": "\nAndrew Nathan is by all means a genius. He is a renown scholar in both political science and human rights, with an emphasis on China. However, these classes do not match the enthusiasm surrounding him. While he has many interesting and insightful points to make in class, his lectures are largely disorganized. He does not use slides, and instead, allows for a seeming oral free-for-fall, touching on any topics that seem to come to mind as they concern the topic of the day. As should be expected, he is enlightening, but again, only to a certain extent in his capacity as professor for this class. Form a group and share notes; there is no way any one person can gather all his says in one sitting.\nOn another note, Nathan is amazingly personable. Given his level of domestic and international fame as a scholar, he is nonetheless willing to meet for more than a half hour for first-year undergraduates. If you don't like a grade a TA gives you, he will meet with you to talk it over. And if he finds your arguments legitimate, he will change the grade for you -- that simple! In the end, I would definitely suggest this class. Just do not get your hopes TOO high. He deserves praise, but his mainly disorganized lectures are often a drag. \nWorkload:\nThe LONGEST reading list I have ever seen. You need not read all of them, skimming is fine and perhaps necessary, but this is not true is you want to attend the optional discussion sections, which many say are rewarding. 2 papers and midterm and final -- All are take-home and are each worth 25% of your final grade.\n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "June 12, 2008",
            "review_content": "\nI have no idea how so many of these reviews can be bad -- Nathan's Chinese Foreign Policy class was awesome. In fact, he was awarded a Columbia teaching award this year for the class. He's laid-back, so you might think he's a goofball, but he's a brilliant guy and a superstar in the world of China Studies. And unlike most famous professors, he pours his heart and soul into this class -- you can tell he prepares a lot for each class. Unlike most professors, he doesn't get frazzled if a student asks him a question or even corrects him. He takes in everybody's comments, reflects on them thoughtfully, and gives really valuable feedback. In my three years at Columbia, this was definitely one of my favorite classes.\nWorkload:\nTwo papers, a take-home midterm, and a take-home final. \n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "September 06, 2006",
            "review_content": "\nThere is some good to say about this class, but not much. I did not go to class after the first two or three weeks. I soon realized I might die of boredom if I continued to go, and since he wasn't actually saying anything, it didn't really matter anyway. I did not do the readings. I should have, I know, but they were copious and somewhat intimidating. And I did not go to discussion sections. How could I without doing readings or going to lecture? Anyway, the good is that somehow, without ever having taken a class in human rights before, I managed to pull off an A-. So if you're looking to get an A for under 10 hours of work during the whole semester, take this class.\nWorkload:\nNone\n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "June 18, 2006",
            "review_content": "\nUnlike the other reviewer, I don't like Professor Nathan and his A-. Surely this class is considered easy with relatively little work, but it is filled with too much political correctness to be a great class (watch out those annoying people--they love to show off their lack of knowledge and reiterate their random sinophile, perhaps to appeal Nathan). The lectures are best characterized by Nathan's constantly scratching his head saying that his lectures are out of control, and a glance at the syllabus/reading list tells you how little effort Nathan seems to have put into teaching the course. Most of the concepts/arguments are outdated, and there is no topic assigned for the two essays. Instead students are left with several pretentiously ambiguous categories of writing to work on (which sounds nice at first, but actually a waste of time for students to come up with something \"interesting\" to write...). Choose your topic wisely (because of the whole political correctness thing).\nWorkload:\nTwo essays, take-home midterm and final.\n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "May 21, 2006",
            "review_content": "\nGreat course.  Though DEFINATELY not for the conservatives or realists out there.\nEspecially good after Bernstein's modern chinese politics in the fall.\nNathan is really likeable.  Easy grader...i would be shocked if 90% of the class didnt pull an A- for turning in their work.\nAnd...if you're actually interested in learning, do the reading and you'll be a stud.\nWorkload:\nI love you and your A-, Professor Nathan.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "March 21, 2006",
            "review_content": "\nEveryone here has done a pretty good job at explaining Nathan.  He's fairly nice, just a little arrogant and doesn't really know how to teach.  Assumes that you have a lot of knowledge about political theory that you may not have -- I for example am majoring in human rights but NOT polisci, so had no previous political theory knowledge (not to mention that it's supposed to be an intro course).\nI am now taking the Barnard colloquium, taught by Peter Juviler, \"Human Rights in a Diverse World,\" which has essentially the same syllabus, except I'm actually learning stuff this time.\nSo my advice is: If you're a polisci major, don't take this class to fill a requirement, find something else.\nIf you're a Barnard student who wants to take this to fill a 9 ways of knowing requirement, I guarantee there are better courses you can find to fill it.\nAnd if you're a human rights major and think there is no way around it, you may or may not be right.  I'm not sure about Columbia students, but I know Barnard students who avoided taking it by taking the colloquium (taught by Juviler) first and then claiming that they didn't need to take the intro class cuz it would be pointless.  It's a small and new department so things like this are easy to get around.\nMy point is, unless you think there is absolutely no way around it, don't take this class.  It's not awful, just a complete waste of time and -- especially if you're going to take more human rights classes in the future.\nOh -- if you do take it, my one piece of advice is to go to class during the guest lectures.  There are a fair amount of these and almost all of them were amazing.  It was just Nathan that sucked.\nWorkload:\neasy easy easy. you don't have to go to class as the final and midterm are take-home.  the papers are easy too but unfortunately some TAs are easier graders than others, and most TAs are easier graders than nathan.  you don't have to do the readings either. also extremely extremely leniant about deadlines.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 05, 2006",
            "review_content": "\nThis class started off interesting, but it was all downhill from there...while many of the guest speakers were really interesting the class is not worth your time...Prof. Nathan's lectures were useless and offered nothing of substance...he gets up in front of the class without a plan and just babbles on, and he will continue to babble until the end of class because he does not believe in ending class even one minute early...This class was just awful and the assignments were even worse...with six TA's and no real standards set, grades are arbitrary and you never know what you are going to get...it's really unclear what the TA's are looking for when grading your work...Overall, although the class may seem interesting when you read about it, stay far away if you can...it is just not worth the frustration\nWorkload:\nnot bad...2 \"exploration\" papers, take home mid-term and final...no need to do the reading ever...grading is arbitrary though\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 12, 2005",
            "review_content": "\nOverall this was a pretty good class - the lectures are usually engaging, and the readings (when I did them) were great. It's generally not too hard, although if you get Nathan himself and not one of the TA's grading your papers, you'll be graded pretty harshly. He's an interesting guy - and the lunches that he invites students to (randomly) are awesome - definetely go if you get the chance. \nWorkload:\nPretty light, but the grading on the papers can be really lenient or really harsh depending on which TA (or Nathan) grades your stuff.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "November 14, 2005",
            "review_content": "\nWorst professor ever. The first few times I went to class, I thought he was kind of cute. After that, I just realized that he made cute little remarks to hide the fact that he never makes any points and he keeps repeating himself. Sometimes, it is difficult to keep from screaming, \"GET TO THE POINT!\" I don't recommend this class. If you are interested in human rights, it will turn you off. If it is possible to take this class with any other professor, DO IT. \nWorkload:\nExtreme amounts of reading. Take home midterm and take home final. Two 5-7 page papers. Optional discussion sections.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 19, 2005",
            "review_content": "\nIf you want a class filled with hippy, yet dumb students and reading that is far from necessary take this class.  Prof. Nathan is a big name in his field and you can tell he knows tons about the material.  However, the class is full of guest lectures that mostly tell you of their personal experiences and fail to actually teach the class human rights concepts.  The workload is minimal and I know so many people that never showed up to class and did fine.  \nWorkload:\n2 explorations papersÂ… they require you to write about a human rights violationÂ… nothing more.  Take home midterm and final.  Grading is harsh\nÂ… as inÂ… an A- is doable, but an A is hard to attain.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 03, 2005",
            "review_content": "\nthe subject matter is very interesting, and there were many interesting readings, unfortunately it seemed to be somewhat meaningless. every week they'd ask how many people had done the readings and five people would raise their hand. professor nathan's lectures werent that interesting, however it was co-taught by prof. celermajer and her lectures were somewhat better. all in all, not a hellish class but not an amazing one either.\nWorkload:\n2 papers (5-7 pgs each), take home midterm, take home final, LOTS of reading that you dont actually have to do\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 31, 2004",
            "review_content": "\nProf. Nathans and dany definitely know their stuff.  However I must admit that the class was really boring.  You can do really well in the class without reading all the materials.  For the essays, you can write about anything.  If you want an easy class to take, this is it!\nWorkload:\nnot hard at all. 2 papers, 1 take home midterm and one final\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "November 13, 2004",
            "review_content": "\nNathan is a great professor, if a bit disorganized. He's totally approachable, flexible and an overall nice guy. This class will get you aquainted with the basics of international law and give you a good sense of the human rights regime. The other lecturer who teaches with Nathan, Danny Calermajor is also excellent, and they play off eachother very well. With the addition of some very interesting guest lecturers, the class (on a subject which can be dry at times) maintains an interesting dynamic. Very worth it, will make you consider a combined major in Human Rights.\nWorkload:\nVery reasonable workload. 2 papers on anything you want to write about and two take home exams. Do the reading and you will get a lot out of this class. If you don't do the reading you can still do just fine.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 11, 2004",
            "review_content": "\nThis is a good class to get you acquainted with the study of human rights.  Nathan is approachable and fair, and his lectures are engaging enough.  The class isn't hard, but there's a lot you can learn if you choose to do the readings, and it's not a big deal if you choose not to.  \nWorkload:\nNot bad.  2 5-7 page papers, take home midterm, and take home final.  Moderate reading load, although you don't have to keep up with the readings to do well.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 06, 2004",
            "review_content": "\nI'll have to disagree with the last review. Yes, Nathan is a little incompetant and disorganized at times, but amusing at the least. Nevertheless, his lectures weren't all that bad. The class is interesting lectures (including Nathan's) were interesting as well. I would reccomend this class.\nWorkload:\nNot bad, definitley do-able. Heavy reading, but definitley don't have to do it all.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 07, 2003",
            "review_content": "\nThis is the second year the course has been given, and this syllabus provided a variety of class experiences.  There were lectures twice a week, including many guest lecturers successful in the field.  There is a lot of student participation compared to most introductory courses, with discussion in the lecture, some times more than others, and there was a weekly discussion group for each TA (3 of them), not obligatory, but interesting, helpful, and fun.   Profs. Nathan and Hertel both provided 2-hour office hours, as well as TAs.  There is support from the TAs, profs and the human rights undergraduate staff if you want to take advantage of it.  The core of human rights, we learn,  is respecting human dignity, which is pretty much repeated in all major human rights documents, Prof. Nathan is an extraordinary professor, he likes to teach and to encourage students, and he started this course, and without him, none of the other political science TAs, who were immensely popular assisting him in this class, and Prof. Hertel, who just obtained her PhD here,  would have had an opportunity to show themselves to us.  A final point made about the class by a TA was that she hoped students should take away a sense of what human rights are and how they can add to that debate with their own concerns about rights.  For that reason alone, It is a very worthwhile class, providing a really rare and desirable academic foundation.\nWorkload:\n There is a lot of reading, but some of it has to be read quickly and lightly.  The papers are not difficult, and you can choose your topic but use the readings to provide special vocabulary and references for your work.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 04, 2003",
            "review_content": "\nIn response to the previous review about the Fall 2003 course with Prof. Nathan and Shareen Hertel, it was unfair and not in the spirit of the class.  Prof. Nathan made the point that in fact, when the UDHR was written, people with handicaps tried to play them down, including the president, and the first drafter.  It's a historical perspective.  The student in referring to the first drafter who wrote it with only one arm seemed to be referring to the idea that because the first drafter was handicapped, he would naturally include consideration for that.  The TAs along with the professors set a great example of freedom of speech and opinion, and sometimes even entertained us with their differing points of view on topics.  Students are free to express themselves in class and discussions.  It is not appropriate to sound off with pet peeves that the previous critic has, that should, in reality, have been thrashed out first with the students and/or profs in class or groups.  The judgments are just as stupid as the projection upon the professor, who is brilliant, kind and friendly.   A good class.\nWorkload:\n2 essay projects, two take-home exams, including final.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 03, 2003",
            "review_content": "\nProf. Nathan is the least intelligent Prof. I have ever had and has no problem displaying his incompetancy at every turn.  I will never forget his comment on the Women's Right Movement, which he so eloquently compared to a \"child wanting a cookie....if you give the child one cookie they are just going to keep asking for more cookies!\"  Yeah....uh huh.  My roommates and I still laugh about that one.  Or, when he was talking about the UDHR he said that the writers did not have in mind any rights being claimed by disabled people, for example.  When a student called him on it, he said he had in fact \"forgotten about the one-armed Canadian that drafted the darn thing.\"  The list goes on.  Although Prof. Nathan is a joke, his co-teacher, Shareen Hertel, is my new hero.  She is totally intelligent, and articulate, and saves the class.  Prof. Nathan needs three other T.A.'s to cover his verbal blunders, but Candace, Juntao, and Dani are awesome.  The class is a winner, definetly take it, just skip all of Prof. Nathan's lectures.\nWorkload:\nNot too bad.  Two in-depth research papers on anything you want to write about in Human Rights.  Take home midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 22, 2003",
            "review_content": "\nI had him for first semester CC.  Class usually started with a short presentation of the book, and then a guided class discussion.  I found him to have a very good knowledge of the text, and the discussions to be interesting.  If the discussion lagged he would take a larger roll, if kids had a lot to say he would let it flow naturally.  He was pretty good about keeping the kids who liked to hear their own voice in check though.  He clearly liked the material, and enjoyed teaching the class.  He is very open minded and won't stiffle your opinion or grade you down just because he disagrees with you.  On both my midterm and final he made a point of saying he disagreed with my position, but felt i presented/argued it well and gave me good grades.\nHe specifies pages and sections of books to read.  The assignments are usually manageable, although he gets a little carried away with \"The City of God\" and he assigns huge swaths of the Koran.  I slept through some classes with no problem, also enjoyed class discussions.  As long as SOME people in the class are talking and discussing he has no issues and lets sleeping dogs lie.  The class is obviously better if you actually read the material, but you can get by with just skimming as long as others actually read or are good at BS'ing.    Definately a better than average professor.\nWorkload:\nTake home midterm, take home final.\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "April 25, 2003",
            "review_content": "\nHorrendous lecturer who I am doubting whether actually wrote the Tianmenan Papers. Nathan is kept on since he is a beautiful writer. However, as a professor, he failed to provide examples to back up his lectures, if he actually remembered what he was talking about. At the least the TA knows the topic well\nWorkload:\neasy. You could read three books for the whole semester and receive an A\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 31, 2003",
            "review_content": "\nNathan is rather condesending to his students, and his cc class eentually really is a polisci class. his grading is okay not too stingy and napping time in the second hour of every class is essential...\nWorkload:\nstandard cc, you know...\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "January 20, 2003",
            "review_content": "\nThis class had the potential to be very interesting...unfortunately, Nathan killed it. There was a lot of reading (some of it actually interesting) which turned out to be completely unnecessary. The lectures wandered and were incredibly boring. Most of the class didn't come, and those who did were often doing other work.\nWorkload:\n2 papers, take-home midterm and final\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "November 12, 2002",
            "review_content": "\nAt first, I was really excited about this class. Then the novelty or something wore off, and i realized how disorganized and almost not fair this class is. the readings are great, but class is part summary of the readings, part Nathan's random thoughts. Class was disorganized, and Nathan always explained the papers after we handed them in. the best part of class was when he had guest lecturers come in. if i had to do it over again, i wouldn't have taken this class. \nWorkload:\nwhole lot of reading- almost two books a week. two 5-7 pg papers, poorly explained, and a take home midterm and final. \n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "September 09, 2001",
            "review_content": "\nAndy Nathan is something of a bigshot in Chinese political scholarship, known for not liking the Communist Party. He got lots of press for publishing the Tiananmen Papers. He's even a nice man and a very nice advisor. Given all that, you'd think he would be a bit more interesting as a lecturer. I fell asleep in every one of his lectures. I expected to learn more about the cryptic and mysterious Chinese side of foreign policy formation, but Nathan teaches essentially a course on American policy towards China and an American view of other countries' policies towards China. He likes to involve student discussion into classes, which is nice, and the EP-3 incident spiced up all our lives. But the lecture content itself is pretty predictable.\nWorkload:\nThe reading list is insane. But Nathan and his TA tell you that you don't have to read all of it. one paper and a takehome final, but don't expect them to be easy on you as an undergrad. The discussion sections were useless.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nAs a China scholar, Nathan doesn't know much more about the books than you do. For historical background he may ask some of the smarter looking and sounding students in class for their 'expert' opinions. Doesn't add much too the books, but doesn't destroy the course either.\nWorkload:\n3 papers (3 pages each), Final exam.\n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "December 31, 1999",
            "review_content": "\nThis class is great for those who want to understand the basics of the Chinese view of the world and the Chinese policy goals and methods in interacting with other nations. Andrew Nathan understands the importance of including history when explaining current Chinese policies. His lectures, more often than not, entertain the class and they are almost always clear and informative. There are two 4-6 page papers, one midterm and a final. Both are take home papers. Grading is easy, and the class is a taker.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nMany CC professors have that annoying way for you to keep up on readings-weekly responses, questions, whatever. Not Prof Nathan. He is one of the most laid-back professors i have ever had. He is aware of the fact that half of the class is asleep or doing other homework, but he doesn't seem to really care. Since China is his specialty, he often goes off topic, but that just means you, too, can talk about anything when you're discussing the readings. Inviting us to his house for dinner, giving extensions when we whined, I thought he was an all around cool guy.\nWorkload:\n2 papers. one TAKE HOME midterm. one TAKE HOME final. =) \n"
        },
        {
            "course_name": "Chinese Foreign Policy",
            "review_date": "December 31, 1999",
            "review_content": "\nAn excellent class for those interested in the future of both Chinese politics as well as United States foreign policy. Nathan is certainly one of the big names in the China field, so you get to hear the latest developments from the horse's mouth. As one of the co-authors/translators of the Tiananmen papers as well as writing the introduction to the Mao biography by Mao's doctor, Nathan is someone worth going to class for. It's interesting.\nWorkload:\ntake home midterm and final\n"
        }
    ]
}