{
    "prof_info": [
        {
            "prof_name": "Zachary Roberts",
            "prof_id": 11432,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "November 17, 2013",
            "review_content": "\nHad Roberts for University Writing American Studies section my first semester at Columbia and he was fantastic, by far my favorite teacher of the term. Spent a ton of time with all the students individually talking about papers, was very relaxed about policy, but partly because he was so respected by students he didn't need to be strict about it. He's incredibly interested and passionate both about writing and American culture (he's an English major working as an advisor in American Studies, so he was the perfect fit for the course). Classes usually consist of a table discussion he leads talking about cultural criticism essays we've been reading, a class style I'm usually not a huge fan of but enjoyed in this context, partly because in addition to the class discussion, Roberts is so willing to meet on an individual level and talk one-on-one about your writing.\nWorkload:\nMedium workload, seems like less than most other UW students I've talked to. Standard UW progression with four major essays, and in between we read 20-30 pages a week of cultural criticism.\n"
        },
        {
            "course_name": "Foundations of American Literature I",
            "review_date": "August 22, 2013",
            "review_content": "\nI took this class in fall 2012 but haven't had a chance to add my two cents about the class until now.\nDelbanco is a pretty great lecturer with a great handle on the material and very interesting points. My only complaints are that (1) he doesn't follow the syllabus really -- by the end of the semester we were pretty behind on what we were reading for lecture, so sometimes lecture/discussion plans didn't match up exactly and some things we had to speed through and (2) I took the class in NoCo 501. Anyone who's ever taken a class there knows that it's almost impossible to stay awake every class. There's something about that classroom (the desks? the stuffiness? the heat?) that makes learning so much harder in there. I took another class there in the spring and it was the same deal. Avoid that room if you can!!\nThe reading list is great, I think the course title is pretty accurate. There's a lot of variety, from Puritan sermons to Emily Dickinson to Moby Dick/Melville's short stories. I really enjoyed the later works especially (Melville is great and there's a lot to think about there, plus Delbanco is an expert). I'll agree with the reviewer that you get what you put into it -- you don't have to do all the reading (I didn't, but wish I had had the time to) or attend lecture (no attendance).\nYou do have to sign up for a discussion section (attendance mandatory). I guess maybe I should have tried to get it with Delbanco but you just sign up for a time slot and I got Zach (Roberts). He was incredible -- a pretty laidback guy, very approachable, very knowledgeable, clearly invested in the class and the texts. I'm really glad I was in his section and I felt like I got a lot out of the 50 minute discussions because he was open to people's ideas and also tried to get our input on what we wanted to talk about. A decent grader and he left very insightful comments on papers. He was pretty flexible with paper topics -- there's one provided in the class syllabus for each paper but he let us explore whatever we were interested in in the text, and also he understood if we were a little behind on reading. I've heard that the other TAs were pretty good too, but obviously I'm biased toward thinking Zach was the best.\nAll in all, I really enjoyed the class. The discussion section definitely made it for me -- I don't think I'd have liked the class half as much without it (or understood the text half as well). \nWorkload:\nTwo papers, I think the first one was 3-5 pages and the second 5-7, something like that. The second one was about two pages longer than the first.\nNo midterm.\nChoice between final exam and final paper (8-10 pages). I chose the paper so not sure how the exam went but it was supposed to be some passage IDs, explications, essays.\nReading was doable and you could get away with not doing it all if you were busy. \nI don't really know how the class was graded but probably some combination of the above, plus discussion. The TA did the grading.\n"
        }
    ]
}