{
    "prof_info": [
        {
            "prof_name": "Eric Johnson",
            "prof_id": 3324,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Data Analysis",
            "review_date": "March 02, 2010",
            "review_content": "\nThis course is tragic. It is suppose to be some sort of applied regression analysis class, but has a massive identity crisis that leaves everyone at a loss. Eric Johnson lacks any coherent pedagogy other than reading long paragraphs from a PDF. He seldom motivates material, and when he does he utilizes some strange religious congregational data set that often abstracts from the points he's trying to get across--as if they're discernible in the first place. Most importantly, given the ample confusion in class he passive aggressively resents students who ask questions or get confused by the presentation of material. The end result is a class that is always lost, but also a classroom that is poisonous. \nThe nitty gritty of the material: the lectures are incoherent. Eric does not quite know who he lecturing too. He is far too verbose with trivial points and finalities, yet takes large mathematical and theoretical concepts as given--they appear out of thin error, confuse everyone, and then disappear just as quickly. Unlike most econometrics or regression analysis courses, equations do not build on one another or refer back to previous statistical building blocks. The result is disjointed bits of information that are never really tied together. For instance, we're given the most rudimentary explanation of heteroscedacity, without real motivation and with equations that have appeared out of thin air. Concepts come out of left field, before vaporizing into a wall of meager mumbling. Information is so decontextualized and disjointed it even makes self study hard. \nIt is as if someone has produced lecture notes by throwing darts at a regression textbook, or a REAL regression class syllabus. Go home. crack open any regression or metrics text, and you realize how little you learn and how bastardized the material is. I've had bad classes, but this is king of shit mountain. Given it's part of a core curriculum and a \"keystone\" class, it adds a nice sting. The jokes on you. \n*This class, however, is a nice lesson in watching an entire graduate class solve the collective action problem of revolting against a professor. \nWorkload:\n1) You'll get a nice quiz that is never mentioned on the syllabus. \n2) An unclear weekly homework set that comes with a google group that absolves him or the TA of doing real work (Oh no, but don't worry! She's taking her comps and truly cares about the direction of the class). Ivy league meets University of Phoenix.\n3) A midterm and a final. Keep an eye out for incoherent data an religious congregations. \n"
        },
        {
            "course_name": "Religion and Social Organization",
            "review_date": "December 13, 2007",
            "review_content": "\nDo not take this course if this professor is teaching it. It should have been a really interesting class, because we read great stuff and there were only 11 people, so I was expecting a really discussion based course. I did not get that at all. He didn't break down the material well, so nobody really knew what was going on, and it made it impossible to start a discussion when we were all confused as hell. He also never really established a rapport in the beginning, like never introduced himself or let us introduce ourselves, and the only reason our class ended up getting along is because we talked about how much we couldn't stand him. He happens to be very inarticulate, so his questions are awkwardly posed in class and when he lectures he just reads long paragraphs he has typed up, and it's kind of hard to take notes from that. Just avoid it, no matter what.\nWorkload:\naverage reading, one field report, in-class midterm and final, two final review essays, 7-9 pages long each, due on the same day, during finals week. Nice touch.\n"
        }
    ]
}