{
    "prof_info": [
        {
            "prof_name": "Karen Hebert",
            "prof_id": 9338,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Psychology",
            "review_date": "January 18, 2012",
            "review_content": "\nThis is a great class to take if you're using Psychology to fulfill the lab requirement and need Intro for the prerequisite. Professor Hebert is really friendly and her lectures are super easy to understand. She posts all of her lectures as Powerpoints on courseworks and you really only have to study her lectures for the exams; the book is mostly unnecessary. If you're not interested in the field, the class can be kind of boring, but that's more the fault of it being an intro class than Professor Hebert's ability. At first it feels like she's talking to a class of four-year olds, but you get used to it. Above all, as long as you study the lectures, the class is definitely an easy A, or even an A+. \nWorkload:\n4 non-cumulative exams (each covering 3 chapters) worth 25% each. Exams consist of 40 multiple choice questions and 4 short answers. The last exam is given on the day of the final, but it counts the same as the other 3 exams. Also, you have the chance to write an extra credit paper worth up to 20 points that gets added on to your total points. \n"
        },
        {
            "course_name": "BC 1101 Statistics",
            "review_date": "April 09, 2009",
            "review_content": "\nProfessor Hebert is amazing. She's nice, approachable, and cracks jokes at 9 am (which aren't necessarily funny) but her efforts don't go unappreciated. I took her for Stats for Psych, which not only fulfilled major requirements for psych majors, but the QUA nine ways requirement for Barnard. She makes the class material INCREDIBLY easy to understand, so much so that you understand all of it in the first five minutes and end up dazing through the rest of the lecture (which she often lets out early because we've covered everything for the day) and still doing well on the exams. She's an awesome professor - she goes out of her way to post the power point slides online and encourages discussion about stats in the real world on courseworks (although no courseworks postings are required). DEFINITELY take this class and try to get Hebert if you can.\nWorkload:\nfour non-cumulative exams that she prepares you explicitly well for, weekly reading assignments that you don't have to do AT ALL and probably shouldn't do because it will just make the lectures more confusing- when they're meant to be EASY, ten homework assignments due every week in recitation (sounds like a lot, but seriously the homework assignments are usually three questions long, one of which once was \"find the mean for this set of data\") no joke, it's really that easy. it's a four point class and there's a two hour recitation section once a week (which she also often lets out early) - she's been known to host \"statistics bowl 2009\" - flashback to middle school where you played games to learn material  - during recitation sections, but it really actually does prepare you for tests because she uses some test questions as gameshow questions. \n"
        }
    ]
}