{
    "prof_info": [
        {
            "prof_name": "Steven Bellovin",
            "prof_id": 3366,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "April 07, 2017",
            "review_content": "\nThe bad:  the homework requirements are left with intentional vagueness.  It wasn't until midway through the semester that it was clarified that this was by design and that Steve's philosophy is that in the real world there is ambiguity, so programmers will be expected to apply their own judgment in assumptions when writing a program.  Having worked in cyber security, I don't totally agree... but that being said, it's good to know upfront that you have a lot of latitude in defining the requirements so long as you document your decisions in your readme.\nThe assignments themselves were time consuming, although not necessarily hard.  The thought process is different than most other programming classes: you can't merely write a program to fulfill an outcome, and have to consider how the program can be exploited by attackers.  Your goal in writing is to consider the flaws and add robustness to reduce exploit vectors.\nThe midterm and final were open notes/open book and scenario based, so it wasn't a matter of regurgitating material as you had to consider circumstances and apply what was covered in lecture.  More CS courses should adopt this format.    \nThe lectures were fantastic, and kept pace with real world developments in security.  The class was at a particularly interesting time late in the 2016 election season when there was a lot of pub about Hillary Clinton's E-mail server and the hacking of the DNC E-mails.  Steve's experience dates back decades and he has a lot of interesting stories which compelled me to research further on my own after class.  \n\nWorkload:\nFour assignments, two week turnaround for each.  They required a good bit of time, but nothing that was rocket science.  \n"
        },
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "December 28, 2016",
            "review_content": "\nI mostly agree with the reviews below but would add that Bellovin curves down (almost the entire class would have gotten an A or A- this semester based on numerical scores and so to change this a 93 was downgraded to a B+). \nA larger issue not mentioned here is that the assignments lacked foresight and the grading seemed arbitrary. There were several instances when instructions had to be clarified at the last minute before something was due or the rubric itself was incorrect and the grade assigned needed to be revised. \nA fourth homework was assigned during the week of final exams which should have been announced earlier or released during the semester. I also think it's better policy to make the course requirements more challenging and curve up than to make the requirements trivial and to curve down (this is especially true when based on the results of a final that students cannot see since the semester is over).\nNot an incredibly demanding course but not particularly substantive or rewarding either.\nWorkload:\nfour programming assignments in c/c++ that take a fair amount of time, midterm and final are open book/open notes\n"
        },
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "December 17, 2016",
            "review_content": "\nI'm surprised this course doesn't have more positive reviews. It should. It's a lot of fun and you learn a good amount. The course essentially covers the whole spectrum when it comes to building a secure computer system. We touch on everything from buffer overflows, to real world cryptography issues, to social engineering attacks. This gave us a good overview of what security is about in a computing setting.\nProf Bellovin is great. He's clearly extremely passionate amount the material and does a good job presenting it. He's a bit of a legend in the computer security world, and so has lots of great stories to tell; some of them even made us laugh. \nDefinitely recommended. \nWorkload:\nNot too bad. We had four assignments in total. 3 were about building a secure program (each assignment focused on a different aspect of security). The last assignment was hacking a program which was fun.\n"
        },
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "December 12, 2016",
            "review_content": "\nSecurity Architecture is a great idea for a course, but I don't like how such an important topic gets watered down so much. In lecture, we just go over a bunch of security concepts like permissions and buffer overflows at a high level. Prof. Bellovin seems to avoid going into technical details when possible, so the lectures are not very information dense. (When I miss class, I usually watch at 1.25x and that speed feels about right.) Some lectures, Prof. Bellovin brings out his funny side and cracks a bunch of jokes, which is pretty nice.\nWorkload:\nWorkload: very light. Only 4 homeworks. The three programming assignments remind me of labs in AP. We used C or C++ to implement some security-critical toy program like a print spooler or a command parser/sanitizer. These were kind of interesting, but I think it would be more fun if we knew that the graders would try to exploit our programs instead of grading them based on a checklist of features / requirements. In the last one, we get a binary and are told to attack it (more open ended). \nI didn't like the way the homeworks were bunched up at the end. We nearly got through the first half of the semester without turning in anything. \n"
        },
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "January 08, 2014",
            "review_content": "\nI would recommend this class to anyone except the following two groups:\n1) You hate programming in C/C++\n2) Thinking \"outside the box\" and \"thinking like the bad guy\" isn't your thing.\nOtherwise, I heartily recommend the course. Professor Bellovin's lectures are entertaining -- I actually looked forward to going to the lectures. His lectures are obviously well prepared; he seems to reuse the same slides but updates them the night before to keep them relevant. The lectures are organized and lively -- with a nice touch of sarcasm. \nThe assignments are mostly about building a secure program that manages files. Watch out -- just because you \"meet the specs\" doesn't mean you will get full credit (or even a good grade). Unlike other classes where the professor would promise \"you can assume you will get proper input,\" here you can assume the graders will be very creative about how they can cause your program to produce errors. You have to validate inputs like crazy. Writing the actual program isn't hard, but you will use some unusual/unfamiliar c libraries so don't start too late because you need a day or two to familiarize yourself with the documentation. Definitely do assignment 0 to get your C/C++ up to scratch (and you WILL need it for assignment 1). If you start a week early on pretty much any assignment, it will be a breeze. If you start 2-3 days before the deadline, you will be pulling consecutive late-nighters. The assignments aren't cakewalk, but they aren't complicated or ambitious either.\nThe midterm and final are subjective (and easy), but graded fairly. They accept a lot of answers if the justification is good. They are still published on earlier versions of the course website if you want to have an idea of what they are like. If you know the lectures, can mix the concepts together, and can \"think like a bad guy\" you will do well on the midterms with little studying. If you pay attention in lecture and go over the slides, you will do well on the test. \nOverall, this is a really solid course, interesting, and not burdensome. I recommend it.\n\nWorkload:\nOn a scale of 1-10 with 10 being the hardest, I'd say 3-5 depending on your background and how interesting security is to you.\n"
        },
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "December 25, 2008",
            "review_content": "\nThis course is fairly simple, and a good bet if you are trying to improve your GPA.\n4-5 fairly easy, (written + programming) assignments (50%) that will be as simple or as complex as you want them to be; however, putting in extra effort to write an extraordinary program will not fetch you extra credits.\nEasy mid-term (20%) and finals (30%) that contain only open-ended, \"open to interpretation\" questions. There are no right or wrong answers to most of the questions. You are supposed to integrate all your knowledge to answer the questions, but basically the answers are so downright simplistic (and amusing) that they might not strike you at all. That is, if you have a rough idea of what has been taught in the class, and use appropriate terms from the slides and suggested reading materials while answering, and mention that your answer assumes \"so-and-so\", you can hardly get it wrong. \nThe whole course is about applying common sense. I have to say that I didn't learn anything spectacular in this course. I goofed up in the midterms because I didn't apply \"enough\" common sense, and did very well in everything else. And I got an A- with a 92%, so that should say it all.\n\nWorkload:\nLow to medium.\n"
        },
        {
            "course_name": "Security Architecture & Engineering",
            "review_date": "January 14, 2008",
            "review_content": "\nProfessor Bellovin is an engaging and well-prepared lecturer.  He's got a good sense of humor, he can draw you in to the material, and when he does he explains it very clearly.  Of course, the material is intrinsically interesting, varied and with a strong focus on real-world security incidents.\nI'd recommend the course, but there are some caveats.  There's no single textbook and the readings, while usually interesting, vary greatly in terms of how thoroughly they cover their subjects.  On top of that, while lecture notes are posted online, they usually provide only a broad outline of what Bellovin says in class, so it can be hard to find reference material for homeworks or for studying if you missed a class or didn't take good notes.\nAlso, Bellovin appears to be something of a big shot in the computer security world outside of academia (eg., helped write Usenet back in the day, won the 2007 NIST / NASA security award).  This is kind of cool, but involves him missing a relatively large number of classes to travel to conferences and so on.  When he's gone, classes are taught by the TA, and at least in our case, the TA was a non-native English speaker and a bad lecturer.\nWorkload:\n4 homeworks, which make up 50% of the grade, plus a midterm and a final.  The midterm and the final are relatively easy if you've gone to a reasonable number of the lectures and done a reasonable amount of the reading; the questions are straightforward.  Each homework has a written part and a programming part.  The homeworks are moderately difficult and time-consuming, about the average for a Columbia comp sci class, but are graded particularly harshly.  There is also a tough lateness policy, and no freebies / dropping lowest grade / etc.  If the class is curved, it doesn't change much.\n"
        }
    ]
}