{
    "prof_info": [
        {
            "prof_name": "Jonathan Voris",
            "prof_id": 12727,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Artificial Intelligence",
            "review_date": "January 13, 2014",
            "review_content": "\nThe rest of the reviews are pretty accurate about this class but I figured I should add in a bit to just explain Prof. Voris. Let me start by saying Prof. Voris is a terrible human being and might be one of the worst people I have ever met. He would often belittle students for asking questions related to class material or about class policies. His assignments were based off what we learned in class with the majority of the difficulty coming from the insane amount of fluff put on top of them. Like he gave us games to encode a solver for and I must have spent 1% of the time on the solving algorithm (the important part of the assignment relevant to the class) and 99% of the time dealing with the absurdly detailed rules of the game that had no reason to exist beside to waste our times. Now back to the real problem Voris. Every time a student asked him for something, like if he could post the blank midterm online after we got it back so we can study it for the final, he would answer in the most demeaning way ever. Every question he felt was a personal attack on himself. Now I am by no means a psych major, but I would say he had a huge fear of being seen as inferior. He would oftentimes go on rants about how in his college, which is some local school that most people have never heard of, he had it so much harder and how Columbia students were entitled and a bunch of cheaters. This rant about how much harder he had it occurred so many times and he would constantly belittle Columbia students as a whole. He clearly was trying to somehow prove his superiority to a bunch of kids who never saw him as inferior in anyway. All I can say is that he has some deep issues and probably would be better suited to teaching at a community college where he does not find the need to always defend himself even if the students are not attacking him. My favorite example of him being an ass if when he was trying to hand out the midterms and basically put them all in one giant pile in the front and told the students to come get it. Of course everyone got up and was gathered around the table. Now what does Voris say? He starts repeatedly yelling (for like 10 minutes straight) \"You all are animals and you should be ashamed of yourselves! I never saw this when I was in school\". He clearly has no idea what he is doing and I hear Columbia is looking to hire a real AI teacher (Voris can't teach very well either so this is a good thing) so hopefully he will never teach a class again. But Voris if you are reading this please go see a Psychologist you have some issues that need to be worked out. \nWorkload:\nEasy midterm and final (Although Voris will be an ass during them so yay?)\nAssignments were unnecessary tedious, but the AI parts were easy \n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "January 04, 2014",
            "review_content": "\nI have mixed feelings for this course. My final grade is satisfactory but I'm still quite disappointed with the course. AI is supposed to be a fun class, and there are plenty of interesting topics that can be covered in a semester long course. However, at the end of the semester, you would find what you had learned was just a bunch of search algorithms plus some machinery that helps you play with logic expressions. I think if Professor Voris had spent less time(or none at all) on giving pop quizzes, explaining the solutions to the pop quizzes and reiterating some of the petty uninteresting concepts, he would probably have had time to cover some more interesting and important topics such as  reinforcement learning and applications of AI in robotics/vision/nlp, etc. But I gotta say this is the first time Professor Voris have taught the course and he did try to teach the course as best he could. He did not come across as a sloppy instructor, it's just that he needs to gain more experience in teaching.\n\nWorkload:\n4 programming projects, the first one must be done is Lisp, the rest can be done in any language that supported by the clic machines(Actually only C/C++, Java, Python and Lisp are valid options) , 15% each. The projects were probably the most interesting part of the course, but they can be time consuming, so start early.\n1 midterm(15%) and final(20%), both during the class period. You should have no problem if you understand the materials covered in class.\n2 pop quizzes. It seems they were just to check attendance and had very limited impact on your final grade. \n\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 24, 2013",
            "review_content": "\nJonathan Voris was hands down the worst professor I've had in the Computer Science department (although I suppose I use the term 'professor' lightly here, because I believe he was a post-doc who was teaching Artificial Intelligence for the first time), and among the top 3 worst professors I've had at Columbia (which is surprising since he speaks perfect English).\nThe Good:\nThe first day, I was rather excited to be taking this course, because Artificial Intelligence is a subject of great interest to me, and I was pleased to find that Dr. Voris was very enthusiastic about the subject matter, and the first three introductory lectures, while sometimes rambling, were at least engaging. \nThe Bad:\nUnfortunately it was all down hill from there: it became incredibly difficult to determine what information from lectures was relevant. As a result more than half of the class stopped attending lectures (Voris began giving pop quizzes in class around 3/4's of the way through the semester).\nThe Ugly:\nProgramming Assignments: The programming assignments were long. I mean incredibly long. The assignments consisted of single page pdf files describing a task in vague detail. There were no suggestions for completion strategies (fine, you don't get these in real life) but more frustratingly, there was absolutely no framework given. The projects often required large amounts of infrastructure (e.g. coding of 5 search algorithms) before any part of the conceptually interesting portion of the assignment could be tackled (algorithm design, heuristic/evaluation functions). Voris was a hard-ass about deadlines, which is reasonable, although perhaps less reasonable was his choice to assign the 4th project and the in class final due 4 days apart. \nExams: The material on the exams was not very difficult, however the exams themselves were incredibly confusing. The midterm was almost as if he had never before written an exam, for practically every question it was difficult to tell even what the question was asking. On top of this, the TA's couldn't answer questions because only 1 of them could speak reasonable english, and the Professor refused to answer questions because he might give away the answer. The final was in class on the last day, and the questions were more clear, however the exam itself was pretty long and somewhat tedious in nature.\nMiscellaneous: The professor, in my opinion, had a patronizing tone throughout the class and routinely treated students as if they were stupid. On top of that he did very little listening and a whole lot of talking when students expressed their concerns. No review or example materials were provided for any assignments or tests. And, more of an annoyance compared to the rest of what was going on, the Professor would often engage in pointless discussions (read: arguments) with students about a very specific point of no importance that would last for 10-20 minutes.\nJonathan Voris is clearly knowledgeable and passionate about Computer Science, but in no way qualified to teach this course.\nOne Caveat: I don't know how much he changed the material from Professor Stalfo's version of the course. It is possible that the assignments and lecture notes were entirely the same. This does not change the fact that Voris was an insufferable asshole, who seemingly refused to listen to his students and insisted on wasting class time on pointless and pedantic arguments with students.\ntl dr: Course was horrible, Professor was horrible. If you value your time and sanity I recommend you steer clear (although I don't know if it is being offered again, so it's probably a moo point.) I give this course a 1/10.\nWorkload:\n4 Programming Projects: Incredibly unclear on the specifications, disorganized and time consuming. Unless you exclusively code in your free time you should get started sooner rather than later.\nMidterm: Incredibly simple material, incredibly confusing test. See above.\nFinal: In class final. Still relatively easy on the material, but still confusing and above average in length.\nTest Averages: Mid 60's\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 20, 2013",
            "review_content": "\nAfter reading the rather poor reviews of Professor Stolfo's AI course, I was excited to take the course with his postdoc.  Unfortunately, he failed to meet expectations.\nVoris is a very nice guy, but was disorganized during his lectures.  Also his command of Common Lisp wasn't the greatest, and used code from Stack Overflow in his slides.  Thankfully, he only required Lisp for the first assignment.\nThe assignments were a little much.  I found that I was working on the implementation more than the actual search algorithms.  I spent weeks working on the game implementation for Gomoku and Sokobon, while rushing through the search algorithms hours before the assignments were due.  Also, he provides the easiest test cases possible, while using hard ones to grade.  Most of my assignments assignments passed all of the test cases, but I ended up doing poorly on them because the test cases used for grading were not even remotely as easy as the examples he provided.\nThe reviews from Stolfo's class mostly say that he skims over everything interesting in AI.  Voris wasn't much different, and we actually covered less material than Stolfo usually does.  We didn't even get to machine learning, and our last assignment was on logic, entailment via forward and backward chaining (which I thought was an extremely boring project that again, takes more time to write the implementation than the search algorithms).\nThe midterm was fair, but the final was rough.  Voris said that chapters 1-9 would be on the final, yet he ended up testing us on topics mostly before the midterm.  We did not receive any sample questions or past exams, and were unsure of what to expect on the exams.  I though the final was way to long, and Voris said he had planned to make it even longer.\nWe used Piazza as our forum for discussion and questions outside of class.  To be fair, some students did ask questions that could have been easily answered from a quick google search.  But that doesn't mean the instructor should respond to them in a sarcastic and demeaning way.  Some of Voris' answers to Piazza questions were very defensive and sarcastic, including \"Uhh, you can run Eclipse on the clic lab machines?\" or \"I only posted the text file with puzzles because people complained I didn't post any examples\" and \"Guys, I've already made it rather clear that all of the material in the book chapters that we've covered is fair game.\"  He also would write something like \"please see me in office hours if this is unclear\" rather than post a response.\nBasically all the course material (lecture slides, etc.) was given to him by Stolfo.  There were mistakes in the slides, and he usually correctly them quickly.  Although I did hear him arguing with a student about ambiguity in a final exam question and Voris' response was something like \"[Stolfo] has been using these slides for 20 years and I don't think he had this much trouble with grade arguments.\"\nOverall, I guess Voris was a better choice than Stolfo, but if you aren't required to take this class, I suggest avoiding it like the plague.  At least Voris made the tournament extra credit, and all who participated earned at least 5 extra credit points, even if they lost in the first round.\nWorkload:\nFour assignments: Pattern Matcher in Common Lisp, Sokoban Search Algorithm, Battle of the Gomoku Agents (and tournament), and Inference Algorithms (entailment with forward and backward chaining).\nMidterm - fair.\nFinal - too long.\nTwo pop quizzes.\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 08, 2013",
            "review_content": "\nI took this class with Prof. Jonathan Voris.  I'm pretty sure he was roped into teaching the class right before the semester started, if that's worth anything when considering this review.\nQuick Summary:\nGood lectures (if a bit dry; depends on your taste)\nRanges from very approachable to completely unapproachable\nDoes not deal well with grades.  \nProf. Voris was a good, solid teacher.  He taught the material well, and was mostly light-hearted about the material.  He really seemed to enjoy the class when he took it (7 years ago I think), and he definitely transferred that joy over to teaching it this time around.  I liked his lectures, though sometimes they were a bit dry (often the material was at fault).  Basically, Voris is a good teacher.\nHowever, Prof. Voris comes with a special type of schtick.  The best approximation of an explanation of it is a mix of ego and paranoia.  When it comes to grades, he seems paranoid that every student is willing to kill him if that will give them a better grade.  This is not (much) of an exaggeration; he really is paranoid about this.  When it comes to anything involving grades, simple questions offend him like the deepest of insults, and he is completely unreasonable.  When handing out the midterm, after failing to get students to come up in an alphabetical order, he just dropped all the tests on the table, and sat back, calling the students \"animals\" and \"disgusting\" while everyone searched through the mess to get their tests.  Not cool.\nAlso, if he can't understand a question, he often assumes that the question is stupid, and sometimes even worthy of mockery.  He will always try to explain a question once, but if the explanation is not sufficient for the student, and he thinks that it was, he will make comments like \"I don't understand what's not to get.\" or \"This is pretty simple.\"  He is in desperate need of learning the phrase \"Why don't you come see me after class?  I'll explain it then- we should move on\".\nThis ambiguity often translates to the workload- the projects were good, but the formatting was often unclear.  Tiny details that made actually finishing the damn things a nightmare.  To be fair, many students just seemed to ignore what was actually written in the project assignments in regards to submission details (\"Must run on a CLIC machine\" seemed to be an oft ignored instruction for many students).  All in all though, the details just needed to be crystal clear, and they weren't.\nHis midterm and finals were VERY reasonable.  However, the grading of them weren't.  He hasn't posted our final grades, so it is unknown whether he will curve or not, but some of the ways he took off points were pointless.  The purpose of a test is to test our knowledge of the material, not our ability to decipher certain cryptic instructions.  The questions were good- they were actually really good tests.  But, like I said, the grading was off.\nAll in all, he was good for learning the material, and terrible for anything to do with grades.  Just a bit of a nightmare to deal with the schtick.  Not a bad person, just not adjusted to teaching (yet).  If he shapes up on the grading thing though, he could definitely be a really great prof. in the future!\nWorkload:\n4 projects(15%), a midterm(15%) and a final(20%). 5% class participation.\nAlso pop quizzes, but they are counted as 50% of class participation.  So NBD.\n"
        },
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 08, 2013",
            "review_content": "\nI had AI with him. He is the least organized instructor I've ever had. He believes everything he said was right and is extremely vague on assignment instructions. He would make up tons of extra requirements about the projects in addition to the project instruction posted online and you wouldn't know them unless you keep track every post he answered on Piazza. The exams are unfair in the sense that he would test on very trivial points and if you don't know them, you are screwed. Never take any course with him. \nWorkload:\nAbout right. 10-15 hours per projects and 4 projects in total. No other assignments. \n"
        }
    ]
}