{
    "prof_info": [
        {
            "prof_name": "Samuel Lipsyte",
            "prof_id": 2782,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Eccentrics & Outsiders",
            "review_date": "May 28, 2015",
            "review_content": "\nA great writer, an okay professor. Sam Lipsyte has a lot of valuable insights to teach about writing, style, characters, and connecting sentences. He gives a really good reading list and tells you about 'webs of writers' so that if you like a book or a story you can find others like it. Sometimes he's even funny.\nBut realistically, he doesn't take his job as a teacher very seriously. He says come visit him in office hours, says just enough of the right things so that how little he cares isn't completely obvious, but anyone looking for a genuine educational experience will immediately realize that his classes or students are not priorities for him. His lectures are improvised and meandering. He hardly gives any feedback on written assignments. He takes forever to answer emails.\nThe creative writing department has so many amazing classes to offer, and so many dedicated teachers. Don't waste your time on a 'meh'.\n\nWorkload:\nAround 150 pages a week of reading. Two exercises and a story.\n"
        },
        {
            "course_name": "Approaches to the Short Story",
            "review_date": "December 22, 2010",
            "review_content": "\n     Obviously a smart guy, but I wish he had been a little more proactive in guiding class discussion--it got pretty thin sometimes, and it felt like that was because the class didn't have a very good grip on the story.  To my understanding, the stories were selected and grouped because they were good examples of a particular aspect of writing or technique, but it felt like we stopped talking about those things midway through the term.  I also wasn't a fan of the story selection, although I have the sense that I'm in the minority there.\n     I did like the way he responded to written work, though--he was unafraid to say if something was unoriginal, or not that funny--it sort of seems like a lot of writing profs are squeamish about questioning the basics about pieces (is this original/interesting?),.and he wasn't.\nWorkload:\n3ish stories a week to read, 3 short written exercises (1 in class), a 10-15 pg. short story at the end of the term.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 26, 2006",
            "review_content": "\nProf. Lipsyte is a really good creative writing professor, and I enjoyed his class more and more as the semester went on.  His dry sense of humor make the class really funny, and as a published author he definitely knows his stuff.  Plus, he encourages us to visit him during office hours to talk more about our latest writing.  He's usually really quick at getting you feedback for your work, and he writes lengthy comments on everything you turn in.  He's also pretty laid back, so if your printer breaks down and you can't get your story printed in time for class, he'll probably just tell you to bring it in tomorrow.  As long as you're willing to speak up during workshops and put real effort into your writing, you'll get a lot out of his class.\nWorkload:\nA final portfolio consisting of two poems, a short story, a four-scene play, and several brief exercises. \n"
        },
        {
            "course_name": "Tactics of Fiction",
            "review_date": "January 05, 2006",
            "review_content": "\nI would definitly recommend taking his class. Prof. Lipsyte gave excellent criticism gently and went out of his way to make himself available to us. He's also the director of undergrad writing for GS and a professor at the School of Art. \nWorkload:\n3 stories (12-15pgs), one re-write\n"
        }
    ]
}