{
    "prof_info": [
        {
            "prof_name": "Jeffrey Lependorf",
            "prof_id": 1881,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 26, 2005",
            "review_content": "\nProfessor Lependorf was wonderful.  I always left his class enthusiastic and totally relaxed.  His energy and love of music get you excited about music you'd never listen to on your own.  I thank him for a wonderful class\nWorkload:\nNot bad at all.  Come to class, enjoy, and then go to 5 concerts and write about them in your journal.  The final wasn't too hard, but it was worth studying for.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2005",
            "review_content": "\nProfessor Lependorf is great.  He really knows music, and really loves teaching.  He has a great sense of humor, and opens your ears to things you never knew existed.  He is certainly worth taking.\nWorkload:\nVery light - 2 small midterms (more like quizzes), five concert reports (very short), and an easy final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 20, 2004",
            "review_content": "\nCan't say enough good things about Prof. Lependorf. A class that I was not looking forward taking turned out to be a true joy. If you have the opportunity to take his class, do not hesitate a moment. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 25, 2004",
            "review_content": "\nA truly fantastic teacher, and an intelligent man to boot.  If he doesn't inspire you to fall in love with the major classical works, I don't know what else will.  You will leave the class proficient in the basic lexicon of classical music,  relaxed enough to prep for your other finals, and, if you allow yourself, as a more intelligent and enlightened person.\nWorkload:\nLight.  A concert report due at the end of the semester.  Quizzes and tests were relatively easy.  Come to class, study and you should be fine.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2003",
            "review_content": "\nThank God I took MusicHum with Professor Lependorf.  First, it's obvious he loves music and knows so much about it... his passion was just overflowing and that made his lectures cool.  In terms of accessibility, he was ALWAYS available via email to have questions answered.  I was terrified of this class (I'm not into the math behind the music, so some of the concepts were really just impossibly hard for me) and Professor Lependorf was very accomodating in terms of helping me figure out stuff. Can't say enough good things.  \nWorkload:\nAverage for MusicHum in terms of reading the text and listening hours; excellent with concert reports though (five in all -- it may seem huge, and it is more than most classes, but how often do you get to go out and listen to music for homework?!). \n"
        }
    ]
}