{
    "prof_info": [
        {
            "prof_name": "kathryn yatrakis",
            "prof_id": 2576,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Junior Colloquium",
            "review_date": "December 10, 2008",
            "review_content": "\nThis was one of the worst classes I have ever taken at Columbia.  The reading was incredibly extensive, though familiar (and repetitive) if you have ever taken any urban studies courses before. As for Dean Yatrakis, she would constantly start class late, go over time, not giving us breaks because she was going to \"end early\" (never happened).  She also was a horrible facilitator of class discussions, constantly interrupting people and never staying on topic for very long.  I would strongly recommend not signing up for her section. \nWorkload:\nVery excessive.  She required 2-3 discussion questions (not answered) for EACH text that we read EVERY week.  A few weekly presentations on the reading throughout the semester.  20-25 research term paper. \n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "June 08, 2005",
            "review_content": "\nDean Yatrakis' class (she's also dean of academic affairs at columbia) is one of the best seminars i've ever taken. she taught us after a long hiatus, but you can tell that she knows how to lead discussions, plan a curriculum, and get the material across. she has this great ability to get everyone to speak (well, not Everyone but she makes a big effort) and maintains a comfortable atmosphere during class-- which is pretty hard with some professors who tend to ignore some students while only focusing on others. she also made it a point to keep free time for her urban studies students, not an easy task b/c of all her other meetings. \nthe material is interesting-- if youre into social urban affairs like education, social services, local goverening, poverty. but most people in teh class are junior urbst majors, so everyone is pretty familiar with the topics, and at times its great to hear everyone's varying viewpoints on the same topic. she's also very funny-- and will often refer to personal anecdoes to highlight certain points, whcih definitely helps make some of the readings less dry. (though i enjoyed most the readings anyway)\noverall-- she is a personable, funny, helpful and very knowledgeable. try to take the jr colloquium with her if possible. \nWorkload:\nheavy reading per week-- though you probably can skim. good books though and you get a feel for the topic if you do read it all. 20-25 page paper on an urban issue of your choice. one enclave presentation.\n"
        }
    ]
}