{
    "prof_info": [
        {
            "prof_name": "Jushan Bai",
            "prof_id": 4454,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "April 21, 2016",
            "review_content": "\nJushan Bai's econometrics class is a solid class. Not mindblowingly amazing, but if I had to take econometrics again I would definitely take it with him. \nHe's passionate about the topic but his lectures are still dry. If you're good at reading textbooks, then you'd be fine skipping, but all the material covered in homework and exams is covered in lecture so I think I saved a lot of time studying by attending most lectures. Prof Bai is also very helpful in office hours, so if you're having trouble or have any questions about the psets, he'll answer them for you. \nThe workload was very reasonable and I didn't find it difficult despite not having a very solid foundation in statistics. He reviewed the topics we used (like hypothesis testing) at the beginning of the course, and I'd probably have been fine without having taken any statistics in the past. He provides wonderful pdf notes reviewing probability and statistics, which were super useful. The psets didn't involve that much R (I've heard horror stories about other classes and Stata) and were manageable.\nOverall, a medium level difficulty class with a pretty dedicated professor, and possibly one of the best metrics classes at Columbia.\n\nWorkload:\nMidterm, final, weekly problem sets.\n"
        },
        {
            "course_name": "Econometrics Seminar",
            "review_date": "May 05, 2011",
            "review_content": "\nThe professor presents the material very clearly and with an excitement that makes one want to pay attention for a subject matter most consider boring. It's a very laid back class with the professor lecturing for the first month and students giving presentations for the rest of the semester. The proposal is due after the first few weeks, then two presentations spaced throughout the semester. You can get away without presenting until the last week, but be warned start on the paper early! Give yourself deadlines throughout the semester otherwise you'll come to reading week and still have 30 pages to write.\nWorkload:\n30 page paper and 1 or 2 presentations on the paper\n"
        }
    ]
}