{
    "prof_info": [
        {
            "prof_name": "Sanat Kumar",
            "prof_id": 3231,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Thermodynamics",
            "review_date": "August 04, 2016",
            "review_content": "\nOne piece of advice: GO TO CLASS!\nProfessor Kumar is one of those professors that you either really like, or really don't. I happened to love him, but note that this was not the case for everyone. The class is at 8:40, but every single person was always at class because Kumar hands out his personal notes, and if you are not in class, there is no other way to get them. \nWith that being said, Professor Kumar definitely knows Thermodynamics, but it is a hard subject. You definitely need to go to office hours if you are even a little confused, because it will most definitely help and he definitely takes note. Kumar has this policy where he does not set strict office hours, but if you need help and he is in his office, he will help you. \nAlso, his exams are really similar to the examples he does in class, and all exams are open book open notes. \nWorkload:\nWe were constantly having \"quizzes\" in that class, which were essentially exams. There was one basically every other week (4 or 5) but he drops the lowest grade. There was no collected homework, and honestly if he is still using that grey and orange book, there is no point in doing it. \n4-5 \"quizzes\" and one final. \n"
        },
        {
            "course_name": "Principles of Thermodynamics",
            "review_date": "December 25, 2013",
            "review_content": "\nThis is the first thermodynamics class for ChemEs (and BME's/other engineers if they chose to take it) and I thought Professor Kumar was an amazing lecturer. He really knew how to engage the class with the material -- despite it being so challenging and sometimes dry. It was an 840 class, but the class was always packed because it was worth listening to Prof. Kumar's lecture and taking your own notes. Even if you miss one class you will be lost the next lecture because the book wasn't nearly as helpful as his lectures/handwritten notes. Also, the exams were always reflective of what we talked about in class and the types of practice problems we did in class. It was to your detriment if you skipped class. And besides, Prof. Kumar can be a funny guy! (especially when there aren't a lot of people in class) I remember the two best classes we had was the one after our second midterm and the final review session when less than half the class attended and he was hilarious both times. \nKeep in mind that thermodynamics is an inherently challenging subject so the only way to really be successful in the class (if you aren't a genius and immediately understand everything) is to 1. pay attention in class 2. review the material and try practice problems (!!) 3. go to office hours! 4. if you have friends in the class definitely think about starting a study group. \n\nWorkload:\n4 quizzes, 4 midterms, 1 finals. You felt like you were constantly being tested. We essentially had a thermo test or quiz every week, but this was because we weren't assigned any homework to turn in. This could be a good thing  (if you kept up with the material) or a bad thing (if you didn't). Also, the averages were 50, 70, 50, 30, 50 for the 4 midterms and the final, respectively, and the class was curved to just about B (little bit less than a B, I believe). Good luck! \n"
        },
        {
            "course_name": "Design",
            "review_date": "May 19, 2008",
            "review_content": "\nThis guy is a joke. He barely comes to the meetings and when he does, he's no help at all. He only criticizes what you're doing to act like he knows what's going on when he really doesn't. He can't even take criticism himself and puts it off on other professors to take care of it for him. I have no idea how he's kept this job for so long. Must be good at getting a lot of funding at the price of giving students bad education. You could replace Kumar with a high school student and the result would probably be the same or better. Professor Hill is by far the best design professor of all three. \n"
        },
        {
            "course_name": "Product Design and Process Design",
            "review_date": "May 05, 2007",
            "review_content": "\nAlthough you probably have to take this class as a ChemE senior, you should probably know that Kumar is unacceptably unprofessional. He does not attend his own lectures, is not present at office hours, does not show up to his own tests.\nHe does not seem to care about you (or teaching) in any way...once you realize that, you can use his lack professionalism to your advantage. Too many people complain, just use his attitude to better your grade.\n1) Make everything up: he is too lazy to check any work.\n2) In your final report, make stuff up that makes you look really smart and Kumar even smarter.\n3) Do not ever let him get away with anything (like giving you a C when he clearly has not read your paper). The ChemE department apparently has him on a very short leash and if he acts up, his errors are fixed very quickly\nWorkload:\nNothing at all, just make it seem that you do a whole lot and he will be impressed and never check anything.\n"
        }
    ]
}