{
    "prof_info": [
        {
            "prof_name": "Matthew Miller",
            "prof_id": 765,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 02, 2005",
            "review_content": "\nJa Ja Herr Miller ist gut!  Let me just say this.  From the first day I came to the realization that I do not like philosophy (for the most part).    But Matthew Miller made this process relatively painless.  Let me first off say that he is a very nice guy.  As the previous review said he is willing to work with your ideas.    There were times where i thought (rather I know) I was rambling but Matt was able to glean an idea out of it and keep the conversation moving.  If a text became so complex that only a few people in the class could even comment, he would create notes for the class on courseworks.  In the beginning of the year we were required to create summaries of our readings to show him that we were on the right track which I thought was a good idea.  In addition we had 8 response papers, which could be replaced by a combination of courseworks postings, or a class presentation.   In addition he makes us food (people are free to 'whatever') before the finals.  German food since he is a german teacher.   Grading I think was fair.  When I did poorly he graded appropriately, but the option is also there to make the grade up because class participation is 60%.    He also grades a little randomly on the midterms and finals.  I think most of our class got A's on our midterms Fall term because of the election and he was sad.   But hey no complaints from me.  A-/B+ (Fall/Winter)\nWorkload:\nTwo 6-8 Page papers, midterm, and final.  8 response papers which can be replaced by combinations of class presentations and/or courseworks postings.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 08, 2005",
            "review_content": "\nMatt is leaving and he might not be back, but if he is, you should take a class he offers, whether it's CC or maybe a German class. He knows A LOT and if you do your work (at least try) then you'll have a great time.  His mind works really quickly so he talks fast and writes illegibly but just let him know and he's verrrryy cool about slowing down.\nOur class eventually got very comfortable and so did Matt and that's probably the most ideal class environment for both you and Matt.  He will work with your stupid ideas and make them sound great. He will remember what you write in papers and bring them up in class. \nHe's not an experienced professor-type, but if you're intellectually motivated and like casual environments, take a class with him! If you need someone to break things down into very easily digestible information, it'll be hard.  But he is very nice with grading because he probably hates the idea of grades, so that's always a bonus. Participate and you can push your grade up pretty nicely. Also make sure to take advantage of how available he makes himself to the class!\nWorkload:\n2  6pp-ish papers; 6-8 one page response (optional oral presentation to reduce number of response papers; optional online postings to reduce number of response papers--highly recommended)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2004",
            "review_content": "\nMatthew Miller is a wonderfully sincere man who is willing to try as hard as he needs to when it comes to keeping the students sane while teaching all of ancient and medieval philsosophy in three months. He is open to suggestions about what aspects of each book the students want to discuss, does not believe there is any  one universal truth, and is very clear about what he wants you to take from each text. He has a lot of background in philosophy and is very willing to take class discussions further and deeper if you're interested, very flexible with office hours even if you're taking time away from his research time for his own dissertation! The paper topics are not vague and easy to get around, he expects a substantial amount of thinking but is extremely helpful if you go and talk to him about your ideas. I always enjoyed writing the papers because the topics allow you to expand your own ideas and read a particular text a lot deeper so that you come out feeling like you truly understand what the text is trying to say, atleast in the one chapter that you choose to focus on...which is relatively fulfilling considering the speed at which we're expected to read and comprehend all the texts. Oh, and he has a wonderfully sardonic sense of humor that most of the students won't really get, but his random bouts of german are definitely part of the experience. he also home-cooked us very good food for a review session, so all in all, a really great person on the whole and a very interesting person to learn from.\nWorkload:\nTwo papers, 6-8 pages. 8 short one page responses over the semester which can be replaced by online postings.\n"
        },
        {
            "course_name": "Elementary German II",
            "review_date": "November 14, 2001",
            "review_content": "\nVery laid back, very engaging class. Not a work hound, light homework (15-20 min). Speaks quickly, but won't hesitate to explain himself until the whole class understands him. Very approachable and understanding. 4 exams, and 4-5, 1 page essays. Good class to take if you have had a year or two of German, mostly conversational work, little reading comprehension.\nWorkload:\nModerate, 15-30 minutes per class.\n"
        }
    ]
}