{
    "prof_info": [
        {
            "prof_name": "Sidney Felder",
            "prof_id": 3104,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Truth, Value, and Knowledge",
            "review_date": "April 20, 2010",
            "review_content": "\nHe is a very smart and confusing man--he teaches mostly lower-level courses, which are not his forte.  Students with a couple years of philosophy courses under their belts would do better to take his classes, and beginners would do better with someone like Collins, Helzner, or Morrison.  He also tends to find good ways of making stupid questions from students come off sounding reasonable, and answering the reasonable version of the question in a sophisticated way.\nHe does, however, grade between a C and an A.  Only in outstanding cases of idiocy has he ever given a D. Also, he just has interesting views on philosophy.\nWorkload:\nThree four-page papers and a final exam.  He tells you, almost explicitly, what to write to get an A on the papers--but you have to decipher it in his lectures, and almost nobody ever does.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "January 08, 2007",
            "review_content": "\nAs an English major, taking Felder's class to fulfill the science requirement was maybe the best surprise of my semester. Felder, aside from showing a genuine interest in his students' understanding of the material, was incredibly fair. In addition to curving every test considerably, he announced late in the semester that the homework - though graded - could absolutely not harm your average. He even allowed students to drop one of two midterms when the grades were drastically lower on the second exam (which was, in fact, much more difficult than the first). \nAlthough two or three (I think) recitations took place each week, attendance at neither recitation nor lecture was required. \nI came away from the class with warm feelings towards this kind, enthusiastic, and admittedly adorable professor, but I should add that his lectures were sometimes scattered. If you are really intent on learning during the lecture, pay close attention. Felder frequently miswrote equations on the board, which proved pretty confusing at times. Don't be afraid to correct him. Students always did and he amicably laughed and corrected it. The bottom line is in a class at this introductory level, you can teach yourself everything you need to know for the homework and the exams from the detailed textbook. \nWorkload:\nVery little. I spend less time on this class than I have on any other at Columbia. Homework is assigned every few weeks and takes no more than a couple hours to complete - assuming you include time spent reading the textbook to figure out the problems, if not, thirty minutes at most. Two midterms, one of which was dropped completely. Final. I thought the final was tough but came out of the class with an A, evidencing a generous curve.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 29, 2006",
            "review_content": "\nThe material is not easy, unless you have taken another symbolic logic course.  Professor Felder, however, makes every effort to make the material understandable.  Class can be boring, but necessary for understanding the material.\nWorkload:\n2 midterms, 1 final. homework bi-weekly.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 26, 2006",
            "review_content": "\nHorrible professor and horrible class. \nProfessor Felder is honestly a nice guy. He tries his absolute hardest to be available outside of class, and he attempts to make classes as painless as possible. You can tell he prepares for lecture, too, and he even posted his notes on set theory and quantification on CourseWorks. I can't stress any of this enough.\nHowever, class is such a waste, and it's a shame that he doesn't know how to organize it better -- I got NOTHING out of his lectures or his class I was excited to take this class, but that was zapped after a week or two. I skipped many classes and was forced to learn the material from the course pack, and I think 90% of the class agreed: everyone was there for the first class, but only 20-30 or so came to the next (and subsequent) classes. When I did go to class, he would rely on easy examples and constantly proclaim, \"Oh, this is probably too easy for everybody.\" Before the exams, he'd give a comprehensive outline of the test's questions, but - again - providing EASY, no-brainer examples to explain. Before the tests, he'd say, \"Oh, you're all probably going to get 100s.\" At one instance during the semester, he even admitted how slow the class was going (and, consequently, how little progress he was making) and was forced to take a chapter out of the syllabus.\nWhen I went to class, usually THINKING it would supplement/complement the course pack well enough or SEEKING some clarification of a point, I'd be highly disappointed because Felder didn't match the pack's difficulty level/provide anything more advanced. (Though, the course pack could use some major improvements. But that's a different story.)\nWhen the time came around to take the tests, your position was doubtful. The difficulty of exams doesn't reflect anything he teaches in class. The first exam was tough, but many people did well; the second exam, however, was horrible -- so horrible that he said when determining semester grades, he'd drop the lowest of the two exams. (When I talked with many classmates after the 2nd exam, we all shared similar \"WTF?!\" sentiments.)\nThe final was a bit unfair, depending on your perspective. Instead of being comprehensive, it was basically a huge chunk of your grade on chapter 9 of the course pack -- good or bad, contingent upon how well you understood that material. And of course, the pre-exam outline given in class wasn't stellar.\nI can't stress enough how much of a waste I think this class was. The TAs for this class were great -- they actually TAUGHT in recitation and were generally very helpful. They held great review sessions before the tests. In fact, I wish THEY taught the class over Felder.\nFelder's grading scheme was pretty hazy, too. Originally, it was supposed to be 10% HW, 25% for each exam, and 40% final. But after he said he was dropping the lowest exam, I don't recall him adjusting the weights and letting us know the new totals. He said he curved, but I couldn't see how (after he said what score corresponded to what letter grade). I tried asking him in person, but he gave me a vague answer. So, who knows.\nBasically, don't take the class with Felder. This class has some pretty fascinating material, so wait until a professor who knows what he's doing teaches the class.\nWorkload:\n6-8 homeworks, 2 exams, and 1 final. ALL EXAMS ARE OPEN NOTES/OPEN COURSE PACK. If he didn't do this, most of the class would undoubtedly be totally and utterly screwed. Homeworks are assigned sporadically; Felder originally wanted them to be biweekly, but that didn't happen.\n"
        }
    ]
}