{
    "prof_info": [
        {
            "prof_name": "Mario Di Gangi",
            "prof_id": 2619,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Shakespeare II",
            "review_date": "November 12, 2006",
            "review_content": "\nDr. Di Gangi is a really eager and excited professor who always comes to class with loads of really interesting handouts and anecdotes about the texts. He's also really good at breaking down the plays and explaining even the most dense passages in very straightforward, contemporary English. There is absolutely nothing pompous about this man whatsoever. \nIf you consider yourself a big fan of Renaissance drama, you really need to take a class with this guy. He loves this stuff so much some days I think he's just gonna' pop!\nWorkload:\nOne play a week + 1 or 2 outside essays. Take home midterm, take home final + a 10 page paper. It all seems like a lot on the first day of class when you buy all the plays and the course reader but Dr. Di Gangi is particularly good at pacing things. He's also a very close reader and will comment profusely on just about anything you turn in. (Again, he's just really into his job.) He's a fair grader but not the sort of professor who accepts messy work particularly well. If you like to put your papers off until the night before they're due, watch out!\n"
        },
        {
            "course_name": "Tudor-Stuart Drama",
            "review_date": "August 14, 2006",
            "review_content": "\nInspiring. He has an extensive knowledge of renaissance literature, but is humble and not egoistic at all. The reading load is fair. He is not an easy grader, but a very fair one. Also, he considers participation important, which makes his class discussions exciting and dynamic. Best english professor I have had at Columbia!\nWorkload:\nAvg. English course workload. Midterm paper, 2 papers, and a final.\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "September 08, 2005",
            "review_content": "\nMario Di Gangi's class is a pretty fair introduction to many of the lesser known shakespeare plays, as well as an interesting review of Macbeth, Othelo, and King Lear. He is undeniably a short, adorable man who really loves his Shakespeare, but couldn't hold my attention, although he tried to encourage lots of class discussion. Unfortunately, the few individuals that actually read along with the syllabus dominated each and every class. \nHe approaches Shakespeare with readings that focus on the historical/social events surrounding each play, which some students found fascinating, and I found boring. Was I inspired? No, but I enjoyed the class anyway.\nWorkload:\ntakehome midterm, two 5-7 page papers, final. Reading/ attendence are helpful but not especially necessary. Everything is graded pretty generously and he really gives you freedom to address what interests you about a play. \n"
        }
    ]
}