{
    "prof_info": [
        {
            "prof_name": "Stiliana Savin",
            "prof_id": 3105,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Physics II: Electricity & Magnetism",
            "review_date": "March 27, 2013",
            "review_content": "\nMaybe I wasn't meant to take E&M;, but Professor Savin's teaching style did not do it for me. While Savin is very sweet, I felt that her lectures were very scattered--I wish she would have picked a lecture format at the beginning of the semester and stuck with it or that she would have used PowerPoint in a more productive way. Her notes on the board were very unclear and I often times could not read her handwriting. Her explanations of subjects were also often times lacking. Her teaching style did not mesh well with my learning style.\nWorkload:\nOne problem set per week. Two fair midterms. One final. One lab per week, when enrolled in lab.\n"
        },
        {
            "course_name": "Mechanics",
            "review_date": "September 29, 2007",
            "review_content": "\nI took Savin's class in the Fall of 2006, and I honestly don't understand why people thought it was hard. I took physics in high school, but it wasn't AP, and it was senior year, and I did really poorly, so I was worried about coming into college physics. The material was challenging in the homeworks and some lecture stuff, but if you go to her office hours or get extra help, it's not that bad. The part of the class that I really enjoyed was the exams, because they were REALLY easy compared to the problem sets. The exams were pretty straight-forward and didn't contain many of the tricky elements that the problem sets had. I think people just psyched themselves out and thought they were missing something in the problems on the exams, so they didn't do as well as they wanted. But honestly, it's a fairly do-able class. \nWorkload:\nWeekly problem sets (hard, take a good amount of time, but you learn the material well), midterms (I think 2?) and a final. The exams are pretty fair, and much easier than the problem sets.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "January 17, 2007",
            "review_content": "\nLike the other reviewer said, she's nice, yet a terrible teacher. Her lectures and example problems come straight out of the textbook, so the textbook can't really be used as an alternate source if you don't understand something. Her intentions are good, so going to her office hours was sometimes helpful, but only if you really pry her for explanations because, I think, many times she doesn't fully understand your question. There was a physics help room, where physics majors basically go through the problem sets each week. The physics majors were much more helpful than Prof. Savin in their explanations.  \nWorkload:\nweekly problem sets; two midterms & one final that pretty closely mirror the problem set/class examples\n"
        },
        {
            "course_name": "Physics II: Electricity & Magnetism",
            "review_date": "December 26, 2006",
            "review_content": "\nProf Savin is just about the nicest person in the world.  She is also just about the worst professor in the world.  She revamped her tests so that if you had never taken physics before you had no chance.  Understand that most of the students in this class had taken AP or IB physics. I was told this was the class for those who had not ever taken physics.  Needless to say I was crushed.  Please try and find a better physics teacher because no matter how hard you try you will not do as well has you hoped because there is practically no curve.  \nWorkload:\nweekly problem set, two midterms, one final\n"
        }
    ]
}