{
    "prof_info": [
        {
            "prof_name": "Barry Bergdoll",
            "prof_id": 2273,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "20th Century Architecture and City Planning",
            "review_date": "December 18, 2004",
            "review_content": "\nI think Bergdoll is brilliant, but I'm surprised nobody's written about him yet, because I know a great many students disagree with me. \nGood stuff about Bergdoll: He really knows his shit. And he doesn't feel the need to dress his lectures up with incomprehensible and often tangential theory; his insights are good enough to stand up without ornamental jargon. He loves the material, and it shows; his lectures are engaging and information-packed (he loves to tell you which architects were probably shacking up, for example--and let me tell you, 19th-century architecture really needs sexing up sometimes). His enthusiasm is infectious. Bergdoll also really cares about undergraduates, which is pretty amazing since he's Chair of the department and seems to spend all his time kissing babies and leading tours in Romania. I have never had a problem meeting with him to discuss paper topics, even outside of office hours. Nor did I ever feel like he didn't take me seriously; again, VERY rare for a big shot art history professor. \nAnd now, the bad about Bergdoll: He knows his shit, but that means that a 75-minute lecture often turns into 80 or 90, and you WILL be tested on those extra minutes. He's really excited about the material, which means that his lectures sometimes feel like brain-dumps. I suggest writing absolutely everything down, tape-recording, or resigning yourself to not doing as well as you'd hoped. And don't skip class, really, just don't. You're going to be tested on his lectures, not the reading, and his exams are really hard. Literally every slide he shows (and there are MANY of them) could show up, even if he only talked about it for five seconds. So if you don't have the time or inclination to memorize absolutely everything (thank God, the images are posted on the course website), you will be in trouble. Also, he can be something of a cold fish in person, especially if you waltz into his office hours not totally prepared. There are many architecture and art history students who hate his guts.\nMy advice is this: if you don't have a good memory for images, and you don't REALLY love architecture, I strongly suggest you take his courses anyway--but take them PASS/FAIL. \nWorkload:\nLectures: midterm, final, 10-12 page research paper, about 4 hours of reading weekly but you could get away with just reading the survey text. Seminars: tons of reading (which you had better do if you don't want to look like the class idiot), class presentation and final research paper. In all cases, an A- is easy to come by if you memorize and spit back, which may be easier said than done.\n"
        }
    ]
}