{
    "prof_info": [
        {
            "prof_name": "Emma Winter",
            "prof_id": 2696,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "British History 1760-1867",
            "review_date": "February 18, 2007",
            "review_content": "\nProbably the worst lecturer I've had here at Columbia.  Although all her seminar students seem to love her, her lectures are incredibly boring.  She pre-types every word in each lecture, and reads the lectures to the class in a monotone voice from behind a podium.  You will learn precisely what you can learn from any British History textbook; if you take the course, you're probably better off just reading that.  \nWorkload:\nLOTS of reading, which one might find interesting but not necessary for the course, weekly discussion section, midterm and final (specific fact questions, ID's, essay), research paper.  Standard for history class, but more reading is assigned than most other courses.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 11, 2007",
            "review_content": "\nAlthough Emma is a friendly woman who truly attempts to connect with her students, I was often frustrated by her classes. The brilliance  of my classmates and her reluctance to lecture on extensively made for good discussion, but I felt that her limited knowledge of the material often hampered understanding beyond the obvious. I didn't learn very much in class unless I hadn't done the reading. That said, I was never miserable except when writing the first paper (the topics were awful), she had handouts that made quote searching and test reviewing much easier, and she is a fair grader. Overall better than average, but CC is not quite her subject.\nWorkload:\nSame old. A couple papers short and some short summaries.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 31, 2006",
            "review_content": "\nThe absolute best I've had so far at Columbia.  She would begin each class period by handing out a packet providing background information, important themes, and select quotations.  These proved invaluable come test time.\nThe best aspect of the class was her ability to facilitate discussion.  It could be that my section simply had lots of social, intelligent, opinionated people (it did) but it was still amazing to see that at least half the class spoke regularly.  Emma doesn't proselytize nor does she judge.  My politics, from what I could tell, are markedly different from hers and I never once felt uncomfortable.\nShe has a lovely sense of humor and a great deal of patience.  She also brings cupcakes for review sessions.  Switch into her section if you can!\nWorkload:\nThe usual CC workload - lots of reading, a few written summaries, a couple of essays, midterm, final.  You can get away with not doing the reading, but you're really not doing yourself any favors.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 12, 2006",
            "review_content": "\nProf. Winter is an extremely talented professor who made CC a truly enjoyable experience. Instead of lecturing on for hours as we know some core professors can, she really faciliated our class discussions and linked the texts to the issues and questions that affect our lives as growing adults. She turned the class into a very supportive environment for discussion and while she's new to teaching CC, she is excellent at explaining the trickier parts of the text and is willing to listen to everyone's opinion. The written summaries that she assigns are also very helpful in making us work through some of the more difficult texts, and because their graded on a check/check minus basis, one doesn't have to worry about thinking outside the box and getting penalized for it. Definitely take CC with Prof. Winter. \nWorkload:\n4-6 written summaries a semster/two 6-8 page papers/1 in class presentation/midterm and final-all very manageable\n"
        },
        {
            "course_name": "Nations and Nationalism in the Nineteenth Century",
            "review_date": "December 18, 2005",
            "review_content": "\nI second the first reviewer's comments and compliments whole-heartedly. Prof. Winter is a very engaging, erudite scholar who tackled a subject area of immense breadth and depth and made it vigorous yet acessible. This process was aided by the fact that the class was populated by students who clearly wanted to be there and took the readings, assignments, and discussions very seriously. All and all this class was no less than emblematic of the staff and students of a world-class university. I urge anyone interested in nineteenth century nationalism (or art, which Prof. Winter specializes in) to take her course offerings in the coming years. A wonderful addition to the faculty of the History Department. \nWorkload:\n1 5-page paper on a question related to nationalism, 1 5-page book review. 1 15-20 page work of original research. I should add that Prof. Winter takes a sincere interest in all of her students on an individual level too. Her feedback is well-thought out and very helpful. \n"
        },
        {
            "course_name": "Nations and Nationalism in 19th Century Europe",
            "review_date": "December 16, 2005",
            "review_content": "\nThis course was amazing and I highly recommend it.  Professor Winter was an excellent guide for our discussion-based seminar, delicately shaping conversation and and fostering student participation.  I think that the reading list might scare some people, but the reading wasn't as awful as it looked.  For the first few weeks all the books were crucial, but after that, Prof. Winter let us know which books (and sections of books) would be really important, and this made the reading quite manageable for a seminar. This was an extremely intense and complicated topic, both in terms of the historical topic and the theoretical concepts involved,  but Prof. Winter detangled it all without ever turning our discussion-based seminar into a lecture.  This is a truly excellent course with an amazing professor.  Take anything you can with her, because I'm sure that any topic she teaches will be as well-presented and critically interesting as this one was. \nWorkload:\n1 2-3 page book review, 1 5-7 page paper on one of several assigned questions, 1 15-20 page research paper on anything you choose that has anything to do with nationalism and 19th C Europe. \n"
        },
        {
            "course_name": "Nations and Nationalism in 19th Century Europe",
            "review_date": "December 12, 2005",
            "review_content": "\nFantastic.\nShe is new at Columbia (Fall'05), from Cambridge, and is already quite simply among the best History Professors we have (and believe me, we have some terrific History profs here).  Her reading list was the absolute best I have ever had in a course in Columbia. Moreover, the course followed a clear progression through the absolutely muddled late 18th-late 19th centuries--based on the theme of the nation and the development of the nationalist ideology.  She always made sure to clarify the DOZENS of incredibly confusing distinctions that pervade this subject--issues of historical fact, theoretical terms, or any other kinds of things that were confusing, while always making sure to keep the course a DISCUSSION based seminar.  EVERY student had ample time to speak (though admittedly they were all particularly engaged--something of a rarity).  The reading list seemed insanely long at first (maybe the Cambridge way), but it was only absolutely necessary to read all the books on the syllabus the first two weeks (for the various theoretical perspectives that the course dealt with).  From then on out, She would tell us which texts were the most important to get to and the load became very reasonable. by paper writing time, we had hardly anything to read at all.  Finally, Professor Winter took a very detached, critical stance toward the subject matter, fostering several different viewpoints and encouraging constant debate while never siding with one side or another. Simply put, the course and professor were both phenomenal, and it would be a very good idea to take a class with Professor Winter.  Cambridge's loss.\nWorkload:\nSeems like a terrifying amount of reading at first, but really isnt so bad after the first two weeks (it actually becomes alot less later in the course).  one 2-3 page Book review, one 5-7 page Essay on a choice of questions, and a 15-20 page research paper on a relevant subject of your choosing (but you can practically do it on whatever you want so long as it is marginally related to nationalism, around the 18th-19th century).  Sounded like alot, and was, but it went alot faster than similar workloads in other courses.\n"
        }
    ]
}