{
    "prof_info": [
        {
            "prof_name": "Sunhee Song",
            "prof_id": 10361,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Korean II",
            "review_date": "May 01, 2013",
            "review_content": "\nProfessor Song deserves at least a silver nugget. I've had her for four semesters and I am quite disappointed that she won't be teaching Advanced Korean. She really cares for her students and makes sure that everyone gains an experience rather than just take a class. She tries to foster relationships, not just that of the professor and student, but also amongst the students. The whole class and Professor Song even have a lunch together at the Faculty House once a semester to get to know one another. Since it's usually a class with around 15 (no more than 20) students and meets everyday (MTWR), everyone does get close. She jokes around but also makes sure that everyone understands the material before moving on. However, the class moves rather quickly. \nThe class is very structured and follows the textbook that Carol Schulz helps write. Every chapter includes two subsets, each with a conversation, vocab words, and two or three grammar lessons. Professor Song follows this format with her powerpoints but also includes her own methods to make sure the material is understood. There are also worksheets done during class to go over the grammar and a workbook for homework that can take some time but is extremely helpful. Intermediate Korean students will also have to start memorizing Hanja (Chinese characters) and this will be taught during some of the classes. \nShe gives exams for about every two chapters, so it should be around four per semester. There are also vocabulary/dictation quizzes for each chapter and hanja quizzes. She grades very fairly. This is especially true for native speakers who might know how to say something but not exactly in the way the textbook dictates. She knows that everyone in the class is at a different level and will grade accordingly. For example, if there is a composition on an exam and you try to write in a more advanced manner but make more mistakes, you will probably do around the same, if not better, than someone who stays safe with routine words and makes almost no errors. \nI strongly recommend taking her class if you are looking to take Korean, even non-native speakers! She understands that this is much harder for you and will help you in any way possible. I have friends who took her class first, then switched to non-native, only to switch back because her class is much more enjoyable and effective. She's also one of the nicest people I have ever met. You won't regret it!\nWorkload:\nThere are about 4 quizzes per semester, a midterm, and a final. She tries to include vocab/dictation quizzes every chapter and three hanja quizzes, each with 20 characters. The workbook can take a lot of time but it will help you. She also tries to take questions from the workbook for her exams. To practice typing and writing, a one page journal entry is due every week. There is a final video project for the oral part of the class but you'll have a lot of fun/bonding time while doing it.\n"
        },
        {
            "course_name": "Beginner Korean II",
            "review_date": "April 18, 2013",
            "review_content": "\nProfessor Song is probably one of the most amazing professors I have ever had. When I first signed up to take Korean I didn't know what to expect at all and I didn't have a background in Korean. She understands that there are a lot of non natives and really tries to accommodate them. I look forward to going to class everyday just because she makes learning Korean so much fun. She really makes sure that everyone in the class understands the material and makes an effort to know everyone by name and always checks in whenever you are absent or miss an assignment (which could also be a bad thing which ever way you look at it). I definitely plan on fulfilling the rest of my language requirement with her. She is also the sweetest person ever. \nWorkload:\nnot too overwhelming. A long quiz every 2 weeks, occasional vocabulary quiz (but most of the terms and phrases come directly from thing we cover), 1-page journal entries due weekly, workbook. \n"
        },
        {
            "course_name": "Beginner Korean ",
            "review_date": "April 17, 2013",
            "review_content": "\nShe is an absolute sweetheart. As a native Korean there is really no question that she can't answer, and she always takes time to answer questions you may have about the language or culture, even if it isn't directly related to what you're currently learning about. The class is fast paced (Beginning semester II at least), but due rather to the amount of material that is needed to be covered rather than Song's preference. I have never taken Korean before or spoken it with my family, but my Korean family who I have interacted with since I began to learn Korean with Song is seriously impressed. You will learn.\nWorkload:\nSong grades fairly - there are quizzes about every week (some are minor 10 point quizzes on vocab, others are more comprehensive 25 point quizzes on chapters as a whole), a midterm, a final, and at least at the beginning level there is a video project. These will, for the most part, determine your grade, however I'm inclined to say that she inflates grades (minimally) based on effort and participation. Additionally the course has a workbook which is expected to be completed as you progress through the chapters. Some of it is difficult, but for the most part it will help you learn the language.\n"
        }
    ]
}