{
    "prof_info": [
        {
            "prof_name": "Kate Daloz",
            "prof_id": 4606,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 09, 2012",
            "review_content": "\nKate was a really great prof.  The homework assignments seemed a lot like busy work, but turned out to actually be helpful if you were struggling to choose a paper topic or remember what the reading was even about.  She put a lot of time into editing essays and grading them and gave a lot of valuable feedback.  When you meet with her, she won't directly tell you what she wants you to do.  Instead, she will ask questions to lead you where she wants you to go.  It's a little confusing at first, but you will come out of the meeting with a good understanding of what you need to do.  She also does this thing where the whole class edits a few people's papers.  Definitely volunteer for that, it's really helpful.  Also, make sure you implement all the suggestions she gives you.  It will help your paper a lot.\nYou will pretty much get a B unless your paper is exceptionally good or exceptionally bad.  She bumps grades by 1/3 of a letter (B+ to A-, A- to A, etc) in the case of exceptional participation (or lack of it, I think). \nAlso, she should have some chili peppers.\nWorkload:\nLens Essay, 1500-2000 words; Conversation Essay, 1500-2000 words; Research Essay, 2000-3000 words; Reflection Essay, 1000-1500 words.\nEach of the first three essays is weighted more heavily than the previous, and the the reflection is worth 10%.\nHomeworks aren't technically figured into the final grade, but I would assume she counts them towards participation (or lack thereof) when determining whether or not to bump final grades.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 03, 2012",
            "review_content": "\nThe other reviews seem to have Kate summed up pretty well.  Despite the inherent misery that comes along with taking UWriting, Kate really does her best to make it a course that improves the writing skills of her students.  First off, Kate has a very outgoing personality which really comes through during some of the more boring classes.  But where Kate really shines is in the one on one conferences, during which she gives a lot of great advicel.  And if the one mandatory conference per essay is not enough, Kate is very open to repeating the process during office hours.  In fact, Kate gives so much helpful feedback that by the time you have to submit a final draft you know exactly what she is looking for and how your writing can improve in general.  The end result is that the grading is very fair and you become a better writer too.\nWorkload:\nStandard UWriting workload, except she gives only a 2000 min. word count for the research essay while other professors have been known to give a min. of 3000 words.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 22, 2011",
            "review_content": "\nKate did a great job of making a course that can be abysmal genuinely helpful. Class would sometimes get a little dull, but that was mostly because most of us probably weren't as engaged as we should have been. Filler homework assignments aside, I found each of the essays to be interesting and effective in improving my writing, and Kate clearly put an enormous amount of effort into giving each student individual attention and feedback. The grading wasn't particularly harsh, and I felt that the expectations throughout the course were clear. Take UWriting with Kate if you can--she's definitely in the top half of instructors (and also a great person)!\nWorkload:\nThe usual: Lens Essay (1500-2000 words), Conversation Essay (same), Research Essay (2000-3000 words), Reflection Essay (1000-1500 words), busywork assignments in between. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 15, 2011",
            "review_content": "\nKate is great. She's clearly very passionate about writing and the writing process, and I really felt like she cared about my progress within the class. Kate will go to great lengths to engage a class and really enjoys giving little writing activities to illustrate concepts. My particular section was particularly quiet and sleepy, so this made things a little awkward at times. \nKate requires private meetings that take place before turning in a final version. At first, I dreaded going to these; but Kate uses the time to give you very helpful constructive criticism and to ask about your personal feelings on what you've written. These meetings also make the grading very fair -- Kate is always very direct with what parts of your essay lost her/what sections may need further work. I felt like I left the class a better writer because of her conferences. \n\nWorkload:\nThe main UW essays, writing assignments and activities for Courseworks (these are usually not due until a few hours before class, and take almost no time at all).\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 11, 2009",
            "review_content": "\nIf you get Kate for UW, stick with her. She's a very talented wrier who will help you improve your writing, no matter what level you're at. It's great to have a grad student pursuing an actual degree in writing because in readings and assignments, she focuses on the structure and function of pieces, rather than their content, so you're always learning about writing per se. She's also an extremely nice person with real enthusiasm in the course and love for her students. \nThat said, UW is a pretty childish course with some components that will make you cringe, and some of Kate's exercises make this worse. Her requirements are somewhat demanding, like mandatory conferences, Courseworks postings, and readings/exercises due every class. Some of the readings and exercises are boring, but the big assignments will improve your writing, especially with the comments on several drafts that Kate gives. \nWorkload:\nStandard UW papers; writing assignments every class based on published essays as reading. \n"
        }
    ]
}