{
    "prof_info": [
        {
            "prof_name": "Maja Horn",
            "prof_id": 3092,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Hispanic Culture",
            "review_date": "October 07, 2009",
            "review_content": "\nTook her class last semester at Barnard and loved her.  She's very friendly and super understanding.  A lot of the class revolves around the readings and class or group discussions about them.  If you don't really understand or the class is silent (i.e. no one read) she'll push you in the right direction or frame the questions in a way that make it easier to talk about.  The syllabus was pretty interesting too - for the art section she had us go to a museum exhibit and write our essay on how it tied into what we were discussing in class; another section included watching telenovelas.\nWorkload:\nAround 5 papers (one per section of culture discussed), with rewrites.  One or two projects, including a final presentation; no midterm or final exam.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 27, 2006",
            "review_content": "\nProfessor Horn is great. This was her first semester teaching at Barnard and the hiring committee made a superior choice. She is young, fresh, and brimming with enthusiasm. Although the Spanish department has a standard syllabus for the class, Professor Horn manages to make it interesting and really engaging. She is really creative in her approach to teaching grammar and literature, and has clear expectations. When the syllabus was too vague with the departmentÂ’s requirements for the first paper, she really listened to our feedback and adjusted the next papers accordingly. She is really interested in the classesÂ’ thoughts and passions, and try to manipulate the syllabus as mush as she can to reflect that. She is fluent in at least three languages, as she is German, lived in Venezuela when she was younger, did her research in the Dominican Republic, and went to undergrad and grad in the States. Her research has focuses on queer Dominican women artists, but has a diverse knowledge base of multiple Latin American nations, Latino populations in the US, and Latin American literary traditions. I highly recommend her, and it would be a pity if you went through the department without taking one of her classes. If you just give this class a decent effort you can a get a good grade. \nWorkload:\n3 2-3 page papers in Spanish, two tests that cover grammar and cultural analysis. The syllabus has homework, but she never checks it, although if you have any hope of getting the grammar you should do it. The final is cummulative.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 22, 2006",
            "review_content": "\nprofessor horn is awesome. she's young, enthusiastic, and really friendly. this class really helped my spanish and made me more interested in taking more spanish. she tries to keep things intersteing my mixing grammar and culture, and she has a great kknowledge about different spanish cultures. shes really approachable, and a good prof to have.\nWorkload:\n2 midterms, 3 papers, final. exams aren't hard, and shes a fair grader on the essaysl\n"
        },
        {
            "course_name": "BC 3143 Lit of Spanish Caribbean",
            "review_date": "December 06, 2006",
            "review_content": "\nProf Horn is new to Barnard and already establishing her place as an asset to the Columbia community. \nShe is an interesting professor, being young and from Germany. Her Spanish is incredible and knowledge of the Caribbean and the cultural dynamics within the region, especially the DR. \nThe readings are interesting and present many themes such as music, performance, and colloquial language as unifying elements for the Caribbean. They usually are not terribly long. \nFor PR, DR, or Cuban students, this class is interesting to learn our history in depth, while incorporating our own experiences into the material. Some people (usually non-native speakers) told me that some of the language in the stories was hard to understand since it is colloquial Caribbean Spanish. I think it wasnt hard for PR, DR, and Cuban studies because we speak like this and could relate easily.\nProf Horn's style is a little dry, but she really loves the material, which helps. She also is ALWAYS available to talk about class (her office hours are extensive) or to help with advice for majors and class choices.  She even answers emails on the weekend and late at night.\nThis class is definitely recommended!\nWorkload:\nReadings and mandatory postings on courseworks for every class period, presentation on reading of choice (20 min,) 3 essays of 5 pages, and one final essay 8 pages (3 pages of research added on to one previous essay)\n"
        }
    ]
}