{
    "prof_info": [
        {
            "prof_name": "Garud Iyengar",
            "prof_id": 2521,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Optimization ",
            "review_date": "December 22, 2016",
            "review_content": "\nGarud is an amazing prof and there is a reason why he is the department chair. Guy can teach programming as well as algebra, statistics ( basically anything you throw at him ). He is frank, open and tries his best to ensure that nobody does really bad in his class. My major concern with the course was that while the first half was linear prog and a basic intro to convex optimization, the second half contained integer, Quadratic, non linear as well as dynamic and all of this was on the finals.\nYou can definitely take this but be prepared to spend 10 - 15 hours per week minimum easily if you wanna do well.\nPro tip: If you are focused on grades, make sure you put in tons of efforts for the midterm as 1, the finals seemed way too complicated wrt the midterm and 2, the syllabus for the finals seemed way too vast.\nWorkload:\nBe prepared to shit amounts of work but a lot of learning\n"
        },
        {
            "course_name": "Asset Allocation",
            "review_date": "May 23, 2012",
            "review_content": "\nAsset Allocation is not an easy class to take. While a simple asset allocation course can be taken in Davidson's Financial Econ course, Garud delves more into the technical and theoretical side of asset allocation. It gets interesting as you factor in variables like taxes, changes in asset prices, and optimal solutions that most undergraduate level courses don't talk about. You get to read some cool research papers about new financial models being developed at Barclays and Axioma and see how it relates to the material in class. Some of the risk management and VaR material that you study does help in the real world...\nThe main downside is most of the class is graduate students that kill the curve because graduate students have no life. This is not Garud's fault...\nAssignments - Weekly homeworks that are time consuming and sometimes quite hard. First midterm was easy, second was hard, final was hard but reasonable. All of the materials on the tests and exams came directly from notes; Garud is very straightforward about this and does not try to throw curve balls.\nGrading is very fair.\nAbout Garud - He is very knowledgeable and really helpful. He is straightforward and to the point. The material can be boring at times because it is quite theoretical. Garud commented that when he was a graduate student, he didn't pay attention in class and skipped class alot so he couldn't penalize us for doing the same. \n\nWorkload:\nWeekly Assignments that are time consuming but manageable if you work in groups or friends. \nEasy 1st midterm, hard 2nd midterm and hard final but all the material comes straight from his notes. \n"
        },
        {
            "course_name": "Financial Engineering I",
            "review_date": "May 20, 2011",
            "review_content": "\nThe guy below is right. This guy's brain works a mile per second. He talks way too fast and it's like he's trying to jam as much material in you as he can. His style fits the following analogy: he feeds you a big burger, and before you swallow it, he feeds you another big slice of pizza. It's just not possible to take notes in his lecture because by the time you write down a sentence in your notes, he probably already moves on to the next topic. He used the lecture notes from another professor (Martin Haugh). Sure, I know he doesn't want to spend extra time to prepare for notes, but he should at least use the same notation as Haugh's note to avoid confusion. \nAnd he's kind of cocky too. Some guy was asking him a question in the lecture, and he blatantly replies \"No, that would be dumb.\" What a nice way to embarass your student in front of the whole class. \nHe finishes the material on the midterm two weeks before the midterm (Like I said, he talks really fast). So he spent the 1.5 lectures before the midterm going over stuff to be covered in the final (0.5 lecture was devoted to a mini, but not very helpful, review). That's not a very good way to help us prepare for the midterm by going over stuff that won't be on the midterm. \nOh, and he specifically said in the lecture that we will not be responsible for certain topic (such as trinomial model) for the final exam. Guess what, it is in the final. \nAnother brilliant thing that he said in regard to the final: 20% of the test will be stuff that we have never seen before. Gee, I wonder what is the point of testing us the stuff that we've never seen. \nWorkload:\nweekly homework (hard, impossible to get all of the questions right without the helps from TA)\nhard midterm\nhard final\n"
        },
        {
            "course_name": "Asset Allocation",
            "review_date": "May 17, 2009",
            "review_content": "\nBy far one of the best teachers I've had in IEOR, plus he seems to be really brilliant.\nThe course covers several methods for optimizing asset allocation, but you definitely need to have done well in optimization/probabilities as you will need it. The professor does a great job explaining the material and his notes are very good, but going to class is a must as no useful textbook is available and actually by the end of the class we were covering material from resent research papers. He adds a lot of insight on what happens in the industry, making parallels to what he is covering in class. At least for me that made the class a lot more interesting. You need to do all the homeworks as some problems will appear very similar in the tests. He is very approachable even outside his office hours.\nThe recitations were useful (TA was Rodrigo Carrasco) as he went over the previous homework solutions making them more clear. The only problem was that he didn't cover much about the next homework so no hints on how to solve it, but I e-mailed him a couple of times and that helped me a lot. Anyway, as the recitations were taped in CVN you could check them on-line. He also made great homework solutions explaining step by step how to do everything (not just one line solutions you generally get) and gave additional insights on why things were working or not.\n\nWorkload:\nAlthough the syllabus said homework every other week, we ended up having weekly homeworks. Not too tough but they require a lot of programming in Matlab and AMPL so you might end up spending a couple of days at the lab fighting with it.\n1 Midterm and a Final with a cheat sheet, very close to the samples shown in recitations.\n"
        },
        {
            "course_name": "IEOR 4600 Applied Integer Programming",
            "review_date": "June 02, 2005",
            "review_content": "\nThis guy's brain works a mile per second. Even if you make the effort to go to class, you probably won't get anything out of his lectures. But I still encourage you to go because the book is even worse. When I really sat down and looked through his notes and the textbook, the material itself is not that bad, but both him and the book overcomplicate simple concepts. My advice: don't fall behind, stay on top of things in this class, DO all the problem sets, and go to office hours/recitations, the TA was a godsend! He might even do a few pset problems for you! in this class, it's actually very easy for you to fail!\nWorkload:\nweekly problem sets ranging from easy to extremely difficult, hard midterm, hard non-cumulative final, and one annoying as hell project (start early!!!)\n"
        },
        {
            "course_name": "IEOR 4600 Applied Integer Programming",
            "review_date": "May 09, 2005",
            "review_content": "\nCourse is pretty difficult and Iyengar does not really explain topics in-depth. Text is horrible. He is very approachable during office hours. \nWorkload:\nHW due every week, involves both theory and programming. Term project is rather difficult as well. Be prepared to do a lot of work\n"
        }
    ]
}