{
    "prof_info": [
        {
            "prof_name": "Heather Cleary-Wolfgang",
            "prof_id": 9921,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 02, 2013",
            "review_content": "\nShe's the best. No joke. She's so nice and sweet and it's so clear she really wants her students to do extremely well. She always tries to make sure the class understands the grammar, and from what I can tell everyone did very well on the exams. Take her class!!! As long as you meet her half way and put in the effort, she will love you.\nAlso, gentleman, don't be surprised if you develop a bit of a crush. She really is that pretty.\nWorkload:\n3 compositions, but you will have random 200 word assignments every now and again. Also MSL, but it's nothing that isn't manageable. You do a lot of grammar stuff in class so studying for exams isn't too hard.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "April 13, 2010",
            "review_content": "\nHeather Cleary-Wolfgang is the best thing since sliced bread and the movie Mean Girls. She is awesome, understanding, smart, and while serious enough to teach you Spanish also occasionally funny. I know that the semester is not over yet but I just couldn't wait to write this review about her.\n Basically what you do in most of the classes is pair or group up in the beginning and talk for about 10 minutes about a mostly random topic (What did you do this weekend/last evening, something like that) to \"warm up\". Then you usually talk about grammar, which she explains clearly and understandably even when it comes to the fuzzy subjects of when to use the different tenses (you will talk about that a lot in this class). She also adheres to the book somewhat closely so you will be doing a good number of exercises, mostly in pairs or groups, which way you will get to know pretty much all of your classmates. \nThroughout all of this, Heather will be nice, open to questions at all times and answer them patiently. Something that not everybody might appreciate is her approach to praise students a lot and be very cautious with calling something outright wrong. I usually don't talk a lot in class and I find this helpful in participating more but everybody might not like it, although it's not exactly a flaw. \nWhat I'm trying to say here is: If you're taking a Spanish class, take Heather before the word spreads and her classes fill up. I'm actually sad that she won't be teaching Intermediate II this fall and I won't be able to take her class again. \nWorkload:\nPretty Standard: Online Spanish Exercises for every class, Workbook homework that she glances at but doesn't check for correctness (solutions are posted online), quizzes for every chapter (not graded, they are mostly for yourself), 3 compositions (graded superfairly) and the departmental Midterm and Finals.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 21, 2009",
            "review_content": "\nHeather is awesome.  She is kind, personable and understanding.  I would highly recommend her as an instructor.  As someone who has never taken a romance language before, I had a slow start in the class.  Heather understood.  When I went to her with concerns about speaking in front of the class she was helpful with suggestions and carefully went over some grammar with me.  She explains the grammar in English if the class seems very confused and was open to suggestions.  She really tries to make Spanish interesting and doable.  She is forgiving with late arrivals and flexible with receiving assignments a little bit late (like if you forgot to bring your workbook to check or didn't print out your composition).  Plus she has really great fashion sense.  \nAs an aside, I highly recommend Barron's 501 Spanish Verbs.  There are some irregular conjugations that are not in the textbook, but are required in the homework.  It's also possible to look these up on verbix.com and such, but I've found Barron's to be a helpful to the atrocious grammar book that comes in the required packet.  \nWorkload:\nStandard for the Spanish department.  Quia online homework, workbook practice that she glances at, 4 compositions, a few ungraded practice sentence activities, a final oral group presentation.  Easy midterm, fair final and oral.  \n"
        }
    ]
}