{
    "prof_info": [
        {
            "prof_name": "Arthur Salvo",
            "prof_id": 4893,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 14, 2016",
            "review_content": "\nArthur is the instructor that I have always envisioned I would have at Columbia. Arthur embodies everything I was looking for in a professor from such a prestigious institution of higher education: caring about his students' learning, not \"robbing\" us from the beauty of arriving to conclusions ourselves by igniting discussions, critical thinking and debates through his intellectually challenging questions instead of just giving us information through one-way teaching (professor-student). I always felt comfortable to affirm my opinions without fearing I would be judged or contradicted by my instructor or my classmates - and this is due to the engaging, positive and safe atmosphere that Arthur ensures to be the background for the most interesting discussions I have ever had in my life prior to Columbia. Having been accustomed to an educational system in which I would discuss just the form of a text and the reasons why characters were positive, negative or complex, now with Arthur stressing that it is far more important to delve into the character's \"thinking\" processes and the aims that drive their actions (which simultaneously helped me understand human behavior), I can affirm with certainty that I am a much more critical reader. Thanks to Arthur, I do not trust any information that any text, author, work gives me, but read the text against itself and question aspects I would not have had in the past. Thanks to Arthur, I now experience the beauty of critical reading, the beauty of reading texts and feeling that I am not undergoing a passive activity but rather an investigation with every written work that I delve in. \nDuring the trip at The MET, I realized how much knowledge I acquired after just a couple of months at Columbia even just by taking this course. It was extremely fascinating to see how all the ancient writings that we read connected to ancient art. Although I was mesmerized by all the correlations between Herodotus', Homer's and Euripides' works with the art pieces we saw, I found particularly interesting how during the visit we touched upon how the Romans imitated bronze Greek sculptures and right the day after the visit we read a passage acknowledging bronze sculptures in Virgil's Aeneid which we then connected to Virgil's inspiration in Homeric works etc. \n\nWorkload:\n1 midterm, 2 papers, final. Be sure to make your papers interesting, as Arthur grades papers pretty harshly, while he grades the exams leniently.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2016",
            "review_content": "\nI thought Lit Hum was going to be a nightmare, but Arthur has made the class infinitely more enjoyable than it could've been.  Our discussions are always thoughtful and student-led, and he creates an atmosphere of inclusion that allows everyone to contribute meaningfully.  Even if you come into class having no idea what you just read, he is able to lead us to come to our own conclusions and understanding of the material.  The class time (6:10-8) was pretty brutal, but he made it tolerable (we all took turns bringing in snacks) and we all signed up for the same time slot, as horrible as it was, because he is just that great.  Our whole class agrees that he should have a gold nugget.  \nWorkload:\nManageable-- the usual reading workload for lit hum (pretty brutal but standard) and two essays a semester.  Midterms are modeled exactly like the final as a \"practice run.\"  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 24, 2013",
            "review_content": "\nGood professor. This class was at a terrible time (6:10-8:00) but Arthur did everything he could to keep us engaged with the texts. He never dictated discussions, instead letting us take the lead, which is one of the reasons I enjoyed this class. As a teacher, he always had great insight into the texts and could guide the class when we veered off-topic. Minor complaints would be that he sometimes over-complicates the texts - he uses terminology that may not be essential to our understanding of the text. For some texts, this works and isn't a problem, but for others it gets a bit annoying. \nHe's pretty particular about being on time, so keep that in mind if you're in his section. He takes us on a tour of the Met with an ArtHum instructor leading the tour, which was pretty informative and a lot of fun as well. Overall, LitHum with Salvo won't be a drag unless you really don't give a fuck about any of it. \nWorkload:\n2 papers, 1 midterm, 1 final. Reasonable workload, decent grader. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2013",
            "review_content": "\nAn amazing teacher. He was very enthusiastic about the texts we read. Class discussions were great because Arthur would guide our discussion toward the issues that all these texts presented and make us to confront them in a very textually engaging way. The class was very discussion-based and he never really lectured to us. He asked us challenging questions that provided for really lively class discussion.\nHe was also a very kind person. He was always willing to meet and talk to you. \nWorkload:\nVery reasonable. Standard two essays, weekly posting, midterm, and final. Generous grader.\n"
        },
        {
            "course_name": "Intermediate German I",
            "review_date": "May 19, 2011",
            "review_content": "\nArthur is one of the best teachers I've ever had. He's the kind of teacher that makes you want to do even better than the best that you can do. At the same time, class was so relaxed. Even though I had it 6:10-7:30 (even on Fridays), I loved going to class. I felt like I could make mistakes without being judged, and so I felt more comfortable trying to say more complicated things in German than I had before. If you have the opportunity to take German with Arthur - at any level - it's not something you should pass up.\n\nWorkload:\nIntermediate workload is standardized. 3 essays; 4 reflections; a few writing exercises; some homework activities; final portfolio (20% of grade); oral final (10%).\n"
        }
    ]
}