{
    "prof_info": [
        {
            "prof_name": "Jessica Pishko",
            "prof_id": 10780,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 09, 2012",
            "review_content": "\nIn a nutshell, Jessica Pishko is a graduate student who is in it for the tuition benefit, does not have your learning in mind, and it shows. She is very unclear about what she wants on your paper and assumes that you know everything beforehand so thorough explanations do not exist in this course.You can throw your syllabus out the window, because at the end of the semester she will come up with new ( and highly unethical ) reasons to bring down your grade and will conveniently announce this by the end of class. The course is an easy \"B\", but \"A\" material demands a paper of \"publishable\" quality that you will never achieve ( my classmate who received a B+ had a parent who was a journalist ) because her idea of a good paper deviates far from the norm. For a person who does not even write well herself ( google her name ), I find it entertaining that she is such a strict grader.\nDespite all of this this, the reading material was thought provoking and opened me to reading more essays from prominent writers.\n\nWorkload:\nWorkload is light and is a non-issue, the problem you will have is dealing with her ambiguous demands. If you have no problem with getting a solid B in her class, then by all means take it. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 12, 2011",
            "review_content": "\nJessica Pishko's University Writing class seemed to be pretty standard compared to others. The readings and homework assignments decreased as the semester moved on, allowing more time to work on your papers. She also gives more and more freedom as the semester progresses. We could write the research paper on almost anything as long as it related to the seed text by theme. (I wrote a paper on Fallout 3 relating to morality).\nShe met everyone in the class for every one of their papers at least once, giving you multiple other opportunities to see her if you needed more help. Her comments on your first drafts were fairly straightforward and if you follow her comments you will do very well on your final drafts. She gives more time to finish your final drafts than most other University Writing instructors; normally I had at least one more week to complete my final drafts then other people taking the course.\nSometimes she can be a little hard to interpret or understand in her criticism or teaching method, but she will always take the time to explain something that you didn't understand. \nIf you have some writing experience and enjoy discussing your reading in class, Jessica is a great fit.\nWorkload:\nA reasonable amount of reading and homework, but not an overload. I spent about 1.5 hours on homework when it was assigned. You have to do all four papers, but you have lots of freedom on the last two.\n"
        }
    ]
}