{
    "prof_info": [
        {
            "prof_name": "Abigail Susik",
            "prof_id": 1630,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 21, 2004",
            "review_content": "\nI have been at Columbia for 2 years and she is by far the best teacher I've had and she's only a grad student.  I went into the class only because I had to and I didn't expect to get anything out of it but a grade.  I got much much more.  Through her own enthusiasm and bubbly nature, she really brought out the best in her students.  I found myself developing a real interest in art and discussing things in class all the time.  She's taking a sabbatical now but should she ever come back, you have to take her!\nWorkload:\nLots of readings, three 4 page essays, a midterm, and a final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2004",
            "review_content": "\nAbigail is the best teacher I have had since being at Columbia. She was well informed, friendly and led very interesting discussions. \nShe always managed to be the perfect combination of fair yet firm in both her grading and assignments. I found her to be extremely approachable. Because of Abigail, I finally found a \"core\" class that I liked and left feeling enriched and educated. Abigail is a fantastic teacher and I only wish I could take her class again!\nWorkload:\nThree paper, Midterm and Final, all fairly graded\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 10, 2004",
            "review_content": "\nAbigail is that rare core professor with the enthusiasm and excitement that cross the line from an acceptable core experience to a thoroughly enjoyable one. It was her first semester teaching art hum, but Abigail met the challenge with ease and good humor, prepared her lectures in an engaging manner and got past standard setbacks like falling behind schedule with ease. At the beginning her inclusion of class members in discussions got to be slightly excessive, but leveled out and increased the intellectual stimulation a considerable amount later on. Her lectures on modernism and Picasso were outstanding, and caused at least one student to hopefully pursue more art history classes at some point in the future. She will make an outstanding professor in any course she teaches.   \nWorkload:\n3 papers (about 4-5 pages each), midterm (hard) and final, all graded fairly\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 19, 2003",
            "review_content": "\nThank God for Abigail... I doubt I'd have done as well as I did in Buchloh's 20th Century Art class otherwise.  She was my TA for this class and will be teaching Art Hum starting in Fall 2003... if you're placed in her Art Hum section, consider yourself blessed.  Abigail is kind, understanding, down-to-earth and overall a very cool person.  Don't be fooled by the friendly exterior, though!  This is a girl who REALLY knows her art history... but there's not a trace of pretension to be found anywhere.  \nWorkload:\nGenerously graded the midterm, final, and two papers that were assigned by Buchloh.  \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 14, 2003",
            "review_content": "\nAbigail Susik is a fabulous T.A. Not only does she have a genuine interest in your opinions, but she also perfectly decodes all that goes on during Buchloh's lectures.  She is extremely knowledgeable and will soon be teaching Art Hum.  Snag her if you can.\n"
        }
    ]
}