{
    "prof_info": [
        {
            "prof_name": "Gustaaf Brooijmans",
            "prof_id": 2506,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "January 20, 2014",
            "review_content": "\nLECTURE: Professor Brooijmans has a fairly straightforward lecture. However its pretty much right out of the book. I found that he clarified parts that I found confusing so tl;dr it was helpful. \nHOMEWORK: He assigns an optional problem set with corresponding sections hes covered. However, I didn't find them particularly indicative of exam questions. They are good practice though. \nEXAMS: He always says if you do all the two dot problems in the textbook you'll be okay for the exam. I know people that did and they were indeed okay but I never had time for that. \nGRADING: You have a total of 3 midterms and 1 final that count for your grade. One of the midterms is dropped. That gives you a total of 30% for each of the two midterms counted and 1 final that is worth 40%. The dropped midterm is based on net grade and not how well you did in comparison to others. For example, the last exam on relativity was the one with the lowest grades with an average in the single digits. If you got a 15/30 on that exam, but 20s on the other ones where the average was about a 20/30, your dropped grade would be the 15/30. Sucks. \ntl;dr: fair section of physics 1403, don't expect magic and/or magnificent grades\n\nWorkload:\n1 optional pset a week\n3 exams, 2 highest counted\n1 final\nworkload is what you make of it\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "January 12, 2014",
            "review_content": "\nBrooijmans is a good lecturer who clearly has a deep understanding of the material especially particle physics, largely through his experiences at the ATLAS experiment in Geneva. His lectures parallel the textbook almost exactly. The material in this course is really interesting, as it covers everything from sound, light, and even nuclear reactions to a survey of the many subatomic particles. In general the textbook does a good job of explaining the material, though Brooijmans inserts relevant anecdotes, uses interesting examples, and provides cool supplementary info into his lectures.\n\nWorkload:\nBrooijmans assigns optional ungraded homework (not to be turned in) about every two weeks. The problems he assigns are from the Halliday textbook and are usually random selections of 4-5 problems from the relevant sections. They are pretty useless by themselves. In order to really have a grasp of what's going on, you have to do many more problems than just those assigned, and thoroughly read the textbook. Grades are determined purely by results on three midterms, the first of which is around the third week of class, and a final. \nExam 1 (Mechanical waves, sound) Average: 22/30 (20% of grade)\nExam 2 (Diffraction, Interference) Average: 17/30 (20% of grade)\nExam 3 (Special Relativity) Average: 9/30 (20% of grade)\nFinal (not cumulative, covers particles, nuclear physics, atomic properties, fission, fusion) Average: 33/60 (40% of grade)\nAverage curves to a B.\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "December 26, 2010",
            "review_content": "\nProfessor Brooijmans is a good professor. His lectures are straightforward and yes, bear a striking resemblance to the book. However, it's an intro physics lecture--they are ALL straight from the book. He presented the material clearly. While it's not necessary to go to class to get new information on the topics he discusses, it is useful to go because he does not cover every section from each chapter. You'll save yourself reading/studying time if you go.\nHis problem sets are not really relevant. They're only 5 problems each, and he seemed to just randomly pick problems that weren't necessarily more important (or indicative of exam questions) than the many problems he didn't pick. He says that if you can do each two dot problem in the book, you'll be fine on the exam, and he's right, but there are tons of problems. Don't just focus on the psets.\nWorkload:\nungraded weekly problem sets (not collected), three exams (each worth 30%, lowest score dropped), noncumulative final (40%)\nit's nice that the final isn't cumulative but he crams the first three exams into the beginning of the semester so that the final still covers about twice as much material as any midterm.\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "December 22, 2008",
            "review_content": "\nI never went to class and got an A- even though I failed the 2nd midterm with a 9/30 (more than 1 standard deviation under avg.)\nThe trick is to make good cheat sheets for each midterm, and also do the practice midterms and make sure to understand them since midterm questions tend to be similar each year.\nWorkload:\nWeekly psets which everyone gets 10/10 on since solutions are widely available\n15% homework\n15% midterm 1\n30% midterm 2\n40% final\nso, dont mess up midterm 2, which is significantly harder than 1, and worth a ton.\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "December 22, 2008",
            "review_content": "\nSilver star? Give me a break. This is quite possibly the laziest, most unoriginal, unprepared lecturer in the entire department, and that is saying a lot. Bring your book along to whatever class you are taking with him. You will quickly find that the lessons are taken word for word from the text, except that the text is invariably more transparent and detailed. Do yourself a favor and skip the lectures. There is hardly anything to be gained from them. Or, better still, do yourself an even bigger favor and skip the course if that's an option for you.\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "January 13, 2008",
            "review_content": "\nHe really bothered me. I found him to be ncredibly boring an unorganized. Also, he has a thick accent. Classes were really unnecessary and since they were at 9 am, few people attended. However, its not a difficult class and had an easy curve. Also, he was helpful during office hours, probably because no one uses them. \nWorkload:\nweekly problem set - some students found the book's solutions. midterm and final with generous curve. \n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "March 23, 2007",
            "review_content": "\nI liked him.  His notes are very organized and parallel the book, and his exams are reasonable--no harder than the 2-dot problems in the Halliday/Resnick/Walker textbook.  I do recommend you actually do the homeworks and not just copy out of the solutions manual because it'll make life easier for you for the midterms and final.  9 am lecture was a little brutal but he's easy to understand and tries to crack a joke or two to wake people up.  Average grade seemed to be a B+ which is good.\nWorkload:\nWeekly homework set, 2 midterms final.\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "December 01, 2006",
            "review_content": "\nI think I was given the wrong impression of the 14 level with Westerhoff who, while a perfectly competent teacher, was a bit too difficult for a physics class of this level. Prof. Brooijmans, on the other hand, was totally aware of the overall student level and presented the material/midterms at an appropriate level. His English is perfectly comprehensible and he is very approachable. For all you in 16 level E&M; and are debating if you should drop down for Quantum, I completely recommend it; your life will be much easier and you might enjoy the material more if the level of stress decreases. \nWorkload:\nNot bad at all - A weekly homework assignment that's usually pretty easy. Two midterms and a final. \n"
        },
        {
            "course_name": "Electricity & Magnetism",
            "review_date": "May 21, 2006",
            "review_content": "\nGreat professor, helpful in office hours, very reasonable workload, nice tests/exams. If you're not in a physics heavy major then chances are you might not take a class of his, but if you do have a class taught by him you will most likely enjoy it.\nAlso, he has a fantastic accent.\nWorkload:\nVery Reasonable.\n"
        },
        {
            "course_name": "Introduction to Classical and Quantum Waves",
            "review_date": "December 22, 2005",
            "review_content": "\n   I have had physics phobia from previous professors and was going to change my major to English just so I could never take physics again.  Well, I ended up taking my final semester with Broojimas...and not only do I think I survived (i didn't get my grade yet)...but it was one of my favorite classes.  He is very helpful in office hours and tries to make sure we learn the material.  The homework is not too bad once you understand the material (which can be hard)...I recommend him.\nWorkload:\nnormal for physics\n"
        },
        {
            "course_name": "Electricity and Magnetism",
            "review_date": "April 28, 2005",
            "review_content": "\nHis accent is totally understandable, he's entertaining, he explains things well.  What more could one want?  While I'm not a huge fan of E&M; I looked forward to going to class and feel like I've gotten a reasonable amount out of it.  The TA did the homework during recitation, so it was possible to get through the class with no work at all (although I wouldn't recommend this... you'll get screwed on the exams).\nWorkload:\nWeekly problem set (consisting of four Griffiths problems of varying difficulty), two midterms, final.\n"
        }
    ]
}