{
    "prof_info": [
        {
            "prof_name": "Nora Kenworthy",
            "prof_id": 4567,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 14, 2009",
            "review_content": "\nNora was a very open and engaging instructor.  She let the class have a major part in deciding topics and would be very open ideas that we wanted to try in our writing.  I found the material she was teaching unclear at certain times, but I think that was more due to the jargon-heavy UWriting curriculum than her teaching style.  One thing to remember: Nora didn't take kindly to slacking/excuses/BS/sob stories in class and for late assignments.  She was very blunt when she thought people weren't pulling their weight in class.  Overall, good instructor for a so-so course.\nWorkload:\nI got the impression it was heavier than the average UW workload.  An assignment of varying length due almost every session along with the 3 standard UW essays and associated revisions.    \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 20, 2009",
            "review_content": "\nNora is a truly fantastic UWriting professor. I came into the course having heard really mixed reviews, but Nora quickly dispelled a lot of the bad things I had heard. She is brilliant, engaging, and always enthusiastic about the subject matter. Readings for UW vary across sections, but if you get Nora, you'll end up reading some really fascinating articles. Most of the articles you're assigned have a public health/theoretical bent, but even if that's not your thing, you'll still end up doing all of the readings because you won't want to disappoint her. Overall, awesome professor - hopefully she'll be teaching on tenure at some point.\nWorkload:\nPretty intense. I always had more work for UW than did my friends in other sections. But doing all the work really does pay off, both in grading and in your improvement as a writer. So, tough but worth it.\n"
        }
    ]
}