{
    "prof_info": [
        {
            "prof_name": "Martha Blumberg",
            "prof_id": 369,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Spanish 1 and 2",
            "review_date": "April 05, 2011",
            "review_content": "\nTAKE THIS CLASS! If you get into this class you are one of the lucky few. Professor Blumberg is a really amazing professor and I was lucky to have her for two semesters. I really don't know what I am going to do not having her next semester. She wants everyone in class to succeed and will use all different types of teaching methods to help you understand. She speaks a good amount of english in class so you don't feel overwhelmed. She is really big on class participation and she takes your participation as if you did your work or not. She becomes a kind of grandma figure because she is always there for you when you need help. Don't go into the class thinking she is a push over though. She expects you to put in as much effort as she does. It is way better to be on her good side then her bad side.\nWorkload:\n30 minutes of workbook 3 times a week, 4 essays a semester, midterm, final and a final project\n"
        },
        {
            "course_name": "Elementary I",
            "review_date": "November 10, 2010",
            "review_content": "\nBlumberg is the best. I strongly encourage you to take her class if you do not have a background in Spanish. She is easily approachable and really wants to see you succeed in her class. She has office hours but is always willing to schedule a time to meet with you after class. I really think my experience in her class had made me enjoy Spanish. She has a way of knowing if you have been doing your homework and she makes it clear when she thinks you haven't been pulling your weight. I like that though because it forces me to get my work for her class done. It is almost like she is your little old grandma and you don't want to disappoint her. \nWorkload:\nNot as bad as other Spanish I classes. It is manageable \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "April 01, 2010",
            "review_content": "\nProfessor Blumberg is great!  She is very personable and is great to talk with if you need a little help.  I took spanish in high school so I knew the material pretty well.  But overall, she presented it in a easily understood way even if you have never taken spanish before.  She is very approachable and helps a lot on your papers.  You get two chances to write the paper and she splits the grade.  This helps you learn spanish and also get a better grade at the same time! \nHighly recommend taking her class for a good grade and to learn basic spanish.\nWorkload:\none or two quizzes, two or three short papers, midterm, final\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 21, 2008",
            "review_content": "\nthis was my second semester with blums. i'm devastated that she doesn't teach intermediate 1. i loved her classes because she teaches in a style that's geared towards learning rather than just repetition, grammar, and test taking (i did fine on everything though). she was more into comprehension than the specifics, and wanted us to learn the tools to communicate in real life situations rather than completing a test. \ndefinitely take her for spanish (or at least a barnard instructor; i hear they have similar teaching methods).\n\nWorkload:\ndon't let her easygoing demeanor fool you. if you want to do well, you have to make the effort. she doesn't check up on you, so you have to be responsible in your work. \nassignments and quizzes were easy; midterm was departmental.\n"
        },
        {
            "course_name": "Elem. Span I & II",
            "review_date": "May 01, 2007",
            "review_content": "\nBlumberg made getting up and treking to Barnard worth it. I learned more with her in one semester than three years of highschool, and actually had fun doing so. She isn't a pushover though, so don't prance in expecting to do no work. You get back what you put in. All in all, she is incredible. Take her class!!!!\nWorkload:\nVery fair. Homework most nights, but in the work/lab book, takes maybe 30 miuntes. Tests and quizzes/papers are evenly spaced. No midterm, but a final, also fair. \n"
        },
        {
            "course_name": "Elementary I",
            "review_date": "October 31, 2006",
            "review_content": "\nThis lady is probably the best teacher you'll ever have for Elementary I.  Basically, she spoond feeds everyone and usually is really flexible about things.  Shes a overall a nice teacher, however she gets kind of annoying at times, making the class sing songs like we're in 2nd grade.  I mean if you take elementary spanish you should automatically be getting an A because the class is so easy but with Blumberg its probably a guaranteed A as long as you do the work.\nWorkload:\nHomework every night but she never checks it-sometimes will go over it in class though.  Quizzes every couple of weeks and Final.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 12, 2005",
            "review_content": "\nWell, this class was awesome!  I was forced into it after my section was full and she was incredibly awesome about it.  The HW is pretty much optional and due dates are pretty much non-existent as well.  I got an A+ in the class, which I had previoulsy thought was impossible, and I did not put in any extra effort.  She just is really concerned that her students are learning.  An excellent choice if you want a no stress class and want to learn something\nWorkload:\nHW is pretty much optional...3 essays which can be rewritten, 2 tests which can be made up, and the departmental final\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 29, 2004",
            "review_content": "\nProfesora Blumberg is a good choice if you are looking to finish your language requirement with little stress.  You probably won't learn anything new, however.  She is eager for her students to learn, so she takes a more individualized approach to teaching.  Unfortunately, though, what ends up happening in each class is that she introduces a lesson and those who are already familiar with the topic remain quiet while the others ask questions.  She quickly recognizes this and tells the class to go home, study the lesson on their own and then ask questions in the next class if there are any.  The exact same thing happens class after class because she is so worried about wasting the time of the students who already have a grasp of the concept.  If you are confused about something, be prepared to attend her office hours.  She is very relax about things such as due dates and retaking/rescheduling tests and she may even offer extra credit from time to time to help students make up for their absences.  She is such a sweet lady and she really wants the best for her students, but, unfortunately, I felt very unprepared for the departmental final.  \n\nWorkload:\nVery easy.  Rarely any homework, occasional reading.  Two tests, 4 2 page essays, final.\n"
        },
        {
            "course_name": "Elementary Spanish I and II",
            "review_date": "August 10, 2004",
            "review_content": "\nAlthough it's true that Professor Blumberg's class is easy, and that she is very lax about things like homework and re-taking tests, it's because she has a very unique outlook on what her class should be for students: she actually wants them to learn!  Professor Blumberg is very understanding of the fact that her students have heavy workloads, and that her class does not always take top priority, but that doesn't mean she doesn't expect them to work in her course as well.  She gives students every opportunity to succeed, making herself available to them outside of class and allowing students to make up quizzes and tests, and shows genuine concern for their stress levels and personal lives, if you choose to talk to her about it.  There is literally no excuse not to do well in this class.  Do the assigned work, even though it's not always checked; she often pulls quiz and test questions directly from the assignments.\nWorkload:\nOptional homework that should be done, semi-regular quizzes, 3-4 exams.  Attendance also counts.\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "February 21, 2002",
            "review_content": "\nI agree with the other reviews, and would like to add that if you intend to seriously study Spanish or even be prepared for Intermediate classes, don't take Professor Blumberg's easy easy course. She speaks in English almost all the time, and when she speaks in Spanish it is very slow and enunciated. When I switched to a different professor for Elementary II, I had a hard time getting used to a professor who talked in Spanish all the time and felt very behind. If I had waited until next year to switch professors, it would have been even worse.\nWorkload:\nNightly optional homework, easy tests\n"
        },
        {
            "course_name": "V1101-V1102 Elementary Spanish",
            "review_date": "May 06, 2001",
            "review_content": "\nMoody at times, Martha \"Blumie\" Bloomberg is quite lax. She sticks to her creed of giving students the benefit of the doubt (if you fail a test, there's always some sort of recourse), but don't talk to your neighbor during class!\nWorkload:\n3 or 4 exams per semester, midterm and final are basically included in those exams (there's no official midterm or final); oral presentation (usually a group skit) part of final grade; nightly hw that doesn't really have to be done\n"
        },
        {
            "course_name": "V1101-V1102 Elementary Spanish",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Blumberg is the stereotypical \"kind, old lady.\" She is very pleasant and understanding and sometimes even reminds me of my grandmother. She really loves the language and loves teaching it to her students. Sometimes, the class seems extremely rudimentary, but its pace is excellent if you don't expect a rigorous course and you are taking four other classes. In grading, she always gives students the benefit of the doubt.\nWorkload:\nLight homework every night, a bi-monthly test, final- oral project and written test\n"
        }
    ]
}