{
    "prof_info": [
        {
            "prof_name": "Paula Ettelbrick",
            "prof_id": 2982,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Sexuality and Law",
            "review_date": "December 29, 2010",
            "review_content": "\nLike some of the other reviewers, I was frustrated and disappointed by Professor Ettelbrick not providing comments on our term paper.  However, my personal experience is that she's not an unduly harsh grader all of the time (FWIW I got an A in the class).  \nIf you are an aspiring lawyer this is a great class to take: you begin to learn to think like one and you get a solid grounding in the legal history of sexuality in 20th century America.  I'm not pre-law myself but I really enjoyed this class because it challenged me to think about topics I'd studied before in a new framework.  \nWriting the term paper (on a legal topic of your choice which Professor Ettelbrick discusses with you and then signs off on) is definitely a challenge because it's really a different genre of writing than the papers we're used to as undergrads.  I did the one required meeting with Professor Ettelbrick about my paper and found it helpful, but as other reviewers have stated academia is not her primary career and she's pretty busy.  If I had required more help and guidance from her with the paper I'm not sure that I would have been able to get it.  That being said, I really enjoyed writing the paper for this class.  You can pick a topic that engages you and have a lot of fun with it.\nIn sum, this class is definitely not going to be engaging or appealing to everyone, and it's not an easy A.  But if you want to challenge yourself to think within a new intellectual framework and learn more about the law, it's an excellent class.\nWorkload:\n1 term paper (~13 pages), substantial but not overly taxing readings, 1 brief and easy class presentation.  Professor Ettelbrick tracks both attendance and how much you speak in seminar.\n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "March 30, 2010",
            "review_content": "\nI can't believe the person who wrote the most recent review had the EXACT same experience as me. I was in this class and met with her about my paper, never got feedback from her and when the time came to hand it in I never heard back from her, all I got was a C on my transcript without any explanation no matter how much I emailed her she wouldn't meet with me. Finally she talked with me over the phone and told e it was a bad paper and when I asked her why she didn't tell me that the FIRST time we discussed it she had no response. Also when I asked if I could pick up my paper to look at her comments she said there was no point because she doesn't write on the papers. Why the heck has the Women's Studies Department kept her on if so many students are saying the same thing: that she only has one graded assignment that she doesn't hand back or even give you comments on. This is absurd, it's time to junk this adjunct Barnard. \nWorkload:\nONE PAPER you will never get back. As other reviewers stated, she tells you its pointless to hand it back because she doesn't write comments. \n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "January 09, 2010",
            "review_content": "\nHATED THIS CLASS. I don't know what happened, the reviews of her went from glowing to loathing so she must have been good at one point. She is a crappy teacher, she didn't even give us comments on the ONE PAPER she assigned all semester.  If you want an explanation for your grade don't bother, she doesn't respond to emails ever and when I asked to see my final paper she said \"oh well I didn't write any comments on it.\" How are you going to only have one graded assignment and then not even comment on it or hand it back? Bad class, bad experience.Fire her Barnard, she might've been good once but not anymore.\nWorkload:\nOne graded assignment, a paper due at the end of the course that you can't and won't get back from her because as I said before she tells you there's no reason because she doesn't write anything on the paper. \n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "June 22, 2009",
            "review_content": "\nHere is the thing: If you are taking a course on law, and it is taught by an adjunct, that adjunct WILL be busy outside of class time because they are a practicing attorney. Think about it. If you go into the class with those expectations, you will not be disappointed. I was able to meet with her in her law office to discuss my paper, which was cool, and definitely a part of my educational experience. \nI learned a lot in this class, and she made sure that we read the case book critically. \nThe crux of the problem is that there are very few pre-law courses for undergrads at Columbia/Barnard. That is something that needs to be addressed by the administration, because there is obviously a need for more. \nWorkload:\nReading cases from the Sexuality, Gender, and the Law casebook every week, coming to class prepared to answer and ask questions, and one paper at the end of the term. \n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "April 06, 2009",
            "review_content": "\nI have to agree with the other reviewer. I was in this class last semester and LOATHED it. If she has such a busy important career off campus she should stick to that. She made no time for students, always seemed distracted and busy, cancelled two classes and ultimately was not worth the money we pay for Barnard. She ran a disorganized class and I was totally disappointed by how completely distracted she was from teaching. I never even got to meet with her for our mandatory discussion about our final papers because she couldn't find time. I wish Barnard would not hire her back. \nWorkload:\nOne paper which you may or may not get guidance on so it's a crap shoot as to your grade. I am a straight A student and got a C on my paper for this class.\n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "March 03, 2009",
            "review_content": "\nI totally agree with other reviewers that she was friendly and laid back in class. However my class experience with her was not as good. On the first day we had about 15 extra people trying to get in and instead of just telling them \"no it's a seminar\" she asked the rest of the class if it was ok which was totally unfair because we were obviously not going to turn on our fellow classmates but it made the rest of the semester miserable and crowded. Our class had about 30 people in it and multiple people ended up on the floor every day. She only assigned one paper which we were supposed to meet with her to make sure we were on the right track but since she's an adjunct it was impossible to get a hold of her. I ended up getting a B which was OK. She ended up having half-hearted phone conferences with many of us. I believe she might be a good professor but I think she might be too busy now to dedicate the time needed to being a teacher as well as a full time lawyer. Anyways overall bad experience, and I heard from a classmate they might not hire her back because of it, if they do take at your own risk, you never know which Paula Ettelbrick you might get. \nWorkload:\nOnly one paper at the end of the semester.\n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "January 22, 2009",
            "review_content": "\nGreat teacher. Totally laid back, so busy its hard to get a hold of her sometimes but so approachable, knowledgable, passionate, funny, and serious about the material.  \nWorkload:\nDude, like one propoaland one final paper. And reading from really interesting casebook. \n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "November 01, 2006",
            "review_content": "\nThis woman is one of my favorite people I've had the joy of coming into contact with at Barnard.  She is brilliant, incredibly likeable, inspiring, and super interesting.  This class is one of the best!  I love it because it's actually about the material and depends on you being really interested and invested in it, rather than having to do it for the grade.  I actually have no idea how she is as a grader and won't until the end of the year, but grades seem arbitrary in this class.   I wish it was a year-long class.  \nWorkload:\nplenty of reading you'll be sad you can't do all of it (it's so great!), really harmless midterm essay, end of the year paper.  for once the work feel like it has a point, so much less jumping through hoops\n"
        },
        {
            "course_name": "Sexuality and Law",
            "review_date": "August 11, 2006",
            "review_content": "\nProf Ettelbrick is extremely knowledgable, laid back, and friendly. The textbook for Sexuality and the Law may seem overwhelming at first (I could barely lift it) but Prof Ettlebrick tries to ensure that everyone understands the material (whether or not they have experience with law or women's studies). Because she doesnÂ’t care to be a disciplinarian, itÂ’s easy to slack off in her class, but if you care about the material you can learn so much from her. Before Sexuality and the Law, I had never taken a course in Women's Studies; by the end of the semester I chose it as my major. Plus, she treated the whole class to drinks on the last day.\nWorkload:\nA couple of small assignments during the semester and one final research paper. \n"
        }
    ]
}