{
    "prof_info": [
        {
            "prof_name": "Timea Szell",
            "prof_id": 630,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "December 08, 2016",
            "review_content": "\nProfessor Szell is a national treasure. She was my professor for critical writing which I took my sophomore year. The class was a lot of work with extensive reading each week and weekly discussion posts. She had each student lead the discussions twice per semester. Professor Szell is brilliant and knows so much about literature and writing. Her feedback on our essays was thorough and she graded very fairly My only qualm was that she talked a lot during class and some classes (which were two hours each) felt more like a lecture than a 9 person seminar. All in all, I loved the class and loved Professor Szell's teaching style.\nWorkload:\n3 essays, 2 of which had first drafts with feedback given before submitting a final draft. There was about 2-3 hours of reading a week and discussion posts on courseworks. \n"
        },
        {
            "course_name": "Animals in Text and Society",
            "review_date": "September 06, 2012",
            "review_content": "\nTake this class with this professor! She is witty, funny, warm, smart, friendly, completely reasonable and approachable. I have a great deal of respect for her. She is almost never in a bad mood, and if she is, it is all the more engaging to listen to her.\nthe subject is definitely not a discussion just about vegetarianism etc, it is much more than that. it is about animals and their meaning to humans in society, in literature etc. how do animals, as symbols, function in literature? it's all great.\nshe gives you feedback on every essay you write in the class. she gives you many options of what you can write about. she is a fair grader. her handwriting is difficult to read, but by the end of the semester you will have gotten the hang of it. \ni like the texts she chose too. i really wish she taught another class like this.\nshe made me want to work hard and do well. this class made me a better writer. class was never dull!\nWorkload:\nfairly light. she'll give readings on pdf format and a few short books. you don't really have to read everything, just the stuff you want to write about. but the readings are never difficult, i always wanted to read what she assigned. the work is not too time consuming. i liked her assignments - not a waste of time by any measure.\n"
        },
        {
            "course_name": "Junior Colloquium: The Enlightenment",
            "review_date": "June 16, 2012",
            "review_content": "\nI learned a lot from Professor Szell about how to write and how to talk meaningfully about literature. There is a lot to be gotten simply from listening to her mini-lectures in the beginning of each seminar--not only for content, but again, for ways to make observations about texts. She is wildly smart but also humble and even self-deprecating. Her \"tips for writing\" packet was incredibly useful. Her selections and pairings for the syllabus of the Enlightenment Colloquium really provided a deep and wide understanding of the time period--its dominant voices and ideas as well as those that were marginalized. She is a wonderful person AND a wonderful professor. \nWorkload:\nWeekly readings + brief written reflections; one or two papers; a final exam. Very reasonable/cool idea... you are allowed to miss one week of reflection and submit another one late. So reasonable accommodations for life outside of class are built in.\n"
        },
        {
            "course_name": "Coll: Order and Disorder",
            "review_date": "January 07, 2012",
            "review_content": "\nThis was the most unorganized class I have ever taken. We did not get a single grade back during the entire semester making it impossible to grasp our rank in the class. We also did not receive a full syllabus until the last week of classes but were rather told each assignment that we had to do the week before. \nProf. Szell is a great person, but a terribly unorganized and scatterbrained teacher. I do not recommend this course.\nWorkload:\nA lot of reading, a paper, a project and a final exam (which required a ridiculous amount of preparation)\n"
        },
        {
            "course_name": "Animals in Text and Society",
            "review_date": "April 06, 2010",
            "review_content": "\nProf Szell rocks - the purple hair, hilarious sense of humor, and gentle but on-target comments have all been retained, if not increased. (Well, maybe not the purple hair). She was obviously well-read, and approachable outside of class, with recommendations to suit your personal interests. In discussions, she'd give a brief introduction, and then wait for us to talk, but it was okay when no one had anything to say, also, so that our discussions were always balanced and enjoyable, with encouragement when necessary but no pressure. Also very kind about passing on info on fellowships and academic programs, even after the class ended.  The speaker she got for us at our 'tea party' was really interesting too. \nOverall, loved her class - engaging topic, fascinating perspectives, pleasant atmosphere.\nWorkload:\nNot bad even for a first year class, weekly light readings (besides a book here or there), three essays, no tests, class participation counts alot. \n"
        },
        {
            "course_name": "Colloquium: Reason and Imagination",
            "review_date": "July 15, 2006",
            "review_content": "\nProfessor Szell rocks. I wasn't too excited about the Enlightenment colloquium, a requirement for an English major, but she made it all worth it. She is hilarious (very self-deprecating) and clearly brilliant. While the classes often strayed from their intended path (and she could do a better job reeling in those who tell anecdotal stories every single class), it was always fun. Oh, and she has a Hungarian accent, purple hair, and a nose ring. And red-\nrimmed glasses. How could it not be good?\nWorkload:\nNot a problem. A bunch of novels and historical documents, many of which are discussed in class. The gist of a lot of them can be garnered from a few pages of reading, although many of them are more interesting than you would think. 3 papers and a final exam, of which she provides the question topics beforehand. Very manageable.\n"
        },
        {
            "course_name": "Fiction and Personal Narrative",
            "review_date": "April 16, 2006",
            "review_content": "\nProfessor Szell is a great writing teacher! I was impressed with her knack for being bang-on with critiques but at the same time never coming across as mean, and always finding something nice to say about the writing. She's a very encouraging and helpful teacher in general, and I thought all her antecdotes were funny (although I can see how she wouldn't be as good teaching something like Chaucer like the other reviews say). She really worked with me and my ideas, and though she's obviously an accomplished writer herself, she is not at all the kind of teacher to only like one type of writing, or writing that's just like hers. In short: take a writing course with her; she rocks, the course will rock, you'll become a better writer, it's awesome. My only critique of her?  She's kind of anal about things like punctuality and attendence and will insure that a bad attendance/punctuality record figures into your grade. But, she also gives you credit for things like being a good reviewer of other people's work, and an active class participant. \nWorkload:\n2-3 pages minimum of writing every week, 2-3 paragraphs in response to other people's writing per week, weekly reading assignments (short and you really don't have to do them), final portfolio/project (~20 pages). \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "February 05, 2006",
            "review_content": "\nI am normally not a fan of Literature courses; however, Timea made English interesting and not difficult to approach.  She welcomes every idea you have about what you're discussing, even if it does not sound like it's coming from an English major.  She is insightful, caring (she never wants to overwhelm you with too much work), and HILARIOUS.  Her anecdotes and wonderful character will keep you coming to class, and if that doesn't do it, her magenta hair will.  She was an amazing professor!  \nWorkload:\na few papers (2 versions each), reading, class discussion, she is a very fair grader. difficult, but fair.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 25, 2006",
            "review_content": "\nI love Timea Szell! She is one of the most compassionate, witty, laid-back professors I have ever had! She really made me want to come to class (I didn't miss once!); even the boring stuff was interesting to discuss. Her anecdotes are hilarious. She is a tough but fair grader. If you're not spectacular in writing English essays, you won't get an A from her. She helped with my writing and never overwhelmed us with too many assignments-she gave us just enough to read/write and learn and NOT freak out with TOO MUCH WORK.\nThus, if you get her for first year English, you will be thankful later. Especially after you realize that not all English professors here are as funny and charismatic as Timea.\n"
        },
        {
            "course_name": "The Canterbury Tales",
            "review_date": "December 21, 2002",
            "review_content": "\nBasically, unless you enjoy having to sign in for a lecture that is boring AND has no real effect on how well you do in the course, don't take this class. While Szell is interesting, I didn't really feel the connection necessary for the comfort level she expects you to have with the text.  Take something else for the pre-1900 if you can help it.\nWorkload:\nThe papers (2) appear safe because they are short(4-5 pages) BUT she requires you to meet with writing fellows and they are ridiculously harshly graded. Be really strict to middle school format-she gives you guidelines... including an explanation of 'what is a thesis'.\nWe didn't have a midterm, although we had pretty frequent translations that weren't a big deal. The final was self-explanatory but with the grading she generally employs who knows..\n"
        },
        {
            "course_name": "The Canterbury Tales",
            "review_date": "November 22, 2002",
            "review_content": "\nSeriously, avoid this class like the plague. Think she's funny on the first day? well, she's funny every day, for about two minutes, and it's usually some dumb quip about how she's trying not to put us to sleep (and failing miserably). It's okay, kids, she doesn't take it personally. I fall asleep in this class EVERY day. i am awoken by the sound of my pen hitting the desk after it falls out of my hand. it's completely ridiculous. she canceled our midterm, so there is almost no work day to day unless you feel like opening that mammoth of a book she made us buy. the Riverside Chaucer, bigger than any textbook i've ever seen, and it costs seventy five bucks! class is always, always tedious. we just got our papers back, and she crossed out how i wrote the date: \"10/16/02\" and wrote in \"write out: October, 16, 2002.\" Okaaaaaay . . . like she wouldn't know what i meant if i left it in numbers . . . the TA seems sort of bitchy, just based on her comments, but none of us know for sure, since she seems to be nonexistent, never comes to class due to a \"scheduling conflict.\" This class makes me want to shoot myself in the head to avoid the horrendous boredom.\nWorkload:\nthere is next to no work. stupid \"translation\" of about twenty lines of middle english each week, two papers, a final, and she uses writing fellows. (grace is awesome!) Timea is not. \n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "December 15, 2001",
            "review_content": "\nTimea rocked my first-semester world. She is smart, honest, compassionate, and funny as hell. At first she seems like a cute little professor with a very sweet accent who waxes nostalgic about her own days as a Barnard student, but pretty soon you'll discover her kick-ass sense of humor. She had my entire seminar rolling practically every class. Once and awhile some overly fatigued student would fall asleep, and Timea would [affectionately] bust her ass while the rest of us giggled. Her grasp of the material is commendable. She will make some of the more boring stuff -- i.e. the Homeric Hymn to Demeter -- tolerable and even interesting. I love this woman! Take her class! I command you!\nWorkload:\nThree papers. Two drafts each. With Writing Fellows. That's it. She is a tough but fair grader and appreciates a little creativity.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "December 15, 2001",
            "review_content": "\nTimea rocked my first-semester world. She is smart, honest, compassionate, and funny as hell. At first she seems like a cute little professor with a very sweet accent who waxes nostalgic about her own days as a Barnard student, but pretty soon you'll discover her kick-ass sense of humor. She had my entire seminar rolling practically every class. Once and awhile some overly fatigued student would fall asleep, and Timea would [affectionately] bust her ass while the rest of us giggled. Her grasp of the material is commendable. She will make some of the more boring stuff -- i.e. the Homeric Hymn to Demeter -- tolerable and even interesting. I love this woman! Take her class! I command you!\nWorkload:\nThree papers. Two drafts each. With Writing Fellows. That's it. She is a tough but fair grader and appreciates a little creativity.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "May 06, 2001",
            "review_content": "\nreally witty and incredibly intelligent. she really knows what she's talking about! she always gets the class to participate, and not forcibly. she's so funny, you come to class just to hear what she's gonna say next.\nWorkload:\nthree papers, 2 versions each...kind of a tough/random grader\n"
        }
    ]
}