{
    "prof_info": [
        {
            "prof_name": "Nihal Isiksel",
            "prof_id": 12286,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 11, 2013",
            "review_content": "\nProfessor Isiksel is a brilliant instructor who really wants to impart her love of the CC curriculum upon her class. I took her class for two semesters during her first year on the Columbia faculty, and her teaching definitely got more organic and discussion-based as the year went along. I thought that this was ideal given the structure of the class, but it was at times tough for her to get people to participate in class. She was forgiving, however, and she would encourage participation by bringing coffee and cookies on occasion, which was definitely appreciated. Her knowledge of the texts was very strong, and her discussion questions, while obvious at times, definitely got the job done.\nTwo words of caution, however:\n1. The distance between an A- and an A is a lot longer than one might expect. This is felt the most in the essays, where perfectly structured essays with a good argument will only get you an A-. To get that A, one must have a nearly-flawless essay.\n2. Her absence policy is very strict, even for a Core seminar. We were allowed one absence before our grade started dropping.\nI would definitely recommend her for students who are looking for a strong focus in political theory and political history in their Core classes and who don't miss class for any reason. At least at the beginning of the year, discussion were fairly dry and uninspiring, but strong classroom participation can easily lift that issue.\nWorkload:\nWeekly readings from the CC syllabus (never the entire book - maximum of 200 pages/week)\nOccasional response papers (participation grade)\n2 analytical essays of 6-8 pages\nMidterm and final with IDs and essays\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 16, 2012",
            "review_content": "\nProfessor Isiksel's CC class felt like she got out of it exactly what she wanted to get out of it. If you are looking for a safe CC experience with fairly even grading policies and nothing extra expected, then this is the class for you.\nAttendance - while she is understanding of religious holidays, Professor Isikel's official policy is that students are allowed one missed class per semester. Attendance is 20% of her grading policy, and she takes it seriously that everyone attend class every day. However, she also brings coffee and cookies at least once a month, and she doesn't seem to care too much about constant participation from everyone, so long as you speak up once or twice a class.\nEssays - the option is on the table to build your own essay topics, but she gives the students 4 or 5 essay topics to choose from. The topics are fairly limited (no more than 2 authors are discussed in a single essay), and textual analysis is absolutely necessary. The tough-but-fair label fits her grading style well - she doesn't hand out A's like candy, but she also isn't trying to fight grade inflation.\nTeaching style - the classes generally had 10-20 minutes of historical and biographical lecture and 90 minutes of discussion of the text following questions she sent out before class. The questions themselves were pretty bland, and any liveliness in the discussion was generally brought about by students' occasional value judgments when they slipped out. However, Professor Isiksel is prone to not make those judgments - while it's fairly clear that she has a preference for the political theory of the Enlightenment, she never said \"this is just wrong\" or \"this is just true.\" This made the class a fairly safe experience - it's not what I was personally looking for in CC, because I think that it discouraged debate among the students about the ideas we were learning about, but I guess someone might enjoy that style.\nI can't say I would recommend this class, but it's definitely not worth immediately dropping - even if class time is, as a general rule, pretty dull, it covers each text very thoroughly and none of the assignments are particularly difficult.\nWorkload:\nAttendance/participation, two 6-8 page essays, a midterm, and a final. The papers and tests are all equally weighted.\n"
        }
    ]
}