{
    "prof_info": [
        {
            "prof_name": "Lynn Catterson",
            "prof_id": 692,
            "total_reviews": 35
        }
    ],
    "reviews": [
        {
            "course_name": "Evaluating the Evidence of Authenticity",
            "review_date": "August 13, 2015",
            "review_content": "\nI would have enrolled in this course even if it weren’t highly recommended by past students because the subject sounded so interesting. In the end, I consider this course to be the most important art history class I have ever taken and am excited to use what I learned in my future studies.\nProfessor Catterson based this summer’s lectures on her recent research in Italy. Though limited to specific areas, rather than examples from all periods in art history as I had imagined, she presented cases from her research in such a manner that, in addition to being incredibly interesting, Professor Catterson’s examples from her research journey helped the class to learn about how to do research on our own.\nIt was so exciting to be able to actually work with pieces of art- we were able to really get to know our items (and touch them!), which made it feel like our studies were actually real and not just theoretical. Our research took us to museum archives and libraries and put us in contact with people in and out of the art industry from all over the world. The course is a practical exercise in art history and many of the students found out new information about our objects that hadn't been documented before\nWe took three trips out of the classroom- to The Frick, Bonhams, and The Morgan. Each visit was incredibly informative and gave us a new perspective on each of the institutions. The access and information gained from these trips is something that I never imagined I would ever be able to experience as a student.\nProfessor Catterson is one of, if not the, best instructors I have had at Columbia and it is lamentable that she does not teach more classes. She is a rare exception in that she really cares about her students- we were her focus for the duration of the course, rather than nuisances. I felt that she truly believed that we were all doing something worthwhile, not just pithy undergraduate work like some professors seem to see it as. \nAny e-mails were promptly responded to (and I’m sure there were a lot); she would give reasonable explanations for her delay if they weren’t. If there was something the students could not get access to, Professor Catterson would use her knowledge and connections to help us get what we needed- truly above and beyond.  She is honest, passionate, and inspiring- I truly can’t say enough about how fortunate I felt to have studied under her. Her outlook on art history in general and her dedication to her students is absolutely refreshing. \nI urge every art history student to try and take a class with Professor Catterson.\nWorkload:\nThe coursework is a lot, especially because it has to be finished in a short summer session. Research will take up a lot of time outside of the classroom. However, Professor Catterson’s enthusiasm transferred to her students and made the assignment exciting for each student. I believe each student in my class was greatly involved in their research and ended up becoming downright passionate about their project (even though we were frequently frustrated and exhausted at the end. It was all worth it). Like I said, be prepared to put in a lot of hours outside of the classroom, but you will want to. Aside from a final paper that will be quite long (20-50 pages) that practically writes itself in the end, we had to do two presentations on our research for a midterm and a final. There are listed readings that aren’t discussed in class and you do not have to do them. However, I found myself taking time off from my research project to read some of the articles because I had become so interested in the topics in class.\n"
        },
        {
            "course_name": "Evaluating the Evidence of Authenticity",
            "review_date": "February 16, 2015",
            "review_content": "\nHonestly, this was probably the most useful, hands-on class I've taken in my four years as an Art History major at Columbia. Not only is Lynn a fantastic professor (engaging, stimulating, thoughtful, and extremely knowledgeable), but the course itself was a critical (and fun!) exploration of questions we don't examine often enough in other Art History classes at Columbia. The authenticity of artworks is something we all too often take for granted in the field, and this class forced me to adjust my eye, so to speak; to look at art afresh by revaluating the primary material itself. We discussed how authenticity is measured and determined, from connoisseurship to provenance research to forensic examinations (a discipline less practical than one might imagine!). \nLynn always used specific – and fascinating – case studies to illustrate these complexities and conundrums. Lots of exciting stuff came up while unpicking these examples, of course – discussion of real-world fakes and copies and how to spot them, even with an untrained eye. Very often the case studies came from Lynn’s own career, which not only meant we were getting all the information first-hand and from the most knowledgeable source possible (and often got to see her as-yet unpublished work too, which was fascinating) but also that we got a glimpse into the field of authentication. (It sounds like an academic treasure hunt: about equal parts sitting in archives sorting through irrelevant and/or tedious material, and discovering wonderful, mind-boggling things that have a real-world impact.)\nThe final project of the class was a 30-40pg research paper (tailored to your specific interests) delving into the provenance of an art object of your choice. I chose to work at the Frick Collection, and a whole world was opened up for me because of it. I learnt the ins and outs of archival work and many valuable skills I will carry with me for use in my professional life. And it was fun! Stumbling across the gems scattered here and there made the hours spent in the Met’s Watson Library and the Frick’s Art Reference Library feel totally worth it. There's also the added bonus of feeling like your paper actually MEANS something: my provenance research discovered things about Frick artworks that the museum itself was not aware of, and in this regard I got to feel like I contributed in a tangible way to a field I'm passionate about (possibly for the first time in my life).\nWe also took some amazing field trips throughout the semester. My favourites were those at the Frick (where we were given a personal tour by some of the curators and got to explore the Collection's private vault) and Bonhams Auction House (where the head authenticator told us about the difficulties and practicalities of authenticating art when massive amounts of money are involved). But overall I think I enjoyed class-time even more: it was hours of listening to a leading authority speak passionately about a really interesting field most people know very little about.\nTL;DR: The class has made me critical, in the healthiest possible way, about things I had taken for granted in the field of Art History. I genuinely believe I now look at artworks with a more critical eye than before, and Lynn is worth having as a teacher if for that skill alone. But also she’s great and the paper is great and you should take the class!\n\nWorkload:\nDepends on how much effort you put in. There were weekly readings that honestly were pretty optional -- we didn't discuss them in class. Most of your time will be spent researching your paper, but, again, the amount of time you put in is really up to you. I did spend two full workdays each week in the Frick researching my paper (+ more time trawling the internet for clues at home), but you could definitely break that into shorter, more manageable intervals of time. As for actually writing the paper -- well, once you've done all that research, the paper pretty much writes itself.\n"
        },
        {
            "course_name": "Evaluating the Evidence of Authenticity",
            "review_date": "August 14, 2013",
            "review_content": "\nProfessor Catterson is an excellent professor. I took her course on Authenticity this summer and she provided her students not only with frameworks for which to view questions of art and authenticity but with cite visits to curatorial departments in excellent museums so that we would understand how the processes of authenticating an art object really works. Professor Catterson is incredibly knowledgable in her field of expertise and she is an engaging, encouraging, and wonderful teacher. \nWorkload:\nFinal research project, in class presentations of research subjects. \n"
        },
        {
            "course_name": "Evaluating the Evidence of Authenticity",
            "review_date": "December 06, 2011",
            "review_content": "\nI waited until graduation (end of Fall 2011) to write this review so I could definitively say that Lynn is my favorite Columbia professor. Her enthusiasm and vibrant teaching style is unmatched. The sole assignment for the course was a research project. I found myself thinking about the research constantly; so invigorating was her teaching about the subject. Just today I thought again about the project and Lynn's teaching, some four months after the end of her course. Do yourself a favor and take anything she offers. \nWorkload:\nWeekly readings (not mandatory). One semester-long research project that will be as rewarding as you make it.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 17, 2010",
            "review_content": "\nProfessor Catterson was the most incredible, passionate and knowledgeable professor that I've had at Columbia.  She enthusiastically imparted her love of art and history to everyone in my Art Hum class.  She was able to engage everyone in the discussion about art and really forced me to think critically about art history.  Our class visit to a museum was one of the most enlightening experiences of my Columbia career.  \nAdditionally, the research project was thought-provoking and challenging, but I really enjoyed it. Professor Catterson was very supportive in finding a topic of interest and guiding my research. I have utilized many of the tools that I learned in Art Hum for subsequent research papers in other courses.  After completing Art Hum with Prof. Catterson, I pursued two semesters of independent research projects with her.  Prof. Catterson constantly inspired and encouraged me to think in a creative way and pursue research in an active way, until I had completed all possible research on a topic.  I would highly recommend Prof. Catterson to anyone who is looking for an engaging experience!\nWorkload:\nOne midterm, one final (which we took at the Met), one research paper.  Totally manageable workload\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 12, 2010",
            "review_content": "\nI have never had a more supportive, enthusiastic and engaged teacher than Professor Catterson. She constantly inspired and encouraged me to think outside the box and pursue topics in an active way, to pursue a topic until my research opportunities were completely exhausted.\nI originally had Professor Catterson for Art Hum, a class I was excited about to begin with. But with her creative insights into the pieces of work and her inside scoops on the lives of the artists, art from as far back as the Parthenon came to life. My paper topic on Bernini proved to be one of the most fascinating research experiences of my life: Through Professor Catterson's constant encouragement, I explored Italian estate records and inventories in the basement of Avery library in order to disprove that the Bernini in the Met wasn't really done by Bernini. \nI then took two semesters of Independent study where Professor Catterson's creativity served as a driving and guiding force behind two equally fascinating research opportunities. But outside the classroom, Professor Catterson makes sure she is a continuing available resource to her students. When I studied abroad, I bothered Professor Catterson for recommendations for different cities I visited; she would reply with encyclopedias of what museums and cheese restaurants to visit at what time with which discounts. I recently visited Italy with my sister, and Professor Catterson dedicated two days of her time to show us around Florence and give us a backstage pass to the great works of art there and the city's culture.\nI HIGHLY recommend taking Professor Catterson, in case you couldn't tell. She's an incredible teacher, has an inspiring mind, and is a great resource and friend for life.\nWorkload:\nReally incredible research paper!\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 10, 2009",
            "review_content": "\nI was pretty hesitant about taking this class but am so glad I had Prof. Catterson. There is a lot of material and artists to cover but each class was interesting and insightful. She's an excellent teacher and very knowledgeable about the field and works covered. The research paper can be difficult if you've never used Avery before but Lynn can help guide you in the right direction and is really helpful during office hours.\nWorkload:\n1 group presentation, midterm - requires a decent amount of memorization, research paper (can be really interesting though!), essay, 2-3 museum visits\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2009",
            "review_content": "\nI wanted to recommend Professor Catterson as a wonderful Professor, particularly for the Art Humanities class that I took with her this year. As an engineering student, I went into the class with pessimism for the field, and especially for the fact that the discipline encourages frivolous spending while so many of the world's poor have to struggle for basic necessities. With that attitude, it would have been easy to find absolutely nothing valuable in art with any other teacher. But Professor Catterson definitely opened my mind to the discipline by not only having an analytical approach towards art that encouraged students in class to look and discuss beyond what is just visible, making the process of viewing art challenging and fun, but also had a balanced viewpoint in which she brought in different perspectives without enforcing any one opinion. The latter is a very unique characteristic in the faculty at the undergraduate level, and one that I truly cherish. By placing each painting in the context of its unique political, religious, and cultural environment, she helped us understand both medieval Gothic art and pop art by Warhol, truly a goal that can take years to fulfill, that she has done in merely 1 semester for most of us. I cannot believe that I could have had a better teacher who became my only guide in my whole life to art (I am an engineer, so I will not be needing any art classes in future), and her influence on me will certainly last my lifetime; I am only glad that this influence was so positive, and that it interested me to pursue different forms of art (particularly modern buildings' architecture and Baroque art and sculpture) in leisure, and appreciate the field of art while respecting artists.\nWorkload:\n1 Group Presentation (involving hands-on research and analysis), 1 Midterm (involving ID's of artwork and analysis), 1 Research Paper (research, research, research, and then analysis - can really take a long time to write, and the Avery Library sucks in that most books can't even be checked out), 1 Take-Home Final (hands-on research and analysis).\nLots of unrequired and not very helpful reading. I recommend Wiki'ing every artwork and author talked about in the class for the midterm. Memorizing dates and current location (not the location where the artwork was manufactured!) is necessary for the midterm. After the midterm, the focus shifts from facts to trends and themes and analysis for the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 06, 2009",
            "review_content": "\nLynn is absolutely incredible. She is extremely knowledgeable as well as passionate about art history, making art hum an amazing experience. She does not focus solely on dates and names but rather ties themes across artists, locations and time periods to allow it all to come together naturally. Lynn is beyond helpful during office hours and goes out of her way to help with paper topics, sources, etc. I would definitely say she is by far one of my favorite professors at Columbia yet. The dinner at her apartment in the Bronx is fantastic.\nWorkload:\nstandard art history midterm, 1 research paper (10-12 pages) and a final essay given at the met. No final!!!!\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 04, 2009",
            "review_content": "\nLynn is, as many have said, awesome (and she knows it, but that shouldn't bother you). She is by far the nicest, most accessible, personable, and understanding professor I have had at this school and a delightful break form the norm in that respect. Although she didn't follow the art hum syllabus to a T, I learned so much that by the end of the class I didn't really care that we didn't make it to Warhol. This was because Lynn teaches you the fundamentals of the abstract discipline of Art History, not 'names, dates, and facts'. You will leave the class able to teach yourself whatever you want to know. Don't skip her class dinner at her awesome Bronx rooftop apartment. It was one of the highlights of my semester and I made a few new friends as a result. Also don't skip the Met visits - they are totally worth it. Lynn is also super nice with the grades and very flexible with assignments.\nWorkload:\nExtremely light. Aside from the group assignments, midterm, final (which is a visit to the met and an essay), and paper, I did no work for the class and came out with an awesome grade.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 11, 2008",
            "review_content": "\nBy far she has been the most amazing professor at Columbia. Her style of teaching is well suited for the material that is presented and her canny ability to engage with the students helped me get through many hours in that dark room. She is always readily available and returns emails fairly promptly. I have learned so much from her class this semester that I am seriously considering taking up a concentration in art history. She is THAT good. The workload is very manageable and the trips to the Met are enjoyable because she makes it interesting and worthwhile. I would recommend ArtHum with her to anyone that is willing to listen. \nWorkload:\ndefinitely manageable\n"
        },
        {
            "course_name": "Lorenzo di Medici - Patronage",
            "review_date": "November 06, 2007",
            "review_content": "\nLynn is 15 kinds of awesome. I'm a complete art history neophyte who stepped into an advanced course, and she bent over backwards to help me through. I really appreciated her great stories about her trips to Italy and anecdotes about Renaissance patrons and painters. I highly recommend signing up for anything she teaches - I know I will!\nWorkload:\n1 research paper (it was a whopper) and a lengthy in-class presentation of findings\n"
        },
        {
            "course_name": "The Medici and their Artists",
            "review_date": "September 04, 2006",
            "review_content": "\nLynn is wonderful.  She's incredibly knowledgeable about Renaissance art, and while it's clearly her passion, she has a down to earth approach to it- she isn't afraid to criticize or joke about it.  She's warm and funny, but don't conclude that you wont need to do any work.   Though she's not a hard grader, definitely get started on the paper early, and be prepared for a lot of research.  Make sure you run your topic by her, as she has a vast knowledge of useful sources and can warn you if you're topic will lead you to a dead end.   This course really emphasized the history aspect of art history,  with a focus on documents that pertain to the political and economic context and the works' authorship or original usage rather than theories on the meaning and achievements of the Renaissance.   We also covered works, like parade ephemera, that are helpful to understanding Renaissance culture but, since now lost, infrequently covered.  A really interesting course, and one from which I've learned approaches to thinking about and researching the Renaissance.  \n"
        },
        {
            "course_name": "The Medici and their Artists",
            "review_date": "September 04, 2006",
            "review_content": "\nLynn is wonderful.  She's incredibly knowledgeable about Renaissance art, and while it's clearly her passion, she has a down to earth approach to it- she isn't afraid to criticize or joke about it.  She's warm and funny, but don't conclude that you wont need to do any work.   Though she's not a hard grader, definitely get started on the paper early, and be prepared for a lot of research.  Make sure you run your topic by her, as she has a vast knowledge of useful sources and can warn you if you're topic will lead you to a dead end.   This course really emphasized the history aspect of art history,  with a focus on documents that pertain to the political and economic context and the works' authorship or original usage rather than theories on the meaning and achievements of the Renaissance.   We also covered works, like parade ephemera, that are helpful to understanding Renaissance culture but, since now lost, infrequently covered.  A really interesting course, and one from which I've learned approaches to thinking about and researching the Renaissance.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 21, 2006",
            "review_content": "\nAbsolutely awesome. Lynn is a great professor and an extremely cool woman. She proved a major work in an Italian museum is a forgery so she obviously knows what she's talking about. She is extremely accomodating and easy going. At first, it feels like you aren't learning much because her teaching style is very relaxed and casual, but after a while I realized I was learning much more than I had thought possible (me being a math-econ major). She is extremely flexible on deadlines and is always willing to meet outside of class to help. Art Hum was by far one of the best experiences I've had at Columbia and it's basically completely because of Lynn.\nWorkload:\nOne short paper, midterm, 10 page reasearch paper. Totally managable.\n"
        },
        {
            "course_name": "Michelangelo and Mannerism",
            "review_date": "April 02, 2006",
            "review_content": "\nA class with Lynn Catterson is one of those experiences that you rave about for your entire Columbia career.  Teaching a class on one of the Italian Renaissance's stars is by no means easy, even for Lynn who, as of late, has become a star herself in the field after some major research regarding Michelangelo's potentially dubious works (who would've thought him a forger?!).  Yet each class is focused, rich with detailed information and examples and provides a clear understanding of several works and/or a time period -- and all of this is presented in an invigorating and exciting manner.  In a wave, Lynn weaves a story that covers the evolution of Italian Renaissance Art, each time adding more characters, more works and more plot lines; you leave the room enlightened by her engaging talks and eager to learn what happens next in Renaissance Tuscany and Rome!   But things don't stop after the 3-hour class (summer session, don't forget!).  Lynn is ALWAYS in her office waiting to speak with students for hours on end, whether regarding their personal research, her opinions on work, or even favorite destinations and restaurants in Italy! She'll come in early and stay late to ensure that every studentÂ’s needs are fully met.  And then thereÂ’s the special treat: Lynn invites you to her home at the beginning of the session for an amazingly fantastic and filling home-cooked dinner.  The dinner creates a wonderful atmosphere between professor and student that lasts the entire semester, and oftentimes, even longer! \nTaking a class with Lynn Catterson is an experience not to be missed as she is truly on of ColumbiaÂ’s finest and talented professors.  You will never regret it.      \nWorkload:\nMedium: a presentation early on and then a final paper (around 15 pages) that is rather demanding!  Don't leave the paper for the last 2 weeks...you'll never be able to get it done that quickly!  There's also some reading, but it's not required. \n"
        },
        {
            "course_name": "Michelangelo and Mannerism",
            "review_date": "September 07, 2005",
            "review_content": "\nProf. Catterson will change your life and the way you look at the world around you.  I first took her class last year and not only have I know become an art history major, I am also planning on applying for the PhD.  She is dynamic, intelligent, caring and generous.  She deserves an A+ as a scholar, a teacher, and a human being!  Hurray for Prof. Catterson!!!!!\n"
        },
        {
            "course_name": "Michelangelo",
            "review_date": "September 01, 2005",
            "review_content": "\nProf. Catterson is an incredibly inspiring instructor - she really encourages students to challenge themselves and is there to guide you every step of the way. After taking her class this summer (be prepared for a whirlwind of before, during and after Michelangelo)I felt like I had taken an important step: learning how to tackle and put together a good research paper. We only had one group presentation, one two-page response, and the 15-20 page paper - no midterm or final. It was very fair, but the paper must reflect a semester's worth of work. Don't wait till the end to start...\n\n"
        },
        {
            "course_name": "Michelangelo: From High Renaissance to Mannerism",
            "review_date": "August 25, 2005",
            "review_content": "\nLynn is an exceptional teacher.  I took this course thinking about becoming an art history major, and now I definitely want to become one.  She is extremely knowledgable, but presents the material in a way that caters to all her students, no matter what year or major.  The class was enjoyable, fun, and definitely the most fulfilling class I have taken at Columbia.  \nWorkload:\nA short 2 page response paper and then a 15-20 page research paper.  No homework, midterm, or final.  At first I was intimidated by the final paper, but i actually enjoyed the research and learning how to gather material to create my own thesis.\n"
        },
        {
            "course_name": "Michelangelo: From High Renaissance to Mannerism",
            "review_date": "August 25, 2005",
            "review_content": "\nLynn is an exceptional teacher.  I took this course thinking about becoming an art history major, and now I definitely want to become one.  She is extremely knowledgable, but presents the material in a way that caters to all her students, no matter what year or major.  The class was enjoyable, fun, and definitely the most fulfilling class I have taken at Columbia.  \nWorkload:\nA short 2 page response paper and then a 15-20 page research paper.  No homework, midterm, or final.  At first I was intimidated by the final paper, but i actually enjoyed the research and learning how to gather material to create my own thesis.\n"
        },
        {
            "course_name": "Michelangelo: From High Renaissance to Mannerism",
            "review_date": "August 24, 2005",
            "review_content": "\nProfessor Catterson is incredibly caring and thoughtful about the needs of her students. It genuinely matters to her that you both enjoy and benefit from her class. She lends students books from her personal library, as well as emails helpful links to assist in researching tasks. \nWhen looking at powerpoint slides, she is very open-minded to varied intrepretations on the artwork. The highlight of this class is hearing Catteson's lecture on the relationship between the Lacoon Group and Michelangelo...good stuff! You won't be disappointed.\nWorkload:\ngroup presentation;  reaction paper;  15-20 pages research paper.\n"
        },
        {
            "course_name": "Michelangelo: From High Renaissance to Mannerism",
            "review_date": "August 24, 2005",
            "review_content": "\nProfessor Catterson is incredibly caring and thoughtful about the needs of her students. It genuinely matters to her that you both enjoy and benefit from her class. She lends students books from her personal library, as well as emails helpful links to assist in researching tasks. \nWhen looking at powerpoint slides, she is very open-minded to varied intrepretations on the artwork. The highlight of this class is hearing Catteson's lecture on the relationship between the Lacoon Group and Michelangelo...good stuff! You won't be disappointed.\nWorkload:\ngroup presentation;  reaction paper;  15-20 pages research paper.\n"
        },
        {
            "course_name": "Michelangelo",
            "review_date": "August 24, 2005",
            "review_content": "\nSecond Summer Session of 05. This is a great class to take. There is a lot to learn regarding Italian history and the periods of the Renaissance, and it is all interesting and fun. Lynn has been everywhere, it seems, in Italy and there is a PPt. full of pictures for each museum and location. Lynn shared a great deal with the class about her exploits and about the star of the course, Michelangelo.\nWorkload:\nFair. The final paper seems daunting at first, but little by little and a lot of time in Avery Library, the paper became manageable.\n"
        },
        {
            "course_name": "Michelangelo and Mannerism",
            "review_date": "August 24, 2005",
            "review_content": "\nProfessor Catterson offers that rare combination of qualities that every student dreams of finding in an instructor. She is a brillant scholar engaged in an exciting new theory about the work of Michelangelo.  She is a captivating lecturer able to sustain the attention of a large class during the long three hour summer sessions.  Most importantly, though, she loves to \"teach.\"  She lavishes attention on each student individually during her very generous office hours.  Not only does she encourage and welcome students to visit her repeatedly for personal guidance on their research projects but she even offers students continual access to her through her cell phone. Professor Catterson demands high standards of her class, but with her great attention to the student, her demands are not unrealistic.  She is an exceptional member of the faculty and I give her the very highest recommendation.\n"
        },
        {
            "course_name": "Michelangelo",
            "review_date": "August 24, 2005",
            "review_content": "\nLynn is one of the best teachers I have ever had.  She is articulate, fun and interesting and she makes the material so accesible.  I really loved this class.  The work load is light.  Only suggested reading, a class presentation and one research paper for the final.  She is flexible and helpful.  What an amazing way to spend a summer.  Lynn is amazing!!\nWorkload:\nLight\n"
        },
        {
            "course_name": "Michelangelo",
            "review_date": "October 18, 2004",
            "review_content": "\nEverything said about Lynn is not enough to describe her.  She is brilliant, caring, flexible & simply the best!\nWorkload:\nPresentation & research paper.\n"
        },
        {
            "course_name": "Michelangelo",
            "review_date": "September 05, 2004",
            "review_content": "\nLynn is an amazing teacher!  Everything good that is written about her on culpa is true.  I took my first art history course with Lynn this past summer and loved it.  She always keeps class interesting and fun, which isnt easy to do when you are sitting in a cramped desk for 3 hours.  She is extremely approachable and loves getting her students involved.  I am even going to take another art history class with her this summer!  \nWorkload:\nnot bad at all, a group presentation and a final paper (10-20 pages).\n"
        },
        {
            "course_name": "Michelangelo, DaVinci, Raphael",
            "review_date": "August 24, 2003",
            "review_content": "\nTHE BEST!!!! She is an intellectual dynamo. You cannot help but be carried along and inspired by her enthusiasm. She is the reason I am going to Florence at Christmas. Professors/instructors in other areas should watch and learn from her.\nWorkload:\nComfortable\n"
        },
        {
            "course_name": "Michelangelo and Mannerism",
            "review_date": "August 14, 2003",
            "review_content": "\nLynn really is a great teacher.  This was my first art history class and I had no idea what to expect, but she makes it very easy to understand and has a very laid-back, engaging attitude when teaching the class.  The majority of our class time  was spent looking at slides, but she was able to make it easy to follow and fascinating for us.  There were no tests or quizzes, just a half hour group presentation on articles that she handed out to us, and a 8-10 page final paper due on the last day of class.  But one thing that I really thought was great was the fact that she didn't care whether you gave the final paper in after class  was over, or even a few days late, just as long as you put as much effort as you could to write the best paper possible.  It was also lots of fun when she invited us to her apartment for a dinner party the last week of class.  I certainly learned a lot about art in this class which I will for sure use in the future.\nWorkload:\nvery light. only suggested reading, one 1/2 hour group presentation on an article, and one final 8-10 page paper. \n"
        },
        {
            "course_name": "Michelangelo, DaVinci, Raphael",
            "review_date": "December 08, 2002",
            "review_content": "\nThis class was wonderful. If all classes were like this one, I would be a professional student. Professor Catterson is an exceptional teacher and has reinforced my decision to be an art history major. Yes, she has a profound knowledge of art history, and yes, her enthusiasm is contagious (as well as her work ethic). Her lectures are thought provoking and anything but limited by textbook material, and her style is casual but professional. In this class, her energy was so contagious- each class was lively and full of discussion. Restoration discussions were particularly fascinating. If you want to sharpen your research skills, and have fun doing it, take a class with Professor Catterson. She will plant the seed of curiosity in your mind, plus, when you run down to Avery to begin the research that you are so deeply inspired to begin (like I did), she will not abandon you and, in fact, will continue to Â‘intuitivelyÂ’ point you in the right direction. Be prepared when you go to her with questionsÂ…She will throw information at you quicker than you can write it down. \nWorkload:\nOne presentation, one paper. Although she enourages alot of research, the workload really is what you make of it. \n"
        },
        {
            "course_name": "Michelangelo, DaVinci, Raphael",
            "review_date": "November 04, 2002",
            "review_content": "\n this is the second summer that i have taken a class with professor catterson, and once again i have been amazed. i am honestly taking a lighter load in the spring, just to take another class with her before i graduate. it may sound as though my enthusiasm borders on fanatical, but at this point catterson has developed an undergraduate cult following. given that she is only a summer session professor (does the department read the course evaluations? ), some of us have pushed to do independent projects with her over the year. aside from being absurdly knowledgeable about renaissance art, catterson is a great professor. she is incredibly inspiring (all non-art history majors tend to convert after taking her class, myself included). i could go on forever, but i urge all students reading this to take any class she offers. it is so worth it! \nWorkload:\na presentation and paper--totally not a big deal, though i warn you her work ethic is contagious.\n"
        },
        {
            "course_name": "Italian 16th Century Painting and Sculpture",
            "review_date": "September 03, 2002",
            "review_content": "\nProf. Catterson is a GREAT teacher. She possesses an impressive depth of knowledge in art history and teaches with total enthusiasm. She went out of her way to teach us how to do research in art history for our papers by taking us on a tour of Avery Library and the Slide Library. I enjoyed her class so much that I was sorry when it was over.\nWorkload:\nVery reasonable. One presentation and one 10-page paper. \n"
        },
        {
            "course_name": "Michelangelo",
            "review_date": "October 22, 2001",
            "review_content": "\nI thought \"Michelangelo\" would be boring boring boring. I didn't think anything good could come out of a class about an artist so famous you can buy paperweights of David's nose. I was wrong! Catterson is so energetic and animated that she just sweeps you along. On top of it, she manages to give the subject a spin, talking about restoration projects, changes in the scholarship, the making and breaking of reputations around Michelangelo, that make the class as much about the politics of Michelangelo and of Art History as anything else. I was 100% interested.\nWorkload:\nHeavy but satisfying. 1 Presentation and 1 Paper; the presentation required many hours of toil in Avery.\n"
        },
        {
            "course_name": "Michelangelo: From Finito to Non-finito",
            "review_date": "September 04, 2001",
            "review_content": "\nThis was the best class I have taken at Columbia. Catterson was incredibly enthusiastic about the material and presented it in a very clear manner. She was extremely knowledgeable about Michelangelo and the Italian Renaissance. Catterson was also a lot of fun (she may even introduce you to Banana) and has some great stories about her adventures in Florence. The material was fascinating, particularly her discussions on restoration. I never thought I would say this but the semester was just too short. For the amount of information Catterson is walking around with a Summer Session wasn't appropriate. I also felt rushed outside of class. Our final paper and presentations required a lot of research. I would recommend this class to all art history majors and anyone else looking to become a Michelangelo expert.\nWorkload:\nOne group presentation and final paper. Weekly reading. The workload is up to you but attendance is important. You will not be asked to regurgitate information from class, instead you will be expected to do research on your own. If that sounds intimidating go speak to Catterson, it is hard to get her to stop helping you. She was willing to lend slides and books, find resources on the web, take students to Avery, find contacts in Italy,etc.\n"
        },
        {
            "course_name": "Michelangelo: From Finito to Non-finito",
            "review_date": "September 04, 2001",
            "review_content": "\nThis was the best class I have taken at Columbia. Catterson was incredibly enthusiastic about the material and presented it in a very clear manner. She was extremely knowledgeable about Michelangelo and the Italian Renaissance. Catterson was also a lot of fun (she may even introduce you to Banana) and has some great stories about her adventures in Florence. The material was fascinating, particularly her discussions on restoration. I never thought I would say this but the semester was just too short. For the amount of information Catterson is walking around with a Summer Session wasn't appropriate. I also felt rushed outside of class. Our final paper and presentations required a lot of research. I would recommend this class to all art history majors and anyone else looking to become a Michelangelo expert.\nWorkload:\nOne group presentation and final paper. Weekly reading. The workload is up to you but attendance is important. You will not be asked to regurgitate information from class, instead you will be expected to do research on your own. If that sounds intimidating go speak to Catterson, it is hard to get her to stop helping you. She was willing to lend slides and books, find resources on the web, take students to Avery, find contacts in Italy,etc.\n"
        }
    ]
}