{
    "prof_info": [
        {
            "prof_name": "Amy Powell",
            "prof_id": 2501,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 22, 2006",
            "review_content": "\nProfessor Powell is the bomb! Agreeing with the previous poster, she is one of the smartest and best teachers I have ever had at Columbia or anywhere else.  She absolutely knows her stuff, but is very open to others' opinions.  You're never afraid to share your interpretation of a piece of art in her class.  I went into this class dreading it and came out wishing it was 2 semester long because there are so many artists I would have loved her to share with us.  Definitely try to take a class with her.  You won't be sorry.\nWorkload:\nVery reasonable and interesting.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 07, 2006",
            "review_content": "\nAwesome! Amy is just as great as the previous reviews have said she is. Discussions were amazing: she knows how to guide the discussion in a certain direction while still leaving room for people's individual opinions. We discussed really interesting aspects of the works, not just the typical stuff. \nAt first I was intimidated by the prospect of readings and short responses (half a page) for each class -- and this definitely isnt one of those joke classes. But the readings were mostly interesting and the response papers were painless. The paper topics were interesting and totally doable. The midterm and final were not scary at all - you only need to know the century (not year) for the slide IDs, and the essays are actually fun to write! \nTake this class -- you will come away with a great appreciation for and understanding of art.\nWorkload:\nreadings and half-page responses for every class (totally doable), two 4-5 pg papers (each requires a trip to the museum), midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 10, 2005",
            "review_content": "\nI am writing the review now, before finals, so that\nmy grade does not affect my feelings towards Amy.\nShe is the best teacher I have EVER had. In college,\nhigh school, middle school, my house. She is absolutely phenomenal. Take any class you can with her. For Art Hum, email her and ask her which section she is teaching. It is worth it. Give this lady a gold star.\nWorkload:\nArt Hum-esque. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 10, 2005",
            "review_content": "\nAmy is great!! By far the best core instructor I've had.  She's knowledgeable and articulate, and incredibly approachable.  I know it sounds cheesy but she really is sooooo nice.  She respects everyone's opinion and can often transform mundane comments into enlightening ideas.  As the previous reviewer pointed out, the comparative slides that she showed really successfully shed light on the major artists on the syllabus while also whetting our interest in art history in general.  A very pleasant experience.   \nWorkload:\nYou will have to earn your A's, but it's not impossible.  Amy is one of the fairest instructors I've ever had.  3 flexible papers--be sure to get her input in advance, you'll really learn a lot; moderate amount of readings--some can be dense, but you won't be expected to understand every concept, just give it a good effort; straightforward exams--she won't make you memorize 500 IDs like some sessions do, and you only have to know what century each artwork was from!  how generous is that!\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 25, 2005",
            "review_content": "\nAmy Powell is an amazing professor.  Unlike many professors at Columbia, Amy is really good at facilitating discussion and keeping things moving, while always respecting diverse opinions.  I felt her strongest point was keeping the dialogue going-I never fell asleep in her class (and I expected art hum to be pretty boring) because I was always engaged in the class discussion...But not because I was one of three talking.  She really does a good job of getting a lot of different people to talk, while adding her own intelligent input.   She also brings a lot outside of the curriculum to the course, not in a distracting way, but in a way that enhances the major artworks examined.  She'll bring in images that give insight into the works we are studying--for example, comparing Pollock's Autumn Rhthym with Warhol's oxidized bronze piss painting.  Her insights are always interesting and eloquently stated.  \nWorkload:\nShe gives a perfect balance of work that is challenging but also possible to actually complete! The workload is not too much, but not nothing at all, so it keeps you involved in the class.  Expect 3 short papers and a very straightforward midterm...haven't taken the final yet, but I expect it will be the same.\n"
        }
    ]
}