{
    "prof_info": [
        {
            "prof_name": "Kate McQuiston",
            "prof_id": 679,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 23, 2002",
            "review_content": "\nI usually try to start off reviews by saying something nice, but the only thing that I can think of in this case is that this class is pretty adequate. I left feeling dissapointed, not because of Kate, who is genuinely enthuistiac about the subject, but because you are not really expected to learn anything about music. This is a cocktail course, so just bunker down and start memorizing the first 15 seconds of the classics and some dates to go along with them. And try not to think about why this class is required or why it needs to be 110 minutes long, you'll stay saner that way.  \nWorkload:\nOne concert review, 2 quizzes, a midterm and a final. No sweat really. Just memorize those dates!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 13, 2001",
            "review_content": "\nKate was a good teacher, and maybe she has matured (I took her class spring 2001), or maybe she just read her own culpa course review! At any rate, she was very energetic in class, fun (and funny) in her lectures and classroom activities and quite understanding of the less musically oriented students. The text hardly mattered, and the major downside was when Kate was occasionally busy/sick and the rather tedious TA taught instead. The tests were based almost entirely on class lecture and listening, and if you took halfway decent notes, and could identify the music, you'd do fine. I came away from the class feeling very nicely (not overly or bitterly) informed about the history of western music. I'd definately recommend her!\nWorkload:\nNot too strenuous: a few pop quizzes that she gives in and warns you about ahead of time, two concert reports, midterm, final. fair grading on tests, rather generous on papers. Not hard to get a good grade!\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 08, 2001",
            "review_content": "\nKate must have matured as a teacher since the other evaluations because I find her fantastic. She is lively and interesting (though a 2 hour class 2x a week for 3 credits gyps us). The text she uses is worthless and hard to find but that is the only fault I have with her. If you attend class and memorize the beginnings of the pieces you listen to, you'll do fine. I don't expect that my grade will significantly drop insofar that she has a specific grade distribution and her exams are graded out of a set number of points. I definitely recommend her.\nWorkload:\n2 concert reports, a couple quizzes, midterm, and final... quid pro qu\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 13, 2001",
            "review_content": "\nI expected an A and she gave me a B. The class was really boring and I (who knew nothing about music before taking the class) still know nothing about music. Her method of teaching runs against the learning process and there's no way to know how you're really doing. Nonetheless, she's a nice woman and she'll help you out if you go to her. It's no worse than the average music hum section, but there's nothing noteworthy about it.\nWorkload:\nTwo concert reports, occasional quizzes, midterm and final. Watch out, though; on the mulitiple choice, when you get a question wrong, you don't get credit for the answer and then she takes off additional points for the wrong answer. Weird.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 06, 2001",
            "review_content": "\nIt sucks that they don't post music hum teachers until after early registration, because staying clear of McQuiston is a great idea. She's young and seems cool, but she's just as much out to screw students as the next guy. The class is really boring and she doesn't make either musicians or non-musicians appreciate western art music. And even though she's a grad student, her T.A. teaches a lot of the classes.\nWorkload:\nVery light, but she gives everyone lower than what grade inflation dictates that they deserve.\n"
        }
    ]
}