{
    "prof_info": [
        {
            "prof_name": "William Harris",
            "prof_id": 96,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "ROMANS/EMPIRE 754 BC TO 565 AD",
            "review_date": "May 21, 2015",
            "review_content": "\nDoing well in this class has nothing to do with going to the lectures. I went to one lecture, saw how absurdly boring it was, and never went back. I got an A. How? Well, the exams are essays, for which he gives the prompts well in advance (a FREAKING MONTH in advance in the case of the final). So, you just take the textbook, pick a prompt, and just write an outline of the essay you're going to write based straight off of the textbook. Oh yeah, the people who grade the test will pretty much ace you if you stick some information about primary source authors in there, so memorize that stuff as well. \nI'd say I put a good 3 - 4 hours of work (2 hours before each exam) into this class. Oh yeah, the discussion sessions are required. They're weekly, and aren't so much discussion. They're 50 minutes long, and half of it is the TA presenting a powerpoint to teach us what Harris was supposed to but didn't. The rest is meak discussion which no one was interested in, not really even the TA.\nTake this class if you have to for your major/minor. Not otherwise. You get nothing out of it but 3 credits and probably an A if you know how to troll the exams. \nWorkload:\nMidterm, Final\n2 discussion session essays (not hard, just analyzing some primary sources)\nA quiz in February (10 questions, answer 5 of them). Really simple if you study his powerpoints before hand. \n"
        },
        {
            "course_name": "Roman History",
            "review_date": "May 15, 2015",
            "review_content": "\nHere's the deal: this is not, in any way, an introductory course to Roman history. In that context this is a horrible, awful course. But if you already know Roman history this class would probably be enjoyable.\nProf. Harris: as a person, good. As a professor: atrocious. I do not say this because he rambles, and drones on endlessly. That could be acceptable in some cases. But he conveys absolutely no useful information in his lectures. His lectures are and hour and a half of him nitpicking whether this publisher of Roman history or that publisher of Roman history meets his expectations, and whether this writer or that was as exacting as they should have been. Newsflash: I DON'T CARE. I came here for a Roman history course, not to hear someone's very personal opinions on the state of Roman historiography in contemporary times. It was wildly inappropriate. And in the end the class was a complete waste of time. Every single person I spoke with hated it, even alumni, but the history department is obviously not going to do anything about it. They're idiots. \nProfessor Harris is funny and likable. But this course serves no purpose. Half the class stopped showing up a week or two in and just watched Roman documentaries because even the books weren't very good. But again, to be sure: you will get nothing from Harris' lectures. Nothing.\nWorkload:\nManageable but of no use and not at all informative.\n"
        },
        {
            "course_name": "Roman Imperialism",
            "review_date": "April 14, 2014",
            "review_content": "\nOk so there's definitely validity to what the previous reviewers have been saying: he rambles and it's very hard to pay attention. \nThat being said, he does have a pompous British humor that, when used appropriately, was entertaining. But really, the guy is so sweet. I chatted with him at office hours once and he's really friendly and understanding. \nBut most importantly the class isn't that hard. The quizzes are pretty straightforward if you've been to class or at least looked up the people/places on his slides. But yes, it is difficult to condense what could theoretically be an essay into a short paragraph. The midterm and final are research based and if you put effort into preparing for it you'll do well. \nOnly the primary sources are actually necessary to read. He even told us before the final which secondary sources would be on the exam. \nSo overall I think people have exaggerated. Yes, he's not a great lecturer by any stretch of the imagination but if you're interested in the material take the class. \nWorkload:\nTwo quizzes: first one was straight short answer factual questions and the second one was more of a series of mini essays\nMidterm: he gives you three questions ahead of time and you choose one to research and answer on the test. One short question on the reading. If you put in the effort its fine\nFinal: same as midterm, but answer two essays and then a short question on readings.\n"
        },
        {
            "course_name": "Roman Social History",
            "review_date": "December 22, 2012",
            "review_content": "\nHow I wish I had skipped this class. I love Roman History and this class sounded like a dream come true. \na) Professor Harris might just be the smartest person alive when it comes to Roman History. The problem is that his lecturing style is boring. His presentations are circular and you can expect to take side trips into other things that you are never sure of how important it is.\nb) He sent his lecture notes when our class was unable to meet. They were unreal. If his lectures would somehow transfer that information to you - it would all be worth it. Unfortunately, it does not. You sit in lecture waiting to die - or for the class to end - with either being joyfully release from the torture..\nc) His tests are interesting. He gives you the question two weeks in advance and ample time to come up with answers. The trick is that some questions can't be answered as offered - and if you attempt to answer them without the answer being about the problematic parts of the question - expect a poor grade. \nd) Term Paper is painful. The assigned topics were vague in many respects and expect to spend plenty of time trying to narrow down what the topic really is and finding the information to make it work.\ne) Kills trees. Expect to end up with at least 20 handouts for bibliographies that he hands out to give you additional information on a given topic. I counted up the books/articles in these - over 300... Crazy... I don't understand why these could not be posted on Courseworks - instead of handing them out. \n\nWorkload:\na) Boring... You want to pay attention - but you can't. The room is terrible. The acoustics are terrible. The lectures are terrible.\nb) Midterm - 2 questions.\nc) Paper - 6 pages.\nd) Final - 2 questions....\n"
        },
        {
            "course_name": "The Romans and their Empire, 754 BC to 565 AD",
            "review_date": "April 24, 2012",
            "review_content": "\nBasically everything that the previous reviews have said is accurate (just take the average of them all or something). The points I want to emphasize are these: \nHe's smart. He definitely knows his stuff.\nHe rambles a lot. Not necessarily that he gets off topic, but his speech is very very circular and he skips back and forth between points of the lecture. But yeah, not the good kind of rambling that's interesting; the kind that's confusing.\nHe's generous. Taking this class P/D/F as a junior and it's pretty easy; he gives us the questions to most everything ahead of time and is pretty clear about what he's looking for.\nHe's boring. Sorry, it's mean, but I have to caution that this class is difficult for me to attend (or at least, attend consciously). I NEVER fall asleep in my classes, but Harris with his lullaby British accent, circuitous lectures, and charming old demeanor (and the stuffy, hot room in Hamilton) brings me VERY close. I'd rather just not attend than go and fall asleep, which I know is bad on my part, but I'm just sayin' that I can go in there wired on coffee and be straight up down for the count and knocked out 30 minutes in. \n\nWorkload:\n.... lots of reading... but I haven't done most of it so I'm not one to consult.... just read the other reviews for this, I'm sure they have it right.\n"
        },
        {
            "course_name": "Roman History",
            "review_date": "May 12, 2007",
            "review_content": "\nOK, so people have been pretty nasty about Prof Harris. Although he does exude a certain English pomp, he is quite endearing and personable at the same time. If you appreciate dry English humor, he's great-my friend and I were constantly giggling at his snarky comments on other historians, ancient Romans, etc. He is clearly extremely knowledgeable and is respected in his field, but doesn't generally advertise his work unless its an area he is particularly knowledgeable about. It does seem as though he's always contradicting the readings, of which there are many, but he makes it clear that he is stating an opinion which cannot be proven one way or the other. He takes an active part in the class, attends sections, grades tests, and while he kind of ignores questions during lecture, is very open to talking afterward, by e-mail, or in office hours. I wouldn't say I'm an expert now, but I learned quite a bit about Roman history. He and my TA, James Tan (who had encyclopedic knowledge on most subjects), were very resourceful and it was a fairly pleasant experience. One caveat: Beware the history tools, for there are many--and I'm a history major so I can say that. And you will be jealous of the elderly GS couples who sit in class just listening to Harris as you try to keep up with his kind of hoppy lectures. \nWorkload:\nReadings of about 100 pgs a week which can be really interesting or really boring.\nMidterm and final-kind of confusing to explain but basically you had to prepare 2 well researched essays for the midterm to be able to answer one on the test, same format for final only you had to prepare 3. \nWorked fairly hard and got what I thought were low grades but was pleasantly surprised with my high grade at the end. \n"
        },
        {
            "course_name": "Roman History",
            "review_date": "May 07, 2007",
            "review_content": "\nOne of the things that made this course enjoyable was that the professor genuinely cares about the material. He has made some brilliant contributions to the field. His lectures can be dry, boring and he does cover the material very quickly, making it difficult to get down every word, but if you're interested in history, it's not a course to miss. I would definitely take another course with Professor Harris, but I understand why other reviewers don't like his style. \nWorkload:\nTwo simple quizzes, factually based. Midterm and final, essay questions. Reading material is on the lighter side of moderate, not 100% necessary to do all the time.\n"
        },
        {
            "course_name": "Roman Imperialism",
            "review_date": "January 12, 2007",
            "review_content": "\nProfessor Harris's class on Roman Imperialism was fantastic. Unlike the previous reviewer, I truly enjoyed Professor Harris and his lectures. Professor Harris is always open to meeting with students and sat down with me for half and hour just to talk politics after we were done discussing his class. If you are indeed interested in the subject matter as I was, you will find this class extremely interesting. His lectures are well prepared and he hands out a list of important names, dates and a lecture outline at the beginning of each class. His lectures are informative and he is funny at times. Overall, this class was wonderful and fair.Do the readings and prepare for the exams!\nWorkload:\n2 quizzes, midterm, final\nThe workload is very fair especially with the absence of a term paper. The 2 quizzes are moderate in difficulty, but don't hold too much water in your overall grade. If you do the reading on time, as I did, you will do decently on the quizzes. The midterm and final questions are handed out weeks before the date of the test. It is clear that Professor Harris wants his students to truly prepare for the exams and even look in a few books that were not required for the class to get their opinions. If you have done your readings and taken good notes, it is easy to make a strong outline for the exams and do very well on them. Go to class, do the readings and prepare for those tests - you should have your A.\n"
        },
        {
            "course_name": "Roman Imperialism",
            "review_date": "January 09, 2007",
            "review_content": "\nAvoid William Harris outside of seminar style classes at all costs! You would do just as well to go purchase his famed book from the 80's and the primary sources and study it on your own. His lectures invariably devolve into rabbit trails and his own musings on the Bush administration. If you should ever take this class, you'll realize notes are impossible and futile to even attempt. Perhaps even more surprising is the subjective grading system that involved being downgraded if you disagreed with him but still supported your opinion with outside sources. Save yourself an upper level history course and skip straight into seminars with other ancient history professors (McDonnell or Billows). \nWorkload:\nAbsurd in its reduction: two quizzes, a midterm , and a final. That's right, no paper whatsoever (Don't think this means you're off the hook though!). The first quiz asked one to boil down people,places or concepts (Polybius, Pydna, etc) into fifteen words or less! The second quiz was a shock as Harris searched his British roots to hand out a quiz more pertinent to the statistician than the historian (How many legions did Augustus have in the army? What was the date of so and so battle?). Finally, as was said before, the grading for the midterm and final were entirely subjective; the final was particularly silly as Harris wanted the students to prepare three questions to the level of a paper and memorize them for the final. Instead of giving such a mnenomic nightmare why not actually have...Gasp...papers! \n"
        },
        {
            "course_name": "Roman Imperialism",
            "review_date": "December 16, 2006",
            "review_content": "\nHands down the worst professor and the worst lecture course I've ever had in all four years at Columbia. He has in my opinion no interest in teaching and put no dedication or effort whatsoever to his class. His lectures are best described as \"stream of consciousness\" with absolutely no coherence, organization, or relevance whatsoever. His overwhelmingly arrogant and self-righteous tone makes you afraid to disagree with him, lest he might perhaps mark your grade down.\nWorkload:\nAtrocious. Simply atrocious. Not to say it was difficult - it wasn't. This man has no idea how to assess your understanding. 2 short quizzes (short answers and multiple choice), a midterm (he gives you questions ahead of time, pick 2/3 to prepare, answer 1) and a final (again, questions ahead of pick, pick 3/4 prepare, answer 2). That's it. No term paper. Nothing. He obviously doesn't want to put effort into even creating an exam, and just gives you whatever grade he feels like after skimming the short paper you wrote in 2 hours.\n"
        },
        {
            "course_name": "Family & Sexuality in Greece & Rome",
            "review_date": "April 15, 2005",
            "review_content": "\nWho are you people calling him arrogant, pompous, and only concerned with himself?  It's unlikely you went to class much and quite clear you never went to office hours.  Professor Harris may seem aloof just because he is so well-read and the upper-class English accent doesn't help.  I have, however, found him to be one of the most approachable professors I've had at Columbia.  He's always willing to make time in his busy schedule to meet with you, and when you do meet, he doesn't try to rush you out like some professors.  He'll talk with you as long as you want.  He is funny and personable, helpful, always available via email, and caring.  He even helped me with a paper for another class!\nWorkload:\n1 in-class presentation, 1 term paper... very manageable, and very interesting material!\n"
        },
        {
            "course_name": "Roman Social History",
            "review_date": "January 03, 2005",
            "review_content": "\nI take issue with the reviewers who described listening to lectures as pointless.  Personally, I regretted the times I missed class, since it meant missing Harris' very effective presentation.  The problem is that this class is not about a narrative: he's trying to paint a picture of Roman society, rather than tell its story.  The lectures did jump around, and it was often difficult to predict which ideas would be lightly touched on and which delved into.  However, everything he said was valuable for the class.  As one reviewer noted , the subject is highly debated, and Harris does an excellent job of moderating the debate (even if he does push his own opinions, but what professor doesn't?).\nI didn't have much background in Roman History, and I could follow well enough; much of the material occurs outside of what you'd hear in a survey.  If something interests you, ask Harris about it after class, as long as you don't have anyplace to be.  It's like opening a flood gate, except good.\n"
        },
        {
            "course_name": "Roman Social History",
            "review_date": "December 28, 2004",
            "review_content": "\nI thought this class was interesting when Prof. Harris stayed on topic (he does tend to go off on rather long tangents some of the time). Harris has a very dry sense of humor which is really entertaining especially when he is griping about the people in the classics department. The Term paper was fairly graded (be sure to meet with him about your topic though) and you have a lot of choice as to which questions to answer on the final. One caveat: in my opinion he favors girls  Sorry boys, don't expect any special treatment from this prof.!\n\nWorkload:\n1 10-15 pg Term paper on the topic of your choice and a final. The readings are really long and tedious... but you really don't have to do all of them to get a decent grade.\n"
        },
        {
            "course_name": "Roman Social History",
            "review_date": "December 05, 2004",
            "review_content": "\nHarris is very entertaining & overall fun.  However, he is somewhat of an eratic lecturer & if you don't have any previous exposure to Roman history, he may be hard to follow.  The topic is very interesting, but by its very nature, very open to debate.  I think this course would do better as a seminar insted of a lecturer.\nWorkload:\n1 research paper, 1 exam.\n"
        },
        {
            "course_name": "Roman History",
            "review_date": "April 13, 2004",
            "review_content": "\nProfessor Harris happens to be one of the best lecturers I've had at Columbia.   His criticism of anything is always valid and responsible, and on the rare occasion he may be off base about something, he admits it and takes full responsibility.  How refreshing!  He cares deeply for his students, and can be very compassionate and understanding when they have problems in their personal lives.  As another student noted, his wit is wasted on those that just \"dont get it.\"\nWorkload:\nMidterm, Paper, and Final (Final being surprisingly tougher than midterm)\n"
        },
        {
            "course_name": "Roman Empire",
            "review_date": "April 08, 2004",
            "review_content": "\nHarris is fantastic! A jewel in Columbia's crown. Yes, you may not like his class, but not because of him, but because of the two of you -- if he 'aint your style (which you'll be able to tell if you show up for the first session and 'shop'). The fact is, Roman history is not at all static and received. It is highly debated and fluid, and it is truly a gift to be in such knowledgeable and even hands as Harris'. Be prepared for 80% of the class to be totally oblivious to his incredible wit that only a Brit could summon -- if you're in on it, though, it will be completely hilarious. A true master of the subject. Go to his office hours. Take notes. Don't skip class.\nWorkload:\nreadings: fair, mid-term: fair, final: fair, paper: fair\n"
        },
        {
            "course_name": "The Romans and their Empire, 754 BC to 565 AD",
            "review_date": "August 24, 2003",
            "review_content": "\nI found the course most informative. Prof Harris could become even more effective a teacher by modifying his style of presentation a bit. That is to say he constantly looks down at his notes and it becomes a distraction as he loses his place and students lose the thread of his thoughts. Howevever, I beleive he could simply utilize a topic word on his note page to key his thoughts and thereby speak more extemporaneously and effectively to the class. He has great knowledge and a good sense of humor which he directs at students or the subject matter while maintaining his dignity. He makes every effort to be sure the class understands the points he is trying to make yet I think he could expend more effort in presenting overviews of topics. That is to say facts are presented clearly but are there subtle cultural implications we are missing. Are there parallels to current times? I am still unclear as to the standards of living for average Roman peoples in terms that we can compare to our own citizenry.\nWorkload:\nThs is fair, a lot of reading but well chosen\n"
        },
        {
            "course_name": "The Romans and their Empire, 754 BC to 565 AD",
            "review_date": "April 28, 2003",
            "review_content": "\nThis was the worst class I have ever taken--- at Columbia or elsewhere. Professor Harris is an arrogent, pompous Brit who definitely knows his stuff but ALWAYS fails to interestingly OR coherently present it. What's more, the man starts lecture early and routinely ends his rambling five or more minutes late. Don't even consider taking this class... in fact, run far away from it.\nWorkload:\nBullshit Quiz, Midterm, Final, 1500 word paper and useless reading (because he constantly tells how wrong the authors of the books he assigns are).\n"
        },
        {
            "course_name": "Roman History",
            "review_date": "April 23, 2003",
            "review_content": "\nProfessor Harris is a world-reknowned expert historian on ancient history.  It is true that he is not the most organized lecturer and that he tends to ramble and skip from topic to topic: but it's also important to understand that he doesn't treat this class like a high school class, going completely by dates, but instead focuses on broad themes for the lectures.  I personally was scared by the past negative ranting reviews.  But I enjoyed this class - I was impressed by his knowledge and authority on Roman History.  Harris has a great sense of humor and is politically astute.  He's not really brutal at all to the TA's - he knows his reputation as insulting them but really isn't that bad.  I got the impression that the TA's would take any criticism because they were working with such a scholar.  I'm not blindly praising the professor because of his reputation - he's quite intimidating, but I really think that this class is worth taking and I would disagree with the past overall-negative reviews.  It's a good class and he's a cool guy.  Note: on the bibliography that some reviews mention - it is a list of like 200 books, but it's not like you have to buy any of them - it's just a resource of books that he considers worth reading if you are interested in the topic\nWorkload:\nA lot of reading, especially primary sources, but I found that I could get by not doing it all.  Discussion sections can be tedious depending on the TA's.  Quiz, midterm (which he regraded because he thought the TA's were too harsh), paper (1500 words, he provides a list of like 30 suggested topics), final.  more than manageable.\n"
        },
        {
            "course_name": "Roman History",
            "review_date": "September 13, 2002",
            "review_content": "\nIf you take this class, and you really should only if you must, buy a book of crossword puzzles. Or find a friend, sit in the back, and play MASH or hangman. Whatever floats your boat. Better yet, dont go. Why? Because it is absolutely pointless to take, or I should say attempt to take, notes in his class. He is what could kindly be called a \"stream of consciousness\" lecturer, never finishing an idea before he throws out another. Harris sometimes appears to be in a personal competition with the micromachine man for who can talk the fastest, so if you do try to write what he says, you poor hand will probably require medical attention after a few weeks. He knows his shit, but what can you expect from a guy who devotes his whole life to the study of a civilization that he clearly despises. Harris is arrogant and condescending, mean to his TAs, and peppers his lectures with remarks about the failings of all nationalities but British. The only worthwhile thing about this class is watching him strut into the room, always a few minutes late, covered in enough leather to induce warm fuzzzy feelings in the hearts of dominatrixes everywhere, only to uncover some sort of hideous pastel colored silk shirt. \nWorkload:\nHeavy reading (and thats with ignoring the reading list of over 100 books). Midterm, final, paper. He is a pretty harsh grader, and the TAs arent all that much nicer. \n"
        },
        {
            "course_name": "Roman History",
            "review_date": "June 02, 2002",
            "review_content": "\nI suppose if you're looking for a class that you can ditch half of the time and still get a decent grade, then this is the one for you, since the workload is so light. On a personal note, however, this man is the most pompous, arrogant, sanctimonious twit that I have ever had the displeasure of being associated with in my years at Columbia. I had a dispute regarding my final grade and the discussion sections, and it took him EIGHT MONTHS to finally reply to the matter via the Ombuds Office (which I finally had to go through!). Even then, his attitude was one of \"how dare you even disturb me with such petty nonsense?\" This guy cares primarily about his super-inflated ego and secondarily about his students. If you're genuinely interested in Roman History, you should take the class. Just don't have great expectations on this professor of such low quality.\nWorkload:\nMid-term quiz; one 5-7 page paper; final.\n"
        },
        {
            "course_name": "Roman Empire",
            "review_date": "May 10, 2001",
            "review_content": "\nWorst history class I've taken so far here. The other reviewers must be freshmen--they're definitely not history majors. True, Harris is entertaining for his eccentric personality, but then again, dozens of Columbia profs are. But the course: basically a lot of memorization, no interpretation--i.e., all the fun drained out of history. There is a 50% chance you will get the TA who does not speak English, yet returns every year. Grading is wildly unpredictable at best, due to the swapping between the two TAs and Harris, each of which has different standards. If you want Roman history, buy the readable Marcel Le Glay textbook Harris uses, and go through it yourself over X-mas vacation. Then take a better history course in the spring.\nWorkload:\nQuiz, midterm, paper, final --your grade is based on how many names and dates you can memorize \n"
        },
        {
            "course_name": "Roman History",
            "review_date": "April 06, 2001",
            "review_content": "\nThe man is clearly brilliant, and he knows it. He is arrogant and the 80 year old struts into class daily like he just stepped of his Harley with leather jacket and rose sun glasses. For someone with a base knoledge of Roman History the class should be easy and entertaining. Novices beware, though this is an intro class he never brings anything together for you. He cannot being his knowledge of the subject down to what is required of an intro. class. The TA's are awesome, at least Giovanni Ruffinni who is the God of all TA's and will be helpful and an outlet for venting about the smug \"emperor\" of a professor. The class is a mixed bag.\nWorkload:\nLight, extensive reading but only midterm, final, and 1200 word paper.\n"
        },
        {
            "course_name": "Roman Empire",
            "review_date": "December 31, 1999",
            "review_content": "\nHarris looks like a stereotypical Hollywood vision of a professor. Lectures are wonderfully informative and interesting -- Harris has a sense of humor that could only belong to a doddering old British man. Fast talker, anyone who tries to capture it all can expect writer's cramp after every class. Roman History: The reading list is frightening but you can still do well with the main books and a few of the 'required' primary sources.\nWorkload:\n1 essay (5 pages), Midterm and Final exams.\n"
        },
        {
            "course_name": "Roman Empire",
            "review_date": "December 31, 1999",
            "review_content": "\n'Doddering old man' just isn't true. He's got a strong sense of style, and sports a spiffy leather jacket with badass sunglasses. In the Roman Empire course, the thematic lectures are the most interesting and informative; the rest are largely recitations of dates and facts which he doesn't expect you to remember but apparently enjoys sharing. If he focused more on the general picture perhaps he wouldn't have to speak so quickly (sometimes incomprehensibly) to get all the dates, places, votes, and battles in.\nWorkload:\n1 essay (5 pages), Midterm and Final exams.\n"
        },
        {
            "course_name": "Roman Empire",
            "review_date": "December 31, 1999",
            "review_content": "\nThis guy's a trip! Lectures are a lot of fun. He essentially despises the ancient Romans as a people, yet he's a specialist in this field. He'll ramble on from battle to battle and what not, but I recommend this class.\n"
        },
        {
            "course_name": "Roman Empire",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Harris had a great sense of humor. And not all of us got the joke all the time. He brought the material to life by dividing the subject matter thematically. Definitely into S&M;, and I liked it. Not an easy class for the brain-dead. \nWorkload:\nDecent amount of reading about 70-100 pages a week. Easy quizzes, midterm, final, and a paper. He hands out a long bibliography that's useful and updated. \n"
        }
    ]
}