{
    "prof_info": [
        {
            "prof_name": "George Flynn",
            "prof_id": 334,
            "total_reviews": 36
        }
    ],
    "reviews": [
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "April 30, 2013",
            "review_content": "\nWhen taeching, Flynn rarely does practical application problems. He teaches every unit by deriving the relevant equations. While this teaching style may work for some, I found it useless when doing the homework and taking the tests, given that the problems are all practical and rarely theoretical. When studying for the tests, I found that the best strategy was re-doing all of the homework (not graded, which is nice), because the lecture slides were completely irrelevant.\nThe variables he uses have no correlation to modern convention (c is velocity rather than the speed or light) so be prepared to learn a whole different set of variables than the ones you're used to. He probably should have retired about fifteen years ago; he tells cute stories about his granddaughter sometimes, but mostly he puts you to sleep. Only a third of the class regularly shows up. Honestly, there's no need to go to lecture; at least for me, the material was entirely self-taught from doing the homework. \nHonestly, you might be better off taking Gen Chem; there's no real curve (most of the class does fairly well) and I don't feel like I understand Chem any better now than I did in high school.\nWorkload:\n7 or 8 ungraded homeworks, three midterms, one final, some quizzes in your recitation section\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "April 13, 2012",
            "review_content": "\nFlynn hasn't been reviewed in a whiile, probably because not much changes with him. He does his best to make material interesting and clear, but often fails. It's worth going to the lectures though, because for the few people who show up, he will often hide an extra question that's not included in the posted slides in his lectures that is very similar to an exam question. Either way, it's on the whole unnecessary to go to class because the lectures slides are posted and fairly comprehensive.\nUsing the textbook as a supplement is highly recommended. I found that compounded with the book, on the rare occasion that I studied for this class, the material was very well illuminated.\nYou do need to study to get above a B. The exams are very similar to the practice exams, and knowing how to do them perfectly will pretty much guarantee you a B+. It takes a little extra studying to better than that. The whole class seemed to perform well, so there was almost no curve, but about a third of the class got A's. Keep up with the material weekly and you will likely do very well.\nThe quizzes in the recitation section were somewhat difficult, but that depends on your TA.\nI do regret taking this class just because I don't think Gen Chem would have been at all difficult if you've tested into this class and it would have been much easier to very well compared to the other students taking it. Think carefully of whether taking advantage of people failing chemistry for the first time is worth cutting out a semester of chemistry before you take this class.\nWorkload:\nThree midterms (20%), a final (40%), recitation quizzes (20%), lowest 20% dropped or final counts for half.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "November 13, 2009",
            "review_content": "\nAs previous reviews have implied, Professor Flynn is a hit or miss.  If you learn best from lectures, this is probably not the place for you, as you will probably learn most of the material on your own.  In any case, I strongly recommend not attending his lectures.  He uses powerpoint slides that go by much faster than you can really comprehend.  To add to that, the lights are dimmed and his voice is quite droning, so you can imagine what happens next.\nI did not find the recitations particularly useful, but the weekly recitation quiz forced me keep up with the material.  His practice exams were really similar to the actual exams, so make sure you know how to do all those problems, and you should do well.  Personally, I felt that the class simply taught how and when to use the equations on his equation sheet without revealing any real underlying knowledge of chemistry.\nAlso, since the exams are all scantron (multiple-choice), you don't get partial credit.  The curve was not bad, though.  I do not regret taking this class, since it was not a large time commitment and a better option than two semester of gen chem.\nWorkload:\nUncollected problem sets.  Three exams, weekly recitation quizzes, and final.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "October 14, 2009",
            "review_content": "\nGeorge Flynn is like a grandfather. The grandfather who Dad makes you visit every year even though it's somewhat agreed that nobody really likes him and his bitter attitude. He tells the same war stories over and over, long/winding/dry anecdotes about the good old days, and even though we pretend to like his famous shepherd's pie we all know it tastes like a rotten taco. \nDo not go to class. Really. His lectures are filled with units that chemists don't even use anymore (ergs? really?) and confusingly worked out problems. Watch the attendance drop, halfway through the semester there were literally about 30 people in lecture. Just do the problems. \nThe exams are a bit tricky, but not impossible by any means.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "January 20, 2009",
            "review_content": "\nI read on CULPA that this class was an \"emotional roller coaster,\"  and I think that was fairly accurate.  At first, I thought it didn't sound too bad and that I had a pretty good grasp on the material, however I walked out of the first midterm with my dreams of a chemistry major absolutely crushed.  His \"creative questions\" on the exams threw me off, and I hardly had enough time to finish the test. Thankfully he drops your lowest grade, so in the end this midterm didn't hurt me.\nI managed to break the class average on the subsequent midterms and the final, but not without obsessively studying the homework, retaking the practice tests a few times, and a horrible sensation of hopelessness accompanying each test.  This is a difficult and intimidating class, but it is possible to keep up if you are motivated.  The recitations were incredibly helpful in going over the material (although I heard that the TA for the other section was much worse), and if you're interested in physics and/or chemistry, you'll find the material somewhat engaging.  Flynn's lectures were kind of boring (and at 9:10, so they were not well-attended), but he is a really smart guy and knows what he is doing.  I did wind up with a lower grade than I had expected (I was told he curves to a B+, although I scored at least average on everything except the test I dropped and got a B), so I'm not really sure what happened.  \nOverall, this class is tough, but as long as you keep up with the work and don't save all your studying for the night before, you won't totally fail.  \nWorkload:\n3 midterms, 8 recitation quizzes (best 5 of which collectively counted as a midterm), and a final.  Drops your lowest grade.  There is homework for every chapter, and even though  its really just \"suggested,\"  you'd better do it. \n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "January 13, 2009",
            "review_content": "\nGoing to the lecture is not completely useless no matter how bleak it looks.  You will see your class size drop from 100 students to 20 maybe 35 tops though.  His powerpoint lectures are useful only as an outline and sometimes a bit confusing...he does explain the material a tad better in class albeit in a droning manner which makes you fall asleep for this 9 AM class (bring coffee).  During lecture, he sometimes throws in some \"cultural enrichments\" or \"not posted slides\" for which it is good to be present because some do show up on the midterm...but if you absolutely can't handle his teaching style it's not worth it and is better to just skip the class in general.\nThings do get better after you get used to his teaching style. It is helpful to either look at the powerpoints before class and/or read the book, which though not amazing is much more clarifying and will teach you more chemistry.\nHe's a fair grader, however his grading is done mostly using statistics thus even though you have really good grades, if everyone else did well your grade is merely average.  Therefore take all the exams (don't skip one b/c u got good grades on the others) and perhaps you may be lucky enough to do extremely well on a difficult exam.\nTo do very well, I recommend spend maybe 6 hrs per week on the material.  Spend 2-3 hrs learning the material covered in the lectures or book and make sure you can do all the homework problems for the recitation quizzes.  Then when it's time to study for the midterms, you can spend maybe that same amount of time reviewing and redoing all the problems.  Make sure to pay attention to his practice exams especially because many of the exam problems are very similar but harder.\nWorkload:\nungraded bi-monthly homework, 3 midterms weighted equally, one final, and weekly recitation quizzes.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 27, 2008",
            "review_content": "\nFlynn seemed like a really sweet old man, but his lectures were incredibly dry and ultimately not effective.  Even with a really strong cup of coffee I would doubtless find myself falling asleep in class.  It was far easier to simply skip lecture and learn the material from the slides/book, although the book was not a great deal better.  He would sometimes tell sweet little stories about his granddaughter, though.\nChemistry 1604 was quite easy, if you've taken AP chem.  It is a nice way to get a chemistry requirement out of the way.  Flynn is reasonable with grades, and the tests are a fairly good indication of how well you understand the material.  Essentially, if you go to class occasionally to hear cute stories, study the notes, and do the problems, you'll be fine in the course.\nWorkload:\nSuggested problems are given for each topic, but none are collected\nThere were 3 midterms, 8 or 9 recitation quizzes, and a final exam.  There are 6 units, of which the top 5 are used for your final grade.  Your best 5 quizzes/each midterm are worth 1 unit, and your final was 2 units.  Midterms were fair, and quizzes ranged from very easy to medium difficulty.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 10, 2008",
            "review_content": "\nWithout a doubt, the worst teacher I have this semester. I never thought it would be possible for a lecturer to make the material more confusing, but Flynn manages it. I learned a lot more chemistry just reading the lecture slides in my dorm and reviewing what the textbook had to say about the topic. The more Flynn explained the concepts, the less sense they made. I stopped attending lecture about a month in. You're better off just going to recitation. My TA explained everything much more clearly.\nWorkload:\nThe homework isn't collected, but you should do it if you want to pass the exams. 3 midterms and a final. Exams are fair and the curve is generous.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 18, 2008",
            "review_content": "\nflynn is horrific. hes boring, the material is dense and uninteresting and his powerpoints of just equation after equation is completely useless. no one goes to class. ever. average of about 20 people are in a given lecture out of 160 kids. tests are basically the same as previous years, with a few words changed. very frustrating class for me, destroyed alot of my interest in chemistry.\ni read a culpa review about how boring and bad flynn was vefore taking his class, but decided to take it anyway, which was a huge mistake. if you have any choice, dont take flynns class. Even brydges is a 100 times better than he.\nWorkload:\nnormal, optional assignments, quizzes, tests, final.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "September 08, 2007",
            "review_content": "\nFlynn was a nice guy but his lectures were VERY boring.  That being said, it doesn't really matter what his lectures are like because in my opinion there's no need to attend them.  The trick to this class is to thoroughly do the homework problems and the practice exams.  A lot of the exam questions were taken directly from the practice exams, and when I say directly, I mean directly.  Sometimes he wouldn't even change the numbers.  I did the practice exam problems twice before every test and got an easy A+.  The main thing I liked about this class was that the exams were very straightforward, they were long but there was no trickery.\nWorkload:\nOn the light side for a premed class, although take that for what it's worth.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "August 27, 2007",
            "review_content": "\nTerrible lecturer. Lectures are dry and hard to understand. Save your time and do HW and practice questions instead. \nWorkload:\nExams are hard. Do all the practice questions and both even and odd questions from the book. Strong curve, very possible to get an A.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "July 16, 2007",
            "review_content": "\nDont take his class otherwise you'll age a lot faster than you ever thought you would. I stopped going to his class cause it was sooooo boring. There is no way you can stay awake through any of his classes. If you make it, be proud of it, though you will realize you learned nothing. He obviously knows a lot, but a great guy reduced to click a powerpoint and reading off the slides. Take his class if you dont want to go to class; you'll do fine just sitting in your room doing the practice exam before the night and ending up with an A- or an A in the class. \nWorkload:\nDo all the practice problems, its a must. 20% each for 3 mid terms, 40% for the final, 20% for the quizzes. Drop one 20% unit\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "March 28, 2007",
            "review_content": "\nHe is the typical sweet old guy who weaves throughout his lecture the cutest stories about his children and grandchildren. Otherwise, all the lecture content can be found on courseworks. The class is mostly computational so there is little he can do to make the lectures terribly interesting, so use your judgement when deciding when to attend or not.\nWorkload:\n3 midterms and a final, quizzes in recitation, drop the lowest grade\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "September 02, 2006",
            "review_content": "\nI was among the only people who ever attended class because lecture was confusing and worthless, and I ended up with a LOWER grade than my peers who did not attend class.  Seriously, NOBODY went to class and really did better if they didnt come.  If you take this professor's class, just DONT GO!  Thats my best advise.  Actually... \neven better, take a different professor.\nWorkload:\nvery reasonable.  homework not collected.  weekly recitation quizzes, 3 exams and a final.\n"
        },
        {
            "course_name": "CHEM C1404.002.2006.1",
            "review_date": "August 20, 2006",
            "review_content": "\nWell, he's old, but I'd say he's a genuwine nice-guy. Office hours with him are always worth it (if you get a chance to slip in that little 1 hour window.) He teaches like all of the other general chem teachers (powerpoint, pre-assigned and unchecked homeworks, etc.) and yes, it is very boring. There's not any enthusiasm added to the course and don't think a one-on-one with him will change that. He knows his stuff and he's strictly focused on making sure that you know yours. It's not a pleasure to have him by any stretch of the imagination, but you won't be that sorry at the end. He's so-so just like everybody else.\nWorkload:\nAssigned homework problems in the textbook that aren't checked ever. The recitation class is difficult at times seeing as how there is a quiz almost every week (but that's not going to change from teacher to teacher.) Overall, grade inflation is the only think to make you not hate the class.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "June 19, 2006",
            "review_content": "\nI know very few people who felt this way, but I LOVED this man.  Don't get me wrong, everything they say about his lectures is true.  They are a complete bore.   If you tune in once in a while though, you'll see how funny this guy is.  His tests are fair.  If you do the assigned homework problems and understand everything about them,  you will get at least an A- (the curve is VERY generous).  Another reviewer stated that you could get an A+ by cramming a few days before.  I would not count on that nor would I recommend it.  I did very well but I worked my ass off.  I would definitely recommend this teacher.  He is extremely approachable and is dying to help anyone who asks for it.  \nWorkload:\nA lot.  Do the problems about 10 times each and you will get yourself a decent grade.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 28, 2006",
            "review_content": "\nFlynn is certainly a nice guy. Much nicer than Friesner. Lecture, however, is a complete waste of time. All the information on his lecture slides are posted online, but you don't even need those. Just read the book before the exams and cram before the final for about 3 days and you should get an A+. Recitation is a waste of time.\nWorkload:\nEasy. Before each exam, read the chapters and do an insane amount of problems. That is all you need for an A+.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 23, 2006",
            "review_content": "\nProfessor Flynn is generally a very nice man. I have read some other negative reviews of him and I happen to disagree with them. It is true that his lectures are useless. \nHe is usually 2 or 3 chapters ahead of his assigned homework and he often speaks on and on about calculus, which most of the class hasn't taken and is not tested. \nHowever, anyone who actually went to his office hours knows that he is incredably smart, nice, and helpfull. \nThe class is not hard at all AS LONG AS YOU DO THE HOMEWORK ASSIGNMENTS. If you do only the homework assignments, you will get a B. If you do the paired even problems you will get an A-, if you understand everything you will get an A. The class is curved and anyone who doesn't do well only has themselves to blame.\nWorkload:\nalot\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 16, 2006",
            "review_content": "\nThis is painful to write because I think Professor Flynn is an incredibly kind man who truly cares about his students.  However, I must say that his class was simply incomprehensible, and at times baffling.  I am normally a good student and I found it beyond challenging to follow his powerpoint slides.  Simple equations such as the Gibbs Free Energy equation become complex calculations that consume 75% of the class time.  Paying $1000 per credit, missing a class was inconceivable to me, until this class.  I couldn't sit through his endless calculations anymore, as much as I enjoyed his occassional pauses to tell us a cute story between him and his wife.  Don't get me wrong.  Flynn is a great guy.  Very likeable.  Extremely approachable.  But he should not be teaching general chemistry, because he turns it into the Mathematics of Chemistry.  \nWorkload:\nFlynn's exams were sporadic.  \nHis first exam consisted of HW problems, problems from just lecture, and some ridiculous concept questions.  His 2nd and 3rd exams were better, coming mostly from HW problems.  His final was like the first exam, except 3 hours of it.\n"
        },
        {
            "course_name": "F1421",
            "review_date": "April 20, 2006",
            "review_content": "\nFlynn is the worst professor I encountered in my whole life.  He just reads off his lecture slides that are quite unintelligible and he never responds to e-mails.  I am quite confused to find out that some people actually like him.  Anyone I talked to about him hates him and finds him unapproachable.  His exams require pure memorization of problems sets.  You don't actually need to understand the material, just do the problems if you are unfortunate enough to find yourself in his class. Register with another professor if you can.  However, if you find yoursefl with him, just do the problems, don't even bother read his notes.  DON'T go to Cody Carr's recitation.  He is AWFUL.\n\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "May 22, 2004",
            "review_content": "\nFlynn is a very approachable and amiable old man, but this class certainly isn't the most freshman friendly. You can tell he has a lot to juggle on his plate, being a big name and all, and this class is sort of a side job that has been conditioned to banality over the years. Go to his office hours frequently, and he may remember your name. Go to him a few weeks after the class ends to ask for a recommendation letter, and he's forgotten about you completely. He's willing to write them, but they must be cookie cutter, fill in student's name here recommendation letters...he's the guy who looks you straight in the eye, offers good advice, but couldn't care less about who you are and where you are going. \nHis class is good though, and you learn a lot. It is actually an introduction to physical chemistry, so it uses a lot of physics concepts and requries some math. For the pre-meds out there, if you have a solid foundation in general chemistry, this is a very fun class. The powerpoint lectures are boring, but the material definitely isn't, and neither is the book. It covers very little general chemistry, so don't take it expecting a good MCAT gchem review.\nWorkload:\nas stated below.\n"
        },
        {
            "course_name": "Intensive General Chemistry C2407",
            "review_date": "April 16, 2004",
            "review_content": "\nI agree with the other reviewers - Flynn is really great guy.  The first midterm was tough as hell - I thought I did so bad that I'd be dropping, but so did almost everyone else.  Plus I found out that he drops the lowest score at the end.  For the second and third midterm, I attended lectures more often but didn't find them too helpful.  I will say, though, he is about as entertaining as a chemistry lecturer can be and he's smart as hell.  When you're following him, the lectures can be pretty interesting.  I feel like I understand the \"how\" behind the formulation of the equations instead of just the equations.  (like in the equation for frequency of collisions between gas molecules at a section of a wall, all of the numbrs and multiples in the equation make sense as opposed to just the concept).  \nFor the second and third midterm, I did ALL of the homework problems twice.  They help so much.  If you know how to solve all the homework problems, you'll do well on the exams.  Not only are the ideas in the test questions all taken from the homework directly or indirectly, some problems are always reproduced exactly.  There is, however, a frustrating challenge problem on every test.  Despite my prep for the 2nd and 3rd exam, the challenge problem got me both times but I did do a little above average.  I was ready to get a B+, but then I studied even harder for the final again just by doing homework problems, killed the final, and got a straight A.  He gave about 40% A-range grades in Fall 2003, and probably around 25% regular A's.  This curve is SO much more generous than regular G-chem, which I think is about 20% A-range grades.  However, the students in the class are much better at chem than G-chem, but this one is still a better deal, both for grading and because you only have to take one semester! \nHighly recommended.  \n\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "January 28, 2004",
            "review_content": "\nFlynn is a really nice man, and really cares about his students. The first test was a HUGE shock, and pretty much everyone did badly, which meant that with the curve everyone was fine. When you get used to his tests, you can really learn a lot.  The recitations are pretty painful...try to get a good TA and friends in earlier recitations that can tell you what to do.  I don't  think he's teaching this class anymore, but if he does the best way to do well is find someone from the previous year and get their sample midterms...the problems on the midterm you have will probably be very similar (if not identical) to the ones on the sample midterm from the year before.\nWorkload:\n4 problem sets, only one is collected (but you'd better do them or else you'll be totally lost), 3 midterms (you can drop your lowest), final, recitation exercises that don't really count for anything\n"
        },
        {
            "course_name": "IG Chem 2407",
            "review_date": "January 04, 2004",
            "review_content": "\nLook, pre-meds, Flynn is easier than regular Gen Chem! You actually donÂ’t have to deal with those frustrating lecturers, you can have fair exams and actually learn something with one of the highest regarded chemistry profs in the US. He is rather boring, and the lecture hall doesnÂ’t really fill up, but he does throw in a few viable jokes now and then. IÂ’d like to disagree with some of the reviews below, and say that the powerpoint presentations are actually quite helpful Â– though youÂ’re right, it is better to go to class first to see how he treats each piece of material. He curved slightly lower than a B+ this past year, but an A- is easily within your reach if you do every HW problem and study all the lectures Â– the first, and maybe even also the second problem of four on the tests are straight out of the text! Recitations are rather tedious, so make sure you prepare for them so you donÂ’t waste time during the session figuring it out. His challenge problems, always involving the excitation of molecules by light, may look intimidating, but if you are patient and try to figure them out, youÂ’ll go a long way with them, and be on your way to an A. The final is quite easy Â– questions are philosophically identical to problems on previous exams.\nWorkload:\nThree midterms, a final, a few recitation exercises, and a few homework sets (only one collected)\n"
        },
        {
            "course_name": "Intensive General Chemistry C2407",
            "review_date": "December 27, 2003",
            "review_content": "\nIG Chem with Professor Flynn will take you on an emotional rollercoaster ride.  You'll be happy at first, because you only need to take one semester of chemistry.  Then you will be terrified because you'll realize that this is chemistry different from anything you've seen before.  If you're brave, you'll stick with it.  You'll be confused, but pretty sure you understand things...well...sort of.  And then, you'll take your first test, which will almost certainly bring out all of that horror and despair deep in your chemistry soul.  Professor Flynn is a great teacher and really loves chemistry.  He just sometimes forgets that we are college freshmen and have not been working in the field for 60+ years.  His tests are HARD, and you will very rarely feel sure of yourself.\nThis class is most definitely not for people who lack a real (AP) Physics background, as a lot of the chem is based in \"basic\" physics concepts that I had never heard of before.  I probably would not recommend it for premeds, because there is very little real chemistry until a week before the final.  \nEither way, it can't be denied that Professor Flynn is a great teacher.  He is one of the funniest (in that slap-your-forehead corny way), nicest professors you will ever have, but his tests will bring you to tears.  All the riding on his \"spaceship Columbia\" challenge questions have left me a bit jetlagged.\nStill, he is a VERY generous grader, and if you stick with him through the first test, it will  probably be worth your while.  \nWorkload:\nHomework for each section of the course (not collected, but you will fail miserably if you don't do it), weekly recitations (probably the most potentially painful experiences of your life), 3 HARD tests (the challenge questions are killer), and a final.\n"
        },
        {
            "course_name": "Intensive General Chemistry C2407",
            "review_date": "December 20, 2003",
            "review_content": "\nFlynn is a really nice prof. If you have any questions, he is totally open to help you.  In lectures, he tells some interesting jokes, sometimes.  That said, his lectures are pretty boring.  I once counted at a lecture and only about one third to one half of the class was there. Probably a quarter of those in attendance were sleeping.  I dozed off a few times, myself.  The lectures are easy enough to understand, but the lights are out and his voice is a little monotone: a perfect recipe for sleep.  The tests were challenging, but manageable and the curve is pretty generous.  If you read either his lecture notes or the book, you can pretty much learn everything.  It's worth taking because it is only one semester whereas G Chem is 2.\nWorkload:\n3 midterms and 1 final -- lowest grade dropped; 1 homework graded; three others for self practice\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "November 10, 2003",
            "review_content": "\nHe's bad. Very boring lectures. I have a hard time staying focused. But the class isn't difficult to pass if you read the textbook and/or the powerpoint lectures and do the hw.\nWorkload:\nusually don't have to hand in hw\n"
        },
        {
            "course_name": "Intensive Chemistry C2407",
            "review_date": "January 30, 2003",
            "review_content": "\nTeaches by going through powerpoint slides. This is ok in the beginning, but gets boring later on. With the lights off, I frequently fall asleep in that class. But he does teach well though. He includes diagrams and boxes to make it very clear. He always gives hints about the midterms and finals, so that really helps. Overall, good teacher.\nWorkload:\n1 homework to hand in. Other homeworks for self-study. 3 midterms, lowest dropped. 1 final.\n"
        },
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "January 22, 2003",
            "review_content": "\nFlynn's a great person and great professor, but his class is very hard.  He does his lectures in powerpoint, so you can download them, but there's a big advantage to going to class - a lot of what's on the presentations doesn't make sense unless he's explaining it to you.  \nTop 5 reasons to take his class over normal G-chem:\n5) The class is curved on a B+ average, so around a third of the class gets A-range grades\n4) No chem-write paper.  Ask anyone who took G-chem, it sucks.\n3) For a guy of his stature, Flynn is a really humble guy.  He's basically an expert in his field, but he'll happily take an hour of his time to answer your questions about the material.\n2) There's about 80 people in Intensive, compared to ~225 in each section of G-chem.  You can actually ask a question without feeling like you've just made 200 enemies.\n1) Intensive chem is over in 1 semester; G-chem takes up 2.  And if you got a 5 on the Chem AP, finishing Intensive chem gets you credit for a second semester anyway.\nMy point is: Flynn's a good teacher and his class is worth the extra effort.\nWorkload:\nhomework assignments are used as preparation for the tests - all but the first are ungraded.  A whopping 3 midterms and a final keep you busy, but things are fairly curved.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "January 17, 2003",
            "review_content": "\nFlynn is a great professor.  Granted, all the lectures powerpoint and online, but I actually do think it's worth it to go to class, even though sometimes his lectures are tediously boring.  This class is a MUCH better alternative to the regular general chem sequence.\nWorkload:\n3 midterms, 1 final exam.  There are 4 problem sets, but only one needs to be turned in.  However, it's an EXCELLENT idea to do the problem sets because test problems are often homework problems or are very similar.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 10, 2002",
            "review_content": "\nFlynn is a nice guy...very approachable and friendly and willing to help you understand what's going on in class. He's generous with the class materials: posts powerpoint lectures on the web, holds a LOT of review sessions before tests (with very smart and helpful TA's, and he even leads one himself), gives detailed solutions to homework problems, AND hands out practice tests with detailed solutions (real tests from the year before). He's willing to stop class to answer questions. I have to say, though, that his lectures go pretty quickly and are hard to follow unless you're really good at math and whatnot. If you read the textbook, go to review sessions, and do the homework and the practice tests, you shouldn't have a problem. \nWorkload:\n4 problem sets (one for each unit): only part of the first one is collected. Recitation exercises are easy and helpful in understanding the material (if you READ the packets). 3 tests and a final, all pretty difficult but graded VERY fairly (also, he regrades them if you have a problem). At the end of the term, your score is calculated in two ways: one with your lowest test (not including final) score dropped, and the other with all three test grades but the final counting less. He takes the score that's better for you.\n"
        },
        {
            "course_name": "C2407-2507",
            "review_date": "November 19, 2002",
            "review_content": "\nflynn - nice guy, crappy teacher. unless you're really quick at math and physics, don't take this class. just go get an A in gen chem. his lectures are slide shows of problems that he reads off and you won't understand. the book is alright but hard to read. the upside is that the class is curved. you will get the same grade whether or not you go to class, since class is in the dark and everyone falls asleep every class. do the problem sets and try to get a good grade and you'll get a B+ and be thankful for it. \nWorkload:\nhomework (hard), 3 midterms and 1 final. do the homework and practice tests - at least 1 question on each exam comes from there.\n"
        },
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "November 13, 2001",
            "review_content": "\nWell, this course was actually pretty good, but Flynn is very dry and makes it QUITE easy to fall asleep (10 minutes max). I would recommend not even going to the classes, for the slide-show approach to teaching is not my cup of tea. The fact that Flynn himself is a knowledgeable man is virtually meaningless when it comes down to his ability to teach.\nWorkload:\nDo the homework and go to the recitations. 3 Midterms and a Final.\n"
        },
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "August 06, 2001",
            "review_content": "\nProfessor Flynn is a good lecturer and just generally a good guy. He's extremely organized (the whole lecture is on slides put together in Powerpoint), but he is also exteremly willing to stop class to answer any questions from students. His explanations were generally clear and helpful. The class isn't always the most interesting, since those who have taken AP Chem are already familiar with some of the material, but he does his best. Everything about the class is fair and designed to help out students. The lowest midterm grade is dropped (or the final counts for less... whichever works out better for you), the curve is generous, and the midterms often have a question from the homework. Students are also given a practice test for each of the midterms and the final. The textbook is also pretty accessible, though you are very rarely required to read it.\nWorkload:\n3 midterms and a final. Optional homework (which doesn't take long and is helpful) and required discussion section (whose exercises seem a bit insignificant but are easy).\n"
        },
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "August 06, 2001",
            "review_content": "\nProfessor Flynn is a good lecturer and just generally a good guy. He's extremely organized (the whole lecture is on slides put together in Powerpoint), but he is also exteremly willing to stop class to answer any questions from students. His explanations were generally clear and helpful. The class isn't always the most interesting, since those who have taken AP Chem are already familiar with some of the material, but he does his best. Everything about the class is fair and designed to help out students. The lowest midterm grade is dropped (or the final counts for less... whichever works out better for you), the curve is generous, and the midterms often have a question from the homework. Students are also given a practice test for each of the midterms and the final. The textbook is also pretty accessible, though you are very rarely required to read it.\nWorkload:\n3 midterms and a final. Optional homework (which doesn't take long and is helpful) and required discussion section (whose exercises seem a bit insignificant but are easy).\n"
        },
        {
            "course_name": "C2407-C2507 Intensive General Chemistry",
            "review_date": "December 31, 1999",
            "review_content": "\nWhen I signed up for this class I was under the impression that it would be a quick review of AP Chem and then a little bit of new stuff would be introduced. Not so. The class - or at least Professor Flynn - starts right out in the nitty-gritty of it, with some difficult-to-follow math on the first day. The class is further worsened by the fact that it's all on slides; all the math is done ahead of time, and thus goes by far too fast for students to really ask questions or comprehend the material - or even write it down. Basically George ends up reading the slides to you as they go by, which doesn't really help the sparse information they give. It seems he designed the course last year or the year before and just kept the slides around. He is very good at answering questions, but often the information provided on the slides are too sparse for a student to do anything less than interrogate him on the subject. Unfortunately, this is the only one-semester genchem course, so it must be borne by those of us who passed the AP test. Yeah, he got a teaching award, but I wouldn't have given it to him.\nWorkload:\n3 midterms and a final, with optional homework. Do the homework, it doesn't take very long. I found the book far more helpful, though.\n"
        }
    ]
}