{
    "prof_info": [
        {
            "prof_name": "Matthew Palmer",
            "prof_id": 3153,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Conservation Biology",
            "review_date": "April 13, 2011",
            "review_content": "\nSTAY AWAY FROM THIS CLASS. It is the biggest waste of time. Meets once a week for 2 hours, mandatory 1 hour discussion section each week, about 3 mandatory field trips, two of which are full day excursions. We learned absolutely nothing of substance.\nThe entire course can be summarized like this:\nThe philosophical basis of conservation is questionable. We don't have much data, so our models suck and our understanding of the natural system is very limited. We should do lots of research and then integrate the results with social, political, economic, cultural, and spiritual considerations to engage stakeholders and conserve the system.\nAssignment: There's a reservoir in Central Park. Let's restore it! Go!\n(what are we restoring? why? how much money? what time frame? what species live there? these are apparently irrelevant questions and we are not given the answers)\nThat's actually it. No science. None. At all. Just a lot of focus on integrating it into some kind of vague socio-politico-economic framework. This general lack substance be a lot less frustrating if the class wasn't SO MUCH WORK. It's not hard, it's just time consuming. Very, very time consuming. The sad part is, the professors are both cool and extremely knowledgeable. Matt is a plant guy, and Sacha focuses on insects; they both know a lot about generally under-studied topics in environmental bio, yet do not impart any kind of scientific knowledge to their students. They and the TAs are both really nice as well, yet the class still sucks. So frustrating.\nWorkload:\nWeekly \"exercises\" that take hours and teach you nothing except the art of bullshit (which, let's be honest, you've probably already mastered!). 2 journal articles weekly (discussed in section), generally literature reviews, opinion pieces, or modeling studies that say little. No midterm, take home final (I haven't taken it yet). There's an optional paper you can write to decrease the weight of the exercises and final exam, but if you work hard on the exercises it probably isn't necessary.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "November 03, 2010",
            "review_content": "\nThe second semester of Enviro Bio was so so so different from the first, they should hardly be considered part of the same sequence. I, too, enjoyed this semester more, but mostly because the I preferred the material and the laid-back character of the professors. \nMatt Palmer is awesome (too bad he's married now, though!) and he does a really great job breaking material down so that students can understand both the details and the big picture. He very intelligent, and therefore can move through material very quickly, but slows down for in-class questions.\nPaul Olsen is very old. I found his lectures incredibly random and disorganized. I would often look up from 15 minutes of gchatting to see a massive purple and pink \"dinosaur recreation\" on the screen, listened for a few minutes to see if what he was talking about was at all related to the image, discovered it wasn't and then returned to my online dalliances. This said, I understand that Olsen knows his stuff about dinos and rocks, but the technology (ie PowerPoint and iClickers) really seemed to get the better of him.\nKevin Griffin is also a very smart dude. He tends to do more \"big picture\" stuff and assumes that his students can get the details elsewhere. His research is pretty interesting and his kids are really cute (they make it into about every other lecture). \nShaena is the shit. Again, super smart but also cool and very helpful in lab because most of the assignments appeared to be designed for precocious 6th-graders (read: making phylogenies of LEGOS and counting beans for genetics). She made coming in for 3 hours to do the silly \"labs\" okay, because she tolerated extensive Tim and Eric Awesome Show breaks.\nOverall, this is a good class, and if you have the discipline to stay offline in class, you can learn a lot. Hopefully the organization of the whole thing will get better, and the labs will get more college-level. \nWorkload:\nFairly light. Some textbook and article reading, which is super redundant if you took Enviro Bio I. Just skim the stuff before the midterms.\n3-hour weekly \"labs\" in which you get a head start on the \"Lab reports\" and then forget about them until the night before they are due.\n3 field trips, of questionable educational value.\n3 midterms (one after each section). Fairly easy, but study with others because the answers will come from notes, so try to fill in the gaps with classmates.\n"
        },
        {
            "course_name": "EESC 2300 Earth Systems: Life, and ENV 2200 Environmental Biology II",
            "review_date": "May 15, 2010",
            "review_content": "\nI enjoyed this second half of environmental biology far more than the first half.  I guess I just don't really like the grueling rote memorization of DNA replication processes and of central body systems.  This class was actually quite fun, though, and I liked all three professors we had.  \nThe first section (photosynthesis and respiration) was the most difficult, both in terms of exams and labs, but nothing was particularly difficult.  I have never met anyone so excited about photosynthesis and respiration as Kevin Griffin, and it makes lectures much more enjoyable.  He teaches the first section of Life Systems/Environmental Biology II in great detail and relies heavily on the Raven et al textbook.  Read the textbook!  \nThe second section was a paleontological look at life systems on Earth.  This includes a brief (two lecture) history of the universe, a similar history of the earth, and looks at dinosaurs, etc. It's fun, and some of it fits in nicely with the Climate Systems course, and it would be helpful to have taken Solid Earth Systems before this or at the same time (I haven't yet taken it).  Of the three professors, Olsen had the least clear lectures, though most of the time I could follow along.  His discussion of the greater carbon cycle (including through rocks, etc.) I couldn't at all follow, but it didn't show up much on the exam.  Olsen did not follow the textbook much, so pay attention to and study the lectures, and you'll do fine. \nThe third and final section (evolution) was taught by the much loved Matt Palmer.  Seriously, this guy is great.  He's young, engaging, hilarious, and generally a really fun professor.  This section is the easiest, and the labs are easy and short.  You've learned a lot of it before if you took the first half of environmental biology.  \nLabs were generally terribly written.  There were field trips at the end of each section (though it had to be cancelled for Palmer's section), with longer lab reports due for these, requiring some outside research through the literature.  Normally, however, the lab reports just required you to fill out the answer sheet instead of writing a full lab.  \nWorkload:\nWeekly lab (usually with an answer sheet), 3 (we only had 2) full lab reports.  Three midterms, one for each section.  No cumulative final.  \n"
        },
        {
            "course_name": "EEB 2",
            "review_date": "August 18, 2009",
            "review_content": "\nOne time I was at a party when someone asked, \"If you could date any professor, who would you date?\" About three people at once said Matt Palmer. He's laugh-out-loud hilarious, and his lectures are riveting. Even the people who usually sleep in class sat bolt-upright, transfixed by his examples illustrating the concepts he was teaching. Whenever I needed help, whether with an assignment, finding a job, or even just tips on identifying animal life during my vacation in the desert, he was eager to help. Not only is Matt a great teacher, he's a genuinely good person. His tests are straightforward and fair (the last question on his exam, for extra credit, was to write a poem about foraging theory.) His enthusiasm for the subject is infectious.\nWorkload:\n4 labs and a midterm during his section of the course. The midterm is pretty straightforward; if you know the material, you get a good grade. The labs are dreadful and time-consuming, but it's not his fault.\n"
        },
        {
            "course_name": "EEB 2",
            "review_date": "January 11, 2007",
            "review_content": "\nThe friendliest and probably the youngest full professor at Columbia. He's insanely knowledgable, communicative, and available for help. He was my professor for a mere month or so, and still remembers my name and says hi on the subway a year later. Recommended.\nWorkload:\nLots of labs that take way too long. Come at them with the right attitude and they'll be fine. Read the book and A's will come.\n"
        }
    ]
}