{
    "prof_info": [
        {
            "prof_name": "Christos  Papadimitriou",
            "prof_id": 13703,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 29, 2021",
            "review_content": "\nDon't listen to the haters. This class was fantastic. It was a bit disorganized sometimes, to be fair, but that ended up affecting my experience barely marginally.  If you're paying attention in class, you will learn so much.  Papa goes through a ton of material, but it's all very meaningful; we covered some really cool topics like game theory and quantum computing.  Papa is a living legend and you can tell.  He's an expert on these areas to the nth degree and knows how to teach it effectively and kindly.  Definitely an amazing teacher.  The TAs were honestly very good.  Prompt with Piazza questions, and as accommodating as possible.  Take this class if you want to put in a bit of work, but want to get a lot out of it as well.\nWorkload:\n1 pset a week, could take around 6 hours to complete.  BUT they actually help you understand the material and are enriching.  1 midterm, 1 final, and we had a project as well which was actually pretty fun.\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 22, 2021",
            "review_content": "\nJust want to mention, with overwhelming bad reviews, the first two reviews (which happen when everything is in person) are overwhelmingly good. I actually take this course due to those reviews.\nI do think Professor Papadimitriou is nice and knowledgable, and I don't know what happen to the course for this online version. \nJust want to point to the reviews for in-person course so that people can have their own judgement.\nWorkload:\nSee other reviews.\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 19, 2021",
            "review_content": "\nI really do not know how people got through his lectures in person. His zoom class was a disaster, from the TAs to the exams to homework assignments. Awful and painful class. It's funny that he confuses himself a lot of times, and then ask \"IS IT CLEAR?\" How the hell it is clear when you don't even know what you are talking about!!! He really is a super nice and approachable professor. He smiles all the time and answers your questions and replies to your email, but that really doesn't change how bad this class is. \nWorkload:\n10 Homework\n1~2 weekly quizzes you never know when they'll post\nAttendance but no one pays attention\nProject voted by students who have no idea what they are doing\nMidterm/Final over zoom with camera on\n\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 18, 2021",
            "review_content": "\nThis was a truly horrible class. Do not take this with Papa, whatever you do. Just because he's famous doesn't mean he can teach or explain. Insane workload, lots of it not on important/relevant topics to what most people actually care about algorithms for - interviews.\nDo yourself a favor, take this with literally anyone else. Better yet, pray that you have TAs that care enough about students to change the direction of a terribly run course. \nWorkload:\nliterally stupid. see other reviews.\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 15, 2021",
            "review_content": "\nLMAO how much are we willing to bet that one of the butthurt TAs wrote the review from April 6? It’s obviously a bullshit review made to save face.\nAnyways, all the other reviews from 2021 are completely accurate. I agree that Christos is probably a nice person, it’s just his lack of organization and terrible TAs that make this class trash. The format of a Zoom semester plays a hand in it too, but I honestly don’t think things would be that much different if we were in-person with the same TAs.\nWorkload:\nHeavy. See the other reviews from this year\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 06, 2021",
            "review_content": "\nI have a lot to say about this class, some of which is in response to what has already been said. I'll try to keep my argument structured and evidenced and give my final review at the end. For context, I'm an undergraduate junior who's already taken enough 4000 level classes in the department to feel confident vouching for these opinions. \n1. First things first, I agree with the other posts on the disorganization and intense workload of the class. Analysis of Algos is one of the most intense workload classes I've taken at Columbia (not the hardest, but a lot of work). It would've helped to have a reasonable routine for problem sets and for quizzes/readings, and it is really troubling that this was not followed. I agree that as a class, it's insane that we have to deal with this in the middle of an online sem. It's also crazy how a little bit of everything counts, so you cannot really slack off on any parts. The lectures are very fast, and it's not possible to keep up with the class at all points of time, with the readings the core resource in helping to follow. \n2. I do not agree with the assessment of the TAs, and especially name-dropping of the TAs in the post -- it's unfair and gives a very biased view of what happens in class. In my opinion, Max Helman and the team (despite their quirks) have done their best to be helpful. I think the grading is a bit too harsh with too many requirements, and rubrics need to be more precise, but this is common to most Algos sections. Previous posts mention that its ridiculous to have 3 hws, a project and a final in the final weeks of the class and I fully agree, but it's worth noting that the students voted to have a project to take the weight off of the final, and that the TA team orchestrated that the request was heard. I too voted for the project and it was a bad decision in hindsight, but this was not a TA decision to add more work. In my opinion, the TA team has been resourceful and responsive on Piazza despite being uncertain from time to time about logistics which I doubt were in their control. I had many instances asking for readings + homework, and was told that this decision had not been taken on a professor level despite them following up. This brings me to my final point:\n3. Christos Papidimitriou is a legend of the CS world. He teaches this class once in a while because he feels like it, and out of a pure passion for algorithms. The passion is apparent in his fast-paced lecturing style and the breadth of his syllabus. It's very rare to have a professor who's written the textbook of the class, and even rarer to have one of the smartest people in the world as your Prof with the crazy CS network Prof. Christos has: including the likes of the founding members of Google and Microsoft and several dozen Turing Award winners and award-winning textbook authors that are his friends. He has contributed to evolutionary biology as he has to game theory, to complexity theory as he to database theory. I think when people sign up for his class, people are looking for the experience of learning from a 'famous' professor. And I think the disorganization in the class is purely a consequence of the same: he's a very busy person who wants to say a lot about a lot of things. This by no means is trying to say it's ok to not pay attention to the requirements of the students. As I've said before, I disagree with how lectures and organization for the class went. I just think that the status of Prof. Christos's achievements along with the fact that he infrequently teaches the course means that the structure can get a bit haywire, not as a consequence of TA involvement but rather purely as an artifact of everything he wants to cover and how he relays this.\nFinally, I want to note all this is true of a zoom semester. There's close to no interaction in the lectures or breakout rooms and it's so easy to fall behind in class, after which the mandatory attendance requirement means that loads of people attend for the sake of it. naturally, the online learning environment does not lend itself to question answering beyond those that are already confident of the material and this contributes to the issue. I would not generalize from what I've written above or what others have written of the Spring 2021 iteration to beyond the online medium. \nFinal outcome: \nAgree with: heavy workload, fast lectures, disorganized content\nDisagree with: evaluation of the intentions and commitments of teaching staff. I think they've tried their best to help through the semester and the haywire experience is more a consequence of the general direction of the syllabus + online medium.\nSummary: take this class if you want the experience of having prof. Papadimitriou as your professor and want to flex about it for the rest of your Columbia journey and CS education career for when he wins his next big award. Don't take it if you expect light workload + easy psets related to the core algorithms taught in a more traditional algorithms sequence. Don't make a decision on whether to take it from looking at the TAs, but instead do so based on your expectations for the class. I doubt a change of staff will do one bit to alter the direction Prof. Christos takes his syllabus and expectations.   \nWorkload:\nWeekly psets: between 5-15 hours a week with the average taking 10 hours\n2 exams (midterm, final)\nbiweekly quizzes + readings \nfinal project on an NP-complete problem and its heuristics\nmandatory \"participation\"\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "April 04, 2021",
            "review_content": "\nPainful, painful class. Do not take it if Max Helman is the head TA.\nWorkload:\nVery heavy lol. Rn we have 2 weeks before finals and 3 more psets due, 1 fat final project, and our final.\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "March 24, 2021",
            "review_content": "\nAgree with the top review. I really want to like him but this class has been the most awful experience I've had at Columbia. Only take this class if you are extremely self-disciplined and a genius in CS. A lot of people in this class are graduate school students, so if you are an undergraduate, be prepared to get lost at the beginning of the class. There are almost 100 people in this class, but there really aren't too many people participating due to the poor lecture structure and his teaching. I don't understand the majority of the things he teaches and have to rely on the textbook and self-learning 99% of the time. As an undergrad, I think this probably doesn't apply to a lot of the classmates coz there are a lot of graduate students, who probably have already seen most of the things taught in this class. Even though it's on zoom, he requires attendance, but I can't follow at all. There are always geniuses in this class who understand everything and make the professor think that everyone in the class understands what he's talking about. He enjoys putting us into breakout rooms, but NO ONE, literally NO ONE, talks in the breakout room (I'm not even sure whether people are actually listening to the course). He goes through everything pretty fast because you are supposed to understand everything deeply in the textbook before coming to the class, so you are basically fu.ked up if you don't do the readings. The content of this course is super important, but I really don't recommend Christos at all unless you learn everything on your own. \nWorkload:\n1~2 weekly quizzes. \n10~12 Homework problem sets.\nMidterm/Final\nGroup Project\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "February 12, 2021",
            "review_content": "\nHe seems like a nice guy and I really want to like him, but he has been a terrible professor this semester. I want to preface this with the fact that I am taking his algos class during a Zoom semester, so I'm sure it's hard for everyone, including the TAs and the professor, but the class is incredibly disorganized. We have mandatory quizzes before every lecture on the lecture material (which, although aren't worth a lot of our grades, are still stressful to have to worry about). The readings that these quizzes will be on and the quiz itself are often not posted until 10 PM or later the day before our 10:10 AM class, and we are supposed to take the quizzes before the lecture starts. Weekly psets are also sometimes posted late (posted Friday and due before Wednesday morning). Piazza is the main medium of communication, which is messy and it's difficult to find important messages.\nAll in all, I would not recommend this class at all.\nWorkload:\nWeekly psets (~10 hours), 1 project, 2 quizzes a week, a midterm, and a final\n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "November 18, 2019",
            "review_content": "\nTake a class with Christos!! He cares a lot about his students and is a fascinating and wonderful person to know. His office hours have been one of the best parts of my college experience. His psets are difficult, but he is flexible, helpful, and brilliant. Also, he is the author of multiple novels and a wonderful comic book series called logicomix. Ask him about it in his office hour sometime.\nWorkload:\nOne difficult pset a week. They took me about 5-10 hours depending on the pset, and they had to be typed. \n"
        },
        {
            "course_name": "Analysis of Algorithms I",
            "review_date": "May 24, 2019",
            "review_content": "\nChristos Papadimitriou is easily one of the best teachers, not just in the CS department, but at the whole university. Rather then just writing summaries of the text book on the board for students to copy, he actually engages the students and instills the core principles of concepts in each lecture. He also adds fun historical facts and jokes throughout his lectures. His weekly psets were quite challenging, but that’s by nature of the subject. Christos doesn’t hide the fact that his psets are challenging, and consistently encourages students. He even throws “homework parties” during the semester, where he books a conference room and orders food, and lets students collaborate on the give. Pset together. I’ve never had a teacher more invested in their students success. \nAs an added bonus, Christos isn’t just some random lecturer. He’s one of the most famous and accomplished  theoretical computer scientists in the world. Having access to such a legend is truly astonishing. In his office hours, he’s willing to discuss anything research related. He’s also one of the most charismatic people I’ve ever met. If you’re lucky enough to be able to take a class with Christos, take it!\nWorkload:\nWeekly psets (difficult), midterm, final, weekly (optional) quizzes for bonus points \n"
        }
    ]
}