{
    "prof_info": [
        {
            "prof_name": "Walter Mischel",
            "prof_id": 739,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Personality",
            "review_date": "December 22, 2010",
            "review_content": "\n     After reading all the reviews of Prof. Mischel on CULPA, I was expecting a bad experience, but it was really good.  I didn't find him to be egotistical at all.  Sure we cover a lot of his own work, but that's because it was very relevant.  His attitude about it isn't arrogant.  The main textbook is also surprisingly well-written and easy to understand for a science text.  (That said, his monolith from 1968 is pretty boring).\n     Although he's not the most compelling lecturer in history, he's by no means terrible, and he's certainly open to answering questions (at length) from anyone.  He has a sense of humor and he really knows his shit.  What do you want?\nWorkload:\n2 multiple choice exams and a take-home final, with a choice of 4 of 6 500-word max essay questions.  (I did think that the multiple choice questions weren't very well-written--they didn't seem to quite correspond to the stuff in the book). There are fairly heavy, but not deadly readings each week, and you have to post a minimum of 3 questions on them each week to CourseWorks\n"
        },
        {
            "course_name": "Advanced Seminar in Personality Theory",
            "review_date": "March 05, 2008",
            "review_content": "\nIt sounds like Professor Mischel's introductory class is less than stellar, but I would highly recommend taking his advanced seminar if you're a senior (or precocious junior) who definitely wants to pursue a Ph.D. in psychology. \nFirst, I should say that this class is what you make of it. He will not force you to do anything; you have the entire semester to write one term paper. If you feel driven and motivated to learn how to write a good Psychological Bulletin-type review paper, this is a great class to take and Prof. Mischel will give you plenty of advice and guidance. He's a creative and brilliant researcher, so he will spend much of the class challenging your assumptions, critiqueing your writing, and trying to expand your conceptualization of psychology.\nMany of the past reviews have commented on Professor Mischel being full of himself and lecturing only on his own research. In this class, we did have to read his 1968 book, but that would be par for the course for any seminar on personality theory. He is perhaps the most famous psychologist in the field of personality - you will see questions about his work on the psych GRE and on licensing exams. Nonetheless, I found him to be extremely kind, down to earth, and willing to help his students. \nWorkload:\nOne 20-page (approx.) research paper\n"
        },
        {
            "course_name": "Intro to Personality",
            "review_date": "May 07, 2007",
            "review_content": "\nProfessor Mischel was nice in person, but in class he somehow managed to take something as interesting as personality psychology and make it reeeally boring.  Every class was composed of him reading off lecture slides in a way that led me to suspect he not only didn't put them together, but didn't even review them at all before class.  There was also a lot of fumbling with the technological stuff (it was kind of cute at first, then just tedious).  There were occasionally some really adorable videos on children in experiments, but maybe not enough to make attending class worthwhile.\nI was generally repelled by his big ego and seeming hostility towards people who asked questions but were not pretty girls.  Looking back on the class, it kind of felt like Mischel was just going through all the history so he could get to his stuff in the end.  He was far more engaging when teaching his own theories...maybe he should just stick to that.  \nWorkload:\none midterm, one final--multiple choice.  i barely did any work and got a b-.  just read the book and it's a breeze.  lectures are usually redundant if you do the reading.\n"
        },
        {
            "course_name": "Intro to Personality",
            "review_date": "November 14, 2006",
            "review_content": "\nUpon entering the classroom or lecture hall in which Professor Mischel is teaching, follow these simple steps:\n1) remove your shoes\n2) bow your head\n3)assume a penitent position on a plank dotted with upward-facing rusty roofing nails, to remind you of the pain Walter has undergone as a sacrifice on your behalf\n4)copulate with and successfully impregnate a woman\n5) assume penitent position for nine months\n6)have woman return with child\n7)offer child to Walter as a sacrifice\nWhat I'm getting at folks, in case my message is a hazy one, is that Walter Mischel has easily the most inflated sense of self-importance I've ever encountered.  I mean, I can fry up an egg while singing and planning my day all at once, but I didn't write a BOOK in which every other textual reference is to my ability to do these things! The lectures stray from the book's text about as far as a piece of salami strays from your cheek if you've slapped it there and are holding it in place; the TAs don't speak during class, which they should; Walter insists on floating around the room on his laurels. Be warned. \nWorkload:\nNot bad.\n"
        },
        {
            "course_name": "Intro to Personality",
            "review_date": "February 05, 2003",
            "review_content": "\nWalter Mischel is first and foremost a very cute old man (he's 72). He is also extremely well-renowned, and for good reason.  His breakthrough 1968 changed the personality field of psychology greatly; basically, he contradicted what everyone else was saying (i.e., the behaviorists), so he totally threw the foundation of personality psychology on it's head - some people still think of him as the devil in his field.  Mischel's theories seem almost obvious to us now, but at the time they were very monumental.  I found his class both interesting and informative.  I thought his lectures were good, not enthralling, but definitely interesting.  The book, which he wrote, is easy to follow and not boring.  He is a nice man who will make you smile at his old age and cuteness.\nWorkload:\nThree multiple choice exams - not too bad if you read and review a little, although the wording can be a little tricky.\n"
        },
        {
            "course_name": "Intro to Personality",
            "review_date": "May 29, 2002",
            "review_content": "\nWalter Mischel is nothing special. I could have come up with his groundbreaking theories on Personality when I was in sixth grade. This course caused me to disregard psychology as a science and think of it rather as a bunch of subjective viewpoints that are interesting but, other than that, meaningless. You can take this course and, if you read the text, get a decent grade, but it's kind of worthless.\nWorkload:\n3 multiple choice exams, not bad if you've done the moderate reading.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 10, 2001",
            "review_content": "\nProfessor Mischel is quite distinguished in this field. He wrote the book that his class uses. The course goes through the 5 major approaches to Personality and the content is very interesting. HOWEVER, Professor Mischel is not. His lectures follow the book very closely making coming to class boring.\nWorkload:\nThe course is not much work. There are three exams all multiple choice but the wording of his exams can be a bit confusing.\n"
        }
    ]
}