{
    "prof_info": [
        {
            "prof_name": "Robert Hymes",
            "prof_id": 659,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "General review_content",
            "review_date": "January 18, 2005",
            "review_content": "\nProfessor Hymes is very intelligent, but he's also super arrogant and if he's having a bad day...be careful.  He rambles on and on in class; he's smart and likes to shows off.  To be fair, he's is a relatively good listener (unlike many other Profs. at this institution) and won't shoot you down if you're sorting out your thoughts outloud during class discussions.  But, nonetheless, he's not a \"A\" grader and watch your grammar (he HATES grammatical errors).  I don't think his new promotion to Chair of EALAC has helped...it has just made him more pompous and hard to approach.  \nWorkload:\nLots of reading (don't read it all, you won't have time, unless you want to suffer in your other classes).  Fair number of exams and papers.  Grading isn't too easy.  \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "December 15, 2002",
            "review_content": "\nProf. Hymes is definately a knowledgeable professor who knows his stuff extremely well.  His lectures are to the point, sometimes peppered with amusing remarks, but overall the same, which can get monotonous.  However, he gives way too much reading each week, and though you soon learn to do the bare minimum (or just not do it at all), you find out for the midterm and the final that you'll need to read at least something.  Discussion sessions are required and lacking, though it depends on your TA and the other students.  Overall a pretty good class that can get dry.\nWorkload:\n2 4-page papers, midterm, final, discussion session posting each week\n"
        },
        {
            "course_name": "Historiography of East Asia",
            "review_date": "September 04, 2002",
            "review_content": "\nProf. Hymes is a very friendly guy. When it comes to the realities of the academic world, he tells it like it is and brings many years of experience with the life and politics of the mind into his discussion groups. Doesn't hurt that he isn't too rigid about extensions and such things -- he really has the students' sanity at heart. However, the same easygoing passivity that makes him fun to work with can make you want to claw someone's eyes out. He may need a few weeks of prodding before making pretentious grad students stop going off on hour-long diatribes in an undergrad class. Be ready for lengthy monologues about the question at hand; Prof. Hymes' digressions will keep you involved in the conversation, but maybe not so clear of the topic. I'd definitely recommend him. But if you need to get in touch outside of class, talk to him in person -- he tends to forget about emails.\nWorkload:\nExpect a decent chunk of reading, 250-350 pages per week. Reading notes will be required periodically through the semester. A couple short papers too, and a discussion post every week. Oh well -- if you're taking the class, you probably have to, so just steel yourself for the workload (which isn't that bad if you know how to skim).\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "May 19, 2002",
            "review_content": "\nI took this class to fulfill the first half of my major cultures requirement. It's overall mediocre. Prof. Hymes is a really nice guy who definitely knows his stuff, but when it comes down to it...this class is filled with alot of dry history. There's sooooo much reading. If you dont do the reading, discussion sections and lecture can be confusing and boring. The reading, most of it, is pretty relevant on the exams. Be prepared for alot of work.\nWorkload:\n2 papers, final, midterm\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "January 06, 2002",
            "review_content": "\nThis teacher has received rave reviews, but for some reason, I really didn't enjoy his class. I found his lectures for the most part boring and spent most of the time spacing out in class. This class is not particularly hard, just boring, which can make it hard to do as well as you want. I do that Hymes is a great person though. He really cares about his students.\nWorkload:\nTwo 4 page papers, midterm, final, participation in recitation.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "December 06, 2001",
            "review_content": "\nProfessor Hymes is brilliant and enthusiastic; he's so genial and unassuming that it's easy to forget how much he knows and how much work he puts into preparing his lectures and his extensive and very helpful web materials. There are two drawbacks to this class: one, the reading load is murderous, and two, there is an incredible amount of information to learn, much of it dry history. With some creativity and skimming, you can get away with reading considerably less than he asks, but don't take this class if you're not willing to stomach almost six thousand years of \"and then Emperor X took over the north, and then this tribe took over the north, and then this river shifted, and then these people revolted...\" My discussion section was largely a waste of time, but you really don't need the TAs' help. Professor Hymes is incredibly accessible and will often write a long, informative, interesting, detailed response to a student's e-mailed question and then send it to everyone in the class.\nWorkload:\nTwo lightly graded 4-5 page papers, midterm, final, and weekly discussion section with paragraph responses on weekly questions due the day before. Almost unbelievably large reading load, however. (\"Read the Confucian Analects for Thursday.\")\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "November 07, 2001",
            "review_content": "\nProfessor Hymes is an excellent professor. He organizes his lectures so that you can follow them easily without boredom. He has a way of conveying large amounts of information effortlessly. He is tremendously helpful with any question, often giving back 4 or 5 paragraphs in response to any questions you ask him. Highly reccomended.\nWorkload:\nReading is a bit much, but the class and the web are the important things to know. Midterm, final, two short (4 page) papers.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "July 07, 2001",
            "review_content": "\nThis is a great class. The professor is extremely friendly, the TAs are all very encouraging...Although there's A LOT of reading and the amount of information in the lectures can overwhelm you sometimes, it's a good way to get a general overview of Chinese history and culture. Also, Professor Hymes puts a lot of work into the class website, with pictures, readings, paintings, etc, so they can really help you to gain a further understanding of the topics discussed in class. If you have any questions about anything, Hymes will always respond in a kind manner. He's just really great!!\nWorkload:\n2 short papers, weekly discussions, 1 midterm, 1 final. If you happen to be struggling, you should go and see Hymes or your TA and they will help you extensively.\n"
        }
    ]
}