{
    "prof_info": [
        {
            "prof_name": "Erica Weems",
            "prof_id": 2114,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French II",
            "review_date": "January 02, 2010",
            "review_content": "\nTake this class if you are not at all interested in French and are just trying to fulfill the requirements. It's easy and straightforward and you won't be at all stressed out. The only thing that might be a pain is the final project -- you have to write and memorize a sketch and then perform it in front of the class and it requires actual effort. \nIf you are even slightly interested in learning French--it's not the right class for you. Erica is nice, but she doesn't really teach. The exercises in class are pretty pointless, and the stuff on the exam is based on the homework which she doesn't address at all in class. I wasted my time in this class, and now I'm discouraged to take another French class. \nWorkload:\nfour small quizzes, four compositions, a midterm, a final, a project \n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "May 23, 2009",
            "review_content": "\nProfessor Weems was such a relief. She is incredibly nice, and the best professor if you are taking french to fulfill the requirements. She is a lenient grader and well aware that this is not our only class. The workload was light but the quizzes and midterm/final were pretty hard. Overall, she is an extremely nice woman and does not want to make your life more difficult. If you want a fast paced intensive french course this is not it. \n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "December 19, 2008",
            "review_content": "\nWhat ever you do, do not take this class. It makes me cringe thinking of the time I had to spend sitting through it. Don't get me wrong...Erica is really nice and available outside of the class for help, but the class was a joke. Our \"conversation\" practice consisted of weird exercises that entailed you speaking with a partner about some famous person or painting or your vacation and didn't help at all. Erica was hard to understand, she muttered and I couldn't really hear her. The grammar was poorly taught, but the quizzes and tests were really hard and did not match the level of practice we had during class. Overall, I did not learn anything, and my regard for the language dropped.\nWorkload:\nPretty light...four compositions (Erica will grade them first then allow you to do corrections for a higher grade), homework (that you don't really need to do), two quizzes (w/ corrections), a midterm (w/ corrections), a theatre piece, and a final.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "December 14, 2008",
            "review_content": "\nErica is really sweet and tries to make the course interesting. If you took lots of French in high school this class will be boring, because most of it is review. She is not a harsh grader and allows you to do corrections for all quizzes, exams, and compositions to receive back half the credit you lost. A pretty easy course.\nWorkload:\nA few short readings, 4 compositions (one page), midterm, final (somewhat difficult).\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "February 28, 2008",
            "review_content": "\nProf. Weems is not only kind and fun, but a great teacher. Her classes are very organized so you can always know what to expect. People are impressed with the amount of French I have absorbed in just one semester. She gave me a very solid foundation that has served me well in French II. This class is worth getting up for. \n\nWorkload:\nAbout an hour study per day, Quiz on Friday.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 26, 2008",
            "review_content": "\nMaybe the last review caught her on a bad semester, or it was a long time ago, but I find Prof. Weems to be a very helpful, kind instructor. I've taken Elementary French with her for two semesters, and I've never found her to be curt, unresponsive or rude. On the contrary, she makes herself very available between class, the pace is just right (challenging but not overwhelming) and I find her very funny and nice. It's schizophrenic - I almost feel like we're talking about two different people. \nWorkload:\nquiz once a week, 1/2 hr to 1 hr homework/study a night\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "May 21, 2004",
            "review_content": "\nArguably the most lackluster TA you will ever have in a university setting. This class was the worst experience I have ever had. Erica's lackadaisical instruction matched well with her curt, obnoxious personality, making her totally unapproachable as an instructor.\nClasses consisted of 25-30 minutes of \"conversation\" to which she never payed attention, very vague overviews of grammar, and nothing else. She murmured for the majority of the class and gave unintelligible answers to student questions for the other part. \nTHEN she decided that she was entitled to benefits for the \"labor\" of her instruction and stopped holding class altogether. Her four week hiatus from the vacation that  was her class time only  agitated the antagonistic relationship between herself and the students that she had been building since the beginning of the semester. \nThe French Deparment should be ashamed for allowing an individual so obviously incompetent and so brazenly rude to instruct French at the intermediate level or the French language in general. \nWorkload:\n4 quizzes, Quia (on-line workbook comprised of material completely unrelated to syllabus of class), mid-term, final. \n"
        }
    ]
}