{
    "prof_info": [
        {
            "prof_name": "Stuart Gill",
            "prof_id": 2892,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 22, 2008",
            "review_content": "\nProfessor Gill was so nice and made class really enjoyable. He was very understanding and graded pretty easily. Overall, great section to be in!\nWorkload:\n1 individual assignment per week, takes about 45 min\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 23, 2007",
            "review_content": "\nWhen it comes to Frontiers, there are two types of students: students who hate Frontiers, and students who had Stuart Gill. That's all that needs to be said. If you get this guy, consider yourself EXTREMELY lucky.\nWorkload:\nTypical Frontiers work. Problem set/week, with a group presentation sometime later in the semester.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 23, 2007",
            "review_content": "\nWhen it comes to Frontiers, there are two types of students: students who hate Frontiers, and students who had Stuart Gill. That's all that needs to be said. If you get this guy, consider yourself EXTREMELY lucky.\nWorkload:\nTypical Frontiers work. Problem set/week, with a group presentation sometime later in the semester.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 20, 2006",
            "review_content": "\nStuart Gill is by far the best Instructor I had this year. He's extremely laid back and friendly, and thus easy to talk to and get to know. His class consists mostly of delving deeper into the lecture material and working on Habits-related problems. Usually in-class we don't do much work, just kind of sit-back and listen to him, with the occasional problem being done. If you answer wrong, hes completely cool with it. He also likes to joke around a lot and is actually pretty funny. His class actually requires THINKING and READING of the lecture/text materials, but you never feel like you're doing busywork and the laidbackness is totally worth it. You can often even turn in assignments late, and he lets you write a one page essay on the topic of your own choosing to replace one of the homework assignments.\nWorkload:\nAs with all classes there is a weekly assignment problem-set and a discussion question to answer along with a few additional readings. Assuming you do it all it amounts to about 2 hours a week of work, not much. The questions actually require you to analyze the text and think, but the upside is you never have to do busywork!\n"
        }
    ]
}