{
    "prof_info": [
        {
            "prof_name": "Gregory Baggett",
            "prof_id": 3237,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Latin American Civilization I",
            "review_date": "June 09, 2009",
            "review_content": "\nGregory is a demanding and thorough TA who is far more interested in encouraging independent thinking than letting his students slide with minimal effort. His sections are not for the faint of heart; if you are taking a class just to get a good grade and have no interest in thinking or learning about the subject material, you may find Gregory to be too intense for your liking. But if you are willing to put in the effort, do the reading, think about the material, and meaningfully participate in discussion, you will reap the intellectual rewards of working with him.\nHe holds his students to a high standard--rightly so, given the quality of this institution--and will always offer an objective, thorough analysis of your work. Sadly, Gregory seems to be one of a very small pool of dedicated, demanding TAs that help you get the most out of each class instead of facilitating an effortless, uneventful transition through the semester like many others do. You will get as much out of a class as you put in, and since Gregory pushes his students to put a lot into the class, his students tend to get more out of it. The more mental effort you put into section, the easier the class as a whole seems.\nWorkload:\nReally nothing outrageous in terms of quantity of reading or assignments. He is more interested in your thoughts and the quality of your arguments. Weekly section readings and a short (one paragraph) blurb to go with it.\n"
        },
        {
            "course_name": "Civil War and Reconstruction",
            "review_date": "February 09, 2009",
            "review_content": "\nGregory is, without doubt, the best TA I have ever had.  His mission is very simple: to make sure you learn.  To achieve this end, he will grill you and always make you justify your arguments completely.  For those of you who are offset by this, remember, you are at Columbia for a reason.  You are capable of learning if you put the effort in.  If you do not want to put the effort in, you are wasting both your time and Gregory's.  \nFor those interested in putting forth the effort, I can assure you that all your work will be fully rewarded.  All your arguments will be dissected objectively and you will receive excellent feedback that looks at everything from your initial thought process to the final product you hand in.  If you have been at Columbia for long enough, then you will realize how priceless Gregory's help is in this respect.  If you have not, take this class and find out!\nIn short, Gregory is demanding but rewarding - exactly as he and all other TAs/Professors should be.  \nWorkload:\nModerate.  Gregory is great at teaching you how to read a book in a day - so, while the reading list is heavy, he does an excellent job at ensuring you can distill important themese from a text without spending a reading it line by line.  \n"
        },
        {
            "course_name": "History of the South",
            "review_date": "December 27, 2008",
            "review_content": "\nThis man is crazy, and horrible TA, and down right cruel to his students sometimes. He made a girl in my section cry because she didn't have \"good manners\" when entering the lecture late. He devoted an entire section to telling us why we had \"bad manners.\" Sadly, he is not joking, and is dead serious. He will play favorites with the students, which can be nice if he likes you, but I got on his bad side early and it was down hill from there. It's not entirely clear to me why or how Gregory is allowed to lead sections as he is by far the worst TA I've had in the history department. Honestly, I have had great experiences and write very few negative reviews, but Gregory is a truly unique character. Steer clear if at all possible. \nWorkload:\nUnpredictable and unknown, depending mostly on how much he likes you. \n"
        },
        {
            "course_name": "History of the South",
            "review_date": "April 26, 2007",
            "review_content": "\nGregory runs a thought provoking and demanding section.  Discussions usually veer away from reviewing the lecture material to dissecting a fairly specific question raised by the reading.  Do the reading!  Gregory will not summarize it for you.  If you come to section prepared and interested, you will leave at the end of the semester with a complex understanding of the course material.  This section is more appropriate to history majors, but IÂ’ve known non-majors to find it fascinating.  If you are enthusiastic about learning, Gregory will be enthusiastic about helping you.  Meet with him outside of class early to discuss your paper topic: he can recommend sources off the top of his head.  He is also great at teaching how to write a history paper.  Hand in a draft and youÂ’ll get it back drenched in ink.  He runs extra review sessions before midterms and finals, meant to clarify the questions so that you can spend test time actually composing your thoughts instead of doing an information dump.  Exams are graded more honestly than most at Columbia in order to push you to do your best. To sum up, Gregory is definitely the most responsive, dedicated, and knowledgeable person IÂ’ve had the honor of studying with at Columbia.  \nWorkload:\nDepends on the course syllabus, but basically 1 book a week, a weekly reading response e-mailed to him before section, midterm, final, and 10-pg paper (hand in a draft)\n"
        }
    ]
}