{
    "prof_info": [
        {
            "prof_name": "Cristina Cammarano",
            "prof_id": 9681,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 29, 2010",
            "review_content": "\nCristina Cammarano is an excellent teacher.  She is extremely knowledgeable about classical literature and philosophy and always sparks interesting conversations in class.  Make sure you actually read the texts, she can tell if you are reading spark notes.  She grades fairly but she does have high expectations. If you want an A keep up with your reading, participate in class, and write thoughtful essays.  She is a philosopher so she is more concerned with the development of your ideas rather than nit picky grammar mistakes in your essays. Overall, Cristina's Literature Humanities class is amazing and I will miss her next year.  I have learned a lot from her so far. \nWorkload:\none midterm (10 fairly difficult identifications), two essays (4-6 pages) where you are given the topics one week in advance, and one course wide final exam (identifications, textual analysis, and an essay). not bad if you keep up with reading! \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 18, 2010",
            "review_content": "\nCristina is a wonderful person and adorable, but her timidity and slight language barrier prevent her from leading an interesting and productive lecture. LitHum was boring, which was unfortunate given Columbia prides itself in its LitHum department. Her inability to lead a good lecture was probably influenced by the language barrier-she was unable to understand grammatical sytax of sentences, which unfortunately actually keep her from understanding the true meaning of significant lines.\nIf you want to get anything out of LitHum, I would not recommend this class. If you fall behind in the slightest it is diffucult to catch up in this class. Class is boring eventhough she is nice and always willing to help out a student. Hard to get in contact with her, however.\n\nWorkload:\nWorkload: Very light, readings are long and heavy, but managable. Notecard that includes a question and quote for every reading and three 5-page essays-easy. Not very much deep analysis of the texts, which is disapointing.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 19, 2009",
            "review_content": "\nCristina Cammarano is delightful.  There is not too much work, except for about 2-3 papers, and an annual index card on which you have to write a question and a comment. \nThe thing about her is that she can recognize bullshit from a mile away--so if you're a suck up, or just not interested in the discussion, she will be able to tell, and she might tease you about it a little bit. Do not bring a full meal to class, do not bring your computer, and for the love of god, do not text.  She doesn't yell at anyone for these things, but she might joke around with you about it. \nShe's a native Italian speaker and knows a lot of Greek words, which is sort of cool in lit hum, because of all the Greek work. She brings in a lot of those terms. \nShe's mostly interested in students who are interested or appear interested in what we're learning. \nShe's very accessible and very sweet, if you're willing to put in a little effort. \nAs far as class dynamic, she does joke around a little bit. There is a little too much lecture for my taste, and you might not always leave the class very \"affected\" but she's very sincere.\nWorkload:\nPretty light considering Mark Lilla's lit hum.\nShe does expect you to work pretty hard on your papers, and if you've never edited before because you're a freshman, that might be a change. \n"
        }
    ]
}