{
    "prof_info": [
        {
            "prof_name": "Andrew Eisenberg",
            "prof_id": 1864,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 04, 2009",
            "review_content": "\nHe's really boring and has a clear contempt for people who do not embrace music in the same way he does.  If you do have some musical background though, he will turn to Jell-O at your feet and think you a genius.\nGood things: You don't have to make the field trip to the opera though, and your concert report can be about something on campus (aka something that's free and that you don't have to go anywhere for).  His midterm was a lot of definitions, but if you have music background, you'll most likely end up with over 100%.  If you don't, you can still get an A, just memorize.  Listening isn't bad at all on either the midterm or the final.\nWorkload:\nReading, not entirely necessary, but it helps to know the overall characteristics of each period because that helps on the exam.  Midterm, really doable; final, a little, little bit more challenging.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 25, 2006",
            "review_content": "\nDO NOT take music hum with andy. the LEAST engaging teacher I've EVER had. Spare yourself.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 23, 2003",
            "review_content": "\nThe two words to describe him are not engaging. He just simply does not seem interested to teach the course at all. \nI suggest you search for someone else. His exams, you never know what to study for.\nWorkload:\none mid term, one final, one concert report\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 17, 2003",
            "review_content": "\nAndy is fine. He's not great, but he successfully teaches the material. He will not be helpful out of class, or on the midterm and final, or on the paper.  He's also an enthomusicologist, which means he makes a lot of shit up about music's relationship with society. This wouldn't really be a problem, except that he makes you write a 6-8 page paper in which you make the same shit up. He's also into 20th century music, which is bizarre, 'cause it sucks. His class on Jazz was great. I kind of wish we did more.  you will not love the class, but it is not a bad way to get through music hum, and he really does know what he's talking about.\nWorkload:\nalmost no homework. midterm, final, paper. not bad at all.\n"
        }
    ]
}