{
    "prof_info": [
        {
            "prof_name": "Nan Rothschild",
            "prof_id": 450,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "The Origins of Human Society",
            "review_date": "December 16, 2003",
            "review_content": "\nRothschild is not an entertaining lecturer and her classes are very disorganized and hard to follow.  For subject material that is potentially fascinating, this class ended up being boring and annoying.  On a personal level, she seems nice, but I would not recommend this prof.  \nWorkload:\nlight, easy A\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "December 02, 2003",
            "review_content": "\nRothschild's culpa critics have got it wrong.  She is brilliant but quiet.  She does not show off, she does not try and talk above anyone.  She is a great teacher and one of the best people in the anthropology department.  \n"
        },
        {
            "course_name": "Colonial Encounters in North America",
            "review_date": "June 18, 2003",
            "review_content": "\nI had really high hopes for this class ... I was disappointed.  While there were some solid readings, there was also a lot on, say, teacups: Rothschild is by trade an archaeologist, and the class reflects this drab career choice.  The classes were not well directed, and we didn't engage the readings very critically because, well, teacups are boring.  Rothschild is a very intelligent woman who certainly deserves to be department head, but unless you dig up arrowheads for fun, skip this course.\nWorkload:\nOne big paper (15 pages, research), which was graded generously.  Sometimes steep reading; 150-200 pages/class was typical.  Not a hard course, as long as you start early on the paper.\n"
        },
        {
            "course_name": "The Origins of Human Society",
            "review_date": "October 17, 2001",
            "review_content": "\nOkay, she's not THAT bad. Not the best ever but not the worst either. And the class is not terribly challenging so if you need to take it don't be too upset.\n"
        },
        {
            "course_name": "Ethnoarchaeology of Cities",
            "review_date": "December 31, 1999",
            "review_content": "\nNan Rothschild is, hands down, the most boring professor I have ever had. Her lectures are unorganized and uninspiring, it is unclear how the readings tie into the larger class topic, and morever, it seems that she has little interest in/understanding of the readings she assigns. How she got to be chair of Barnard's anthro. dept. is beyond me. During lecture she seems to either be on downers or to just have awakened from hibernation. Avoid her at all costs. It's not even like she's nice or an easy grader. It is a mistake on all fronts to take this class.\nWorkload:\nFairly standard amount of reading, one midterm, one semester long project, one final. Expects little of her students but is not an accomadating professor, grade-wise or otherwise.\n"
        }
    ]
}