{
    "prof_info": [
        {
            "prof_name": "Fubing Su",
            "prof_id": 11224,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Chinese Politics",
            "review_date": "January 28, 2014",
            "review_content": "\nEh not the greatest. His class was okay because he is such a nice professor but he tends to let some students run the class just because they are the only ones that participate. The subject matter is quite interesting but the course material itself was nothing special so I have no idea why this is a 4000 level class.\nThe one thing that really bugged me about this class was that Professor Su only graded/read the grad papers. He left the undergrad grading to his TA and boy, she was the worst! She gave no commentary or reasoning behind her methodology for the harshly graded essays.The mandatory discussions, which was led by her, were an absolute disaster-- no one ever showed up and she's horrible at facilitating conversation. The excruciating experience of dealing with her has ruined the class for me.\nWorkload:\nMedium- lots of reading assigned; few to none were essential\n2 short papers\n1 final research paper (11-15 pg)\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 22, 2012",
            "review_content": "\nGREAT class.  It took place once a week for 2 hours, not nearly enough time to cover class materials.  On the first day of class, Professor Su informed us that he changed the course_name from \"Chinese Politics\" to \"Chinese Politics and Economics\".  While this was scary at first, one must realize that the two are inseparable.  \nEach week we would cover a new, and almost completely different topic on Chinese society, politics, or economics.  Sometimes the debates would extend to multiple weeks but each could largely stand on its own.  Su liked to split the class in lecture form (he wrote on the board) and student discussions.  The best part of the class was that it was mostly grad/SIPA students and students sent by their governments to learn more about China (Ex: some students were in govt ministries of Singapore, Japan, Korea, etc).  This gave an invaluable bonus to class discussions.\nTopics ranged from Why China didn't industrialize, Internet freedom, Fiscal federalism, Gradualism vs big bang economics, migrant workers, hukou system, etc.  If you don't like one week's discussion, there's no need to worry bc topics jump to all aspects of society.  I came away each week amazed.  You will learn A LOT about A LOT of things. \nThe best part is we watched youtube clips/ documentaries nearly every class.  But don't get me wrong, they were extraordinarily insightful and relevant to class. \nTL;DR: Take this class.  Fun, easy, little work, will get an A.  Take the time to talk to classmates and Professor Su\nWorkload:\nNot much really.  NO TESTS/ QUIZZES/ MIDTERMS/ FINALS.  There were only a few papers. Because of the mix of undergrads and grads, Professor Su gave different requirements to each.  \nTwo: 3 page papers on given topics (you have a few choices)\nOne: 2 page Response Paper of your choice to any article of your choice \nOne: 12-15 Research Paper on ANYTHING of your choice\nGrading was very liberal.  Professor Su loves discussions with students, especially in essay form where he can debate you.  \"A\"s were given all around\nDeadlines don't matter.  He'd rather you do a good job than turn in a hasty paper.  I never turned anything in on time (although I asked for extensions) and even turned in my final research paper 5 days after the semester ended.  No penalties, just let him know \n"
        }
    ]
}