{
    "prof_info": [
        {
            "prof_name": "Mari Webel",
            "prof_id": 2685,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "West African History",
            "review_date": "July 18, 2006",
            "review_content": "\n She is the best TA I have had at Columbia. The class had a lot of reading, and she was great about highlighting the key points from the readings as well as the lectures. Oftentimes, I find discussion sections a waste of time, but not with her. She definitely helped my understanding. She also had midterm/final reviews that were helpful, and she was always available to meet. She is a really great TA.\n"
        },
        {
            "course_name": "History of East Africa 1850-Present",
            "review_date": "May 06, 2006",
            "review_content": "\nIf it wasn't for Mari i would have been so much more lost in this class than i was. the professor was very confusing and mari was completely available and helpful. she is so on the ball and really invested in helping her students. She is also very nice and approachable. I had never had a TA before who actually seemed to add to the class and really play a role.\n"
        },
        {
            "course_name": "West African History",
            "review_date": "April 06, 2006",
            "review_content": "\nMari is really a great TA.  If you are taking this course with a spotty African background, the lectures can at times be frustrating.  Mann has a de facto fan club in the first three rows who have taken African Civ and whatever else he teaches, and you may feel like you're crashing the party by asking a basic question, but Mari synthesizes key points, fills in gaps, and recaps the info that is relevant for the purposes of the class during section.\nIf you haven't done the reading, you're screwed because she'll call on you if you're not talking.  Very fair grader, available for office hours, accessible via email, and generally enthusiastic about her work.  She takes it seriously and expects you to as well.  Don't need to be a freak genius, just willing. \nWorkload:\nLots of reading every week, typical history midterm (id's and choice of the same essay question stated 3 different ways), research paper on any aspect of w african history you are interested in.  Not a cake walk course, but ultimately rewarding.  Mari's a great choice.\n"
        },
        {
            "course_name": "West African History",
            "review_date": "December 07, 2005",
            "review_content": "\nMari is a terrific TA.  In a class with often diffuse lectures, her section would always clarify any confusion.  She always began section by opening it up for any questions specifically about the lectures, and she would then gradually delve into the week's readings through a series of questions that were gradually more difficult and thought-provoking.  Beware, however, that she will call you out on the spot to participate if the discussion is lulling.\nIn addition to being a very effective nuts-and-bolts T.A, Mari was also patient, kind, and willing to go far out of her way to help students out.  As a veteran history major, I have learned that it is truly a rarity for a T.A. to sincerely (i mean really) care how her students do in the class.  Mari does.\nShe's a fair grader, and her comments are always helpful.  You can't go wrong with her as a T.A.\nWorkload:\ndefinitely be familiar with all of the readings before you come to section.\n"
        }
    ]
}