{
    "prof_info": [
        {
            "prof_name": "Pierre Force",
            "prof_id": 22,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "The French Philosophical Tradition",
            "review_date": "May 29, 2010",
            "review_content": "\nThis was one of the worst classes I've taken at Columbia. Prof Force spends the entirety of the class going over what was said in the texts we supposedly read. Not only did this make for incredibly boring lectures, it also encouraged us not to bother with the hundreds of pages of dense philosophical texts (why bother reading them, if he'll tell us what's important anyways?) --which of course makes his lectures all the less interesting. There was never any sense that we should, say, care about what these authors had to say, beyond simply being able to regurgitate Force's ideas for the papers and exams. He is fairly specific in what he wants to hear, and doesn't encourage much independent thought. Definitely look elsewhere if you're hoping to actually learn something and be interested in the material.\nWorkload:\nAbout 200 pages of (fairly difficult) reading, though you can more or less get away with not doing it. Two papers, a midterm and a final which are pretty easy if you know exactly what he wants to hear.\n"
        },
        {
            "course_name": "The French Philosophical Tradition",
            "review_date": "May 20, 2010",
            "review_content": "\nA truly wonderful professor! He takes a syllabus of sometimes complex and confusing major works of French philosophy and breaks them down very well. The works are well-chosen to be in conversation with one another and his enthusiasm encourages participation by those students who have bothered to do the reading. His grading is fair and straightforward, as are his expectations. He cares about each of his students and that everyone engages with the readings, even when they are long and dry. The reading can be a bit heavy and complex, but his expectations are overall realistic and you will come away from the class with a great background in the overarching themes of French philosophy. Recommended!\nWorkload:\nRoughly a book a week to read, two papers (one 4-5 pages, one 5-6 pages, with topics assigned well in advance), a midterm, and a final\n"
        },
        {
            "course_name": "The French Philosophical Tradition",
            "review_date": "May 19, 2010",
            "review_content": "\nPierre Force is a very knowledgeable professor. He clearly knows these philosophers really really well, and as the chair of the French department, he also knows Columbia students really well. Thus he did an extremely good job of bridging the gap between what the students got from the text, and  what the texts were actually about. I really liked how he explained the complicated nuances which were clearly over everyone's heads (either because they didn't do the reading at all, their French wasn't that great or because complicated old French is just plain hard for anyone). He would do a close reading of like two sentences for an hour and keep it interesting and relevant, which made me realize how rich these texts are, how great a syllabus this is, and how much is lost on me when I read this stuff on my own. \nHe's extremely professional - in a good and bad way. He's really impersonal. He barely learns anyone's names. It's all business, no joking. And he's really abrupt in beginning and ending class. It doesn't seem like he has much of a desire to be there, but he gets the job done. That said, he's a very generous grader, and doesn't penalize you for bad grammar or anything like that. He definitely knows the texts through and through (way more than any undergrad will ever know), so for him there is definitely a right and wrong answer. His questions are straightforward and your grade will reflect the extent to which you answered them right. \nWorkload:\nPaper 1: 15% (4-5 pages)\nMidterm Examination: 15%\nPaper 2: 20% (5-6 pages)\nFinal Examination: 30%\nClass Participation: 20%\nIf you don't do all the readings, it's not a huge deal as long as you find a few semi-intelligent things to say during class. Most people are either native French speakers or are at least pretty fluent though, so it might be a struggle if you don't have a really good grasp of language. \n"
        },
        {
            "course_name": "The French Philosophical Tradition",
            "review_date": "September 04, 2005",
            "review_content": "\nProfessor Force is a very good professor.  He has an impressively extensive knowledge of the texts he teaches, and does a good job of explaining the texts' nuances to students who are not native speakers.  He does a good job leading discussions, though these discussions tend to result in his explaining the text straight-out, because the majority of the students in the class really did not understand what they read.  Still, he stays patient and professional.  He is a fair grader, and in fact I think he graded me better than I deserved.\nThe class itself has a lot of reading, often in old and complicated French.  If you can deal with that, though, it's a very interesting class.  I'm an engineering student with very little background in philosophy, and I still enjoyed the class a lot.\n\nWorkload:\na good amount of readings, two papers (5 or 6 pages if I remember correctly), midterm, and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2004",
            "review_content": "\nEasy CC teacher, which is extremely hard to find. Force gives smaller reading selections than most other professors, which is pretty nice. Class consists of passage analysis around the important themes of the book. Force has a clear grasp of the philosophy in each book, but rarely elaborates on more than the basic prinicples.  Paper topics aren't too focused, but they are definately managable.  The midterm and final are basically a review of the passages analyzed in class. Easy, enjoyable, and recommended professor.\nWorkload:\nMidterm (just passage analysis) Final (passages and essay), nightly readings and VERY EASY pop quizzes\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 16, 2003",
            "review_content": "\nInteresting man. He tries to be somewhat entertain and I personally appreciated his efforts especially with such dry material. He does a pretty thorough job of explaining the important themes of the book. Pretty easy class\nWorkload:\nnightly reading, not too heavy (actually less than most other CC classes) 2 papers 4-6 pages, midterm and final\n"
        },
        {
            "course_name": "Moliere",
            "review_date": "May 19, 2003",
            "review_content": "\nThis is quite a fun class. Moliere's plays are a quick and fun read. Although you don't have to talk in class, everyone reads aloud from the plays making it more interactive. Prof. Force is quite easygoing and can be quite entertaining at times while acting out parts. \nWorkload:\nTwo 4-6 page papers, midterm, final and 2 in class presentations of scenes from the play. Fair grader.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 07, 2002",
            "review_content": "\nDo not take this class if you have any interest in contemporary civilization. You won't learn anything more than you could learn from leafing through a textbook for a few hours. \nWorkload:\nEasy.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 05, 2002",
            "review_content": "\nProf. Force is clearly a very intelligent and articulate man, he's just not the most charismatic speaker in the world. He tries very hard to make sure everyone gains a thorough understanding of each text through monotonous discussions of specific passages. Many long silences followed after his posed questions, and many fell asleep. I didn't mind him too much though, being the science person that I am.\nWorkload:\nMedium. One midterm, two 4-6 pg. papers, and one final. No ID's on exams, that's a plus, but paper topics were rather vague.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 02, 2002",
            "review_content": "\nThe pros and cons of Professor Force's CC section are pretty clear. He's a pretty brilliant guy and definitely helped me to gain a good understanding of the texts. He's not a particularly difficult grader either, and the midterm and final are very straightforward. The bad side of all this is that class is not particularly thrilling. Every class is spent in essentially the same way: going through the books reading aloud and briefly analyzing specific passages. He certainly tried sometimes to encourage more discussion but rarely did it ever catch on particularly well. Basically, the fact that he sticks close to the text leaves with a great understanding of the books...assuming, of course, that you can keep your eyes open...\nWorkload:\nTwo short papers (4-6 pages), midterm (analyzing 5/8 short passages in the manner we did in class), final (section like the midterm plus an essay). Reading assignments tend to be a little longer than most sections, though generally reasonable.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 19, 2002",
            "review_content": "\nProf. Force doesn't like suprises. He outlines the structure of his class on the first day, which includes discussing several passages of you night-before assignment, and sticks to it for the rest of the semester. He's pretty boring, but straight-forward and intelligent. You'll get a nice, predictable analysis of each CC text.\nWorkload:\nPretty easy. Two papers, a midterm and a final. Fair grader. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nAlthough dry and disoriented at times, he manages to present interesting ideas. Tries to encourage class discussions but most questions are either confusing or self-evident, so there can be some long awful silences until someone finally says it -- 'Umm, what do you mean by the question?' Easy grader. You won't be riveted, but you'll pick up a fair understanding of the readings.\nWorkload:\n2 papers, Midterm & Final exams.\n"
        }
    ]
}