{
    "prof_info": [
        {
            "prof_name": "Robert Lipshitz",
            "prof_id": 3038,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "January 06, 2011",
            "review_content": "\nLipshitz's calc III class started out really easy and entertaining, with him giving great explanations of vectors (dot product, cross product), and cylindrical and spherical coordinates. Also enjoyable were the lectures on linear algebra near the end of the semester, of which his notes were amazingly helpful and organized.\nHowever, he did not do an excellent job covering multi-variable differentiation. I personally do not mind the focus on rigor, but his proofs turned out to be somewhat handwavy and hard to understand at times. Furthermore, his lack of examples for  taking limits in R^3 and his over-obsession with geometric visualization and interpretations of results killed almost all of us on the second midterm (the avg was a 55/75!!!). Matching 3-dimensional graphs with their corresponding equations would not have been too bad if the quality of the pictures were better than the crappy black-and-white photocopies provided. Also, his attempt at placating the stupid economics majors made him spend way too much time explaining Lagrange multipliers when he could have covered the theory behind the the chain rule better.\nHowever, he is a very friendly teacher who is willing to help and will always put on a nice cute smile, treating his students with respect and dignity. Office hours are a wonderful resource, so take good advantage of those.\n\nWorkload:\nHomework (30%) - long and painful\n2 Midterms (20% each) - first one was simple and straightforward (class avg: 65/75), but the second one was a nightmare, as noted above\n1 Final (30%) - tricky and challenging, but actually doable, although the average was still quite low (somewhere between 100 and 110 out of 150)\nGREAT curve!!!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 29, 2010",
            "review_content": "\nCulpa is disgracing itself by downgrading Lipshitz to a silver nugget. The last review is completely inaccurate. My RA (a music major and definitely not a math junkie) took his linear algebra class and had great things to say (he rambled for 40 minutes about lipshitz on the first day of orientation (yes, that's how good he is)), which is what got me to sign up for his section. Needless to say, best course I've taken at Columbia thus far. It's the only class I never skipped whereas I went to this semester's linear algebra class twice all semester (sidenote: if you ever have munteanu for lin alg, you're better off skipping).\nLipshitz is concise with his explanations, and will solve every type of problem that might show up on the homework and midterm/final during class. He does sometimes move a bit too fast, but you can usually figure out what he did in your notes after class even if it's a bit confusing during class. However, since he explains the material so damn well, it rarely is confusing. And when it is confusing, he encourages(scratch that; begs) for questions to be asked. He'll spend at least 2 minutes answering a question (no matter how dumb) usually providing multiple explanations and drawing diagrams. That at times could get annoying, but it's undoubtedly a good thing.\nHis problem sets are slightly longer than standard length, roughly 10-15 textbook problems + 2-5 of his own, but he often assigns odd problems and all of them are doable. aka, he never assigns problem #78 proofs or those eight-part word problems.\nLipshitz, unlike many other Columbia math professors, is in tune with how a student perceives various topics. He knows that most students hate delta-epsilon proofs (he tells 4 inspiration stories(seriously), creates a delta-epsilon game, offered additional office hours for the two lectures on delta-epsilon, and made the delta-epsilon proof on the midterm the easiest form possible), he knows no one actually remembers the order of the quotient rule, that we hate the chain rule, and that we like it when things magically cancel out. It's perfectly possible to get 100% on his midterms, though naturally difficult. What I mean by that is that the problems are medium versions of what he solves in class, but there won't ever be one of those 22 variable equations with eight lemmas to a proof type of monster problems that only the 4.2 asian geek gets.\nSpeaking of proofs, except for the delta-epsilon stuff, which was a pain, he skipped all the multivariable that had proofs in them, and (except for the d-e stuff, never had a formal proof on his exam except for some very basic linear transformation stuff)\nLike an earlier reviewer said, he's a very petite man, very amusing, and he will stop in the middle of the class to wander off joking about his high school/college days. His ummm that he mutters is quite possibly the cutest human sound ever uttered. It's really hard to describe, and I know this sounds so weird, but it makes class so much more enjoyable. (hearing his ummm, as well as sala-i-martin's suits, 53rd st. chicken and rice, the varsity show, and bacchanal, are necessary for any columbia experience to be complete) He's really amusing, and just watching him mutter his ummm, while waving his tiny hands is worth attending class by itself. \nHe's so down to earth, he's really friendly, will poke fun of himself a lot to make us feel better, and will describe parts of his work when it relates to the class (not like other professors, who'll just randomly go off on 30-min tangents about how impressive they are). I guess one way to describe him is as a helper elf (he's tiny, watching him carry a stack of all 120 midterm exams all by himself was pretty funny)\n. \nAlso for the final, he spent a class writing down every single possible topic that might show up for the final. Some people (rather rudely) asked him whether certain specific things would be on the final, and lipshitz, unlike 99% of other professors, actually gave a straight answer whenever possible, which shows to his reasonability and kindness.\nAnyway, I'll just spend the rest of this review ripping apart what the person below me wrote. To the person: if you ever read this, no offense dude, but you're wrong.\n1. the problem sets are impossible to do without copying\nI never copied, i did them alone, and I had a roughly 95% average for hw's. (another side note: don't do them the day they're due, I averaged around a 70% on those; duh) I have a 3.5 right now, so while i'm not dumb, i'm not one exactly a genius either.\n2. lulled into a false sense of security for the first midterm\nprobably the person's truest statement, the first midterm was really easy, 9% mean, I got a 97%, and I definitely didn't study as much as i should have for the 2nd midterm. though that's my fault, not lipshitz's\n3. 2nd midterm, 55% mean\nthe median was a 55/75 according to the email lipshitz sent out (btw, he sends out 1-2 emails a week with hw corrections/hints, general advice, etc.) Do the math to find that percentage, if you can't, then maybe follow the below person's review.\n4. final 30-pages.\ni don't know if he/she's intentionally exaggerating or not, but given the stuff the person said earlier, he might just be delusional. For the record, the final was 10 problems. Maybe he had extra scratch sheets stapled to his final?\nThe class is not easy, but I also feel like if I put the effort into the course, I could have gotten an A or A+. (plenty of people got an A or A+)\nAnyway, I originally wasn't intending on writing this review seeing as everyone else idolizes him. But I feel really, really (1000 words) strongly that he's absolutely one of the most superb professors at Columbia and that anything less than a gold nugget is an injustice.\nFor the record, I got an A- in the class.\nWorkload:\nWeekly problem sets, roughly 4 hours per pset, get to drop one. HW: 30% First Midterm: 20%, easy, Second Midterm: 25% medium-hard, Final: 25% medium-hard, 70% mean.\nExams consist of matching graphs with equations, some T/F questions where you have to add an explanation, and some problems. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "March 26, 2010",
            "review_content": "\nRobert Lipshitz is a very nice man. He has a cute smile, a nice hairdo, and some very colorful shirts. He's very friendly, outgoing, and eager to help you whenever you need any assistance. But don't let any of this fool you. DO NOT TAKE CALC III WITH ROBERT LIPSHITZ. I know, I know, he has a gold nugget and that's really cool, and it's actually what enticed me and my friends to take his class in the first place. We all readily agree that it was the biggest mistake of the entire semester, and was probably the biggest mistake of my life. I sat through that class each lecture and understood probably 25% of it. Maximum. He's ridiculously brilliant and tries really hard to help you understand, but it just doesn't click. There are portions of the class who are apparently naturals at this stuff and got it right away, but the overwhelming majority of the class had no idea what was going on. At all. The problem sets were ENORMOUS and often impossible to complete without asking for help/copying from four other people. The worst part of the whole deal was his examinations. You got lulled into a false sense of security after the first midterm because it wasn't too hard. Then he smacks you over the head with the midterm of doom, a test on which the class mean was barely above a 55%. The final was even worse, a 30-page monstrosity that was described by Lipshitz ex post facto as \"really quite difficult.\" Uh, yea. The most frustrating part was that by the time the final rolled around, I knew all of the material cold (after 20+ hours of studying and much help from Cramster, Stewart, friends, and the answer key) and I still could not muster anything close to a good grade with Lipshitz and based on the difficulty of the other classes' exams, I probably could have gotten a whole grade higher elsewhere. So I repeat DO NOT TAKE CALC III WITH ROBERT LIPSHITZ. I regret the day I stepped foot in that class, and unless you are a math genius, so will you. Just take Lauda (or anyone else). Please.\nWorkload:\nWeekly SUPER LONG problem sets (30%) that take hours to finish. Two midterms (20% each) and a god awful final (30%). Please save yourself some trouble and don't take this class with Lipshitz.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2010",
            "review_content": "\nThis was Professor Lipshitz's first time teaching a Calc 3 course, as he usually teaches higher level courses. From his lectures, you can tell that he is extremely smart and knows what he is doing. He is a great professor that really cares about his students. His lectures can often be confusing and fast-paced, but it is only because he likes to challenge his students. Don't be afraid to ask questions during class. He encourages it and is excellent at clarifying things.\nThere were 2 midterm exams, each worth 20% of your grade. The first midterm was pretty easy, while the second one was much longer and more challenging. \nThe weekly problem sets were worth 30% of your grade and were usually pretty long; you really need to put the time and effort into them to get good grade. They are challenging, but you will find that the problem sets prepare you well for his exams, with the exams being even slightly easier than the homework.\nThe final exam, worth 30% of your grade, was extremely long and challenging, but it fits right in with him loving to challenge his students. It was still a fair test.\nProfessor Lipshitz is a petite man, but is a great professor. It is no surprise he has a gold rating on CULPA. I would highly recommend him to anyone.\nWorkload:\nWeekly problem sets - long and challenging, but doable and will prepare you for tests.\n"
        },
        {
            "course_name": "Honors Linear Algebra",
            "review_date": "March 25, 2009",
            "review_content": "\nI took the course Honors Linear Algebra with Prof. Lipshitz last semester and he is one of the best professors I know, in terms of technical competence, dedication and care for students. \nIn my years of  schooling, I've come across dozens of highly qualified professors.  In  terms of professional knowledge, Prof. Lipshitz is one of the best.  He is very well prepared for each lecture, actively solicits questions from students, answers clearly and thoroughly, and conducts highly engaging office hours in which he goes over additional problems.\nIn answering students' questions, he's able to emphasize with their point of view, try to understand their point of confusion, and explains patiently using diagrams, formulas, and additional life examples.  He holds two hours of consecutive office hours, and often has to answer the same questions repeatedly to different students.  I noticed each time, he's very patient, as if it's a new question. His office hours are often entertaining, as his personality shines through and he engages students with humor, anecdotes, and knowledge. But most importantly, what has touched me most is Prof. Lipshitz's amazing dedication and care for students, which surpass most if not all teachers I have met.\nHe clearly cares a lot for the welfare for the students.   From the onset of the lectures, he encouraged students to participate and ask questions.  Because he's highly personable, he tells students stories of his mother being a teacher who encourages students to break silence, and fear of asking question.  I remember his saying that his mother would ask students to do jumping jacks if the class got really quiet.  It made us laugh and soon, the class became more bubbly.\nAnother time, to experiment with more active participation, he passed index cards to the class, and asked each student to write down a question or two based on material he just transmitted.  Then, he asked students to pass the cards to one sitting next to them, and have the neighbors ask questions instead.  This was a very intelligent way for people bypass the barrier of fear and have their questions answered.  As a result, more information was transmitted in the class.\nIn the beginning of the class, after the first two assignments, he passed index cards asking students to write down the number of hours they spent on each assignment, anonymously, so he would get a more accurate assessment for the course load.\nFor me, Prof. Lipshitz's encouraging and highly affable manners are certainly a catalyst to participate more.  In the beginning, I sat in the front of the class and wasn't much interested in participating.  I just wasn't used to the behavior of active participation, and certainly felt more self-conscious.  But his sincere and continuous encouragement prompted me to break out my shell and try a different learning style by participating more.  I was able to carry this style to another math class.\nI also remember going to his office hour for the first time, several weeks into the semester.  Again, I had not been used to going to office hour.  There were a few of us, and we were all a bit quiet in the beginning.  Prof. Lipshitz broke the ice by saying that he knowsit can be a bit intimidating asking questions, but that there's no dumb questions and we should not worry.  Again, that helped us break the silence and allowed out to come out of my mold.\nIn lectures, he asked us to submit 3 reading questions in the beginning of each class.  Then, he would answer these questions and pass back the next class.  I'd imagine this must be a lot of extra work, since there were probably bit over two dozen students, with 3 questions each.  He said when he learned math, he often wrote down questions during reading, which helped him pinpoint points of confusion.  I followed this suggestion and realized that by writing down questions, somehow, the process of learning moved along faster and built up more momentum.\nHis caring ways really showed through when during our first exam, he came in with bags of two types of earplugs, asking if any students wanted them.  This has never happened in my entire educational experience.  I often use earplugs or headphones when walking or at home, in order to concentrate.  So, I asked for both types to try.  When I got home, I was so touched by this incident, I told all my family and friends.  I think Prof. Lipshitz really cares for his students and went out of way to make sure they experience less stress and distraction during exam.  I know this story also traveled to students outside of the classroom.  During one math department gathering for undergrads, I remember chatting up with a student from another class who also heard this story and was touched by his caring ways.\nIn our final exam, Prof. Lipshitz brought in home-made cookies to cheer up the students.  Again, it was a very nice and pleasant surprise, and it made students chuckle and relax a bit before the final.\nThere were just many little things he did that showed how sensitive and considerate of a teacher he is.  He told us several times about the math undergraduate seminars whose topics might coincide with the lecture material, and encouraged us to go.  Also, to make our learning more tangible, he prepared one lecture on the math model behind Google's search engine.  By the amount of participation in class, I think the other students really enjoyed this application-based lecture.  I also remember all the times I emailed him asking questions about the course, clarification on homework assignments, and advice for future coursework.  He always answered promptly and thoroughly.\nSince I'm a beginning student in math, I can only comment on Prof. Lipshitz's professional knowledge based on what I've learned in class.  But even so, it's clear to me that Prof. Lipshitz's knowledge and intelligence is world class.  This is because through my educational experience, I have been very fortunate to have interacted with many very qualified teachers who are world class in their respective knowledge, and feel I have a reasonable sense for someone's level of technical competence even though I may only be novice.  Compare to these professors, Prof. is most certainly in the same league.\nI also hope I've been able to communicate to you Prof. Lipshitz's highly caring, personable, dedicated teaching style, and very effectively communication on a subject that's often daunting to students.  He's able to somehow melt down the menacing austerity often associated with the study of math, and convey the subject in a more intuitive, approachable, and engaging manner.  And this ability to communicate and engage through a combination of intellectual empathy with the students as well as personal attributes is highly rare.  I think I can confidently say I have not encountered this combination in my post-high school education, and I think Prof. Lipshitz is an amazing teacher.\nAnyway, through conversations with other students, I know that many also share similar feelings about Prof. Lipshitz.  One girl who goes to office hour often told me she went because \"it's just amusing\".  Another said that it's clear Prof. Lipshitz goes out of his way for his students.  I hope that they have written to nominate him as well, and hope that his excellent teaching abilities are reflected in the course review students have filled out.\nHaving taken Prof. Lipshitz's class, I've become more knowledgeable about math, more confidant in my ability, have greater awareness about how to study and interact in classroom.  And most certainly, if I ever teach someone else on any subject, I'll try to remember Prof. Lipshitz' ways of reaching out to students.\n\nWorkload:\nfine\n"
        },
        {
            "course_name": "Topology",
            "review_date": "January 13, 2009",
            "review_content": "\nLipshitz is AMAZING.  His lectures are entertaining and informative, and responsive to the class - he is very fond of taking a sip of tea to give everyone a chance to catch up in their notes and to give him a moment to look out and assess whether he is going too fast and people are confused or too slow and the class is turning into cucumbers.  Then he adjusts accordingly.  Lipshitz's lectures are very clear and he has a gift for communicating difficult concepts in simple, easy to digest ways.  He obviously cares a lot about his students and whether they are learning or not.  To this end, he tried an interesting experiment: the Big Problem.  This was designed as a sort of \"math paper,\" where each student had to choose a somewhat difficult (harder than a homework problem but by no means impossible) problem from a list he gave us at the beginning of the semester and then prove it and write it up in a sort of formal way.  This was a little bit frustrating, but on the whole worthwhile, and I think if he does it again he will improve that particular assignment.  To close, I agree with the other reviewers that Robert Lipshitz is if not the best, certainly one of the best professors currently teaching at Columbia.  I would take any class he teaches.\nWorkload:\nWeekly problem sets, one midterm, the Big Problem, and a final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 07, 2007",
            "review_content": "\nI totally second the opinion of the first reviewer.  Robert Lipshitz is a pleasure to learn from.  It is clear that he really cares whether the students learn the material.  He is extremely nice and very approachable.  The students who transferred out of his class in the early going should regret having done so.  His first couple of problem sets were way, way too long, prompting mass defection of students, but, after the remaining students complained, he paired the problem sets down to a reasonable length.  He wasn't the easiest professor I've ever had, nor the hardest, but struck a good balance so that you were challenged but not overwhelmed and discouraged.  If you did your homework and attended class you would be prepared for his exams, which were fair, and I would say of about average difficulty compared to other math professors' exams.\nIf you have a chance, take this guy!\nWorkload:\nWeekly problem sets, two midterms, and a final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 07, 2007",
            "review_content": "\nLipshitz LOVES linear algebra. Like the poster next to me, I found Lipshitz to be the best Math teacher I took at Columbia. It was his first semester, straight from Stanford. He's a man of small proportions but his passion for linear algebra is anything but small. Now LinAl as I like to call it isn't really a class anyone looks forward to taking. But Lipshitz does the best job to make this sometimes boring material interesting. He does encourage his students to participate and does answer ALL questions from the suck up questions regarding future material and to the slacker questions that you should have known 2 classes ago. He just wants you to learn the material.\nSaying he's organized is an understatement. The guy loves using courseworks which is great because I'm one of those people who check courseworks every time I'm on a computer. He posts lecture notes (very helpful supplement to the book when doing  the HW), grades a week after their due, and a simple syllabus. But the best thing is that whenever he updates CW he writes what he updated under the Intro section. How many times have your profs  updated CW w/o telling exactly what changed, leaving you to stumble through the Lecture or Syllabus or Grades changing wondering what was changed?\nNow, as the other reviewer did, I'll say something about the negatives of this class. With Lipshitz's ability to make the class pretty interesting and his outstanding organizational skills comes hard HW. Notice the other reviewer liked to start the HW's early. I would've liked to start early, too..  but I can't ever do that. I'm one of those people. I started the Monday before it was due and it would take me from 7pm to 4am to finish them sometimes (working slower as I got more tired and sleepy).  It could take anywhere from 5 to 12 hours and on average 8 or 9. \nWhy was the HW so hard? Lipshitz loves proofs which aren't too easy. And the \"simple\" computation problems are cooked (he loves this word) so that they're not so easy after all. The book that we use (LEON) is terrible and I found myself using MIT's online lectures (recommended) and Google (good luck) often to find solutions to the problems.\nI'm not a math major and LinAl is never going to be more than a tool for me but I stuck through the class. Half the people from the first day dropped - I'm not kidding. So the class became self-selective and the curve put me in the middle or even slightly above.\nIf you're tired of not learning anything and you want to remember something a week after the final, take this class. Linear Algebra has TONS of applications and we talk about some (Google Pagerank). Lipshitz is the best  Math/Sci teacher I've had here.  Start the HW early if you can (some people really can't). I'm sure you'll do fine . It's not as much of a terror as I made it out to be. It's just a class called Linear Algebra made me automatically think it was going to be one of the least priority classes that semester when I should have made it a higher priority.\nWorkload:\nHard HW's every week (read above more detail) except the weeks of exams.\nThere are 2 Midterms and a Final. To make grading easier and more objective Lipshitz makes the exams have simple answers (yes, no, numbers, a matrix, etc) instead of proofs or short answers. That way you're either right or wrong. I like this method (did I mention no proofs!). The exams ARE much easier than the HW but there's still a lot of material and you'll sit through the whole time. Plus the class is prepared for the material after those dreadful HW's so it's not much of an advantage.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 23, 2006",
            "review_content": "\nProfessor Lipshitz is outstanding. He is a phenomenal lecturer; if you go to class, you won't need to study to understand what he says. He is perfectly clear, answers all questions extremely thoroughly, is very accessible, and is glad to help. He is very bright; you can ask him anything and he'll give you a very to-the-point answer. Mathematics is difficult to teach, but Professor Lipshitz has a talent for it. I would not only recommend him, I would strongly suggest him.\nLipshitz's problem sets are EXTREMELY difficult, but his tests are VERY easy. He also grades very generously. With these facts combined with his superb lecturing, you'll come away with both an in-depth knowledge of the material and a good grade. If you listen to his lectures, you'll be able to do the problem sets, and if you do the problem sets, the tests should be simple. The problem sets will grill you on the mechanics of solving different problems and really make sure you know your linear, and his tests are very conceptual and make sure you \"get it\". Putting both together, you'll come away from Lipshitz's class on top of your game.\nOur class ended up finishing the textbook pretty quickly and then went more in depth going entirely off of his lectures (i know it might sound scary to not have a textual reference, but he posts his lectures online, too). However, though I think we tackled much more than other linear classes did, it was very manageable with the strength of Professor Lipshitz's explanations. If you take his class, you'll end up with a greater knowledge of linear than the syllabus suggests.\nOn top of being a great lecturer, professor lipshitz is a downright good guy. You can tell that he's a true math dork, and its very endearing. He's kind, apologetic, friendly, and approachable. Much of what he does is comedic, though I don't know whether he intends it to be; his quirks and mannerisms add entertainment to his enlightening lectures. To him, certain theorems are \"miracles\", and certain proofs are \"beautiful\". Its tough not to love him. Take a class with lipshitz while you're at Columbia.\nWorkload:\nvery difficult problem sets (weekly), very easy tests (2 midterms and final). Everything is graded generously. You'll do fine, and you'll learn TONS.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 27, 2006",
            "review_content": "\nWow. This guy is awesome - the best math professor I've had at Columbia by SO far. He's a young guy, not a full professor yet, but don't think that that detracts from his teaching. He explains everything beautifully, from involved examples to complex proofs. He's always prepared to answer questions, even if the question is only minimally related to the material we're learning. He simply wants to share his knowledge of math with anyone interested, and it seems that he is really rooting for everyone to understand the material. He genuinely loves math, and he clearly wants to pass his love down to his students. Also, he's VERY organized, and always has the problem sets posted online over a week before they are due (before he goes over any of the material they cover). I personally find this very helpful, since they take a while and it's nice to be able to get an early start. Finally, he's pretty much the nicest guy ever. He's extremely approachable, he jokes with the class often, and I get the feeling that everyone in the class really really appreciates him.\nThat said, the class isn't easy. The computational stuff is fine, but Lipshitz goes beyond that and delves into the theory behind the computation. He does make a lot of the more proof-based problems on the homework optional (for up to 5% extra credit at the end of the semester), but you will be required to really think about why/how things work. If you're going to take linear algebra anyway, might as well come away really understanding it! In my opinion, he strikes the perfect balance between challenging theory-based problems and more computational, easier problems. If you've never taken a proof-based class before, don't let this scare you! It was my first time, and I certainly feel that I've come away with a greater appreciation for math. \nWorkload:\nWeekly problem sets (long if you do all the optional problems but probably 2-3 hours if you don't), 2 midterms (very fair / easier than the problem sets), final\n"
        }
    ]
}