{
    "prof_info": [
        {
            "prof_name": "Rebecca Dean",
            "prof_id": 1964,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 21, 2004",
            "review_content": "\nBecky Dean is a very nice woman. But she's too nice. She goes along with everything you say in class, but behind the guise of the red pen she is far different. Class time is spent going around the circle and inputing a worthless affirmative or negative or going around the same circle adding another point to the list on the blackboard. It's painful, boring, and not at all thought provoking. The time spent in class with Becky is pointless and a total waste of time and money. Her grades are unrealistic and diluted, with everyone receiving grades mainly of B or close to B. Her comments on papers are concerned mainly with MLA format or misuse of colons, and her grades are arbitrary and defended only by generalizations that can be found on your classmates' papers as well. Becky is a safe and nice teacher, but she is a bad one.\nWorkload:\nAbout 5 short essays right in the beginning of the class that in the end mean nothing. Write them right before class just to have something to hand in. 4 other large essays which make up your grade in the class. Write the essence of your paper very simply for Becky and do it on an easy topic. Any attempts at being creative or writing on a controversial or difficult topic will not be rewarded. Class participation means nothing in the end because Becky wants to be nice to everyone. Give in to University Writing and get an A, or try to be creative in the class and get something lower.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 19, 2004",
            "review_content": "\nI'm so glad that's over.  This class was so bad it makes me laugh.  We freshman were eager to get to our (for some) first class at Columbia way back in September, so all of us whom were early didn't notice that the teacher was sitting there because of the awkward silence.  One student even sat next to Becky and commented on the awkward silence and Becky concurred.  What a way for the class to begin! The truth is, the class would have been even better if it were one endless awkward silence and not an attempt at another Core blunder.  In essence, University Writing seemed to have the potential of being a sometimes-decent course, but the extremely dull and nervous teaching style crushed all hopes we had.  On top of that, the grading seemed somewhat arbitrary- based on what i saw during peer-revision, some of the students in that class truly deserved to fail, but it seemed the more simple and dull or randomly novel your paper was, the better your grade would be.  My advice:  Either chose to write a very simple essay- or attempt to do something extraordinary with the topic and refrain from consciously attending the class because you will feel as though your brain is collapsing on itself.  For 2.5 classes we openly brainstormed different topics and subtopics to pursue in our groups and our final essays, but after we seemed to have narrowed down our focus to 2 very interesting topics Becky came to the next class and politely removed them on the basis that they had nothing to do with our readings and instead mustered up all of her false enthuseasm for the topic of Wall Street which turned out to be even more mind-numbing than it sounded once we devoted a month to it and which had less to do with our readings than the 2 interesting topics we had formed as a class.  At best this class is laughable. Hopefully, there will be a couple people in your class that know what they are talking about, one that sleeps with his eyes open, a few whose comments are so pointless that they are entertaining, and one whose attempts at making the class less formal are so asinine that your UW notebook becomes a collection of his quotes.  I found that most of my time was spent watching pigeons make fecal stalactites on the opposing building, wishing I had wings and a pea sized cortex.\nWorkload:\nAround 8 300-500 word writings that have no concrete affect on the final grade.\n2 1500-2000 essays\n1 2500-3000 essay\ngroup project (only 5%)\nparticipation  -  i think participation was said to include those early short papers and class discussion  (though i don't think she actually considered this).  Lots of participation and participation in the final UW conference seemed to have little if any positive effect, even though she said she would bump up grades for good participation.\n"
        }
    ]
}