{
    "prof_info": [
        {
            "prof_name": "Elizabeth Scharffenberger",
            "prof_id": 701,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "History of Greek Literature O",
            "review_date": "December 06, 2016",
            "review_content": "\nIf you want your Greek to improve, take a class with Prof Scharffenberger. If you want to feel confident and comfortable translating, digesting, and analyzing 1000+ lines of text per week, take survey with her. She KNOWS her stuff. She is well organized, punctual, fair, and extremely demanding - but in a way that is positive and constructive for the student. My weakest point was having the confidence [and honestly, the skill] to discuss the material, especially in such a small class, but Prof Scharffenberger was kind and did not put anyone on the spot. There were no surprises. She was accommodating with her office hours, offered guidance for writing the two short papers, and in addition to discussing the text, gave some brief grammar and meter lessons.\nAlso, it was great to walk into class and be greeted by her smiling and being excited to start the lesson. Small things like that really change the atmosphere of a classroom.\nWorkload:\nWell, it IS Greek survey. She does assign quite a heavy amount of secondary readings compared to other survey professors. Still, the readings are well chosen and always discussed in a productive way in class. Weekly quizzes, two short papers, and a final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 18, 2011",
            "review_content": "\nThis class was a disappointment.\nScharffenberger's seminar model is broken.  In a normal class (as I have experienced it), discussion passes from student A to student B and so on.  In this class, it passes from student A to Scharffenberger to student B to Scharffenberger and so on.  This has several effects.\nIt slows the class down.  Since Scharffenberger talks after every student, the class drags slowly.  If a student talks for a minute, and Scharffenberber talks for a minute, then it takes twice as long as it should to call on student B after student A is called on.  There would regularly be ques of 5 or more students waiting to speak.  By the time you are called on your point is obsolete.  This is a result of her second problem.\nShe doesn't seem interested in what you have to say.  Like most other CC professors, Scharffenberger comes to class with some points prepared.  These are her points, and she makes sure to hit them in every one of her responses, regardless of what the student was talking about.  Since she was constantly changing the subject back to her own topics, the class couldn't generate any sory of compicated discussion, since the discussion was abandoned by Scharffenberger before it could be expanded upon by the students.  This happened every day, multiple times a day, and it leads to the final problem with her seminar system.\nIt makes her seem dumb.  Now Scharffenberger is smart in her own way.  However, even the smartest person in the world couldn't think of something worthwhile to say every other minute for 2 hours.  She takes too much burden of the class' discussion on herself.  Is she afraid we will mess it up without her guidance?  Does she just really like the sound of her own voice?  Does she just not know?\nI think it is the latter.  Scharffenberger is a nice lady, and I have no doubt that the people that wrote these other reviews stand firmly behind them.  However, this was my finding and I stand firmly behind it.\nWorkload:\nUsual reading, some response papers, 5 pager, 8 pager, midterm, final.  Grades are dependent on how smart she thinks you are, which is dependent on how you do on the first response paper.  Kill the first response paper and you should be fine.\n"
        },
        {
            "course_name": "Intermediate Ancient Greek",
            "review_date": "December 13, 2010",
            "review_content": "\nProfessor Scharffenberger was absolutely fantastic.  I went into the class having not taken Beginning Ancient Greek at Columbia, unlike the majority of my peers, but fortunately I ended up being adequately prepared from my background at my previous school.  She is very warm, funny, and knows her material very well.  She also made sure that people got any questions in they needed to be answered.  She is very good and clear at explaining grammar, and every once in a while we'll contextualize the text and discuss content as well as grammar.  She calls on people randomly, and it's a small class, so you won't get away with not doing the homework, although that should be true of most classics classes.  I looked forward to going to her classes and learned a lot.  The plethora of homeworks and quizzes ensure that you are constantly updated on your status in the class and on what you do and don't understand.  Overall, I learned a lot of Greek, and will keep an eye out for her classes in the future.\n\nWorkload:\nWeekly (Friday) Quizzes (drop the lowest quiz at the end of the semester), for the first quarter of the semester on morphology and syntax, later on also translation in addition to specific questions on morphology and syntax, Homework assignments (on syntax and morphology) due every Monday; translation preparation required as homework for every class.  At first the work seemed intimidating (probably because we all had the summer off from Greek), but you soon adjust and the workload is reasonable.\nFair grading on quizzes and homeworks are corrected, but graded only for completion.\n"
        },
        {
            "course_name": "Intermediate Latin II: Poetry",
            "review_date": "May 18, 2010",
            "review_content": "\nProfessor Scharffenberger was a delightful woman teaching a very difficult class.  Assigning an absurd number of lines a night, she always had to adjust the readings to more manageable lengths.  Given the number of lines expected for each class, it became incredibly time consuming to write out a translation for every assignment - something she may do on purpose since she prefers students to translate from the Latin with prepared notes on vocabulary and grammar instead of translations.  Studying for tests and quizzes can be frustrating as they each cover hundreds of lines, and while each quiz is short, if you did not study the two lines out of a hundred that she picked, it feels like you might as well have not studied at all.  That being said, if you put in the time and the work, you can do well in this class - Professor Scharffenberger is a fair grader and all the problems I had in this class were with the language Latin and not the professor.  If you are a Classics major, take a course with Professor Scharffenberger, if you're taking Latin to fulfill the language requirement you can definitely find an easier professor.  \nWorkload:\n30-70 line \"readings\" (translations) every class (nothing collected), quizzes (20%) and worksheets alternating every week, 3 tests (including the final) each worth 20%\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 16, 2008",
            "review_content": "\nProf Scharffenberger is INCREDIBLE. She's first of all the warmest and friendliest person I've met on this campus. She creates a great discussion atmosphere, welcoming all opinions without letting it become too much of a free-for-all. She'll never shoot down your opinion, but she might \"challenge\" it, especially if it's not well supported. Part of why she's a great facilitator is that she's good at synthesizing everything and articulating the main ideas in a clear, thoughtful manner. She's incredibly humble about her own knowledge and readily acknowledges areas in which she is unfamiliar, but she knows what she's talking about. Class time goes by pretty quickly in this class.\nAlso, even though she teaches other classes, I feel like she just teaches CC because she's always willing to meet with you outside of class and holds extra office hours to  work out paper ideas.\nOverall, the grade is pretty evenly distributed among papers, midterm, final, and participation. She assigns a few written assignments throughout the semester, but they're short (two paragraph responses to specific questions) and ungraded. First semester of CC, we had to write one 5-page paper at the beginning of the course and one 8-page paper at the end. The second one was something of a chore, but again, she does her best to make the process less painless by offering insight into your paper topic and providing you with many different paper topics (that are both interesting and specific). With that said, it's a good idea to go talk to her about your paper topic before you actually write it. Her grading is also VERY fair, though she does make you work. She will add a few authors (outside of the optional choices for CC) to the syllabus, but they're pretty good additions.\nWorkload:\nFirst semester: 5 pg paper, 8 pg paper, 3 written homework assignments, midterm, non-cumulative final (basically a second midterm). She's pretty reasonable about the reading load. The middle of the week readings are always shorter than the ones over weekends.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 19, 2007",
            "review_content": "\nProf Scharffenberger is one of my favourite teachers in my career as a student.  She not only listens to ANYTHING anyone has to say, she also is never condescending...she is very open minded, and is a sweetheart.  I would go to her office hours just to chat.\nShe definitely wants to see you push yourself and she sees the potential in you.  I would highly recommend her to anyone!\nShe is very knowledgeable, knows ancient greek and some latin.  She is open to learning/incite students have.  Also, she does not sit and talk the whole 2 hours of class, she promotes CLASS discussions.\nDefinitely go to her office hours to discuss a paper/let her know what you are writing about because she always has that one piece of info that you hadn't thought about, or that one insight you may want to pay a little more attention to, etc...she's really great to brainstorm with :)\nWorkload:\n1st semester: 3 papers (short [about 4pgs], medium length, longer [6-7pgs]), midterm like the class-wide final\n2nd semester: 2 papers (medium, longer [6-8pgs]), about 3 short weekend assignments, midterm like the class wide final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 09, 2007",
            "review_content": "\nYes, she is a warm, friendly person, but if she were only that, then classes with her would've probably been bogged down by inane, off-topic comments, and we would've covered nothing in class.\nHowever, Scharffenberger is a model professor.  The lady gets down to business.  Class is made up mostly of discussion amongst her and the students.  It was always in-depth, and meaningful.  (Of course, your experience in a class-wide discussion will vary depending on your classmates.  My classmates happened to contribute often and well to discussion.) \nTherefore, I'm surprised when one of her other reviewers said that her \"Comedy Past and Present\" class \"devolves into people talking about their personal favorite pets or what they had for breakfast.\"  My experience in her Lit Hum class was the opposite--she always kept things on track, and organized.  Yes, there were the 2 or 3 minutes of off-topic chitchat before every class, when people were still coming in, but she always steered things back to coursework when class was scheduled to begin.\nWe read all the books, and covered each one for at least one class period.  I have heard of a number of Lit Hum professors who skip over a large number of books, and spend classtime on anything but coursework.  So, Scharffenberger seems to be particularly intense for a Lit Hum professor.\nIn short, I always looked forward to going to her class.  She has all my respect.  Highly recommended.  <3\nWorkload:\nRemember--in a class with her, you will read all of the required books, and then some--having read everything will help a lot you during exams.  Expect 2 or 3 major papers per semester, at 4-5pps, 6,7pp, and 8-10pp, if my memory serves correctly.  In addition, she may have you do a handful of paragraph-long assignments.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 09, 2007",
            "review_content": "\nYes, she is a warm, friendly person, but if she were only that, then classes with her would've probably been bogged down by inane, off-topic comments, and we would've covered nothing in class.\nHowever, Scharffenberger is a model professor.  The lady gets down to business.  Class is made up mostly of discussion amongst her and the students.  It was always in-depth, and meaningful.  (Of course, your experience in a class-wide discussion will vary depending on your classmates.  My classmates happened to contribute often and well to discussion.) \nTherefore, I'm surprised when one of her other reviewers said that her \"Comedy Past and Present\" class \"devolves into people talking about their personal favorite pets or what they had for breakfast.\"  My experience in her Lit Hum class was the opposite--she always kept things on track, and organized.  Yes, there were the 2 or 3 minutes of off-topic chitchat before every class, when people were still coming in, but she always steered things back to coursework when class was scheduled to begin.\nWe read all the books, and covered each one for at least one class period.  I have heard of a number of Lit Hum professors who skip over a large number of books, and spend classtime on anything but coursework.  So, Scharffenberger seems to be particularly intense for a Lit Hum professor.\nIn short, I always looked forward to going to her class.  She has all my respect.  Highly recommended.  <3\nWorkload:\nRemember--in a class with her, you will read all of the required books, and then some--having read everything will help a lot you during exams.  Expect 2 or 3 major papers per semester, at 4-5pps, 6,7pp, and 8-10pp, if my memory serves correctly.  In addition, she may have you do a handful of paragraph-long assignments.\n"
        },
        {
            "course_name": "Comedy Past and Present",
            "review_date": "February 01, 2007",
            "review_content": "\nUgh.\nUgh ugh ugh. \nProf. Scharfenberger really did seem nice, but it quickly became frustrating because of the situaiton below:\nyou want to like a class, you do all the readings and get to class with your little highlighter and post-its, ready to snap up any juicy tidbit of information that might come your way .. and then the lecture devolves into people talking about their personal favorite pets or what they had for breakfast, with the professor acting really \"supportive\" of this choice to waste everyone's time. \ntruly, did want to like it. but really, it wasn't good. \nWorkload:\ntwo papers, one about 5 or 6 pages, the other about 8. a midterm, a final, and several other assignments\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 25, 2006",
            "review_content": "\nProf Scharffenberger (or Sharffie as we came to call her outside of class) is the warmest professor I have ever had. Her ability to create a comfortable classroom environment is something you don't see at Columbia everyday.\nAside from being absolutely brilliant--she is a classicist who is well versed in modern philosophy--Sharffie will work with you to make sure you understand the material. She is also always available outside of class and willing to talk to you about papers and/or problems. If you get her for any class, consider yourself lucky. \nWorkload:\nNormal CC level workload. Three papers -- one short, one shortish, one regular length. Totally fair midterm and final.\n"
        },
        {
            "course_name": "Comedy Past and Present",
            "review_date": "August 20, 2005",
            "review_content": "\nShe is as great as she sounds.  Elizabeths class in not only interesting but also enjoyable.  I was skeptic as first when the class was supposed to focus on the classical writings but as the course progressed we read more and more modern comedy from Woody Allen to John Stewart's America The Book.  I was amazed that a book my friends were reading for fun I was reading for a class at Columbia. With out a doubt Elizabeth knows what shes talking about and is willing to help you with whatever you need.\nWorkload:\nstandard take home midterm and final, 2 papers the second of which is 10 pages.  She gives you the grade you deserve especially if you show you are really trying and care about the material.\n"
        },
        {
            "course_name": "Euripides Helen, Lucian",
            "review_date": "January 28, 2005",
            "review_content": "\nProfessor Scharffenberger is as terrific as her name is long. In addition to being extremely outgoing and kind, she is perhaps the perfect union (along with several other Columbia/Barnard classicists) of a the skills of a brilliant literary mind and a rigorous linguist. She is not only about touchy-feely literary criticism, and not only concerned with nuances of grammar, instead she mixes the two to make a great and varied class. She knows Greek extremely well, and this means that you must know it also in order to succeed on her exams. Another Classics professor once remarked to me, \"She is such a good teacher it makes me want to jump out of the window.\"\nWorkload:\nLots of reading, tests on all of it, they are not as hard as they could be, but a challenge, healthy but not obese term paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 30, 2004",
            "review_content": "\nI took Liz's Lit Hum class in Spring 2002 and feel compelled 2 years later to sumbit a review of her because she is one of the few professors at this school that I will search out in the class directory.  Other professors should have to sit and observe the way she handles students--never shooting them down, always responding enthusiastically to questions.  She almost convinced me in Lit Hum to major in Classics.  She has NO ego--none--and that is so refreshing for a professor at this school.  It took me until my senior year to realize how rare it is at COLUMBIA to find a teacher who realizes that what she knows is less important than what her students actually learn from her.  And on top of that, a lovely lady outside of the classroom--always friendly, but not in a haughty or corny way.  She's just a down-to-earth person and a truly excellent teacher.\nWorkload:\nNormal Lit Hum from what I've heard.  2 papers 6-8 pages.  Midterm and final (IDs and Essays with Choice).  Comedy class has two papers 6-8 pages as well.  ALWAYS sit down with her before a paper to make sure she understands and approves of what you are thinking and doing.\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "June 07, 2004",
            "review_content": "\nMuch of what other reviewers have said is correct: Scharffenberger is very nice, extremely approachable, learned everyone's names, and encouraged discussion. She is not, however, a great professor. I learned virtually nothing in her class, which was wasted listening to the often inane comments of students who liked to hear their own voices. Discussion is fine, but not when lecture is sacrificed for it and not when the professor is unwilling or unable to tell someone he or she is wrong. Furthermore, when Scharffenberger did lecture, she offered virtually nothing in the way of in depth analysis and admitted that she had not studied this material for 20 years. While it was fun to read Euripides and Aeschylus, I can do that on my own. If you want an easy A, this is the class for you. If you want to learn something, I've heard that Steiner teaches this class with more scholarly rigor.\nWorkload:\n1 response paper  and 1 quiz, both ungraded; 2 midterms, paper, final; manageable reading each week\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "June 03, 2004",
            "review_content": "\nI don't know where to begin. Prof. Scharffenberger is one of those rare instructors that you hear about, but never seem to meet.  She learned everyone's name within the first week, never seemed to have any favorites or create any clique-like following that popular teachers sometimes do. She is approachable, extremely helpful and puts a tremendous amount of time into each student. Class discussions are fast, exciting, very respectful, and focused. She is able to have total control and at the same time keep the ideas coming.  She never put anyone on the spot if they don't participate in the discussion on a particular day. She is eager to go over papers and exams individually with students, and seems to expect one on one meetings. She is organized, knowledgable, irreverent, funny, outrageous. Professor Scharffenberger is not to be missed. Her energy has got to be seen to be believed. I looked forward to her class so much and found it to be a real tonic to the grind of the semester. The writing assignments kind of piled up at the end. As a result, I was feeling a little punch drunk with that. But, she's so good it was worth it. Because of her, I wish I was a Classics major....\nWorkload:\nLots of reading (but broken down into managable bits). One in class quiz (we were supposed to have more..) TWO mid-terms (take home...but two?), a term paper (crammed between the second mid-term and take home final), and a take home final. (wew!) \n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "April 28, 2004",
            "review_content": "\nShe rocks!  She's an expert in the area who loves interacting with her class and drawing out the best thoughts and analyses she can.  She interjects some excellent ideas and has a knack for organizaing material very well.  She's a delight to study with - her enthusiasm and sense of humor make class very enjoyable.  Highly recommended.\nWorkload:\nLots of reading each week of poems, plays, and secondary sources.  Two challenging take-home midterm exams, a final paper, and a final take-home exam.  The workload is challenging and she expects good analyses and connections but helps prepare you through class discussions.\n"
        },
        {
            "course_name": "Comedy Past and Present",
            "review_date": "May 19, 2003",
            "review_content": "\nThe rare teacher who is totally at ease with her students without being condescending or laughingly 'hip.'  She doesn't stand on ceremony, and she obviously enjoys the intellectual exchange with her students. Though class discussions sometimes tended to meander along for the majority of the class, Prof. Scharffenberger revels in class discussions, and is not afraid to spend 10 minutes discussing anything that comes up randomly, whether it be Jon Stewart or obscure avant-garde French plays playing in Brooklyn that weekend. She is definitely a student's dream: a warm, engaging, hilarious professor who wants to inform AND be your friend. \nWorkload:\n2 papers--the first 6-8 pages, the second 8-10. She expects top-notch work, but is always available to consult and advise. Take-home midterm and final, which will end up a couple of pages over the limit but which also invite you to submit original interpretations of classic and current comedic texts. It's a definite exercise in brainpower, but it ends up being quite exciting once you see what you've accomplished.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "April 10, 2003",
            "review_content": "\nI've sat in on some of Professor Scharffenberger's Comedy Past and Present classes (I've met her outside the classroom) and she has always been very good. As far as grading goes, from what I've seen of graded papers from friends, her insights are helpful and she grades fairly. Recommended.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 19, 2002",
            "review_content": "\nshe's an inspirational professor. very enthusiastic, very knowledgable without being intimidating or overbearing. her essays are interesting yet challenging and sometimes i felt like i really couldn't figure out what she wanted--i didn't break an A until she let me turn one in over after revising it. her class discussions are fun if you're interested in what we're reading and she gets excited to hear students' thoughts about stuff. i had a lot of fun in her class, and definitely learned a lot. plus she's very nice, so that's never bad. her midterm was a cinch--i didn't study at all and i got an 89. it's the essays that are stressful. overall: she's a fantastic professor who pushes you and i felt really lucky to have her. \nWorkload:\ni think my reading load was the heaviest out of all my friend's sections. it's pretty intense--you do odyssey in a week. i'd estimate it's 200pages/week, but if you read it, class is much more enjoyable\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2001",
            "review_content": "\nProf. Scharffenberger makes every class interesting. She takes pleasure in listening to her students' ideas and never grades down for an idea she might not agree with. She grades the first essay down a bit only to ensure that the second one is better. Her midterm is tricky but not any more so than the department final. Sometimes she'll split the students into groups for more focused discussion.\nWorkload:\nTwo essays, a midterm, and a final. Homework assignments start out short and are given out less and less as the year progresses.\n"
        }
    ]
}