{
    "prof_info": [
        {
            "prof_name": "Victoria Rosner",
            "prof_id": 3579,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "January 17, 2017",
            "review_content": "\nIt's been years since I took this class with Professor Rosner. I did my work, got my B+, and ran away as fast as I could. So why am I writing this review, you ask? To warn you. Of what, you ask? Well, where to begin...\nFor starters, I've never encountered a professor who is as insecure of their own discipline as Professor Rosner. I can still recall her standing in front of a class full of nineteen-year-olds, trying to explain why English is a more \"honorable\" and \"noble\" line of study than the sciences or how those who study English (i.e., English professors) are the sole gatekeepers able to unlock the hidden meaning in literary texts. To this day I still cringe when I think about her teaching style, how many heads were absentmindedly nodding while she was proselytizing, and how often she felt the need to pat herself on the back.\nSpeaking of her teaching: I didn't learn a damn thing except for maybe an obscure Greek or Latin word or phrase to sound even douchier. Every moment of every class she wasn't slamming other subjects she talked about the ways in which English as a discipline has evolved without ever challenging the class or, more importantly, herself to think about how it *should* exist. Silly me, I actually wanted to think about the human condition and its relation to literature, but all I got out of this class was the definition of solipsism and the knowledge that decades ago English consisted of rote memorization and recitation. Several grand well spent!\nLastly, to do well in this class one will most likely have to give her what she wants. That was my impression during the class, and reading the other reviews confirms my suspicion. This doesn't mean that Professor Rosner's class was easy; it's just that this class was challenging for all the wrong reasons. I felt I was being graded not on my ability to think or write or articulate a point but on my ability to regurgitate whatever Professor Rosner wanted to see.\nHow is any of that learning, you ask? I came to the realization long ago that it's not. Hopefully this review will lead you to the same conclusion.\nWorkload:\nThree papers and a book/play every other week.\n"
        },
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "July 14, 2014",
            "review_content": "\nProfessor Rosner's lectures were very enjoyable, although they did very little to help with the writing assignments, 100% of which were what comprised your grade.  The reading list for the class was great (Frankenstein, Picture of Dorian Gray, etc.).  What was terrible about this course was the disconnect between the professor and her TAs.  They were all terrified of her, given no authority/autonomy, and had no idea what Professor Rosner wanted out of her students.\nBad for them, even worse for us.  Even though the first 2 reading assignments were novels (Frankenstein & Picture of Dorian Gray), the first writing assignment was a 'close reading of a poem,' when we would not get to the poetry section of the course until the end of the semester.  None of us (including the TAs) had any idea what was expected of us (the prompt for the assignment was useless).  First we were told \"no thesis needed\" as it was a 2-3 page paper.  Next we were told, \"ok, scratch that, yes, you need a thesis, but don't do any research\"  I met with my TA multiple times, and she told me herself she wasn't sure what we were supposed to do.  So I did what I thought was required, per my meetings w/the TA, and received a C+ on the paper.  TA had given me a B, Professor Rosner then lowered it to a C+.  Had a 4.0 going into this course, have written A papers my entire academic career.  Was flabbergasted.\nNext assignment was a Reception Essay, which everyone freaked out about, as they all had no idea what that was, and received very little useful info (again) from the TAs.  Did OK on that one, as I also met with Professor Rosner to find out exactly what she was looking for, and from that point on things got a little more smooth, but if I hadn't been in contact with the professor for the rest of the semester about every assignment, lord knows what would have happened.\nIf you take this class (which I don't recommend), be sure to meet with Professor Rosner well before every assignment is due to be sure you're on the right track.  She's great about meeting with students, so get on her schedule as soon as you can.  The TAs, while quite nice, are clueless.  This is a 4 credit class, so getting a bad grade will wreak havoc on your GPA.  I really wish we didn't have to worry about being at the mercy of grad students regarding our grades at Columbia, but that's the format for these large, required classes here, so you just have to deal with it.  It's a crap shoot, but nothing to be done about it when you have to take a class to fulfill your Core or Major requirements.  Ended up with a B+ in the class after dropping another class so I could focus more attention on this one.\nWorkload:\n3 papers, which doesn't seem excessive, but you will put an extraordinary amount of time into the writing of each one (multiple, multiple drafts, meeting with the professor, meeting with the TA), because if you don't, you'll get a horrible grade, so be warned.\n"
        },
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "December 18, 2013",
            "review_content": "\nProf. Rosner is overall a good lecturer: she's funny and has interesting things to say about the history of English studies. If you're an English major and can't get around taking this class, she's not a bad choice.\nI will say that her class turned me off of being an English major. Thank god, right? Now I won't be eating easy-mac trying to find a job wondering why I was an English major! Hooray! Instead, I'll be doing the same thing, but wondering why I chose to be a History major. So it goes. My main gripes, you could say, have to do with the way the class is set up and the TA I was arbitrarily assigned. First of all, I've found the grading to be absolutely cut-throat, like some Hunger Games shit or something. I've always thought I was good at English, and at the \"presitigious\" liberal arts school from which I transferred, my grades were always A to A+ range. Even in my other Columbia humanities classes I've been hitting close to the same marks. Not so in this class. I was getting whipped for basic stuff like undisciplined writing and lack of a focused thesis, even when I poured hours and hours into the papers. It was ridiculous: you slavishly conform yourself to the standards and comments in the last paper, only to find that you've completely fucked up something else in your next paper. I'll stop my self-indulgent bitterness--haven't gotten the final grade back, so here's to hoping, right? Also, the second paper (reception histories) was just conceptually FUBAR. Completely unclear what was expected. Anyways, they're changing the curriculum around so it'll definitely be different next time. But I doubt the grading will be. \nIf you have to take it: getting an A is not impossible, but it requires a serious commitment to the class. Meet with your TA, meet with Prof. Rosner, make absolutely sure what they expect, analyze the fuck out of the texts, keep calm but edit like a maniac. Good luck.\nWorkload:\nReasonable: a novel + 2-4 theoretical pieces per week. Three essays: a 3-5 pg. close reading of a poem; a 5-6 page \"reception histories\" paper (which, as I said in the comments, was such a clusterfuck); and a 7-8 page straight lit-crit paper.\n"
        },
        {
            "course_name": "Literature of the Fin de Siecle",
            "review_date": "December 10, 2010",
            "review_content": "\nProfessor Rosner is AMAZING. Brilliant, funny, clear, fascinating, and just a joy in general. This class was the bright spot of last semester. The syllabus is excellent-Dracula, Dorian Gray, Jekyll and Hyde, Sherlock Holmes-and Rosner is also very knowledgeable about the period. She has that amazing gift of a good English teacher-excellent close readings that really get to what the author is trying to convey, directly connected to the cultural context. I came away from all the works feeling like I understood them on multiple levels. In terms of assignments, I wouldn't call her grading harsh as much as it's the product of high expectations. However, she was always really great about office hours and meeting after class, so if you're ever confused about what she wants it's not hard to find out.\nI'm not an English major, but I will definitely take one of her classes again the next chance I get. Get professor, great person, if you like dynamic lectures, take her class.\nWorkload:\nReally reasonable-take home midterm of 2 short essays (topics picked from a list), choose one of the works from the syllabus to present on in class as well as write your final (10 pg.) paper about. Not too much written work, but you're expected to have read the works for lecture-she will ask you your opinion! \n"
        },
        {
            "course_name": "Fin De Siecle Literature",
            "review_date": "May 08, 2010",
            "review_content": "\nI completely disagree with the previous reviews. I never write culpa reviews but I was completely appalled to see how these reviews misrepresented this amazing professor. Rosner is awesome. In fact, she is God. She is, however, a tough grader (I guess that have influenced many of the previous reviews). Probably the best professor I have had at Columbia. Don't miss out! If you are afraid to get a low grade, take the class pass fail; you will not regret it. Very accessible, witty, original. We read many works that are part of the cultural consciousness and that people have preconceptions of (such as Dracula, Dr. Jekyll and Mr Hyde, etc) in a totally new light. Like a true ivy league professor she goes beyond the sparknotes' interpretation (which unfortunately cannot be said about many professor I have had during my four years at this school). \nWorkload:\nManageable, about a novel every other week. \n"
        },
        {
            "course_name": "Literary Texts, Critical Methods",
            "review_date": "December 22, 2009",
            "review_content": "\nThis class is so-so. I'm not sure what we were really supposed to be learning about the English major so in that sense it felt like a waste of time. The texts were interesting (Frankenstein, Waiting for Godot, La Frontera to name a few) and while Professor Rosner had a theme for each lesson, it really didn't seem important or affect my studies in any way. We barely went into the text itself and just listened to her lecture on a lot of pointless things. Professor Rosner herself was OK. She tried to make joke and seem chill but if you had a point that conflicted with hers she'd pretty much just cut you down...she kind of gave you this \"are you stupid\" look...really unnecessarily critical. We had 3 essays throughout the semester, one 3-4 page, one 5-6 page, and one 7-8 page. The first is just a straightforward analysis, the second is using sources, and the third is a combination of them both. Again, not sure how I feel about the essays. They weren't really that bad but at the same time I didn't learn anything. Overall, this course and this lecturerer is kind of ehhhh...not sure how I feel about it and not sure what I learned. But I mean, you have to take it as an English Major so there's really no way around it. \nAwesome thing though: She cancelled the final because she felt like we were progressing in our work :)\nWorkload:\nA book a week, three essays, no midterm, no final.\n"
        },
        {
            "course_name": "Modernism and the City",
            "review_date": "May 16, 2009",
            "review_content": "\nI found this professor to be totally confusing as regards to what she required. A thesis was required in the one to two page response papers, this wasn't  made known 'til after the fact, but then again when when I didn't put one I did better... The grading was bizarre and harsh.\nThe directions for the presentation and paper were unclear and I never understood what it was that I was doing worng, She seemed nice, but she cut me off when I said anything that seemed to move away from her position.\nI suggest if you are interested in maintaining a high GPA to avoid this class. \nIn fact, the content was fairly pointless and meandering too.Horribly  saddening experience.\nWorkload:\nThree short responses, presentation and full paper, another full length paper. Medium reading.\n"
        },
        {
            "course_name": "Modernism and the City",
            "review_date": "April 29, 2009",
            "review_content": "\nContrary to her sunny and humorous demeanor, Professor Rosner must be one of the most unpleasant professors I have encountered at Columbia.  She touts helping her students improve in their work, when in reality she manages to squash any iota of ambition.  I agree with the previous reviewer that she talks down to undergrads. Dear Prof. Rosner, if you are reading this, get over yourself. \nWorkload:\nMedium- heavy for a seminar, readings, 3 short response papers, a presentation (which is really centered around a paper), and a final paper\n"
        },
        {
            "course_name": "Literature of the Fin de Siecle",
            "review_date": "March 12, 2009",
            "review_content": "\nVictorian Rosner is nice. So why is she such a bad professor? Why are her lectures, though highly engaging, so poorly synthesized? So anecdotal? So directionless? Why does she talk down to undergrads? Why does she antagonize grad students (it seemed like there were a lot in this class)? And why, when you offer something that isn't part of  her pet reading of Henry James or whatever, can she be only either snarky or totally uncomprehending?\nWorkload:\nThe usual. A long and a short paper for undergrad classes. She's a bit heavy on presentations though.\n"
        },
        {
            "course_name": "Literature of the Fin de Siecle",
            "review_date": "February 09, 2009",
            "review_content": "\nTaking her course was a true pleasure. The reading was interesting, her lectures engaging, and her grading fair. She was approachable and kind outside of class and her insights were always spot on. She was truly interested in motivating her students and making them succeed in their work. Although I think she is a visiting professor, the university ought to bring her back fulltime.\nWorkload:\nMidterm, Paper, and Group Presentation, as well as the reading. Midterm was tough, but she grades the papers fairly.\n"
        },
        {
            "course_name": "Literature of the Fin de Siecle",
            "review_date": "December 21, 2008",
            "review_content": "\nTruly an excellent professor. Not only is she funny and just a really nice personi in general, but she is captivating in class. She is a great lecturer and makes sure to include everyone in discussion. She is also a very fair grader and willing to work with any student who needs extra time, a draft, etc. Overall, I just think shes the type of professor who I would love to get coffee with and just chat about life. She is always open and enthusiastic... truly a gem within the English department and would hands down reccomend her\nWorkload:\nOne novel a week or so, 2 postings, midterm, final paper (10-12 pages)\n"
        }
    ]
}