{
    "prof_info": [
        {
            "prof_name": "Barbel Honisch",
            "prof_id": 3370,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Oceanography",
            "review_date": "January 07, 2010",
            "review_content": "\n\nProfessor Honisch is a very nice lady. She made me even more interested in the subject than I already was. She is very approachable and answers e-mails in seconds (that is really nice of her!!!). She will do everything to make sure you understand the material, but you have to actually ask specific questions. I would recommend everyone to take this class because it's interesting, because the professor is just nice, and also because it's a pretty easy way to fullfill the science requirement without any heavy-duty science. I was scared at first when we started chemical oceanography, but than I discovered that you are not required to know much about it for the exams, just some stuff on a VERY general level. Believe me, I had C's in Chemestry and Physics in school, but I got an A for this class. She is really understanding and does everything to give students a higher grade. She gives 3 take home h/w's and the exams are multiple choice, plus you do second part of the exam in groups, which allows you to improve your grade. I also believe she makes some curve at the end. Overall, it was a pleasure to be in this class. \n\n\nWorkload:\nI would say pretty light. 2 exams and 3 take home homeworks. The book is helpful, but the lecture slides are more important for the exams.\n\n"
        },
        {
            "course_name": "Oceanography",
            "review_date": "December 23, 2009",
            "review_content": "\n\nI like Professor Honisch.  She's approachable, knowledgable in her field, and recognizes that the students enrolled in the course are taking it to fulfill the science requirement, mostly.  It's thus focused on learning facts about the ocean rather than figuring out through mathematical models and \"real\" science which is very nice.  I would say it's the least \"science\"-y of all the option for non-science majors.  Take it if you want an easy way to fulfill the core requirement and learn a lot about that which covers 70% of the Earth... not a bad deal.  She scheduled a trip to Lamont since this was the first year without the LDEO exhibit (a presentation on one of the exhibits used to count as the final) which I heard was great but I couldn't attend.  I went to class and enjoyed the lectures.\n\n\nWorkload:\nSO LIGHT!  It's amazing, you do not have to attend lecture unless you want to (which I highly suggest attending, though she does post all her lecture slides), three short (~18 multiple questions) problem sets, and a midterm and a final with only about 25 questions a piece that are challenging in their wording, not the material they discuss.  There's a group portion at the end of each exam in which you work with others on the same exact exam and the grade counts for 30% of your overall exam grade.  \n\n"
        },
        {
            "course_name": "Oceanography",
            "review_date": "March 16, 2009",
            "review_content": "\n\nBarbel is quite lovely and a very clear lecturer. The class is organized well: the powerpoint slides are available before class so that they can be printed and brought to class for easy note-taking. She's knowledgeable and seemed to have a good answer for nearly all the questions that were asked.\n\n\nWorkload:\nTwo exams, three question sets, a brief report. Questions can be worded ambiguously, but she answers emails quickly.\n\n"
        },
        {
            "course_name": "Oceanography",
            "review_date": "December 20, 2008",
            "review_content": "\n\nIf you're a humanities major looking for a fairly easy science that is even somewhat fascinating, this is the one for you.  Course is full of non-science majors.  Early start time meant lots of people never showed, but I got a lot out of the lectures.  Only complaint would be the wording of the homeworks and exams, can be a little vague and cause complications.  But do it!  She's very nice and it's interesting stuff.\n\n\nWorkload:\nNot bad at all.  Midterm and final, worth 25% each.  The remaining half is made up of 3 homeworks (open-book, obviously, so should be a grade-booster) and one presentation/paper (I think everyone who did it got 50/50).  Most of the class seems to have a B or above.\n\n"
        },
        {
            "course_name": "Oceanography",
            "review_date": "December 13, 2008",
            "review_content": "\n\nHer intro to oceanography class is a great way to fulfill the science requirement. She really knows what she's talking about and you can tell she really wants us to learn this stuff. Don't expect to learn much about global warming and sea rising, but if you're interested in the ocean (beyond the dolphins and seals) this course is really pretty good.\n\n\nWorkload:\nVery minimal. Several graded homework assignments (3-4), two exams, and one short presentation or paper on an exhibit at the LDEO open house.\n\n"
        },
        {
            "course_name": "Oceanography",
            "review_date": "January 15, 2008",
            "review_content": "\n\nIf you're looking for an easy way out to fulfil the science requirement - don't bother taking this class. Do not assume this subject is 'an easy science'. Oceanography with Professor Honisch will not be easy, but it'll definitely be interesting and challenging. \nProfessor Honisch knows her subject inside out, backwards, frontways, any way! Every class is in lecture format, with her narrating excellent(!) powerpoint presentations that she compiles herself. I used the slideshows to study for the midterm and final and received full marks. The midterm and final are not difficult if you go to class, do the homeworks and study! The main difficulty lay in knowing what to focus on the most because A LOT is covered over the duration of the course, but again, her slideshows are key. If there is a whole class devoted to El Nino, then maybe you should study El Nino thoroughly. This is where you ask the TA for help (if you're lucky, the TA will arrange review sessions). Don't use the textbook to study too much - it doesn't quite match up with what she teaches. Use it instead to look up later certain areas that she covers in class.\nProfessor Honisch may come off as a little standoffish (her native language is German and so her English is slightly accented), but if you talk to her, she's actually very friendly and approachable. If you ask for more information on a subject, she will procure extra articles and so on. She asked the class to suggest topics that we were interested in. She allowed the entire class to redo their homework sets if they wanted a higher mark, and also offered extra credit. However, she did get slightly annoyed halfway into the semester when attendance dropped precipitiously (9:10 am class) - but what teacher wouldn't? My only gripe about Professor Honisch is that her teaching style is a little limited. She tends to just lecture - if she asked more questions, more of the class would stay awake. She does encourage asking questions though, and will answer you thoroughly. \nAll in all, an extremely enjoyable class. It was my absolute favourite this semester - I had fun doing all the work she gave out. However, I do recommend having a little background in chemistry and biology or geography, because it will help you out immensely. Even so, this is a course designed for non-science majors, so take it anyway!\n\n\nWorkload:\nVery manageable. Three homework sets consisting of 6-10 questions, requiring longer answers and sometimes diagrams. She allowed reworks of the first two homeworks, in order to improve your mark. One 2-3 page long paper (on a subject of your choice), based off exhibits at the LDEO Open House Day. One midterm and final. Extra credit optional. \n\n"
        }
    ]
}