{
    "prof_info": [
        {
            "prof_name": "Charles McNamara",
            "prof_id": 11888,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2015",
            "review_content": "\nCharley is incredibly intelligent, knows the material inside and out, and is very good at explaining the more abstract concepts. He will go out of his way to make time to meet with his students and really wants to get to know them. \nThis is, however, the most work-intensive CC class that I've heard of and, on top of that, he is a very tough grader. I'm all for working hard, but in this case, I found the workload ridiculous and unnecessary. A huge chunk of our class switched out for second semester. Hopefully he'll respond to the critiques and adjust his syllabus, but fair warning: if you're in this class you have to be prepared to work HARD with no guarantee that you'll be rewarded with a good grade. \nWorkload:\nFall 2014:\n4 papers\nMidterm\nFinal\n10 1-page responses\nBlog posts every class\nOccasional pop quizzes\n**Participation is only 10% of the final grade and includes quizzes\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 17, 2014",
            "review_content": "\nOne of the better CC professors, Charley is actually a grad student. Appears to put a lot of time into studying the texts. He even offers to meet you outside of class at lunch or something to talk about your problems. Pretty laid back and tries to call on people equally. Studied Latin extensively and brings in his training. Class goes by fast with hardly any silence. Someone is sharing or he is giving his interpretation. If you don't like to analyze texts, he gives opportunities to just read the text for participation. \nWorkload:\nSame reading as other CC classes. 3 essays as other professors course. 1 midterm. 1 final.   \n"
        }
    ]
}