{
    "prof_info": [
        {
            "prof_name": "Stefan Pedatella",
            "prof_id": 2493,
            "total_reviews": 32
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 08, 2016",
            "review_content": "\nBriefly: Take Professor Pedatella's class if you want a teacher who is passionate and highly knowledgable. Do not take him if you're looking for an easy A, though doing well is not impossible--you just have to put in some work. \nEach class period is completely discussion based, and Prof does a really good job of facilitating this discussion. He encourages participation on behalf of all students, but will not pressure you to speak if you are not comfortable doing so. He is adept at building off each student's comment and bringing in interesting information, historical context, or references to the intertextual conversation that we aren't able to pick up on. As someone incredibly well read and versed in the history, he is able to make the texts come alive. When he reads passages aloud in class, you can't help but be excited about the readings, since his passion radiates. Prof also brought a completely new perspective to analyzing texts, and on many occasions, I left class with a completely new perspective on our reading. \nHe tries to make time for each student during office hours, setting out 15-minute blocks for which students can register. If he is not busy helping students with their essays, he is more than happy to meet for longer periods of time to talk about any aspect of literature in which you may be interested. \nWorkload:\nThree 5-6 page essays, two of which were open prompt. For each, a rough draft is submitted, handed back with comments, and then you revise. The grades on the rough draft and final copy are averaged.\nAverage amount of reading each week.\n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "July 25, 2016",
            "review_content": "\nProfessor Pedatellla was very passionate about the texts and the class itself, but very opinionated and narcissistic when others challenged his ideas or seemed to not enjoy/agree with them. Frequently, students were talked over in his class or not allowed to formulate an argument in the class if he did not agree with it personally. This resulted in a somewhat uncomfortable environment in class when it came time to discuss texts with the students. The texts and lecture were okay, just very dry.     \nWorkload:\nPapers (1st draft) due every three to four weeks with a rewrite due a week after the 1st draft is returned, normally 4-6 pages. Final paper of 6-8 pages. \n"
        },
        {
            "course_name": "Made in America: Mafia in Cinema",
            "review_date": "June 21, 2016",
            "review_content": "\nThis class was the best sort of class I can imagine - not too much work and mind-blowingly interesting.  I'm not an English or Film major, I just took the class based on the material and the professor's reputation.  I'm so glad I did.  For a long time I had been looking for an excuse to watch The Godfathers and The Sopranos and this class gave me the perfect opportunity. How can you beat a class where your homework consists largely of watching hours and hours of HBO? Also, Pedatella is totally a phenomenal instructor. Very cool, down to earth, knows everything about the subject and is really passionate about it.  And he brought us all cannolis the last day of class (I mean, how cool is that). \n\nWorkload:\nTwo short essays and a Final. Totally manageable. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "July 09, 2015",
            "review_content": "\nThis class was beyond what I was expecting, in a good way. Coming into this class, I didn't read any of the books on the list. The books are pretty dense, hard to grasp when just skimming or reading for leisure at times and honestly quite boring sometimes, but Professor Pedatella somehow makes all these books so interesting and intriguing like they're all his favorite books. He's definitely really knowledgable of all the books and many other things, super engaging in class (he actually made The Aeneid interesting to listen to) and pretty inspirational at times. I've honestly never had an English teacher as good as Stefan Pedatella, and my high school English teachers were all pretty damn good. Although he's amazing in the classroom, he is somewhat of a pretty hard grader; he really makes you think as well. I just felt like my critical thinking has grown quite a bit with Pedatella. He's also really approachable, especially during office hours but at times can be quite intimidating because he knows all these books inside and out and can really drill you if you don't have a solid idea. The workload of this class is manageable. I highly recommend it!\nWorkload:\n3 essays (5-6 pages minimum), lots of reading but you can get away with it once and awhile. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 08, 2015",
            "review_content": "\nI had this whole review written out, in which I tried hard to find flaws with Professor Pedatella and inflate them so that my praise would seem balanced and objective, because I’m suspicious of simplicity. Purely rave reviews tend to leave something out, and to feel a bit blind or even biased as a result. I really wanted this to not be one of those reviews.\nBut then I saw the below review, realized I was being ridiculous, and wrote what I actually think instead.\nProfessor Pedatella treats the material like something young and alive, as if despite however many years of teaching, To the Lighthouse can still surprise him. When he lectures it’s as if he’s been thinking about these theories for years and this is the first time he’s ever gotten to tell someone about them. (Not to say that his teaching style is at all amateurish, far from it, only that his enthusiasm is beyond anything I’ve ever encountered in someone who’s been teaching as long as he has). Additionally, he seems to know more or less everything related to the Western canon, and is happy to explain intertextual allusions that would otherwise be almost impossible to catch. However, in spite of his, quite frankly, intimidating knowledge base, Professor Pedatella never acts like what a student has to say is obvious or unintelligent. He will disagree with students from time to time, but he is always very clear that his opinion in nothing more than just that: his opinion. In the class or in your essays it’s easier to simply agree with him, because he will smile and nod and move past you, but if you ever come up with something that’s yours (whether it clashes with his point, drives it forward in a direction he hadn’t considered, or ignores him altogether) that is when he will challenge you, and in doing so make you feel a real connection with the text, as though you are a participant in this millennia long conversation, just as much as Virgil or Chaucer or Keats. (Okay, maybe not just as much, but pretty damn close.)\nA friend of mine who entered his class with almost no literary background, having gone to fancy music schools her whole life, put it nicely when she said, “He makes literature sing.” I’d have to agree. His interpretations helped me write a response to Keats’ Ode to a Nightingale (which is far and away the most ambitious poetry project I have ever attempted), and class discussion has prompted me to write quite a few short stories.\nIn sum, Professor Pedatella is the most inspirational teacher I have ever encountered. I really cannot recommend him highly enough.\nOh, and to address the below review directly: I’ve never known anyone to give participation credit for note taking.\nWorkload:\nTwo 5-6 page essays and one 8-10 page essay, with a fair amount of reading. He's flexible with deadlines if you ask in advance.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 08, 2015",
            "review_content": "\nI had this whole review written out, in which I tried hard to find flaws with Professor Pedatella and inflate them so that my praise would seem balanced and objective, because I’m suspicious of simplicity. Purely rave reviews tend to leave something out, and to feel a bit blind or even biased as a result. I really wanted this to not be one of those reviews.\nBut then I saw the below review, realized I was being ridiculous, and wrote what I actually think instead.\nProfessor Pedatella treats the material like something young and alive, as if despite however many years of teaching, To the Lighthouse can still surprise him. When he lectures it’s as if he’s been thinking about these theories for years and this is the first time he’s ever gotten to tell someone about them. (Not to say that his teaching style is at all amateurish, far from it, only that his enthusiasm is beyond anything I’ve ever encountered in someone who’s been teaching as long as he has). Additionally, he seems to know more or less everything related to the Western canon, and is happy to explain intertextual allusions that would otherwise be almost impossible to catch. However, in spite of his, quite frankly, intimidating knowledge base, Professor Pedatella never acts like what a student has to say is obvious or unintelligent. He will disagree with students from time to time, but he is always very clear that his opinion in nothing more than just that: his opinion. In the class or in your essays it’s easier to simply agree with him, because he will smile and nod and move past you, but if you ever come up with something that’s yours (whether it clashes with his point, drives it forward in a direction he hadn’t considered, or ignores him altogether) that is when he will challenge you, and in doing so make you feel a real connection with the text, as though you are a participant in this millennia long conversation, just as much as Virgil or Chaucer or Keats. (Okay, maybe not just as much, but pretty damn close.)\nA friend of mine who entered his class with almost no literary background, having gone to fancy music schools her whole life, put it nicely when she said, “He makes literature sing.” I’d have to agree. His interpretations helped me write a response to Keats’ Ode to a Nightingale (which is far and away the most ambitious poetry project I have ever attempted), and class discussion has prompted me to write quite a few short stories.\nIn sum, Professor Pedatella is the most inspirational teacher I have ever encountered. I really cannot recommend him highly enough.\nOh, and to address the below review directly: I’ve never known anyone to give participation credit for note taking.\nWorkload:\nTwo 5-6 page essays and one 8-10 page essay, with a fair amount of reading. He's flexible with deadlines if you ask in advance.\n"
        },
        {
            "course_name": "BC1201 First Year English",
            "review_date": "July 25, 2014",
            "review_content": "\nProfessor Pedatella may be one of the best teachers I have ever had. He is obviously an incredibly smart and thoughtful man who is very dedicated to his field. On top of that, he is great at making everyone feel included and worthy of discussing their opinions, no matter what the subject matter. Everyone in my class actively participated, and that's what made the class so exciting and invigorating. \nProfessor Pedatella is also one of the few professors I've had who are willing to take your opinions on board. There were a number of times when students would bring up something about a piece he had never thought about, and he really took those comments on board. \n\nWorkload:\nProfessor Pedatella does mark harshly, but if you get excited about the subject matter, he will reward you with praise, advice, and good marks. \nThree papers, plenty of time to work on them. \n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "March 09, 2014",
            "review_content": "\nMaybe it's because I'm close to graduating, but I'm starting to get sentimental about college these days. Thinking about the best classes I've taken, thinking about the classes that really meant something to me, well, Pedatella's was one of them.  Critical Writing is a required class for Barnard English majors, and honestly I wasn't expecting much  from the class; but Pedatella's section was a revelation.  The sheer amount of his enthusiasm, passion, and genius made me feel like there was no more important thing in the world than what we were doing when talking about literary theory around the conference table.  He always had these incredible readings of the texts (no one should graduate from Barnard without having taken a class on Pride and Prejudice with him), yet somehow class always felt like this collective effort that we were all a part of. It's weird to me to see some reviews below that talk about how he's resistant to alternative readings of texts; I can't think of another professor I've had who is MORE open to students' differing perspectives.  \nHuge added benefit: he's just a really nice human being.  It's been rare for me to come across a professor who seems genuinely interested in getting to know you. Even though it's been a while since I took his class, whenever I bump into him on campus he always takes the time to ask me about my \"career\" (which is hilarious to me, since I'm about to probably never have one... But that's another story.)\nBrilliant class, brilliant professor.\nWorkload:\nThere's a lot of reading for the class.  Classics of literary theory from Plato to the 20th century.  Plus, he adds works fiction/poetry/drama that accompany the theory.  There were three or four short papers too, I thinnk.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 08, 2013",
            "review_content": "\nPedatella was often late to class and kept us late.  He seems to be very passionate about what we discuss, but he really enjoys making students feel inadequate, unprepared, and stupid about the material.  He frequently would mention obscure terms in Latin and then scoff if we didn't know them.  Essay feedback was not very helpful and seems to be limited to his individual preferences.  Unclear about class/essay requirements.  Participation is a HUGE part of the final grade (25%) but he makes it difficult to participate as he will often \"shoot down\" your comments and tends to embarrass you if he doesn't think your opinion is accurate.\nGREAT course.  I loved the reading and the course material but I would not take it with him.\nWorkload:\nWorkload was minimal.  2 \"regular\" essays and 1 final essay, each requiring a draft and a final version to be submitted.  Reading due every class, yet it's manageable amounts.  Essays weren't difficult but Pedatella's feedback didn't help.\n"
        },
        {
            "course_name": "First-year English: Legacy of Mediterranean I",
            "review_date": "February 02, 2013",
            "review_content": "\nI loved this class. Pedatella is very engaging, passionate and smart, and discussions were always interesting. It's true that he is very convinced in the accuracy of his own analysis, and he has every right to be, but that does not mean he is unwilling to listen to differing ideas unless they are completely boneheaded. The reading was interesting and I enjoyed every book (The Odyssey, Dante's Inferno/Purgatory, The Hymn to Demeter, The Canterbury Tales, and Hamlet), especially because of the class discussions that shed light on parts of the text I'd overlooked. I feel that my ability to read and analyze improved greatly. The rewrites were helpful, but were focused almost entirely on the analysis and not writing on ability, so I don't feel that my writing was helped at all. \nOn the whole: great class, great professor, great books. \nWorkload:\n3 papers, 3 rewrites.\nModerate amount of reading - not unreasonable. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "February 28, 2012",
            "review_content": "\nThis guy is a great teacher. Like honestly everyone who keeps getting pissed off below is just ridiculous. He is one of the most engaging english professors I have ever had. Even if you dont have a class that is very talkative (which is obviously going to be more borring) he is sure to keep the conversation going and asks the class questions to engage everyone. There is never an awkward lul in class, because he knows everything and will share with the class to keep people interested! If you aren't into the readings, I mean that is a totally different problem, but he is great and really cares about his students and will make extra effort to meet with people outside of class to go over essays or to simply chat about the readings. he LOVES the readings, to the point where its ridiculous how dorky he is. \nSome of the reviews below speak to him wanting you to write what he wants... eh to a certain degree every english teacher is going to enjoy read what they have already understood for themselves in the texts, but that doest mean you shouldn't write what you want. He WANTS  you to write what you want as long as you are able to argue it - you can't BS. Also, he doesnt just want you to have an essay with a strand of references from the book, you need to find something and then deeply analyze it - thats how you will get your A. I never got anything below an A- on papers, and sometimes they were written three hours before they were due...\nhonestly he is a great guy who cares a lot about his students and he will especially respect you if you care too and make the effort. \nWorkload:\nreading every week of around 100 pages and three or four essays a semester of around 6 pages. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "February 10, 2012",
            "review_content": "\nStefan's a mixed bag kind of professor to say the least, but I WILL say that he's a very good introduction to dealing with all different kinds of professors at Barnard/CU for that very reason, and I think that's pretty valuable. The conflicting reviews are kind of all right because they all touch upon something that's true about him. He is a decent person and doesn't make you feel like a total idiot in class (perfect for first year English jitters) but he is very adamant about his own ideas. Sometimes, he's really, really right. Other times, he's just really, really stubborn. But you sort of learn how to navigate between the two sides of him, and the real learning comes from whether you bow completely to his will and write what he wants to hear (which is a decent skill alone because there ARE professors who don't want you to challenge them and sometimes to get the grade you want, that's what ya gotta do) or whether you learn how to be diplomatic and pursue parts of your own analytical agenda while still pleasing him and getting the grade you want. And that IS possible. I think that's why a lot of people find him so frustrating--because if you don't figure out the latter, the former feels like you're not getting anything out of what's supposed to be an introduction to challenging higher learning. Go into the class with an open mind, but be prepared to stand your ground if you disagree with him. It'll make you a better student at the very least because you'll get really good at picking out textual evidence to prove your point. \nWorkload:\nDon't remember precisely, there were a few papers, a decent amount of reading and the regulation class participation. Office hours were amusing to say the least. Everyone else on here gave pretty accurate descriptions anyway.\n"
        },
        {
            "course_name": "First-year English: Legacy of Mediterranean I",
            "review_date": "January 18, 2012",
            "review_content": "\nStefan is a fantastic professor! He is engaging, enthusiastic, and pretty brilliant. I got the impression that the experience you have in class is really dependent on the students in the class. If you have a class full of students with interesting ideas, or just the willingness to talk in class and argue a point, you'll surely have a great semester. He definitely emphasized his analyses of the texts, but he has gone through years of education and study to become an expert on the texts, so I didn't mind at all when he offered his own interpretation. He didn't shoot down people with different ideas. On the contrary, he would challenge the student to back up the idea with something in the text until we (as a class) deemed the idea valid or not. I think this made us all better readers in the end. Though he never gave formal instruction on writing, class time was better used interpreting the literature and he made it clear that he would work with any student who needed more writing help outside of class. Overall, I absolutely loved this class, and from what I heard from my friends taking Legacy with other professors, I definitely had one of the best. This class helped to advance the way I analyze literature to a much more sophisticated level. Just make sure you make the time to talk to him before you write your first drafts and re-writes. Usually, talking to him really allowed me to clarify my ideas and I was able to write more coherent papers. Listen to what he says, it is definitely valuable. \nWorkload:\n3 papers: 2 4-5 page papers and 1 7-8 page research paper (but he de-emphasizes the importance of the research aspect; you only need to use one source). Each paper includes a first draft and a re-write, each worth 50% of the paper's final grade. He grades very fairly: my papers all went from B+/A- to A+ and I ended up with an A in the class. \nPapers: 75%, Participation: 25%\n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "May 02, 2011",
            "review_content": "\nhaha, I also have mixed feeling about Stefan.\nLet me start by saying that in the beginning of the year I HATED Stefan, Then I started to grudgingly respect him...and now, at the end of the year, I'm immensely glad that I took his class. I don't plan on taking another class with him, but I'm glad I took this one. He is brilliant, and he absolutely loves his subject matter. His enthusiasm is infectious. By the end of the semester, people were really engaged in high level discussions on the texts.\nOn the one hand, he does have a specific idea about what he wants you to write for some of the papers. I remember when we realized that, even though we all started with different topics for our Genesis papers, our rewrites were exactly the same. Part of the class, especially early on, is about learning to read his mind.\nOn the other hand, he has a brilliant literary mind. If you can learn to read it, then you've developed a solid foundation for analyzing texts. Albeit one that often comes back to sex, as has been noted in earlier reviews. XD I feel like my literary analysis has noticeably improved. He grades papers on content, and that being the case, he forces you to make arguments that you can really support. He'll give you a little more leeway on essay topics though as the year goes on.\nSide note, it's true that he won't help you with your writing - just your literary analysis. (^u^)\nIn conclusion, if you're a generally vocal English student, be prepared to swallow your pride. His analyses are well founded, and he won't particularly listen to your ideas if he thinks they aren't - either in class or in your papers. There are some times when you just have to write what he wants you to write, and you have to be prepared to listen to him talk at you for the first couple weeks. But once you get past that stage, I think you'll really enjoy discussion, and get legitimately excited about your papers.\nHELPFUL TIP: When you can just FEEL that he wants you to write about a specific topic, go to his office hours and argue against it. He'll use textual analysis to support his point, which you can put into your paper. The parts of my papers that he loved the most were the ones he came up with himself. XD\nWorkload:\n3 papers, 3 rewrites, 4 books and some poems (don't bother buying anything past To The Lighthouse)\nIt's really light during the year (because he's always behind), but he crams it in at the end.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 20, 2010",
            "review_content": "\n I'd definitely echo the mix feelings of previous reviews. I would not agree with anyone who called him a jerk. He's super nice even when you say something dumb in class or your essay sucks. However, my main criticism is the total lack of instruction on writing. He didn't give as much as one piece of good advice about how to write at the college level let alone teach writing in any capacity. I was forced to use a sort of trial and error method which, predictably, yielded mixed results. Scratch that. My writing actually regressed under his tutelage (or lack their of). The focus of my personal meetings with him and his comments on my papers was always about general ideas (usually his ideas), which were usually difficult to put into practice.\n That said, the syllabus is really wonderful and Stefan is a really knowledgable and enthusiastic man with an affinity for sex and long words. It's more of an obsession with sex, actually. But that could be more due to the texts rather than him. Class was always interesting and i would probably recommend this class to anyone who wasn't fused about improving the writing.\nWorkload:\nanywhere between 15-50 pages per class.\n2 regular papers, 4-6 pg\n1 research paper, 6-8 pg (but he didn't seem to care about the research part)\n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "May 23, 2010",
            "review_content": "\nThis was one of the best classes I've taken so far. The syllabus is amazing. There's A LOT (too much) of reading for the class, but it's all really fundamental (Plato, Aristotle, Nietzsche, Shakespeare, Jane Austen, Marx, and a lot more). The works we read always seemed to be useful for all of my other classes.  After this class you just won't ever look at theory/ aesthetics the same way again.\nThe syllabus is challenging, but Stefan was a great guide. He was always patient in going over tough points (and incredibly generous when it came to office hours). His enthusiasm for the material was infectious: by the end of the semester I could barely believe I had done all the reading (well almost all of the reading).\nAfter this class you'll really feelmuch better prepared for your other English classes.  The syllabus and the professor are great!  \nWorkload:\nInsane. But totally worthwhile. And from what I hear not that much more than other sections of the class.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 20, 2010",
            "review_content": "\nStefan is an incredible teacher in the classroom and he makes the material fascinating. He is obviously incredibly knowledgeable and enthusiastic about what he teaches. However, as a professor for a class that is supposed to strengthen your writing, I feel that he failed. The grading system he has is very restrictive: you get an actual grade on your first draft, and no matter what you do on the rewrite it will only jump up from a B- to a B, for example.\nIn meetings with him about my rewrites, he would say: \"the way I see it is this...\" and then encourage me to write that. He refused any analysis besides his own, which is really weird. He never offered structural advice or actual paper critique: merely, this part of your argument is wrong, so write it like this. I think he was a fantastic teacher in the classroom but a terrible teacher for improving writing.\nWorkload:\nNormal.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 17, 2010",
            "review_content": "\nI probably agree with everything already written about him, even the conflicting reviews. The bottom line is that Stefan is sort of full-of-himself and definitely picks favorites, but he's really into classic lit and teaches the first semester very well. He makes everything exciting, and studying the Odyssey with him is amazing. Legacy I is great over all. \nHowever, I would advise against taking the second semester with him as he suggests, because it gets old very fast. After a while, you realize that doing well mostly depends on doing two things: sucking up to him and spitting back his ideas in your papers. (Obviously, he is there to teach us and has studied these works extensively, so his ideas will be well-founded. However, this style of teaching leaves little room for independence or growth.) \nAlso, class environment is key. If there are any annoying love-stuck girls who are trying to show-off to impress him, it is not fun.\nBasically: Good for one semester, but wears off fast. Really think about whether or not you want to stick around for a second semester, and definitely check out the reading lists for the different FYE classes as well. \nWorkload:\nFirst Year Seminar/ Legacy I: 2 5-6 pg. papers and weekly notes about the reading\nFYE/ Legacy II: same, but no weekly notes, + 1 8-10 pg. \"research\" (not really at all) paper for FYE \nAll papers are rewritten, and the two graded drafts are averaged for the overall grade. \nYou must meet with him briefly at office hours to discuss each draft. He is either very helpful or extremely annoying- or both. You usually end up incorporating most of his ideas.\nReading assignments start off heavy and get much lighter later on, when you realize that the class is always way behind schedule. \nFor the most part, he is not a very hard grader. However, you really need to have exactly what he wants to get an A.\nAlso, he is very flexible with deadlines if you have a valid reason (personal, health, or just a lot going on). This is definitely a point in his favor. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 21, 2010",
            "review_content": "\nThe enthusiasm that Stefan (he insists that you call him Stefan, never \"professor\") has for what he teaches is both astounding and inspiring. I was lucky enough to be placed in Stefan's class during my first semester, and I loved his class so much that I signed up for another semester of Legacy with him. Class is never boring. We talk about sex a lot, which is amusing, and yet somehow always relevant. Stefan is very encouraging and has the effect of making you feel really good about yourself. Also, his enthusiasm for the literature he teaches is contagious. In the two \"Legacy of the Mediterranean\" courses I took with Stefan, we never finished all the books we were supposed to cover. Stefan can get carried away in his joy of imparting his knowledge of these books, which he clearly considers very important, and as a result the class goes into more depth with less books. Stefan will always make time to talk to you if you would like to discuss something more deeply. He holds his office hours at the Hungarian Pastry Shop, which is pretty awesome. Yeah, he's kinda hipster and a little pretentious, but doesn't everyone have their flaws? These attributes in no way get in the way of his teaching. Stefan Pedatella is an absolutely fantastic professor. Take his class if you have the opportunity!\nWorkload:\nManageable, especially since Stefan's enthusiasm rubs off on you and you know he'll be legitimately sad if you come to class unprepared. People say he's a tough grader, but I suspect that those people are accustomed to incredible grade inflation. Stefan is definitely a fair grader, although he will push you and he expects you to put solid effort into your writing.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "June 06, 2009",
            "review_content": "\nIf we're honest with ourselves i think there's one thing we all have to admit: Stefan is the best teacher any of us have ever had or ever will have.  If good teaching is about knowledge of the books, passion for the books, and ability to inspire enthusiasm in you about books, then Stefan's just the best.  He clearly thinks that these books are a matter of life and death and if you care even 1% about reading he makes you feel the same way.\nMy only objection about his style is actually kind of related to the great things about him: He care sooo much about making literature come alive that he sometimes forgets how important our grades are to us.  I mean I haven't done badly, but staring at a B+ on your papers can dampen your spirits a little (even when you know you deserve it...).  \nAn awesome experience sitting in his class though.  I can't say I get the criticism somewhere in one of the other reviews that he \"clearly thinks he knows more than his students.\"  Isn't that what he's paid for?  Would you want your prof to know less than you?  But he's so nice about everything, and so easy to talk to one on one.  And really, one of the best things about Stefan is the way he made me feel like my opinion really mattered, was really valuable, even though he's been reading these books for like ten years or more.  It was his class, and talking to him during office hours that convinced me to stay at Barnard when I was thinking about transferring.\nDefinitely the best experience I've had at Barnard so far.      \nWorkload:\nHard and easy at the same time.  Easy in the sense that there isn't that much reading.  Hard in that he demands a lot from you, especially in your essays.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 12, 2009",
            "review_content": "\nMixed feelings about Stefan. In terms of workload this class was easy and at the same time kind of hard. Easy in the sense that the class is taught as a seminar so its okay to be behind on the reading (but there is a final!). Hard in the sense that its difficult to know what he wants for papers.\nStefan's really likable and sweet, but you have to deal with every girl in the class flirting with him. \nOverall I liked the class. It was fun and it really did improve my writing. \nWorkload:\ntwo 4 pg papers, one 8 page research paper, very manageable reading\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 08, 2009",
            "review_content": "\nI actually had Stefan as my professor for First Year English Legacy of the Mediterranean, and I found him to be a pretty great professor, and the class one of the best Iâ€™ve taken so far at Barnard.\nItâ€™s true, Stefan is pretentious, and he clearly thinks he knows more than anyone else, but despite what the previous reviewer said, this in no way makes him unfriendly or unapproachable. On the contrary, I found him extremely approachable. He never shot down what people said in discussion, and he was practically always available for office hours at the Hungarian, where he was willing to discuss the papers and the readings thoroughly. I do agree with previous reviews in that Stefan clearly wanted our papers to fit into his interpretations of the works, and often the revisions he gave us were simply to add in his ideas, but he was open to other interpretations if you gave him valid reasons.\nItâ€™s also true that he does not get through all the assigned reading, but I do not think this is any way a bad thing. Rather than speeding through the syllabus, he spends extra time discussing the works and truly making you appreciate them. You will leave this class with an appreciation for the works you have read, I can practically guarantee that. And then you can take what youâ€™ve learned in the class and read the last two or three books on your own time, and you will probably appreciate those too. Anyway, I donâ€™t know anyone who would be upset about not having to read hundreds of pages a week, but instead spend more time analyzing each book over a few weeks.\nAltogether, this was an amazing class. You read great books and you really come to appreciate them. Just take Stefan with a grain of salt. He really does know what heâ€™s talking about, even if sometimes he has to hit his students over the head with that fact. You can tell he really loves what heâ€™s doing, and his passion for his job and for the books makes you enjoy the class that much more.\n\nWorkload:\nCompletely manageable. Very short reading assignments each week. Two 4-5 page papers with rewrites and one 8-10 page research (only 1 or 2 sources required) paper with a rewrite. Final on the last day of class.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 04, 2009",
            "review_content": "\nI disagree with the review below me. I never write CULPA reviews, but I feel like I need to go out of my way. He is probably one of the most interested, dedicated, approachable, not to mention--knowledgeable professors here...definitely the best I've had thus far. Most professors at Barnard/Columbia don't event remotely care about their students and are insanely hard to get in touch with, but Stefan goes out of his way to schedule office hours that are actually ridiculously accommodating, replies to every email, and just overall genuinely cares. Plus, he's not that tough of a grader to be honest; every grade you get is one you deserve. The only criticism I would have is that we don't get to most of the books (but that just makes for more interesting and less rushed discussions of the books we do get to), so do NOT buy the entire box of books beforehand. Seriously, consider yourself lucky if you're in his class; his sheer amount of knowledge alone will blow you away. Plus, he's pretty freaking awesome as a person. \nTAKE ANY CLASS HE OFFERS!\nWorkload:\n3 essays with re-writes, final, light reading since we don't get to everything\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "April 12, 2009",
            "review_content": "\nStefan is disgustingly overrated. Yes, he is smart. Unfortunately, because Stefan is so simultaneously cocky and self-conscious, the class serves as one huge attempt for Stefan to (unsuccessfully) prove to his students that he is the absolute authority on literature. And philosophy. And everything. Ever.\nDon't take his class if you like friendly, modest, approachable profs. Don't take his class if you want to be a better writer. He is easy, considering the fact that he puts practically no effort into assigning and grading work. He is a decent grader (I got an A- with little effort). \nHis grading policy works like this:\nIf he likes you (and if you are a halfway decent writer), he will give you an A- or a B+ on your first paper. Then, if you change your paper AT ALL for your second draft, your grade will go up half a step. He will usually ask you to incorporate more of his ideas, or ask you to change your own arguments completely so that they align with his. That's what Stefan calls \"teaching.\"\nIn meetings, he attempts to be your friend while also patronizing you. Please, don't confuse his arrogance for genuine intelligence.\nWorkload:\nThree papers with re-writes, a decent amount of reading (though you might as well listen to Stefan lecture and regurgitate his ideas instead of reading the book and forming your own thoughts).\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 31, 2009",
            "review_content": "\nI have mixed feelings about Pedatella's class. I enjoyed the class discussions very much, and perhaps what also made me enjoy the class so much more was the fact that after our discussions I came to actually appreciate the texts we were covering, which in the past I always remained disinterested in them. \nHowever, I didn't feel he managed the short time span of the semester too well, considering we didn't get through all the reading and he ended up assigning a paper rewrite along with a final research essay at the same time within the last week of the semester. I also couldn't follow his grading procedure to well- sometimes it seemed as though I simply lost points because I wasn't generating ideas along the lines of the ones he was expecting to see.\nRegardless of his disorganization, his class was still probably my favorite last semester. I would recommend his class to those interested in completely rediscovering the literature of the mediterranean.\n\nWorkload:\nvery manageable readings, three papers (two 4-5pgs, one 8-10) and a final\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 18, 2008",
            "review_content": "\nI'm a little surprised to see all the gushing reviews of Stefan. \nWhile I did enjoy class time with him (he's funny, and very casual), he was a little bit insane. For example, he assigned the final (research!) paper about a week before the end of the term. Also, he was an extremely hard grader but he didn't have constructive comments, either. Don't get me wrong, class time is fun (you talk about sex a lot...) but I felt like a lot of students were frustrated with his grading policies and organizational skills.\nWorkload:\nnormal for legacy or a little less, since we didn't get through all the books assigned.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 08, 2007",
            "review_content": "\nI am generally wary of reviews that gush excessively, but there is no way to overestimate my respect for this man.  Stefan is the kind of professor you dreamed about when you decided to come to Columbia.  He illuminates every book, providing valuable insights into everything from Herodotus to Augustine to Woolf.  Stefan will have a brilliant idea, lead you right up to it, and when you say it for him he makes you feel like it was your idea all along.  If you disagree with his reading, he will always entertain an alternative view so long as it is intelligent and well-\nconsidered.\nAs for the difficulty of Stefan's section, this is Lit Hum so it isn't exactly a walk in the park.  He expects you to come to class every day having read the material thoroughly, but with literature this incredible and a professor this invested, it's hard not to do the reading.  His essay assignments tend to be on the difficult side but always interesting.  He grades fairly on the essays and will always provide ample comments to explain the grade--Stefan does not hand out As, but he doesn't want to fail anyone either.  To wit, he deliberately makes his midterm easy to compensate for the relative difficulty essays.\nWorkload:\nStandard Lit Hum.  Obligatory Reading and 2-3 essays per semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2006",
            "review_content": "\nLooking back at my year in Lit Hum with Stefan, I realize that I had the kind of Lit Hum experience I hoped for when I was a prefrosh anticipating my first year at Columbia. He's young and hip (he wore a home-made Shangri-Las t-shirt on the day of the final), so he didn't ever make me feel nervous, but he also really knows his stuff. He's taught Lit Hum for several years, and based on that and the fact that he's just a brilliant and well-read man and an extremely gifted teacher, he was able to impart the material in a way that really stuck with me. \nStefan related the Lit Hum texts to philosophical ideas that I found rather eye-opening, and he did a wonderful job of demonstrating how all of the texts are somehow related. He has strong opinions about the curriculum, but he's willing to listen to others' as well, and he certainly doesn't dominate the class - no boring lecturing here. \nAlso, the value of Dante read aloud (nay, recited from memory!) in Italian must never be underestimated.\nSome people seem to think Stefan plays favorites, but the truth is that he does call on any student who has something to say and is disappointed when the same few students are the only ones who care to speak in class. \nHe's very understanding as far as workloads outside of the class go, and above all, he's very easy to get ahold of outside of class: he's practically always grading papers or doing his own work at the Hungarian Pastry Shop.\nWorkload:\nReading from the Lit Hum syllabus plus a few extras (including lyric poetry, selections from the Purgatorio and the Paradiso), short weekly responses, 2-3 five-page papers per semester. Class participation seems to count for something as well.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 22, 2006",
            "review_content": "\nWell there is no doubt that Stefan Pedatella is one of the most amazing lit hum teachers ever, but he also is one of the toughest graders ever.  His midterm is reasonable but papers are grader very harshly.  Also, he definitely picks his favorites and if you're not one of them, its very easy to be overlooked in the class.  I recommend him to the english majors. Everyone else: Beware!\nWorkload:\n3 papers, weekly responses, midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 19, 2006",
            "review_content": "\nThe most difficult decision I had to make during my first semester at Columbia was switching out of Stefan Pedatella's Lit Hum class for the spring term.  In the end, too many scheduling conflicts left me with little choice and much regret.  Stefan's passionate and charismatic teaching style caters to two distinct types of people: 1) those who like reading and 2) those who don't.  If you enjoy reading the Lit Hum books, and if you actually read them, then you will be pleasantly rewarded by Stefan's brilliantly guided discussions that allow you to fully develop your own ideas about the texts, while at the same time presenting you with a panoply of subtle morifs and anomalies that raise essential questions about the objectives of each work as a whole.  If, on the other hand, you ascribe to the latter school of thought and occasionally gag at the site of a really long book, then have no fear, because Stefan makes sure to discuss all of the important points of each text in detail with impeccable clarity and acumen.  However, Stefan's true genius as a teacher lies in his almost magical ability to lead class discussions in which his participation is minimal.  He stands up in front of the class, asks, \"So guys, what did you think of last night's reading?\", then writes on the board the important points that we bring up, and after injecting only a few small hints into the ocnversation, the topics slowly converge onto the essential ideas of the text.  Adding to all of this is Stefan's immense enthusiasm for the Western Cannon, which truly makes his class unforgettable.      As mentioned in previous reviews, he can be a tough grader on the papers, but as long as you sit down with him once during his office hours you'll get the idea of what kind of paper he's expecting, and you'll do just fine thereafter.  Bottom line, if you ever have the option of taking a class with Stefan Pedatella, do so.  \nWorkload:\n3 papers, the grading of which is very hard but very fair.  He basically gives you the grade you deserve instead of an inflation thereof like most Ivy League professors.  1 midterm and 1 final which are graded considerably more leniently than the papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 04, 2005",
            "review_content": "\nStefan is absolutely amazing. I have never had a professor who workd so hard or cared so much about a class. He makes even the most mundane readings interesting, and is always able to talk about obscure or unusual details from the books.  He makes it  worthwhile to go to class and actually care about the homework. The man is simply incredible.\nWorkload:\nNot too bad, the standard syllabus with some minor additions. Weekly response papers, but only 250 words each and they're all pass/fail. He cut out the third paper from this semester, so it's clear that he's not trying to overload the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 19, 2005",
            "review_content": "\nStefan is an incredible teacher.  He is mind-bogglingly intelligent - I think it's safe to say that he knows everything in the entire world.  His discussions are interesting, thought-provoking, and funny.  He is very accessible outside of class.  Very tough grader, but it's not a bad thing because he motivates you to work really hard.  \nWorkload:\n2-3 papers per semester, weekly responses to readings.\n"
        }
    ]
}