{
    "prof_info": [
        {
            "prof_name": "Vincent Debaene",
            "prof_id": 3165,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 09, 2009",
            "review_content": "\nI think Debaene is a young and up and coming professor, especially in his field of expertise (anthro), but I did not like him as a Lit Hum instructor. Class discussion is nonexistent and it is not uncommon to see students bored to sleep in his classes or for there to be extended awkward periods of silence. Although his English is generally understandable/clear and his accent can be endearing, he lacks the ability to probe the text beyond simple generalizations and characterizations. This class is more about reading for plot and structure than it is about exploring the true meaning and significance of the text. His essay topics are often quite silly and simplistic and I sincerely doubt his competence as a grader. Your grades on assignments do not correlate to your final grade, and he can be both harsh and overly forgiving, depending. The workload can be irritating, especially the weekly courseworks postings which seemed to serve no real purpose other than busying the students with useless work. Although he is a nice person, he can come off as a terse or aloof, even when students seek help. He also has a classroom demeanor that is vintage European/French, meaning this class is not one in which you will have a particularly fun time.\nWorkload:\nThree papers of varying length, midterm, final, weekly courseworks posting.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 22, 2009",
            "review_content": "\nHe definitely made a 9 am class fantastic, which is no easy feat.  He mixes lecturing with discussions very well and offers great insight.  His French accent really isn't a big deal (girls like it).  In his defense, he once said he has read Culpa and now pronounces \"focus\" very carefully.\nWorkload:\nIt's pretty standard, though he does cut down the reading (amazing!).  Take the class!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 17, 2008",
            "review_content": "\nAn absolutely amazing teacher. Sitting through almost 2 hours of class at 9am sounds horrible but because he is such a great, engaging teacher, you actually don't mind being up at 9. Lit hum is my favorite class and its definetely largely because of him. He is intellectually engaging and likes to delve deeply into readings and he asks complex questions to make sure we think about the books. He is also French and has an accent, but his english is actually really good and it is not difficult to understand him; his accent is really endearing. He comes to class always dressed nicely in dress pants and a collared shirt which is nice. You don't have an option for your lit hum teacher, but if you get assigned to him, count yourself as lucky!\nWorkload:\nLots of reading like any lit hum class but he cuts down the reading for some books so totally manageable. Courseworks questions to respond to every week. 3 papers first semester (2 pages, 6 pages and 7 pages) and 2 second semester (6 pages, 7 pages). Papers are hard but he is a fair grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2007",
            "review_content": "\nProf. Debaene is a very nice teacher. He is interested in his students, and he is very smart. He is French, and his English is understandable, and actually makes the class easy to stay awake in at 9 am. (Ie: He pronounced the word \"focus\" like \"fuckus\")He asks complex questions in class, and he values participation, however class participation can be made up in contributing to courseworks more productively. He grades fairly on papers. \nWorkload:\nMidterm, Final 2 papers of about 7 pages each a little courseworks now and again.\nCurves on Midterm were generous. Papers were hard to write (as all lit hum classes are) but he is a fair grader (he doesn't give out too many C's) \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 27, 2007",
            "review_content": "\nprofessor debaene is nice enough, but frankly he does not speak English well.  he's been in nyc long enough that he shouldn't still be mispronouncing every other word, not to mention have retained so thick an accent.  it makes his lectures harder to understand, and the thick accent is distracting.  Not to mention the fact that I'm sure he would lecture better in his native language.  I often feel like he doesn't express himself very well, and I'm going to give him the benefit of the doubt and assume it's because of his limited ability to express himself in English.  \nI suspect he doesn't always understand what his students are saying as well, which is annoying.\nbesides that, it's nice that he wants everyone to speak up in class and participate.  On the other hand, the discussion he tries to facilitate isn't really what the students are interested in, he usually asks leading questions because he wants to direct students to a point he wants to to be made, via class discussion.  I don't like this strategy, mostly because it wastes time and isn't that engaging.  I wish he would just lecture for 30 minutes on what he thinks is important about the text, and then let students build on that and bring in their own ideas and thoughts.  instead he usually spends all of class time trying to direct students'  comments into expressing his own ideas.\nI give him a b- as a professor\nWorkload:\nnormal\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 17, 2007",
            "review_content": "\nI was assigned Professor Debaene for lit hum at the ghastly hour of 9 am.  It was his first year at Columbia - it certainly his first time teaching lit hum.  No matter how miserable of a state I would be in class, Professor Debaene would always manage to stir up an interesting class discussion.  He does a very healthy balance of lecturing and class discussions.  His original field of study is anthropology.  Also keep in mind that he had read most of these books in french before.  This however should not be taken as a drawback to his teaching - in fact, his background in anthropology often provides fascinating prompts for discussions.  Professor Debaene's style of teaching summarized in one phrase would probably be \"never take anything for granted.\"  He seems to be strongly opposed to letting our personnal opinions or spins on texts get in the way of a strictly objective analysis of the text.  In all, he is a fantastic teacher.  Class is practically never dull.  He'll ease in a few jokes every once in a while.\nWorkload:\nNot too bad.  He's not like some of those \"crazy\" lit hum teachers who are big on memorization of every possible character.  He's more interested in the quality of the knowledge we acquire than the quantity.\n"
        }
    ]
}