{
    "prof_info": [
        {
            "prof_name": "Robert Lieberman",
            "prof_id": 168,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "January 05, 2008",
            "review_content": "\nThis is a great class if you want to learn about the beginnings of welfare in the United States and the recent history of welfare through the Clinton administration.  The lectures were always interesting and worth the early wakeup call, but be aware that the class will often seem much more like a history course than a political science course.  Thus, there's a bit of difficulty in determining how to answer the extremely vague essay questions; many readings are not discussed in lecture and aren't discussed well in recitation and you are on your own to analyze and cite them in the papers.  The midterm was graded pretty harshly, probably just to make students take the class seriously, and did not pose a detrimental threat to your overall grade for the class.  The best way to approach the papers is to pick a very specific issue and analyze the heck out of it rather than trying to describe everything about the New Deal in five pages. \nWorkload:\nmedium, but frustrating at times.  Two take-home papers: a 4-6 page midterm and 6-8 page paper both with very broad questions that can easily double for a PhD dissertation, much easier in class final.  \n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "January 17, 2007",
            "review_content": "\nProfessor Lieberman was extremely knowledgeable about the subject and always had funny stories to tell about the origins of a random social policy.  If you can get through the first part about England, which was not nearly as interesting as the latter part, it is a great class.  His lectures are a must because he goes over all of the important information from the readings in it.  I didn't do all of the reading but did well in the class because his lectures were so precise.  Also, when he doesn't know the answer to a question, he admits it and will find it which I found a welcome change from some others.  \nWorkload:\nreadings (i only did about half and did well), take home midterm paper (5-6 pages), final paper(6-8 pages), and a final that was manageable if you studied (short ids, and short and long essays); the TA does do a lot of the grading \n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "December 11, 2006",
            "review_content": "\nI disagree with previous reviewers (or perhaps he's changed the syllabus), thought that the historical/European background info was compact & relevant to understanding contemporary attitudes. Per the title, it is AMERICAN Poli & Soc Welf though, so don't expect much in the way of comparisons to other systems that actually work. He lectures with evident passion & knowledge about the subject matter & American history in general. Never saw him consult his notes once during a lecture, always seemed prepared & excited about the topic of the day. Frequently injected his lectures with amusing political facts and interesting historical anecdotes. Clearly a liberal but he's a pro at presenting all sides of the debates.  Seemed like a hard-ass the first week but he loosened up considerably after the obnoxious \"mememe's\" quit wasting their(our) time asking frivolous questions just to prove they had read the material. He's boyishly charming & super personable, so expect a few googly-eyed history femmes sitting in the front row.\nHis TA was awful, btw.  He was frequently the tardiest person to class and was clearly an inexperienced section leader.  I did well on the papers but his comments were undecipherable. There was some mix-up in the beginning of the semester and he ended up being the only TA assigned to our class, so maybe he was a fill-in.  Only required to attend 4 sections but they were all a waste of time.\nWorkload:\nDon't be fooled--only 1 (take-home) midterm, 6-8pp final paper & essay-centric final, but don't skip the readings, close-reads were essential for all 3.\n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "January 18, 2005",
            "review_content": "\nProfessor Lieberman is a great professor. His lectures are well organized and easy to follow and liten too. He's very easily available to discuss class material. With alittle effort it's not too difficult to get an A in this class, though that would in some cases depend on the TA.\nWorkload:\nTake Home midterm, term paper, 8-10 pages, in class final\n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "January 17, 2005",
            "review_content": "\nI found Lieberman to be pretty good, but highly repetitive at times.  He was for some reason incapable of gauging when the class understood something, and would explain and re-explain simple concepts, often to the visible frustration of the class.  He would sometimes take 30 mins to say something that everyone understood after five, but I guess there are worse crimes.  I personally found the TA (Enrique) to be vastly more engaging than the professor himself: Lieberman taught rinky-dinky high school American History, and the TA brought more nuanced and clear view to it and really made it what \"Political Science\" is supposed to be.  That being said, the readings were excellent and in the end I really did get a pretty good understanding of American Welfare, although not much else.  Keep in mind you won't learn anything about the European or other welfare systems.  It was solidly Ohhh Kaaay, but I wouldn't go out of my way to recommend it.  \nWorkload:\nTotally manageable.  Take-home midterm, 6-8 p paper, attendance and part. at 4 discussions, and a final exam.  But the essays did require some thought, and weren't just input-output polisci-speak, if you know what I mean.\n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "January 20, 2003",
            "review_content": "\nProf. Lieberman actually made me want to get up for a 9am class. His lectures were clear, well-organized, and interesting. He is very knowledgable on the topic of welfare. There was a fair amount of reading, most of which was necessary. Most of the time it was interesting, and Prof. Lieberman explained it in class.\nWorkload:\ntake-home midterm, short paper, in-class final...none was too difficult, but they did require some thought\n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "January 11, 2003",
            "review_content": "\nI thought the class and Professor Lieberman were excellent. I agree that Lieberman spent too much time in the beginning of the class covering early British welfare policy, but it was relevant and it did provide a good background for understanding the American welfare state. The readings were very well selected, and quite provocative, and Lieberman's lectures were extremely organized and interesting to listen to--even at 9 am. The subject material of the class is fascinating and so important for understanding American politics and society, and is not your typical poli sci course material. Lieberman is a funny, engaging guy, who cares passionately about what he teaches. I would highly recommend this class (or any class taught by Professor Lieberman) to anyone.\nWorkload:\nOne take-home midterm (basically an essay of about 6 pages), a paper (6-8 pages), and a final (pretty reasonable questions--IDs, short essays, and a long essay)\n"
        },
        {
            "course_name": "American Politics and Social Welfare Policy",
            "review_date": "December 23, 2002",
            "review_content": "\nIf you go into this class expecting to come out with a detailed knowledge of the contemporary American welfare state, then don't take it. This class should be called \"American History Through the Lens of Social Welfare Policy\" because that is really a more accurate description. Lieberman lectures well and is extremely knowledgeable about the history of welfare in the U.S. and in Great Britian. In fact, he spends a good portion of the class on the the history of the British welfare state...too much time, in my opinion. Because he spends so much time on a very historical analysis of the development of the American welfare state, he leaves little time for learning the gritty details about the way TANF and Medicaid function. Despite my complaints, I would recommend this course to anyone who wants to better understand welfare policy.\nWorkload:\nAbout average for a Poli Sci course. Some of the readings were very good and overall doing the readings was necessary for success in the class. There were four or five discussion sessions with the TA to discuss the reading...attendance is mandatory but you don't actually have to do the reading to attend the section. Take-home midterm (4-6 pages), final paper (6-8 pages), and a final exam. Lieberman isn't a particularly good question writer so the paper and midterm didn't easily lend themselves to writing cohesive essays, but the TA allowed you to submit drafts for review for the final paper. The final wasn't too difficult.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Lieberman teaches the ideal american gov't class. He stays broad enough to cover all the bases to make sure you get an idea as to what American Gov't is all about. His lectures are boreing at times, but generally entertaining. He takes questions regularly in class and actually turns parts of lecture into debate with him taking whatever positioin seems to be the least popular. The occaisonally dry material is made mildly amusing by miscelaenous anecdotes from the Professor's career and extensive knowledge of history. The reading isn't too bad- pretty interesting and generally well-written. As for grading- its pretty lenient. Workload: aprox. 5 hours of reading/week, take home midterm makes for a hellish weekend, 6-8 page term paper, and in-class final (pretty easy). Definitely recomended.\n"
        }
    ]
}