{
    "prof_info": [
        {
            "prof_name": "Brian Mailloux",
            "prof_id": 3152,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Python for Environmental Analysis",
            "review_date": "April 21, 2015",
            "review_content": "\nBig Data with Python\nThis is one of the most useful classes I have taken at Columbia.  Brian approaches this class as a way to learn practical skills for data analysis and graphing for environmental science.  He makes compsci ideas approachable for someone with no background in programing.  As a professor, he is super approachable and helpful.  \n\nWorkload:\nThe class is 'flipped' so you do background work outside of class (like code academy) and then work through workbooks of applications of the ideas in class.  Small amount of homework outside of class, and a final group project done almost entirely in class.\n"
        },
        {
            "course_name": "Ecotoxicology",
            "review_date": "December 30, 2013",
            "review_content": "\nThe topic of this class is extremely interesting, but the class is poorly organized.  Brian seemed to decide what we would do in two week increments.  The plus side of this is that he is very open to suggestions for where to place focus.  He's very friendly, a fun guy to be around, incredibly laid back.  Sometimes in class we would discuss a scientific paper or pop science book.  Sometimes we would workshop some simple high school chemistry type problems with an ecotox application.  Sometimes he would show pictures of chemical treatment plants, or computer models of air pollution.  For a while we each did a short presentation on a chemical and how it behaves in the environment.  At the time I thought the laid back nature was teaching me less than jam-packed courses, but looking back I remember more key concepts from this class much more demanding classes like Intro Bio.  You get lots of chances to talk about the material with your classmates, which I think is lacking in the sciences.\nIf you are a non-sciency Environmental person, this class could be a good opportunity to get a little more quantitative while learning very policy-relevant information about how pollutants travel.  If you have a good science background, particularly if you were strong in General Chemistry, the problem solving will be overly simplistic for you.\n\nWorkload:\nAs a science student, this was a blowoff class, plain and simple.  For people who haven't taken much or any college science, this could force you to spend some time reviewing high school chemistry, but it is still not a hard class.\nThe reading on the syllabus is completely unnecessary unless he specifically says in class to read it.  Don't waste your time.  Learn to do the couple of math problems we go over in class and remember big concepts from class discussion.  The tests can feel a bit rushed if you're slow at math and problem solving like me, but his grading is VERY generous.\n"
        },
        {
            "course_name": "Water, Sanitation and Health",
            "review_date": "December 25, 2012",
            "review_content": "\nI have no idea why this prof has a silver nugget. He clearly has some kind of social anxiety issues or organizational problems that make it really difficult for him to teach. As much as I want to sympathize with him, he simply can't finish his thoughts coherently, answer tough questions or challenges during the lectures, or respond in a timely manner to emails. When he gets nervous, he stammers or talks with his eyes closed and doesn't put words together in an understandable order. His Courseworks page is littered with unnecessary reading assignments and video links with little delineation between what is required and what isn't. He is always \"around\" for office hours, but says often that he won't be in his office but that you can always look around and find him.\nThe most frustrating part about Brian's communication problems is that the course material is not difficult. What is taught in this class could be taught in a week, and the final is 75% common sense. The first question on it this year asked what you should do if you arrive to a town to do a water sample, but the land owner is insistent upon having tea with you first. It felt like fifth grade.\nIf you're genuinely interested in health, do not take this class. If you already know basic information about clean water and its role in health, you will learn absolutely nothing.\nThe first semester is spent discussing different types of wells, and how to use formulas to measure how quickly water moves underground. The second part is spent on a presentation that you'll give about a bacteria or virus that is usually waterborne, and then you do a group presentation where you literally just summarize a community health report paper. \nWorkload:\nOne midterm, one final. Both are super-simple as long as you go to every class and glean the important material (usually ten minutes' worth) from the lecture. Two homework assignments worth 20% each. One easy paper.\n"
        },
        {
            "course_name": "Water, Sanitation and Health",
            "review_date": "November 07, 2011",
            "review_content": "\nI took Bryan's Water, Sanitation, and Health class last spring. I REALLY enjoyed it. He knows so much about the material and is extremely passionate about the subject. He is available to students and really wants to help you learn the material. I would highly recommend this class. We had a midterm, a couple of problem sets, a hands-on homework, final exam, individual presentation, and a group presentation. He doesn't grade harshly, and his exams were very fair and only covered what we talked about in class. No need to buy the books for this class as he will lecture you on everything you need to know. \nWorkload:\nMidterm, Final, One group presentation, One individual presentation, a couple of problem sets, one hands on homework. Light reading, but you don't have to do much of it.\n"
        },
        {
            "course_name": "BC3016 Environmental Measurements",
            "review_date": "December 20, 2010",
            "review_content": "\nI really really really enjoyed Brian's Environmental Measurements class. He is VERY willing to work with students to make sure that they understand the material. He is very available, for example his office hours one day were for about 6 hours straight! That being said, the class is a lot of work but nothing too terrible. There are weekly lab reports with one larger lab report towards the end of class. There is no final exam, just a five minute presentation on the data from our individual experiments. I highly recommend this class.\nWorkload:\nWeekly lab write-ups, one longer Water Chemistry Report one, one paper review, presentation\n"
        },
        {
            "course_name": "BC3016 Environmental Measurements",
            "review_date": "December 28, 2007",
            "review_content": "\nBrian is a great professor. He is really willing to work with his students and make sure that they really understand what he's teaching. He also really makes an effort to be available outside of class and gives out his cell phone number to students. That being said, this class is INTENSE. It is SO much work. The work is really, really interesting, but the lab reports are absolutely killer. Do not leave them to the last minute. Just don't. This is a great class to take if you're interested in the Hudson River, estuaries, and aquatic ecosystems, but the workload is significant. \nWorkload:\nWeekly lab reports in the beginning of the semester, then three massive reports in the second half of the semester. Also, numerous field trips (but they are generally fun). \n"
        },
        {
            "course_name": "BC3016 Environmental Measurements",
            "review_date": "December 28, 2007",
            "review_content": "\nBrian is a great professor. He is really willing to work with his students and make sure that they really understand what he's teaching. He also really makes an effort to be available outside of class and gives out his cell phone number to students. That being said, this class is INTENSE. It is SO much work. The work is really, really interesting, but the lab reports are absolutely killer. Do not leave them to the last minute. Just don't. This is a great class to take if you're interested in the Hudson River, estuaries, and aquatic ecosystems, but the workload is significant. \nWorkload:\nWeekly lab reports in the beginning of the semester, then three massive reports in the second half of the semester. Also, numerous field trips (but they are generally fun). \n"
        }
    ]
}