{
    "prof_info": [
        {
            "prof_name": "Brent Stockwell",
            "prof_id": 2753,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 10, 2014",
            "review_content": "\nThe course has changed drastically since the last review as Prof Stockwell has implemented a \"flipped classroom.\" Although this means more day to day work (hwk quizzes, in-class questions, team problems), I feel that it has drastically improved the course. I thought biochem was going to be an agonizingly detailed look at mechanisms, but was pleasantly surprised when the material was relatively conceptual and brain-teaserish at times. The only downside is that there is no curve, but the drop policy is fairly generous so an A range grade is very doable.\nWorkload:\nRelatively light for a columbia premed course. 4 exams (1 dropped, including final), hwk quizzes for each class on videos, papers etc. Team problems for last 20 mins of every class. \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 04, 2014",
            "review_content": "\nI want to begin to say that I did not fail this class, nor did I do amazingly well. Now that the end of the semester is winding up, I will probably get at least a solid B in this class. Which isn't great for premed, but I honestly don't give a rat's ass anymore. Words cannot describe the amount of hatred I have towards this class. But let's start with the bright side:\nThe Good:\n1. Stockwell himself is a nice guy. He actually cares about his students, and he does have office hours for those foolish enough to want to spend even more time with him. He also remembers everyone's names. EVERY SINGLE PERSON. IN A 200+ LECTURE. Which is impressive, but terrifying. He can also be humorous (if you appreciate awkward jokes). \n2. The class itself is really easy to do well in. Stockwell gives a lot of opportunities to accumulate points in the class that are not dependent on exams (haha. more on that later. just wait for this). \n3. Exams are pretty straightforward if you like to do bitch work and just memorize his goddamn slides.\n4. The class itself if rather organized, and this class was had one of the most elaborate Courseworks pages I have ever seen. \nThe Bad:\n1. The homework. Either a 30 minute long video of just Stockwell sitting there, reading off a goddamn slideshow, and trying to make the course more interesting by including raps about the TCA cycle during the video (but he fails to send you links to the beautiful musical numbers for reference in the future), OR a goddamn paper. And not just any type of paper (oh no, not the short, sweet, 4 page papers that most professors assign), I'm talking about 60 page reviews. REVIEWS. WHAT. IS. MY. LIFE. I DON'T GIVE A SHIT ABOUT GLUTATHIONE, WHY ARE YOU MAKING ME READ A REVIEW BY A GUY WHO LOOKS LIKE SHABBY FROM SCOOBY DOO. \n2. Daily quizzes. Every F***ING day. So basically, there are homework quizzes, worth 10% of your grade in total, that you take submit every day before class. The quizzes should be on the homework that was assigned, but oftentimes the questions don't really correspond with the material. The lowest 4 quizzes get dropped. \n3. Learning Catalytics. Basically, even though lecture is completely useless and a waste of my time and my life and the universe, they are mandatory. Sit and listen to Stockwell drone on for an hour, reading off of his projector (which are just his slideshows that he posts on Courseworks), adding no additional material to what you would learn from the slideshow. AND they are worth 15% of your grade.\n4. Group Quizzes. This part isn't bad, but it's stupid and tedious. You basically get assigned a group and after every class you do like, 4 questions with your group members. This is quite an easy way to boost your grade (worth 15% of your grade) and you get to drop 4 group quizzes.\nThe UNBEARABLE:\n1. As I mentioned, I will probably get a solid B in this class. BUT MY KNOWLEDGE OF BIOCHEMISTRY DOES NOT REFLECT THAT GRADE AT ALL. As in, I actually know SHIT about biochem, but I'm still able to get a pretty decent grade. This is the bullshit that is this class. \n2. The awkward, dumb pace of this class. Because Stockwell tries to pull in as many papers as possible for students to read, he doesn't actually spend enough time teaching the material we actually need to learn in biochemistry. We spent 1 day on Glycolysis, 1 day on TCA, and maybe 2 days on ETC. Most other biochemistry classes in the world spend like, a good third of the semester doing all of that shit. HOW DO YOU EXPECT ME TO READ ADVANCED PAPERS ON THESE SUBJECTS IF I WASN'T EVEN PROPERLY TAUGHT THE BASICS?\n3. The UNBELIEVABLE amount of bullshit work that you need to do. Work that does not help you actually learn the material in the long haul. Ask me anything about biochemistry and I can't tell you shit, but somehow, I'm still spending 3-4 hours a week doing his bullshit work. \n4. Stockwell's face\n5. Stockwell's voice\nTL;DR: I would rather lick the inside of the toilet than take this class again. I would rather get hit by a car repeatedly than take this class again. I would rather take Mowsh's class 16 more times than take this class again. I would rather remove my arm, and use my detached limb to throw as a frisbee just for kicks and giggles than take this class again. Do not take this class if you don't like busy, bullshit work. It can be a grade booster since the exams are so straight forward, but honestly, you won't be learning shit. Not worth it. Take it at Barnard, or the other class that meets once a week. Biochemistry should be hard, but it shouldn't be a joke. Thank Baby Jesus that I am forever done with this piece of shit class. \n\nWorkload:\nA bullshit amount of bullshit that does not contribute to learning in any way. \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 10, 2012",
            "review_content": "\nBiochemistry is heavily encouraged and mandatory in some cases for different medical schools, so you'll be taking this class like it or not.  The course is co-taught by Tong and Stockwell.\nTong first: he made biochemistry an unpleasant experience--not because he is an awful person (he is kind of funny) but because he mumbles a lot during class time and expects us to memorize all of his slides (or this is the feeling I got as on his quizzes and midterm he literally changed one word and asked true or false).  We had 800+ slides for the midterm, and there was only 1 \"apply your knowledge\" question--the rest was straight up memorization.  He assigned a ton of textbook reading (the text was interesting) but I did not enjoy Tong's section at all.\nStockwell's half of the course was much better--he was clear, concise, and interesting.  Stockwell incorporated research papers into the course and I found Biochemistry to actually make sense.  Stockwell's quizzes (and in turn, final, I'm sure) incorporate more orgo which I like and his questions are easier to follow.  Stockwell made me enjoy the last 12 lectures, and made me love them as compared to the 1st.\nOverall, yeah, this course is nothing like Mowsh bio, but its definitely not a cake walk.  Good luck.\nWorkload:\n2 tests worth 44% each (1 per prof) and 8 quizzes with the top 6 scores counting for 12% (4 quizzes/prof).\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 01, 2012",
            "review_content": "\nStockwell's class was very dry and his lecturing style is boring, but he's very straightforward, clear, and concise. Also, although he provides his PPT slides online, he leaves many blank slides with just a title, and he actually fills it in during class. Stockwell uses a projector for his slides - he doesn't use a computer powerpoint in class, so he writes on the slides, projected onto the screen, so you just copy him on your printed out slides. This forces you to pay attention and gives some incentive for going to class (although you could always just copy a friend's slides).\nBesides that, you basically don't need to take notes on anything unless he writes it on the slides himself. So it's very straightforward. Plus, what he quizzes on is all found in the slides. I probably averaged a 9/10 for Stockwell's 4 quizzes and I never touched the book...and to give you an idea...the average for all 4 quizzes ranged from a high 6 to a 9...so I'd say I did pretty well by never reading the book. Plus, the things I missed it was just cause it was some tiny detail or cause I didn't explain something clearly...not because I was lacking info from the book. \nA HUGE word of advice: make sure you understand EVERYTHING on the slides. You'll end up with 11 lectures...30 slides each about...of information, so that seems like a lot, but remember that many slides are just pictures or sometimes random, fun stuff....The biosynthesis, krebs cycle, etc. that's intensive, but the later lectures (lectures 6-11) are pretty light and just require understanding and not too much memorization. Everything however can be understood from the slides except 1 or 2 things, so make sure you KNOW AND UNDERSTAND those 1 or 2 things and go ask Stockwell in office hours.\nFor our final, he tested us on Cytochrome P450 Hydroxylation, and we only had 2 slides on it that were very uninformative and stockwell basically said 2 sentences about it in class...but that was one of the 3 mechanisms on the final. To be fair, it was on our practice test but there was stuff never mentioned in class (like IGF receptors in mice) on the practice final so everyone assumed that CP450 hydroxylation was talked about in detail the previous year but for our test, it wouldn't be on it since he basically skipped over it. big mistake.\nYou'll get 1 or 2 things like that, and if you can't understand it from the slides, go to office hours!\nThe mean grade is a B and that's basically a fair assessment of the difficulty of this 4 point class. I think if you put in enough effort, you can guarantee an A-. It's not like Lambert's Orgo class where even if you put in an insane amount of effort, for some people, unfortunately, it only guarantees a B.\nWorkload:\nsemi heavy? better than Tong's cause you don't need the book info.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "November 27, 2009",
            "review_content": "\nPainful. Although this professor tries to make things more straightforward and intelligible than his first-half counterpart, this part of the course is still pretty boring. To his credit, Stockwell does try to keep it more interesting by bringing in some outside topics, unrelated to memorizing organic mechanisms, but this doesn't change the fact that your at-home studying mostly includes a lot of boring mechanism memorization. Moreover, unlike orgo, this class doesn't necessarily focus on the general themes of reactivity (although some attempts are made to point out what aspects of the chemistry are repeated). Instead, you pretty much need to memorize how to get from one molecule to the next, what those molecules are called, and what the enzymes are that do the catalysis. Not exactly a stimulating experience. \nWorkload:\nAnnoying but manageable if you are not too lazy. \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "May 01, 2009",
            "review_content": "\nIf you liked orgo and appreciated biology, but thought mowschowitz was unnecessarily tricky, this is your class.  Tong is somewhat dry but makes it very clear what you need to know.  Stockwell is the man, he loves to talk about the beauty of metabolism.  His portion of the class is particularly straightforward and linear, as you go through the details of glycolysis, krebs cycle, etc.  Great for premeds looking for a straightforward and enjoyable senior science class.\nWorkload:\nquizzes every week or two, 2 tests (1 from each teacher)\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 03, 2007",
            "review_content": "\nStockwell's half of the course was slightly better than Tong's, but not nearly good enough to make the class worthwhile.  He's somewhat better at explaining the material than his first-half counterpart, but not much.  He still inundates the students with new material in each lecture and expects them to figure out most of it on their own.  Quizzes are tough and cover mostly the obscure points of the lectures; the final covers all the essential points of the course's second half and is also pretty tough.  Some students in the class are also extremely passionate about it so don't plan on having a low mean to hold up your grade.  The bottom line: only take this course if you're extremely passionate about biochemistry or a pre-med needing to fulfill a requirement.  And be ready to teach yourself an entire semester worth of material.   \nWorkload:\n8 quizzes, midterm, final.  Stockwell's material accounts for the last 4 quizzes and the final.  Grading of quizzes and tests is tough, particularly on mechanisms.  Class curves to a B/B+ average.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 04, 2006",
            "review_content": "\nThis course was divided into two halves.  In the first half, Tong covers proteins in biology.  He uses powerpoint presentations which are posted on courseworks before class.  He goes at a reasonable pace and covers some material covered in the intro bio class.  He always tries to include something to make students smile/laugh. In the second half, Stockwell covers small molecules in biology.  This half had a heavy focus on the organic chemistry of small molecules. Students are required to understand reactions, mechanisms, names of \"common\" molecules.    Stockwell uses overhead projections.  \nIf you are interested in Biochemistry, take the class. If you think you MIGHT be interested, think hard before taking the class. Lectures are not as entertaining as you might want them to be.  \nWorkload:\nThere is a total of 8 quizzes (4 per half) and you can drop your lowest 2 scores.  There are 2 exams - the midterm and the final.  You have to study for this class.  Slackers don't do so well. There is a lot of memorization.  The text books definately help, but some people study straight off of lecture notes and do fine.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 02, 2006",
            "review_content": "\nStockwell's lectures are comprised entirely of his extensive Powerpoint presentations, which he posts online. If you've taken orgo and understood it, there's really no reason to go to class apart from forcing yourself to keep up with the material to take the annoying weekly quizzes. \nStockwell reads straight from the Powerpoint in a very poised and deliberate manner, occasionally redrawing the electron-pushing arrows that are already on the slides to begin with. Everything he expects you to know is on the powerpoints, and he expects you to know pretty much every single slide. \nIf you're looking for a rousing lecturer, you'll be disappointed. If you're looking for a thorough intro to biochemical processes, take this class and you'll be satisfied.\nOther than that, he's very good at answering questions both during and after lectures.\nWorkload:\nTons of material covered every lecture. 15% of your grade will be from the weekly quizzes, which are 7 T/F plus a mechanism drawing. If you stay awake in class, you'll do well enough on them so they won't hurt your grade; study, and they might help you. \nAgain, lots of material. But it's nothing a day or three of pure memorization in Butler before the midterm and final can't solve... \nOh yeah, don't buy the books. As I've said, everything is on the powerpoint slides, most of which he takes from the books anyway. Unless you plan on using the book as a reference later, it's a total waste of money.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 27, 2005",
            "review_content": "\nUnlike Tong's section on structural biology which requires no knowledge of organic chemistry mechanisms, Stockwell inundates you them. Each lecture covers one or two major biochemical processes, which all have numerous structures and mechanisms to memorize. Though his explanations are pretty clear, his quick pace through the material and his monotone make it difficult to decide what is most important. So, to study for his final, I recommend reading through ALL of his powerpoints, drawing out the key mechanisms until you know them cold, and repeating the process for at least five days. (It sounds simple, but it helped get this weak organic student an A in the class.) It was his first semester teaching at Columbia, so the amount of material and its presentation could change next year. \nBottom line: Biochemistry (the whole semester) is an exercise in self-learning. It's not nearly as draining as bio, but be prepared to work through some pretty difficult material.\nWorkload:\nReally light for a pre-med dominated class; 8 quizzes, midterm (all MC), final (part MC, part True/False, part mechanism/structure drawing). \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "December 24, 2005",
            "review_content": "\nStockwell teaches the orgo-focused half of C3501. The actual lectures weren't that great--if you weren't falling asleep ten minutes in, you certainly were by the end. He teaches by Powerpoint and the class is just a lot of arrow pushing of biological reactions. Everything starts looking the same after a while because it's all just small molecules and the same similar reactions happen over and over. I think this was his first semester teaching this class, and he covered a LOT of material--at the beginning, he started with 40/slides per lecture, and then realizing that was too much, got it down to around 20 by the end of the semester.\nHe's big on having people learn for the material and not for testing. Having said that, the final (surprisingly) did not test nearly as much material as he had covered. The textbook is not that useful; most of the information is on the powerpoint slides anyway. TAs are generally helpful.\nOverall, I learned a lot from this class, and I think at the end it really gives you an intuition on how certain biochemical pathways proceed. Despite this, I wouldn't take another class with Stockwell. His teaching style is too boring and his voice is too monotonous. Throughout the lectures he didn't manage to give any brilliant insights or comments.\nWorkload:\nWeekly quizzes, 7pts T/F and 3pts draw something (molecule, mechanism, etc.). Averages tend to be around 8/10. 1 final exam, counts for half of the C3501 grade. Tong's midterm counts for the other half.\n"
        }
    ]
}