{
    "prof_info": [
        {
            "prof_name": "Seungjung Kim",
            "prof_id": 3941,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 15, 2011",
            "review_content": "\nSJ is truly an awesome teacher!! She is such a great presenter of information because she loves what she teaches and it shows. She is very open to opinions on art because this is obviously a survey course, but she also teaches us about aesthetics, formal analysis, and relating past artists to current artists, which is extremely useful. Her personality really fits the class, because if we had a boring teacher, people would not be as inclined to learn. Her spunkiness and intelligence is a great combination. I highly recommend SJ.\nWorkload:\n2-3 short papers, 2 big papers (1 one of which is the final), 1 midterm (IDs and formal analysis of a couple works of art), homework is essentially nothing (unless you read the readings that aren't necessary for class, which I did :)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 25, 2011",
            "review_content": "\nSeungJung is incredible! Her upbeat attitude, relatable humor, and obvious passion for art made my Art Hum class so much fun. \nThe best part of the class were the field trips, hands down. We went to the Met (twice), the Frick, toured Trinity Church and the historic architecture of the financial district, and--THE BEST--watched Impressionist art being auctioned off at Sotheby's auction house. The field trips, most of which were optional, got practically our entire class out of bed on Friday mornings--an impressive feat. At one of them (I think the downtown one) SeungJung even bought us lunch.\nThe class itself was also great. SeungJung usually taught by putting slides up on a projector, giving us some background information, and then allowing her students to talk about the art. She isn't shy about interjecting when it's needed or helpful, but it doesn't feel like a lecture at all. \nSeungJung's Art Hum also brought the kids in the class closer than any other class I've had yet at Columbia. I think it was a mix of the field trips and how laid back the whole atmosphere was, but at the end we basically all were in love with each other. That's a class dynamic I like!! \nTake Art Hum with SeungJung (omg almost rhymes). You will love herrrr...and the class!! Seriously just DO IT. \nWorkload:\nThe workload was no big deal--we had (short) readings from courseworks before each class, 2-3 papers per semester (which were mostly based off of ACTUAL ART IN ACTUAL MUSEUMS IN NYC OMG), and a midterm and a final...both of which were mostly identifications and quick analyses. \n\n"
        }
    ]
}