{
    "prof_info": [
        {
            "prof_name": "Mahmood Mamdani",
            "prof_id": 3032,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 10, 2013",
            "review_content": "\nMahmood Mamdani is a brilliant man with an unbelievable understanding of both the breadth and depth of the conflicting perspectives that make up the study of Africa.\nThat said, this was a terrible class.\nProfessor Mamdani has no idea how to structure a lecture. Though the class was, in theory, designed around several large controversies that have shaped the discourse on Africa, Mamdani consistently failed to demonstrate how each of the many authors, times, dates, and places he described in excruciating detail was relevant to the broader themes of the course. Walking out after each lecture (which very few students did), I rarely felt as though I'd gained new insight into Africa's place in the world. Instead, I became increasingly convinced that no matter what I said or thought about the entire continent, I could never, ever be right. Because I'm biased. Because of culture. Or something. \nThe readings varied from the hugely important and influential (Edward Said, Franz Fannon) to the utterly dull and useless (maps of slightly conflicting tribal movements in South Africa). However, the quality of readings is irrelevant; you don't have to do any of them to succeed in the class. \nI can't count how many times Mamdani would mention some crucial, seminal text, ask how many of us had read it, and receive only blank stares in response. This is pretty indicative of Mamdani's ability to connect to students overall. He has no idea how we learn, so he has no idea how to teach. Everything about this class, from the way in which information was conveyed to the unrealistic expectations about how much work students will do, simply failed to excite the vast majority of students in the room. And when the topic of the class is straight up \"Africa,\" that's saying something. \nWorkload:\nWay more reading than you'll ever do, weekly posts for discussion section, two 8-10 page papers that depend on how much your TA likes you\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 02, 2013",
            "review_content": "\nAs you may have gathered from the previous reviews, this class gets a lot of mixed reviews, and there is a clear divide between those that enjoy the class and those that write the class off as BS. I unfortunately was part of the latter.\nTo clarify, the title of the class is not \"Major Debates in Africa\" -- it is \"Major Debates in the STUDY of Africa,\" meaning that the class is not so much about contentious sociopolitical issues African countries face today as much as looking at how scholars have studied Africa. As someone who has read a lot about Africa and has spent a fair amount of time there, you will not learn about the nature of politics, you will not read extensively about native African traditions, and you will certainly not learn about economic theories of development. Rather, perhaps the focal point of the class is how culturally insensitive and sometimes ignorant the world is with respect to Africa. That being said, the readings tend to be very removed from the subjects themselves and focus instead on how scholars and important figures see these subjects. I and my other SEAS friends usually just chanted \"BS! BS!\" under our breaths from day one.\nLectures are hit or miss. I went to every lecture, and still have no freaking clue why I kept showing up. Once in a while Professor Mamdani will discuss an interesting topic, but most of the time lectures are very slow and do not have much information. The first few lectures are exactly what the rest of the class will be like - focusing on one minute topic and repeating it for a few weeks. Lectures have nothing to do with the assignments on which your grade is based on, though, so a very small percentage of the class usually showed up.\nGrading, as you probably have read, is completely dependent on your TA. Be warned - there are some pretty gruesome stories of certain TAs, like the one who gave quizzes on the weekly readings.\nOverall, the class was the most disappointing of my Columbia career thus far, but I cannot write it off for everybody. If you plan to go into history, archeology, anthropology, or even sociology, you can practice critical thinking in these fields in this class, but you will not walk out of this class knowing anything about African history, culture, or politics. If you enjoy theoretical, philosophic discourse, then this may be the perfect class, granted you win the TA lottery. If, however, you are like me, and can't stand theoretical discourse on identity, there are much better global core classes.\nWorkload:\n100-200 pages of reading per week and a short weekly response, although most people end up not doing the readings and BSing the responses.\nMost of your grade is determined by two 8-10 papers. No tests!\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 31, 2012",
            "review_content": "\nAs you may have gathered from the previous reviews, this class gets a lot of mixed reviews, and there is a clear divide between those that enjoy the class and those that write the class off as BS. I unfortunately was part of the latter.\nTo clarify, the title of the class is not \"Major Debates in Africa\" -- it is \"Major Debates in the STUDY of Africa,\" meaning that the class is not so much about contentious sociopolitical issues African countries face today as much as looking at how scholars have studied Africa. As someone who has read a lot about Africa and has spent a fair amount of time there, you will not learn about the nature of politics, you will not read extensively about native African traditions, and you will certainly not learn about economic theories of development. Rather, perhaps the focal point of the class is how culturally insensitive and sometimes ignorant the world is with respect to Africa. That being said, the readings tend to be very removed from the subjects themselves and focus instead on how scholars and important figures see these subjects. I and my other SEAS friends usually just chanted \"BS! BS!\" under our breaths from day one.\nLectures are hit or miss. I went to every lecture, and still have no freaking clue why I kept showing up. Once in a while Professor Mamdani will discuss an interesting topic, but most of the time lectures are very slow and do not have much information. The first few lectures are exactly what the rest of the class will be like - focusing on one minute topic and repeating it for a few weeks. Lectures have nothing to do with the assignments on which your grade is based on, though, so a very small percentage of the class usually showed up.\nGrading, as you probably have read, is completely dependent on your TA. Be warned - there are some pretty gruesome stories of certain TAs, like the one who gave quizzes on the weekly readings.\nOverall, the class was the most disappointing of my Columbia career thus far, but I cannot write it off for everybody. If you plan to go into history, archeology, anthropology, or even sociology, you can practice critical thinking in these fields in this class, but you will not walk out of this class knowing anything about African history, culture, or politics. If you enjoy theoretical, philosophic discourse, then this may be the perfect class, granted you win the TA lottery. If, however, you are like me, and can't stand theoretical discourse on identity, there are much better global core classes.\nWorkload:\nThe class is kind of a joke if you have the right TA. The workload isn't bad - about 100 pages of reading a week with a short response of less than a page. Most people end up not doing the readings and BSing the responses.\nBesides participation, your grade is determined by two 8-10 page papers, for which you can just take a topic Mamdani discussed, interpret it, and qualify or challenge it using the readings.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 19, 2011",
            "review_content": "\nTAKE THIS CLASS!!! I can't express enough enthusiasm and excitement about this class. I have been gushing about it all semester long to all of my friends (both at Columbia and even outside Columbia). Honestly, I never write reviews, but felt compelled to finally write my first review for this class because it is worth it. Also, because I so strongly disagree with the last review. \nOut of all the classes I have taken at Columbia, this is the one class that I actually feel has altered me academically, but also personally as well. Professor Mamdani began the class by saying that this class will \"not change how you view Africa, but how you view the World from an African vantage point\". Since the class, I can truly say that I do see the world through a different lens now and ACTUALLY remember the things that I learned in the classes. (What a concept!)\nI do not know what the previous reviewer was saying about Professor Mamdani's lectures being unorganized. I found his lectures to be very organized. There was a very clear outline from the very beginning of what he would cover and then he proceeded to do so. Also, he only missed one lecture and it was due to sickness. \nThat being said, the lectures were also the best I had ever had at Columbia. I went to every single lecture because I wanted to hear every single word that he said. Usually he would say something that was so eye opening or mind blowing that I would actually type it in bold and then later read it out loud to all of my friends. (You know a class is good when you are actually talking about it outside of class..)\nOne thing I will agree on with the last reviewer is that the TA does matter a lot in regards to your grade. My TA was Fatima and she was fantastic. I could not have asked for a better TA to go with the course. She has a calm, quieter demeanor, but do not be fooled. When she speaks, each word is intelligent and she is able to tie in the readings, lectures, and present day situations seamlessly. She also has a very funny, sarcastic sense of humor that seeps into the discussions every now and then. Do not be intimidated though, because she is very eager to make sure you understand the material as well and is willing to meet with you as many times as necessary in regards to the reading or your paper. Also she returned out first paper to us with comments, she went through great efforts to comment on them thoroughly. Then, for our last paper she even offered to email us her comments. She is a very fair grader. She was a great component to the course because she really pushes you to think differently.\nOverall, I could not recommend this class enough. This is the class you came to Columbia for. Do not leave Columbia without having taken it! \nWorkload:\nWeekly readings (which you will WANT to do)  which are not that bad and weekly .5-1 page responses to go with them. \nTwo 8 page papers. You have to do the first paper, but the next two, you get to choose which one you want to write. From speaking to others, they are usually graded pretty fairly and most people do well. \nOne in-class presentation, which is super easy. You basically just are assigned an article for that week and have to present it. \nNo tests! \n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "November 03, 2010",
            "review_content": "\nThis class was UNREAL. As other reviewers have mentioned, the class is structured in a way so that you need to attend exactly two lectures for the entire semester. Even as someone with an interest in Anthro (although not an Anthro major) I found this class incredibly painful. While Mamdani is no doubt a very intelligent man, this proved to be his main downfall, as his lectures were terribly disorganized and very difficult to follow. To be honest, the first few were very interesting and far clearer than his later ones, and I suspect he started working on a new book or something because his lectures turned shit toward the end, and his missed a lot of classes.\nAgain, as mentioned by others, the grading is entirely dependent on your TA and due to the absolutely enormous size of the class, there is a huge variation in TA quality and grading criteria. My section was absolutely infuriating, and our TA completely incompetent. In our section, half of the class commented irrelevantly on \" white people vs. Africans\" this, and \"well, because I'm half Jamaican\" that, while the other half either texted on their Sidekick phones or were absent. The TA turned every class over to the \"student presenters\" of that weeks readings (which no one ever did) and would interrupt whoever was bullshitting some response to lecture us on \"the way things actually are.\" This was the worse class I have ever taken at Columbia and a massive disappointment. \nTRUE STORY: I was told to come to my TA's office hours because I had missed to many sections. I walked all the way up to Knox, waited while he met with another student for 20 minutes, then sat down with him and explained that I had IN FACT not missed more than 4 sections. His cell phone rang, and he took a phone call. He hung up and said that he was sure that I had missed a lot of classes. I asked him how he knew this, seeing as he does not bring a single pen, pencil, book, notebook, or scrap of paper to class, let alone take attendance. He replied that he knows who should be there when he sees empty seats in the classroom. Then he called me Christina, that is not my name. That is not anyone's name in our class. \nHe also accidentally emailed everyone in our section's grades to the entire class. \nWorkload:\nApprox 200 pages of reading per week and weekly coursework responses-- sort of optional; it was rare for more than 12-13/18 of the section to turn one in on any given week.\n2  Medium-length essays graded by the TA and not returned.\nPresentation in discussion section-- I missed the class where I was supposed to give mine, and never made it up or explained myself.\nI got an A in the class. Bullshit\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "February 17, 2010",
            "review_content": "\nQuite unusual for a review, I would like to comment on what I cared about most in this class rather than general aspects - and also give you a good way to get a good grade and actually learn something from this class. Hopefully future reviewers will keep this in mind when judging this class that I found very informative - yet with its own biases like any humanity class is bound to have. I just feel like they missed the point of the class. The point is to debate, and understand all sides, not just pick one and insist on it. I found other reviews particularly misleading, and I believe the main reason why so many got bad grades was because they did not get the essential \"debate\" part of the class - just like I found many students in my class didn't.\nFirst of all, I would like to say that my TA for this class (Susana Ramirez) made me very happy with one of her comments regarding students' essays: writing Europe is evil, Africa is great does not make a good paper. The purpose of the class is not to cast anachronistic moral judgments, but to understand certain political processes and power relations that shaped Africa's history. It's quite important to keep that in mind when writing your essays, and to always keep your own mind about things. It's very important to understand that this is not a class about political activism, but an anthropology and a history class at the same time.\nI was very surprised at how students would miss almost all his subtleties because they were more interested in quoting cool stuff outside class, and at the same time wouldn't like the lectures. The best example: Mamdani mentions his second lecture that it's hard to decide whether Homer was Greek or a Turk, since modern-day Turks are not that much ethnic (Central Asian) Turks that conquered Byzantium in the 15h century, but Greeks who turned Muslim. Therefore it's hard to establish how nationality and identity are related, and considering Homer one thing or another is anachronistic in nature: modern day Greeks or Turks did not exist then. What did almost every single student I talked to get out of this? That Homer was a Turk. And this was something they would keep repeating over and over again. And if you say you don't agree, the response will be \"you're Eurocentric\" (the word Eurocentric soon becomes one of the biggest swear words in this class) rather than arguments. I constantly felt that there was a tension between people who wanted to understand things logically and actually debate, and students who wanted to pass judgments on history and on their peers after picking a side.\nIn essence. If you are interesting in learning - and in quite some detail - about power structures and subtleties about how to understand politics and history better - please take the class. Mamdani and the TAs are very good teachers. Even if Africa isn't your thing, it's worth it. You'd be surprised how things you learn can be applied to the US society (or in my case, the small Eastern European country I'm from). Just use your own mind and everything will be fine. I finished with about 97% score (which for some reason was an A not an A+) - while disagreeing with both Mamdani and 90% of my class on quite a few things. If you're in it because it's cool, and you think a one-sided approach to the class will give you a good grade - you're in for a surprise. And you might be writing reviews on how the grading is harsh at the end of the semester.\n\nWorkload:\nWeekly posting of about 300-450 words. Just submit it, and you get maximum, it's not graded -it's the effort that matters. Two 8 page papers. No exams. One in-class presentation. Recitation with attendance required.\nEasy class if you keep a mind of your own.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 05, 2010",
            "review_content": "\nGreat class. Definately one of the best i've taken at Columbia. Although as a couple of other reviewers have noted your final grade depends pretty much entirely on which TA you get, which can be a little frustrating. Grades aside, Prof. Mamdani is a great lecturer and a formidable mind in the field and anyone interested in studying the region at a higher level would be well advised to take this course (having been to three grad school interviews i've seen the effect just mentioning Mamdani's name has!). Lectures could be a little rambling at times, but i always found them fascinating and came out with pages of hastily scribbled notes as i tried to get everything down. Be aware though that this course focuses almost exclusively on north and west Africa, so don't expect too much on other areas. \nWorkload:\nManageable. Lots of reading, but you can mostly get by just skimming. A weekly posting - not graded. Two 8-10 page essays - you have to account for all the assigned readings on the topics you choose for these essays. One short presentation in section. No exams.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 04, 2010",
            "review_content": "\nLet me start off this review with a haiku I wrote during one of Mamdani's lectures, many of which I attended over the span of this past semester:\nA sleepy lecture\nThe girl in front slaps herself\nMahmood Mamdani\nThere are two words that come to my mind when someone asks me about Major Debates in the Study of Africa: \"disorganized\" and \"incredible\". As my first anthropology class and one of my first classes at Columbia, this class was both a blessing and a disaster. \nLet's not get carried away here. The concerns brought up by a number of other reviews rang quite true for me as well. The structure of the class was indeed set up so that you would not have to attend a single lecture in order to do well (although I did attend nearly all of them).  Mamdani would start out on the same track on the readings, only to get carried away in sharing his extensive knowledge in off-topic tangents that inhibited him from reaching a clear-cut message in his lectures. This was particularly frustrating when I had read all 150 pages of his weekly assigned readings and was hoping to hear some clarifying explications or new insights in the works. Unfortunately, I was usually only lucky if his lectures somewhat aligned with them at all. No matter how interesting some of those tangents were, it becomes be a problem when my favorite segments of the lectures were about the Huns and the Native Americans.\nThe grading system of the class is structured entirely around which TA you happen to choose. After speaking to other students, I noticed that each section had markedly different requirements when it came to papers. My section happened to be quite large, and due to that reason when it came for each student to give a presentation on the readings, we had to make time to fit everyone in. Sadly, this meant that we were unable to discuss the texts for more than twenty minutes, if we got that much. Conversely, my TA was particularly lax when it came to the papers and postings.\nSo, why was this class also incredible? I took everything this class had to offer me despite its lack of organization. I did all the readings, I wrote papers on topics that intrigued me, and I fell in love with the African Reading Room. Major Debates quickly became my most cited class in conversations, and I still think of it constantly when I see films or study other histories. There are many reasons why this class can be an amazing waste of your time, but I believe that most of that sentiment rests in how much effort you are willing to put in. \nWorkload:\nTwo 8-10 page papers, weekly postings (1/2 page long), and a presentation in your section on that week's texts.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 24, 2009",
            "review_content": "\nI took this class as a freshman first semester. Mamdani was the first thing I wanted to talk about when people asked me how columbia was. Basically he is a rock star lecturer, and his course is well constructed. I loved hearing him speak, and with a good amount of success, wrote down everything he said. This class made me feel like the world was at my fingertips. He creates a really positive classroom environment with his personality and humor. I have endless good things to say about Mamdani, and only hope to find more professors at his level. That being said, if you're not prepared to get totally confused and question every foundation of your thought, you may want to take a warm up course. You don't have to go to lecture, but if you don't that just means you're priorities are messed up. Also you will definitely be less ready to write a good paper, even if you don't directly refer to sections of lecture. \nWorkload:\nlots of reading averaging around 120pp per week, a courseworks response once a week, and two 8-10 page papers on anything in the course\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 12, 2009",
            "review_content": "\nThis course was really interesting and rich, and brought up a lot of big, thought-provoking issues.  While I definitely learned a lot, it would have been nice to have less reading and more time to really discuss and analyze the materials.  \nThe highlight of the course though was Professor Mamdani.  He's amazing; his lectures brought up issues that really broadened the way I think about Africa and its relationship to the rest of the world.  It can be a great experience just to sit there and listen to him lecture and feel your horizons widening as you do.  He's also pretty funny, and likes to make jokes about the TAs, which is always nice.  That said, l did find it frustrating that he tended not to talk too much about the readings and sometimes his lectures seemed only vaguely connected to whatever we were reading at the time.\nOverall though, I would say Mamdani's probably the best professor I've had at Barnard/Columbia and I would highly recommend the class, even and especially if you don't know much about Africa.\nWorkload:\nweekly readings (50-100 pages); weekly reading response (1 page); two papers during the semester, on topic of your choice (8-10 pages each)\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 11, 2009",
            "review_content": "\nOne word to sum up this class: disappointment. I came into this class extremely fascinated by and obsessed with learning more about Africa, and left it with little interest in the subject. Mamdani's status of one of the Columbia \"must-takes\" is, to say the least, misleading-- I almost got the impression that Mamdani didn't really care about the course (although he was, in fact, present for most of the lectures) , and that the TAs cared even less.\nThe first few lectures of this course were extremely engaging. As the semester went on, my interest in them decreased exponentially, and almost everyone in the class that I'd spoken to on the matter felt exactly the same way. At a certain point Mamdani's lectures stopped having any relation to the readings whatsoever, which was stressful, as the readings themselves-- while indeed interesting-- were, with few exceptions, incredibly complex; one could have yielded much from further exploration therein. \nMy discussion section was equally disappointing. like the lectures, it initially was incredibly engaging, but as people all across the board started caring less and less, the presentations-- most of which unnecessarily and unbearably lengthy-- because almost mind-numbingly boring. We usually ended up having 10-15 minutes to actually discuss the texts, at which point the entire section was lulled to sleep. A word to the wise: the smaller the discussion section, the better.\nFortunately, the lectures weren't mandatory, and one hardly had to do the readings to coast by. Nonetheless, the readings were interesting, although to be honest they were structured in such a way that the \"major debate\" at hand had a clear answer in Mamdani's mind. \nA two (four) -word summary of the course content: colonialism (like capitalism) sucks. After realizing this the first week, you'll spend the rest of the semester beating the proverbial dead horse to a bloody-- or, probably by that point, bloodless-- pulp.\nWorkload:\nA fair amount of reading- anywhere from 100-300 pages weekly; 2 8-10 pages papers; weekly postings (not graded); participation; no exams.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "November 21, 2009",
            "review_content": "\nThis class is so incredibly misleading. Although Mamdani is a fascinating lecturer, this whole class is based on whatever TA you get. It is not easy to get a good grade (no matter how much time and effort you put in), unless you luck out with your TA. Mamdani's lecture style is rather confusing. He will go on for twenty minutes about the three things that led to x, but he goes off on so many tangents, that you will never get to the third point. Going to these lectures have no effect on your grade, whatsoever. I went and trust me, I barely looked at my lecture notes to write my papers. Also, the reading is all written by philosophers or economists, meaning one must have a pretty strong grasp of the two to write two good eight page papers analyzing such documents and most likely the TA is not an economist or a philosopher either so theyre no help either. Yet they expect such understanding from their students. So, if you have background in these fields, take this class by all means, but if you are just taking it to improve your knowledge, you will most likely get nothing out of this class or youll think you will, until you see your grade. Then you realize, that whatever introductory classes you have taken in anthro will barely help you skim the surface in this class and that maybe you should take an econ or a philo class first. To summarize, the expectations the TA's have from their students are ridiculous, especially when they barely can explain the concepts. Except, again, this all really depends on what TA you get.\nWorkload:\ntwo papers, one mandatory discussion section (participation grade) and weekly write ups on the reading (ungraded) \n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 07, 2009",
            "review_content": "\nAn intriguing professor...I LOVED this class.  Mamdani is very passionate about each topic, but what makes it even more enjoyable is the fact that he would go on tangents about who he had met in the past, or his next trip (which  would sometimes cause him to miss class).  As a result of taking his class, I can say I am definitely more interested in politics and maybe anthropology (-->Africa) ;)\nWhile I never went to his office hours...I don't even think he had them, I definitely enjoyed the five second chat that I had with him on the last day of class.\nTo add to this, I had a great TA, Natalia Mendoza...if she is there next semester, try and get into her section!!  She has a lot to say, and I definitely left each recitation with new \"food for thought.\"\nI never thought that an anthro class could be so interesting.  I highly recommend this class to anyone and everyone!\nAlso, some of the movies that they show outside of class are worth seeing.\nWorkload:\nReadings (while a bit hefty each week) are helpful when writing the 2 papers (8+ pages), 1 presentation (in discussion section), no final.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 16, 2008",
            "review_content": "\nLet me first say: Mahmood Mamdani is the definition of a BALLER. Sometimes he would jet off to Kenya or Ethiopia for the weekend and come back with fresh anecdotes about how he met some really important person. His stories about his past are pretty hilarious too (meeting Obama's dad, going to a sit-in in the South, etc).\nBut now to the course- amazing as well. I had never taken an Anthro class or had anything about Africa, and this is an excellent course for both. The style is 2 huge lectures by Mamdani and then once a week section discussion with a TA. Though there is not a ton of emphasis on Darfur like the description implies, it is a fantastic overview of Africa's history and the debates surrounding it.\nWorkload:\nPretty hefty reading with weekly posts, one presentation in front of the discussion group, and two 8-10 page papers with vary open-ended requirements. No exams.\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "August 24, 2008",
            "review_content": "\nMamdani is a very intelligent man.  His writings (assigned in class) were really interesting, but his lectures were not.  He is rather drab and boring in person, though he does have a nice sense of humor.  That said, attendance at lectures is not mandatory, and this is a totally enjoyable major cultures class.  What really made this class wonderful was my fantastic TA.  Make sure you have a good TA, don't worry about attending lectures (I barely attended but got an A with close readings and discussion section attendance), and you WILL enjoy this class.\nWorkload:\n2 papers (10 pgs), 1 discussion section presentation, weekly posts\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "September 10, 2007",
            "review_content": "\nlove love love Mamdani. best professor i've had at columbia. soft spoken but profound. his simple language is deceptive, as he presents very complex problems and questions that have very few solutions or answers, but the exercise  of listening to him and writing papers is well worth it. he's so intelligent and inspiring, when i see him around campus I want to hug him! I took this class to fulfill my major cultures requirement, but i've since picked up an anthro concentration. the readings are fabulous-- there are a lot, and the way the class was set up you didnt actually NEED to read ALL of them, just the ones you wrote the papers on, but I finished reading what i had left out over the summer because his discussion of them was so compelling. \nWorkload:\npapers, discussion section\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "January 11, 2007",
            "review_content": "\nWonderful! A mind-opening course, no matter how much you do or don't know about Africa. This was my first and only course in Anthropology (or political science or sociology or anything of the sort), and it gave me a new prospective on African history and issues of current economic development. Mamdani is an amazing teacher, twice exiled from Uganda, who speaks a little more slowly than I'd like but whose words carry enormous weight. Highly recommended, but beware that your GPA may suffer unless you are great at papers.\nWorkload:\nthree 8-10 page papers, a 5 page discussion paper, and a lot of reading. \n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 05, 2006",
            "review_content": "\nAs the previous reviewer said, Mamdani is the best professor I have had at Columbia.  He is engaging and challenging. He seems to really care about his students and about how we are interacting with the topics being presented. \nIt's a tough class, however.  If you just want to get an A, it's not for you.  If you are concerned about the grading, take it pass/fail - it's certainly worth it.\nWorkload:\n3 8-10 page papers, no midterm, no final.  required discussion sections, which were actually helpful.  \n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "December 05, 2006",
            "review_content": "\nBest lecturer ever...the discussion sections are mandatory and TAs are in charge of all gradind, but as an undergrad you are lucky to take a  class with such an amazing academic.  Worth the hard grading (depending on your TA), but if you're going to Columbia to experience the faculty, this class is a must.\nWorkload:\nreading is avg, and 3 ten - eight page papers\n"
        },
        {
            "course_name": "Major Debates in the Study of Africa",
            "review_date": "November 14, 2006",
            "review_content": "\nMamdani is the best professor I've ever had. He's one of the top Africanists in the world, he's engaging, challenging - an all-around fantastic professor. Lectures are intense and very well organized. He changed the way I think about academia, and I would take any class he offers. \nAs a major cultures class, you can certainly do easier. But if you really want to engage in some meaningful study about Africa's intellectual history, take this course. \nWorkload:\n3 8-10 page papers, no midterm or final. discussion sections are mandatory but worth it. Grading is tough, and the topics require a lot of thought. \n"
        }
    ]
}