{
    "prof_info": [
        {
            "prof_name": "C. Dale Worsley",
            "prof_id": 1103,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style II",
            "review_date": "July 08, 2006",
            "review_content": "\nI absolutely DO agree with the other people who have said that Dale Worsley is a professor who brings LITERALLY NOTHING to the table. His class would have been simply a waste of my time if he was an easy grader. Instead, it is both a waste of my time AND also bad for my GPA. Seriously, if you can take S&SII; with ANYBODY else, DO. The idea that you can't say anything negative about other people's work makes absolutely no sense. You are supposed to basically say that you love it because it reminds you of \"Fievel Goes West\". He also wastes a lot of time in class with his inability to make functioning workshop groups and often gets flustered. Also, he has this preposterous concept called a \"spirit reading\" in which you start reading aloud from one of the boring essays when you \"feel\" like you want to. Chaos. Basically, he sets you up for disaster, because he won't allow people to criticize your work constructively, and he also comes over and gives comments like \"Wow, that's really interesting\" and then tears the work apart in the grading process. The rubric makes things worse because it is impossible to decipher and has no actual concrete information on it. Stay away. \nWorkload:\nNot TErrible, but not good either \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "April 17, 2006",
            "review_content": "\nDale is borring.  Dale brings in useless articles and makes us read them.  Dale talks often about his seemingly unsuccessful career.  The class is run like so: Free write in the beginning, a little talking about the useless articles, break up into small groups of peers that aren't allowed to say anything bad about each other's work, but only say what it reminds us of (basically we chat), we all come back into the room where Dale tortures us with more uselessness, look at your watch several times, and run out of the class thanking God it only happens once a week so you won't have to be back again soon.\nIn terms of grading, there is a very intense rubric.  Dale takes it upon himself to give the bad criticism that no one in the peer group was allowed to give, so the grades are never as high as expected.  Plus he loves taking off for stuff like not referencing enough work of other authors in your personal reflection.\nDon't take this class. It is bad.\nWorkload:\nA portofio of poems, a short story, a play, and some little projects.  There is work every week.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "January 09, 2006",
            "review_content": "\nThis was one of the worst classes I have taken at Columbia. If I had been able to drop it, I would have. Worsley does not believe in \"criticism\", he believes in \"reflection and response\". In the poetry unit, he ACTUALLY had us DRAW PICTURES of how the poems made us feel. This made me feel like I am wasting a lot of time and money on my Columbia education. He also said that he believes \"a B is a good grade\" which makes him have NO redeeming qualities because he's not even an easy grader. During the fiction unit, he had us talk about what movies the person's story reminded us of. This did not help me in the editing process. When I was trying to make my fiction better, what I had to go on was stuff like \"this reminds me of the movie \"Talk to Her\".\" This class has seriously made me reconsider doing the creative writing program at all. Literally torturous. \nWorkload:\nNot bad, but he'll tell you it's good to your face in workshop because of the no criticism policy and then give you a crap grade on it later on. \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "December 16, 2004",
            "review_content": "\nDo not take this class with Woresley. It's fourth grade all over again. The content of the class is laughable AT BEST and you will get punished for laughing, which is the only way to sanely pass the time during class. I did appreciate that Dale made the class a somewhat easygoing experience. That's pretty much the only plus- he will tell you that your writing is good no matter what. However, this made me lose all motivation and I'm pretty sure my writing got worse over the course of the semester. \nWorkload:\n3 assignments; 1 short story, 1 play, several poems; however there is a catch- process narratives must be written with each assignment that are essentially 5 pages of BS. You may actually feel stupider after writing these. \n"
        },
        {
            "course_name": "S&SII;",
            "review_date": "August 29, 2003",
            "review_content": "\nThis class was incredibly frustrating. Worsely's directions are foggy at best and his assignments are utterly asinine. Stay away !\nWorkload:\nmoderate: 1 poem, 1 short story, 1 short play \n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "May 27, 2002",
            "review_content": "\nThe first half of the semester, I wanted to kill myself. I was upset that Dale's writing workshops were not really workshops but more like gatherings so that students could only say good things about others' works. As an intro-level writing course, S&SII; is bound to have some seriously bad writers and some negative--though constructive--criticism would have been a more productive use of time. I was also disappointed that only two out of the three genres could be workshopped; the excuse that there just isn't enough time to do all three is lame because my other writing workshops were able to accomplish this with no problem. Another frustrating aspect was not being able to read the pieces before the workshop; and trust me, with the really bad pieces, you'll need a few days to try to make sense of the writing. So the writing workshops easily and quickly crumbled into disorganized meetings, which Dale led with more of an interest in not hurting people's feelings than improving writing. But towards the end of the semester, I warmed up to Dale. He did not exactly become a better teacher but I did appreciate his efforts to make the workshopping process easygoing. (By the way, he is much better at offering constructive criticism during office hours) Dale is also a very nice guy and it was comforting to know that I had at least one understanding professor I could turn to. And as for the rest, the Structure and Style classes are chump classes and really only work for people who have little writing experience and want a broad introduction to all three genres. Plus, with the class being so large for a workshop setting (15-20 students) and meeting only once a week, it's almost impossible to walk out of one of those classes really feeling like your writing has improved a gazillion times. So even though I fully admit that Dale isn't the most fabulous writing teacher to have, I also think that a good chunk of it is due to the departmental organization of the course. If you're looking for an easy and laidback section to get rid of that pesky S&S; requirement, try Dale's. From my experience with the requirement, neither class I or II is going to have that big of an impression on your writing. Take the class and move on to the better ones.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "May 22, 2002",
            "review_content": "\nI hesitate to slam Mr. worsley but definitely recommend that serious writers steer clear. the class is a cruise for everyone but he makes the very act of writing feel trivial and spends more of his energy teaching various poetic forms than encouraging (much less engaging in) serious or exciting criticism. probably the biggest problem is that the workshopped papers are read aloud immediately before criticism, leaving no time for digestion or inspection. jocks and slackers, his arms are wide open for you.\nWorkload:\nsame as every other workshop, except no final.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 12, 2002",
            "review_content": "\nIf you're taking structure and style expecting a Dead Poet's Society - Mr. Keating type, SNAP OUT OF IT. That said, Dale is good enough professor. If you're planning on completing the entire writing program here, he is as good as anyone to stick through the initial requirement of structure and style with. Since it's a workshop of student writing, some of the things you read will be incredible and some things will out-right suck. But Dale's leading of discussion helps students to make critical comments aimed to help your work, and his comments on handed in work, though not so lengthy, at least bring up some valuable questions to think about. (granted I wouldn't take both semesters of structure and style with him, on the off-chance that there is a Mr. Keating somewhere in this department)\nWorkload:\nAbout ten pages in each genre (fiction, drama, poetry), handed in at the end of each unit. Dale doesn't seem to expect too too much (Heard to say 'Well, this IS just a structure and style course\"), but if you're self-motivated to write, his comments are helpful. The text, Teachers and Writer's Handbook of Poetic Forms, is a waste of money if you already know what a haiku is. If he's still using it, get it from the library.\n"
        }
    ]
}