{
    "prof_info": [
        {
            "prof_name": "Carolina Mangone",
            "prof_id": 12743,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 14, 2013",
            "review_content": "\nTake Dr. Mangone's class. Especially if you have a heavy course load. If you ended up with her through random, time/day-based selection, the universe is conspiring in your favor.\nI took her class during her first semester at Columbia. Dr. Mangone is incredibly thorough and visibly eager. You will learn a lot. She really enjoys engaging her students into the class and allows for balanced discussion. Looking at works in class, she encourages interpretation based on one's own experience of the work. Readings are light and not really required, as the material she presents in class expands on that of the reading and she values discussion as a supplement. She isn't too critical of interpretations she may not agree with, as some Core teachers can be. She grades papers generously which she counters with more challenging exams, which I honestly think are pretty standard. In papers, she admires creativity and artful language (here meaning an argument expressed and developed in flowery, elegant prose). \nLighthearted and kind underscore my general impressions of her as a person. If you want a passionate instructor who is genuinely engaged (and will not make a slave of you as a means of imparting material), opt for Dr. Mangone. As this was her first semester teaching the course, I presume subsequent terms will reap even greater benefits.\nWorkload:\nThree 4-5 page papers that require only observation (no research)\nPossibly a short 2-page assignment at the beginning of the semester. (She mentioned maybe dropping this assignment from future syllabi)\nMidterm in-class. Comparisons of works, analysis of an unknown work\nFinal in-class. Same format as the midterm, but you receive the unknown work in advance.\n"
        }
    ]
}