{
    "prof_info": [
        {
            "prof_name": "Nicholas  Mayer",
            "prof_id": 13179,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 14, 2016",
            "review_content": "\nAlthough it is only my second semester, Nick is without a doubt the worst professor I have had here.  He is lazy and completely incompetent.  He cancelled class for two weeks and serially fails to show up to appointments he sets up with students--appointments that he requires us to make.  He does not care about the students at all.\nClass discussions are dry and the reading material often doesn't even fit the American Studies theme of the course.  Judith Butler?? Sure, she was American, but I thought we would be reading things about America, not simply by American authors.\nNick does not teach us anything.  My writing has not improved at all through this class.  It is a complete waste of time, and he always waits until less than a week before the final draft is due to give you any feedback.\nFor our third essay, Nick didn't even give us an instruction sheet about the requirements or purpose of the essay.  He is so hands off that it is utterly ridiculous.  He should never have been put in this position as he is truly dreadful.  \nWorkload:\nStandard, three drafts for each progression (4 progressions) and written work for most classes about the readings.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 31, 2016",
            "review_content": "\nAbsolute laziest professor I have ever met. He just dismissed class 40 minutes early because instead of teaching us in class for the next couple of weeks he wants to have individual meetings with us. That is ONE individual meeting for each person over the course of two weeks. It's like he doesn't have time to meet with us in addition to \"teaching\" a class. If you don't have time to teach a class, don't take the job! \nDid I mention he hasn't taught us anything about writing?In the first part of the semester he had tried to meet with us, but the conversations went on far too long and did not help. I admit, it is an American Studies UW class––but we should still be taught basic writing skills. Not only has my writing not improved, but in class we haven't gone through any tips. On top of that he did not explain to us what the P1 and P2 were actually supposed to be about. The writing style UW looks for is completely different from anything most students have experienced before, and he does not explain that to us. Even after going in and talking to him, I still feel like I am not learning anything and he does not care. \nWorkload:\nNon existent! Which is a bad thing for a class where you're trying to learn how to write! \n"
        }
    ]
}