{
    "prof_info": [
        {
            "prof_name": "Evgeny Gorskiy",
            "prof_id": 12865,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "December 20, 2014",
            "review_content": "\nLet's be honest, the Math department at Columbia is not that good. But, I can't say anything bad about Professor Gorskiy. His assignments were a bit of a pain, but I managed them thanks to the help room and Khan Academy. He was also helpful and straightforward with any questions in class and office hours. Most importantly, his mid terms and final had no surprises in them. He gave good review problems beforehand and examples in class. He also curves fairly and gave test results back very quickly (first midterm was back within 24 hours!). He reviews any homework problem you had questions on in class after the assignment was turned in, which I personally liked a lot. The book is truly terrible, so consulting him about the material is a huge help. Also, another thing I really appreciated in the class was his approach to trig; he goes over it a fair amount and does not test it very difficulty or expect you to know any beforehand. So, if trig is not your thing, don't worry too much here. He has a bit of an accent, but it wasn't to the point where I had trouble understanding anything he said. All in all, you really can't go wrong with this guy for a fair Calc I class. It's not a breeze, but it's far from impossible. \nWorkload:\nOne HW assignment a week (book and online problems), two mid-terms and a final. If you have never seen Calc before (like me), you will most likely have to put a good amount of time into the HWs and exam prep.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 10, 2014",
            "review_content": "\nI audited four Calc I classes this semester - all with different professors, and Prof. Gorskiy's was by far the most organized and focused lecture that I attended.  He is efficient and doesn't waste lecture time on superfluous topics beyond the ken of Calculus nor digress far from the lesson. At the same time, he is relaxed, approachable, and the work load is more than reasonable. Plus he offers many opportunities for extra credit in both homework and exams. The course requires a WebAssign account, as do many of Columbia's math courses, but the site has many helpful tutorials and includes online access to the book. I believe that the same book is used up through Calc III, so it is a good investment. I highly recommend his class and hope that he teaches Calc II. \nWorkload:\nReasonable and keeps you involved.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 11, 2014",
            "review_content": "\nI found him to be extremely helpful.  He's very laid back, goes through the material very thoroughly, and isn't a dick when people ask for help.  He's also pretty lenient on homework as far as offering assistance and turning the stuff in an hour after the due date (you know, the stuff that makes homework at Columbia suck so much), etc.  The homework is hard and the book sucks ass at answering your questions (so take good notes!), but you get a lot of points on the homework (and we all know about Khan Academy) and the midterms are definitely easier than the homework questions.\nIn essence, you'll learn from a younger dude who isn't stroking his ego every class (and I should know about people stroking egos considering my 8 years hating life in the USMC).\nWorkload:\n~5 question book problem set + ~10 questions online per week\n2 midterms\n1 final\n"
        }
    ]
}