{
    "prof_info": [
        {
            "prof_name": "Paula Franzese",
            "prof_id": 2589,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: Civil Rights and Liberties",
            "review_date": "November 19, 2014",
            "review_content": "\nProfessor Franzese is one of the most incredible professors at Columbia University. You can read below about her style of teaching, which she has improved upon since many of these reviews were written (quicks are actually quick now, better at cutting people off, etc). \nTo the points of not learning anything: absolutely ridiculous. You get as much out of this class as you put into it. It's not the most *content* heavy class in the world, but there is extreme value in fleshing out ideas and articulating them in new ways. Also, exploring the relationships between theory, case law, and normative messages in American society is a worthwhile endeavor. There's a lot to be learned and even more to be gained from taking this class. \nWorkload:\nVery heavy, but worthwhile. Lots of reading, a book a week, but mostly manageable. 2 papers of medium length (12-15) pages, and relatively easy grading. \n"
        },
        {
            "course_name": "Colloquium: First Amendment Values",
            "review_date": "June 07, 2010",
            "review_content": "\nI have to corroborate everything said by the reviewer before me. Professor Franzese is a natural, but a little over eager. She has a terrible time cutting people off, and indulges everything any student has to say, from the innocuous to the idiotic. I believe I was in a particularly verbose section. As mentioned, the course gives only a cursory glance at actual First Amendment Values, theoretical and practical, and focuses on bias in the media. When you center discussion around the media, you invite distracting and hackneyed commentary on current events. Topical as they may be, Paula allows 'quick' comments to give way to anecdotes which ultimately give way to a 2 hour class during which not a word from the reading (which is substantial) is mentioned. \nI suppose her style of discussion is worth mentioning. At the beginning of the class Paula makes a queue, and students who have something to say are written down. If someone does not want to introduce a new topic, but comment on the previous one, they express to Paula that they have a 'quick'. Quicks turn into 10 minute rambles, which lead to more 'quicks' on ancillary topics, and 45 minutes later whoever was next on the queue doesn't have a vague idea what they were going to say. For people who are only minimally fond of their own voice, and really only want to speak when they have something meaningful or original to say, this is a terrible method. Paula's sincere attempt to make everyone's voice heard really just encourages those who talk without saying anything. Most of these people who allegedly have just so much to say on the topic only have post-it notes in the first 50 pages of the books. \nHowever, I would say the reading list is redundant- there essentially four or five books on the same thing. Read one if it interests you, or read the reviews. Because the professor permits diversions, it's not likely you'll be taken to task on the reading. \nThe paper is a free for all. Paula has no interest in tricky grading. She really wants you to engage with your topic. She encourages you explain your own opinion and resolutions to the issue, which is a refreshing change from dry, analytical 30 page papers. \nThe class is worth taking to meet Professor Franzese alone. You can learn a lot about the First Amendment, but you're really not expected to. \nWorkload:\nVery heavy reading, especially for a colloquium. Read Perilous Times, My Life with the Times, and the Bernie Goldberg book. Paper is long but probably doesn't have to be as thorough or heavily researched as in other courses. \n"
        },
        {
            "course_name": "Colloquium: First Amendment Values",
            "review_date": "May 10, 2010",
            "review_content": "\nFranzese is very inspirational- she will call you an impeccable and elegant scholar and she will praise your words in discussion.  Coming from a high-powered and extremely successful lawyer, this will feel good and she will make you feel smart.  The problem is that it would be a lot more believable if she didn't applaud every student every time they spoke.\nI had her for the First Amendment Values colloquium, which would  be more accurately titled \"Freedom of Speech and the Media.\"  At first I found myself really enjoying the reading list which is full of easy-to-read, contemporary, bestseller commentaries on the media and pop culture, but after a while you start to wonder how much you're actually learning.  The first month is great- you learn the history of the transformation of freedom of speech in American law.  But for the next three months, discussions circled around the same issue- bias in the media and how we personally feel about it.  Occasionally, this would veer off into a passionate monologue about abortion.  Franzese made little effort to steer the conversation; she asked the same very vague open-ended questions (ex: should our president be set to a higher moral standard?) that you have probably discussed with your friends anyway; class felt like a conversation among friends where no one is really considering changing their opinion, everyone is sharing their feelings and the personal background that led to those feelings, and few concrete facts are used to support any arguments.  If anything, Franzese seems to encourage this sort of discussion.\nIf you want to think critically about free speech in America, she does have a great reading list.  You'll just be on your own to get the most out of them.\nWorkload:\nTypical for a poli sci colloquium- two short books a week, three 1-2 page reflections (easy!) and a 25 page research paper (here, you'll be on your own- there are no deadlines to lead you along except for the final due date).\n"
        },
        {
            "course_name": "Colloquium: Civil Rights and Liberties",
            "review_date": "December 20, 2007",
            "review_content": "\nTake this class! Professor Franzese is amazing, passionate, knowledgable, and facilitates excellent discussions. The reading work load is light, but extremely interesting. Most of it is case studies. Professor Franzese challenges you to think about the ethical dimensions of civil rights law. Previous reviewers said that they didn't learn much, but I believe you get what you put in. \nWorkload:\n2 short response papers and 1 final paper (25-35 pages) \n"
        },
        {
            "course_name": "Colloquium: First Amendment Values",
            "review_date": "May 15, 2007",
            "review_content": "\nYou need to take a class with Professor Franzese because she is amazing!  I heard this statement many times before I took the class & I was very skeptical.  However, I changed my mind almost as soon as Franzese walked in the door.  I was shocked by the fact that I could not stop smiling during the first class.  Franzese is absolutely amazing in how much she cares about her students & wants to understand how they are feeling about the issues at hand.  She has an extremely busy professional career but is always willing to have an exchange over e-mail & even makes phone appointments.  She will even read entire drafts of the paper 2 days before the final copy is due.  The subject of the class ended up being more about the Media than the First Amendment as a whole, but it is still worthwhile to be in the class.  The reading list is amazing but around midterms you will stop having time to do any of the reading.  However, you do not really need to do it since most of the discussion is about general ideas than the specific reading.  The paper is long as is expected in a colloquium, but you will probably not have a problem writing it.\nTake this class!\nWorkload:\nhuge reading list that you don't really have to touch (there were only about 2 written responses on the reading in the beginning of the semester)\n30 page research paper\n"
        },
        {
            "course_name": "Colloquium: First Amendment Values",
            "review_date": "March 31, 2006",
            "review_content": "\nProfessor Franzese has not only recieved several glowing reviews on this site, but also numerous teaching awards; however, I must say that I find them to be unwarranted.  It is true that her sincerity and enthusiasm is almost unparalleled, and that she is extremely kind, not to mention well-connected: she brought several guest speakers to class, including the author of one of the books that we read, and she bought our entire class copies of the memoirs of another guest speaker.  However, I must abandon my esteem for these characteristics in evaluating the class, because I believe that the single hallmark of a good teacher is simply that he or she facilitates learning well, and I did not learn very much in this class.  Professor Franzese assigned far too much reading each week--sometimes over 500 pages--to adequately discuss in a two-hour class, which meant that we treated most of the material in shallow fashion.  A more adequate title for the class would have been, \"Does the American media have a bias, and if so, what is it?\" since we actually spent comparatively little time discussing the First Amendment.  The books she assigned tended to be contemporary polemics, not scholarly works, though a few did break this mold.  Worst of all, however, were our class discussions: while enjoyable and engaging, they were pretty pedestrian, and many students simply reiterated what others had already said.  In other words, I felt that very little rigor was asked of us.  From her extensive resume, I'm sure that Professor Franzese deserves her excellent reputation as both a lawyer and a scholar, but unfortunately, her academic excellence did not manifest itself in the class.\nWorkload:\n250-550 pages of reading each week, weekly response papers, and a 30 page paper (the last of which is normal for political science colloquia).  However, it is possible to skim the books since it's not likely you will be asked to think deeply about them in class.\n"
        },
        {
            "course_name": "Colloquium: Civil Rights and Liberties",
            "review_date": "January 09, 2006",
            "review_content": "\nAlthough her sincerity is overwhelming, she is a great professor albeit often late to class.  She sometimes lets the conversations drift too far from the topic which will cause the entire class to fall behind but we still managed to get the entire syllabus done--a first, perhaps.  I would take another class with her!\nWorkload:\nthree case briefs, read several cases per week, final 30 pg paper\n"
        },
        {
            "course_name": "Colloquium: First Amendment Values",
            "review_date": "July 20, 2005",
            "review_content": "\nFor me, Paula is that professor that you absolutely loved in college. The one you always remember, who made you want to go to law school and change the world, etc etc.  The structure of the class is unique, in that every week a few people are assigned a case,  write a brief, and present it to the class. From that she explains the greater significance of such topics as prior restraint, libel, slander, political speech, satire, etc. with interjections about her kids, a case she worked on, etc.  WIth every discussion-based class you'll find those few annoying people who ramble on about themselves or their uninformed opinions, and Paula has a hard time cutting them off, but other than that the class was amazing. You only read case opinions, and two books on media bias (Franken and Goldberg). Highly recommended for pre-law students. \nWorkload:\nNot bad at all. Write a few case briefs (2pgs) and a 30 pager at the end. Talk in class, read the two books and skim the cases,  and prove you learned something in the research paper and you'll do fine. \n"
        },
        {
            "course_name": "Colloquium: First Amendment Values",
            "review_date": "July 10, 2005",
            "review_content": "\nProfessor Franzese is a gem!  I asked her to be my advisor because I'm a major, but saddly, because she's not a tenured prof she can't officially advise.  However, she offered to be my unofficial advisor, and to write me recommendations whenever I need them.  She is soo encouraging and supportive of her students.  She is especially refreshing to those who have been discouraged in the past by other faculty about law school and the legal profession in general - ahem, DALTON!  Paula truly believes that law can be the noblest of professions and she has an incredible ability to present issues so gracefully, and from all sides, without offending studnets in class who disagree.  She truly wants to understand how students feel about everything from on-campus rallies to Marbury v. Madison.  She is kind and she facilitates conversation well.  You will leave her class feeling restored in your morals, motivated to change the world and always thinking.  Def one of the most positive people I've ever met.\nWorkload:\nNot bad at all.  A huge 25-35 page paper, as is expected in all poli sci colloquia and readings each week which are discussed in class.  Each person is also responsible for two one-page case briefs during the semester.  As the readings are always someone's case briefs, if you don't do them it's ok.  You end up being briefed on them by someone else.\n"
        }
    ]
}