{
    "prof_info": [
        {
            "prof_name": "Lawrence Potter",
            "prof_id": 684,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Iran: Religion, Politics, and Social Change",
            "review_date": "March 08, 2003",
            "review_content": "\nThe previous review is very unfair.  Dr. Potter has a relaxed, very conversational manner of teaching his class.  He is extremely respectful of the students, and is more concerned with his students learning the material than deluging them with a voluminous array of readings which they will never get too.  \nThe coursebook that Dr. Potter prepares is excellent, and the readings are very lightening and cover a broad range of subjects, from the geography of Iran, the components of an Iranian urban dwelling, to the unique, and very germane irrigation systems that have been so important to Iranian agriculture and economy for hundreds of years.\nFinally, Dr. Potter colors the class with a number of highly interesting video offerings, which really bring to life the passions involved in such seminal events as the Iranian revolution.\nDr. Potter is fairly accomodating on deadlines, and if a student pleads his/her case, he will generally try to accomodate their need for additional time on papers.\nIt is clear, and in direct contrast to what the student above contends, that Dr. Potter has an expertise, and an obvious love for Iranian culture and society.  He frequently offered insights from his own experiences living in Iran, and often sought to learn more about the lives of the many Iranian American, and Iranian students that frequented the course.\nI definately came away from the course with a very good understanding of Iranian history from the Qajar period up to the reign of the Palhavis.\nWorkload:\nTwo papers, or one longer paper.  A geography quiz, and a final exam.\n"
        },
        {
            "course_name": "Modern Iran: Religion, Politics, and Social Change",
            "review_date": "August 13, 2001",
            "review_content": "\nAs an Iran scholar, Potter doesn't know much more than the students. His lectures are nothing more than a bland synopsis of the readings, neither offering nor stimulating independent thought. A terrible grader, he gives few comments, if any. He is one of the worst teachers I have had. If you are interested in the history of Iran, don't bother taking his class. You can learn more on your own.\nWorkload:\nTwo papers, midterm, final exam.\n"
        }
    ]
}