{
    "prof_info": [
        {
            "prof_name": "Jessamyn Conrad",
            "prof_id": 9689,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2011",
            "review_content": "\nJessie Conrad is absolutely amazing.  If you are reading this because you just found out that she will be your teacher for Lit Hum or Art Hum, commence your celebratory jig now and get ready for an incredibly class because Jessie is a goddess.  A brilliant, brilliant goddess.\nHer ability to handle discussion astounding, so much so that we would talk from beginning to end without a lull in the conversation or awkward silences, constantly analyzing the texts and challenging each other.  Discussion was so sustained that when she asked us if we wanted to take a break halfway through class this semester we all just gaped at her, unsure what to do with ourselves.  Granted, we had a really strong class, but that just augmented Jessie's already great teaching.  (Side note: she substituted for another section as well at the end of the fall semester and the students in the other section flocked to our section the next semester after realizing what a good Lit Hum class is like.)\nAs the other review mentioned, Jessie is a really tough grader.  I got a B last semester and barely scraped an A this semester, but I definitely could have gotten better marks had I taken better advantage of her offers to read drafts of papers beforehand (yes, as in if you send her your paper before it's due she'll read it and give you comments that guarantee you'll get a higher grade on the next draft).  The imperfect grades are totally worth it, though, because I wouldn't trade her humor, brilliance, and kindness for an A+ any day.\nWorkload:\nTypical Lit Hum reading (which is a bitch in case you haven't realized), two to three papers per semester, one creative project, midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 15, 2011",
            "review_content": "\nThis was Jessie's first time teaching Lit Hum...and she is freaking brilliant.  Just, wow.  I honestly was not looking forward to Lit Hum, but she made it my favorite class this last semester.  Of course, I've never been in another Lit Hum class, but I believe that she teaches it the way it's supposed to be done.  We dive right into the work at the beginning of class.  She'll bring up passages and highlight lines that she thinks are important.  She briefly hints at the depth of the analysis, and then immediately, we all start discussing it.  Our class is great because we're respectful in the discussion and do the whole raising hands thing.  Once we all say what we think and respond to each other, she responds to us individually and also teaches us on a much deeper level than any of us could've brought to the table.  She manages to keep the discussion part that is integral to Lit Hum without us losing her valuable input as a ridiculously intelligent and interesting person.  She has very, very high expectations for students, but she lets you know of these expectations immediately, and then prepares you to meet these expectations.  She grades pretty harshly, but they're often the grades you deserve at the Ivy League level (ie an B+ versus an A-)  Jessie is amazing, and I'm so glad to have her.  \nWorkload:\nSeveral papers.  Best idea is to put together a draft and email it to her about three days to a week before it's actually due and ask her to review it.  She'll send back really helpful feedback.  Midterm and final are difficult, but really, what tests aren't?  As long as you prepare, you're fine.  And of course...the reading.  We go through, on average, two works a week.  It's hard to get by in class without reading.  If you can make the concerted effort to read the works or at the very least, the entire Spark Notes file on it, then you'll be good.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 23, 2010",
            "review_content": "\nJess Conrad was the best teacher I have had this year, and in a long time. Everything that she said was downright inspired; I'm an artist, and yet once I took her class I felt like I'd never really seen a piece of art before in my life. She completely gave me new eyes and I think most of the people in my class felt the same way. She's constantly interesting and enthusiastic about what we discussed, and the class is very comfortably casual--she talks about art, you can talk about art also; everyone chimes in and sometimes if nobody responds she calls on people. She is insistent that there is no wrong answer (and yet not wishy-washy at all; she's a real person with real ideas and opinions) and encourages people to participate and shoot out any thoughts--and indeed, some of the great ideas that came up in the course were from students. She is amazingly helpful and accessible: she will talk to you in person, by email, or by skype, or etc and literally will look over as many drafts of papers as you give her and give you help on every single one. You can do 20 drafts of a paper for her and she will give each draft attention and help you earn a great grade. She's funny and makes the class a good time. She was also wonderful on museum tours; afterward I felt like I never wanted to go to a museum without her. Sometimes she brings her small black dog to class. \nWorkload:\nThere are often small homework assignments such as reading an article or looking at a painting online or sketching that was discussed in class. There are a couple papers (one about 5 pages, one about 8 pages) for which you have to go to a museum, and a couple required museum trips. The midterm an final were both very short and involve writing about art (not about art history--about what's going on in seeing the piece(s) of art). A fair, not harsh, grader. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 18, 2010",
            "review_content": "\nAs an art student, I was sort of apprehensive about taking an art class, but Jessamyn's class is such that you can participate as much or as little as possible, and most people end up taking a lot away from the class. There's very little reading as the class is mostly based on discussion and as general as this sounds \"what it means to look at art, or anything.\"  The class was realyl interesting and I feel like I learned a great deal about being specific and articulate as far as what I see. If you put effort in, it's easy to do well.\nWorkload:\n1-2 short readings\nLots of writing--many small writeup and a few major papers\nA few projects, hands-on stuff, and an audio recording of one of your papers\n"
        }
    ]
}