{
    "prof_info": [
        {
            "prof_name": "Patrizia Palumbo",
            "prof_id": 1057,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian II",
            "review_date": "April 27, 2011",
            "review_content": "\nProfessor Palumbo was absolutely amazing. I can do nothing but praise her. She makes the lessons as painless as possible, and doesn't waste your time with hours of busywork in or out of class. Class time was, if I dare say, enjoyable. We spent a lot of time casually conversing in Italian and it was great to spend that time practicing. She's very encouraging as a teacher (but not in an annoying way), and won't single you out or make you uncomfortable if you don't know an answer. The way she runs the class is very relaxed. On top of being a great teacher, Prof. Palumbo is a really nice person and it was refreshing to have a teacher that wanted to get to know you as a human being.\nWorkload:\nSmall quizzes every few weeks, about 6 one-page compositions for homework. Midterm and final. \n"
        },
        {
            "course_name": "Intensive Elementary Italian",
            "review_date": "January 11, 2011",
            "review_content": "\nProfessor Palumbo is, in short, amazing. Ideal. This woman deserves a gold star. Honestly, there's absolutely nothing more you could want in a language teacher. She genuinely cares about her students and, above all, LOVES to teach-- which isn't so common at Columbia. Additionally, she's very lenient with grading, which is a relief in a language class-- it allows you to relax and to let yourself to make mistakes, take linguistic risks. And she has an adorable accent (even if most of the class is conducted in Italian.)\nAlthough she assigns a lot of work, I wouldn't stress about it. Do it if you think it helps you, but Prof. Palumbo won't force you to do what you don't want to do-- or think that you don't need (if you really don't need it.)\nOverall, this class was a joy. You'll definitely reap what you sow. If you don't participate or do the work, you won't learn Italian (very well.) But if you have a genuine interest in learning Italian, this is as good as it gets.\nWorkload:\nHeavy weekly textbook work (after all, it's intensive), but it's not actually required; weekly quizzes; semi-frequent compositions; an oral presentation; midterm; final. For a 6 credit course, pretty reasonable and light.\n"
        },
        {
            "course_name": "Advanced Italian II",
            "review_date": "January 19, 2010",
            "review_content": "\nProf Palumbo is a wonderful teacher. She is warm, caring, approachable, attentive, and eager to teach Italian. I took Advanced Italian II: Italian in Film Comedy with her in the Spring of 2009. The class was structured around decades (we started with the '40s) and every one-two weeks we would watch another film. Besides discussing the films sometimes she also had grammar review sheets for us to complete in class. Also, just a small note, you had to watch the films outside of class.\nLike the other reviewer there is absolutely nothing bad to say about Prof. Palumbo. \nI also had Advanced Italian Conversation II with her which is a really fun class and a great way to keep up your Italian. \n\nWorkload:\n Two page commentary on each decade. These were due whenever you wanted them to be as long as you wrote them all. This was wonderful because it gave you the freedom to plan your work schedule. However, I would recommend not leaving them to the very end. \nIn addition to the reviews we also had a final presentation on an Italian film of our choice.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 16, 2006",
            "review_content": "\nShe is the sweetest woman ever and a very good teacher.  I would highly recomend her.  I really dont know what to write, other than that she seems faultless in my eyes, very understanding about assignments and deadlines.  I highly recomend any class with her.\nWorkload:\nNot bad, typical italian class, a quiz about once a week or when u finish a chapter, and some homework.  Work book to be turned in, but the hand in time is very flexible.  She is  very nice, you learn without doing too much work. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 01, 2006",
            "review_content": "\nShe is great! Really understanding and down-to-earth. She is very accomodating and really cares for her students. She knows it is a lot of material so she is really helpful. \n\nWorkload:\nlight, workbook and labs once a week, easy weekly quizzes\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "June 30, 2005",
            "review_content": "\nPatrizia is great.  She's really nice and genuinely seems to care about her students.  She's also very relaxed about deadlines and grading compositions.  How much you learn is completely based on how much you pay attention and how much effort you put in.\nWorkload:\nworkbook/lab book (to be completed at any time), lots of quizzes, midterm, final.... really not a lot\n"
        },
        {
            "course_name": "Italian",
            "review_date": "January 07, 2005",
            "review_content": "\nPatrizia is an awesome teacher! I had her for two semesters and thought that her class was awesome. The workload is incredibly light and learning really depends on your own participation. \nWorkload:\nreally light - workbook and lab can be completed at any time. Grading is very fair and Patrizia easily accomodates to any problems you may have. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "June 11, 2003",
            "review_content": "\nI loved her! Even though she is an easy grader and has a lax attitude about departemental busy work, I still learned a lot this semester. She explains things much better than my teacher last semester, perhaps because she isn't afraid to speak in English. But that isn't to say that Italian is not spoken in class. The class is more like conversational Italian, which is good at this stage of the game. Some people chose not to speak any Italian during the semester, answering all questions in English, and Patrizia did not object. However, it was more beneficial and became increasingly easier to just answer in Italian. We also got to go on some cool field trips since the class meets at 6-8 pm. I guess the only thing about this class is that the student is responsible for learning a lot of the material because it is easy to get away with slacking off. If you don't need someone to hold your hand through the foreign language requirement and are a mature, self-driven student interested in learning Italian in a relaxed environment, this class should be perfect. \nWorkload:\nVery little. We were supposed to have a quiz every other class, but we usually ended up having one every two weeks. She assigns homework, but doesn't check up on you. Doing the homework will definitely help you understand concepts, but doing all the homework is probably not necessary. Easy midterm and final. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 09, 2003",
            "review_content": "\nI absolutely dreaded Italian, but I love Patrizia's class. Patrizia is a really sweet, easy-going and fun lady who makes Italian seem like fun rather than a chore. True, she does speak English often in class, but THIS IS A GOOD THING. She speaks in Italian, and then repeats everything in English, so the information actually sinks in. Also, Patrizia does not drag her classes through all of the department assigned busy-work, and she arranges Italian field-trips. I love this lady-- if you have the opportunity, take her class.\nWorkload:\nQuizzes and exams follow Italian department syllabus, but MUCH less busywork. Class time itself is enjoyable.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "February 02, 2003",
            "review_content": "\nIt may be \"EASY,\" but that is only because Patrizia is \"L-A-Z-Y\" Her \"pigra\" attitude is reflected in her students disrespect and her lack of involvement.  She speaks in English most of the time and really doesn't care whether or not her students learn anything.  Take this class if you don't care.\nWorkload:\nAbsolutely- I guess she is good at pulling the wool over the department's eyes and fooling them that her students actually do anything.  I feel cheated by Columbia that I am in this waste of time class.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "November 19, 2002",
            "review_content": "\nPatrizia was by far my best teacher this semester. She is funny, easygoing, and her class is more than manageable. The departmental work gets assigned but she doesnt really care if you do it or not. It is hard not to get an A in this class if you pay attention and do minimal work and studying at home. Overall an easy, enjoyable class.\nWorkload:\nweekly quizzes, midterm, final, some workbook assignments\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 30, 2002",
            "review_content": "\nE-A-S-Y. The Italian Department asks teachers to assign lots of busywork, but Patrizia doesn't care if you actually do any of it. She's supernice and relates very well to students, and her accent is adorable! If it didn't meet at such a God-awful time (6-8 pm MW), this class would be perfect. but it's still highly recommended.\nWorkload:\nWeekly quizzes, midterm, final, all easy. second semester we had to do little presentations that were fun and not a lot of work to prepare.\n"
        }
    ]
}