{
    "prof_info": [
        {
            "prof_name": "Li Zhang",
            "prof_id": 7126,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 21, 2009",
            "review_content": "\nZhang Laoshi stepped off of a plane from Beijing not five hours before the first class, so she can be forgiven for being a little disorganized at the beginning of the semester. \nThe good: She's extremely energetic, which is probably the most important thing a language teacher can be. She's also extremely friendly, and (in the areas where she's capable of rendering help) extremely helpful outside of class. Grading is lenient (this seems to be a department-wide thing), and whether out of genuine charity or simply because she can't read the calendar, she's not nearly as despotic as the rest of the department about due dates and late work.\nThe bad: by the end of the semester your Chinese will be better than her English. This is great for forcing you to communicate with her in Chinese, but makes her basically helpless at explaining fine points of grammar (the standard response is \"Maybe you should go look at book after class\"). The Chinese curriculum here is well-structured enough that her occasional floundering around doesn't wind up being especially detrimental, but the too-frequent moments of chaos and confusion (suddenly-rescheduled homework assignments, accidental pop quizzes, etc) were still frustrating.\nThese became less and less frequent as she started to learn the ropes; if she was a poor teacher at the beginning of the semester and a mediocre one by the end, I wouldn't be surprised if she's pretty good by the end of next semester.\nWorkload:\nThis is the Chinese department; they already tried to scare you away with the workload. The claim of three hours every night is preposterous, but be prepared to spend at least that much time once every week or two to prepare for the exams.\n"
        }
    ]
}