{
    "prof_info": [
        {
            "prof_name": "Jamy Stillman",
            "prof_id": 3003,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Issues in Education",
            "review_date": "November 27, 2007",
            "review_content": "\nI agree with the previous reviewers...Prof. Stillman is an AMAZING person who teaches an absolutely amazing/ thought provoking/ inspiring class.  She will challenge you- you will work harder than you had ever thought you could before- and she will get you to work to your full potential.  But the thing is that you will not even realize how much work you are dong for this class becasue it is so enjoyable and inspiring.  Professor Stillman also was able to incorporate many different methods of instruction (video, small groups, powerpoints, discussions, etc) so there was never a dull momement in this class.  In the end, Contemporary Issues is probably the best class I have EVER taken.  In fact, it really inspired me to become a teacher and to advocate for equity in schooling.  I am so grateful to have been a part of Professor Stillman's class; I highly recommend it!\nWorkload:\nLOTS of reading (but it's all worth it), leading the class one week, weekly reading responses (about 1-2 pages each), a 4-5 page paper, a 5-7 page paper, and a 10-15 page independent research project with a fieldwork component; class participation and attendance are a must but you won't have trouble engaging in class debates/conversations\n"
        },
        {
            "course_name": "Contemporary Issues",
            "review_date": "December 18, 2006",
            "review_content": "\nThis is the first Education class I have ever taken and it was AMAZING.  Professor Stillman is a wonderful teacher: caring, critical, smart, and engaging.  I usually am bored to tears in classes, but I looked forward to this one every week--not only did I learn a lot, but it was FUN.  We read so much excellent material and talked nonstop about the salient issues in education today: racism, sexism, NCLB, standardization, tracking, and how schools 'structure inequality.'  If you're at all interested in teaching, you should definitely take this class--or even just if you want to study relevant social issues through the lens of education.  Stillman ends the class with \"Radical Possibilities\" and you leave believing that it IS possible to teach for social justice.  Amazing.\nWorkload:\nweekly responses, class participation, a 4p paper, a 6p paper, and a 10-15p paper; leading one lesson.\n"
        },
        {
            "course_name": "Contemporary Issues, Method, Practicum",
            "review_date": "December 10, 2006",
            "review_content": "\nTotally agree with the other reviews. I don't think I know of anyone who hated or even disliked her class. She's truly passionate about the class and encourages her students. She creates a sense of community in the classroom which I find to be rare in college classes these days. She really cares about each of her students, which is why there may be more work than usual but trust me you'll want to impress her. It's a lot of reading, but I try to read two or three pieces and skim the rest...participation is a must in her classes. The class thrives on discussion. \nWorkload:\nContemporary: one 10 page research paper but broken up into a literature review and an article review and drafts in between with writing fellows. weekly reading responses and  faciliation of one class with group.\nMethods: weekly responses, autobiography, one group project, lesson plans\nPracticum: classroom observation, notebook with observations, one class faciliation with group. \n"
        },
        {
            "course_name": "Contemporary Issues, Practicum, and Methods",
            "review_date": "November 01, 2006",
            "review_content": "\nI love this professor! I truly believe that she is by far the best at what she does. She challenges you- gives you a heavy amount of reading and assignments, but the assignments are ALWAYS meaningful! She has so much experience in this field. Her multicultural pedagogical approach and her passion for America's youth grabs you. She is the reason that I am going to be a teacher. She is the reason that the ed program is getting its much needed revamping! She gives you tons of comments on your papers and help researching if you need it. Take Contemporary Issues if you think you may be interested in Education. Its a class that will open your eyes to the inequities that exist in the education system. \nTake her class!\nWorkload:\nheavy but always well explained (rubrics are always provided); Contemporary Issues: response papers each week, one 5-7 page paper, one 10 page paper and one 15-25 page paper and facilitating one lecture. Methods: response paper each week, teaching autobiographies, unit plan, 6 lesson plans, assessment plan, theoretical perspective. Practicum: observaton at a elementary school in the area and journaling, acivity setting paper, shadow one student\n"
        },
        {
            "course_name": "Contemporary Issues, Methods/ Practicum in Elementary Teaching",
            "review_date": "September 04, 2006",
            "review_content": "\nProf. Stillman is by far the best professor I have had at Barnard. She is so intelligent and insightful and you will leave each class feeling happy, inspired, educated and, in my case, in love! Stillman brought so much knowledge on Education into her classes and really inspired me to want to teach. I was never bored in her class. She had a tremendous amount of experience which she shares with her students and really makes an effort to get to know each one of her students on a personal level. That was one of her best features: through my papers and assignments, I feel that she really got to understand my thinking and know me as a person, inside and out. Def take advantage of her office hours. \nShe is a fabulous woman and teacher, and is also just so adorable and lovable. Take any class you can with her and try to build a relationship with her- its worth it becuase she is the type of person you want to be friends with forever. You will leave these classes fully prepared, if not over prepared, to be a teacher.\n\nWorkload:\nBoth these classes require a ton of work, but all the readings and assignments are worth it and interesting- you will learn so much. I took these courses the first time they were offered so the curricula may have been adjusted. In Contemp Issues you will create your own research project which is fun and independent. In Methods you will create your own teaching unit with a group which is hard but great teaching expereince. She is a fairly easy grader, if she realizes you put a lot of effort into your work. \n"
        }
    ]
}