{
    "prof_info": [
        {
            "prof_name": "Volker Berghahn",
            "prof_id": 538,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "May 01, 2014",
            "review_content": "\nI disagree with his having a silver star. I know I'm in the minority with that belief. But let me justify my claim: Prof. Berghahn is an exceptional lecturer, and well regarded by most taking his class. He's a great man and really cares about teaching and about students. That said, although his lectures are generally engaging and for the most part well organized, I felt like I didn't get that much out of them. He always had important points to make but I felt like the critical analysis just wasn't there, or when it was, it had no edge to it. In other words, critical engagement was often sacrificed for narrative, statistics, or anecdote. Sometimes, he will make banal platitudes about the importance of perspective in doing history, but never really said anything that made you think really hard after the lecture. It was easy to just go, type a few notes on the lecture, leave, and not think about it again until the final; similarly, discussion section was typically dry--\"so, what do we notice about this document?\" type of stuff. This class really didn't achieve what I think Humanities pedagogy is supposed to achieve. While I certainly do not regret taking the class, I definitely won't look back on this class as having shaped my intellectual development in any significant way. I'm sure the auditors--who took up literally the first 5-6 rows of seats--got more out of this class than I did. I don't mean to disrespect Prof. Berghahn, who's a great man and a tremendous scholar (prof. emeritus!), but I feel like there are much stronger professors in the History dept., ones that will really challenge you to grow and think critically.\nWorkload:\nFairly light. One 7-8 page essay on Schindler's Ark [Schindler's List] and a 15-16 page final essay, with suggested prompts or design-your-own. I've heard Prof. Berghahn himself grades more easily than the TAs, and there may be a hint of truth to that (quote: \"If it were up to me, I'd just give everybody As and A+s because I'm sure you all are very bright\"). Straightforward final, I think, but haven't taken it yet. As others have mentioned, reading is basically optional.\n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "January 21, 2013",
            "review_content": "\nThis was one of the best classes I have ever taken. Professor Berghahn is an incredibly engaging lecturer and anyone who likes history will absolutely love this course. He is a very fair grader- probably a bit generous at times - and he is always happy to meet with students. Berghahn is one of the best professors I have ever had. Also he does a good job of choosing TA's all of them were really nice.\nWorkload:\nVery reasonable. Reading every week but a lot of people don't read and still do well. One short paper (7-8 pages) which is quite manageable on All Quiet on the Western Front, one longer paper (15-16 pages, choose your own topic with Berghahn), and an easy final as long as you were in class.\n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "December 22, 2010",
            "review_content": "\nA fantastic course overall. Professor Berghahn is brilliant and his lectures are lucid. Unlike many professors in the history dept., you can sense his genuine interest in making students understand the material. Anyone interested in taking this course to learn about the Holocaust should look elsewhere, as the factors leading up to it and its ramifications are the true focus of mid-century lectures. Berghahn tries (and mostly succeeds) on showing different aspects of Germany society, politics, and culture. I'd advise actually going to lectures and taking good notes, since the exam questions are essentially lecture topics. A great course overall made possible by a wonderful professor.\nWorkload:\nLight reading (a few chapters and primary source docs every week), but heavy writing. \n7-8 page paper on All Quiet on the Western Front which is fairly easy.\n15-16 page paper on either an assigned topic (which your TA will grade) or you can chose your own topic in consultation with Berghahn, in which case he grades it. Unless you really have a topic you are interested in, I'd advise writing one of the assigned topics since he recommends sources to use. \nVery fair in-class final exam in which you pick 3/12 essay options. The review session is pretty helpful and I'd recommend preparing vague outlines for the major periods of each to study (Weimar, 1930 Nazis, post-WW2 reconstruction, East-West divide, etc).\n\n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "June 07, 2009",
            "review_content": "\nProf. Berghahn is without question one of the shining stars of Columbia -- not just within the History Department, but of the University as a whole. This class was an absolute pleasure: interesting, provocative, engaging and empowering.\nProf. Berghahn's kind nature and brilliant mind come through in his teaching style -- his lectures are perfectly organized (and he even provides a brief recap of the previous class meeting which is very helpful), he had a soft-spoken and kind demeanor, and he truly welcomes questions. When I visited him during Office Hours, he seemed undistracted and genuinely interested in my questions and my well-being in general. His review of my classwork was at once thorough, rigorous and encouraging. He comes with an understated brilliance that is inspiring.\nOn the basis of this classroom experience, I would take virtually any course that Prof. Berghahn offers.\nWorkload:\nVery fair: a short paper, a longer paper and an in-class final.  Readings are manageable. \n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "May 26, 2009",
            "review_content": "\nThe finest gentleman around, professor Berghahn is polite, respectful, pleasant, organized, and caring. He is exactly what I had always dreamed an Ivy League professor should be. \nHe will guide you through the material, he will answer your questions, he will respond to your e-mails within an hour or so, and be there to help you. \nI can't tell you how much I've learned in this course - granted the subject is fascinating to most people, he sure makes it even more so. \nTake his class, history major or not - the professor alone is worth your while. \n\nWorkload:\nWeekly readings (fair amount), weekly discussion session (necessary and helpful), short book report, long paper worth almost half your grade, and final. \n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "May 17, 2009",
            "review_content": "\nBerghahn should have a gold star! his lectures are interesting, organized, and thought out. He takes questions and is always available during office hours. His knowledge of the field is unparalleled. this class was really a great class. \nWorkload:\n1 short book review paper (8 pgs, 20%) 1 long paper (18 pgs, 40%), final (40%). The papers are fine. For the long one, it might pay to do a different topic than the ones assigned because then Berghahn grades it, and he is an easier grader than the TAs. The final was really easy, there was 3/12 essays--that's it. \n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "May 14, 2009",
            "review_content": "\nProfessor Berghahn gives excellent lectures that are organized and interesting. When  you're finished, your notes will read through like a well-made packet on German history. Plus, the guy is incredibly nice and accommodating. The TAs, however, can be hard asses. \nWorkload:\nOne 7-page essay on All Quiet on the Western Front, one 15-16 pager on one of his four given topics or one of your own devising, and a final (3 of 13 questions). Reading load is incredibly manageable.\n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "May 14, 2009",
            "review_content": "\nProfessor Berghahn gives excellent lectures that are organized and interesting. When  you're finished, your notes will read through like a well-made packet on German history. Plus, the guy is incredibly nice and accommodating. The TAs, however, can be hard asses. \nWorkload:\nOne 7-page essay on All Quiet on the Western Front, one 15-16 pager on one of his four given topics or one of your own devising, and a final (3 of 13 questions). Reading load is incredibly manageable.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "December 22, 2006",
            "review_content": "\nI happened to love both European Catastrophe and Prof. \nBerghahn's class this semester on modern Germany. Prof. \nBerghahn is warm, friendly, and, most importantly an excellent scholar and an interesting lecturer. His frequent focus on social history and choice of (in my opinion) already fascinating periods of history makes his lectures easy to listen to. If you choose to write your final paper on your own topic, he is really available to talk about this outside of class and takes an active interest in your work. I'd take another class with him in a heartbeat. \nWorkload:\nAverage length weekly readings, a short book review (7-8 pp), a longer final research paper (15-17 pp), and a final.\n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "December 13, 2006",
            "review_content": "\nProfessor Berghahn is one of those cute old men who says things like \"wet cornflake\" but still actually knows what the hell he's talking about. He is mostly interesting in lectures, and definitely has well-organized notes and is open to answering questions in class. He provides a scholarly -- not German -- perspective of German history. Above and beyond his overall knowledge, lecturing skills, and precious anecdotes, he is nothing if not considerate and accomodating. He is always ready to meet outside of class, responds pretty quickly to e-mails, and will work with you to make sure you refine your independent research topic, should you choose to do one. He's just a really great and interesting guy, and this class is actually really interesting on top of that.\nWorkload:\nOne 8-10 page paper on a book, which was not that hard. One 15-16 page research paper on either a given topic or one you make up yourself, which is due in early december and therefore stressful. A final that is in essay format with many questions to choose from.\n"
        },
        {
            "course_name": "Modern Germany 1900-2000",
            "review_date": "November 17, 2006",
            "review_content": "\nProfessor Berghahn is a fairly engaging lecturer and the subject matter of this class is usually quite interesting. What will make you love this class are his personal anecdotes about being a teenager or child post-WWII Germany and driving a \"bubble car,\" etc. Professor Berghahn himself is probably one of the nicest and most accomodating professors I will ever have. For example, the final this semester was scheduled for the 20th of December, and he is allowing me to take an alternate version (that he has to write) on the 14th with \"probably a couple other students\" so that I can go home earlier and pay less for a plane ticket. His exact words were \"Why don't you figure out when would be best for you to leave and we can schedule it before that.\" \nBeyond why I personally appreciate this class solely for the professor, its taught mostly on the basis of conflicting historical theories about German history, which is an interesting way to teach the subject matter. Beyond that, this is a really interesting part of European history. I would highly recommend this class and this professor.\nWorkload:\nOne 6-8 page critical analysis of a historical book, 12-16 page final research paper on one of three topics or one of your choice (if you do one of your choice, Prof. Berghahn grades it and I heard he grades easier than some TA's), and a final of 12 questions of which you must answer 3 in the allotted time. Weekly discussion sections. My TA was from Eastern Europe and a sweetheart (Ana Antic), totally accessible for paper topic discussions, appreciates enthusiasm.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 19, 2006",
            "review_content": "\nWretched, incomparable disappointment. This is the worst class I have taken from the otherwise excellent History department. It is difficult to believe that a course taught by a so-called distinguished professor for so many years can still seem like such a poorly organized train wreck. True, Volker could feign benevolence, granting the same post-Thanksgiving extension on the research paper he does every year (were he to merely readjust the due date on the syllabus, the opportunity to seem as if a warm and caring instructor would of course be lost). He will take the time to meet with you and recommend sources on your papers as well, but only up to a point (and will grade based on preconceptions he somehow gleaned from these meetings which may have little or nothing to do with the subject or contents of such papers- in fact, for all his reputed easy grading, my book review paper was far more generously graded by the otherwise notorious TAs). I found all his purported warmth to be as disingenuous as that of a department store Santa Claus. And as others have mentioned, the intellectual caliber of the class hardly compensates; if you do glean anything from lectures (most likely in the form of some obscure detail), it will not be in any coherently presented fashion- Volker will flit between tenuously connected topics, claim he is lecturing on one subject and deliver another, and spend, for a European history course, far too much time talking about America and the Far East. There was no attempt, by the end of the course, to summarize its contents and to present any structural or theoretical grounds for European decline, which rendered this course little better than a poorly developed survey. Not highly recommended.\nWorkload:\nFar too much for a lecture class- one 7-8 page book review, one 18 page research paper, which can be on a number of preconceived topics or one of your own, in which case Volker gives you research guidance and grades your work. Sections are not required, nor is knowing the reading for exams, so both can be easily foregone.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 01, 2006",
            "review_content": "\nOther reviewers have already said it right. Volker cares - he always has a big smile on his face in the front of the class, lectures without notes, is awesome to meet with in person, etc. (I feel like he'd be an awesome seminar professor), but this class is really boring. I'm a history major, and I usually love going to my history classes because the professors say such interesting new things about the subject, or shed some new light on an event or period - but this class taught me nothing that I felt like I couldn't learn instead by staying home and reading wikipedia. It was a real disappointment. I stopped going half way through the semester.\nThe workload for this class is also too much. A 7-8 page book review and 15-17 page research paper - for a maximum total of 25 pages is more pages than were assigned for my 4 point seminar, and more than my other three history classes this past semester combined. People seemed to love \"Homage to Catalonia\" - but its a very difficult book to review (and I thought it was dull). That paper was also graded harshly. I chose to do my own topic for the research paper, but after deciding to pass/fail this class, I did a pretty terrible job (and yet, still received the same grade on it as the book review that I actually worked at). \nI would avoid this class, I had high hopes for it, and it was a huge letdown. Volker's great though - if you have the chance to take a more intimate class with him, I'd strongly recommend it. This class though - skip over it.\nWorkload:\nOne 7-8 page paper (book review), one 15-17 page paper (research paper), no midterm. Final asking 3/12 questions - one from each war period. \n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "April 10, 2004",
            "review_content": "\nI really did enjoy the class overall. I thought that his lectures were very interesting, although I noticed that other people who reviewed him did not agree. My main problem with the course was the TAs. \nAvoid courses where TAs grade your work. They grade extremely hard. He gives the option of attending a discussion section and then each of your papers and your final will count less when calculating your end grade. While this sounds ideal, do not do it. \nWhile you may think that it will be easy to get an A in the discussion section it is not worth it because if you are in a discussion section your TA will grade your papers. The TAs grade unfairly. If you are not in a discussion section, while the papers and tests will count more, you are more likely to do better on them, because Professor Berghahn will grade the papers himself, which is ideal. He is a great man. If you take the class, try to meet with him at some point. He is very interesting. Also for the final paper, try to pick your own topic as opposed to one of the options he gives you. \nWorkload:\nAn 8-10 page paper, a term paper, a final\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 15, 2004",
            "review_content": "\nWell...Prof. Berghahn cares.  That's the biggest compliment I can give this course.  He cares about the material and he cares about the students.  He is flexible and genuinely interested in the thoughts of the students.  However, the lectures themselves are not very enlightening or informative.  There are certain themes that Berghahn emphasizes and re-emphasizes, but rather than fleshing out the themes with actual history, he just repeats them.  All in all, the other reviewer was right. \"eh.\"\nWorkload:\nNot too shabby.  One 7-8 p. book review, weekly discussion sections (you opt or not opt for them at the beginning of the course), 1 final paper (book review), easy final\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 04, 2004",
            "review_content": "\nIn his defense, Professor Berghahn is one of the nicest people I have ever met. He's always got a smile on his face, is fairly flexible with deadlines, and made himself available for discussions outside of class. \nHowever, the class itself disappointed. He tended to spend the first third of each lecture recapping the previous lecture, almost as if he were encouraging you to skip every other class. Worse still, the course amounted to nothing more than a rambling survey of early 20th century history. One day he'll spend a third of the lecture going on a tangent about railroads and standardized time, another day he'll devote the entire class to Nazi racist policies. Sure, some bits of trivia in the lectures were interesting, but what was the point to it all? If there was some method to this madness, it completely passed me by. I came out of the class wondering what, if anything, I learned from it.\nWorkload:\n1 book review, 1 long paper, final.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 03, 2004",
            "review_content": "\nI had trouble sitting in the room assigned to him - but that was more because it was full (he loves the senior citizen auditors) rather than his teaching style.  He is able to lecture continuously - only taking one or two breaks to answer questions (for the love of your classmates - PLEASE save your questions for after class/ office hours) - and needs to use little to no A/V equipment.  Nevertheless, because he can go on and on it is difficult to take notes since if you miss a sentence you can be confused the entire lecture.  The reading list was pretty bad - and I really didn't like the Orwell book although everyone else said it was the \"peak\" of the reading list.  Sections could be either great or godawful depending on which TA you're assigned to.  The research paper is insightful and if you choose your own topic he'll read it himself (and give very kind feedback).  I was a  little disappointed that there wasn't too much time spent  on WWII but I guess you could take another class if that war \"strikes your fancy.\"  All in all not bad course, but if you want a more interactive class go elsewhere.\nWorkload:\n2 papers - one is a critical assessment on Orwell or Fussell (8 page min.), the other is a paper based on one of the three questions he poses or you can pick your own topic with his permission (15 page min.).  Sections are optional - if you want to go to all you can get 10-20% credit, if you don't want to go your written work counts more but Berghahn reads your papers.  Final exam is based on 12 questions - pick 3 (at least one has to be from each war era).  Weekly reading for sections ranges - very light in the beginning but the last two sections were pretty heavy.  Our section TA made us present once during the course of the semester.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "November 24, 2003",
            "review_content": "\nEh is how i would summarize this prof and this class.  he gives excellent, detailed lectures in a very organized format, making it easy for you to take down coherent notes that you will then use on the tests, but they're not particularly fascinating.  also just when you think he's about to say something profound, he usually blows it and says something convoluted and a little silly, like his first lecture after 9/11 was about new beginnings and the world today, but it was not nearly as inspirational or comforting as i would have thought coming from an extremely intelligent history professor.  the readings he selected were AWFUL, uninformative, VERY poorly written and didn't touch upon the main ideas of the class.  he actually ridiculed one of the assigned books and its author in class, but to be fair the book really did suck (the pity of war)\nWorkload:\nSmall paper, big paper, midterm and final, fairly large amount of reading and most of it is uninteresting but you don't really have to do all of it\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "August 11, 2003",
            "review_content": "\nBergahn is quite boring and has an unfortunate habit of presenting vapid opinions as if they were the product of deep thought.\nWorkload:\nAverage.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "February 13, 2003",
            "review_content": "\nProf. Berghahn is a very good lecturer, giving interesting lectures in an engaging manner and unique style.  He has a German-tinged British accent and a vocabulary all of his own (we tried counting the number of times he mentioned the \"orgy of violence).  He's also very personable Â— I can't recall ever seeing him without his big trademark smile Â— and approachable outside class, too.  The readings are not all interesting (the Orwell was the best by far), but the subject matter is and if you're into history at all you'll appreciate Prof. Berghahn's lectures, with their heavy emphasis on social and cultural history.\nWorkload:\nShort (8-10 pages) and long (16-18 pages) papers, final exam (not overly difficult); bi-weekly discussion sections, weekly readings of average history volume.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 27, 2003",
            "review_content": "\nI took this course on the recommendation of a friend, only to be severely disappointed.  Berghan's lectures are not very engaging and he spends most of his time driving home already obvious points while glossing over some of the more confusing and obscure information.  The readings are not particularly enjoyable either (except for the Orwell).  Paper assignments were poor I thought.\nWorkload:\n2 papers (10 and 15 pages) and a final.  bi-weekly discussion section.  reading workload varried.  \n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "November 24, 2002",
            "review_content": "\nHe is a thorough lecturer, his presentation of material is interesting and very dense. One can keep up with it, but missing classes, discussion sections and recommended movies will put you at a disadvantage. Yes he does write a lot of names on the board before class that he may or may not incorporate in his lecture that day...so what?...history is more then the lecture and these are there for you to work with on your own (or not). The man knows the subject and treats it with great care, the subject can be daunting and depressing too, but if you are taking the History of the European Catastrophe you should realise that the subject is not about the Gilded Age. Great class. \nWorkload:\nEntirely reasonable if you like history, probably a major imposition if you do not like history.\n"
        },
        {
            "course_name": "The European Catastrophe, 1914-45",
            "review_date": "January 14, 2002",
            "review_content": "\nThe course material was good and Berghahn himself is a very understanding and kind teacher. He pushed the date back of our final paper a week so that we would not have to work over Thanksgiving. At times he can be very dry, but he generally is very interesting and is a decent lecturer. The final was not difficult at all. The TA generally does the grading unless you choose to do some outside research project aside from the given topic choices, or unless you specifically request that he read it. Overall, I enjoyed the class.\nWorkload:\nOne short paper (8 pages), One long paper (16 pages), and a final exam.\n"
        },
        {
            "course_name": "German History 1914-1989",
            "review_date": "December 31, 1999",
            "review_content": "\nBerghahn is a smiley, sheepish and friendly German man. Apparently, we dragged him away from Brown--take that for whatever it may mean. Pretty intelligent guy who focuses a lot on historiography, rather than the history of 20th century Germany. Don't pay any attention to the terms he puts on the board at the beginning of each lecture: they are completely irrelevant. This class can be depressing sometimes. Think about it: every day it's either about an economic depression, massive warfare, inept governments, etc., etc., etc. Thankfully, he took the godforesaken 700+ page biography of Hitler off his reading list (which students had to read in its entirety and write a 10-page review). Visit him in his office hours. And don't laugh too hard at his frequent usage of the word, \"willy-nilly.\"\nWorkload:\nBook review, midterm, large research paper and final. Don't forget your weekly discussion sections. Nothing too much out of the ordinary. And as with most history classes, grading is definitely dependent on your TA.\n"
        }
    ]
}