{
    "prof_info": [
        {
            "prof_name": "Aaron Schneider",
            "prof_id": 2299,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English",
            "review_date": "November 18, 2014",
            "review_content": "\nProfessor Schneider is a nice guy and a pretty chill teacher. Honestly the class is pretty easy. He tends to dominate the discussion which can be annoying, but at 8:40 in the morning everyone is basically asleep anyway. If people make an effort to speak up then he will sit back and let the discussion happen for the most part. He focuses the class a lot on writing and gives good comments. He focuses heavily on writing style and clarity, and much less on content. Overall not a bad FYE teacher and definitely seems easier than other FYE teachers. I would't say try to get him, but if you do get him don't worry. \nWorkload:\n2 short paper and 1 research paper (all submitted twice), weekly readings usually not too long\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "April 03, 2011",
            "review_content": "\nI really loved Professor Schneider's class. He gives really good, clear feedback on essays, and the assignments are really flexible- he just wants you to improve your writing. For one of the assignments, all he said was \"compare two things.\" You really get to make it your own. He is so EARNEST, seriously that's the only word I can think of to describe him. I also never write on Culpa, but I wanted to because I feel like the other two reviews are really misleading. All the reading is interesting. We don't read books, just short stories and excerpts. Anyways, I love the class and I think he's a great teacher. But the reviews are right when they say the best part is the feedback on essays. I highly recommend him for essay writing.\nWorkload:\n3-4 page papers every other week and corrections, weekly readings (not much, an hour tops). The paper topics are so flexible, you can pretty much write about whatever you want. Really fair grader, cares alot about improvement\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "January 15, 2009",
            "review_content": "\nProfessor Schneider does mean very well.  However, this class was painful.  I was looking forward to the course, but found the experience to be somewhat like pulling teeth.  He is such a nice man and extremely committed, but the time spent in class always felt like a waste of time.  His comments on our essays were very helpful, however, and perhaps I am better at using semicolons now.  The midsemester meeting was also helpful.  Schneider's strong points were editing our papers and providing direct feedback.    \nWorkload:\nreasonable...about 5 essays over the course of the semester and one presentation\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "December 22, 2004",
            "review_content": "\nProfessor Schneider is a very nice & well-intentioned man &, that said, his class was the most singularly boring academic experience I have ever had.  For two hours every week he would ramble about grammatical and stylistic conventions (\"I don't want to get philosophical about semi-colons, BUT...\") that could be much more easily and succinctly obtained by flipping through any major English style guide.  The assignments were broad, easy, and utterly unrelated to anything else you will ever have to do in college; in-class discussion was forced, painful, and repetitive.  Prof Schneider does, however, give lots of feedback on all assignments, some of which was helpful and all of which clearly displayed his devotion to his students.\nWorkload:\nOccasional short reading assignments, five 3-4 page essays, two ungraded re-writes.  The final grade is based entirely on the average of the five essays, with the lowest grade dropped.\n"
        }
    ]
}