{
    "prof_info": [
        {
            "prof_name": "Sarah Arkebauer",
            "prof_id": 13439,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 14, 2021",
            "review_content": "\nSarah is the GOAT!!!! Especially in an online setting, it was awesome to have such an understanding prof. I am not a big humanities person and she still made this class engaging and productive. If you can get her, you MUST!\nWorkload:\nNot bad at all. LH will of course have some reading but that's in every class. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 15, 2021",
            "review_content": "\nSarah is HANDS DOWN the best lithum teacher. Very nice, very kind, you'd be lucky to have her.\nShe made me not hate this course.\n\nWorkload:\nNot bad, but still feel like I learned something. She's a legend\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2020",
            "review_content": "\nShe is literally the best. If you have her don't switch out!\nWorkload:\nTwo papers + Take home Midterm (I took online) \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (LitHum)",
            "review_date": "December 07, 2020",
            "review_content": "\nHow the heck does Arkebauer not have a gold nugget?!?!? If you're in her section of LitHum, you have--to quote another reviewer--won the LH lottery. She is engaging, nice, funny, and makes everything relevant. You don't need to spend much time on the class each week. As long as you keep up with readings, it's easy to contribute to discussions and she creates a comfortable environment (even this year over Zoom). I cannot recommend her enough...she is wonderful.\nAdditionally, I would like to note that you do not need to do a close reading of many texts, but some definitely require you to finish the book. I got away with skipping a few of the novels in favor of sparknotes and still managed to grasp the discussions, but don't do this for all of the books or you WILL get lost. It's worth the work though, as these are classic stories. Best of luck--but if you have Arkebauer, you're probably already pretty lucky :)\n\nWorkload:\nFairly light, definitely not as intensive as other LH sections. No discussion posts!! Grades come from one paper, a midterm, the final, and participation. All are very manageable and you should be able to get an A without spending hours a week on this class. ~1 book of reading a week, sometimes more sometimes less\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 04, 2020",
            "review_content": "\nLOVE LOVE LOVE SARAH SO MUCH!\nIt's only the first semester but I literally love her so much. Her class discussions/readings/assignments tie the mundanity of the Core readings with relevant modern day lens of analysis. She's really kind and a very chill grader + she's a younger professor so she gets it. I literally love her so much!\nWorkload:\nCOVID- Monday - Async 1 assignment, Sync group assignment, due Wednesday. Chill grader, fun midterm/final prompts. \n"
        },
        {
            "course_name": "Lithum",
            "review_date": "September 07, 2020",
            "review_content": "\nShe is so chill, so kind and so funny! Each class is discussion-based, and she doesn't force anyone to contribute.\nAnd yes, we did watch some music videos (including some Kanye West, I believe we were reading the Bible) one or two classes. We also watched movie trailers for core-relevant movies.\nI am so glad I got her as my LitHum prof and my core prof for my freshman year. Her class is definitely an enjoyable memory, considering how everything went down because of covid...\n\nWorkload:\nReadings for each class but very manageable. No discussion posts. 2 to 3 essays, plus 1 creative project at the end of each semester which I am sure everyone fully enjoyed.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "January 23, 2020",
            "review_content": "\nCongratulations, you have won the Lit Hum lottery!!!\nComing into Columbia, I was nervous that I would get trapped with an awful professor. Luckily, i was assigned Sarah. She is really passionate about the books and presents them in a bearable way. (We watched some music videos in one class).\nSHE IS TRULY THE GOAT OF LIT HUM\nWorkload:\nI don't remember exactly, but super doable. NO discussion posts!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 24, 2019",
            "review_content": "\nLiterature Humanities is a very boring, old-fashioned and uninspiring subject but Sarah Arkebauer is anything but that. She is the only reason why this class is bearable - she is an excellent professor and an unbelievably funny person. During the times when I was not asleep in this class I often watched the UEFA Champions League and Europa League - fortunately Sarah did not give a sh*t which shows what a legendary professor she is. If you don't care about this subject, Sarah is for you. If you do care, Sarah is still for you as she presents the material in an engaging way and promotes discussion and debate in the classroom\nWorkload:\ngood. she does not check if you actually do the reading and only gives 2 essays which aren't too bad\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 08, 2018",
            "review_content": "\nSarah is fantastic. She makes LitHum fun and feel very relevant. \nWorkload:\nStandard reading and standard writing (though she did cancel one of our papers!). Very fair midterm. NO quizzes. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 04, 2018",
            "review_content": "\nHonestly the best instructor I've had in Columbia.\nSarah doesn't like to change the syllabus, so you might think she is boring. She is everyhting but that. Even though she works with Columbia's recommended translations, she always brings other translations and even adaptations for us to discuss. We constantly watch clips in class that range from the movie Spring Breakers to VeggieTales. Her ability to relate pop culture to classical books is amazing, and she will help you develop yours.\nI went to her office hours when writing my first paper, and she was extremely helpful. She reviews your essay with you and goes over her own feedback if you need help understanding. Basically, there's always a prompt \"whatever you want!\", so you can write about anything as long as you prove her your idea matters.\nSarah made me believe in graduate students teaching Core classes. She's brilliant, kind, and extremely funny. Definitely change into her section if you're able to.\nWorkload:\nRegular Lit Hum reading. Sometimes she divides book chapters so each of us gets to present about a part of the book and, even though she doesn't say it, she knows we won't read the whole piece.\nWe had only \"two papers\" + midterm + final. She let us rewrite our first paper (based on her awesome feedback) and the final paper could be a \"creative project.\"\n"
        }
    ]
}