{
    "prof_info": [
        {
            "prof_name": "Luke Rosenau",
            "prof_id": 9722,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 18, 2013",
            "review_content": "\nI'm surprised Luke doesn't at least have a silver star on here yet. \nDespite having his class at 9am everyday Mon-Thurs, I actually looked forward going to class. I left Luke's class feeling pretty energized, and I felt it was the perfect class to start my day. \nLuke does speak in Italian the overwhelming majority of the time, but he's more than accommodating if we're not getting something and talks to us in English if necessary. Class is mainly doing exercises with whoever's sitting next to you, talking about things ranging from hometowns to favorite movies. There were numerous times when we were just learning forms and things like that, but those weren't too often.\nLuke did a really great job making engaging exercises, and his humor played a big role in that. He's really encouraging in getting us to speak in Italian and I felt very comfortable speaking the language by the end of the semester. \nHis quizzes were pretty straight-forward, and as long as you study, you should be golden. Luke pays special attention to improvement and is really interested in seeing his class get a good grip on the language. You don't have to be perfect to do well in his class as long as you show him you're applying the lessons to improving your Italian. \nIf Luke were an option for Italian II, I would have picked him in a heartbeat. \nWorkload:\n4 quizzes, about 4 compositions, the usual work from the workbook, an oral presentation at the end of the year, and standard midterm/final.\n(And an opportunity to do extra credit!)\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "July 22, 2010",
            "review_content": "\nHands down one of the best teachers in Columbia. The guy is hysterical and made class incredibly enjoyable even at 9 am with his constant humor, which is of a unique and extremely witty variety. Class was very straightforward, and he was a very generous grader. Anyone who put in any effort at all received an A or A-. He was cool about missing class now and then, and VERY cool about late homeworks. He is genuinely interested in seeing that his students learn Italian, and is very dedicated with his diagrams, and funny homemade exercises. Had no problem speaking English in class if it was needed to explain a concept. This guy is too good to pass up even at 9 am. I'd take him at 6 am\nWorkload:\nweekly quizzes (very easy), weekly homework (one chapter in Lab manual and one in workbook, took about an hour combined), midterm and final, both very straightforward. oral presentation for 5 minutes on anything you want, wasn't too bad\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 04, 2010",
            "review_content": "\nAmazing! I had Luke's class at 9 am, and though I missed a few, I doubt I would've woken up every day for anyone else!\nFunny, charming and genuinely interested in the Italian language, Luke was my favorite professor last semester. Luke's classes ran smoothly, almost all in Italian from the first class. I first found this intimidating, but as the semester continued and I got the hang of it, I was greatful for his insistence on speaking. This got me comfortable with speaking Italian - no matter how terrible my accent - right off the bat...Often, we'd look up to see the class had been over for a few minutes and we'd gotten carried away. \nLuke was pretty relaxed regarding assignments etc... I think as long as you didn't outright take advantage of him, he was willing to overlook deadlines in the interest of you doing the work.\nThe weekly quizzes were, of course, a pain. But, they were beyond his control (set by the Italian Department). And I recall a few times that if I didn't finish in time, he would move anyone still working to the office to finish the quiz. Again, I think he was far more interested in us understanding and learning the Italian language than deadlines or strictness. This helped me immensely, because I can now speak a fair amount of Italian.\nI recommend Luke's class to anyone and everyone. If you can deal with the early time (something I did struggle with), it's well worth it. Un buon'professore! \nWorkload:\nWeekly lab and homework, quizzes every week, an 150 word composition every two weeks, a midterm, a 5 minute oral at the end of the semester and a final [all in line with the Italian 1 syllabus].\n"
        }
    ]
}