{
    "prof_info": [
        {
            "prof_name": "Ronald Breslow",
            "prof_id": 1810,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "C3045 Intensive Organic Chemistry I (for freshmen)",
            "review_date": "May 27, 2014",
            "review_content": "\nI concur with most of the sentiments expressed in the previous reviews. Looking back, organic chemistry (or orgo for short) was the most rewarding class I took freshman year. I do not regret my decision. However, having said that, this class is definitely not for everyone. I'll try my best to help you make an informed decision. \nNow, first, a little background about myself. I did take AP Chemistry back in high school. My school offered two years of AP Chemistry, so I had a good background in chemistry. I did get a five on the AP test. \nHowever, coming in, I still felt unprepared. Professor Breslow constantly introduced concepts without proper explanation. A lot of the concepts were also very obscure. For example, he taught us, on the first day of class, about orthogonality. I later emailed my high school chemistry teachers (both PhD.s), and neither of them had ever heard of the concept. His lectures do not overlap significantly with the book, and we were frequently tested on material that were only mentioned in passing. The class was very frustrating. \nNow, more about Professor Breslow. He's clearly a very talented and approachable professor. Some of the girls in our class call him \"adorable\". He also has a good sense of humor, which did make the class a lot more bearable. However, Breslow is not a good lecturer. He never fully introduces concepts, and he rarely ever explains the mechanisms of reactions. He speaks at length on his experiences and projects but gallops over material that is fundamental to our understanding. He is also very hard to hear, and his handwriting can be very difficult to read. Like a Heisenburg particle, you can either listen to him or take notes, but you can't do both. Certain classes are frantic, but other classes are just plain boring. I've fallen asleep in class a few times.  \nYour best bet is to learn from the textbook, which does a pretty good job of explaining the material. The more studious members of our class take notes directly from the book. Make sure to do all of the suggested problems, as some show up on his exams. I also recommend purchasing some outside help books, like Organic Chemistry as a Second Language. I spent an enormous amount of time reading and taking notes from the book. \nOn the bright side though, if you are willing to sacrifice a large chunk of your time, the course is doable. I believe that about a half to a third of our class got an A- or above. I managed to land an A, and I feel that I walked away with a good understanding of organic chemistry. However, I sometimes feel that the time could have been better spent on extracurricular activities. but then again, if you can properly balance your schedule, this should not be a major problem. \nBreslow's exams can be very annoying, especially for someone coming directly from high school. Unlike your typical high school exam, Breslow's exams only cover about 5% of the material you're taught. If you happen to have studied the concepts covered, you're safe. Otherwise, you'll find yourself in a very bad position. Some of his questions come straight from the exercise problems, but some also come from things that are only mentioned in passing. I feel that his exams are more about luck than about mastering the material.\nThe course is very time-intensive, but it's doable. One very nice aspect is that you can finish organic chemistry freshman year, which really frees up your schedule. The second semester, with Professor Leighton, is also very chill. However, you'll have to sacrifice a lot of your time as well as many extracurricular activities. Choose wisely.\n\nWorkload:\nBreslow has problems sets that are never collected, but do them anyway! The problems often show up on the exam!\nThere are three midterms and one final. There are also weekly recitation quizes whose difficulty is determined by your TA. There are about 5 problems on the midterms about about 13 on the final. Some are very easy, but others are egregiously difficult. \n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "January 15, 2011",
            "review_content": "\nBeware---many of you might have done well on the placement exam and placed into this class, but the truth is that if you have never seen organic chemistry before and have never gone beyond AP Chemistry, you will have to dedicate an immense amount of time every week into preforming well on the exams. Unfortunately for me, I took this course in unison with other difficult courses, taking too many classes, and it ended up screwing me with a B grade (a premed and biochem major)\nOkay- so about the instructor. Ronald Breslow is an extremely famous person and has won every award short of the Nobel and has had students who have gone on to win the Nobel-true, but that does not excuse the fact that he cannot teach. Most mediocre lecturer I have ever met defines him. His lectures are hard to follow and dull, with a focus on a bunch of complicated and almost illegible mechanisms that never end up on the exam (also, he skips chapters and sections that usually have the questions on his exams and focuses on stupid things that do not show up on exams). Taking this class and arriving to class early made me want to gouge my eyes out as everything was taught in a boring and confusing way and I knew would not help me do well on the exams. Halfway through the semester, you will notice that about half the class has stopped bothering coming to lectures. The recitation section was somewhat helpful at times, and I give Myles credit for trying to make lucid the horrible lectures that Breslow threw at you. My biggest advice would be to immerse yourself in the book and do as many practice problems as you can from the textbooks, scouring for really challenging questions that might have you somewhat apply your knowledge of the chapters to something ambiguous and unseen (hint: find questions that you find abstract, trivial, unfair, and annoying) because these are the annoying questions that end up showing up on Breslow's exams.\nSo Breslow's exams----meh. I do regret that I did not re-do and re-do and look over the procedures to answering his suggested problems, because a lot of his first exam had similar problems to these and I felt like I could have done really well. Also make sure to memorize all those annoying reactions and the 'synthesis' chapter sections as Breslow is enamored on synthesis and will riddle and annoy you with these problems on his exams. So the second exam was somewhat doable, but the questions that had the most points focused on really unfair questions that asked you to apply your knowledge, but were more dependent on how your wild guess was close to the arbitrary real answer to his stupid question. He said there would be three midterms, but there were two, one focusing on 7 chapters and the other on 8. He then said the final would span 16 chapters instead of 15, making us read another chapter filled with complicated concepts and a plethora of reactions. His final was a joke-three easy questions, others as random as possible. From anthracene to annoying syntheses to guessing random reactions unseen before and asking the dipole moment of some dumb molecule, you will want to kill yourself when you take this final.\n\nWorkload:\nSuggested problems that are never checked nor graded-do them and when studying make sure you review all these problems and how to do them. \nHow every many midterms he assigns- yeah, they will span 7 or 8 chapters typically and will be riddled with random questions that will never test your true knowledge of organic chemistry and since this class is filled with over-prepared students who have probably seen this stuff lots of times, there will always be curve killers who gets 90s and 100s on these exams, but still, the averages are low, and the class is in reality curved to a B or B+\nQuizzes during recitations-Myles tended to ask really direct questions but at times it was annoying because you had to memorize all the reactions from the textbook. But do that, and you're set. Don't lag behind.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "January 05, 2011",
            "review_content": "\nWarning: under any circumstances, do not take the class if:\n-you don't remember junior year AP chem\n-have no orgo experience beyond AP chem (knowing how to name weird-looking molecules and functional groups and their properties, while interesting, does NOT constitute knowing orgo.)\n-you do not love chemistry with all your being\nJust because you think the placement exam was a joke and were placed into this class doesn't mean you should necessarily be in it (unless you don't mind spending 15 or more hours per week on the class alone)\nThat being said those who are prepared should definitely take this class. You are being taught by a university professor who is one of the best organic chemists in the world. For those who aren't enamoured by Dr. Breslow, Myles, the TA, is excellent. \nFor premeds who are scared of a chem class with 'intensive' in its name, be consoled by the fact that Dr. Breslow is merciful and curves the class to a B+ (or maybe even A-). \nAs long as you're both very-well prepared and have a great deal of time to put into the class, you should do fine.\nWorkload:\ndepends on 1. how well you want to do and 2. how much orgo you already know. If 1. is A and 2. is little, you either shouldn't take the class or make sure that you have pathetically easy classes for the rest of your schedule. 2 midterms, weekly recitation quizzes that can save your grade, and homework that is not collected. \n"
        },
        {
            "course_name": "C3045-C3046 Intensive Organic Chemistry (for freshmen)",
            "review_date": "May 18, 2010",
            "review_content": "\nThis was hands-down my favorite class freshman year. It can be kind of intimidating at first - Professor Breslow is a genius (you learn about the Breslow intermediate second semester) and some of his lectures can go pretty quickly - but take solace in the fact that everyone feels lost.  If you stick close to your TA first semester, you'll be FINE. Plus, because both Breslow and Leighton consider the class \"above average,\" it's fairly easy to make an A+ (I made one both first and second semester). I think the class is itself scaled to an A-, which is a lot better than the gen chem or regular orgo classes. So if you are placed into this class, TAKE it.\nAlso, orgo just gets easier as you go along. I must say that I spent a lot of time on orgo first semester (you need to read and understand the book chapters VERY WELL). But if you get through first semester, second semester is a breeze. Leighton doesn't care about the book (although he took some exam questions verbatim from his \"recommended homework\" so if you're smart, you'll look at those problems) and his exams come STRAIGHT from his notes.  He's also really good about extra office hours and his class notes are very clear. \nBoth semesters and both professors were absolutely fascinating.  I am really going to miss this class - it made me a chem major, I loved it so much. So take it! It'll be the best decision you make freshman year. \nThe final in Breslow's class was not that hard, although the average ended up being really low - he just asked you to do a lot of \"application\" problems rather than synthesis. Make sure you know what anthracene looks like and how napthalene reacts!\nThe final in Leighton's class was a piece of cake. Just take the time to review your notes and it's super easy.\n\nWorkload:\n1st semester: pretty substantial, you need to read all the book chapters and do all the hws to be prepared\n2nd semester: really light - just do a weekly problem set (only every other one is graded by a check, check plus, check minus system) and pay attention in class and the exams/final are a breeze. \n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "January 23, 2010",
            "review_content": "\nThis was my absolute favorite class freshman year (I'm a sophomore). If you get in to this class, take it take it take it. I have a bunch of friends who got in but took gen chem and regret it now.\nFirst semester: Yes, Breslow teaches very quickly. Yes, he does tend to skip chapters he doesn't care about and tell you to read them at home. But he is really an amazing teacher. He is very clearly excited about what he's teaching, loves to make jokes (which often catch you off guard), and always takes the opportunity to tell you about real-world applications. I brought my English-major sister to sit in on the class when she came to visit me, and even she was entertained all class. He is honestly one of the smartest people I have ever ever met. I don't think I ever looked at the clock ever all semester. His tests are hard, and are sometimes about applying what you've learned to things you've never seen before, but the curve is extremely generous. He said at the beginning of the semester that in order to not discourage students from taking the class, he tried to give them what they would have gotten had they taken gen chem (A or B range, and frankly, if you're in this class, a B is still pretty damn impressive).\nSecond semester: Leighton is a really good teacher. After Breslow, his lectures definitely seem slow, but his drawings seem like the most beautiful things you've ever seen. He also manages to teach this semester WITHOUT A BOOK, which, thinking back on it now, is pretty amazing. He's just that good at explaining things. And what's really nice is that, because the class is so small (in what other organic class can the teacher learn your name??), you can ask questions, to which he is very responsive.. The tests are definitely hard, but again the curve is generous. I have heard of people getting C's in this class, but the majority of the kids my semester got in the A range. \nNote: From seeing my friends take organic now, the book Breslow and Leighton use is SO MUCH BETTER than the one used in regular orgo classes. It's extremely readable and explains things with really funny cartoons sometimes. It was worth reading first semester just to see resonance get compared to rhinos and dragons and unicorns. No kidding. I get my old one out to explain things all the time.\nWarning: Bio is a HUGE LETDOWN after this class.\nWorkload:\nFirst semester: reading the book is optional but definitely helpful, optional problem sets (from the book), recitation quizzes, 3 midterms & final (one midterm or 1/3 of the final can be dropped. I seem to remember that you could also drop all the quizzes if necessary); I think it was curved to a B+.\nSecond semester: he says the book is a paperweight--I don't think I looked at it all semester (and didn't need to), shortish problem sets (that he writes and are graded on the \"check\" scale), 3 midterms (one can be dropped) & final; When I took this class, he sent us an email at the end of the semester saying 2/3 of the class got >= an A-, but that he really thought we deserved it.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "January 04, 2010",
            "review_content": "\nThis is the hardest class I have ever taken, but it was one of the only courses I actually enjoyed this past semester. \nProfessor Breslow is the coolest professor ever. I did not really understand the way he taught until the end of the semester, but that is what the book is for. I DID learn A TON  from him about science in general, and the applications of organic chemistry in medicine. I thought some of his lectures were really fascinating and felt really privileged to attend such a class.\nThank goodness for the TA, who was a HUGE help!\nWorkload:\nTo do well in the course, unless you're a total genius or have taken organic chemistry before (about 10% of the class), you need to work AT LEAST 8 hours a week, I sometimes worked up to 16 hours a week. \n3 midterms (1 hour each), and a final exam (3 hours). One hour of testing is \"dropped.\" Homework is not graded but you really need to keep up with it to do well at all.\n\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 18, 2009",
            "review_content": "\nIf you want to get organic chemistry out of the way as quickly as possible, take this class. If you want to learn organic chemistry, don't take this class.\nThe first few weeks of class are almost mind-numbingly simple - just a review of some concepts from AP Chemistry and an introduction to basic organic chemistry (stereochemistry, chair cyclohexane, etc.). As a result, the first midterm has a deceptively high average - around an 80.\nThen things get irritating. There's a ton of material on synthesis that isn't explained very well in lecture -- lectures mostly deal with mechanisms, which don't appear on the next two midterms. If you want to do well on these two midterms, you should probably do every problem in the book for practice. Even if you think you know the reactions, it's an entirely different story when you're looking at a compound and you have to figure out what formed it. Of course, if you don't know anything you can just invent reactions, and you'll get minimal credit (he awards roughly 4/10 points for \"creative\" (read: flagrantly wrong) answers as long as there's even a hint of effort).\nWith the final, you're on your own. There are 10 questions, 3 of which are straightforward. The rest are about as random as you can imagine.\nProfessor Breslow is practically legendary for his work, but if you want to learn organic chemistry, you're better off somewhere else. \nWorkload:\nIf you don't want to learn anything, you don't have to do anything, since the homework is \"suggested.\" If you want to learn something, you're going to have to devour the book.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 12, 2009",
            "review_content": "\nThis class is hard. If you are taking it, it's because you are among the 40 best chemistry students in the whole school. Our second exam, the average was 58/100, curved to a B+. Breslow sometimes covers 3 chapters of the book in one day (those he doesn't care about) and stresses the ones he will test you on. Usually, he doesn't mention everything in the homework in class, but everything on the exams is in class, so take good notes, it saved me compared to the rest of ppl. Sit on the left side of the room. He's a leftie and stands infront of his diagrams , so you need to be sitting on the left to actually see any of what he's talking about.\nMost people say orgo is all about memorizing stuff, but really it is a few general rules to apply over and over again in many situations. Tests are always one page, ~3-4 problems. One mechanism, one synthesis, one wildcard on a pet topic. Every exam has a problem taken from the homework, and one \"easy\" problem. Also, he'll drop your worst hour from 3 one-hour exams and the 3 hour final.\nMake friends with the TA and go to recitation, do the hwk, and take good notes. Everyone thinks it's the hardest class ever, but in the end, the curve is to B+.\nWorkload:\nNone--but you need to do the hwk to get a passing grade on the exams. Recitation quizes.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "November 04, 2009",
            "review_content": "\nThis is also from a senior who took this as a freshman. This class was one of the most interesting classes I took at Columbia, and I'm not even majoring in something related to chemistry. I found his lectures particularly interesting, especially with respect to his tangents, particularly one time when he felt compelled to draw the structure of squalene on the board just for the hell of it. Other random tangents:\nIsolating cations in benzyllic \"cages\" (Fe+ in some weird hourglass-looking thing)\nstable cations due to benzyllic e- delocalization\ndiscussing the Nobel prize in chemistry at a mechanistic level\nIf you're looking for something rigid and organized, you probably won't find it here. However, there's a wealth of information that gets hurled at you whether you like it or not. All those seemingly tangential topics he gets into will find their way onto the final exam. I actually missed a great deal of the later lectures concerning nmr and benzene reactions, but happened to be sitting in on his 5 minute talk about the compound anthracene; the latter happened to show up on his final exam. The class is inundated with overzealous premeds who think that hours upon hours of study sessions will prepare them for the curveballs that appear on his exams, so prospectives for this course should take that into account. Other than that, the class actually seems to have very little to do with memorizing reactions as much as the properties of what those reactions yield. There were only a handful you actually had to know; the bulk of \"memorizing\" was to determine which product among several would form the most easily, what enatiomer would form, etc. Getting acquainted with the vocabulary is half the battle in my opinion, otherwise his lectures are very much insurmountable.\nSome advice would be to do ALL of his assigned homework problems, even though they're not graded. \nI overslept for the third midterm, rushed over in the rain to take it on the TA's lab bench, got 50%. Thank god for dropping the lowest exam. He announces this rather late into the semester I believe, maybe for shock factor. The final is a lot less stressful than his other exams, probably because of the time constraint being lifted. It feels similar to his other exams both in length and difficulty.\nWorkload:\nnon-graded hw, quizzes in recitation, 3 exams, 1 final\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "April 06, 2009",
            "review_content": "\nI am actually this review from a perspective of a senior who took this class in freshmen year. In hindsight, organic chemistry on an introductory level is not a very hard subject. You do have to put in time and effort into learning the material. Breslow is pretty generous with grades to freshmen, but there is a curve. You won't get an A for no reason. Breslow won't curve you down, but if you are doing horribly or relatively badly, he'll be generous and curve you up to a B- (since you are a freshman after all). He drops your lowest one hour exam and tends to put more emphasis on the final in case you bomb the midterm. In the end, this is the type of class that gives you a grade back proportion to the amount of effort you put into the class (unless you have photographic memory or simply get and memorize the mechanisms at first sight).\nMore on the teacher now. Breslow is really famous and has a long history in the chemistry field. With that said, he's not the most available nor helpful of teachers. He has more an old school teaching style that emphasizes more on lectures and note-taking and so not much on teacher-student interactions (help, questions, etc) outside the classroom sitting in my opinion. I think if you really wanted to ask him for help, he won't turn you away, but your best bet will be your TA. The TA generally explained any gray areas in lecture and also give the weekly quizzes. If you have a quick question after class, the professor will obviously answer it. Breslow is a quite a character and it's sort of an experience to take a class with someone like him.\nMore on whether you should take this class now. If you tested into this class, you are obviously very gung-ho about school (be it you're nerdy, love chemistry, must get into the top class, blah blah, whatever). I don't really care about your reasoning as I am only going to give a pragmatic evaluation of taking this class. If you are SEAS (chemE or BME especially), this will definitely reduce the number of credits you have to take. If you are thinking of doing minor(s), this class will help you achieve that. If are not chemE or BME, this class will help you get rid of your requirements (granted you could have chosen easier classes). If you are thinking about doing chemistry, I feel that most chemistry majors do take this class and lower level classes will certainly bore you. \n\nWorkload:\nProblem sets. Quizzes. Three midterms exam and 1 final exam (best 5 out of 6 hours of testing).\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "March 28, 2009",
            "review_content": "\nBeware--this class is full of premeds, overachieving engineers, and future chem majors.  And it's at 9am.  It's especially useful for premeds and chem majors, since it saves you a full year of gen chem, but some background in orgo is definitely helpful.  Mostly, people don't realize that for synthesis questions, you have to ask yourself \"what can I make with X and Y,\" \"how do I make this kind of molecule,\" \"what do I add to X to get Y,\" etc.--it's NOT just memorizing X+Y=Z.  \nBreslow teaches the first semester.  He's totally brilliant (google him for some fun facts, as well as amusing pictures of him when he was young), but should NOT teach undergrads.  Don't bother showing up to class--I went to every class, wrote everything down, tried my best to stay awake, and should have slept in every morning and just done everything out of the book.  Luckily, Michelle Hall was the TA our year and she is FANTASTIC.  I have no idea how any of us would have passed without her.  Also note that while the midterms are all fair material out of the book, the final is INSANELY hard--he wants you to \"apply your knowledge\" to stuff you haven't seen or something, but it's totally impossible.  In my class, about a third of the class ended up with some kind of an A. \nIf you can make it through first semester, James Leighton is totally awesome.  He's super organized, draws large, clear molecules/mechanisms on the board (Breslow drew lots of tiny scribbly drawings--it's a nice change!), and is dynamic/engaging enough to keep almost everyone awake.  Class attendance is absolutely necessary, since he lectures from his own notes and covers things not in the book (the book is still helpful for review and practice problems, though).  Our TA was not very helpful, but it didn't matter since Leighton is such a badass.  Exams are definitely mechanism-heavy (unlike Breslow's), but mostly fair.  At least you know what's coming, since he posts practice tests.  The final is pretty hard, but not as crazy as Breslow's.  2/3 of our class got some kind of A. \nWorkload:\nPrevious reviewers covered Breslow's complicated system.  Leighton's class had 4 midterms (best 3 scores make up 50% of your grade), final was 40%, and several problem sets are 10%. \n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 20, 2007",
            "review_content": "\nProf. Breslow is a genius. I mean, the man has cured cancer, literally. Is he a good chemist? Yes. Is he a good teacher? No.\nWhile he may understand the subject, he has little to no capability of sharing that knowledge. Lectures are often rushed and cover barely one section of the chapter we are reading.\nWhile I do appreciate Breslow's stress of theory over memorization, some of the questions he asked on the midterms and finals were just bewildering.\nBeware, to do well in this class you have to be committed to teaching yourself from the book. Thank God the text is really well put together and that you can learn a lot from the answer book.\n\nWorkload:\nThere are seven grades: 1 midterm in October, 1 midterm in November, 1 midterm the last week of class (yup), a final which counts as three midterms, and a recitation grade. The recitation grade is made up of a weekly take-home quiz and maybe three pop-quizzes. The lowest of those seven grades are dropped. The average grade is then scaled to a B+.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "January 02, 2006",
            "review_content": "\nBy now, you already know that Breslow is a Chem big shot, having contributed to two chemists(I believe) winning Noble Prizes. However, that doesn't mean that you will simply absorb information in his presence, even if you do manage to stay awake during his class (without glancing at the clock every ten minutes). \nHe skips around in the textbook, picking and choosing what he wishes to concentrate on or even cover, so it is largely impossible to be prepared for class. He is available to chat with during the day; however, that probably wont help all too much. \nMake friends with the TA!\nWorkload:\nProblem sets that arent graded. Weekly quizes that count as 1 midterm. 3 midterms. 1 final that counts as 3 midterms. Out of these 7 grades, one is dropped--then curved to an A-/B+ average.\n"
        },
        {
            "course_name": "CHEM 3045 (Orgo for Freshmen)",
            "review_date": "December 25, 2005",
            "review_content": "\nI took this class because I got a 5 on the AP, and I thought I wanted to major in chem (I thought I enjoyed it -- I was obsessed with chemistry in high school).  I'm also premed.  WOW -- I didn't realize how awful this class would be.  Breslow can't teach and the book is awful.  If you're premed, take gen chem, get an A+, and take orgo as a junior when you're not competing against the brightest chem kids (mostly engineers) in the university.  I changed my major just a few weeks into the course.\nIt's really not that easy to get an A in this class, either.  While there is a curve, the averages on tests are usually in the low 70s, and it's because Breslow didn't teach anything.  Just memorize the homework questions and answers.\nWorkload:\nThree straightforward tests, problem sets for each chapter, final that covers NOTHING he stresses in class.\n"
        },
        {
            "course_name": "Chem C3045 - intensive orgo",
            "review_date": "December 20, 2005",
            "review_content": "\nwhat a chem god. brilliant man who has done a lot of amazing work. \nbut what about his teaching abilities, you ask? he's at such a high level that he isn't able to teach college students. \nafter busting through 8 chapters for one exam (that's half the course material and the hardest material), bres-money finally taught like a good professor for the last 2 weeks of class. so maybe he has the potential, but doesn't use it. \nnonetheless, this orgo class is worth it - other orgo classes have it much harder w/ crazy exams and graded problem sets. breslow's exams are pretty simple as long as you look over notes, do his problems (and look at some other challenging/tricky problems in the book - they're often test questions!), and get syntheses, you'll be good.\nWorkload:\nnot much at all. optional problems from the book (but you should do them to do well on the exam) and weekly quizzes in recitation. \n"
        },
        {
            "course_name": "Organic Chem for Freshman",
            "review_date": "December 13, 2005",
            "review_content": "\nProfessor Breslow is a very intelligent researcher; practically every American Noble Award Winner has been his student - I am really not kidding about this one... He has a great command over his material.\nHowever, as a professor, he has no idea how to teach. He does not review the lecture notes he planned 20 years ago before class (a bit exaggeration here), but really, ask anyone in the class, including the TA, and you'll know that he doesn't know how to teach. For our batch, he rushed through 6 chapters for the first test, 7 for the second, and then had to crawl through 2 for the last midterm, because he didn't plan the course well, and b/c he didn't teach us anything from the 7 chapters. He is also not approachable - while he stays after class to talk for a couple minutes, you soon realize that the whole class wants to talk to him, and so you really can't clear up major problems with the material after class. He also doesn't have office hours, so you have to fix an appointment if you have questions, which is intimidating. Also, he is very boring during lectures, and it's very difficult to follow his material on board.\nIt's very easy to prepare for tests, however. His tests are super-easy; as long as you do the homework and summarize reactions, you should be able to get an A in the class. The TA is also awesome. But don't plan on learning anything from the teacher; you'll have to teach the material yourself. Not a big problem b/c the book is easy. Class is great for pre-med kids, but if u r an engineering major student, reconsider your options and go into intensive general. It's a harder class and you'll learn material suiting to engineering in that class. \nWorkload:\nManageable. 3 midterms (3rd one's totally unnecessary) + final ( = 3 midterms), one of the 6 hours of exams gets dropped. Weekly quizzes that add up to be one midterm at end of semester. Lots of curve.\nDo the homework and read the chapters carefully. Make summary sheets that summarize the reactions and make flowchars, etc. to organize the different reactions. Be organized for this class!\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 08, 2005",
            "review_content": "\nEven though Professor Breslow's clearly a genius in his own field, having won like every chemistry prize short of the Nobel, that doesn't change the fact that he's a mediocre lecturer.  He's very hard to follow if you haven't read the material beforehand, and he moves FREAKING FAST.  Definitely read ahead by at least 1 chapter because there are many days when he'll be like, \"I'm not going to lecture on the rest of chapter 9.  Just read it on your own, ok?  Now, Chapter 10...\"  and sometimes these occur on consecutive days.  Even though the homework isn't required, DO IT because he likes to take problems straight out of the book for the exams.\nWorkload:\nWeekly quizzes (in mandatory recitation), 3 midterms (1st easy, 2nd hard, 3rd relatively easy) and 1 final.  \n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "January 03, 2005",
            "review_content": "\nMy favorite thing about having Prof. Breslow as a teacher was his insistence on learning- not memorizing. Too often one hears of the Organic Chem class where a seemingly endless number of reactions *must* be memorized. This was not that class. After learning the material from Prof. Breslow, all I needed to memorize was reagents- and even those I could often reason out by looking at the starting and ending products and determining what iwould be necessary to catalyze the reaction.\nI found the class very interesting and enlightening, but I read the relavant chapters before class and not after. Others people definitely did not have the same positive experience in freshman orgo.\nOne of my favorite things about Prof. Breslow was how he would stick around after class and answer questions related to the lecture or completely random ones. I remember one day when I recieved an almost 20 min lecture after class in response to an almost inconsequential question about bonding.\nGrading in this class is fair- and fairly easy given the monster curve. Just do the required problems and the tests will be fine.\nWorkload:\nas much as one makes of it.\nthere are 3 midterms and a final that counts as 2 midterms. The lowest grade is dropped. I really don't believe that the 3rd midterm made sense.\nquiz every week at section to boost your average(if you have read).\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 23, 2004",
            "review_content": "\nOne of the best teachers I had this semester.  He occasionally goes off on a tangent, but everything is interesting.  Tests are insanely hard if you don't do the suggested homework.\nWorkload:\nNo required homework, but do it anyway if you want to do well in the class.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 21, 2004",
            "review_content": "\nGreat!!! The class was at 9 am, but very much worth waking up for. The material is hard in itself, but professor Breslow makes it very interesting; in the lecture he mentions things not in the textbook, like his own research. You are going to walk out knowing chemistry. \nHe is a generous grader, so Orgo will not screw up your average unless you make an effort to blow it. \nWorkload:\nReasonable: some reading, no written homework, a quiz at recitation every week, three midterms (lowest grade dropped), one final\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "November 10, 2004",
            "review_content": "\nHard, hard Class.  Breslow is a great chemist, a very nice, approachable guy, and a detestable teacher.  Lectures do not teach you anything at all.  Luckily the book is very helpful, so you can study on your own time (and you'd better because there are weekly quizzes).\nWorkload:\nNot much at all, EXCEPT for the weekly quizzes that make you stay on top of things.  Three Exams and a Final.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "April 20, 2004",
            "review_content": "\nI can't say I agree with the other reviewers that Breslow is a good teacher.  He doesn't prepare his lectures and they are very all over the place, he doesn't explain things clearly, and his diagrams and mechanisms aren't clear either.  He isn't engaging or inspiring, although he is not at all intimidating either.  Best things about him: He is approachable, a fair grader (and he grades some exams himself!), his tests are reasonable. \nI found myself learning everything from the book, which is fine because the book is very clear.  Recitations were helpful and the quizzes boosted my average. \nA\nWorkload:\n3 tests, weekly quizzes during recitation, final.  Lowest test is dropped.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "December 02, 2003",
            "review_content": "\nBreslow is definitely a chem god.  The first time you meet him, he appears quite intimidating and that doesn't really change.  However, there's a reason for that as he probably had something to do with the discovery of whatever mechanism he's trying to teach you!  Breslow's lectures are incredibly clear cut and follow the textbook perfectly.  He does add a bit of bio-organic stuff cause it's his specialty.  He tends to be brutally honest if you're at the bottom of the class.  But then again he does curve around a B+ so there is no excuse to be there.  The best part is Breslow encourages you to approach orgo from a theory point of view, he will teach you first principals and ask you to apply them rather than letting you try and memorize the 1000+ pages of text on mechanisms.  This way, the material is more engaging and challenging, but anyone trying to learn by rote will fail.\nOverall, I highly recommend him to any lucky freshman who gets into the class, it'll be closest you'll get to such a famous prof. in the chem department in all your four years at columbia.\nWorkload:\nProblem sets are not turned in, so it's easy to fall behind.  He assigns a ton of problems, but guess what?  You'd better do them if you wanna learn orgo.  Quizzes given at the discretion of the TA, watch out, you might think they're unimportant but our year Breslow equated them to a midterm grade.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years I",
            "review_date": "November 22, 2003",
            "review_content": "\nOh my God. The man is the god of chemistry. He is a genius, and you should feel lucky just to be in his presence. He s not \"scary\", and he explains the material well, if a little all over the place sometimes, but not bad at all. Orgo s hard anyways, but he just makes it so interesting. Plus, the intensive track has the great advantage of being such a small class-- mine had less than 30 people.\nWorkload:\nmandatpry weekly recitation, with quizzes. 3 midterms, 1 final. lowest hour is dropped (either 1 of midterms or 1/3 of final). questions require applying material, but are fun! I loved this class. Oh, and he curved around a B+!\n"
        }
    ]
}