{
    "prof_info": [
        {
            "prof_name": "Magdalena Baczewska",
            "prof_id": 13162,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 01, 2017",
            "review_content": "\nThe best. \nWorkload:\nSimilar to other sections\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 26, 2015",
            "review_content": "\nProfessor Baczewska is truly one of the best professors I've had in my four years at Columbia. I left Music Hum until my 2nd semester of senior year and was not looking forward to it. However, after taking Music Hum with Prof. Baczewska, my perspective on both music and Music Hum have changed dramatically.\nLet me start with the Professor. She is a classically trained pianist who runs the Music Performance Program at Columbia. First of all, in class, she will demonstrate certain principals of music by playing piano. Even I, as someone who does not have an ear for music (despite years of piano and violin lessons), could appreciate how amazing her piano playing was. It is really quite rare that you have an expert practitioner at Columbia show you his/her skill with such grace and interweaves it so well with the lessons.\nAlso Prof. Baczewska is a very supportive and kind person. She really helped us through learning the songs and musical concepts in a very fun way. Very available via email and office hours and just a really great presence in class. She clearly loves teaching Music Hum and you will learn a lot from her. Also she really stresses discussion which makes the class more active. It is important to note that she will never let the discussion get too far off topic and will always make some to inject insight if the discussion gets derailed by tangents. She is a great discussion facilitator and just an incredibly wonderful human being.\nThe class itself is pretty aligned with the rest of the Music Hum curriculum. The one really cool thing though is that we had student performers come in for about 3 or 4 classes. Because Prof. Baczewska runs the Music Performance Program, she got a few different performers into our class (one on jazz, one on Ravel, one on classical music) which I thought was really cool for a few different reasons.\n(a) You get to learn how talented some of your classmates are.\n(b) Hearing music live from really high-level performers is definitely a different and more enriching experience than listening to it over the speakers.\n(c) You get to learn more about how musicians play through and feel about the music they perform.\nAnyways, I definitely would advise you take this class. It will not be your hardest nor your most time-consuming class (although, you definitely do have to invest some time). However, it is a very enjoyable class and one that will truly enrich your Columbia experience. I think the way Prof. Baczewska teaches the class is a real embodiment of what the Core Curriculum is supposed to be.\nWorkload:\nThis is a class that has a very clear path to get a good grade. Do the readings, listen to the music, go to class, participate in class, think through the connections of the songs, and study for your exams. If you do that, you should do well in the course. \nClass Participation 20%\nOpera report 20% \nConcert Report 20% \nIn-class Presentation 10% \nMidterm Exam 15% \nFinal Exam 15%\n"
        }
    ]
}