{
    "prof_info": [
        {
            "prof_name": "Risha Lee",
            "prof_id": 3089,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 04, 2009",
            "review_content": "\nReally, really great.  I had Risha her first semester as well.  She does convey the material really well, and the workload is great - three papers (first one wasn't graded) and a midterm and a final that was not cumulative.  You don't have field trips/mandatory museum visits outside of classtime the way other art hum sections do (such a good thing).  You do have to visit one of a few churches for your paper and the Met for your papers, but those are not bad at all.  She's really a catch for art hum.\nWorkload:\nYou do not have to do the readings (only if you really want to participate in class with them - they aren't relevant to the MT or final at all - just talk about the painting itself to get your participation points.  Short midterm and short non-cumulative final.  Three papers, fairly graded\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 04, 2009",
            "review_content": "\nReally, really great.  I had Risha her first semester as well.  She does convey the material really well, and the workload is great - three papers (first one wasn't graded) and a midterm and a final that was not cumulative.  You don't have field trips/mandatory museum visits outside of classtime the way other art hum sections do (such a good thing).  You do have to visit one of a few churches for your paper and the Met for your papers, but those are not bad at all.  She's really a catch for art hum.\nWorkload:\nYou do not have to do the readings (only if you really want to participate in class with them - they aren't relevant to the MT or final at all - just talk about the painting itself to get your participation points.  Short midterm and short non-cumulative final.  Three papers, fairly graded\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 21, 2006",
            "review_content": "\nIf you end up in her class, you are set for the most enjoyable and light workload course for a semester.\nSweet and caring professor.\nI was basically art retarded, (didn't know ANYTHING about it) before I walked into her class. Since then, she really taught me how to look at a piece of art critically.\nShe's probably one of the best art hum teacher there is. Well it was her first semester teaching, but she was very good at it. Everyone in the class loved her. \nTips: Goto class (she emails you if you are MIA), Read the stuff (it's only 15 pages and it makes a whole world of difference both in your learning and class participation) and lastly participate.\nI don't see how anyone can do bad in her class. Shes just an absolute sweetheart. Take  this class at all cost.\nWorkload:\nReadings for every lecture: (maybe 10-15 pages)\nClass participation\n3 papers 3 pages each (first one is just excercise) Midterm - Slide ID, Comparison, and few terms (only major works of art that we discussed extensively appeared in exam)\nFinal - 10 IDs, 2 Comparison (50 minute total same as midterm, major pieces of art that you just cannot miss even if you didn't study appeared)\nBoth exams were very easy. (almost too easy that almost all got A in exams)\n"
        }
    ]
}