{
    "prof_info": [
        {
            "prof_name": "Yakov Kerzhner",
            "prof_id": 5503,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "December 16, 2009",
            "review_content": "\nTo begin with, this course should be titled \"Number Theory\" not \"Number Theory and Cryptography.\" Two lectures are spent on \"Cryptography,\" with much of the focus on factoring algorithms. That being the case, the emphasis on Number Theory was interesting.\nKerzhner is nice. There's no denying that. But he is not particularly clear as he teaches, and can tend to get annoyed when students arn't willing to participate.  On the other hand, participation doesn't seem to be very important, as only 3-4 students attend each lecture. Lectures consist of the professor working through a proof or two, and the tactics behind it.  It is interesting to get this insight, however the proofs presented are generally more difficult than those assigned during HW or exams.\nOverall, this professor is good enough, and besides the stutter, easy enough to understand.  He's also willing to be a bit lenient, so one cannot complain too much. Course is mediocre, but not terribly difficult, especially if time is put into each assignment.\nWorkload:\n1 problem set per week, of about 5-8 problems. They are nearly all proofs. If you don't know how to prove things, this can be difficult, but you quickly get practice. \n2 quizzes (announced), which comprise a total of 5 (?)% of the total grade. Surprisingly difficult.\nMidterm: do 5 of 6 proofs. Average was around 70.\nFinal: do 9 of 10 problems.\n"
        },
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "July 13, 2009",
            "review_content": "\nTHIS MAN SHOULD NOT BE TEACHING. This was the worst class experience of my whole four years at columbia -  yes, not just in the mathematics department, but overall. The class has NO organization, the lectures are horrible, and the book assumes that you should know more than what you really know - or at least assumes that you have a decent professor who will fill in the gaps. Unfortunately, Yakov is not that professor. \nAbsolutely HORRIBLE. Never clear with his students - it made me think whether this man had any idea as to how he would teach the course, or if he just thought of the lectures each morning while on his toilet seat. \nthere were 60 people who showed up the first day, and toward the end about 10 people who were scared out of their minds about the final. everyone else either gave up or dropped the class. \nWorkload:\nuseless problem sets from the book that took hours, but never really helped. \nexams = completely unfair, and the midterm 24-hour exam was really an experience. yea...24 hours. talk about a stress-inducer.\n"
        },
        {
            "course_name": "Number Theory and Cryptography",
            "review_date": "May 14, 2009",
            "review_content": "\nDO NOT TAKE A CLASS WITH THIS PROFESSOR! Ladies and Gentlemen I speak to you now from the bottom of my heart. Please, please listen to me, it is dangerous for your health to endure a semester with this man. No math, no matter how interesting or fun, is worth the stress and heartache you will have to endure from this man. He is a terrible, unclear, imprecise teacher. He will present the material in a harrowing and inconsistent manner and he will make you feel terrible for not understanding what is going on. I stuck with this class, because I wanted it for my major and the material was interesting but I tell you now, it has cost me a few years of my life. I implore you to heed my call and avoid this man at all costs!\nWorkload:\nFrustrating Problem Sets every week (even during weeks with exams), that do not coincide with the week's lessons. \n1 midterm and 1 final. \nDo not listen to what he says he will NOT give you partial credit for questions.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 28, 2009",
            "review_content": "\nProfessor Kerzhner is a great, easy going person. Our class was small (about 30-40 people) so he knew everyone's names. One disadvantage of this is that he can call on you even if you don't raise your hand; however I think it was a better situation than the huge class I'm in now. He does have a bit of a stutter, though, but pretty much only when he says people's names.\nThere were two assignments a week, but each was half the length of other classes' problem sets. He said he knew we would wait until the last day anyway, so he made sure we didn't overwhelm ourselves with one one massive problem set. One problem set is dropped.\nThe midterms are easy: there are six questions (for 120 points total) and you are only graded out of 100. Any extra credit is carried over to the other midterm. The final was a bit more difficult, but again there were 240 possible points, and they were graded out of 200. \nI highly recommend Prof. Kerzhner. He does not require that students be able to do proof-based questions even if he shows them to you. And with so much room to make mistakes and still get an A, how could you go wrong?\nWorkload:\nTwo half-length problem sets a week, two midterms with extra credit opportunities and a final with the same extra credit possibilities. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 06, 2009",
            "review_content": "\nKerzhner is obviously very smart in math, but he is not a great teacher. Maybe its that he's new to teaching. Who knows. The first part of the course, which involved integration and polar and parametric curves, was better than the second half which consisted of sequences and series. He brushed over the second half of the course very quickly and explained very little. He spends a lot of class time doing proofs that most students cant understand or follow or doing random \"challenging\" problems that he cant finish. There are two assignments due per week. Office hours are just about the only way you can consistently do well on homework. You learn a lot of the material on your own and wont leave the classroom feeling motivated to learn. It is possible to do well, but you have to work hard. All in all, its a lot of work and you don't leave knowing the material well. \nWorkload:\n- two problem sets per week. theyre hard. and long. \n- two midterms (there are 6 problems each worth 20 points, the test is graded out of 100) that are moderate to hard\n- final exam will be weighted as 90% of your grade if you messed up on the midterms but do well on the final. The final exam is reasonable if you STUDY A LOT. If you dont do well on the final, he will weight the midterms and homework more. \n"
        }
    ]
}