{
    "prof_info": [
        {
            "prof_name": "Xiaodan Wang",
            "prof_id": 4400,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "January 08, 2015",
            "review_content": "\nMan, was this class an experience. Let me start by saying Wang Laoshi is an absolutely excellent teacher. She might just be one of the best Chinese professors in the nation. She has a very, very good understanding of what students are likely to have trouble with and she focuses her lectures more around those things, which makes going to lecture really valuable (it's also mandatory, and 4 days a week, which can get annoying but it is what it is). However, this does necessitate that you do a lot of work outside of class.\nYou need to do a LOT of work outside of class.\nThere are quizzes basically 3 times a week (remember, there are 4 days of class a week). In themselves, they're quite short (typically 5 vocab words and a sentence), but the list you need to study from is usually around 30 words long. The days we don't have a quiz, we either have homework due, an essay due, or a test. The workload is quite intense, but it is, after all, a 5 point class. And when you do it all, you really feel like you have an understanding of the language.\nThere is about 1 day a semester when all the stars align, and you have nothing due - no quiz, no homework, no essay, no test. Take the day off. It will not happen again.\nTests in this course are not terribly difficult, studying the grammar structures worksheet that she gives out in class usually allows you to get at least an 85. Homework is also pretty easy and not too time-consuming. Essays are very time consuming, and she expects more of a five-paragraph type format (which is something she doesn't really expound on in class), which means they're graded a bit tougher. All things considered though, it's not the difficulty of the work that can get you; it's more the volume. \nOh yeah, you're also required to go to a drill session once a week to practice your speaking with a TA and a few other students. Pretty standard fare.\nI think I would have drowned in all the work had I taken this course with anyone else, but taking it with Wang Laoshi allowed me to live through the experience and come out with a way better knowledge of the Chinese language to boot. I can't stress enough how good of a professor Wang Laoshi is - a lot of this review is complaining about all the coursework, but her expertise and niceness and perfection as a professor makes the experience wholly worth it.\nWorkload:\nExtensive, but expected for a 5 point class. Regular vocab quizzes (5 vocab words from a list of about 30, along with a sentence or two). Homework due once a week (for a total of 16 homeworks). Three essays and three exams. A final presentation. An actual final. Regular attendance in the drill session and class. \n"
        },
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "January 08, 2015",
            "review_content": "\nMan, was this class an experience. Let me start by saying Wang Laoshi is an absolutely excellent teacher. She might just be one of the best Chinese professors in the nation. She has a very, very good understanding of what students are likely to have trouble with and she focuses her lectures more around those things, which makes going to lecture really valuable (it's also mandatory, and 4 days a week, which can get annoying but it is what it is). However, this does necessitate that you do a lot of work outside of class.\nYou need to do a LOT of work outside of class.\nThere are quizzes basically 3 times a week (remember, there are 4 days of class a week). In themselves, they're quite short (typically 5 vocab words and a sentence), but the list you need to study from is usually around 30 words long. The days we don't have a quiz, we either have homework due, an essay due, or a test. The workload is quite intense, but it is, after all, a 5 point class. And when you do it all, you really feel like you have an understanding of the language.\nThere is about 1 day a semester when all the stars align, and you have nothing due - no quiz, no homework, no essay, no test. Take the day off. It will not happen again.\nTests in this course are not terribly difficult, studying the grammar structures worksheet that she gives out in class usually allows you to get at least an 85. Homework is also pretty easy and not too time-consuming. Essays are very time consuming, and she expects more of a five-paragraph type format (which is something she doesn't really expound on in class), which means they're graded a bit tougher. All things considered though, it's not the difficulty of the work that can get you; it's more the volume. \nOh yeah, you're also required to go to a drill session once a week to practice your speaking with a TA and a few other students. Pretty standard fare.\nI think I would have drowned in all the work had I taken this course with anyone else, but taking it with Wang Laoshi allowed me to live through the experience and come out with a way better knowledge of the Chinese language to boot. I can't stress enough how good of a professor Wang Laoshi is - a lot of this review is complaining about all the coursework, but her expertise and niceness and perfection as a professor makes the experience wholly worth it.\nWorkload:\nExtensive, but expected for a 5 point class. Regular vocab quizzes (5 vocab words from a list of about 30, along with a sentence or two). Homework due once a week (for a total of 16 homeworks). Three essays and three exams. A final presentation. An actual final. Regular attendance in the drill session and class. \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "May 26, 2011",
            "review_content": "\nProfessor Wang is quite simply awesome, as all of the other reviews state. I was in her Elementary, not Intermediate, class these past couple of semesters, and she helped me through my initial difficulties with the language rather readily. Always smiling, lighthearted, and understanding, Professor Wang makes an extremely intimidating foreign language seem fun and natural. You will look forward to this class everyday if you take it. \nIf she isn't Gold Nugget quality I'm not sure what is.\nWorkload:\n...This is 5 credits for a reason. The syllabus says that you are expected to work at least 2 hours/day. This is a *conservative* estimate for the first couple months of your learning Chinese. As the year goes on though, 2 hrs/day is probably not necessary.\nHomework takes about 1 hour and is assigned almost everyday.\n\nYou have a Pinyin (phonetic and vocab definition) or character (writing Chinese sentences using Chinese characters and translating it into English) at least once a week on average. They take about 10 minutes. There are about 5 tests a semester if I recall correctly. They last the whole class period.\n"
        },
        {
            "course_name": "Intermediate Chinese II (N)",
            "review_date": "January 04, 2011",
            "review_content": "\nI absolutely agree with the review below. Wang Laoshi is too phenomenal a professor to only have one review written about her. I have never bothered writing one for any of my professors but I will have to make an exception here. I will try to write an unbiased review void of the massive crush I have on her.\nOne of the most striking qualities of her classes is how fun they are while still remaining fairly structured. I've taken several years of summer classes in the past and most of them have been just reciting sentences that are far too predictable. None of the material ever sticks because you are stuck repeating the same words the teacher says. Wang Laoshi's class structure encourages you to play around with the language and allows you to develop a more advanced understanding. \nShe's also just a really sweet teacher that will make classes extremely enjoyable and discourages you from disappointing her. Having to tell her you didn't do your homework is the emotional equivalence of being forced to bunch a small puppy. True story.\nThe only downside is perhaps the size of the class. Personally, I'm a fan of smaller classes for language courses but I guess because of the high demand for her, she accepted 15+ kids this semester, which inevitably leads to less class time participation. That said, her office hours are always available and she is a delight to talk to.\n\nWorkload:\nThe workload is typical of any 5 credit course - homework in the form of a worksheet everyday, dictations in the beginning of most classes, a test every 2 weeks, a couple essays sprinkled here and there. It is not a class to slack off, or to skip classes. But if you stick with it, I can guarantee you Wang Laoshi will make it an awesome time.\n"
        },
        {
            "course_name": "Intermediate Chinese II (N)",
            "review_date": "December 21, 2010",
            "review_content": "\nI am absolutely shocked that nobody has written a review of çŽ‹è€\u0081å¸ˆ. She's phenomenal: demanding but not cruel, encouraging without coddling. I've had a different Chinese teacher every semester and came into this class to discover that çŽ‹è€\u0081å¸ˆ has a set of groupies who build their schedules around her class every semester. This should tell you something. I'm certainly disappointed to be leaving---my Chinese has gotten significantly better this semester and I give her most of the credit for that. I only wish my schedule let me stay another semester.\nWorkload:\nYou know the drill by now.\n"
        }
    ]
}