{
    "prof_info": [
        {
            "prof_name": "John Morgan",
            "prof_id": 126,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "January 04, 2010",
            "review_content": "\nderiving so much\ntakes little integration\nsome such clear lectures\nI took a horrendous AP Calculus BC class when I was still in high school, and I was terrified that my professor at Columbia would be equally incompetent, going off only examples from the book and leaving little concepts for clarification. \nHowever, my experience with this class was very much the opposite. Professor Cautis is indeed soft-spoken, but I sat in the back of the classroom for most of the semester and was able to hear him clearly. He does only go off examples, but I found his explanations of the thought processes behind calculus before delving into those lent me a much stronger understanding of the material than I had previously been taught. Some of the examples are obviously developed to lengthen the class time, as we often would get out ten or even twenty minutes late, but this is more of a testament of Cautis's ability to get to the point of each lecture rather than ramble on.\nAs a new professor, he obviously has flaws in being stuck in that distant didactic lecture style, but he showed an obvious passion for mathematics and often showed it through the way he talked about the concepts. Also, his style was very appropriate for calculus, though still in the rough, especially at the beginning of the semester, when his lectures seemed more muddled, but he improved over the semester. \nThe two midterms were relatively easy. The final, however, was a bit harder, and I'm guessing it was extraordinarily curved from the difference between my semester grade and what I got on it.\nI went to lectures usually to listen to the first twenty or thirty minutes before they got too dry, then after that I would do something else and then pay attention again to copy down his very clear notes. It is also of note that some of his examples were also on midterms and the final.\nWorkload:\n1 problem set of ~10 problems/week that took at most an hour or two.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 21, 2004",
            "review_content": "\nWhile at first it may seem as though Morgan is a bit boring, as the semester goes on I came to appreciate his teaching.  He goes over many examples with the class and is always willing for in-class discussion and explains well questions that people have.   He's approachable and friendly outside of class.  The material gets progressively harder throughout the semester (on a grander scale than most classes), such that the first third may seem easy, the second moderate, and the last, pretty impossible.  But the whole class works that way, so the curve is good...although the class is curved around a C\nWorkload:\nweekly homework assignments, mix of even and odd problems; 2 midterms; final worth 50%\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "January 21, 2002",
            "review_content": "\nWhoever wrote that earlier review about testicle jokes is a dirty liar. He speaks english clearly though, a rare bonus. Nothing special, but not horrible either.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "January 13, 2002",
            "review_content": "\nThis professor doesnÂ’t care about making sure that the students understand the material. He goes through the material really fast. He throws the material at you and expects you to understand. When students ask him questions in class, he does not explain so that we can understand. His exams are mostly theoretical stuff and he gives no practice exam before the midterm....Takes him forever to respond to you via email. If you can, take Profesor Kofman...he is a much better professor. Morgan should stay as an administrator-- he just canÂ’t teach.\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "December 03, 2001",
            "review_content": "\nMorgan is a drone who merely regurgitates the exact examples and problems from the sections he is covering in the book, minus legible writing and helpful diagrams. His notes end up being a myriad of examples without the explanation of the actual mathematical concepts. Bring an arsenal of stimulants if you're planning on staying awake in his lectures.\nWorkload:\nWeekly graded homeworks ranging from two to eight pages of work. Two midterms and a Final.\n"
        },
        {
            "course_name": "Calculus A series",
            "review_date": "December 31, 1999",
            "review_content": "\nSimply goes up to the board and writes out and \"explains\" the necessary problems. Perhaps it was my fault, but I found myself unable to follow his lecture after the first 5 minutes, and I found after class that my notes were of no help whatsoever, though they were 80% word-for-word. I discovered from taking this class that I did not want to pursue a major in math, so some good came of the experience.\nWorkload:\nThree tests, weekly homeworks.\n"
        },
        {
            "course_name": "Calculus A series",
            "review_date": "December 31, 1999",
            "review_content": "\nSimply goes up to the board and writes out and \"explains\" the necessary problems. Perhaps it was my fault, but I found myself unable to follow his lecture after the first 5 minutes, and I found after class that my notes were of no help whatsoever, though they were 80% word-for-word. I discovered from taking this class that I did not want to pursue a major in math, so some good came of the experience.\nWorkload:\nThree tests, weekly homeworks.\n"
        }
    ]
}