{
    "prof_info": [
        {
            "prof_name": "Ronald Findlay",
            "prof_id": 2397,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "International Trade",
            "review_date": "December 21, 2010",
            "review_content": "\nAs I see it now, this class was vaguely interesting and definitely provided me with some tools to understand issues of trade in the world economy. However, during the semester, I actually dreaded going to this class, as it was extremely dry (read: you will only talk about models, graphs, theory) and there was no homework (looks like an upside, but without you don't actually learn anything). The book was really good, but Findlay didn't really follow it. Actually, it was amazing how during every single class in the semester he stood in front of us, without any notes or powerpoints or anything, and just presented and explained the different models. Obviously, he is extremely intelligent and contributed much to this field - however, maybe making the class more \"real\" (as opposed to theoretical) or providing students with more extra-class material (homework, readings) would be a positive development. The TAs were very clear and compensated Findlay's sometimes obscure equations.\nWorkload:\nMidterm (30%) and Final (70%) - nothing else. Looks like an upside, but when almost your entire grade is based on an exam about which you know little can be risky...\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "December 27, 2009",
            "review_content": "\nGood class. If you do well on the midterm or ask many questions (which he loves), he memorizes your name. Given both his birth in 1935 and the attitude most econ professor have toward students, this was surprising to me.\nThe subject is interesting. Classes may seem extremely technical and graphical (lots of graphs!), but the questions on the exams are not at all technical.\nBE WARNED. everything he writes on the board comes from his head, so the book doesn't really help. In fact, i can count the number of pages i read. So you might wanna go to class or recitations.\n\nWorkload:\nNo homework (this can be a downside as you can't even expect what the exams will be like)\n30% midterm\n70% final!\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "September 09, 2006",
            "review_content": "\nProfessor Findlay is an excellent teacher. He is extremely knowledgeable, passionate, and eager to teach. He has contributed a lot to his field of research and yet clearly enjoys teaching the basics of international trade to undergraduates. He welcomes questions and discussion both in class and during his office hours. He makes an effort to know his students and his priority is making sure the class understands the material. Don't be put off by the first two classes which focus more on the history of trade--they are not reflective of the rest of the course. \nWorkload:\nThe course doesn't require a huge amount of work; you can learn as much or as little as you want depending on how much time you put into the reading.\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "May 22, 2006",
            "review_content": "\nThis was an enjoyable course.  Professor Findlay is an excellent lecturer and he makes concepts very understandable.  We covered the first 9-10 chapters of the textbook.  You'll cover the rest of the text in INT'L MONETARY THEORY & POLICY.  I think this is the easier class of the two.  You should be familiar with the topics he covers in class which can be found in the text, but he goes over them in more detail.  To me, the exams were very fair and actually easier than I expected them to be.  Pay attention to the questions and make sure you answer them in detail.  Know your graphs and know the models well.  And you should do fine.  Good Luck.\nWorkload:\nNo homework.  Midterm/Final.\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "May 15, 2006",
            "review_content": "\nThis class was neither interesting nor useful.  Professor Findlay's lectures are pretty dull and don't have many real-world examples to back them up.  The terms and graphs he writes on the blackboard are virtually impossible to read, making studying for exams that much more difficult.  \nIt is true that there are no problem sets in this class, but there is a downside to that fact: you have absolutely no practice for the questions that he asks on the midterm and final.  He neither posts old exams on Courseworks, nor gives you an idea of what the exam will cover ahead of time, nor gives you an idea of how he wants you to answer the exam questions.\nThe bottom line: unless you enjoy vague lectures and don't care too much about grades, don't take this class.  If you really like international trade, wait for a different professor.   \nWorkload:\nMidterm (30% of grade), final (70%).  No other work, but when you see how vague the exam questions are you'll wish there was other work.\n"
        },
        {
            "course_name": "Seminar in Political Economy",
            "review_date": "August 24, 2005",
            "review_content": "\nFindlay is a great example of an old econ professor who really should never be allowed in front of students. His attitudes and actions towards his seminar were both hillarious and frustrating. He would come late (and later as the semester went on), come completely unprepared (whether it be knowing what was being presented or even for his own lectures the first month), and FALLING ASLEEP! He definitely nodded off more than a few times during presentations. But what easily annoyed our class the most was his constant interruptions during otherwise good presentations. He would cut off students mid-idea with what he thinks (and then go on for 20 min) which came off as him trying to show off or prove he was paying attention (both usually failed). As a result of this and the negligible coursework, classes were rarely fully attended (which Findlay didn't care about - a rarity in a small seminar) and there was pretty good class cohesion since Findlay just got ridiculous by the end of the class. The best thing about this seminar was that you can do whatever you want for your project (as opposed to Epstein's seminar). So find a topic you're interested in, figure out how to do it, then present it to the class and write the paper. So much freedom is great in the last class in PoliEcon! \nNice guy overall and could be useful in office hours but in the seminar he worked far less than even the laziest second semester senior. I'd recommend this easily over slaving over someone else's work in the other seminar.\nWorkload:\n~25 pg paper on whatever topic you want, written however you want, and (most likely) due whenever you want. 45min presentation on the topic to the class with 15 min for questions (or Findlay's impromptu lectures). Topic/Outline due the first month but can definitely be changed and/or incomplete.\nEASY A/A+!!! Tip: put in some graphs or charts or diagrams, he loves that stuff\n"
        },
        {
            "course_name": "International Trade",
            "review_date": "January 04, 2005",
            "review_content": "\nIf you've taken/are planning to take Political Economy and/or International Monetary Theory & Policy, DON'T TAKE THIS COURSE.  It is a boring regurgitation of the most boring parts of the material of those courses.  Better yet - if you are thinking of taking of any these courses (Poli-Econ, Int'l Monetary, or Int'l Trade), take the first two but not this course.  Granted, Professor Findlay is nice and patient, but the material is presented in a very robotic, technical manner, without relating it much to real life applications.  It could be a very interesting class but Findlay just doesn't make it so.  Save Findlay for other, more interesting classes.\nWorkload:\nAh, here's the flipside of the coin: the workload is TOTALLY easy.  Only 1 midterm + 1 final.  No problem sets.  The course covers 6-7 chapters of the book in total.  I can count the number of classes I attended on both hands and still came out with a decent grade.\n"
        }
    ]
}