{
    "prof_info": [
        {
            "prof_name": "Travis  Riddle",
            "prof_id": 12689,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Attention and Perception",
            "review_date": "December 05, 2013",
            "review_content": "\nHakwan is on his way to another University, but I figured I would leave a review anyway. \nThis class had plenty of pros and cons. In the spirt of actually conveying useful information, I will do my best to do justice to both.  For full disclosure, I am currently averaging and hoping to retain a B+.\nGeneral:\nNo text book.\nEvery week there is a quiz on an assigned scientific paper. \nThere are optional papers that are not necessary but immensely helpful. \n3 exams\nA few guest lectures. \nDecent lecture notes are uploaded just before class so you can follow along. \nPositive:\nAs many people have pointed out, Hakwan is obviously brilliant. It is especially clear when the lecture focuses on topics that he is personally involved in.\nThere is no text book. You only read relevant scientific papers. \nThe 10 quizzes are split in to two \"grades\". Only the top 2 from the first half and the top 2 from the second half are counted. \nThere is a review session for every exam and mock exam questions are provided.\nTravis was a super helpful TA. He helped review quizzes, explained complex ideas clearly, and was easy to get in touch with for help. (I find the previous review to be completely unfair. Especially because it was left after 2 weeks of class.)\nExams were scaled. A bit.\nGood/Bad:\nGuest lectures. The guests were excellent researchers doing interesting things. However, their lectures are technical, do not come with notes, and are included on the exam. Very interesting, but also hard to retain and study from. \nThere isn't actually all that much lecturing by Hakwan. Half of Mondays are consumed by qreview_content. review_content sessions happen during class time. Throw in two guest lectures and the final being on the last day of class, and the total number of hour lectured by Hakwan himself, are pretty low. You may find this good or bad.  \nNegative:\nThe exams are hard. Probably the hardest exams I have ever taken. He will tell you this upfront. Even with the study guide and mock exams, they are still really hard. \nThe papers are pretty complex. Most of them at least. The class will certainly teach you how to read and critique scientific papers, but mostly by way of sheer volume mixed with trial and error.\nHakwan is a brilliant researcher. He is a mediocre lecturer. (and would probably admit it if you asked him) He gets the job done. The lecture notes help. \nIn summary, I would say that this class is structured a bit more like a scaled up seminar than a regular undergrad class. It is hard, but manageable. The resources are there if you exploit them.  If you are looking for an easy A, look elsewhere.  If you are interested in, or think you might be interested in, learning about attention and perception from a world class researcher with a good TA to pick up the slack, it's a good class. \n\nWorkload:\n1 Quiz Per Week.  4 out of 10 are Counted. Open notes 20%\n3 Exams. 20% 30% and 30%\nReading: \n1 Mandatory Paper Per week\n2-4 Optional Papers Per week\n"
        }
    ]
}