{
    "prof_info": [
        {
            "prof_name": "Christopher Williams",
            "prof_id": 10801,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 09, 2016",
            "review_content": "\nAn entertaining teacher with incredibly high standards. He is an extremely hard grader.\nWorkload:\n4 essays like all UWriting classes, but he assigns a lot of reading and (ungraded) assignments for each class. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 16, 2016",
            "review_content": "\nI got randomly assigned to Mr. Williams's class last semester. He told us on the first day of class that he was a tough teacher. On the strength of the reviews I found here, I thought, \"Oh, I can handle tough. And it seems like he'll actually be able to teach me something as opposed to just wasting my time!\" I was sadly mistaken. He was the worst teacher by far I had this year. I found myself avoiding thinking about the class whenever possible. \nMr. Williams is an incredibly unfair and harsh grader. He ripped all of my drafts to shreds, only to point out totally new flaws in my final draft, usually things that had existed in previous versions of my papers that he had neglected to point out. I'm currently in the process of contesting my grade, as are a number of others in my class. I'm not a bad student, and I typically get A-range grades on papers for other courses, not just Lit Hum. But I'm wary of this review sounding like a \"wahh I got a bad grade in this course and so I'm going to complain about this teacher to make myself feel better.\" \nI can assure you that's not the case. Grades don't matter in the long term. What matters is the way this class made me feel, which was miserable. I was constantly frustrated with Mr. Williams, both for his arbitrary and unfair grading and for his hypocrisy. He gave us numerous lectures on the importance of punctuality and not wasting our time when tuition is so high, only to be at least three to five minutes late to class. He also constantly pushed back the dates he told us he would give us our papers back, despite stressing the importance of sticking to a deadline. As a result of this delay in grading, I didn't get my second paper back until there were only three weeks left in the semester. I dreaded every second of this class and implore anyone considering taking UW with him to reconsider. It made me miserable. I don't know how the other reviews could possibly be so positive, except that maybe Mr. Williams had a personality transplant. \nWorkload:\nFairly standard for UW, some assignments felt too much and I had to stay up late to finish, but not too bad overall.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 24, 2011",
            "review_content": "\nI'm writing this review because Mr. Williams definitely deserves a nugget for making this class my favorite last semester. Before his class, I honestly had no idea on how to write a coherent, logical essay. With very useful assignments and ample amount of time to work on these essays, this semester has finally taught me the ability to create arguments that I can be proud of.\nWhat I also liked about Mr. Williams is his honesty. Make no mistake, he will tell you when your draft could use some (or a lot of) improvement, and he will give you a C if you've written a truly terrible essay. On the other hand, your assignments include outlines and drafts that you can take to office hours; plus, he gives a lot of feedback on the work you submit, so it is very possible to get a high grade in this class. (He repeatedly told us that all of us could get an A in the class, so he's not out to ruin your GPA.) \nFinally, his jovial and congenial attitude helps. He's a grad student, so he completely understands what it's like to be an undergraduate student. (Expect to fall behind towards the end of the semester, because he also has his own work to do and thus it'll take him a while to return grades.) Also, he insists on making the class a discussion like Lit Hum; this means speak up! Our class often talked about our individual projects and gave each other even more feedback on how to improve them.\nIf you've always wanted to learn how to write persuasively, take UWriting with Mr. Williams. I know that if I go to the Writing Center, he will be the first person I go look for for feedback. \nWorkload:\nA fair amount, but this is UWriting. Expect almost something due every class: when you're not working on your drafts, he could ask you to read some source texts and model essays, with an occasional written response to them. He actually does read your responses and gives feedback, so put effort into them.\nThe Four Essays: Lens Essay (20%), Conversation Essay (30%), Research Essay (40%), Retrospective Essay - which became a class presentation (10%). If you create an essay that you yourself can read and understand, you will get the grade you deserve. There are word count limits, but if you set out to write a good essay, you can completely ignore them. You also get to rewrite one of your first two essays towards the end of the semester, so you can definitely do well in this course.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 06, 2011",
            "review_content": "\nI thought Mr.Williams was a fantastic UWriting teacher. His class is a lot of work (most UWriting classes are), but I felt I learned a lot throughout the course and actually improved my writing ability. Going to office hours helped me tons; he is incredibly helpful and is willing to go over every sentence of your draft with you and talk about your argument to beat your essay into shape. He is also a very eloquent speaker, which helps some of the initial course material, which is somewhat dry,  go by quickly.\nUnlike some UWriting teachers who seem to have GPA crushing on their minds, Mr.Williams does give As, even though they don't come without hard work. In fact, Mr.Williams always claimed that every one of us could get an A if we put in the right kind of effort (edited a lot, went to Writing Center, went to office hours etc.). I don't know if this actually happened, but it says something about his attitude towards grading.\nHis grading is also fair. If you put in substantial effort and generally feel that you have created an essay that you are proud to have written, you will get the grade you expect. His feedback is also incredibly thorough on both drafts and essays, so you can definitely improve using that feedback.\n\nWorkload:\n4 essays: 1500 words, 2500 words, 3000 words and 1000 words (word count flexible). Rewrite for any one of the essays. Essays are preceded by drafts (but these drafts don't contribute to your grade - I wrote some truly terrible ones - but are good for feedback).\nHeavy homework w/ reading for the first few classes, but soon this dies off and you only need to focus on your essays\nNote: we ended up falling behind so at the end of the semester I had to write three essays (the 3000, the 1000, and a rewrite) all in two-three weeks while studying for finals.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 21, 2011",
            "review_content": "\nExcellent professor! He uses creative methods to engage all students in the classroom discussions, which might seem pointless at the time, but believe me works out for the best in the end. He is always available to answer any question either by email or face to face interaction and willing to sit with you until you grasp what is required of you. His feedback is usually useful and clear. He also allows you to rewrite your worst essay for a better grade. \nWorkload:\n4 essays...1500 words, 2500words, 3000words and 1000 words. All of the essays require one or two drafts that need to be approved before continuing.\n"
        }
    ]
}