{
    "prof_info": [
        {
            "prof_name": "Flora Davidson",
            "prof_id": 4849,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "American Urban Politics",
            "review_date": "April 16, 2013",
            "review_content": "\nProf. Davidson is very nice, and her class was very bearable and pretty easy. There was definitely a little bit more fluff than I expected. The first half of the course ended up being a rundown of urban history--and while I do find that pretty interesting, it was nothing that I couldn't have acquired from reading a good book or even a series of thorough wikipedia articles. Sometimes her lectures felt like very good high school history lectures in that they largely presented a series of simple dates, names, and events, and I often found myself reverting to my high school note-taking method--passive listening that was largely sufficient to get all the information needed.\nThe second half of the course was much more in depth and satisfying. It felt like a good survey of recent urban issues and concluded with an interesting and current note on contemporary cities and the future. Professor Davidson provides ample supplementary material to the syllabus, often from that day's issue of the Times, and is genuinely enthusiastic about students' feedback. That said, it still wasn't very challenging.\nI didn't strictly need this class for my poli sci major, but am very interested in everything urban. This class kind of met my expectations, mainly the second half. But sometimes I wonder if I could have better used that spot to explore another concentration or something. If you're looking for a great, mind-blowing academic experience for an elective, this class is comparatively meh. Certainly not bad, though.\nIf you're in the American subfield, this is an easy and painless class that's generally interesting. It's also a class where if you put a lot in, you can learn a lot; you could also easily find yourself coasting and not learn as much as you felt you could/should have.\nKathy is a good TA, super nice and good at guiding discussions.\nWorkload:\nNot bad. If my memory serves, two essays or so, a longer book review, and an in-class final. Grading was generous. Ample extra credit opportunity. Not all the reading is necessary, and its easy to tell which ones are most essential by the lectures and discussions. They split the grading among TAs alphabetically.\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "January 16, 2012",
            "review_content": "\nProfessor Davidson is a great professor. She gives great notes which basically summarizes the lonnnggg readings. In addition, she gives extra credit papers which can be very helpful. The class itself was fairly interesting and a great class for a poli sci or urban studies major.\nThe reading increased as the semester progressed but her lectures usually cover the readings fairly well. Grading largely depends on TAs. Some TAs are more competent than others and give more feedbacks on papers. \nWorkload:\nVery standard for a humanity course. Mid-Term was fairly straight-forward as long as you start early and do your research. Book report can be tricky (as it is graded by Prof. Davidson and her TAs based on the book you picked). The final is nothing to stress over as long as you took decent lecture notes (I'd recommend using a laptop for note-taking).\n"
        },
        {
            "course_name": "Coll: Exploring Political Leadership",
            "review_date": "April 15, 2011",
            "review_content": "\nI loved this class, and it's a great colloquium option for anyone interested in American Politics. The class explores Political Leadership from many different angles, opening with a fascinating analysis of Woodrow Wilson that sets the tone for the entire course. Each week, the readings either focus on a typology (Barber, Greenstein) or an aspect of leadership (minority, women, groupthink). There were also several readings about Obama (including his book). The readings were very applicable to the papers, especially the typologies, which Davidson emphasized that we should use. If you chose a woman or black politician, those readings were useful as well.\nMy favorite part about the class, though, was how easy Davidson made it to write the research paper. The department requires junior colloquiums to include a 25 page research paper, and Davidson broke this down into pieces in a way that made writing the final paper SO easy. Each person picked a politician to explore. Our topic statement was due the 3rd week of class, annotated bibliography in about the middle of October, and a detailed outline after fall break. A rough draft was due one of three weeks around the time of Thanksgiving, depending on when your presentation was scheduled. I used fall break to read some books on my topic and the outline made writing the paper incredibly easy, especially after discussing it with her. She required all students to meet with in in office hours at least once and she gave very helpful feedback regarding the outline and gave everyone tips about the structure of their paper and the focus of their research question. I wish the colloquium I am taking now did this, since it's the middle of April and I have barely started anything.\nAnother great part of the class was the rough draft and presentation requirement. Three weeks of class were entirely devoted to student presentations of the first draft of their paper. Everyone posted their papers on courseworks and the reading assignment those weeks was to read the papers and come to class prepared to give peer feedback. Mostly everyone only skimmed the papers, but the feedback was still amazing. I have never read other student's work in the same way before, and it was really interesting to see how other people approached the paper. It was completely obvious how much effort each person had put in, and it was very interesting to be in the professor's shoes for a little while. If you spend some time thinking about the organization and structure of your paper, include the things that Davidson had repeatedly emphasized throughout the semester, and listen to her advice to NOT include too much background/bibliographic information and instead include it in an appendix/time line, you are way ahead of the game. Not too difficult, but a lot of people didn't do it. \nA word of advice, put a lot of effort into the rough draft and you will not have to make too many changes for your final draft. I finished my final paper multiple days early and went over the page suggestion, which says something about the organization of this class. Also, pick a politician you think is interesting and doing the research will be (almost) fun. \nWorkload:\nTypical for the department standards, maybe slightly more. About a book or some long articles per week for reading. Questions about the reading every week which can be done from only skimming. Each week a group of 2-3 students lead the discussion and opened with a presentation about the readings. When it is your week you prepare for the presentation and also write a ~6 page paper. The final department standard 25 page research paper, which is helpfully broken into pieces by Professor Davidson. Mine ended up being 35 including appendixes and bibliography. There is a required rough draft and ~15 minute presentation in class on your paper.\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "January 13, 2011",
            "review_content": "\nProfessor Davidson is a mostly engaging professor who has a passion for her course material and her students. She approaches the broad topic of American Urban Politics by organizing her syllabus chronologically, and then discussing certain reoccurring themes. Pretty much material she presents is all very interesting, and her assignments are, to paraphrase her, meant to engage you intellectually and conceptually and not function as busywork.\nBad things about her class are that lectures can be pretty boring and/or repetitive as, yes, Professor Davidson does often regurgitate the reading (including whole quotes at times), which can be good in moderation but not to excess. This is not to say that reviewing the assigned reading is all bad, as she knows well that many people cannot keep up with reading and that not discussing homework can make the class seem disjointed. It's just that Professor Davidson probably reviews too much. At the very least, she definitely relies on crutch words (e.g. um, uh) a lot. \nAlso, the course has a rather transparent \"liberal/leftward\" bent. It would have been nice to incorporate a few opposing viewpoints that present, say, arguments *for* reduced federal help to cities. I'm not sure if legitimate research on such a viewpoint exists, but since Professor Davidson and one's textbook are constantly ragging on conservatives, if you're totally allergic to liberal politics, this course is not for you.\nAll in all, I'd take this class if you have a decent interest in a broad overview of US cities and their role in economic development and politics.\nWorkload:\nSee previous reviewer remarks. A sizable amount of reading that can be put off if necessary, a weekly discussion section, ~8 page take-home midterm, ~10 page book review, 3 hour-long final taken with a 2 page review sheet you design yourself, and extra credit. Class average seems to be a B to B+ excluding extra credit calculations.\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "January 12, 2011",
            "review_content": "\nTake American Urban Politics. Seriously. JUST DO IT. The class changed everything I've ever thought about anything. I've changed my major to urban studies because of it. Flora is wonderful--the sweetest, most understanding professor I've encountered in the past three years. The mandatory discussions sections really complement the class material nicely. Flora interweaves current events into the class subject matter nicely. Her knowledge about NYC politics and development is particularly intriguing. Flora makes herself very available to her students. All in all, a wonderful experience.  \nWorkload:\nreadings got heavier as the semester progressed, but nothing horrible. take home midterm (8 pgs), book review (which is awesome if you pick a good book- 8-10pgs), and in class final (IDs and 2 essays--took the whole three hours). Mandatory discussions that complement the class nicely. \n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "December 24, 2010",
            "review_content": "\nI really like Prof. Davidson. I'll admit that the criticisms below are pretty true, but other than that, she is very kind and well-meaning. She is clearly very passionate about urban politics, and she often incorporates articles about current events that are fun to hear about. Her lectures can be a bit dry since she basically regurgitates the textbook, but that means you don't have to read the book on your own (really, you don't!). I'd say that there are two ways to do well in this class.\nThe first, which is what I did, is go to class, skim the textbook every couple of weeks, and do the supplementary readings that aren't discussed in as much depth during her lectures. Go to your discussion sections, say one or two things, and work hard on the take-home midterm and book review. That's one way. The other way is to hardly ever go to class (though you do have to go to discussion section), but keep up with reading the textbook/articles on your own. Some students already acquainted with urban politics did this, and I'd say it was just as effective.\nIt's really not hard to do well in this class. I don't really know what an easy A class is (I'm convinced none exists at Columbia), but my hunch tells me that this is close to it. Enjoy how sweet and non-threatening Prof. Davidson and her TAs are. If you're looking for more than that, you can try to challenge yourself here, but I'm sure there are many other classes that would be better for you.\nWorkload:\nTake-home midterm (two four-page essays, pretty straightforward), a book review (kinda fun if you choose a good book and start the reading early), and an in-class final (IDs with two essays). Make sure you answer every part of the question! And also do the two extra credit opportunities she gives, they're usually interesting and are a nice cushion to your grade.\n"
        },
        {
            "course_name": "Coll: Exploring Political Leadership",
            "review_date": "December 15, 2009",
            "review_content": "\nThis class is great for any poli sci major or just for anyone into current events. You learn about the way that the personalities of political leaders affect their decision making, as well as issues of race and gender and how they intersect with the behavior of elected officials. Barack Obama and the 2008 election came up a lot in the class discussions. Despite Prof Davidson's clear bias in favor of Obama and the Democratic party, we were still able to get to the heart of real, interesting issues. \nProfessor Davidson was extremely knowledgeable, lively, and a great facilitator of student participation. She was responsive to our ideas and always had something insightful to say. She was friendly and made us all feel at ease. It was clear that Prof Davidson had put a lot of thought into the organization of the course, and there was a very logical progression to the ideas introduced. The heavy participation was very interesting and I loved the exchange of ideas. There was a lot of comfort in our group setting and a lot of lively discussion that wasn't forced. Definitely take this course if you can. \n\nWorkload:\nModerate/heavy weekly reading, sometimes a book & a few articles. \nWeekly reading responses are easy.\nOne 'midterm' 4 pg paper on a reading of your choice + presentation\nOne long final 25 pg paper + 15 minute presentation.\nNo exams.\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "November 28, 2009",
            "review_content": "\nTHIS IS THE MOST BORING CLASS WITH THE MOST BORING PROFESSOR. Every single day, when I went to class I'd sit and think \"It was such a mistake to get out of my bed for this.\" Professor Davidson is the most infuriatingly boring professor I have ever taken a class with. She reads straight from the book (count the number of times per class she says \"don't worry, don't write this down, it's straight from the book...\"), takes long pauses, speaks very slowly, and constantly falls behind the syllabus. It didn't help that the entire class was uninspired and lethargic, of course, but she injected no energy into the classroom. \nThe actual course is interesting, with a lot of fun facts about New York. I urge you to take this class with someone else however. While Davidson is obviously very interested in the material (frequently offering extra credit opportunities to encourage her students to go out into the city and experience things), she doesn't seem to care for her undergrads. She loves her TAs but is cold towards the students actually taking her class. \nWorkload:\nWork is easy if vague. Average amount of reading per week, and once weekly discussion sections. The midterm was take-home, the questions were very explicit, and it was graded reasonably. The book review assignment was a breeze. The class also includes an in-class final.\n"
        },
        {
            "course_name": "Coll: Exploring Political Leadership",
            "review_date": "November 28, 2009",
            "review_content": "\nProfessor Davidson is a gem! You can tell that she is very interested in her students and passionate about what she teaches. This is my first colloquium so I was pretty nervous knowing that I had to write a 20 pg paper, but Professor Davidson is extremely nice and always available whenever you need help in office hours or after class. What I found especially great about her teaching method, is that she helps us think about our paper in stages. This takes a lot of the stress off of the paper when you finally sit down to write. We started out with a paper topic where you explore why you are interested in your leader of choice, then a annotated bibliography where you begin to do research, followed by a brief outline. Then we have a brief presentation in class for the draft of our paper where we can talk about our paper with the class, get some ideas and go back and improve the paper. I believe the final paper is due the last day of class. I'll see once we get there. Overall I really recommend this class for anyone who may be nervous about writing their first lengthy paper in college or is passionate about political leaders. Professor Davidson had some great readings that she has chosen for the class, which really allows you to see some well known presidents in a new light. \nTo the first commenter below, I don't know what you are talking about. Professor Davidson is great!\nI'm writing my paper on a NYC mayor during the urban crisis and Professor Davidson is extremely knowledgeable on urban studies. I have never seen her read directly from the book.\n \nWorkload:\nweekly responses on readings, one 4 pg paper and presentation on one week's reading, 20-25 pg final paper.\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "September 20, 2009",
            "review_content": "\nI'd also have to disagree with the first review. \nI came into urban politics as a New York history buff and this class expanded my interests so much more - so much so that I considered changing my major to urban studies. \nThe class itself isn't hard, nor are the readings. this class isn't designed to stump you or be a GPA breaker. As long as you go to class and listen, you can do well. It was always a pleasure to go to class, what with Prof. Davidson's anecdotes about Chester, Pennsylvania and the Georgia rail project. Prof. Davidson's passion in the subject is obvious and it's contagious. Recitation sessions were nearly always full of lively discussions (the exceptions came during midterm season when some students hadn't quite caught up with the readings.)\n\nWorkload:\nTake home essay midterms (make sure you answer the questions fully), book review (very open ended and easy to write), and a final with one page open notes. \n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "September 18, 2009",
            "review_content": "\nI have to disagree with the above review.  I found this class very enlightening regarding American Urban Politics.  The textbook we used was very easy to read and interesting, especially if you're a fan of American history.  And Professor Davidson was helpful in highlighting the important aspects of all the readings.  The class was also a nice balance of assigned readings and current events, which we often discussed as a class.\nAs for the workload, it really isn't much - very standard for a social science class.  The readings are manageable and the two take home essays for the midterm are very short - 4 pages.  The key to doing well on them is to outline the topics based on all the relevant readings, write the essay, and then take out the lesser important facts (it is difficult to squeeze so much into 4 pages, but not impossible!).  Finally, there is a book review.\nHonestly, if you do the readings on time and come to class, there is no reason you shouldn't do well on the exams and the class as a whole.\n"
        },
        {
            "course_name": "American Urban Politics",
            "review_date": "August 04, 2009",
            "review_content": "\nI entered American Urban politics with high hopes. Urban politics had always been a topic of interest to me, and I wanted to explore it a bit. Unfortunately, I took the class with Flora Davidson.\nAt first, Flora seems like a genuinely nice person. She always tells the class \"not to worry\" about things and tries to deliver funny quips. But she's just a terrible lecturer, who reads directly from the book (and quickly, so as to prevent you from taking accurate notes) without providing much additional insight. She manages to reduce something as dynamic as the urban environment to a bore-you-to-tears drone. \nHer midterm was a take-home, and is graded harshly. Very few got an A- or above, with the average grade around B/B-. The book review is vague, but she's more generous with the grading... I think the average was a B+. The final is lengthy and tests you on the obscurities of the reading, and is graded harshly as well.\nIf you're looking for an easy A/A-, this is not the class for you. If you are truly interested in urban politics, give it a shot. I just hope a terribly b**chy professor doesn't ruin it for you.\nWorkload:\nTake home midterm 30%, book report (yeah, seriously) 30%, final 30%, heavy weekly reading. Class participation 10%\n"
        }
    ]
}