{
    "prof_info": [
        {
            "prof_name": "Thomas Fogg",
            "prof_id": 12955,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 20, 2015",
            "review_content": "\nProfessor Fogg is very approachable. He truly means well and will help in any possible capacity. He appears to be a man of infinite patience; a necessary virtue in anyone that listens to music created before the 20th century. It's also not a virtue many people have in spades, so yes, his class certainly felt boring. I personally enjoyed it, but I'll never forget the walls of silence in that room. I suspect a combination of inexperience (from both teacher and student) and brutal heat were the cause. This was a summer course, and to be fair, it was hard to hear over that AC. So off it remained.\nThere was a 5 minute presentation you had to complete about a piece of your choosing, at a time of your scheduling. The midterm and final were challenging. Roughly a third of the grade was based on your ability to listen to a piece and identify its period, composer, and title. Definitely not something you can wing. You also had to attend a performance by any artist and write a 5-page review using your newfound knowledge. I had fun with that. You could pretty much see whoever you wanted as long as you had something to write about.\nHonestly, Music Humanities isn't very enthralling subject matter, unless you're already into it. I can only see Professor Fogg improving with time, assuming he continues teaching. Some of the material was tedious, but overall, it wasn't a difficult course. And I did well. And I even remember some of the material. And that's what it's all about.\nWorkload:\nWeekly reading/listening, midterm, presentation, concert review, and final. Light work compared to most three-credit classes.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 06, 2014",
            "review_content": "\nFirst off, Thomas is a nice guy. However, he could use quite a bit of improvement as an instructor. The class was slow and his teaching style monotonous. The listening in class seemed to be offering enjoyment for him, with almost an apathy for the class. Admittedly, Thomas did not make the course syllabus, and I recognize how structured a class like music/hum is. If this class is supposed to create an appreciation for the masterpieces of western music, it is an utter failure. The class was torturously boring, and for me, a waste of time that could've been spent learning something I, and my fellow students, are more passionate about. \nThomas continually turned off the air conditioning (often during 80+ weather) as he felt it interfered with our listening. This was incredibly frustrating and uncomfortable.\nWorkload:\nTook course over the summer, so a decent amount of listening and reading for each class--but very manageable. Readings were almost always unstimulating and pointless. Tests were fair.\n"
        }
    ]
}