{
    "prof_info": [
        {
            "prof_name": "Irina Reyfman",
            "prof_id": 2471,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "CHTENIIA Voina i mir ",
            "review_date": "August 03, 2012",
            "review_content": "\nI thought this was a great class. The demographics of the class are pretty interesting-- it's a mix of grad students, 3rd/4th year undergrads, and a couple of native speakers ( disclaimer: I am one of those native speakers). Regardless of this, I thought the class discussions were very interesting, and I thought everyone participated to the best of their ability, which is all that Reyfman asked for. \nAs for Reyfman, herself, she is incredibly prepared for every class. She has the syllabus prepared before the semester starts and sticks to it. She asks great questions every class, and she often provides students with a small lecture about the background (especially since war and peace has many important historical events that students might not know about).\nOverall, I highly recommend this class and professor Reyfman to anyone interested in Russian literature with a good enough grasp on the language to be able to read it in Russian.\nWorkload:\nAbout 50 pages of reading per session. Reyfman asks you to write up a question weekly and send it to her, which she uses for discussion. Thus the students help guide the discussion, though Reyfman also comes up with great discussion questions of her own. She assigned a couple of papers, a midterm take home paper, and a final (in class essays). She grades fairly. For the papers, she cares most about content. She assigns you two grades, one for content and the other for grammar etc. You can rewrite it to boost the second component. \n"
        },
        {
            "course_name": "Intro to Russian Literature I",
            "review_date": "January 14, 2007",
            "review_content": "\nThis is a good class, and Professor Reyfman is really caring and nice. She makes the class fun; she is ALWAYS prepared and on time; and she is a fair grader. Most of all, she knows absolutely everything about Russian literature. It's hard to imagine.\nWorkload:\n4 1-2 page essays in Russian. Fair mid-term and final. Questions to be e-mailed. \n"
        },
        {
            "course_name": "Intro to Russian Lit I & II (19th & 20th centuries)",
            "review_date": "May 06, 2005",
            "review_content": "\nOne night earlier this spring, reading a sliver of Boris Pasternak's novella, The childhood of Liuvers, in the company of Prof. Irina Reyfman's vocabulary list, I met with an insurmountable poetic phrase. My eyes shuffled hopefully from that text to this list, which revealed, \"I will explain in class. To explain this, it is necessary to draw.\"\nIndeed, Prof. Reyfman draws. She draws up these lists nightly, and posts them on Courseworks, explaining ambiguities owing to the peculiarities of epochs (slang, outdated articles of clothing, etc.) or ambiguities born of breathless or meandering sentences. She draws on the board to explain a knot of a word: the rim of a sieve, for example. In her two-course sequence, Introduction to Russian Literature, she draws together a motley crew of students. We possess the language with varying grasp: some are but in third-year Russian; others are heritage speakers (although these are the exception rather than the rule). Each of us learns to read slowly, to \"caress the divine details,\" as Nabokov urged. In class, Prof. Reyfman is patient with misplaced accents; she allows for the revision of essays. She deftly ties our response questions \" written and emailed to her on the heels of a few pages of reading in the original \" into the discussion. She gives us the floor sometimes: we hold conferences in the miniature, thus learning how to present an argument aloud, how to field the questions of peers.\nThough she is Director of Graduate Study, Prof. Irina ReyfmanÂ’s office hours for undergraduates are abundant. They spill over into the entire seventh floor of Hamilton; nor will she deny us advice on College Walk, should we ask for it there. She wrote my recommendation letter for my year-to-come in Moscow. Russian friends of mine, visiting Columbia during their universities' respective holidays, have accompanied me to Prof. Reyfman's class; she has welcomed them and they have seen what wonders she has wrought, what seeds of interest in literature she has sown and watered, and with what love she has done it all. She is at once serious and funny; critical and generous. She spurred a renaissance in the studies I was poised to abandon at the start of my sophomore year, because she does not believe in following a schedule at the cost of understanding a story; in sharp contrast to others I have known, she is willing to indulge, to exhaust a theme a little. She has made of me a greater reader. She has given no work or student short shrift.\nThis is the loveliest debt in which I have ever been.\nWorkload:\nClass meets three times a week; you always have new reading, but the idea is to read a short selection and to read it well. (The opposite of most courses here....) Response questions must be emailed in time for the next class. Everything is in Russian - this should not discourage you. It's really the first time you get to see the beauty of Russian language - in the context of literature as opposed to grammar textbooks. Manageable essays (with room for creativity!) for almost every story or two stories; occasional short presentations to the class. It's usually a small class - very intimate: you never ever want to skip class. Midterm and final - very fair, no surprises. Take this class!\n"
        },
        {
            "course_name": "Intro to Russian Literature II",
            "review_date": "April 27, 2005",
            "review_content": "\nThis woman is incredible amazing wonderful. I don't have enough adjectives to describe Professor Reyfman. Since beginning the course, my Russian reading, grammar, and vocabulary has improved tremendously due to her. She is thought-provoking, incredibly intelligent, eloquent, and one of the best professors I have ever had. \nWorkload:\nReadings for every class -- there is no way to avoid doing them but they are usually short shorties and not too complicated, except for one Pasternak text.  Reasonable length essays in Russian about every 2-3 weeks, you can do rewrites and get an A if you want one.  This class is immensely rewarding and makes me grateful to be attending this school!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 11, 2005",
            "review_content": "\nLit Hum with Prof Reyfman is difficult to summarize.  She is a strong, authoritative figure in the classroom (her thick Russian accent was only partly responsible), though she was  nice and cared about students who put in a little effort.  Class discussions  could be dull at times, but to what extent the class was responsible is difficult to say.  Many students simply didn't do the readings (myself at times) and those that did often kept to themselves.   Professor Reyfman had an inexhaustible list of questions that she prepared for every discussion.  Some were thought provoking and developed into into interesting discussions, but others it seems were designed to see who in the class had read.  My classmates seemed divided pretty evenly on who liked Prof Reyfman more than our last Lit Hum Prof.\nWorkload:\nHaving trouble remembering...definitely not bad though.  I think two papers.  Maybe a 5 page paper and a 7-8 page paper and then midterm and final.  A little tough on the grading but still fair.  \n"
        }
    ]
}