{
    "prof_info": [
        {
            "prof_name": "Lawrence Engel",
            "prof_id": 1237,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Film Production",
            "review_date": "November 14, 2006",
            "review_content": "\nThe school is lucky to have Larry.  He is one of the few teachers in his field that actually knows what he is doing, and that it works in the REAL WORLD.  He is a producer, cinematographer, director, and screenwriter all in one.  If you look him up on IMDB he has a real repertoire unlike the other people in the film department who are floating around in academic-la-la-land. Larry may be a bit harsh, he might talk too much and too loud, he might be really busy outside of class (he has a job outside of Columbia) but he is the real deal.  He always makes time for his students and always replies to e-mail asap. He cares immenseley about his students and about well-made movies in general. \nWorkload:\n1 short film/project per week. There are assigned readings but I don't think anybody actually read them. I never touched them but I probably should have. The final project is fun, and you finish the semester with a couple short films to show to your roomates.\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "January 02, 2005",
            "review_content": "\nProf. Engel did a great job designing this course. It gives a broad overview of the history of documentary, from the Lumiere Brothers to Errol Morris. Every film was extremely education or enjoyable, and most of the selections were both. Class discussion wasn't the course's strong point, but Larry's lectures were insightful and usually very relevant to the current state of documentary. Class-time was nicely balanced between screenings and discussion, and the films themselves represented an incredibly broad range of topics and styles.\nWorkload:\nReadings, which can seem heavy, but are all extremely informative and essential to getting the most out of the class. Journal, approx. 12 page midterm that answers three questions and a 15 page final on a topic of the student's choice. There was an alternative final in which a student could do a video project. Weekly discussion sections.\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "December 23, 2004",
            "review_content": "\nIncredible? I wanted to die. This class was 4 hours of hell. Coffee wasn't enough to ward off a headache. Prof. Engel is a genuinely nice, low-key guy, but is definitely more of a filmmaker than a teacher. There were no lectures unless you count a couple of hours when he threw an outline of his mentor's book on the overhead and read it to us without really explaining it. And the day when he tried to get us into a discussion about propaganda but succeeded only in coaxing out some ridiculously inane, uninsighful comments. The insights he called out during films were usually \"low angle,\" \"high angle,\" or \"continuity cut.\" He never brought up current documentaries (to be fair, I don't think many people in the class actually saw or had any interest in current documentaries, unless you count Fahrenheit 9/11, which they constantly brought up as if that made them well-versed) and he didn't give us any insight into where he thought documentaries were going in the future. The level of discussion/\"lecture\" was completely superficial and I felt stupid even sitting there. I'm not a film major so I don't know if this is what all film classes are like, but it was not challenging at all. Save yourself some time and rent some Wiseman and Maysles. Sitting through this class is just pointless.\nWorkload:\nA take-home midterm, a film log (basically, photocopy your notes), attendance (they pass around a sheet), and a final paper (15 pages) or a group project (documentary clips imitating styles we watched in class with a shorter paper describing the experience). In terms of reading, which you only have to do for the midterm, the Representing Reality book is poorly written, the Eco is interesting but we barely referred to it, and the Barnouw is written for a 10-year-old. AND SECTION. OH GOD SECTION. WHAT A COMPLETE WASTE OF TIME. \n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "July 26, 2004",
            "review_content": "\nNot a fan of this class.  I took this class hoping for, well, an introduction to the study and theory of film.  Instead, I got a bunch of film snobbery wedged between movies that were extremely hit or miss (and occasionally a 3 hr 45 min nap).  These movies are not all appropriate to an intro class, but we watch them because Larry wants our generation to see them (he tells you this on the first day of class).  I want to be a film major, and I couldn't stand the other film majors in the class.  Larry caters to the 3% that already know everything you're supposed to learn, and calls on the same 4 kids as they snicker over the absurdity anachronistic mis en scene! hahaa!  The class is just really impersonal and NOT a good introduction to the film dept.  Discussion sections are hit or miss, but mine was actually awesome, thanks to Daniel Falcone (loved him!).\nWorkload:\nJust a few papers. There is so much reading, probably about 200 large pgs per class, but don't do it.  Just read through it for the papers.  Some work on \"the deconstructor\",which is the most worthless and tedious thing ever created.  Grading is not necessarily hard, but is certainly arbitrary.  It is hard to get an A, but also hard to work very much.  Bs seem pretty standard.\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "May 22, 2004",
            "review_content": "\nWhat an amazing class. Professor Engel, by far, taught the best class I had all year. Provided, I am a film major, but I think my love for the class stands far beyond my love of film. Essentially, Larry is extremely passionate about cinema and it shows during the screenings. Although he does talk over the films, he chooses times with very little action and usually adds quite a bit to the impact of the film. From day one, Larry hopes that he'll change the way you see film and I can faithfully say that by the last class, he certainly accomplishes that goal.\nAs other reviewers have stated, it's the TAs and not Prof. Engel that grades your work, so getting a bad TA can be deadly - then again that can happen in your other classes as well. If you're not interested in majoring in film, then just Pass-Fail the class - if you are, then just be sure to follow up with your TA and let him or her know about your interest in cinema.\nGoing to class every day was a pleasure unmatched by the rest of my schedule.\nWorkload:\nA deceptively large amount of reading. If you're in a bind, you can skip over the Cook book (history) and read the extremely interesting Theory book that will basically help you with the essays. (Although the Cook book is better). If you do that, then there's not a lot of work.\nI had to write 3 1,000 word essays in 1 week (not as bad as it looks)\nA 1,000 word essay. 10 - 15 page final paper.\nFilm journals.\nYes, there is a lot of work, but if you like film enough, it won't be bad.\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "May 19, 2004",
            "review_content": "\nLarry Engel is a professor with great potential who somehow insists on being boring. He doesn't really \"teach\" so much as he projects movies and draws out a cliche' or two before and after the films, drawn straight out of the readings. However, in the one or two instances when he does analyze a scene he has his moments of brilliance - unfortunately, these moments were rare. \nThe class is not hard, the reading is vastly doable, and sitting in a room every week watching movies (most of which are great, except for his odd choice of the bride of frankenstein) can barely be considered a torture. Even if you are taking the class for kicks and do not intend to be a film major, you can easily both have fun and get an A. \nThe man has an obsession with Alain Resnais. When I took his class, he used three Alain Resnais movies as the \"main movie\" for the French New Wave class, the Experimentalist/Avantguard film class and the Documentary Class. While Resnais is a highly eminent director, his work can hardly be considered \"emblematic\" for each of those three movements/traditions ... so at the end of the semester, do yourself a favour and watch more films to get a broader picture of the New Wave and Experimentalist film. \nBasically: Fun Class because of the Material, but a Passive and Mediocre Professor\nWorkload:\nWeekly readings that seem heavy but the theorists are fun, and you can skim the \"history\" textbook - goes by quickly. Three take home exams. \"Journal\" entries for each week which are a pain but not particularly difficult. \n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "January 20, 2004",
            "review_content": "\nI agree with most of the positive reviews below.  I want to add that I took this course to fulfill a general requirement and I am in no way a film major and knew nothing about film prior to the course, and I loved it.  You can pick and choose what to take away from this course.  For my midterm and finals I was able to analyze the films as literature, or socially or politically, and I didn't need to learn much about camera angles or lighting or the Deconstructor or any of that weird stuff that only Film majors like.  (Though I could have learned this stuff if I had wanted to, simply by not zoning out when he talked about it during class.) Don't be scared away from this course if you're not a Film major!\nBeware, though, of falling asleep during the movies.  They're all very good and interesting, but it's a dark room, and if you're already tired... let's just say you should bring a caffienated beverage to class...\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "January 18, 2004",
            "review_content": "\nIncredible course, incredible instructor.  He changed my perspective on film, tv, and life in general to some extent.\nHe had many fascinating stories about his adventures filming for the discovery channel and others. He also seemed to really care about the philosophical issues of film as art. He asked really thought provoking questions and showed, for the most part, very interesting films.\nWorkload:\nweekly reading, but it's not necessary to do all of it. takehome midterm about 3000 words, and final paper or video project (choice)\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "January 11, 2004",
            "review_content": "\nEveryone should take this class with Larry regardless of whether one is a film major or not because you learn so much about the nature of media and film.  When I registered for this class I originally planned to drop it because I didn't have room in my schedule, but after attending the first lecture (I hesitate to use that term because he encourages so much discussion in class), I was hooked.  I learned more in the first class about filmmaking than I learned in some of my other classes all year.  While it may not be your cup of tea when Larry speaks over the film and points out the filmmakersÂ’ decisions, I found it to be a very effective method of teaching.  Larry does a great job of choosing films to show that demonstrate the different styles of documentary and gears much of the class toward examining how we differentiate between fiction and nonfiction film.  He is extraordinarily personable and I particularly enjoyed his tales of real life experiences he has had while filming.  Larry is very honest with his students, respects them, and lets them know what he really thinks.  He can sometimes be cynical about the nature of film and people, but ultimately it comes across that he loves this visual medium.  The first class, Larry started by pointing a camera at us and projecting the image on the board.  He then asked rhetorically why we were all watching him lecture on screen instead of in person.  Larry explained we love to have the story told for us and when a camera frames the shot it tells the story.  This was a perfect Larry-ism, a sort of statement that really got you thinking about the nature of film.  While I recommend any class that Larry teaches, I donÂ’t think I would have had as good a time in the intro to film class with him because it has a more specific intent and syllabus of theory to convey.  LarryÂ’s great when he has more freedom to teach what he wants. Ultimately, a great experience with a great and wonderfully laid back teacher.\nWorkload:\nA journal of notes that you take during the class (to get a check plus make sure you write reactions separately from the notes), a take home midterm (4 essay questions at about 1200 words each. extra credit for turning it in early), a final assigned at the beginning of the semester (either a 15 page paper--but i have a feeling that page # wasn't iron-clad--or you could make a short film about one topic in three different filmic styles we learned about in class and write a 3-5 page paper about the experience.  For the film you could work with a partner.  The was a screening for the films).\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "December 18, 2003",
            "review_content": "\nLarry's quite a character... quirky, opinionated as anything, but pretty cool.  If you're anything like me, you'll find the first half of the class pretty dry, with all the silent films and such.  (Larry will sit in the theater and cry out things like, \"Brilliant!\" at seemingly random bits that clearly aren't random but brilliant.)  However, the second half of the class-- films like \"Primary,\" \"High School,\" and \"The Thin Blue Line\"-- will really stay with you.  Film discussion sections are fun and helpful sometimes when it comes to understanding the readings but more often than not, it's just about batting around opinions about the films and ideas for films for a half hour.  (This is not a production class, but many of us made documentaries for the final project.)  My T.A. Suzi is the most incredible girl-- funny, helpful, and cool.  Try to end up in her discussion group if you can.\nSo yes, I'd recommend this class if only for the awesome films you watch second half of the semester.  Yes.\nWorkload:\nNot bad at all... there are readings, but the only time you're really going to need to do those is the first half of the semester for when you do the take-home midterm.  Midterm is seriously no sweat.  Take notes in class, and you're in a good place.  The final is either making a documentary or writing a super-long paper, which is time-consuming, but considering how little work the actual class is, it's worth it.\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "August 09, 2003",
            "review_content": "\nLarry is so passionate about film, about documentaries, about his work, and about the class. The films are great, the discussions are good when he gets to expound on different ideas, and Larry is very personable and approachable. TA's definitely decide your grades so watch out for that. Otherwise, class is awesome and Larry is a very talented director/producer and professor.\nWorkload:\nPapers and notes\n"
        },
        {
            "course_name": "Intro to the THEORY of Film",
            "review_date": "December 08, 2002",
            "review_content": "\nThis is NOT an introductory film class. If you are looking for in intro to film class you should be taking American Film History 1930-1960. This is a theory class but for some reason gets the lowest course number. It is very hard and should only be endured if necessary for you major. Professor Engel has an interesting perspective. He is certainly pessimistic but since you almost certainly will not agree with him it will only broaden your knowledge. You must do the readings before the class for which they are assigned, especially the Cook book. He expects you to know that information very well and will not allow you to use it on tests. Instead he will expect you to have a moderate understanding of the theorists who will be utterly incomprehensible without a basic knowledge of film history which you will get from the Cook book. The primary book for the course is Film Theory and Criticism.\nWorkload:\nTwo take home exams consisting of two, 1000 word essays each. One term paper on any topic of your choosing as long as it is approved 8-12 pages.\n"
        },
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "December 08, 2002",
            "review_content": "\nDisclaimer: You should only take this class if you want to be a film major. Larry, the professor, announces this the first few days of class, and it is entirely true. This is not neccessarily a hard elective, but you will look at films in new and powerful ways. Anyone should appreciate the amount you learn in this class, but only other film majors who took it with me actually did. This is essentially Film Hum. Upon entering the class, persevere through the initial \"go away\" classes where Larry tells everyone to leave because you're going to hate it. Stay in class and learn to see films in a new way. I came to Columbia College as an incredibly well (privately) artistically educated student as I ran my high school's Art club and Film Forum that nearly, solely showcased experimental films. Most of my friends and family told me that I was way, way, way too critical of films. I knew movies like Minority Report, Annie Hall, and others were terrible trash. In Larry, I found a kindred spirit who made me even more critical and analytical of films. Instead of just critiquing and analyzing films in terms of individual images and narrative content, we learned how to analyze films at their unique core: sequences of moving images. The lectures and the readings skim over film history and mainly focus on cinematic techniques and theory. Every lecture is a new discovery, and Larry brings a wonderfully and sorely needed critical perspective to these films. With the possible exception of nouvelle vague films, he is never entirely complementary or critical of a certain film genre or film. He realizes early films have problems but that they also display their potential and the basics of filmic techniques. He acknowledges certain films that are brilliantly constructed and gives those due credit. As he intertwines his lectures with film theory, the class and film showings generally follow the outline of film history from Lumiere to Godard. Although he is out of town quite a bit, he and the T.A.'s are always responsive to questions and helpful with any problems. Larry and the T.A.'s even invite the entire class to Nacho Mama's several times throughout the semester! Last but certainly not least is the Deconstructor. An incredibly invaluable and underrated tool, the Deconstructor allows students to \"deconstruct\" film scenes shot by shot and analyze them through various cinematic qualities. Do not listen to those who say this is like science or math. Film students have been analyzing films shot by shot ever since the early 20th century days of the Russian film school. With the Deconstructor, students take part in this grand tradition in an accessible and painless manner. The people who say the Deconstructor reveals nothing about film say that literary devices reveal nothing about literature, that music keys and theory reveal nothing about music, and that semiology as well as artistic theory reveal nothing about the visual arts. Sometimes a piece of art is just a piece of art, and sometimes a piece of art has an underlying grammer or theory that unlocks untold ideas. In Larry's class, you unlock those ideas. My only qualm with the class is that only two lectures are dedicated to experimental and documentary films. DO NOT MISS THESE LAST TWO CLASSES!!!! Stay at Columbia for Thanksgiving and hand in your paper late because they are amazing. If you want to take a class in which you will learn and have fun, take Intro. to Film with Larry. EXCELLENT JOURNEY!!!!\nWorkload:\nGrading is done by the T.A.'s who generally seem to lead interesting and slightly off-topical/topical discussion sections. Don't worry, you'll have a great time and learn something that wasn't necessarily discussed in class or in the readings. The workload is extraordinarily light. Readings are heavy, Heavy, and HEAVY, but they are incredibly interesting and thought provoking. If you don't want to do them, you don't have to read as all assignments are take-home. Two take-home exams, the first consists of two 1000 word essays and a scene analysis using the Deconstructor. The second consists of another 1000 word essay and a rather brief scene analysis not using the Deconstructor. The final is essentially left up to each individual student. Make a film, write a paper, or Deconstruct a scene; it's all great fun so it doesn't matter that it takes a little time.\n"
        },
        {
            "course_name": "Introduction to Film Studies",
            "review_date": "November 20, 2002",
            "review_content": "\nI came to Columbia University with the intention of majoring in film. Alas, I took the Intro to Film course taught by Larry Engel. Dare I say this was the worst experience of my life. He rambles for hours, especially when he has a new made-for-TV movie in the works. He has the ability to ruin the most touching and affecting scenes with his stream-of-consciousness commentary. Additionally, Larry hates everything. He is one of those igonorant intellectualls who believes that old is good. This is coming from a man who claims to never go to the movies anymore. He will lull you to sleep with his stories and self-aggrandizing anecdotes. Stay Away. Stay Far Away. Not only his teaching style is bad, you will learn nothing about the history of the movies, and his lectures on the meaning of films are completely vague and superficial. If you want to get anything out of the class you must do the reading. And there is a lot of it. He teaches movies as if it were math. You will actually have to graph scenes of movies, and analyze them in an essay. Depending on your TA, the discussion sections vary in quality. HATE is the only word that can describe my feeling. If you are interested in Film Studies, take the course offered through the English department at Barnard.\nWorkload:\n2 Midterm essays - easy but painstaking. A final 10-page paper.\n"
        },
        {
            "course_name": "Intro to the study and theory of film",
            "review_date": "November 07, 2002",
            "review_content": "\nThis is the second worst class I have ever taken. The only redeeming quality of the class was that half of the films he showed in class (when he wasn't shouting over them) were pretty good. Larry is an accomplished documentary filmmaker. He obviously isn't doing that well or he wouldn't be \"teaching.\" He ruins movies. He ignores narrative in exchange for analyzing the \"syntax\" and \"grammar\" of film. It's crap. He had a teacher when he went to Columbia named Stefan Sharff. This man is the basis for his entire spectrum of ideas on film. Engel doesn't have a creative thread in his body. In my opinion, he rips off Sharff's book in class all the time. He assigns tons of reading and gives the worst essay questions for exams ever. I feel so bad for anyone who takes this class after this semester because they will have to depend even more on this horrible film analysis tool called the Deconstructor. This crappy tool takes apart movies and analyzes them based on a number of pathetic aspects that really are just a figment of Larry's imagination. Basically, this class sucks. I was going to be a film major until I took it. Now I am going to major in Biology because at least I won't ever have to deal with Larry Engel again.\nWorkload:\n2 take home essay exams (8-12 pages each) and a final \"project\", basically another 10 page paper. Garbage. Tons of reading that no one ever does and there is no need to, they don't relate to class at all.\n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "December 17, 2001",
            "review_content": "\nThe pessimist sees a disaster of a class where the projection equiptment always breaks, all the undergrad grading is done by silly TA's, the the syllabus seems to have no rhyme or reason, and the professor is overwhelmingly arrogant with his impromptu in-class discussions and long lectures on his personal life and career. The optimist sees that rarest of rarities-- a film department class that makes you think. Engel is smart and thinks about how he thinks about film, and some of his off-the-cuff lectures were great. Particularily his discussion of media coverage of Sept. 11 revealed an intelligence and perspective that most of us were totally uncapable of two days later. The class structure was a mess, I got no sense of the history, and I often felt that I would have been better off just showing up and auditing four or five times that semester. But still, it made me think, and if you're gonna be a lame-ass film major that might be a change of pace.\n"
        },
        {
            "course_name": "Introduction to Film Studies",
            "review_date": "December 31, 1999",
            "review_content": "\nSome like him, others don't. He tends to ramble a lot. Slightly arrogant. He assigns an extreme amount of reading, but by the end of the semester, he even stops reading it. Midterm and Final are both take home. Much of how much you like this course depends on your TA.\n"
        },
        {
            "course_name": "Analysis of Film Language II",
            "review_date": "December 31, 1999",
            "review_content": "\nLike many courses in the Film department the titles don't always jive with the subject matter. There is no Analysis of Film Language I. Regardless, if you want to make films, forget all the other courses and take this one (II). Save your money, and major in someting else. Engel's course is the only one you'll need to understand film. Engel teaches you how to read a film. Like a surgeon he takes each film and clinically dissects it, then he shows you how each one works. (You get none of the pointless high-falutin hot air that Sarris so ceremoniously delivers from his Learish throne.) But Engel, on the other hand, is like Moses taking you to the mountain. You learn what the biblical phrase \"I was once blind, but now I can see,\" means. I was lucky when I took the course; it was small and there wasn't another vapid grad student to suffer in the endless rounds of section meetings.\nWorkload:\nThere are two papers and a scene analysis at the end of the term. The scene analysis is fun because you get to do what Larry's been doing (teaching) all semester long. If you don't get the itch or bug to want to make a film, then you were meant for Econ.\n"
        }
    ]
}