{
    "prof_info": [
        {
            "prof_name": "Julia Sirmons",
            "prof_id": 13204,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 06, 2016",
            "review_content": "\nJulia is a bit disorganized sometimes but really cool and worth it. At first, you'll probably be annoyed because P1 is so restrictive by nature of P1 and the grading is a bit harsher (Julia lightens up as the semester goes on, so don't stress about it, even if you get something in the B range), but by the end, if you put the work in, you'll be totally fine. \nOne of the fun things about this class is that in our section we got a lot of choices to write about whatever we wanted as long as it loosely fit in with the readings, so you can find a way to connect essays to whatever you're interested in. If you're not interested in anything on the planet, then yes, you'll be bored, but if you've got literally any interests at all, you'll be able to find something that interests you to write about and it won't be that hard. Most of the readings are really engaging, so that part of the class is good too.\nDefinitely GO TO MEETINGS!! Julia's a great person to talk to and it will make edits on essays so much easier than just paper feedback. I thought I'd really hate this class but I really like it. A lot of people hate UW as a thing, which makes me really thankful I had Julia. Definitely worth switching into this section, if you're UW class shopping and want a prof who's engaging, relatable, and will improve your writing. \nWorkload:\nUsual for UW. 3 essays and 1 opinion piece. It might seem like a lot of work if you hate writing but you can make it fun if you take the time to find topics you like. Reading for homework is totally manageable. The Butler reading may make you want to bang your head against a wall in frustration, but you'll understand it by the end of class discussion and Julia is good at explaining things if you're lost. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 25, 2016",
            "review_content": "\nJulia was awesome. She pushed me to be a better writer and thinker. \nHer feedback on all my essays was extremely detailed, and also went way beyond simple line edits and asked me to clarify my thinking or expand on different ideas. I love how I could always meet with Julia about feedback, and she was always able to discuss things I found confusing (e.g. a Butler essay we read). Trust me, meet with her weekly! It will drastically improve the quality of your writing. Plus, I promise you she's easy to talk to and just a really interesting, kind person, even though it might seem scary to talk to a professor at first. \nI've never been comfortable with analytical writing before this class; I came away feeling comfortable and, dare I say, enjoying it. For reference, I don't care about grades, but I think it's relevant to point out I've never gotten an A-range grade on an analytical essay in my entire life, counting high school, so I really, really didn't have a grasp on what I was doing, nor did I look forward to analytical writing before because I felt like I was worthless at it. And to be clear, I'm not saying Julia is an easy grader — I just felt more comfortable with what I was doing, and enjoyed writing what I did regardless of the grades I ended up getting. \nJulia also led thoughtful class discussions that helped me better understand or analyze readings. She created a great balance between lectures and engaging with us as a class. Every time she had a Powerpoint, a lot of time would be spent in discussing in small groups to interact more with the material so we weren't just staring at slides. Julia was extremely easy to related to and was comfortable cracking jokes and laughing with us, so it was easy to interact with her and at the same time, get amazing quality feedback on all our work. \nFYI: the readings are interesting and sometimes really intense, but she's really good at supplying trigger warnings if you need them (ask her!).\nWorkload:\nSame as a normal UW class (4 essays, including 1 close reading, 1 comparative piece, 1 research essay, and 1 op/ed). Also daily readings from 10-40 pages, 1 movie, and semi-optional (trust me, go to them) weekly meetings about drafts. \n"
        }
    ]
}