{
    "prof_info": [
        {
            "prof_name": "Jonathan King",
            "prof_id": 517,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 10, 2005",
            "review_content": "\nTo sum up the class in one word: frustrating.  \nI came into Music Hum with a mixed core experience:  I've had some really hard teachers that were great nonetheless, and others who were not so great but were less demanding and relatively easy graders.  I figured that Toby would be one or the other.  I was wrong.\nFirst, let me say that \"oh, he's just a grad student\" is no excuse.  In high school all of my teachers were either getting their masters or had their masters and were competent in teaching thirty-two students.  Music Hum is - for all intents and purposes - no different than a high school class in the sense that you only reference one book (Listen).  Yet Toby could not teach seventeen students.  \nThe greatest flaws in his teaching were attendance and lack of preparedness.  On the original syllabus he wrote that missing or coming late to classes would result in a lower grade.  Somehow, he didn't apply this to himself.  During the course of the semester, Toby failed to attend four classes - and only once gave ample notice of his absence.  As a result, the syllabus got really messed up, and he promised to write out a new one while giving us day-to-day assignments for the time being.  He then stopped giving us daily assignments but never gave us a new syllabus.  He originally also said that he would just add classes during study week.  Since he couldn't really add 4 classes during a 2 day week he instead added none and offered to extend his office hours which were pretty much nonexistant from the getgo.  To compensate, we skipped the entire Jazz section, did all of opera in one day, and only skimmed 20th century music.  \nIn addition to missing classes, he was never on time.  Our class would always be waiting in the hallway while the other class on our floor began, then he would come in with his coffee and have to spend the next few minutes turning on his computer, getting settled, etc.  Instead of really teaching us anything aside from a little bit of biography of each composer (our extent of music theory was duple & triple meter) he would just ramble off quotes that he wrote on what looked to be an old flyer.  And then make some Star Wars or whatever reference.\nSo you may say that he's \"laid back\" in this sense.  But his midterm and final were the most tedious exams I think I've ever taken here.  First off, his idea of us studying was making an index card for each piece with elements of the piece, yet a lot of the questions about the pieces were not about its musical content but about the history of the piece.  For our midterm, he tried \"shortening\" an old exam from when Music Hum classes ran 2 hours but we all ran out of time about 10 minutes into the essay portion.  He also had a problem writing straightforward short answer questions.  For example, during our final we had an ID from a portion of Aida to which a girl in our class asked \"in the question are you referring to the entire piece (as in the whole opera) or just the segment we listened to.\"  He looked bewildered for a second and to save face said \"I left it purposely ambiguous.\"  Ambiguity was rampant on that final.  \nIn addition to the midterm and final we had two concert reports.  He gave us no guidelines on the first one, but then graded them pretty harshly saying \"oh you should have approached it this way, or that way, or done this, or that.\"  I spent a lot of time on the reports, to the point that my friends who have taken Music Hum and were apparently able to do a concert report without much prep work thought that I was in an advanced music history course, and I didn't mind having to spend several days between the prep work and biography and all the other facets that he required - after all, I was able to learn a lot about a particular piece and composer, even if he/she weren't on the syllabus.  What was bothersome though, is although the papers were turned in nearly a month prior, he graded them during our finals - taking about 3-5 minutes per paper.  For all I know, other profs devote the same amount of time on their papers, but it's really disconcerting to watch your teacher care so little about something you devoted a lot of time to.  And if you want a grade on a paper/test in a timely fashion, then Toby is not for you - it took about 3+ weeks turnaround to get back our concert reports, midterm, and FINAL GRADE.  Yes, that's right, we took our final on December 22 and got our grades on January 11.   (Doesn't make too much sense to spend the equivalent of a day and a half to grade each paper when it only takes five minutes to read a report).\nFinally, his accessibility.  His office hours were at Hungarian Pastry Shop but he didn't have \"set\" ones - instead you had to consult with him about a time to meet.  He cancelled from time to time, and also didn't respond to emails too quickly (or at all).  Also, having office hours at a pastry shop may sound cool but is really awkward.  The place is a cafe and the atmosphere is really not conducive to having discussions about your work.\nToby is a charmer.  He'll make references that will make the class laugh, say funny things about a composer, jokingly diss modern pop music, and tote an iPod and cup of coffee like every other Columbian.  But charming teacher is only good if the teacher can teach, which Toby couldn't.  This may seem like a long rant from a student who did poorly, but I did fine in the class.  Its just disappointing that Columbia prides itself in the Core and then hires teachers like Toby in which case the students have to learn all of the course material out of the required text book.\nWorkload:\n2 concert reports - make a bluegrass reference and you'll do fine, midterm, final. Nightly reading/listening assignments (sometimes with a written component) although we only had 2 written components all semester and our reading assignments were all off once he missed classes.  (Although we were responsible for all of the material minus Jazz on the final).  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 07, 2005",
            "review_content": "\nIf you're looking for a laid-back music-hum class, Toby's is a good choice. Toby is very knowledgable about the material and makes class discussions very comfortable. I don't really know what I was looking for in the class but I ended up really enjoying it - and also learning a good amount about music. Despite having to make the 9 am class, overall Toby was a great teacher. If you can get in his class, go for it. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 10, 2004",
            "review_content": "\nHe's a nice guy, and sometimes makes funny references.  That's about the only good thing I can say about him.  He missed a bunch of classes... once he didn't give us any warning, once he e-mailed us cancelling after 1am.  While that may not be a big deal if the class wasn't at 9am, it was a pain when you'd wake up early (esp if you didn't check your email late at night) for class only to find out it was cancelled.  As a result, the syllabus got very messed up and he never made amends to it as he promised.  He usually came in late and somewhat unprepared.  I felt like I learned nothing in the class, and he was pretty merciless when he came to telling us what we needed to know for the midterm.  In addition, he basically gave us his Spring 2002 midterm, when the class was 2 hours long, not 1:15 and we ran out of time when it came to the essay section.  He also repeatedly walked out during the midterm which was really unhelpful.  Maybe he was good a few years ago, but he clearly did not have the time & didn't make the effort for our class, and it really screwed over our section.\nWorkload:\n2 concert reports (1 concert has to be free) ~5-7 pages... not too easily graded although it's possible to get an A.  Midterm (about 6 people got in the 90s).  Final.  Listening exercises which were supposed to go on every week, ended up getting 2 in September and that's it.  Daily assignments when he'd assign them (he thought we could read his mind).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 20, 2003",
            "review_content": "\nToby is good instructor overall that is hampered by the poor materials that the Music Hum. course is taught with.  He tries to be accessible to students and is pretty funny at times.  \nThe learning experience probably varies with your own personal background in music.  You will probably meet some people completely unfamiliar with anything he says, and others who dominate the material (this writer included  ^_^ ).\nWorkload:\nA few listening excersizes, Concert Paper, Midterm, Final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 06, 2002",
            "review_content": "\nWhat a great professor! He's very knowledgeable, funny, and makes music a fascinating study. I enjoyed that he was down to earth and focused more on the periods of music we were studying than memorizing smaller details. Class lectures are well-prepared, moving more towards student interaction and participation as class moves forward, which can be challenging. Highly recommended.\nWorkload:\nModerate to Full. Normal listening exercises. Tests require Music ID's and some mystery identifications. One essay. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 06, 2002",
            "review_content": "\nWhat a great professor! He's very knowledgeable, funny, and makes music a fascinating study. I enjoyed that he was down to earth and focused more on the periods of music we were studying than memorizing smaller details. Class lectures are well-prepared, moving more towards student interaction and participation as class moves forward, which can be challenging. Highly recommended.\nWorkload:\nModerate to Full. Normal listening exercises. Tests require Music ID's and some mystery identifications. One essay. \n"
        }
    ]
}