{
    "prof_info": [
        {
            "prof_name": "Robert A. Maguire",
            "prof_id": 785,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 30, 2001",
            "review_content": "\nWhat a nice man!! Prof. Maguire was just one of the sweetest men i've ever met. He had a very laid-back attitude, and knew a lot about the material we read. I liked the way class was structured: first, Prof. Maguire would give background material on what we were reading, then a student would give a presentation, then we had a 10 minute break which we all loved and appreciated, and then we would have a discussion for the rest of the class. It did get a bit boring at times, but I really loved this class and I learned a lot. By the end of the second semester with Prof. Maguire, I really learned how to read quickly and analyze a difficult book or passage. It became easy and fun. \nWorkload:\nWe had about 2-3 quizes which he only counted if they helped your grade. These quizes were great because they tested us on less material than the midterm or final - usually just 3 books - and by the time we had the midterm, I really didnt need to study that much. They usually just tested us on background material, factual stuff, and sometimes we also had passage i.d's on them and mini essays. They also gave us more practice for the final - which is the same for everyone. We had 1-2 papers, which we were allowed to revise if we wanted to. He was very lenient with late submissions and his policy is \"better late than never.\" We also had short (a paragraph or two) comments to write every class about the readings. These were great because we could write about whatever interested us in the book and were very easy to b.s. They also prepared me well for class because they forced me to read the book more carefully and really think about the material.\n"
        }
    ]
}