{
    "prof_info": [
        {
            "prof_name": "Marc Spiegelman",
            "prof_id": 1689,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 03, 2012",
            "review_content": "\nIn theory, this course is awesome.  It gets you through Differential Equations and Linear Algebra in only a semester.\nThe reality is that while Marc Spiegelman is one of the nicest guys I've ever met, he's extremely scatterbrained.  When proceeding through lecture, he VERY frequently steps a few steps back finds a mistake and restarts.  He often goes on tangents that make the material unnecessarily complex.\nThat said, the course does use Gilbert Strang's Linear Algebra text as \"backup\"...the Strang lectures are awesome.  Zill is pretty dense and sometimes misguided, but is probably a good life-long resource for many engineers.\nFirst midterm was easy, second one was not...there was more theory than I had expected.\nWorkload:\nJust right.  Some of the problem sets are tedious and time consuming, but in comparison to real EE courses, they're not that bad.  A little more work than the Calc1-4 problem sets.\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "February 20, 2012",
            "review_content": "\nSpring 2011 was the first semester there were classes held in Noco 501. Unfortunately, I found myself expending more effort trying to stay awake than learning the material. However, I don't think this is necessarily a reflection of Spiegelman's charisma. It's THAT ROOM. So temperate, lighting so warm, chairs so comfy...\nI actually felt kind of bad for Spiegelman, because people were falling asleep left and right. I even heard him mutter once, 'asleep in the first row...'\nWorkload:\nbring caffeine...that sometimes worked for me. \n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 23, 2011",
            "review_content": "\nGREAT TEACHER! He's very witty, smart, fun, blahblahbalhblah. I really recommend meeting him outside office hours, he gives great advice! The material in the class isn't really bad at all, a bit of work and attention into it and you should be completely fine! I have to highlight that Spiegelman was just great. It's a mix of ODEs and Linear Algebra. I feel I learned a good amount of each necessary to do basic things... I don't know (and don't think) if I will really need DE or Linear Algebra in my career (and I hope I don't), so for now I want to say that you should take this class instead of ODEs and Linear Algebra separately. \nThe only problem I found with this class is the grading. There are 5 quizzes, and if you can do/understand the homeworks (even if you use cramster, WHICH WAS GREAT!), you will do well on at least 4 of them (since he drops one). Everyone tended to do well, so the mean was continuously high (like 8.5-9). In addition, since everyone got the answers from cramster in the homeworks (or from each other), the average for the hws was pretty much an almost perfect score in all of them. The first thing is that if you don't do well in one of these, IT WILL MOST LIKELY hurt your grade at the end (in order to do well, doing really well in these is a requisite). What I disliked the most is that because of this effect, since the variance in these quizzes and hws was so ridiculously small and the averages were so high, is that the final exam had a ridiculous amount of weight. I had almost perfect scores on all my quizzes and got perfect scores on all the hws, and I felt I understood the material very well (and still do). I had a pretty bad amount of finals and they were all right next to each other, giving me a really rough finals week. I ended up messing up and it hurt me really badly, when I have friends that only had 2-3 finals to study for and were able to just perform better... I don't know, eh, I'm just really disappointed that in the end there's so much weight on the final...\nREGARDLESS of this thing I deem a problem, Spiegelman is just cool as heck.\n\nWorkload:\nAlmost weekly homeworks (most answers are on cramster).\n"
        },
        {
            "course_name": "Introduction to Applied Mathematics",
            "review_date": "May 16, 2010",
            "review_content": "\nFirst off, everything that has been said about Professor Spiegelman is true.  He's a great professor who truly does care about his students.  His lectures are good (although this was his first semester teaching this course so it was apparent he was getting his bearings) and he's great in office hours.  Future sections of this course under him will only get better.\nThe class, on the other hand, leaves a bit to be desired.  It essentially tries to cover both ODEs and the basics of Linear Algebra in one semester.  While I feel like I've walked away with a working basic understanding of both, I also find myself left a bit wanting for more depth, which pretty much means I'd have to take both a semester of ODEs and a semester of Linear Algebra, which then renders this class a bit of a waste.\nUltimately, I think it would be best if the applied math department sat down and rethought the introductory curriculum.  I think this class might be a result of some obscure ABET requirement.  That's fine, but I think a yearlong two semester \"Introduction to Linear Systems\" core block that blended a thorough treatment of ODEs (including laplace transforms), Linear Algebra and an introduction to Linear Systems and discretization/numerics would be much more useful.  (He tries to weave Matlab in a bit, but in a yearlong course, a lightweight lab could be thrown in...)\nThat said, if you're taking the class, you're probably in SEAS, which means you have to.\nTo sum up Spiegelman, on the last day of class he said: \"If you ever have any questions about material related to the material in this course, come see me!  I'll be here, they gave me tenure hehehe..\"  Really, that's about the best you can ever ask for from a professor.\n\nWorkload:\nQuasi weekly problem sets of varying difficulty.  6 20 minute quizzes in lieu of midterms.  Fairly difficult final (open book/notes/anything-on-paper, although I found that I was reluctant to pull the book out during the final, even to my own detriment).\n"
        },
        {
            "course_name": "Applied Math (Linear Algebra)",
            "review_date": "December 18, 2008",
            "review_content": "\nProfessor Spiegelman is wonderful! Quirky, down-to-earth, in LOVE with his subject, solid lecturer... The only qualms I had were that he sometimes goes off on tangents, but that's not really bad when you want to relax a little. Professor Spiegelman showed me how awesome and cool linear algebra can be. DEFINITELY recommended over the math department's proof-heavy version. Spiegelman rocks.\nWorkload:\nHomeworks every week... make sure you check the homework page often because he had a homework due for us the day after election break AND the day after classes ended! Two quizzes/midterms and a final, not difficult if you've done the homework and with the help of his PDF study guides.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "April 13, 2008",
            "review_content": "\nSo, initially the class looked really good because Spiegelman is a nice guy (VERY BUSY though outside of class) and easy to talk to and ask questions.\nHowever, I ended up not going to class for pretty much half of the semester mostly because I got a lot more out of Strang's book than I did from lecture. It was also the added complication of the Smart Board and premade slides which made it very difficult to take notes because he moved so fast.\nAlso, watching some of Strang's lectures was pretty useful.\nAll in all, a relatively straightforward math class. Read the book and PRACTICE problems and you'll do fine.\nWorkload:\n2 Midterms, 1 Final. Pressed for time on all tests - can get long. Homework is from the book by Strang and can also take a while but is not difficult.\n"
        },
        {
            "course_name": "Applied Math (Linear Algebra)",
            "review_date": "December 30, 2005",
            "review_content": "\nSpiegelman is one of the best math professors I have encountered at columbia. He is very laid back, knows the material inside out and absolutely loves it, and he is very approachable. The material in the class is very straight forward and is made even easier by Spiegelman's teaching. Though he may digress or get ahead of himself at times, he usually explains things in an organized manner and will try to make sure people get it by explaining it over if he feels it didnt get through the first time. The book used is Gilbert Strang's, a professor at MIT who has posted lectures online, however it is simply a complete waste of time to watch any of these. Spiegelman is a great teacher and it is better to go to class than to have to sit through video tapes of Strang droning on. Bottom line, great professor, straightforward material makes for a good class.\nWorkload:\nWeekly problem sets, 10 total, worth 20%, one midterm worth 35%, and a final worth 45%.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 05, 2005",
            "review_content": "\nBy far, the BEST!!!  Math has NEVER been easier, and the professor was really really good.  (One good hint about this class:  there are a couple lectures that I found a bit challenging:  when he gets to talking about subspaces, and you don't really understand what he's talking about, don't worry...no one really understood the first time.  That's when you start going to MIT's Strang website and start watching his online lectures which are just fantastic).  \nI did the problem sets (~2 hours a week), and watched about 10 of Strang's (author of the book at MIT)  online lectures, and easity aced the class.\nWorkload:\nabout 2 focused hours/week.  remember, focus focus focus!!!  \n"
        },
        {
            "course_name": "Applied Mathematics I",
            "review_date": "January 03, 2005",
            "review_content": "\nProf. Spiegelman was AWESOME!  Definitely one of the best professors I've had for a math class- and a real nice guy too.  He explains everything relatively slowly, answers questions very clearly, does lots of examples in class  too.   I always found that class was helpful, although some of my peers did not always agree.  However, if you're in the once-a-week class, it really does get grueling.  \nOn the other hand, one problem with Prof. Spiegelman is that  he was out of town for many classes, which put us behind and messed up the test schedule.  (I guess he's really important... try reading his CV- it's on his website.)  So, for our class, we had one midterm and a final worth 60% of our grade.  Yeah, needless to say, I think many of us were studying our butts off for that final...\nWorkload:\nOne pset/week, 2 midterms, final (usually)\n"
        },
        {
            "course_name": "Applied Mathematics I",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Spiegelman was my favorite professor this whole semester. I had lecture with him once a week for three hours. I never thought that I'd be able to sit through a whole three hour lecture and stay awake but I did because he is awesome. He makes linear algebra interesting and easy. Lecture was organized very well, he'd start by outlining the concept and then doing example problems and sometimes he'd show us some slides about the crazy ways in which linear algebra is applied. The book he used was great. He never put concepts on the tests that weren't covered in the book. The tests were always straightforward, if you can do the hw and know the concepts you'll probably do pretty well. The TAs were awesome and always willing to help with HW and questions. Professor Spiegelman was also very approachable during office hours. He really cares about how students do in his class. When he had to cancel the second midterm, he calculated each student's grade with a bunch of different algorithms and ended up giving each student the best possible score. One time he told me that he wishes he could just give everyone A's because it would make his job easier. I'm with him on that one, but going through the trouble to make up algorithms that put extra weight on each individual's best grades really shows his dedication and awesomeness.\nWorkload:\nWeekly problem set (problems come from book and TAs are so willing to help out), two midterms (if all goes well), and a final (harder than the midterm but still really fair and straight forward).\n"
        },
        {
            "course_name": "Applied Math (Linear Algebra)",
            "review_date": "December 27, 2004",
            "review_content": "\nProf. Spiegelman is an ebullient and buoyant lecturer. His class is never dull and he succeeds in turning an otherwise dry subject into an something that's passably tolerable.\nThe key to do well in this class is to do all homework problems by yourself, and memorize those formulas well before the tests. The tests are all very mechanical and calculation-intensive, so if you have those formulas engrossed in my mind, then you'll do fine. Everything is straight forward, with very few tricky questions.\nAll in all, a very able professor and a very reasonable class, highly recommended.\nWorkload:\nweekly problem sets, 1 midterm 1 final, both straightforward.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 22, 2004",
            "review_content": "\nI took linear algebra with him that met once a week from 4:10 to 7:00.  Three hours is pretty brutal, but the class was pretty good.  Some of the material is difficult to grasp, but that's linear algebra.  He does a very good job of keeping the class interesting, and I found him a good teacher.  I learned a lot about linear algebra.  He is not easy though, as I found the tests very difficult.\nWorkload:\nWeekly problem sets, about an hour and a half to two hours each (getting progressively harder throughout the semester).  Hard midterm and even harder final. (Supposed to have 2 midterms, but he canceled the second one and made the final worth 60%)\n"
        },
        {
            "course_name": "Applied Mathematics I",
            "review_date": "July 10, 2003",
            "review_content": "\nHe just got that teaching award this year, and I think he totally deserves it. He was actually able to make linear algebra not boring, and he danced for us when we were all falling asleep. If you have to take applied math somewhere, take his class.\nWorkload:\nHW every week. \n"
        }
    ]
}