{
    "prof_info": [
        {
            "prof_name": "Helene Foley",
            "prof_id": 1548,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Classical Myth",
            "review_date": "May 14, 2015",
            "review_content": "\nI love mythology in general and entered this class very familiar with the material, and with an very deep respect for Professor Foley as the foremost expert on The Hymn to Demeter. However, although she is a very nice teacher and clearly cares an immense amount about the material, her lecture style can be very dull. She spends every class going through slides of artistic representations of whatever that day's myth is, but I can't remember a single time she actually brought up more than one critically backed interpretation. Also since it's easy to gather the general gist of the myths from the slides without reading them, lots of students just wouldn't do the reading (also in part because there is a ton of it). I was lucky because I happen to love this stuff, so the reading wasn't a problem for me, but this is not a good class if you just want to fulfill your lit requirement. \nOh, and the midterm and the final aren't as hard as they seem like they will be. If you're familiar with the common identifying features of all the gods in greek and roman art you will be fine; you don't have to memorize all of the slides she shows you. \nShe also puts together these really interesting packets of poems related to each myth (some modern, some classic). It's hard to find the time to read them during the semester, but I'd strongly recommend downloading them to read later. They really are quite good.\nWorkload:\nA lot of reading, and two in-class essays (one the midterm, one for the final) and one 10 page essay outside of class analyzing either a piece of poetry or artwork and how it relates to a myth of your choice. \n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "September 06, 2014",
            "review_content": "\nOverall, I really enjoyed taking this class. You don't have to do all the reading, though it is not very difficult to complete it. It only gets difficult when you get to Homer but you really don't have to bother with it. Lecture is not all the helpful because she simply went through the slide show with paintings about the myths. she shows modern and ancient art, but you only need to study the ancient art. for that reason, lecture was not really interesting for me because she didn't give much insight or discussion of the content, just simply presented the content to us.\nthere is a midterm and a final with pretty much the same structure. she is very straightforward about it and makes it clear that this is not meant to be difficult or to trick you. she is telling the truth. just memorize the art and study themes she mentions in class, and do some of those readings. \nthere is also a final analysis paper which is not difficult to do at all if you've done well in literature. I did a simple compare and contrast of poems and got an A. Just write well and have decent ideas and you're set - although I'm sure for some people that can be a challenge. If it is a challenge for you, then the TA or Foley herself will be there to help you! she wants everyone to do well and is incredibly kind and understanding.\nWorkload:\nmoderate to light reading, midterm, final, and final 10 page paper. Doable but you should put some time and effort into the class.\n"
        },
        {
            "course_name": "Gender and Sexuality in Ancient Greece",
            "review_date": "May 24, 2011",
            "review_content": "\nProfessor Foley is absolutely amazing. I took the class to fulfill a GER and never expected to take it seriously. Instead, I came out of the course with a great appreciation of Greek art and literature. She is extremely understanding when it comes to what each student is capable of doing and their background of the material we were working with. She offered phone conferences over the weekend when we had our first paper due, and is always very attentive at office hours and to the work that you have handed in. This woman is absolutely amazing.\nWorkload:\na lot of reading but very interesting. one midterm paper, response papers (nongraded), in class presentation, final. \n"
        },
        {
            "course_name": "Gender and Sexuality in Ancient Greece",
            "review_date": "May 04, 2011",
            "review_content": "\nOne of the nicest, most intelligent professors I have ever had the privilege of taking a class with. Our class had a pretty diverse mix of academic backgrounds--from people who had never taken a Classics course before to people who can read Ancient Greek cold--but she made the course approachable and interesting no matter how much experience you had. She is obviously passionate about what she teaches, and is extraordinarily helpful in office hours. The reading is a lot, but it's fascinating stuff--it would be my reward to myself after I had done my reading for other classes. Take this class or any other class with Foley, you will absolutely not regret it. \nWorkload:\nA *lot* of reading and writing--three four-page, ungraded response papers; a take-home midterm; an in-class presentation; a final paper; and a final exam. If you can handle it though, totally worth it! \n"
        },
        {
            "course_name": "Myths of Maternity",
            "review_date": "May 08, 2010",
            "review_content": "\nProfessor Foley is AWESOME. \nTake any course you can with her. \nShe is so cute with her smiles and candy giving. She even invited us to her house this semester for FYF Myths of Maternity. \nShe is available to meet basically all the time, and she always tries to accommodate her students. \nShe is passionate about women's issues and ancient Greek studies, but even if you don't care about this stuff I'm sure you'll enjoy it with her class. \nHer caring makes you care. \nShe facilitates class discussion but does not make it weird. Initially she leads discussion but then she has you bring in passages and questions and in the end you kind of take over the discussion. \nSeriously she rocks.\nWoo Foley!!\n \nWorkload:\nSort of a lot. She expects a lot of reading, but it comes down to about 100 pgs for the weekend and another 100 for the week. However, almost all the reading is interesting and leads to pretty cool discussion. \n"
        },
        {
            "course_name": "Women in Antiquity",
            "review_date": "January 01, 2010",
            "review_content": "\nProfessor Foley is just one of the most intelligent professors I have ever had the honor of taking a class with. She's clearly very passionate about the material and did a great job in summarizing key points and tying ideas together. She's so sweet (she brought cookies on the last day of class and on the day of the final). Honestly, you should take one of her classes. Superb professor. \nSometimes the reading was too much, but this was often counter-balanced by days when we would have to read just one play or smaller readings. Not all reading was necessary but all of it was interesting. She also included other media in class discussions, such a slides and videos. The class discussion always led to interesting points. \nWorkload:\nAverage reading quantities (at times too much), but always very interesting. Four short papers and one longer paper. Take-home midterm and final. Really, manageable. \n"
        },
        {
            "course_name": "Women in Antiquity",
            "review_date": "January 01, 2010",
            "review_content": "\nProfessor Foley is just one of the most intelligent professors I have ever had the honor of taking a class with. She's clearly very passionate about the material and did a great job in summarizing key points and tying ideas together. She's so sweet (she brought cookies on the last day of class and on the day of the final). Honestly, you should take one of her classes. Superb professor. \nSometimes the reading was too much, but this was often counter-balanced by days when we would have to read just one play or smaller readings. Not all reading was necessary but all of it was interesting. She also included other media in class discussions, such a slides and videos. The class discussion always led to interesting points. \nWorkload:\nAverage reading quantities (at times too much), but always very interesting. Four short papers and one longer paper. Take-home midterm and final. Really, manageable. \n"
        },
        {
            "course_name": "Gender and Sexuality in Ancient Greece",
            "review_date": "May 17, 2007",
            "review_content": "\nI came into this class as a SEAS student with almost no college literature or writing experience, and the only piece of Greek literature I had under my belt was the Odyssey.\nI left with a great deal of understanding of the course material, a broadened outlook on literature in general, and improved reading and writing skills.\nProf. Foley is an exceptionally dedicated lecturer who clearly loves helping her students learn. Her feedback and grading is extremely constructive, and her lectures (executed with designated student assistance) were eye-opening.\nWorkload:\nModerate reading, generally of fairly compelling material (Plays by the major playwrights, works by Xenophon/Plato, etc.). You \"lead\" two in-class discussions (present questions along with 2-3 other students), do one take-home midterm, write one 8-10 page final paper, and take a final consisting of three short essays. \n"
        },
        {
            "course_name": "Selections from Homer",
            "review_date": "May 09, 2006",
            "review_content": "\nFoley's great.  She's up to date on current Homeric scholarship and brings that knowledge to class to make what could be a ho-hum translation class very interesting.  She knows ancient Greek so well that she's not afraid to admit it the few times she doesn't, and then she'll go off and find out for you.  You'll absorb her love for the text and yes, quite a bit of skill in translating it, too.  The vocab is always tough, but she gets you used to the irregularities of the Homeric dialect very quickly.  She set up guest lectures with a CU prof. who knew all about oral tradition and epithet systems and with another who explained the ancient pronunciation and oral delivery of the text.  She also took requests for translation of students' favorite episodes.  She dissected the features of the poetry in a way that finally revealed why people loved hearing and reading Homer so much.  The class is small, lots of comradery, she buys cookies and OJ a lot, you get it.  She's top-notch.  \nWorkload:\nappx 170 lines a week, but it varied.  Easy midterm and final, passage translation with extra essay question on final.  Weekly grammar quizzes, not too tough.\n"
        },
        {
            "course_name": "Hesiod and Homeric Hymns",
            "review_date": "January 28, 2005",
            "review_content": "\nThis review will sound hyperbolic, but all the superlatives are either fact or sound opinion: Professor Foley is the nicest teacher I have ever had. She is a renowned expert in the areas of ancient Greek Culture, Religion, Myth, Drama, and Poetry, and has a lot to say on the subject. And every sentence she utters comes out with a really sweet smile. She is an awesome dresser, and actually manages to pull of her huge glasses with style; she is also pleasantly liberal and wore a no-Bush pin all term. This course had a fair amount of easy reading, but Foley was so insistent that it shouldn't actually require any hard work that she 1) had us write vocabularies for each other 2) ordered translations from Labyrinth 3) went over almost every word of tanslation in class 4) gave us only a short paper which she graded easily 5) let us use dictionaries (!!!!) on the ridiculously short midterm and final, which meant they were not actually tests 6) gave us the final exam essay question (just one) in advance and let us use a page of notes to write the essay (!!!) and 7) smothered us with quiet affection beaming across the table from her tranquil face. Seriously, she asked us several times during the semester to call her house if we had any questions at all. This woman loves being a teacher, and she is wonderful at it. A+\nWorkload:\nSee above.\n"
        },
        {
            "course_name": "Hesiod and Homeric Hymns",
            "review_date": "January 28, 2005",
            "review_content": "\nThis review will sound hyperbolic, but all the superlatives are either fact or sound opinion: Professor Foley is the nicest teacher I have ever had. She is a renowned expert in the areas of ancient Greek Culture, Religion, Myth, Drama, and Poetry, and has a lot to say on the subject. And every sentence she utters comes out with a really sweet smile. She is an awesome dresser, and actually manages to pull of her huge glasses with style; she is also pleasantly liberal and wore a no-Bush pin all term. This course had a fair amount of easy reading, but Foley was so insistent that it shouldn't actually require any hard work that she 1) had us write vocabularies for each other 2) ordered translations from Labyrinth 3) went over almost every word of tanslation in class 4) gave us only a short paper which she graded easily 5) let us use dictionaries (!!!!) on the ridiculously short midterm and final, which meant they were not actually tests 6) gave us the final exam essay question (just one) in advance and let us use a page of notes to write the essay (!!!) and 7) smothered us with quiet affection beaming across the table from her tranquil face. Seriously, she asked us several times during the semester to call her house if we had any questions at all. This woman loves being a teacher, and she is wonderful at it. A+\nWorkload:\nSee above.\n"
        },
        {
            "course_name": "Gender and Sexuality in Ancient Greece",
            "review_date": "December 27, 2003",
            "review_content": "\nProfessor Foley is a really nice lady who wants her students to love this material as much as she does. She has much to offer in the way of teaching, as she has made huge contributions to this area of Classics. The course material includes primary and secondary sources that play off each other nicely with the aim of presenting basic concepts as well as departures from those ideas. This is a very interesting course that is taught well and with a lot of enthusiasm. My only complaints would be that sometimes I was thrown off by her giggly demeanor when she'd discuss readings or concepts in detail; it was discouraging to realize that this grown woman couldn't talk about genitalia or other sexual  things without acting like she was 12. Also, in the fall semester when I took this class I had no idea what my grade was until the end of November. Graded assignments came heavily toward the end of the semester and were a bit overwhelming.\nWorkload:\nOne short (5-8 page) paper, one long (7-10 page) paper, and a final with pre-prepared questions. She allows you to rewrite the first paper which would be more handy if she returned it to you before you're almost done with the second. You get a cheat sheet for the final that lets you bring any notes/quotes relevant to the exam questions which she provides about a week before the final. Each student must do presentations for 2 classes; basically, a small number do the readings and then come in with any questions about the topic. While a good idea, it didn't really do much to clarify the material, and lectures would have been much more useful.\n"
        },
        {
            "course_name": "Women in Antiquity",
            "review_date": "May 28, 2003",
            "review_content": "\nThw woman is super cool! take her class! I had no prior knowledge of the material nor did I ever have a specific interest in the topics covered...I just wanted to fill a requirement....the class was so interesting! I did not nod off at all! And afternoon classes...I mean come on, she can't make it easier than that!\nWorkload:\nLoads of reading...you wont mind it though, trust me. Compared with other classes, this is way better....who wouldn't want to read about whores during antiquity??? Um, paper...no biggie...you pick the topic....final has essays assisgnd in advance! I love this woman!\n"
        },
        {
            "course_name": "Women in Antiquity",
            "review_date": "May 15, 2003",
            "review_content": "\nHelene Foley is wonderful!  Take her classes!  She is a wonderful and spirited lecture (who apperntly, conviently, gives only afternoon classes) and she really cares about her students.  She has well organized lectures and knows her stuff.  She is comical and what is really great is how excited she gets about antiquity.  She also brought in cookies for the last class and the final!\nWorkload:\nA lot of reading...not tremendous, but more that I expected.  Half the time you only need to read one or two of the readings she assigned.  There was a midterm, where we had to write 2 essays (fairly easy and she tells you to take a time limit AND you can redo them for a higher grade), a 6-8 page paper and a final with pre-prepared essays that you can bring a sheet of notes in for\n"
        },
        {
            "course_name": "Women in Antiquity",
            "review_date": "April 13, 2003",
            "review_content": "\nI took this class knowing nothing (and having no prior interest in) gender studies or antiquity and Helene Foley has inspired a great interest in both. \nShe is a terrific lecturer, making anything and everything comprehensible and illuminating. There is also a wonderful blend of primary texts and secondary sources. Her best quality is her unbias. She always makes clear distinctions between fact and theory, while giving more emphasis to fact allowing her students to draw there own conclusions. The class is also expertly organized, moving logically from one writer/ time period to the next so that you always feel as if you have a solid point of reference. She fills the first half of the semester with readings of great classical texts then moves into historical documents later on. She is also a translator and academic writer, so you will be reading a lot of her own work, and thankfully she does not place undue emphasis on herself. Her demeanor is always joyful/giddy which obviously points to her own love and interest in the material and she is always willing to clarify, and answer any questions. As long as you let yourself feed off of her own excitment, and do the reading (which is not a lot) you will fall in love with her\nWorkload:\nEasy: about 100 pages a week. 1 (6-8 pages) paper on a topic of your choice. A take home midterm (very easy). final (part pre-prepared essay questions, part short identificatio\n"
        }
    ]
}