{
    "prof_info": [
        {
            "prof_name": "Martin Uribe",
            "prof_id": 4459,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 24, 2016",
            "review_content": "\nAvoid taking this professor because statistically speaking, you aren't going to do well.  Uribe curves this class so that the average is going to be a B.  I don’t think Uribe understands how curving and grading works.\nReference sheets are not allowed so the midterm and final were like memorization tests rather than conceptual tests.  If you simply regurgitate and memorize the lecture notes, you will do well on the exams.\nAll that happens in class is Uribe derives equations which are already derived in the posted lecture notes.  Going to class is not needed to do well on the homeworks and exams.  Just memorize the lecture notes.\n\nWorkload:\nHomeworks were straightforward and everyone did well on them\nAverage for Midterm 1 was 29/75 with a std of 14\nAverage for Midterm 2 was 53/75 with std of 14.09\nAverage for Final was was 43/90 with std of 17\n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "August 13, 2014",
            "review_content": "\nI would like to respectfully disagree with the review before me in a couple regards. \nMartin Uribe was a good professor and I definitely learnt a lot in this class. I agree that Martin's voice is pretty monotone, but if you pay attention to what he is saying you will have a grasp of the material that will be sufficient ammunition for his exams (which were easy, assuming you had bothered to learn the material). Martin moves quite slowly, and he will do multiple cases of the same model to ensure you know what is going on. \nMartin's class uses calculus, but this shouldn't catch anyone off guard, given that calculus 1 is the pre requisite along with principles. The only calculus needed is knowing how to take pretty simple derivatives. No calculus is needed for the exams since you can memorize the derivatives in the models for the exams.\nAnyone who says Martin doesn't explain his formulae is flat out wrong. I just went back through my notebook and I have an economic explanation written under every boxed formula. He does mathematical proofs of his formulas but these are not needed for his exams, they are to show you why the formulas are considered good models. Once an equation is proven he focuses heavily on the economic intuition, which is true on his problem sets as well. He always explains why his solution to examples make economic sense as well. \nLast but not least, Martin cares a lot about the concepts underlying the models rather than blindly using a model. Often on problem sets he will modify an assumption in a model and ask questions, so you have to understand the model enough to decipher what this change means. Long story short if you pay attention in lecture (or read his thorough lecture notes) you should be fine. I skipped most of Carlos' recitations and ended up with a fabulous grade in the class regardless since Martin moves quite slowly. For the sake of full disclosure I will note that I am in SEAS, since people think this matters. I will also note that I got my grade while taking 5 other SEAS classes and plenty of extra curriculars, not because I'm a genius, but because the workload isn't that high. Take from that what you will. \nWorkload:\nWeekly problem set (Usually pretty straight forward. Usually one conceptually rigorous question per set)\nWeekly readings (you can skip these for the most part)\n1 midterm (easy)\n1 final (essentially a second midterm, easy). \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 18, 2014",
            "review_content": "\nI would have to say that Dr. Uribe is the complete opposite of a great approachable professor. His teaches style is like talking to a brick wall in a monotone voice. He drones on with a succession of derivations and equations on the blackboard without ever letting students appreciate the big picture. Contrary to what a reviewer wrote below, Uribe's accent is not at all the issue: His intonation and demeanor is. There is absolutely zero engagement with the class. He does not pause to emphasize important points, and refuses to answer any questions during class (even though only about 40 students show up). By the time you ask him after his lecture, most of what he's said has gone in one ear and out the other. \nIf you want to have an enthusiastic, entertaining professor who illuminates and contextualizes the numerous equations you will have to learn, avoid Dr. Uribe with a ten foot pole. Uribe is undoubtedly an expert in his field, but is too absent-minded to effectively share his lessons with a room full of undergraduates.\nIf you can motivate yourself to regurgitate the equations that Uribe writes on the board and translate them into intuitive concepts, you might get something out of the lectures. I, like many others, learn everything from Carlos' recitation. Carlos is hands down the best TA any student could possibly have. His teaching style is everything that Uribe is not able to do. He is personally invested in his students and actually wants us to succeed. I definitely would have stuck with a major in econ if Carlos had been the excellent professor and Dr. Uribe had been demoted to being a mediocre TA. \nWorkload:\n40% midterm, 40% CUMULATIVE final, 20% homework\nMidterm had 8 problems. Final has about 16. You will have to memorize a lot of equations for the exams, but even then you will not do well unless you have an intuitive understanding of them. Average on the midterm was about 45%. Weekly homework problem set. It is necessary to give yourself some time and go to TA office hours if you want to do well on the homework. Partial credit is not generous on the homeworks or exams. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 25, 2012",
            "review_content": "\nProfessor Uribe is the best professor I've had so far at Columbia. Yes he is a quiet man, but he is completely approachable and always tries to add little jokes and anecdotes to his lectures so that his students can connect to the subject matter or at least get a laugh.He made me learn to love macroeconomics.  There were 9 problem sets which were all really easy (average ranged from like an 85%-95%). \nCarlos was AMAZING. Best TA in the world and I really hope that Columbia hires him right after hes done with his PhD. He is so caring of his students, teaches everything step-by-step, and does anything to accommodate your needs. His recitations are indispensable so GO to them, you wont regret wasting the 90 minutes each week. He's such a sweet and handsome man. \nWorkload:\nThere were 9 problem sets which were all really easy (average ranged from like an 85%-95%). Midterm was pretty easy but the class didnt do as well as planned (nerves kicked in). \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "February 01, 2012",
            "review_content": "\nUribe is completely useless. As usual with professors here at Columbia his accent is completely impenetrable. On top of this he lectures quietly and without any confidence making his class impossible to stay awake during. He does nothing interesting and essentially ruins Macroeconomics. His problem sets also serve no purpose, they are essentially busy work, filled with mindless number crunching and vague confusing directions which make them time consuming and frustrating but inutile for learning the material.\nWorkload:\nProblem sets, midterms and final. Actual lectures matter very little.\n"
        }
    ]
}