{
    "prof_info": [
        {
            "prof_name": "Shilarna Stokes",
            "prof_id": 2759,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 27, 2007",
            "review_content": "\nShilarna is the absolute BEST University Writing instructor.  That's a fact, not an argument.  She really and truly cares about all the students and is extremely approachable and accessible.  The thorough comments she provides really identified my strengths and weaknesses, and I found myself improved in both arenas at the end of the semester.  I came into UWriting with the greatest dread, but it is has been one of my two favorite classes this semester and year...and it's a 9:10am class, which says a lot for it.  Also, while many say UWriting is a rigid class, Shilarna gave us a great deal of freedom this semester.  I absolutely loved this class from the very helpful workshop sessions we'd have to the one-on-one sessions with Shilarna to the breakfasts she'd sometimes provide!  I used to despise writing, but Shilarna's UWriting class has made me really come to love it.  I have discovered the type of writer I am and tailoring my own style and interests to each assignment has made me passionate about all of them.  In conclusion, I will repeat...Shilarna is the absolute BEST University Writing instructor.\nWorkload:\nLens Essay Progression, Conversation Essay Progression, CCP Progression, Retrospective Essay, 4 in-class and unstructured reflective writings, peer editing (built into the progressions)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 14, 2006",
            "review_content": "\nShilarna is probably one of the best University Writing teachers out there. She starts the semester off as a very intimidating teacher, prefacing the class with something along the lines of \"it's not impossible to get an A, just highly improbable\" but don't worry. The work is intense for the first two progressions but lessens dramatically after the conversation essay. She really cares about her students and puts a lot of effort into preparing for each classes. Her lectures are clear and concise and she always has outlines about what she will be lecturing. Her handouts are very clear and easy to understand. She also goes out of her way to make the class feel like a unit, which is really good for a peer-review classes such as University Writing. She's obviously very intelligent and very easy to talk to. She's genuine concerned about her students and she'll make University writing a class that you will love to work for. Totally worth the 9 AM wake up time.\nWorkload:\nHeavy at first but lessens about midway through. Readings after every class and written assignments after every class. If you read and she can tell that you are putting in your best work, you will do very well.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 20, 2006",
            "review_content": "\nShilarna is great. Though the class itself is not neccesarily riveting, I dont think any UW classes really are--but Shilarna is extremely devoted, and will help you and meet with you many times to perfect your drafts. She is personable and kind as well. \nWorkload:\nMedium. A small assignment due every class, with some reading. Four Papers, as in every UW. About 2 drafts for each paper due beforehand, not graded. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 26, 2005",
            "review_content": "\nIf you have randomly been assigned to Ms. Stokes, you're lucky. She is one of the better teachers in the UW program. She is a very fair teacher and, although the curriculum in UW is restricing, she is very accomodating to the intellectual interests you would like to pursue in your work. That said, she is not a push over. Be prepared to write. I would not say it is an simple A but if you are willing to do some work it is highly manageable. \nWorkload:\nHeavy at first but gradually lightens up by the end of the semester at wich point the workload is light. In the beginning, there are a bunch of essays to read and that sort of stuff that can be tedious but by the final progressions there are less and less reading.\n"
        }
    ]
}