{
    "prof_info": [
        {
            "prof_name": "Jay Shuttleworth",
            "prof_id": 11593,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 16, 2015",
            "review_content": "\nJay is great as far as CC lecturers go. He is responsive, thoughtful, and overall a 10/10 human being.\ntl;dr: You're far better off taking his CC class than another's. You don't have to do all the reading to get something out of the class, exams are easy & straightforward, papers don't have to be difficult. As long as you try, you'll be fine. Jay recognizes effort.\nClass:\nBefore each class he'll send out discussion questions; this helps cut down on the reading if you read selectively. For the first half of class, he'll give a brief overview of the important points, and also sometimes show relevant multimedia. Then he has you pair up and discuss for a few minutes, then opens it into a class discussion. He usually takes the last two minutes to recap and offer his feedback & thoughts.\nJay is a good facilitator. He really seeks to give all students in the class a chance to speak, but never forces anyone to talk either. Participation is 3/7th of your grade, so make sure to say something every class. He takes REALLY meticulous notes every class about who raised their hand, who spoke, what they said, who brought notes. He once told me the exact number of times I didn't speak in class and the dates of those classes. Jay doesn't expect anyone to say something revolutionary; as long as you bring a few quotes that interested you and not speak complete bullshit, your participation grade will be fine.\nPapers:\nI've heard people say he's a tough grader, but I've never had a problem. Start your paper on-time/early. Then you'll have time to go to his OH and get feedback. He gives a lot, and is willing to read anything you've written up to that point. He also likes a very specific paper style/structure. Clearly state your claim in the beginning of each paragraph. Follow every quote with background & analysis. Don't use passive voice. Be straightforward. He'll usually grant you an extension if you ask.\nExams:\nVery straightforward. He allows you to have a 8.5x11 cheat sheet, front & back. You turn this in with your exam. He gives you a list of possible ID sources beforehand. He also gives a list of 7-8 possible essay topics, with 4 of them on the actual exam. On the flip side, because you're allowed to bring a cheat sheet & you get the essay topics beforehand, he expects you to use quotes (paraphrased or not) & cite them in yourreview_content. review_content the main points, have your quotes ready, and you'll be A-OK.\nMisc: This is not a hard class as long as you put in effort--and usually, you'll want to. I hated CC the first few weeks of school, and it ended up being my favorite class. I've left every class having learned something new. He truly cares for his students. He's the first instructor I've actually been excited to go to OH for. He does this activity at the end of every semester where he has you write your future self a letter, and he sends it to you in a year. Also, he does a giant Pisticci brunch every semester, paid for by CC. You won't regret having him as your CC instructor.\nWorkload:\nTypical CC reading. 2nd semester has a few extra (short) readings.\n2 papers (8-10 pgs), working thesis due a week before the paper\nMidterm & final. 10 IDs, you only need to do 5; 1 essay.\nGrading: Participation - 3/7. Midterm & final - 2/7. Papers - 2/7. Yes, he actually chose 7 as the divisor.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 24, 2015",
            "review_content": "\nI am not exaggerating when I say that Jay is one of the best professors I've ever had. His classes are lively, the discussions are interesting, and he is a fair grader. He comes prepared to each class with PowerPoint slides and up-to-date videos that relate directly to the texts. He is funny, charismatic, extremely intelligent and kind-hearted.\nJay makes sure his students understand the key details in each text which is beneficial in doing well on the exams. If you don't completely understand the readings or if you haven't had a chance to finish reading everything, Jay makes sure he explains the important ideas in the text so that you always leave class understanding at least the bulk of the material. \nHis exams are fair as long as you take the time to make the study guide at home. You will get an A if you prepare the essays in advance and study the main ideas of each philosopher. The slides and videos Jay shares during classes are engaging, but make sure you take note of each one and not simply enjoy them because they usually end up on the exams. \nBefore each class we take about 5-10 minutes discussing any news or personal stories students want to share rather than diving right into the teaching material. Overall, Jay treats his students with respect and never puts himself on a pedestal. His positive attitude implies that he is learning just as much from us as we are from him. \nI definitely recommend taking this class. \nWorkload:\nThere is a lot of assigned reading but the good news is you don't always have to read each and every page (although if you have time you should). As long as you understand the main points and have a few interesting quotes to share with the class, you will get a good participation grade and be prepared for the exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 25, 2015",
            "review_content": "\nGreat lecturer for CC. He definitely does the background research on the the different authors and texts. He even took a class just on Kant to make sure that he understood the text inside and out. He spends about half of class lecturing with slides and often includes real-life examples or multimedia, such as contemporary movies or news segments. For the readings, he sends out discussion questions beforehand to guide your reading and the discussion in class. The discussion is pretty lively, but that obviously depends on the other people, but he does a good job of keeping the discussion lively. I'm not going to lie, Jay is a tough grader on essays and participation (I think its like 30%), but that just makes you a better reader and writer, in my opinion. And he definitely is sympathetic and just a great guy overall. \nWorkload:\nTwo 8-10 page papers (definitely need effort to get an A, but doable), and a midterm and final with essay topics given beforehand and passage IDs that are not too bad. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 13, 2015",
            "review_content": "\nJay isn't the most spectacular professor but he makes the class enjoyable, accessible and keeps things lively. He likes to focus more on discussion between students rather than dictating his own views. This also translates into 40% of your grade being class participation, which can be good or bad depending on how much you like talking. \nOverall he's a fair grader and provides several options when it comes to paper topics. His exams consist of passage IDs and an essay section, but he actually gives you a list of 7-8 topics beforehand and says he'll put 3-4 of them on the exam for you to finally choose one. You're also allowed a letter sized cheat-sheet, and you can write on its front, back and sides as he likes to say. \nHe usually opens class with a presentation on the text at hand, which includes some pictures, historical context, a summary of concepts presented, and often movie clips and writings that he likes to relate to the text. Some of these clips usually also show up on his exams so it's good to keep a note of them. \nHe has some other quirks like insisting you submit a hard copy of papers by 5 pm sharp on the deadline, and asking you what kind of bubble tea you're having, but he's a nice, friendly and reasonable professor who puts in a lot of effort into the class. Overall, I had a good experience albeit not a mind-blowing one. \nWorkload:\nStandard amounts of CC reading that no one ever finishes. No extra readings. 2 papers (8-10 pages), midterm and final worth 15% each. Class participation 40%. He encourages posting on the Courseworks forum as a means of participation but it doesn't happen much. \n"
        }
    ]
}