{
    "prof_info": [
        {
            "prof_name": "Jose Hernandez",
            "prof_id": 360,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Grammar and Composition",
            "review_date": "September 15, 2007",
            "review_content": "\nPepe is a terrible teacher. he admitted to us on the first day of class that he had no syllabus, no lesson plan, not even a theme for the semester. he ended up choosing bullfighting, and so we spent the first two months reading outdated (like from the 1950s) articles on the beauty and art and history of bullfighting, and then listening to pepe talk about his life in spain, and how he is the best and most qualified professor in the spanish department (he got a little riled up one class and started screaming at us about his overqualifications...) then we did the midterm \"anonymous\" reviews, and all six of us (yes, there were only six students in the class) asked for more structure and grammar, so we were then assigned grammar excercises from a book on reserve at butler that we had to check out and photocopy for each class (because the homework was only given one class ahead of time). the entire class time was then spent on correcting the grammar exercises. towards the end of the term, he announced that we we spend some time discussing illegal immigration...in spain. this consisted of watching the first ten minutes of a movie about a moor crossing the straits of gibraltar. And compositions? yes we wrote them. all he did was correct grammar and spelling, never any actual feedback on writing or content. he spent a lot of time complaining about how students spoke and wrote spanish translated directly from english, but never did much to correct that. i went to his office hours and he was not helpful at all. our final paper was supposed to be a fantasy/romance. yes. \noverall, a complete waste of time. and nobody felt their grade was fair, considering how disorganized and unclear the class and grading scheme were. now i am in the intro to hispanic cultures class, and seriously worried that i have lost all ability to speak or write spanish.\nWorkload:\ninconsistent and annoying. midterm exam (that ended up being take-home because he wasted the whole class correcting something) no final. final paper (the fantasy/\nromance one) was 40% of the grade...\n"
        },
        {
            "course_name": "Comprehensive Spanish",
            "review_date": "April 16, 2007",
            "review_content": "\nThis is the most insulting professor I have ever had. He outrightly embarrassed a girl in class today and is never whatsoever encouraging if your grade is suffering. Never take a class with this professor and you can continue enjoying life. \n"
        },
        {
            "course_name": "Spanish 1120 Comprehensive Beginning Spanish",
            "review_date": "September 03, 2006",
            "review_content": "\nPepe was really fun.  While admittedly not the best spanish teacher, he was really understanding when it came to grading.  Because the class covers so much material soo fast (it's comprehensive!!) it can get kind of hectic, but if you didn't understand something, Pepe would try his best to help you out.  Everyone gets called on to speak in class, and you have to take the class for a grade: no pass/fail.  You also can't be TOO good at spanish, because he thinks that intimidates the other students and will make you register for a higher level.  All in all, if your class is taught by Pepe, you're pretty lucky (especially because he'll let you throw an end of the year fiesta and he'll sing to you...)\nWorkload:\nWeekly workbook assignments, chapter tests, midterm, final, final oral exam, 3-4 written compositions.  Really not that much work.\n"
        },
        {
            "course_name": "Spanish 3332 (Now 3330)",
            "review_date": "August 30, 2006",
            "review_content": "\nPepe, contrary to popular beliefe, was the absolute man.  Sure he is sort of a disgruntled old man but after you get over the initial \"what is going on\" and \"what is this guy talking about\" phases, you will love him.  I have never learned more in one semester about grammar, writing style, critical reading, and any other litarary analysis skill, most notably actually reading litarary criticism from Butler than from Pepe.  So, just sort of ignore his grumpiness right off the bat and you will learn to love his quirks, including fabulous stories of his life, his absurd sense of humor, and of course, his rediculous comments about Barnard.  I highly reccomend this man.\nWorkload:\nThree Essays, one of which is a take home final, midterm which was easily graded, nightly reading which is all REALLY short and one oral presentation...not bad at all \n"
        },
        {
            "course_name": "Comprehensive Elementary Spanish, Fall 2005",
            "review_date": "December 15, 2005",
            "review_content": "\nOverall, Pepe is a good profesor. Yes, he can be a bit gruff, especially in the beginning of the semester, but we all got used to him and had a good time. We actually had a lot of laughs in this class, and I cannot say that for my other four classes this semester. \nWe also learned a great deal of Spanish. This course has a LOT of work to do. Lots of exams and compositions, a mid term, an oral final and a written final. \nPepe checks homework, and he takes attendance every class. \nPepe is fair, he sticks to the schedule like clockwork, and you are either prepared or not. It is better if you are prepard. His teaching style is not incredibly creative, but there is too much material in one semester to get it all in any other way. I can honestly say that I always looked forward to going to this class, and I think that the other students who stuck through it felt the same way. \n"
        },
        {
            "course_name": "Spanish 1201 - Comprehensive Beginner's Spanish",
            "review_date": "November 29, 2004",
            "review_content": "\nGood things about Professor Hernandez:\n1.  He speaks fluent Castillian Spanish.\n2.  He returns tests and papers on time.\n3.  He goes through the book at a regular pace.\n4.  He tells jokes during the first several weeks.\n5.  He is an easy grader.\n6.  If you stick with this class, you will eventually have a very small class size as more and more people drop out.  We began with close to twenty students, and ended with about half that number.\nBad things about Professor Hernandez:\n1.  He calls on the students with a better grasp of the material more often.  I don't think he does this on purpose.  Rather, he wants the class to move quickly, so he begins to favor those students who keep the class moving quickly.  Unfortunately, this does not help the students who are struggling more with the material.   Several of the slower students dropped out of our class as time went by.\n2.  He lacks creativity.  For every class, Professor Hernandez  merely went through the exercises in the book.  Not once did he try to engage the students with something he created himself.\n3.  He does not give you much chance to speak in class.  Ideally, language classes should involve a mixture of pairs and small group activities in addition to student-teacher exchange.  Professor Hernandez, however, sticks with student-teacher activities alone.  He used pair activities a handful of times and small group activities never.  This means that during most of the class, you are waiting around for another student to say something.  Perhaps a conversational Spanish class is better in this regard?\n4.  He assigns homework, but does not actually check to see if you got it right.  Professor Hernandez checks to see if you did the homework, and then he gives you copies of the answers.  You have a few seconds to ask him questions about the homework before he moves on.  I suppose this works for some people, but I generally would like more feedback on where I could improve my Spanish.\n5.  Midway through the term, Professor Hernandez hands out \"anonymous\" evaluation forms, but then publicly berates those students who give him bad marks.  To my mind, this defeats the purpose of anonymous evalutions.\nNeutral things about Professor Hernandez:\n1.  He picks a grade for you, and that's what you get on most tests.  I did better and worse (sometimes much worse) on my tests, but always receieved the same grade, plus or minus two points.  In my case, this was a \"B\", so I was really happy.  I suppose it depends on what you are shooting for.\n2.  Professor Hernandez's personality works for some, and not for others.  He can be abrasive, but I don't think he is as horrible as some people describe him to be.  NYC certainly has people that are a lot worse.\nOverall:\nFor me, taking a Spanish class is about learning Spanish, not about the teacher's personality.  Given the mediocrity of  Professor Hernandez's teaching abilities, and the poor teaching methods he employs, I would recommend taking another class or another language to avoid taking him.  While I am sure that Columbia must have worse language instructors, I certainly hope it has better ones.\nWorkload:\nHomework a few hours each week.  Tests every other week.  Essay assignments every other week (you also have to correct these and hand them back in).  Midterm and oral and written final.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "November 07, 2004",
            "review_content": "\nPepe is HILARIOUS. You do feel a little sorry for the people that he makes fun of, but not really b/c its usually warranted and they don't understand what he's saying anyway. Class can get a bit boring with all the repetition and emphasis on pronunciation, but he knows what he's doing. Best instructor I've had in the spanish depart. Grading is reasonable, especially considering that I didnt take spanish in high school. Do the homework assignments b/c he always goes over them and likes to call on people that he knows didnt do the work. \nWorkload:\nworkbook assignments, quizzes, group oral presentation/play, midterm, final, oral final (the usual stuff for all the language classes)\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "August 10, 2004",
            "review_content": "\nI enjoyed this class and I'd recommend it to those who need to take it for the Spanish requirement. Pepe was funny and wasn't really mean to people after the first week or so and he allowed everyone to be involved in the class. I felt like I was prepared for the quizzes, midterm, and final, and felt like I learned significantly more in this class than I did in any of the previous ones in the sequence.\nWorkload:\nthe quizzes are pretty easy. bi-weekly workbook assignments are a pain, but the essays are a few hundred words and interesting. midterm and final are similar and not really difficult\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "July 26, 2004",
            "review_content": "\nPepe is great and certainly not a jerk.  He may assign one or two more assignments than other teachers, but it's well worth it for the substance of the class.  In my opinion, languages (especially at this level) are pretty mindless; since the department has a set curriculum, there is little room for the professors to stray from the text book.  However, Pepe makes class incredibly interesting. Yes, he makes fun of people, but it's all in good fun and his favoritism does not play into grading.    He also has an interesting life to tell of, filled with impressive credentials and hysterical accents and anecdotes.  Just a genuinely nice and interesting guy.\nWorkload:\nA test every other week, essays a little less frequently, and 2 orals. \nIf you do the work, an A is definitely attainable.\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "January 21, 2004",
            "review_content": "\nThis guy is great.  If you like a teacher whose a real human being a makes no attempt to hide it, this guys for you.  If you're uptight, picky or afraid to try to speak this guy is not for you.  I think some people in my class didn't like him, so you may not.  My philophy on language classes are - you have to do the work yourself, no one can teach you to speak.  Pepe just makes it a little more fun.  As far as one reviewer's claim that he 'belittles'  students, well, I can tell you straight up that I was his favorite to pick on, and I loved every minute of his rapier wit.  If you don't have a sense of humor, don't take this class.  This is coming from one of the biggest slackers at Columbia and he found a way to teach me.\nWorkload:\nyeah, there's a lot, workbook, compositions, etc.\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "December 29, 2003",
            "review_content": "\nPepe, as he likes to be called, is a jerk. He claims that he wants you to learn real, conversational Spanish, but instead you just go through the book, exercise by exercise. Very boring. However, each student gives an oral presentation before class on a theme like abortion, marijuana, prostitution, whatever you want, and that's useful and fun. Still, he's a jerk and his class is a waste of time.\nWorkload:\nSome prep work before each class, 4 compositions, almost weekly quizzes, midterm, final, several oral presentations.\n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "December 21, 2003",
            "review_content": "\nI definitely completed this class with a far better understanding of Spanish than I had when I started. The assignments are relatively straightforward; practically everything comes out of the textbook. Hernandez, or \"Pepe\" as we called him, was not the most approachable guy ever, but he was very charming and funny and our class laughed out loud a lot. He encourages speaking aloud and this is definitely not the class to take if you're not comfortable discussing issues and acting (that's right...as in a play) in Spanish. Overall, I learned a lot and laughed a lot, so I would recommend Hernandez's section to someone who has to fulfill the language requirement. My grade, however, seemed a little low for all the work I did. \nWorkload:\nWeekly text and workbook assignments (easy...all grammar), 4 short essays in Spanish (1-2 pages), 6 quizzes (straight memorization), a midterm, a final \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 20, 2002",
            "review_content": "\nIf you're an uptight liberal with no sense of humor, don't take this gentleman's class. Pepe is funny, light-hearted, and empathetic. Some students complain that he is unreasonable, but only because they can't hand their work in on time -- or take a joke. Yes, his grading scheme has little rhyme or reason to it and he may, at times, SEEM abrasive and impatient, but everyone I've spoken to received the grade they felt they deserved (about 6 of us) and agreed that he is an absolute pleasure to learn from. I received lower then an \"A,\" but also realize that I am not an outstanding spanish linguist and was graded fairly. Get over yourself, do some work, and have some fun. If you're too worried about your grade or your hypersensitive ego, then run like the lazy coward you are. Otherwise, smile and enjoy the ride.\nWorkload:\nworkbook assignments, participation, read one play in Spanish (or in English, too), 5 tests, 4 compositions, 1 oral presentation, short in-class skit, midterm, oral final, and written final...standard stuff, evenly spread.\n"
        },
        {
            "course_name": "W3332 20th Century Hispanic Literature",
            "review_date": "November 07, 2001",
            "review_content": "\nThough at first seemingly harmless, beware of this professor. While readings are fairly interesting, his assignments are often vague, ill-defined to both the students and himself. Once you figure out what you're supposed to be doing, the class is fine, but often the students (and even the teacher) have little idea. Doesn't explain his grading system very well (at all...) either, and often relies on the students to lead the class. Behind the jovial facade and bushy eyebrows is a stubborn little man who, while he invites constructive criticism, never uses it. Incredibly frustrating.\nWorkload:\nreasonable reading (short stories, poetry, essay, one short novel, one play), 3 papers (of minimum 3, 4, and 6 pages respectively), midterm, NO FINAL (thank the lord - who knows what it would be on).\n"
        },
        {
            "course_name": "W3332 20th Century Hispanic Literature",
            "review_date": "April 05, 2001",
            "review_content": "\nLots of literary analysis and all in Spanish. Fairly good reading knowledge of the language required. The reading material is largely magical realism so if you like that it's great. The novel is really interesting. The people in the class determine the enviroment completely. It's discussion based and there are only about 12 students, so if no one wants to talk that day discussions can be pained. Hernandez isn't a bad prof though. He presents interesting ideas. All in all not a bad class.\nWorkload:\nShort story & poem readings, one play, one short novel, 3 essays, a few big assignments -- but overall, not heavy.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "December 31, 1999",
            "review_content": "\nJose \"Pepe\" Hernandez should be avoided at all costs. While his abrasive attitude and frequent antagonizing of the students are amusing at first, when the pre-finals stretch rolls around and you miss an assignment or two, his love of public humiliation becomes a little tiring. Anyone in his class will attest to the fact that he creates a totally unnecessary high-stress environment, and not the kind that encourages actual learning of the material.\nWorkload:\nMidterm, final, a few short essays, some light reading.\n"
        }
    ]
}