{
    "prof_info": [
        {
            "prof_name": "Michael Eskin",
            "prof_id": 665,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 15, 2010",
            "review_content": "\nIf you get Michael Eskin as a professor, you should consider yourself very lucky. Though he admittedly has little structure to his lectures, he genuinely wants his students to learn and to get the most out of the material. He also tolerates occasional joking and banter during class--a huge plus, if you ask me. He also makes himself available to help his students with CC material as well as to give advice about more general academic pursuits. I came into CC knowing nothing about philosophy and came out of it not only with the sense of superiority that comes with knowing the difference between Hegel and Kant but also with a real interest in philosophy. Eskin's CC class was one of my favorite classes I took while at Columbia.\nWorkload:\nmild--a few essays, in class and out\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 19, 2009",
            "review_content": "\nMichael Eskin is no doubt nice and well intentioned, he is just not very smart. I don't think he really wants to be a teacher as his classes are extremely disorganized and have almost no point. I'm literally not sure whether or not he led one intelligent discussion. Also, it is true that he takes about a month to grade papers and even then they don't contain a single comment, just a grade. That felt pretty lazy and arbitrary. That being said though, he is nice and approachable, though he always held the class for about fifteen minutes after we were supposed to be dismissed. I probably wouldn't take another one of his classes. \nWorkload:\n3 arbitrary essays, midterm and final for CC. Odd grading. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 21, 2008",
            "review_content": "\nAll of the previous reviews are pretty much true...Professor Eskin is a fantastic professor. I found him to be articulate and kind in class. He has a deep wealth of knowledge, especially on philosophy, Judaism, Germanic culture and Latin. My only quasi-complaint is that he (politely) shuts people down fairly frequently, although I can't really blame him for correcting myself and others if we say something inaccurate. He has a tendency to unabashedly speak his mind on controversial issues like politics (it was an election year) and religion, which I personally found refreshing in a professor. All in all, CC with Eskin was a wonderful experience this semester.\nWorkload:\nThree papers, midterm, final. Papers were three page meditations where we could apply three individual texts to whatever we damn well pleased.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 16, 2008",
            "review_content": "\nI'm not sure what the previous reviewers were doing in class, but this guy is absolutely worthless. I guess he is really good if you haven't read any of the work and need it explained to you, but even at that, i am not sure. I had him for CC and the entire semester he never came to class with a lesson plan. The class was incredibly disorganized and we spent hours talking about off topic stuff. As a result, we were five texts behind at the end of the semester. He still expected us to read these texts even though we never reached them in class and included them on the final. Additionally, his grading is completely random and he doesn't really care. He waits for weeks to grade papers and when he does it is completely disrespectful. Twice, during the midterm and final, he graded every single persons paper from many weeks before. He never writes a single comment on them and has no criticism whatsoever. Additionally, his knowledge of english is incredibly limited. This is apparent not only when he corrects papers, but also in class. In reference to the 10 commandments, he once wrote STEELE on the board (instead of steal). Maybe it was just CC he was bad at teaching, but let me reemphasize, I think he was worthless. \nWorkload:\ntypical CC readings, 3 papers, midterm, final. \n"
        },
        {
            "course_name": "Introduction to German Literature, German Literature in World Context",
            "review_date": "July 01, 2006",
            "review_content": "\nProfessor Eskin has an extraordinary gift: to explain some of the most complex theories of literature, culture, and philosophy in a down-to-earth way that will deeply strike you and perhaps even change the way you think entirely. Eskin will solicit students' thoughts and opinions on a work and distill them to concepts he will write on the board, and then, when his chalk has run out, proceed to give a spectacular, ad-hoc lecture interweaving these comments with exgeses of the Frankfurt School, Romanticism, Nietzsche, the Enlightenment, and Russian poetry, among other things. No, he's not an expert on everything, but you wouldn't know it sitting through one of his classes. They are simply intense intellectual explorations which nonetheless captivate even the sleepiest, most lethargic student minds- who could fail to be charmed by his diagrams, his anecdotes, and his absurd but amusing examples? He calls his classes seminars, but in truth when he begins speaking, most students are too much in awe to venture further comment.\nThat said, Eskin is not afraid to inject his lectures with his own opinions. That is to say, he is not unfair to those he feels are mistaken- such as Theodor Adorno, on whom he gave a comprehensive whirwind lecture, only to deconstruct him in several subsequent ones. He will point out when he feels a book has been poorly written although significant for its content or place in history. This is merely him being honest, however, and one realises the benefits of this teaching philosophy when he is able to rapidly formulate coherent answers to challenging questions that other professors would answer with equivocal words like \"perspective\" or \"depends\". \nIn short, Eskin is not merely an excellent theorist or researcher. He is a wonderful teacher, above all. He will welcome you (indeed require you) to visit during office hours and go line-by-line through your papers. He interrupted the Intro class' entire syllabus in order to give us a primer in the finer points of German grammar, and continually educated us on new terms and concepts. And though he's not afraid to grade harshly if you don't pay close enough attention to the finer points of your language (especially if you're in one of his German immersion classes), he will go the extra mile to ensure you improve substantially. \nWorkload:\nIntro to German Lit: Three five page papers, in German.\nGerman Lit in World Context: One short presentation on a text; one 15-page research/textual analysis paper.\n"
        },
        {
            "course_name": "Postwar German Lit - 3445",
            "review_date": "May 02, 2005",
            "review_content": "\nSimply a great professor.  Never condescending to his students in the least.  He always has a smile and always knows what he's talking about.  Unlike some more timid professors, he infuses the discussions of class readings with his own interpretations and thus makes them more alive and interesting.  He asks challenging questions to stimulate class discussion and will always expound on any topic that requires clarification.  Probably my favorite professor in the German department thus far.  \nWorkload:\nReading per week varies from a few poems to a upwards of 200 pages in German, but it's always managable.  Three brief (5-7 p.) papers.  He is not very interested in grading it seems.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2003",
            "review_content": "\nThis guy gets teaching right. He's the consummate good guy, a wildly clever fellow, and just about the least condescending man I've ever encountered (when certain rather foolish people took it upon themselves to speak, I occasionally regretted his being so saintly in this particular respect.) He knows his stuff and makes for a delightful Lit Hum professor. The numerous declarations of his godlike status are not undeserved: he's terrifically mellow and seems to inspire crushes in all the lady students- if I were an academic, I'd want to be just like this fellow, but perhaps a bit less moral. Sadly, he's relaxing on sabbatical for 2003-4, but those who snag him for any class after that will be in for a good time. And, yes, he does take the core class kids out at the end of the year. You should buy the cat a drink; he certainly deserves it.\nWorkload:\nHe assigns four papers a semester, one of which is an amusing creative assignment. There's also a presentation, midterm, and final. I got all A's and A+'s in his class, but the general range seemed to be Columbia's typical C-A scale, but maybe slightly higher. He definitely seemed to be a fair grader, not inordinately hard.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 03, 2003",
            "review_content": "\nI just want to say that if I could only take Eskin's Lit Hum at Columbia and nothing else, I'd still pay the tuition.  His classes are amazing and inspiring, and yet he is so easygoing.  All the other reviews are right on, so I don't need to say much.  He is absolutely brilliant and makes me want to study literature and philosophy for the rest of my life!\nWorkload:\n4 papers/term, midterm, final.  Short reading quizzes which are easy if you've read the material.\n"
        },
        {
            "course_name": "German Intellectual History",
            "review_date": "December 31, 2002",
            "review_content": "\nA truly inspiring professor and wonderful person. This is a great overview of German thinkers, and they're read in a well thought out order.  Make sure you brush up on your Aristotle, Plato, Kant, and Hegel. The class is \"student run,\" so the Professor refuses to lecture and patiently waits until long lulls are broken by some brave student. \n\nWorkload:\nWeekly dense readings (equivalent to a book and a half per week)e.g. Freud's \"Civ and its Discontents\" and maybe a Hanah Arendt essay. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2002",
            "review_content": "\nI would marry this man if I could. If you are fortunate enough to get Eskin as your Lit Hum professor, thank your lucky stars (or the Registrar). Professor Eskin has this way of taking 2000 year old Greek texts and making them relevant to your life. Every class he will give some pearl of wisdow that you want to sew onto a pillow. Not only is he brilliant, but he's funny, kind, and laid-back too. \nWorkload:\n4 papers, midterm, final, and occasional quizzes. The quizzes and midterm can be a little tricky.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 12, 2002",
            "review_content": "\nA god among men. Eskin is what i desire to be in a person-- endlessly smart, incredibly cool, and best of all, funny as hell. The best part is at the end of the Lit Hum year he took us all to nacho's...\nWorkload:\nnot much. 3 three page papers a semester, one in class presentation-- you're basically guaranteed an A, he doesn't care about grades.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 15, 2002",
            "review_content": "\nIf you get Eskin, you are amazingly lucky. He is one of the smartest professors, let alone people, i have ever had the pleasure of meeting. His class is fun and informative, and his demeanor is great-- there's nothing like going to a professor's office hours and having him smoking a camel and chatting with you. HE IS A GOD! \nWorkload:\nNot much-- 3 papers at 3 pages, midterm, final, little pop quizzes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 24, 2001",
            "review_content": "\nMichael Eskin is a great professor! He conducts his classes in a relaxed manner, constantly making interesting points or raising engaging issues and always encouraging lively class discussions. He has a very pleasant personality, easily approachable and fun to talk to. Perhaps, his greatest asset is his ability to convey the importance of the material taught in class in relation to today's world. He successfully strives to make the material memorable by showing you how to apply it to contemporary times. A great class and a wonderful experience! Definitely recommended. \nWorkload:\n4-5 short response papers, several quizes, a class presentation, a mid-term and a standardized final.\n"
        }
    ]
}