{
    "prof_info": [
        {
            "prof_name": "Simon Billinge",
            "prof_id": 3727,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Thermodynamics, Kinetic Theory, and Statistical Mechanics",
            "review_date": "January 19, 2011",
            "review_content": "\nThis class turned out way more useful than I initially anticipated. If you're not a quantum physics guru, a lot of the material will go over your head as it did mine. However, if you work on the homework in groups, and truly study as much of the material as you can... you will do fine. I had no material science background, barely remembered physics, and I did surprisingly well. You should go to class all the time though because he doesn't post lectures and moves pretty fast!\nWe also learned python in the class which wasn't mentioned anywhere. The course had a simultaneous python group project which will turn out fine if the work is distributed. \nWorkload:\nHomework, Group project, two tests, a python test, and a final. A ton of work, but totally do-able and simon is hilarious!\n"
        },
        {
            "course_name": "Thermodynamics, Kinetic Theory, and Statistical Mechanics",
            "review_date": "January 10, 2010",
            "review_content": "\nNot the best professor you will ever have. Billinge is very disorganized and his interest in the class is questionable. He is usually unprepared for lectures and seems to wing every class. Whenever he finds himself in a rut, which happens fairly often, he picks on a few students in hopes of fishing a good explanation... oddly enough, this is probably the best aspect of the class. The inadvertent class participation actually helps in bringing across points. However, there have been a couple occasions where the entire class came to a standstill because he forgot an key element in a derivation.\nBillinge assigns 4-5 problems every week or so. He usually gets them from the textbook. On the syllabus he said he would assign each problem set on a Friday to be due the following Friday but almost assigns the problem set a few days late and almost always expects us to turn them in the original date. The problem sets are not usually hard so it's never a big deal. Ever so often he assigns a problem that is beyond where the class is at that point and, after you spend a few hours on it, he emails you the night before the hw is due saying that the question is dropped. After we turn them in though, the TA takes like a month to grade them. The TA for the class was ok and usuall helpful but there always seemed to be huge communication gap between the professor and the TA.\nThe structure of the class is as the title suggests: thermo then kinetic theory then stat mech. I found the topics themselves to be interesting enough and they have proven useful in some of my other courses. \nWorkload:\nProblem sets every week or so. Usually pretty easy.\n2 midterms. The first one was pretty hard and long but the second (class average was about a 60%) was much more manageable (avg. ~85%).\n1 final. About the same level of difficulty as the second midterm. It was cumulative with heavy emphasis on the stuff we did after the second midterm. He does have a knack for curveball questions, so you have to watch out for that.\n"
        },
        {
            "course_name": "Thermodynamics, Kinetic Theory, and Statistical Mechanics",
            "review_date": "December 26, 2009",
            "review_content": "\nNot a very good professor. He shows little interest in the class, he is always unprepared and very disorganized. On the syllabus, he stated that he would assign problems every friday to be due the following friday. However, he almost always posts the problem set three days late but still expects us to turn them in at the original due date. Worse, he often assigns problems that are on topics the class hasn't covered yet. After you spend hours bashing your head against it, he sends out an email the night before its due saying that the problem shouldn't have been there and that it won't be graded.\nHis lectures are torture. There have several occasions where he goes up on the board to do a derivation and gets stuck half way through. He brings his notes to class but he often deviates away from them, getting himself and the class lost in the process. \nApparently, there is also very little communication between the professor and the TA. There have been times when the TA has no clue about what is going in the lecture. The TA also took more than two months to return some of our problem sets.\nThe thermo class itself is actually pretty good. You get a very broad exposure to thermodynamics both from the classical and statistical perspective.\nWorkload:\nProblems sets every week. For our class, they were assigned fridays to be due the following friday. Usually 5 questions, not very difficult but he often posts them a few days late (in our case, as late as the following Tuesday) and expects you turn them in at original due date. HW is 10% of your grade.\n2 midterms (25% each) and 1 final (40%). Not impossible but he does have a penchant for throwing curve balls. Doesn't matter much because he curves.\n"
        }
    ]
}