{
    "prof_info": [
        {
            "prof_name": "Marilyn Ivy",
            "prof_id": 1823,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Anime Effect: Japanese Media",
            "review_date": "December 23, 2016",
            "review_content": "\nThis class was, without a doubt, one of the more interesting and fun classes that I have taken throughout my college career. Your homework is to watch a famous anime film or a couple episodes of a series, read a dense 100 pages or so of anthropological writings and then she will generally give you a prompt for which you have to write a one to two page, single spaced paper. Nothing terribly difficult. She just gives you a check or check + depending on your analysis. Beware though, this may be a class that is fun and games most of the time, but Professor Ivy expects you to put forth a strong effort both in and out of class. Make sure you come well prepared to speak in class and on the papers, even if she says something simple like give a short reaction to a film, make sure you put a lot of thought into it and support it with text from the readings that week. \nWith that said, early on professor Ivy can come off as somewhat of a cranky old woman, but beneath that stoic exterior she is actually a very caring individual. She is certainly very knowledgeable about the subject of anime and its effect on Japanese media and culture, and shares some strong opinions about various topics. This might be my one criticism of Professor Ivy. Because she has such strong, well researched opinions, she can sometimes be dismissive of students with differing opinions on a subject. Regardless, you end up learning a whole lot from her about Japan, Japanese media, the history and techniques behind anime, and the forces of anime on the various mass subcultures of Japan. I'm quite surprised this isn't a global core to be honest.\nYou only have to do one final paper 15 page paper, double spaced, and its contents are completely up to you. I recommend picking a topic that is relatively broad and can be supported using a lot of the text from the semester. She does reward you for digging deep into very specific analysis though, but might require more time spent on researching good quotes and supporting evidence. Basically, just participate regularly in class, and have go to supporting evidence and you will be just fine. \n\nWorkload:\n6 1 - 2 page responses about films and shows viewed for class\n1 Final Paper - 12 - 15 pages long\n"
        },
        {
            "course_name": "Millennial Futures: Culture in Japan",
            "review_date": "September 06, 2014",
            "review_content": "\nI am reviewing this class because it is being taught but the reviews are old. Ivy has a very specific kind of personality - she isn't very kind and does not hold back on harsh criticism in class. She's fine if you stay on her good side. but a couple times in class she openly criticized a student for not knowing something, and told a girl who never talked in class that she would WAIT until she said something...\nshe gave us a syllabus but it did not have percentages of components!!! she never revealed to us the percentages! There are occasional (literally on her whim - it could be three or four weeks in a row, though she said once every other week) response papers to the readings. she said she wanted them to be one full page 10 pt font.... \nshe grades these not generously. I did well but other people didn't do well who I had assumed would do well...\nFinal paper was 12-15 pages. Had no idea how much it counted...\nshe assigned a TON of reading. some of it was kind of useless - we had to read two or three novels that were just bleh. waste of my time and money. she had us buy a lot of books, some of which I didn't value at all, some of which I found educational and doable. There are also pdf's online which are a pain to read, although the topic may (or may not) be interesting. It's kind of a hit or miss, though mostly it's interesting. \nshe also assigned films to watch, which was the BEST PART. I loved her choice of films and we had great discussions about it. She is clearly very smart, but the way she lectures is not completely coherent...\nshe's kind of a harsh grader...or at least she has high expectations. I did a lot of participation and got great grades on the weekly response papers, but ended up getting a b+ on the final paper. oh well.\nWorkload:\ngraded response papers, final research paper 12-15 pgs. boatloads of reading, and films.\n"
        },
        {
            "course_name": "Introduction to Social and Cultural Anthropology",
            "review_date": "May 17, 2014",
            "review_content": "\nI took this class in the fall of 2012. \nProfessor Ivy was great, very approachable, and made the readings interesting and fun. She expects you to have completed the readings, and to contribute something to the class discussion, whether through volunteering to read or approaching her after class with questions/comments. \nThe structure of the class may have been a little disorganized, and sometimes you were required to read a large portion of a reading in a short amount of time, but they were always interesting, and the TAs were very helpful when it came to answering questions. \nOverall, this was a great way to fulfill any anthro-related requirements, and also a good way to supplement an interest in philosophical works. \n\nWorkload:\nPretty laid back, do the readings, we had like 2 pretty easy essay assignments, and you had to go to a TA discussion at least once a month. \nMandatory attendance. \n1 midterm (IDs and essay questions), and a creative writing-style final essay. \n"
        },
        {
            "course_name": "Lost World, Secret Spaces: The Child and Modernity",
            "review_date": "December 06, 2011",
            "review_content": "\nOf all my classes this semester, I learned the most from this class.  I never intentionally skipped this class, and that says a lot for a large lecture course. Ivy will give you a good background in theory without scaring you away from it.  \nThere is an inhumane amount of reading, but you can space it out over the semester.  The lectures are still helpful even if you're behind in the reading. She's a good grader and gives do-able exams.  \n\nWorkload:\nin class midterm, take home final, and lots and lot and lots of reading.  you learn a lot. \n"
        },
        {
            "course_name": "Millennial Futures: Culture in Japan",
            "review_date": "May 15, 2005",
            "review_content": "\nProfessor Ivy is wonderful.  This anthropology course on post-WWII Japan  was not only extremely interesting, but also very current.  It is one of the rare \"hip\" anthropology courses that engages in discussions of recent cultural trends in Japan such as anime, otaku culture, manga, the Superflat aesthetic, and the Aum cult.  After taking this course, you will think of Japan, America, and commodities differently.  You might also become very interested in postmodern theorists such as Jameson and Baidrillard, and the novelist Haruki Murakami.  We read many Japanese theorists as well.  In the meantime, check out the \"Little Boy\" exhibit at the Japan Society to introduce yourself to some of the visually-\nrelated topics covered in this course.  Ivy is a real scholar and does not waste her time trying to butter-up to her students.  Instead, she inspires thoughtful writing and analysis of contemporary culture.  However, it is a pleasure to listen to her vast amount of knowledge and to occasionlly participate in discussion.  In addition, Ivy herself is a wonderful writer.     \nWorkload:\nReading.  Anime-viewing.  Gallery trip.  About 4 papers.\n"
        },
        {
            "course_name": "Introduction to Social and Cultural Anthropology",
            "review_date": "January 05, 2005",
            "review_content": "\nBeneath clear lectures on anthropological and social theory, Professor Ivy has very interesting viewpoints.  In terms of class lectures, she does her job, mapping out the ideas of Levi-Strauss, Foucault, and even contemporary anthropologists.  Yet, sometimes you get a glimpse of her interest in critical and literary theory, and how anthro approaches these disciplines.  I enjoyed writing papers for this course.  There was much room for creativity as well as theory.  More than providing answers, she asks questions, revealing the contradictions within anthropology.  You will want to follow the Interpretations of Culture course with this one.  Some prior knowledge is helpful.  All in all, Ivy's a cool professor. \nWorkload:\nReading, midterm, papers, final paper: all enjoyable and fair.\n"
        },
        {
            "course_name": "Introduction to Social and Cultural Anthropology",
            "review_date": "January 02, 2005",
            "review_content": "\nWhile some people think Ivy is great, I do not agree. Having taken two classes with her, I do not think that she is a good professor. I cannot comment on her abilities as a researcher or theorist, but I did not feel that she was able to really explain the complexities of the topics that we were dealing with in class. So many of her comments seemed to be either very self-evident, or impossibly inscrutable. I did learn a lot in both classes, but it was through my own efforts with the texts. She does not lead discussion effectively, and did not do a good job of balancing lecturing with questions.\nWorkload:\nlecture class: light to moderate; reasonable amounts of reading, 5 5-page papers. Take-home final was 10-page paper.\nSeminar: impossible amounts of reading, like all anthro seminars. 4-5 5-page papers. No exams.\n"
        },
        {
            "course_name": "Introduction to Social and Cultural Anthropology",
            "review_date": "January 02, 2005",
            "review_content": "\nProfessor Ivy's lectures are decidely un-spectacular.  Never once did I leave amazed, thrilled, or bowled over with her brilliance or the depth of the material, which is, in my opinion, the mark of a great lecturer.  But, since amazement is a pretty high demand, the material is great, and Professor Ivy is exceedingly kind and seems to really care about her students, I would still recommend her.  You can certainly do a hell of a lot worse.  \nWorkload:\nA lot of reading for an intro class, but you could probably get away with avoiding most of it.  Three short papers, in-class midterm, take home final.  She seems like an easy grader (most anthro profs are).\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "January 19, 2004",
            "review_content": "\nmarilyn ivy is both one of the top in this department --quite a club actually--and (bonus) one of the nicest and warmest people you'll meet in a classroom.  but while she smiles at you, welcoming your thoughts, you can never forget that you are in the presence of a truly brilliant mind and tough critical thinker. \nread her book and you'll also see what a great writer she is.   it will wow you and cow you.  her ability to use and explicate theory clearly and carefully is obvious on every page.\nshe also clearly likes to teach students of all levels.  her subtlety and presence is such that she can discipline you with her eyebrow--as if to say, do you really think so?  she will expect you to read and write as carefully as she does, or to try to learn to do so.  \nmake the most of it when you get your 20-30 minutes of office hours.  absolutely top notch, and delightful to know.\n\n"
        },
        {
            "course_name": "Millennial Futures: Culture in Japan",
            "review_date": "December 03, 2003",
            "review_content": "\nShe's a good professor, if you understand that no, she's not listening to you. She has has a nice taste in anime (which she insists on calling 'hanime-eh') Really interesting texts (but accompanied with garbage po-mo theoretics) Great 4-point course overall. \nWorkload:\nCouple of response papers, a final. easy grader. \n"
        }
    ]
}