{
    "prof_info": [
        {
            "prof_name": "Dana Fisher",
            "prof_id": 1198,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Environmental Sociology",
            "review_date": "March 31, 2010",
            "review_content": "\nI really miss my Environmental Sociology section with Dana Fisher. It was a great class dynamic. Dana's jokes were hilarious and she was a very approachable professor. I also found it quite amusing that everyone in the class was always trying to be green. We met in 520 Math (Dana always complained about how the math department always took away the lectern) and on hot days, we suffered through no air conditioning since everyone felt too guilty to turn it on.\nThe content for the class was actually very interesting and made me understand the difficult politics of climate change. Dana taught us, leading up to the COP15 Copenhagen conference, the various issues on passing climate change legislation. For someone concentrating in sustainable development, this class was quite relevant to fully understanding the difficulty behind climate change politics.\nAlthough readings were heavy and dense, Dana went over the readings in class making it much easier to grasp.\nI definitely recommend taking the course for people interested in environmental activism and climate change politics. I still remember a lot of information from the class and continue to use it in other sustainable development courses.\nWorkload:\nOn the more heavy side of reading, midterm, final, one short environmental \"review,\" and longer environmental paper.\n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "January 02, 2010",
            "review_content": "\nI thought that Dana Fisher made Environmental Sociology quite enjoyable. I found her to have a good sense of humor and her jokes, and although they tended to go off topic a bit,  made the class more amusing and fun. \nThe lectures and readings were very straight-forward. Most of the time during lecture, however, we would go over many of the assigned reading - but since many of the readings were dense, it made the course much more manageable and approachable.\nListen closely to what she wants you to write down on the exams. Be sure to also know the authors of the works and prepared to list them on the exam (she said that the previous time, she made her students learn dates as well, but decided not to this year because of CULPA reviews). Expect a lot of memorization.\nOverall it was a solid course and I would recommend it.\n\nWorkload:\nA heavy amount of reading, but still manageable. Since you go over the readings in lecture, it makes it much easier.\nMidterm\nFinal\nTwo environmental reviews.\n"
        },
        {
            "course_name": "Methods for Social Research",
            "review_date": "January 01, 2010",
            "review_content": "\nOkay,  Methods for Social Research was not exactly the most exciting topic to take a class on, but I think that Professor Fisher did  as much as she could to make it bearable. The book was extremely dry (emphasis on \"Methods\"), save a couple of interesting case studies. The nice part was that Prof. Fisher did a decent job summarizing the readings and going through the main points. Class wasn't always boring since we always went off topic, though she always managed to cover the material (sometimes by speeding through it). I think that people ran into problems in her class because they failed to understand the simple nature of the class: if you do what she tells you to do, exactly how she tells you to do it, you'll do fine. \nPeople tried to over-complicate studies and assignments. Really, they were really simple and one could get away with doing the bare minimum. As long as you grasp the main points (at minimum), you'll do fine. Grading was not subjective: there was always a rubric. If you complete everything on the rubric, you'll do fine. \nIf you're thinking about taking this class, do it. It's really easy, sometimes time-consuming (if you try to scramble to finish stuff last minute -- and I did), but Prof. Fisher is a really enjoyable person. Honestly, she's funny and really easy-going -- someone other professors should try to learn from. \nWorkload:\nEasy, at times unnecessary, reading. Two studies and subsequent write-ups: one observational, one experimental. Three easy homework assignments and two quizzes. \n"
        },
        {
            "course_name": "Methods for Social Research",
            "review_date": "November 18, 2009",
            "review_content": "\nI completely disagree with the negative review of Fisher below me. Dana is not a life-changing lecturer, but she is friendly and and clear, and she does a good job of presenting material that is somewhat dry, but also necessary and important to learn for sociology majors. \nI have no idea what this talk of \"favoritism\" is. I have never seen Dana choose favorites. \nAnd yes, she does encourage doing simple experiments rather than big grand ones because the point of the class is to obtain a strong understanding of the METHODS for social research. She encourages students to conduct a concrete foolproof experiments that tackle smaller questions than faulty ones that attempt to be groundbreaking and have a ton of holes. \nThis definitely hasn't been my favorite class at Columbia or in the sociology department, but for a requirement on fairly dry subject matter, it definitely hasn't been a negative experience either. \nWorkload:\nnot bad, reading isn't 100% necessary since she explains it pretty well in class. 2 projects: one observational research, one experimental research. no midterm or final. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "November 16, 2009",
            "review_content": "\nWARNING WARNING WARNING \nI do not know where these glowing reviews of Prof Fisher are coming from. They certainly are not coming from her methods class. I have YET to meet a single student in the class who did not find her teaching extremely problematic. \nFor one thing, her lectures are, shall we say, of limited value. AKA she simply reads from the book. Any one of the students could give the same lecture! For another thing, as another review mentioned, her grades do not always seem related to your performance and skills. You can learn the material really well and do poorly. You can also have a mediocre grasp and do well. \nFINALLY--favoritism. This is pretty unprofessional, but also pretty obvious. It does not matter why. If she does not like you for whatever reason, you will do worse than you deserve. If she does like you, you will do better than you deserve.\nI hate to write such a scathing review, but I heard the same thing from EVERY other student I have ever met who has taken her methods class. Some got A's, some barely avoided C's. This really sucks, because this class is worth four points. So what can you do?\n1) You need to go to lecture. It's part of the grade. BUT you probably will hurt yourself if you closely read the chapters before the lecture. Then you will seem too smart for your own good, and she will not like you. Better to skim so that you kind of understand, then find a way to ask questions that show you have read, without seeming too smart. \n2) Choose easy topics for your project. She will not reward you for trying to gain knowledge in a more difficult project, and will probably penalize you. \n3) Sometimes she does collaborative projects. Do NOT I repeat do NOT work with a student she obviously does not like. Then you will be tagged by association. If you must work with this student (maybe you actually like the student), make sure to choose the option where you write your paper independently. Do NOT write a joint paper with a student she does not like. \n4) Some teachers are stimulated by being challenged in class. She is not one of them. Never challenge her in class. \n5) The methods textbook can be a good reference while you write your papers. But be sure not to include anything from the textbook she did not mention in class.\nWorkload:\nLow and high. Work is moderate and not so difficult, so low in that sense. However, the \"intangibles\" I discussed will stress you out, so high. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "July 21, 2008",
            "review_content": "\nFisher's classes generally seem to be her causally going over the course material from the book, and/or reading verbatim from them and looking up occasionally to ask or answer questions with the class. This is when material is actually gone over in class. Very often I felt that going to class was a complete waste of time being that she would discuss with a few of her favorites the intricacies of their projects while everyone else simply listened. \nThere was a lot of reading assigned, and very often it was not at all easily accessible by the students. Most people did not do the reading, but were able to follow what they were all about regardless.\nThere were a few very valuable classes which I am glad I attended which pertained directly to introductory sociology, which I found interesting. The rest was a rather big disappointment. The only reason I found myself going to class would be to listen if there were any little clues she would intentionally let slip regarding the midterm or final exams.\nI learned a lot about the process sociologists go through to collect and analyze data, but as for the overall class experience it was far from remarkable. \nWorkload:\nAbout 2 hours of reading a week, if you do it.And very manageable/reasonable written 1 page assignments.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "April 21, 2008",
            "review_content": "\nWhen I first joined Professor Fisher's class I didn't expect much. It was too big for my taste (50 stuents +/-) and lectures never seem to keep me awake. However, I was pleasantly suprised. She manages to explain all the material while being lively, creative, and engaging the entire class, but not in a professorial-im-obviously-superior way. She's completely down to earth and willing to talk to students as many times as necessary.\nThe workload is absolutely manageable: three quizzes that test the most basic straightforward sociological concepts, all of which she goes over in EXTREME DETAIL during the previous classes & two field work oriented projects. No need for citing articles you didn't actually read; you just use the concepts learned in class and apply it to basic projects, the first being an observational project, and the second an experimental one. Also, I was away from campus due to an emergency for 2 weeks and when I returned she actually approached me to let me know that I had an extra week to turn in an assignment.\nOverall I HIGHLY recommend Professor Fisher.\nWorkload:\nTwo projects & three quizzes with the lowest quiz grade dropped.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 03, 2007",
            "review_content": "\nProfessor Fisher is a lively and amusing lecturer, though many classes start out boring due to going over a sheet which will later be posted to Courseworks. When she discusses the readings (most of which you don't have to actually read - she speaks about the important details in class), she is amusing and uses many metaphors and allegories to further explain important points. Her grading is more than fair, and simply turning in your homework guarantees you a B in the class. Quizzes are simple - one is based on a text attached to the quiz, one a movie, and a third on another text. [And the lowest quiz grade is dropped.] Overall, Professor Fisher leads a good class which will increase your knowledge of Sociology, though you won't feel too guilty if you miss a few classes here and there.\nWorkload:\nLight: 3 Homeworks, 3 Quizzes (Lowest dropped), 2 Major Projects, No Midterm, No Final.\n"
        },
        {
            "course_name": "Civil Society",
            "review_date": "April 03, 2006",
            "review_content": "\nAdmittedly, I was excited during the beginning because Professor Fisher seemed as though she would appeal to my Democratic political stance. However, expect no political comraderie from her. She's extremely professional in her handling of the rules, but generally in line with many of the reviews already written about her. Her lectures tend to be a bit digressive, there's an extremely esoteric air of ivory tower verbosity that permeates the classroom (the time of which is monopolized by sociology grad students), and everyone save for a few earnest critics seems afraid to admit that the material is theoretical to the point of being spacey, inapplicable, and generally frustrating if not understood the way its \"supposed to be understood\". She also leads you into thinking it will be an easy class which is a complete letdown come around grade time.\nWorkload:\nDepends on your attention span with some of the readings. 1/2 a book per week, approximately. One midterm, and final research paper.\n"
        },
        {
            "course_name": "Civil Society",
            "review_date": "January 22, 2006",
            "review_content": "\nI agree with a lot of what was written below. I was very frustrated by class discussions. Someone below said they \"rarely (if ever) focused on the readings.\" They rarely (if ever) focused on anything. But I agree that if this is what a grad seminar is, there's no way I'm going to grad school.\n\n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "January 19, 2005",
            "review_content": "\nOk, I agree with everyone else on this point: Prof. Fisher is nice and engaging.  I would even go so far as to say that she's a very likeable person.  Her class, however, is on the inane for anyone with a prior background in sociology.  While I didn't mind going to class (overall, the class has a very laid back atmosphere), sessions were neither necessary nor particularly easy to stay awake through.  The readings were fine, but I would almost reccomend not doing them if you're planning to attend class: if you have read (and understood) them, you'll likely find yourself overwhelmed at the inability for the discussion to make itself on-topic, or even particularly interesting.\nWorkload:\neasy, if slightly annoying: two short papers on environmental events, and a memorization-laden midterm and final\n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "December 31, 2004",
            "review_content": "\nI took this class as a first year, not knowing what to expect, but coming in with my interest in both sociology and the environment. I was shocked to see how economics-based this class is. You really should have some kind of background and an understanding that the world revolves around money. Overall, this class was good and interesting. Fisher basically sums up the readings in class through her powerpoints, which she later posts on courseworks, but in order to do well on tests, you need to be able to give examples from the text, so i recommend doing the readings.\nWorkload:\nMidterm, final, two papers - one short one and one long (5-7 pages?) where you have to review an environmental event and relate it to the text. Not too hard but it requires a good understanding of the material.\n"
        },
        {
            "course_name": "Civil Society",
            "review_date": "May 16, 2004",
            "review_content": "\n(1) Class discussion rarely (if ever) focused on the readings.  Inane and superficial class discussions will shock any student thinking s/he is registered for a grad seminar.\n(2) She has ZERO attention span.  (3) It is not hard to get an A on the final paper.  Spend three days instead of 1 on it, and your A is made.\n(4) Great intentions, but this class needs so much work.  It looks structured from the syllabus, but then you go, and wonder why the syllabus even exists.\n\nWorkload:\nStrange.  You have to memorize the dates of every journal article you read  for the midterm.  WHY?!  The first two papers are a joke.  The last requires some outside research, but is glanced over.  \n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "January 18, 2004",
            "review_content": "\nI agree with the other reviewer, Professor Fisher is very skilled at leading discussions -- she often jokes with students and strikes a good balance between sticking to the material and allowing us to go off-topic onto subjects that interest us personally.  \nShe pretty much covers all the information from the readings in class, which makes it easy to slack off -- but beware! -- her exams require a lot of memorization -- particularly for the midterm, you must know all the names and dates of all the authors you have read (approx. 2-3 per class), so that requires some tedious memorization.  She is not a particularly tough grader, however, and the class lectures are worth the tedium of readings.\nWorkload:\nmedium.  approx 3 journal articles per class, 2 short papers (reviews of environmental goings-on in  NYC) and a final\n"
        },
        {
            "course_name": "Civil Society",
            "review_date": "May 22, 2003",
            "review_content": "\nProf. Fisher is a wonderful person, who is able to engage with students. She is energetic, personable, and builds relationships with students. Her class, however, needs some work. In any one of her classes, there was probably only about 15-20 minutes of substance, and the rest was mostly off-topic conversation. The substance portion saw the class discussion dominated by the two grad students, who were usually over everyone else's heads. Outside of the interesting \"Bowling Alone\" and the boring Habermas, the material came largely from the written works of Prof. Fisher's friends, colleagues, and contemporaries in the last five years. I have never been in a class where much of the reading was simply debating the existance and/or definition of the class title. Prof. Fisher alone makes this course fun, but it's a matter of substance and style. Also, she is not really clear on her grading system, making those who come thinking that they'll get an easy \"A\" surprisingly burned in the end.\nWorkload:\nReadings that are not overwhelming, and Fisher passes out summaries and outlines of them anyways. One paper on a civil society event that she tells everyone at the beginning of class that they'll get an \"A\" on if they turn it in, but then doesn't give everyone that grade. Also, midterm, final.\n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "April 04, 2003",
            "review_content": "\nGreat professor. Young, personable, and engaging. Really interesting class discussions. Take whatever you can with her, she's fantastic.\nWorkload:\nMidterm, Final, 1 short paper. Not bad at all.\n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "December 03, 2002",
            "review_content": "\nI've really enjoyed this class with Prof. Fisher. She's young, dynamic, funny, a great dresser, and really personable. Her lectures are very organized and thoughtful, and her online lecture notes are a big plus. She's very interested in what her students have to say, and at least 10 minutes are dedicated to discussion. The readings can be a little overbearing, especially the old school sociology readings about the evils of capitalism. But one look at her shoes and you'll realize she's not really into it either. Anyway, it gets much better later in the semester. I'd recommend any class with prof. Fisher--no matter what the subject she'll make it fun and interesting. \nWorkload:\nnot bad--lots of reading, but she goes over it well. 2 short papers on environmental events in NYC, midterm, final. \n"
        },
        {
            "course_name": "Environmental Sociology",
            "review_date": "December 03, 2002",
            "review_content": "\nI've really enjoyed this class with Prof. Fisher. She's young, dynamic, funny, a great dresser, and really personable. Her lectures are very organized and thoughtful, and her online lecture notes are a big plus. She's very interested in what her students have to say, and at least 10 minutes are dedicated to discussion. The readings can be a little overbearing, especially the old school sociology readings about the evils of capitalism. But one look at her shoes and you'll realize she's not really into it either. Anyway, it gets much better later in the semester. I'd recommend any class with prof. Fisher--no matter what the subject she'll make it fun and interesting. \nWorkload:\nnot bad--lots of reading, but she goes over it well. 2 short papers on environmental events in NYC, midterm, final. \n"
        }
    ]
}