{
    "prof_info": [
        {
            "prof_name": "Kim Lee-Granger",
            "prof_id": 1922,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry Lab",
            "review_date": "November 19, 2005",
            "review_content": "\nI had Kim as the instructor during the lectures/head TA and I find it impossible for people to view her as friendly, nice, and funny. This lady not only has a deafening voice which adds to an already formed migraine headache due to the stress of taking quizzes, but she is unnessarily overbearing. Personally, she is not a thumbs up in my book. \nWorkload:\nThe amount of work is rather insane: prelab (1-3 hours depending on the lab), post lab (2-4 hours depending on the lab), quizzes (at the beginning of every lecture, strictly timed, on the lab from last week and the lab you are about to do), and of course don't forget the actual lab time which takes 3-4 hours depending on the lab (the last 2 or 3 labs take the longest). Grades: all depend on your TA, mean = B+, so if you want to do well, other people need to do poorly. One good thing is that the class itself ends about 3 weeks before other classes end. \n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "May 10, 2004",
            "review_content": "\nIn a sentence Kim is a very nice person, a good teacher and certainly your best option when it comes to G-Chem Lab.\nKim was the head TA for my Chem Lab section. She gave a prelab lecture and due to the size of my lab, she graded my labs and quizes along with about a dozen others. She is a very nice person, is very understanding if you make a mistake on the lab and want to hand it in later that day and is generally a helpful individual. Her quizes were fair, I just didnt study for most but the ones i did study for were quite easy. I got a few points off perfect even without studying. In general her grading was fair, she cared A LOT about the calculations so watch out, be sure youÂ’ve got those down cold. SheÂ’s very receptive to questions and she doesnÂ’t mind questions or helping you out during lab. She is strict with safety but I donÂ’t blame her. She doesnÂ’t get pissed if you break something and she understands that everyone just wants to get out of there as soon as possible. Her lectures are semi-useful. She is clear and concise and gets right to the point, though you can pretty much find a majority of what she says in the lab manual. Listening to her isnÂ’t such a bad idea though. She is DEFINITELY your best option for this class!! Qazi Hai was there during the final and the man seems like a freaking nut! He was rushing everyone and was yelling left and right and telling everyone to hurry up every three seconds. Definitely go for Kim or switch to her section. It seems that in comparison it is a much more relaxing atmosphere. \nWorkload:\nALOT! Prelab (Procedure, Materials etc) copied in your lab book before each lab. Weekly 20 point quizes about the lab before (which you should study for). A structured writeup for the lab including calculations and discussion questions which are annoying. And a final exam which is just doing a lab on your own, then calculations and a few quiz questions.\n"
        },
        {
            "course_name": "G. Chem Lab ",
            "review_date": "April 15, 2004",
            "review_content": "\nReading these other two reviews, I began to wonder if they were talking about the same Kim who was my lab instructor for night chemistry. Unlike the other two reviewers, I found Kim to be rather unhelpful, a little bit snotty and unfair as she would pay more attention to the guys in the lab than us girls. People would stroll into lab 30 minutes late and hold the entire class back and she would just let things go, but if you forgot to wash your hands as soon as you took off your gloves or accidentally cut yourself on a piece of glassware (like my lab partner did one night), you would get a ten minute lecture. Sure, I don't really want a TA that is way too strict and a hardass, but at the same time, when I spend 4 to 5 hours a week preparing my procedure, AT HOME, like we are supposed to, and someone else is allowed to write up their procedure in class or have Kim do their lab for them, without being penalized, that's just unfair and unprofessional, IMHO.\nStick to asking Qazi questions as he is more knowledgeable and a nicer person!\nWorkload:\nA lot. Expect to spend at least 20 hours or more a week preparing your pre-lab procedure, studying for the quizzes, doing the lab writeup and actually attending lab.\n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "February 11, 2004",
            "review_content": "\n\"Kim\"- as she likes to be addressed as- is a fun yet serious, witty yet knowledgeable, easy going yet strict TA who is all in all the best G-Chem TA you can ask for.  Honestly, she is the easiest, if not the only TA, to understand, and she is the best TA to go to for advice or answers to questions.  Although she's an extremely busy instructor/TA, she makes the time to work with you and to help you when asked.  She is certainly strict in the labs, as all teachers should be granted that the smallest mistake can cause the severest consequences in a chemistry lab.  When it comes to the lab grading, she is fair and understanding.  If you put in the amount of time deserved to a 3 point course, you will do fine.  You will definitely leave the course learning something.\nWorkload:\nLab preparation write-ups, weekly quizzes, weekly five hours (or less) labs, discussion write-ups, and a final.\n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "January 07, 2004",
            "review_content": "\nKim acted as the main professor in this class (I never actually saw Turro).  She came off really harsh in the beginning, stressing the rules, all of the places you can lose points, how much work you have to put in, etc.  The class is a lot of work, but Kim will go out of her way to find you if she thinks you need help.  There is almost always someone in the office to give you extra help.  There isn't much hand holding, but if you show that you are receptive to being helped the TA's will try to make the class as painless as possible.\nWorkload:\nEvery week you have to write out the procedure for the lab, take a 5 pt quiz on the procedure, a 20 pt quiz on the previous weeks lab, and a write up of the previous week's lab which includes discussion questions.\n"
        }
    ]
}