{
    "prof_info": [
        {
            "prof_name": "Frances Pritchett",
            "prof_id": 289,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "January 22, 2009",
            "review_content": "\nThis class was a waste of my time last semester, apart from the fact that it goes towards a major requirement.  The first 20-30 minutes were spent looking at Prof Pritchett's website, which she has compiled to have images of essentially all that is visual to do with India.  It's a great website, a great source of information, but she'd rush through what we were seeing so fast that I'd have no idea what she was talking about.  Furthermore, none of what she showed us or said in that part of the class was important for any part of the final exam (no midterm, which was nice).  Then Prof Pritchett would lecture from her notes for the rest of class.  This was the really painful bit, since she was trying to get across her clearly enormous knowledge as quickly as possible, making her lectures incredibly dense, confusing, and usually disorganized.  Looking back over my notes while studying for exams, I often found that we'd be going in circles through time, going back to people we'd talked about at the beginning, and usually for no good reason.  \nOften, Prof Pritchett would read to us long quotes from the textbook reading that we'd already done.  This wouldn't be too bad except that Stein's History of India was incredibly dense and not particularly well-written.  The copious assigned primary source readings were not important to your success in the class.  I didn't do them for the second half of the semester and was happier for it.  \nAttendance was taken by a system of comments that we had to write about the reading assignment which were to be handed in at the end of class. \nProf Pritchett clearly is knowledgeable on the subject matter of the course and truly loves that subject, but she's not a good or clear lecturer, most importantly in not really stressing what she actually thinks important enough to end up on the final exam and what's just other.  \nAll the final exam ID possibilities from each class are posted on line at the end of each class.  Many of them were barely covered in the readings or in lecture.  Wikipedia is your friend.  \nWorkload:\nHeavy textbook/primary source reading (I'd suggest doing the textbook reading since it will help for studying for the final; leave the primary sources as optional if your interested).  Two 6-7 page essays with given topics tangentially related to the course.  No midterm.  Hard-ish hinal exam.  \n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 11, 2008",
            "review_content": "\nThe class is entirely confusing.  The assigned readings are very long, dense, unrelated, and completely unnecessary.  Pritchett divides her lectures into 2 halves: pretty picture time and Indian name time.  The first half she shows maps of India, Indian Gods, heroes, and anything else she can get her hands on.  She spews out names of Indian places and people, and you won't even be able to tell them apart.  She doesn't understand that the class has no idea what's going on, and doesn't bother to write any of those names or places on the board.  The second half she reads from her notes.  Here she throws out so many names that it's impossible to follow.  She has so many things to say and so little time that she tries to say everything and never actually teaches important things to the class.  She never touches upon things that you might actually need to know for the final, or god forbid, the midterms.  You must go to lecture, though, because you must turn a comment about the readings as a form of attendance.\nOn the upside though, the readings are basically optional.  She's like an Indian encyclopedia, she knows EVERYTHING about India, and I really mean everything.  There are only 2 homework assignments: 2 essays, each 6-7 pages long.  The midterm is taken directly from her website and she tells you everything you need to know.  The TA's grade the essays, which is very unfortunate. One TA is a much easier grader, pray you get him or you will not get an A in this course.\nDon't expect to learn anything from the readings or lectures.  Everything you need to know can be found on wikipedia, seriously.  Read a few wikipedia entries before class and you're all set.\nWorkload:\n2 essays (6-7 pages each)\n1 final, based off her website notes\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2007",
            "review_content": "\nUnique style- 1 hour discussion led by a student and 1 hour discussion led by her. \nVery laid back class, informal. Everyone voices whatever they think and no perspective is too ridiculous to argue. \nShe doesn't seem to know very much more than the students, so if you enjoy arguing on equal footing with a professor, go for this class. Basically, this is a class for arguing with others students about great literature. \nIf you want a brilliant lecture every class, stay away. \nWorkload:\n2 6-page papers. Post a paragraph comment before each class. Lead 1 discussion in class. Hard mid-term. \n"
        },
        {
            "course_name": "Islam in South Asia",
            "review_date": "September 08, 2007",
            "review_content": "\nProf Pritchett is an extremely knowledgeable person and has a lot to share with her students. Some of her lectures can be a little dull at times, and she's a little too enthusiastic about her website, but she's still a fabulous teacher. The class is a great overview of the history of South Asia and includes insider trips to never seen exhibits at the MET! A must for anyone interested in South Asian culture and history!\nWorkload:\nLots of weekly reading, most is very interesting. 2 6-8 page papers, and 1 final which is EXTREMELY easy if you've done the readings since she tells you exactly what will be on it.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "January 16, 2007",
            "review_content": "\nThe previous reviewer obviously did not read the syllabus or exam prep instructions for the course. Firstly, I would like to correct the misstatements that were made:\n(1) The 125 items for memorization were not 'slide IDs'. They were terms (people, places, events, etc.) that she selected from the lectures and readings. She also gave us the terms fairly quickly after each class, so there isn't much excuse for not having time to find the appropriate information. The final had no visual component.\n(2) Attendance was not extra credit.\nBoth Professor Pritchett and the TAs for the course were very amiable and willing to assist throughout the course. The lectures really supplemented the readings, highlighting the main points that students needed to know. This allowed for efficient skimming of the materials before class, as an in-depth understanding of the readings was not requisite. \nThis style of learning helps fit to the professor's purpose in the course of giving student's conversation material for their Indian peers or for their future journeys to the subcontinent.\nClass time does lack a great cohesive structure, but that makes the class much more of a conversation about India rather than narrative. This really can be a positive or a negative, depending on the student. \nOverall, I would highly recommend this class. \nWorkload:\nFinal Exam, two 6-7 page papers (one each at midterm and the last week of class), attendance (turn in a 1 paragraph comment to record). Overall, if one keeps up fairly well over the semester, the workload is rather minimal\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "December 19, 2006",
            "review_content": "\nEverything that you've read so far about this class is pretty much dead on. I'm not one to come on here and bash professors, but since this is only the second time in 4 years that I've  rated a professor, you should know how serious  I am. This class was the biggest waste of time and money. It's not Prof. Pritchett isn't nice...she is very nice. The main problem lies in the fact that she just doesn't get the principle ideas of instructing. She is truly a complete encyclopedia of Indian Civ knowledge and could obviously regurgitate any fact about India in her sleep. BUT it seems as if Indian culture is so ingrained in her, so \"second nature\" to her, that she has completely forgotten how to teach it in lay terms. The reading was somewhat straightforward, but her lectures were completely lacking in structure and basically void of any real \"meaty\" content. After having to admire her highly decorated website for 10-15 each class and stare at pictures upon pictures upon pictures, most of which were not relevant to the lecture, Prof. P. would just vaccilate back and forth between Indian names resembling eye charts (without writing on the board) and sporadic insight about the literature of India. Most of the time, I left the class trying to figure out what the main point of the lecture was. That's pretty much it. Unless you're extremely interested in Indian Civ, I would definitely think twice about taking this course. If only I would've read the Culpa reviews before registering for this class...Oh, one more thing, the 125 slide I.D.'s you have to memorize for the final..she gives you a list of vague title for these images, but they're NOT labeled on the website. At least in the 4 Art History courses I've taken, the professors had the sense to label the images that we were required to memorize. Enough said.\nWorkload:\nLots of reading, some of which is interesting and to the point, 2 6 page papers (not too bad), and a final. Extra credit for attendance (daily comments turned in to record student's attendance.) If not for this, then no one would be there. Seriously.\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "October 29, 2006",
            "review_content": "\nFrancis Pritchett is a smug know-it-all of historical garbage that no one ever cares, has cared, or will care about. The class is a miserable melange of random facts about long gone Indian kings that have little or no effect on contemporary South Asia. The only benefit to this class is \"pretty picture time\" at the beginning, beccause the lights are low and it's a opportuity for a nap time. \nShe loves her precious website and constantly reminds the class of it, as if we actually care enough to spend one microsecond more thinking about Indian Civilization than they are forced to.\nThis class teaches almost nothing about Hinduism, Buddhism or anything valuable, actually. This is a terrible option for Major Cultures. A terrible, terrible option that will make you wish to put your own eyes out right after pretty picture time.\nWorkload:\nannoying reader responses every class2 6 page papers final exam\n"
        },
        {
            "course_name": "Readings in Urdu Literature I",
            "review_date": "February 14, 2006",
            "review_content": "\nWhat a sweet lady!  She's so passionate about poetry that its sort of embarrassing because I don't have that passion, especially as a South Asian.  This class is for those who enjoy taking a relaxing class during their hectic coursework.  Light reading although can take some time if you aren't familiar with the Urdu language, especially since some have tons of Persian in it.  Good-hearted lady who really wants you to do well and enjoy Urdu.  Plus she grades each student on an individual basis, i.e. not comparing him/her to the rest of the class.\nWorkload:\n50% of the grade is your individual project and the other 50% is your class participation/attendance and final..not bad if you are an Urdu lover.\n"
        },
        {
            "course_name": "Islam in South Asia",
            "review_date": "August 24, 2005",
            "review_content": "\nI had no prior knowledge of Islam or South Asia, and I found this class interesting and informative.  I appreciated Prof Pritchett's occassional walks down the primrose path, sharing moderately relevant photos or artwork that she enjoys, and found her charming, supportive and infinately available.  She truly seems to want her students to walk away with a real appreciation for South Asian culture and a working knowledge of Islam's impact on that culture.  She tries to tailor her class to that end, rather than on rigorous exams or long papers.  It's an easy class that served as a nice afternoon \"break\" from the hard-core schedule that I carried last semester.  You can do well in it with no prior experience in either topic, and the professor will do her best to keep the lectures informative and fundamental.  I would recommend this class. \nWorkload:\nEasy: lots of reading (which you better do if you want to pass the exam), but hardly any assignments and an easy final (if you did the reading)\n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "May 29, 2005",
            "review_content": "\nI think the below negative reviews of Prof. Pritchett a little skewed, made by somewhat slacker students (one got a B+ and self-admittedly said s/he did no work) who were probably expecting the class to give them cultural insights into Monsoon Wedding, or that hot Indian dance number in Moulin Rougue...please.   Yes, at times her class can be a drag with the same lights-off, let's look at the pretty pictures procedure, but all in all it def. is NOT the worst class you will ever take, but rather if you have a genuine interest in Indian Civ. then you'll probably enjoy it and appreciate her sincere love for the culture.  She is SO sweet, and if you ever take the initiative to go to her office hours rather than bitch about how much you hate the class you'll get a lot more out of it. She knows her stuff.  \nWorkload:\nA few random papers and a straight forward final. Not very difficult if you did the readings. \n"
        },
        {
            "course_name": "Introduction to Indian Civilizations",
            "review_date": "March 28, 2005",
            "review_content": "\nOne of the worst mistakes I have made during my stay in Columbia is disregarding numerous suggestions to take this class with Prof. \nMcdermott. Pritchett has an affable personality at times, and I can understand how people interpret her to be sweet. I found her to be haughty on various occasions - for what reason I dont know because sitting in her class is as exciting as watching paint dry. Her appreciation for Indian culture is great - until of course she begins to recite ghazals that butcher Urdu, or speak about how 'she must have been Indian' in another lifetime. I expect cliched sayings like these from the Simpsons, not Columbia U. The only  reason the class isnt half empty is because she requires 'a thinking record' which in her world is a way to mark attendance by having students write a few sentences on the readings. Half the time in class you will be contributing to her course website - meter, because she likes to show pictures even when they are not all that relevant to the readings. All in all she is someone who knows her matter and can convey that knowledge to you if you are willing to pay attention in class (the lights are almost always off), but the department has plenty of other professors who can help you grow appreciation for the subject matter and you can actually walk out of class not doubting that you go to an ivy league school. \nTAKE MCDERMOTT! \nWorkload:\n2 papers (you can write about anything once you get clearance from the TA) and a final. Reading that you dont have to do, except for the 'thinking record\". \n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "January 02, 2005",
            "review_content": "\nDo not take this class, trust me.  I know that CULPA is worried about skewed reviews due to students writing reviews because they either loved or hated the class.  I am writing this review because they want reviews from fair-minded people.  So trust me, this is the worst class I have taken at Columbia.  The only reason to go, and Prof. Pritchett knows this I'm sure, is to pass in the short blurbs that you have to write for every class on the reading that you didn't and don't need to do.  Prof. Pritchett is a sweet woman, absolutely, but I think the vastness and the lack of coherence of \"Indian Civilization\" is what dooms this class.  The lectures are incredibly dry and seem to have no goal.  She does have a pretty incredible website from which she shows pretty pictures in class.  If you are interested in the subject, it would certainly be a great source.  Class consisted of random ramblings on nothing in particular with her spewing names that she does not put on the board and noone really has a chance to spell.  Wednesday classes end with a group discussion with TAs, there are two groups.  These are utterly useless except for comments about papers perhaps.       The good news is that the class is pretty easy.  I got a B+ for doing absolutely no work besides the two papers and studying REALLY hard for the final.  You do not have to have taken any notes or done any of the reading to do well.  The paper topics are a choice of three random topics that consist of reading a work and writing about it.  Grading is pretty lenient.  The final consists of memorizing about 125 IDs that are listed on the aforementioned website from which only 12 are chosen.  You only have to write a couple sentences about 10 of them.  Then there is an essay which I completely BSed.  The class was terrible, but not that hard, so make your own decision.  I promise that this review is fair.\nWorkload:\nTwo 6-8 page papers on random topics.  I wrote on an Indian play and on the first part of Gandhi's autobiography.  No midterm.  Relatively easy final if you're willing to research and memorize all fo the 125 IDs.  I think 100 pages of reading a week, but I never read a word.  Attendance is counted by passing in the inane blurbs on the day's readings.\n"
        },
        {
            "course_name": "Islam in South Asia",
            "review_date": "July 08, 2004",
            "review_content": "\nLike all the other reviews say, she's a very sweet and enthusiastic lady and clearly loves the material.  But, unfortunately, she is not a very organized or clear lecturer.  I came into this class with no previous knowledge of South Asia and was expecting a clear account of how Islam developed in the region.  Instead we looked at a lot of art work which was not interesting to me at all.  Her lectures had nothing to do with the reading and rarely covered any relevant material.  Overall I learned a lot from the class--but mostly by studying on my own for the exam (I basically reread ALL the material and taught myself the entire history she should have taught us).  I rarely enjoyed going to class and had participation and attendence not been such a great part of the class I wouldn't have gone as often.  Most times it was a waste of time, in my opinion.  There were plenty of students who were obsessed with South Asia and really loved the class.  That just wasnt me.\nWorkload:\nLots of reading (about 200 pages a week) which you had to do if you wanted to learn, because she never taught the information in class.  Participation played a large part in grades, too.  She also has everyone be a \"discussant\" (which is a real word!) at least twice during the semester and then you're basically responsible for teaching the class.  2 short papers and a final exam\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 12, 2004",
            "review_content": "\nLike others have been saying, she is a wonderful woman, however if you would like to be taught by a professor and not your fellow classmates, stay away from her class. I felt that she should have just stayed teaching her middle eastern material. She has a great personality and always wanted the class to go to her outings (I went to a few...all fairly nice). But when it comes down to course work, the students did all the work. Yea, the last hour (which really wasnt an hour for her...more like 30mins) was taught by her, but after she was done making certain points in the book, she would call on people she knew didnt read the book, or really didn't have anything to say...Now I know that's what an instructor should do, but knowing that other Lit Hum prof. were teaching for 2hrs, and this woman wasn't...it really bothered me. Nevertheless, if you're looking to be taught, stay clear of this class...If you want to lead dissucions, hand in daily comments, and teach your fellow classmates what you weren't trained to teach, then hey, go for it!\nWorkload:\nSame as every Lit Hum class. Unlike some classes, we actually got through all the books, like is good for the final. 2 papers in the semester, 6-7 pages each; daily comments that have to be handed in class about the material read (for attendence), and it also must be posted online before 12am the night before the class; one of her mid-terms and one departmental final. NOTE: She makes it very clear that her midterm will be MUCH HARDER than the final. Now it isnt really that bad...that is if you do all the reading. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 17, 2003",
            "review_content": "\nShe is nice and friendly and has a system in which a student (called, the discussant) runs the class for the first hour, which everyone has to do at least once per semester, then a 10-minute cookie break with cookies provided by that day's discussant, then she leads the class for 40 minutes where she goes over administrative stuff like papers, midterms, and parties, and she gives us some of her favorite quotes and calls on the people who didn't speak for the first hour.  She grades the two papers based on content but she makes grammar corrections just to help you out.  She definitely loves the Core and the Iliad but doesn't really teach much which can be good because it forces the students to discuss it amongst themselves and come to their own conclusions.  Of course she does interject with her own comments.  To help your grade, participate in class as much as you can, don't be absent and don't be late.\nWorkload:\nRead books, answer discussant's question on courseworks for every class (not graded but checked), write a short comment with a rating for each work to be handed in and not graded for every class when it starts (this is her way of checking attendance-you can always just print out your comment from courseworks), two 6-7 page papers, hard midterm with identifying quotes which she makes up, easy department final.  Just read the books and you should be fine.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 06, 2003",
            "review_content": "\nProfessor Pritchett is a REALLY nice lady. I dont think i could have sat through lit hum at 9 in the morning with anyone else. I really enjoyed her class! \nWorkload:\nlike every lit hum class\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 22, 2003",
            "review_content": "\nProfessor Pritchett. What can I say.  She is an interesting lady, very animated, and really seems to believe in the Core.  She is a teensy bit full of herself, and gives off a kind of haughty vibe on occasion.  She really is sweet though, and she insisted that every class we take a 10 minute cookie break (which was nice).  She really tried to make Lit. Hum a good experience...inviting students to dinner at her apartment on Morningside Drive and taking a field trip to the Met (which was actually really cool).  My complaint would be that she didn't teach enough.  Basically, every class, the first hour was led by a student, and the second hour she would lead.  I found myself wishing that she was more knowledgeable about the books themselves, and that I didn't have to hear my classmates talk so much.  You really have to get to know Professor Pritchett a little to start to like her...I remember talking to her about her college days, and I was really impressed when she told me she just randomly decided she wanted to see the world, so she bought a \"round the world\" plane ticket, (which is something they don't do anymore, sadly) and just went.  She ended up loving India, and now she teaches in the Middle Eastern department.  Yet she is somewhat offputting, and I would guess that a majority of people in our class would not review her positively.  The bottom line is, she really is a nice lady, and you could certainly do a lot worse!\nWorkload:\nThe usual lit hum.\n"
        },
        {
            "course_name": "Readings in Urdu Literature I",
            "review_date": "September 08, 2003",
            "review_content": "\nProf. Pritchett is a sweet and helpful lady.She's also famous in southasian studies circles, but you wouldn't know it from her friendly, self-deprecating manner.  If you have an elementary or an intermediate level grasp of Urdu, you'll enjoy and greatly benefit from the class. If you are directly from India or Pakistan, or your parents speak it at home and you are fluent, avoid this class. Her accent is sometimes a little too...errr...well, let's put it this way--if you were blindfolded and she spoke Urdu to you, you would know you were not in India or Pakistan. She is extremely knowledgeable on history and culture but lacks analytical depth needed to understand tough poetry and prose. I sense she is threatened somewhat by native speakers with a background in Urdu studies and very at ease with non-Southasian Indophiles, and can be cold to you if you are in the first group. I appreciate her enthusiasm and effort in Urdu Studies, but she should only be teaching at the undergraduate level. To give you an indication of what to expect: First class, expect maybe 15 peopleto show up. 5 or 6 will be fluent or near fluent speakers or grad students. Next class expect the 5 or 6 fluent speakers and any grad students with a southasian background not to show up...for the rest of the semester!\nWorkload:\nlight, superficial analyses, undergrad level\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "January 20, 2002",
            "review_content": "\nOK, I just read the reviews of this  class and found them a little  confusing. Prof. Pritchett is a little  zany and is very enthusiastic, but the  quality of the class drops as time  goes on. She isn't a great lecturer,  but is a very sweet lady (when I went  to her office hours she gave me this  really gross dehydrated milk candy to  compensate for a grading error by  the TA). The silly thing about this  class is that YOU DON'T NEED TO  DO ANY READING!!! You aren't  tested on the reading. The midterm  and final were both completely  identifications of text and pictures.  She gives you a list of the texts that  they could be, so all you have to do is  figure out which characters are in the  Bagavad Gita and what the Rig Veda  talks about to ace that part. The  pictures are all on the website, so  it's easy to memorize them. Plus,  partial credit is easy to get. The  papers are on subjects of your  choosing, so you can write on the  one sentence of the book you read.  To sum up, a stoned toad could get  an A- in this class without doing  anything other than memorizing and  regurgitating. On the other hand, you  won't learn very much about Indian  civilization. The actual content  covered could be summed up on a  travel brochure or on the back of a  bad romance novel set in India.\nWorkload:\nUnnecessary and light. 4 reading  responses, a midterm and a final\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "May 06, 2001",
            "review_content": "\nI was not surprised to find a couple negative reviews for Professor Pritchett related to her Indian Civ course. I do not doubt that these plaintive and banal criticisms came from the several students who were too preoccupied with their own cultural hypersensitivity to actually to listen to Prof. Pritchett's insightful lectures. There were many students who mistook the discussion time at the end of each lecture to be an open-fire on Prof. Pritchett's supposed disregard for Indian citizens. This is ridiculous. I personally believe that Prof. Pritchett is an engaging intellectual who is not too self-conscious to show her almost child-like awe and respect for the beautiful, innumberable works of Indian art and literature that we cover in class. For those of you in my class who complained of having to familiarize yourselves with too many 'facts' that span 'thousands of years', what did you expect from a civ course that covers a nation as ancient as India? I highly recommend this class for those who are genuinely interested in immersing themselves in India's rich history.\nWorkload:\nA lot of reading, and keeping up to date with the website (which, by the way, is incredibly helpful). Web board postings are encouraged, but not required. Tough midterm and final, but fair in the selection of material.\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Pritchett knows her matter, she is actively involved and offers you immense resources. As with all cultures classes, it helps if you are interested in the subject matter, but if this is the case, you will find her (and especially her brilliant website) to supply with you with whatever you need or would like to know. She has a pleasant way with people, and moves at a good but reasonable pace.\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "December 31, 1999",
            "review_content": "\nThis has to be one of the most disorganized, badly-managed courses I have ever taken. The class is one hour and twenty minutes of dry lecture, and then five minutes of discussion, where all the students are expected to sumarize their opinions of thousands of years of history in a minute or less; this is, needless to say, impossible. Although I have an avid intrest in this subject, I spent most of class gazing longinly at the clock, counting the seconds 'til dismissal. Human interaction via recitation sections is replaced by an online message board run by the TA's, who do not help further your understand the material at all (this was the worst thing about the course).\nWorkload:\nThe midterm is ultra-specific - it does not test understanding of the subject, but instead forces students to memorize fact after fact, date after date - the whole subject then becomes dry and tedious.\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is undoubtedly the worst course I've taken at Columbia during my three semesters here. Lectures are dry and meaningless- Prof. Pritchett often merely recites statistics from the reading without adding much additional insight. It seems as though she had just learned the material herself a few hours before the lecture. My TA was especially waspy. Avoid this class at all costs!\nWorkload:\nreading intensive, often pedantic\n"
        },
        {
            "course_name": "Introduction to the Civilization of India",
            "review_date": "December 31, 1999",
            "review_content": "\nI disagree with the other reviewers. Prof. Pritchett shows genuine interest and passion for the material, which is always a plus. There is a large amount of facts that she has to get through, and at times she breezes through these facts too quickly, but ultimately her goal is to get the students interested in India. She spends the last twenty minutes showing online slides, often simply because she thinks they are beautiful. Unfortunately, she also tests on these slides. The biggest problem with the class was the assigned textbook \"History of India\" by Burton Stein, which was, without exaggeration, the MOST POORLY WRITTEN BOOK I HAVE EVER BEEN ASSIGNED IN MY ACADEMIC CAREER. So here's a tip: don't bother reading it, because the exams are all on the primary texts in the source reader and on the slides.\nWorkload:\nA little tough, but not too bad. I think a little too much is expected considering that most of the people in the class are taking it for a requirement and that it is an introductory course. Midterm and final with lots of IDs of quotes and slides, and four two-page essays.\n"
        }
    ]
}