{
    "prof_info": [
        {
            "prof_name": "Simha Sethumadhavan",
            "prof_id": 3429,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Computer Architecture",
            "review_date": "May 19, 2016",
            "review_content": "\nI would not recommend this professor or course. A brief summary of two takeaways:\n1. The course is artificially difficult exacting rote memorization of content delivered verbally rather than quantitative skills or abstract thought.\n2. Timely feedback was not provided, grading seemed arbitrary and contradicted the syllabus.\nSethumadhavan is knowledgable and encourages discussion during class. He waits for students to think through the examples he gives, entertains follow up questions and does not rush through the material. The midterm was challenging and a good opportunity to apply cache optimization techniques to a benchmark of scientific software. \nSethumadhavan verbally delivered the majority of the content for the course. During this time he drew hundreds of rectangles on the blackboard to illustrate the interaction of different computer hardware components. This often seemed frivolous and distracting. Lectures were sometimes obfuscated by sloppy or incomplete handwriting. Slides might help to organize and deliver important concepts clearly and concisely. \nGrading seemed arbitrary and feedback was delivered late, if at all. No comments were provided on the implementation section of the midterm and the grade was returned the day before the final. After the course finished in May, the homework was decreased by 10% of the total grade and the midterm was increased by 10% of the total grade contradicting what was stated on the syllabus and on Canvas throughout the semester. \nCS is a broad field. Some courses may be challenging due to inherently abstract or mathematical content. This is not the case with computer architecture. If you study computer systems or are an aspiring computer architect you may enjoy certain aspects of the class; others may feel that the difficulty is contrived and the course lacks substance.\nWorkload:\nThree homework projects with both group and individual portions (textbook questions, summarizing papers, running profiling tools and modifying C programs), one take home midterm with two parts (proposing and implementing software or hardware optimizations) and an in class final (multiple choice and short answers).\n"
        },
        {
            "course_name": "Computer Architecture",
            "review_date": "May 02, 2016",
            "review_content": "\nThis is one of those classes that every systems programmer should take, even if they will never design a chip in their life. You will lean so much about what actually goes on in a modern CPU -- much of which is not very well documented by online resources. It's essential for anyone who wants to write fast code -- for example, if you plan to work on operating systems, libraries, or high-frequency trading. \nI learned a lot from the lectures, despite being scheduled Thursday 7 - 9:30 PM when everyone is exhausted. Prof. Sethumadhavan was a great lecturer for the first half of the semester, but then he stopped making jokes (probably because he was tired like the rest of us - but jokes help us stay awake). There are definitely some lectures that were extremely dry even though they could've been interesting. Also, his explanations are unclear (self-contradictory) sometimes on complex things, like how to access a DIMM.\nThe most helpful part of the course was taking with Prof. Sethumadhavan during halftime and at the end of class. He is really great at explaining stuff in small groups and genuinely takes pleasure in hearing interesting questions from students. Wish I had attended office hours more.\nThe problems from the book truly horrifying - they are filled with ambiguities and errors - but my understanding is that there are not that many textbooks about computer architecture. Maybe there are some non-textbooks that we could integrate into the course. \nHowever, I really enjoyed the group homeworks where we had to argue about how to interpret computer architecture papers and write programs to demonstrate concepts from class. The midterm was in the same vein - come up with some optimizations and then implement them - so I also enjoyed it a lot.\nSometimes the assignments were poorly worded or had bugs. For example, the hw3 skeleton code did not properly check whether the optimization changed the program's output, despite several corrections by the TAs over two weeks. This did not affect our group because we figured it out, but had we not been so careful, we could've wasted a lot of time and had nothing to show for it. I understand that TAs are busy, but correctness is also important.\nWorkload:\nA bit heavier than most classes in the department. Not as bad as classes like OS or PLT though. \nThree long homeworks, each one with an individual and group component. Pick competent group members so you'll have something interesting to talk about. Since there are only three homeworks, the workload is bursty if you (like most people) procrastinate until the weekend before the deadline. \nTake-home midterm which takes about two months. \n"
        },
        {
            "course_name": "Computer Architecture",
            "review_date": "May 11, 2014",
            "review_content": "\nGreat lectures, Prof S is explains things well and knows his stuff. Would be even better if he made slides for all lectures and posted them. Very poor logistics and not enough TAs - grades took forever to get back, room overcrowded in 1st half of semester, not much help on Piazza, etc. Early HWs did not really relate to the test much and were long, later HWs were more reasonable. Far too much reading was assigned, but you didn't really need to do it all anyway. Doesn't let non CVN students view the lecture videos online which is unfortunate.\nHopefully he'll keep teaching the class, and improve on the TA and logistics in future semesters because the core of the class - his lecture ability - is solid.\nWorkload:\n7/10. 4 problem sets of varying difficulty, 1 midterm 1 final (both closed book). Tests are a bit hard but not totally unreasonable.\n"
        },
        {
            "course_name": "Computer Architecture",
            "review_date": "April 15, 2014",
            "review_content": "\nSpring 2014 is the first time Simha has taught Computer Architecture. He didn't have a lot of slides, and used the blackboard for a majority of the course. Nevertheless, he is a good teacher: he takes times to explain concepts clearly, and actively takes questions. However, he doesn't employ nearly enough TAs, due to which assignments and exams are returned horribly late. Moreover, half the assignment just lists textbook exercises -- and the exercises in the Hennessy & Patterson are really ambiguous and poorly designed. The other half is a group portion that involves either reading papers or running simulations, which is not bad. The exams are very sensible and test exactly what Simha taught in class.\nOverall, I enjoyed the course and learnt quite a lot.\nWorkload:\n6/10. 4 assignments, 1 mid-term, 1 end-term.\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "January 03, 2010",
            "review_content": "\nSimha is the worse professor I've had at Columbia. He gaves way too much work; the work from his class was more than the work from all my other courses combined. He doesn't seem to understand what a reasonable amount of work is. \nHis lectures are extremely boring and hard to follow. The assignments and tests are poorly written and are ambiguous making the already difficult work even harder. \nAs a person he's kind of a nice guy. However as a professor he seems to think that students have no other commitments beyond his class.\nOverall, avoid this professor at all costs.\nWorkload:\nextremely heavy\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "April 20, 2008",
            "review_content": "\nProfessor Sethumadhavan genuinely has a passion for the subject and makes an effort to teach.  However, his teaching method is not too effective; he comes in with powerpoint slides, but unless we've read the book thoroughly prior to the lecture, it's very difficult to keep up.  Sometimes, he'll realize that he made a bad lecture, and he'll come to the next lecture being a lot more prepared.\nI have to give him an A for effort.  He makes some joke in class, which weren't funny, but at least it shows that he tries to lighten up the mood.  He also makes an effort to remember your name.  This is his first time teaching in Columbia, so hopefully, by the time he teaches this class again, he'll be better prepared and teach a lot better.\nThe textbook for the first half of the class (Brown and Vranesic, Fundamentals of Digital Logic with VHDL Design, McGraw Hill Publishers, Second Edition) was very poorly written (it refers to examples that require the reader to flip back ~10 pages), but the one for the second half (Patterson and Hennessy Computer Organization and Design: The Hardware/Software Interface, Elsevier, Third Edition) was much more well written.\nWorkload:\n9 homework assignments, difficulty varies greatly, way too much (~10 hours, if not more) for some weeks, and very short for others; one very hard midterm (he claims that it should be okay for us because it took his TAs 1 hr 5 mins to do the midterm); and one final\n"
        }
    ]
}