{
    "prof_info": [
        {
            "prof_name": "Noemi Cress",
            "prof_id": 1640,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Playwriting",
            "review_date": "June 22, 2005",
            "review_content": "\nSome would say that I've lucked out with the professors and classes I have taken in the writing program: the accomplished and fabulous, Leslie Woodard (who happens to be the director of the program), and the gifted, Dominican, Nelly Rosario.  I just finished a semester of playwriting with Neomi Cress, who definitely knew, like the aforementioned teachers, what she was talking about.  Thank god!  I went into the class with a limited knowledge of drama and some firsthand experience with the theatre; therefore, I was willing and ready to learn more.  By the end I was much more comfortable with playwriting lingo and concepts.  I understood what drama stood for and how to achieve it, even on a mediocre level.  My writing has improved, I hope, and I now have the desire to pursue this branch of writing.\nUltimately, what these teachers want to see by the end of the class (and throughout the course of the class) is some form of improvement and change, drastic if possible.  And yes, they want to see how well you've applied what you've learned (i.e. how well you listened and reacted to THEIR ideas and criticism).  They need to see that you've grown as a writer, especially if you're a writer who isn't really comfortable with the specific genre in question.  No one in my class is/was an expert: some could be considered (naturally) gifted or more open to the art of playwriting.  There were some people in my class who, honestly, did not deserve a seat in the room.  Not that they solely sucked at playwriting, they simply could not write.  And by writing I mean open to change.  If the teacher tells you to write another way, DO IT.  If she gives you some pointers, LISTEN and fix the problem or get close to fixing it.  Professor Cress is a professional.  PERIOD!   She knows what she says and why she says it.  She's a great teacher and knows how to stir a critical discussion.  Just write and write and become comfortable with your writing and the characters/stories/lies you're creating.  \nI enjoyed playwriting with Cress immensely.  \nWorkload:\n10-15 pages of drama due every other week\n40-45 pages due by the end of the semester   REALLY PAY ATTENTION TO THE PAGE MINIMUM\n"
        },
        {
            "course_name": "Playwriting",
            "review_date": "January 13, 2004",
            "review_content": "\nI am graduating in May and I can honestly say that Noemi Cress is far and away the best writing teacher I've taken, met, or heard about in the department...4 people who I've spoken to took her class after having taken Flint's workshop and all agreed that they learned much more about writing effective, compelling drama from Noemi than they did from Austin...It makes you wonder where all the hype about his workshop comes from...Did I laugh much in her class and make friends? No, not really, but I've never taken a class for those reasons and  learned more about writing in general and drama, specifically, in her class than in any other I've taken. If you are serious about playwriting,  hers is the only class to take. Bear in mind that she graduated the writing dept and the MFA program here at CU, which are feats inappropriate for you to wag your sharpie at. Oh, and for those who think she has \"no idea\" what she is talking about, she is a professional playwright.\nWorkload:\nAnyone who is not a writing major (AKA those who are not serious about writing) may consider her workload a bit much. I thought it was challenging, but far from over-bearing or disproportionate to other classes. \n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "August 13, 2003",
            "review_content": "\nExpect a lot of the same \"this-comprises-good-writing\" platitudes (often quotations from the likes of Faulkner and Bly) you heard all throughout your high school writing classes.  Expect a lot of the same over-emotional bullshit about \"the heartbeat of the poem\" that you heard in your high school writing classes Expect predictability.\nDo not expect to be enlightened in this class.  Do not expect (unless you are really, really bad) to get a whole lot of helpful advice on your writing.  I found that most of the criticism Noemi gave of my pieces were just watered-down versions of my OWN criticisms of my writing.  Very little of said criticism was even in-depth or thorough.\nThat said, maybe the problem is less with the professor than with the set-up of Structure & Style.  Admittedly, S&S; is inherently sort of a gut course, and admittedly, it's very, very basic.\nRegardless, had Noemi Cress been a great instructor (which she wasn't), she could have lifted the class from superficial nonsense to inspiring aid.  And, hell, short of that, had she been a decent babysitter (which she also wasn't), she could have intervened when class \"discussions\" got out of hand (read: redundant input from every kid in the class about a given piece, tendencies to euphemize the hell out of everyone's writing in order to give the correct ratio of praise to criticism, etc.).\nNoemi Cress is not a terrible teacher.  But she is very, very far from an interesting one.  Whatever you get out of the class will most likely be the contributions of yourself and your classmates, since seldom will Noemi do much but moderate.\nIf you want some basic instruction in the formulation of a chunk of writing and if you'd like to know just where (for instance) your conclusion to a short story went wrong, Noemi Cress's class would be a passable choice.  But if you're taking this class as a prereq for bigger and better writing courses, it will remain little more than what S&S; classes have already acquired the reputation of being:  unhelpful filler classes that totally gloss over everything but the fundamentals of writing.\nWorkload:\nManageable, and probably the same as other S&S; classes.  Noemi required weekly responses to selections from the piles of photocopies she passed around each week, meaning you'd end up writing about how some story by an author she likes \"affects\" you.  Silly, yes (there are better things to be done); difficult, no.  \n"
        },
        {
            "course_name": "Writing",
            "review_date": "May 18, 2003",
            "review_content": "\nSo I thought I was doing well in Noemi's class throughout the semester- all I got back on the assignments that I handed in were checks and \"goods\" written all over them. Then on the final grade I got a B. I still haven't figured out why. It appears as if Noemi randomly tosses the die in giving a grade - I certainly wasn't expecting the grade that I received - it wasn't based on any of her comments without the semester. I still haven't figured out whether my writing actually improved as a result of her class. No idea. Weird class.\nWorkload:\nInsane - ten page scene due every week, in addition to other random assignemnts that were often very time consuming. A ten minute play as a midterm assignemtn. and thirty to forty pages of a final project. Crazy class.\n"
        }
    ]
}