{
    "prof_info": [
        {
            "prof_name": "Kerry Brown",
            "prof_id": 2547,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 10, 2006",
            "review_content": "\nHe's one of the best you'll get from frontiers.  He's nice, helpful, and will teach you something.  It may not be too much, but that's not his fault.  He'll do as much as he can with the course.  \nWorkload:\n10% lecture attendance, 10% disc attendance, 10% participation, (that's already 30% just showing up and saying one thing during class), 10% discussion questions (2 or so a week that can be done in 10 minutes - its not graded - just u did it or didnt do it), 25% problem sets (go over them with him before you hand them in, sometimes they are worded so terribly he has to explain the language the frontiers pple used and explain what they are looking for.  If you go voer it with him, though, you are almost assured a 95+), and 35% final - not bad - same final as everyone else.  He is a stickler with attendance, but if you show up and put a slight effort (maybe 30 minutes/1hr a week) with the work (and ask him to make sure you understood it correctly), its a little hard not to walk away with at LEAST an A-\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 02, 2006",
            "review_content": "\nNo teacher could ever make Frontiers a 'good' class.  Kerry made the class as not bad as possible though, especially for those not so strong in science.  For those who get science and graphs and statistics easily, the discussion section could be quite boring, but I would imagine that it might be different for others.  He repeated important point (standard deviation, etc...) over and over until everyone should get it, which I guess is good.  He grades the problem sets fairly and they come with few surprises.  He was a little unclear on what he wanted from our weekly discussion questions, but its not a big part of the grade (10%) and we figured it out after a few weeks.  He is a huge stickler for punctuality to discussion sections, so be there on time!\nWorkload:\nWeekly Problem Set, Lecture Q, Discussion Q\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 13, 2006",
            "review_content": "\nI agree with the other reviewers that Kerry is not an expert on all of the areas we discuss, but he does know his fair share and does teach very well.  Regarding his grading: He grades the problem sets strictly, but will explain to you how to do any problems you are having trouble with.  So, if you go over the problem sets with him after lecture, you can be assured good grades on them.  Overall, he is a really nice guy and got me interested in the material.  If you show up, talk a little in seminar, and ask him questions on the problem sets, you will get an A without much trouble.\nWorkload:\nFinal: 35%, Problem Sets: 25%, Lecture attendance: 10%, Seminar attendance: 10%, Participation: 10%, Discussion Questions 10%.  Make sure you show up and remind him about excused absenses because that could kill you.  Also, make sure to open your mouth once in each class to get points for participation.  The discussion questions are simple, 2 sentence responses that are graded based simply on whether or not you did them.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 28, 2005",
            "review_content": "\nKerry is a great guy and he did a decent job with the material (as best he could anyway). The problem with Frontiers overall is that it's so broad that the section leaders invariably have to teach something out of their area of expertise. Sometimes I felt like we were learning some things as Kerry was learning them himself but that's not necessarily a bad thing. He is extremely dedicated and espescially helpful outside of class if you have any problems so don't be affraid to go to his office hours if you're having trouble. The only downside of this otherwise terrific teacher is the grades. I worked on the problem sets with people in other sections and my grades were always slightly lower than my study partners even though our work was pretty much identical. Given the fact that many of the other instructors were equally knowledgeable and helpful during office hours yet a little more generous with the grades it might pay to switch sections.\nWorkload:\nThe usual frontiers problem sets and weekly section questions.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 17, 2005",
            "review_content": "\nKerry was a nice guy... but he didn't strike me as a very smart guy.  He is really young and was probably strongarmed into teaching the course, and it showed.  He didn't know much about any topics that weren't specific to his own studies (read: almost everything), and the discussion sections were painful.  Granted, a lot of that was due to my class being full of a bunch of total idiots who clearly cared nothing for the class.  This clearly frustrated Dr. Brown, and understandably so.  He seemed to be a somewhat tough grader on the problem sets (partially because he couldn't understand a lot of our answers or he was instructed to look for some buzz word from the class and if we didn't include it, we got no credit for that part of the problem), but he curved the class fairly generously.\nTaking Frontiers with Kerry was not a disaster by any means, and I doubt that a lot of the other TA's are much better, but if you can take a class with a real Prof as the instructor, I would highly recommend it.  What I wouldn't give to have taken Frontiers from Professor Stormer instead!\nWorkload:\nSame as any frontiers class - weekly readings that no one does, some really easy weekly discussion questions that are graded only for effort, and the usual problem sets\n"
        }
    ]
}