{
    "prof_info": [
        {
            "prof_name": "Karl Sigman",
            "prof_id": 1147,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Simulation",
            "review_date": "November 15, 2013",
            "review_content": "\nI have to say, CULPA completely let me down on this one, as I was completely disappointed with this instructor.  Some people might say he's a nice guy, but it was obvious that he really didn't care about teaching either of these classes, and for that reason this class was a major disappointment.  While his typed lecture notes were excellent, this is not an adequate substitute for lecturing.\nLectures generally started 10 minutes after the scheduled start time and ended at least 20 minutes early.  I think there was one lecture the entire semester that ended at the scheduled finish time.  There were several lectures that ended after as little as fifteen minutes, which seemed like a complete joke.  If I'm going to go through the trouble of making the trip to lecture, I prefer to sit there for a full-length 75 minutes.  I really don't feel like I learned much at all in these classes, and the level of detail was very shallow.  I know we could've covered so much more if he were motivated to teach these courses, which is a shame because I could tell that there is so much interesting material in these subjects.\nHomework assignments were generally rather simplistic and formulaic, with an occasional tricky one.  That being said, if you didn't know how to do them, you really could just go to recitation and the TA did all the problems.  The exams were in a similar fashion, with relatively few questions.  The great majority of the questions were very straightforward, and there were a couple tricky ones that basically set the curve for the class.  Partial credit was minimal to none, and most students disputed their grades after receiving their returned exams.  Because the regrade process was completely unregulated, the success of these disputes seemed to be a function of how persistent you were and whether you had any mutual friends with the TA who graded the problem.  In my own experience, there was a time that I only received points back for a problem after asking the TA twice.\nThe fact that the exams were open notes also seemed to give many people an unfair advantage, as some people had resources that professor probably didn't expect people to have.  There were also a couple questions on the exams that were literally copied from the homework or the notes, and this seemed really stupid and pointless for an open note exam.\nDespite the fact that the courses covered very little material and the exams were very straightforward, that didn't mean it was easy to get a good grade.  The amount of cheating in these classes was basically insanity, and it was obvious to everyone in the class.  Therefore, the averages were very high and the curve was rather harsh.  For example, my average in simulation was a 90% for the semester, and I received an A-.  Seeing as there were such few questions on the exams and the exams were so heavily weighted, this meant that the grading system was very unforgiving.\nTL;DR These classes are simplistic in the material covered and and you probably won't learn very much.  That being said, there's a good chance you won't get a great grade either.\nWorkload:\nSimulation:\n15% Homework Assignments\n40% Midterm Exam\n45% Final Exam\nStochastic Models:\n10% Homework Assignments\n45% Midterm Exam\n45% Final Exam\n"
        },
        {
            "course_name": "IEOR 3600 - Intro to Probability and Statistics",
            "review_date": "April 02, 2012",
            "review_content": "\nThis guy is an excellent teacher, the book is great, the grading breakdown is fair, and particularly advantageous to those who DON'T cheat on their homework, and DO make a concerted effort to learn the material well.\nProf Sigman is not too great at looking for questions. He will sometimes ask \"any questions on that?\" while erasing the board and not turn around to look (especially if he's been moving fast, which he usually does). If you're bold enough to use your voice, he won't ignore you or anything. He's a nice guy. He usually gets us out early, which people have mixed feelings about from my understanding. \nAnyway, hard class but great class. Listen closely and you will learn a lot...this guy knows his stuff. \nWorkload:\nsemi-lengthy weekly homework (10%)\nmidterm and final (45% each)\n"
        },
        {
            "course_name": "IEOR 4106",
            "review_date": "December 27, 2010",
            "review_content": "\nKarl Sigman is one of the best professors in the IEOR department. As an undergraduate doing 4106, I was initially apprehensive about the workload and difficulty of the material, but Sigman allayed those fears pretty early on. He is a great instructor, very crisp, very organized, and knows his stuff very well. His assignments are fairly straightforward, and definitely help reinforce concepts learnt in class. He posts notes about stuff he does in class, so you really don't need to write down everything he says. Just follow what he teaches in class, and read the notes before his exams. The midterm is slightly long, but fair, and the final is pretty straightforward as well, provided you know the concepts. A weakness of the course is the fact that he doesn't hold regular office hours, but it's pretty easy to schedule an appointment with him, so I've heard. Another positive: He never started class before 4:15 (class was meant to start at 4:10), and never ends it after 5:15. So it's material in just the right doses, and with his teaching style, is pretty enjoyable as well. All in all: great chap, interesting material, not too hard either\nWorkload:\nWeekly assignments (all less than 2-2.5 hours long). One midterm, one Final. Both exams are open book. For an upper level IEOR course, workload is not bad at all.\n\n"
        },
        {
            "course_name": "Intro to Stochastic Models IEOR 3106",
            "review_date": "October 22, 2009",
            "review_content": "\nFantastic guy. Teaches the class very well.\ndont worry if you did poorly in ieor 3600 - prof sigmans greatest strength is being able to explain complex probability proofs and theorems in ways very easy to understand.\nI did horrible in marianna cravioto's ieor 3600 because she could never explain the material unless it was in exact mathematical proofs.\ndont worry about that with sigman.\nhe kind of looks like Splinter from teenage mutant ninja turtles, which for me anyway, is a bonus.\n\nWorkload:\n2 midterms, final. very fair. weekly problem sets that arent bad at all.\n"
        },
        {
            "course_name": "IEOR 3600 - Intro to Probability and Statistics",
            "review_date": "May 19, 2008",
            "review_content": "\nSigman is such a nice guy. He is very soft spoken, so you will have tune your ears if you want to hear him. His lectures are somewhat disorganized, going from one board to another. I had a really hard time keeping up with him. Most of the times I am lost since he doesn't specify what he is doing. For someone who have never taken probability and statistics, those class may be a bit challenging at first. But read the textbook and it should be fine. The textbook (and the class) emphasizes applications instead of theory. So there's more problem solving and crunching equations than doing proofs. Sigman's midterm and final are open book and open notes, in addition to being very straightforward. If you study well and know how to do the hw, you're pretty much going to do decently on his exams. \nWorkload:\nweekly problem set 10%, midterm 45%, final 45%\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "July 21, 2006",
            "review_content": "\nClasses were recorded in CVN, though it's definitely worth it to show up to class because questions get asked that aren't picked up on the video. He's very thorough with teaching, explaining things several ways and with concrete examples. He will drill a topic into your head with repetition. His voice tends to go monotnous though, so drowsiness is a common symptom.\nWorkload:\nThere were 3 quizzes, one of which was dropped. Homework was easy for the most part. Midterm was difficult but the final was easy, exactly like the practice final he gave.\n"
        },
        {
            "course_name": "IEOR 3600 - Intro to Probability and Statistics",
            "review_date": "April 19, 2005",
            "review_content": "\nThe course itself is quite challenging if you have not done a AP stat course in high school. It covers a lot of material rather quickly and it sometimes gets quite confusing.\nHaving said that, Karl Sigman is a very talented lecturer. He is extremely articulate and really knows his stuff. His lectures, too, are extremely well organized and this was the only class where I had a 100% attendance. The exams are open notes and open book and so, it really helps if you go to class. This is especially true right before finals week when he tends to go over a few of the exam questions. So, overall, Sigman is a good choice.\nWorkload:\nTwo midterms and a final that can be difficult.. weekly PS which are easy\n"
        },
        {
            "course_name": "Stochastic Modeling",
            "review_date": "June 27, 2004",
            "review_content": "\nSigman's lectures were very good becuase he went through each stochastic topic very slowly and made sure everyone understood it.  His lectures are truly amazing and very easy to follow.  Make sure you go to all of the classes and you shouldn't have a problem geting a B or higher in the class.  He wants you to do well.  The class was a 2 and a half hour one day a week type deal but he would come 15 minutes late and end the class 40 minutes early so it was awesome.  \nWorkload:\nMost of the homeworks were pretty easy, towards the end it gets a little harder but manageable.  2 midterms that were easy and a hard final.  The first midterm was very simple and the second one and the final was harder because the mean was too high on the first\n"
        },
        {
            "course_name": "Intro to Stochastic Models IEOR 3106",
            "review_date": "May 20, 2004",
            "review_content": "\nGreat guy! Interesting and clear in class, and generally a nice person to talk to, interested not only in your academic success but also in you as a person. I enjoyed taking Stochastic Models with him, and would sign up for more of his classes.\nWorkload:\nPS every week, sometimes challenging but never impossible. 2 midterms and final (very fair)\n"
        },
        {
            "course_name": "Intro to Stochastic Models IEOR 3106",
            "review_date": "May 12, 2004",
            "review_content": "\nEven though Sigman is a very good teacher this class is poorly taught. How is this possible? Well, the class is only once a week and it is 2.5 hour lecture. However, neither the students nor Sigman can sit there for 2.5 hours. Therefore, he has to skim over the material and he never has time to solve complicated problems. If this class were twice a week, I am sure that everyone would learn much more. The material is complex but not too hard. His first exam was easy. The second one was mad hard (mean was 40 out of 90) and the final was slightly easier than the second exam. He is a very calm and good teacher. However, he has to put more effort into this class to make it better. I guess he does not really care about undergrads. \n"
        },
        {
            "course_name": "Stochastic Modeling",
            "review_date": "May 10, 2004",
            "review_content": "\nProbably the most interesting class I've taken at Columbia. Sigman is a very good lecturer and tries to make the class interesting, even though the material isn't that exciting. Take any class you can with him!\nWorkload:\nnot too bad, hw every week or so, 2 midterms, final\n"
        },
        {
            "course_name": "Introduction to Financial Engineering",
            "review_date": "December 23, 2003",
            "review_content": "\nThis man definitely knows how to teach.  He delivers the course material in a very straightforward yet thorough manner.  I look forward to finishing up my degree with many more Sigman taught classes\nWorkload:\nReasonable, makes students aware that the HW is just there for their benefit, and won't be weighted to heavily on the overall course grade\n"
        },
        {
            "course_name": "Intro to OR: Stochastic Models",
            "review_date": "September 01, 2003",
            "review_content": "\nSigman is a great professor. He tells you exactly what he wants you to know and includes every single word he says in class in the online lecture notes. He is well prepared for his lecture and expresses himself articulately.\nMore importantly, he's an extremely nice and considerate person. He would let those who are in danger of failing or getting a C know right after the midterm exam to make sure that they have the chance to drop the class in time. He also gives a bonus question to undergraduate students in the final.\nWorkload:\nWeekly problem sets. Not very difficult if you read lecture notes. Midterm and final.\n"
        },
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "May 29, 2002",
            "review_content": "\nHere's the review for Intro to OR: Stochastic Models, which should be relevant because Sigman is teaching Elementary Stichastic Processes in the fall, which should be pretty similar. Excellent teacher! great class. Definitely the most interesting lecturer I've had for a math related class, and he makes difficult probability concepts fairly straightforward and understandable. You get the feeling that he enjoys teaching and really tries hard to get everyone to understand everything. Highly recommended. \nWorkload:\n Weekly problem sets which could be difficult sometimes but nothing overwhelming, and it's only a few problems a week. Midterm and final which aren't difficult if you've been keeping up with classes, homework and the practice midterma and final. \n"
        },
        {
            "course_name": "Intro to OR: Stochastic Models",
            "review_date": "May 28, 2002",
            "review_content": "\nExcellent teacher! great class. Definitely the most interesting lecturer I've had for a math related class, and he makes difficult probability concepts fairly straightforward and understandable. You get the feeling that he enjoys teaching and really tries hard to get everyone to understand everything. Highly recommended. \nWorkload:\nWeekly problem sets which could be difficult sometimes but nothing overwhelming, and it's only a few problems a week. Midterm and final which aren't difficult if you've been keeping up with classes, homework and the practice midterma and final.\n"
        }
    ]
}