{
    "prof_info": [
        {
            "prof_name": "Matthew Sanger",
            "prof_id": 12895,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 27, 2014",
            "review_content": "\nThe Rise of Civilization\nAnthropology V1008y\nThis course is loaded with a vast amount of theory and knowledge.  Some of which becomes a bit redundant, but for the most part will hold your attention.  If you struggle with putting all the pieces together, as I do, rest easy knowing that there is a group of TA's that are just as well-educated as the professor (some give a few lectures).  Matthew Sanger being one of them, made himself available almost 24/7 to help.  His discussion sessions helped point out the important aspects of each civilization, and his well informed guidance is invaluable.\nThis is a great course and worth taking to fill that global core requirement.  \nWorkload:\n60 Pages of Reading a Week\n2 7-8 Page papers\nMidterm (ID's and Essay)\nFinal (ID's and 2 Essays)\nOptional Weekly Discussion Session\n"
        },
        {
            "course_name": "The Rise of Civilization",
            "review_date": "May 06, 2014",
            "review_content": "\nMatt is amazing!  He took what is otherwise a very dry subject and made it sooooooo much better.  his lectures were great, he was always available, and he was a very fair grader.  If you take this class MAKE SURE you get Matt as your instructor as I hear the other grad students are not as good.\nThe class goes through a tremendous amount of information - everything from China to Egypt to South America - plus a bunch of social theories from Marx and other writers.  It is difficult to keep everything straight, especially by the end as all of the different cultures tend to get mixed together in my head.  But Matt did a great job in using concept mapping and flowcharts to help us study and keep everything together.\nWorkload:\nFair - a midterm and final along with two 8 page papers.  Very little readings, but you really need to attend lectures as that is where most of the information comes across\n"
        }
    ]
}