{
    "prof_info": [
        {
            "prof_name": "Mary Grace Albanese",
            "prof_id": 12611,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Literary Texts, Critical Methods (Seminar)",
            "review_date": "February 19, 2015",
            "review_content": "\nMary Grace is such a sweetheart. Like the previous reviewer said, she's always willing to make time to talk, recommend you books, tell you about some exhibit going on in NYC and also like the previous reviewer said, she has an awesome wardrobe. The only thing was even though she's really nice, she's also really direct which I found off-putting at first (she WILL put you on the spot or will just say \"that's wrong\" in front of everyone. Oh, and she hates Pride and Prejudice and let us know it). However, this directness also means she'll give you really practical rules for how to get an A or will give you a list of \"pet peeves\" never to commit in papers. She has a pretty good sense of humor too. Just do the reading, avoid doing things from her pet peeves list, go to her office hours and you'll get a good grade. \nWorkload:\nPretty light and as previous reviewers said she is a very fair grader.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 29, 2014",
            "review_content": "\nProf Albanese is an excellent choice for University Writing. Although some of the readings were slightly challenging (unless you are familiar with 19th century French Literature) she made sure everyone understood the material through her lectures and intelligently led classroom discussions. She will make time available to you for any questions, help, or guidance you might find yourself needing for any of the assignments. The grading is very fair. Do the readings and apply yourself in your writing assignments and not only will you get an A you will actually learn a thing or two as well! \nWorkload:\nUW in general is kind of intense if academic writing is not your forte. That being said between the writing center and Prof Albanese's office hours you have the resources you need to be successful. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 11, 2013",
            "review_content": "\nMary Grace was a fantastic instructor. Her class is definitely not going to be for everyone though. It's obvious that she studies 19th century literature and France, which shows on her syllabus (Emerson, Poe, Baudelaire, Benjamin). She was very knowledgeable about the readings and had brilliant things to say. So if you're into literature and philosophy, it's definitely for you.  Actually even if not you'll still get something out of it because even though it's such a literary class, she was able to balance difficult abstract concepts with very practical rules about writing. She also seemed committed to making the class as painless as possible. She took us to see photography at the Met, gave hardly any homework, was willing to extend deadlines, and filled up class time with crazy anecdotes. Still I feel like I learned a lot more from her than I did from classes that gave busy work. It also helped that she's a pretty cool person. She has a kind of awkward, dark sense of humor and is really cute and stylish (she regularly wore heels and dresses.......at 8:40 in the morning). Great way to get through university writing. \nWorkload:\nNot bad. Some of the readings are tough but are all very short. Four essays and she's a pretty fair grader. \n"
        }
    ]
}