{
    "prof_info": [
        {
            "prof_name": "Paul Cadden-Zimansky",
            "prof_id": 10718,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "April 28, 2011",
            "review_content": "\nPaul's discussion section turned out to be a lot of fun, especially considering my pretty low expectations for frontiers of science. Class is usually divided into three portions, where Paul goes over the previous homework, then lecture topics are discussed and finally the frontiers activity is done. The class is very structured and it lends itself to meaningful discussions about the topics covered, such as volcanoes and nuclear weapons. Paul was a very fair grader and the fact that he did not give \"grades\" out for quizzes and WIAs made the class a lot less stressful and, at least in my opinion, really allowed students to focus on the larger exams and mastering the material. Paul was also really helpful in explaining topics and was readily available for office hours and what not. Overall, a great instructor to what surprisingly turned out to be a fun class, despite the bashing it receives from most students. \nWorkload:\nStandard Frontiers. 12 WIAs, 4 Quizzes, Midterm, Final and Term Paper\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 03, 2011",
            "review_content": "\nPaul knows his subject really well, but if you aren't acquainted with the material, it is extremely difficult to make sense of his teaching methods. He is a physicist first and a teacher second. Although he was a hard grader, my final grade ended up being much higher than I thought it would be. Besides a few \"aha!\" moments, however, easy material was still easy and difficult material was not really elucidated. \nThere isn't *much* that is terribly redeeming about this class. Paul's a good guy, pretty nice, and likes when his students take an interest, but I would probably switch sections if you want something easier. \nWorkload:\nSame as other FroSci sections, but harder grading.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 17, 2011",
            "review_content": "\nPaul was nice and friendly if a bit of a dork. Class was fairly interesting sometimes, but that was mainly because our discussion group was great, not really because of Paul. He was happy to go over thinks if you asked. He added extra pages to our WIAs which was really annoying. We all thought he was a tough grader (the average on out midterm was a 33.5/60... ouch) until our final marks came out... some magical curving happened there...\nWorkload:\nOne or two additional WIA pages per week + the standard FroSci workload\n"
        }
    ]
}