{
    "prof_info": [
        {
            "prof_name": "Eric Blanchard",
            "prof_id": 12029,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "General review_content",
            "review_date": "April 07, 2015",
            "review_content": "\nBLANCHARD = GOLD NUGGET \nBlanchard is by far my favorite teacher and Columbia and I try to take as many classes with him as possible\nAdmittedly, he's way better in smaller classes than lectures. Intro to IR with him can be boring, but in the way that every poli sci intro class is. But at least he has a witty personality, makes jokes, organizes his content in powerpoints (which he posts on line), and is fairly straight forward.\nHis grading on exams/papers can be harsh, but the class is curved in the end so it doesn't really matter (at least I'm assuming, because I had a B+/A- on everything and ended up with an A in the class)\nBonus: he's a feminist IR scholar (of which there are very few), so if you're interested in this aspect of IR then definitely take one of his more focused seminars or go to his office hours - he's fascinating and full of knowledge\nBlanchard is \"the man\" - although he would object to this classification #GenderIR\nLast thing: follow him on twitter @BlanchardIR he's the coolest\nWorkload:\nintro classes - average\nother classes - heavy reading, midterm, final, and some sort of paper or project\nexam style: ID's (but by ID he basically means short essay), and usually 1 longer essay. What's nice is he typically gives you a review guide in advance with possible ID's and essay questions that would show up on the exam\n\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 12, 2014",
            "review_content": "\nThe material for any poll sci intro course is bound to be somewhat dull, but do yourself a favor and don't make it worse by taking the class with Professor Blanchard if you can avoid it. \nHis lectures are mostly him rambling and attempting to make jokes related to International Politics. The slides are eventually posted (with a bunch left out on purpose) near midterm/final time. He also insisted on passing around an attendance sheet before lecture though I'm not sure whether it mattered much or was ever really looked at. \nHe assigns way more readings than necessary and buying the books is pretty much a waste of money. (You will need them for the essays though, so just check them out at the library). \nThe whole course is pretty disorganized, and I finished it feeling like I learned absolutely nothing. \nThe TAs were much better at explaining stuff than he was, so section was actually somewhat useful. \nProfessor Blanchard is also super super vague about essays- how he wants them written, what exactly the question/topic even is, and this applies to essay questions on the midterm and final as well. \nWorkload:\nUnnecessary. Not overwhelming but since the readings are scattered and not particularly interesting, mostly just a waste of time. 2-3 short essays, midterm, and final \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "June 19, 2014",
            "review_content": "\nAny student who takes Eric Blanchard should be refunded a portion of the tuition they paid that semester. \nHe is, without any doubt, the least prepared, least interesting teacher I have had. He was consistently shocked by his powerpoint whether that meant something was written there that he hadn't remembered was there or a slide was missing or the order was different. He gave the excuse, \"Oh sorry, guys, it's because I changed over my powerpoints to my iPad.\" Funny thing is, the same excuse was given to his class in the fall that my friend took. It can therefore be concluded that he did not take a simple five minutes before class to review his slides in order to know what was on them. The power points themselves were incredibly boring- cluttered with quotes from great thinkers to make him appear learned but lacking content that is actually applicable in life. Such horrible power points were promised to us as pdf's online but were only put up twice in the semester leaving you stressed when your notes were incomplete as a result of him skipping slides when he ran out of time. \nPapers were perhaps an even more ridiculous experience. The prompts were so ambiguous and convoluted that few people knew what to write. He decreed that no student could meet with their TA about the paper (what is a TA exactly for if not for helping g students?) and no student could go to the writing center for help either (which would be for style and argument technique- not content, if that was his big worry). I lucked out with a TA that graded kindly while there were other TA's that left students with terrible grades. \nThree things made me go to this class:\n1. Brian Blankenship- my kickass TA\n2. the tuition I pay to go to this institution\n3. the random attendance sheets passed around as he knows dozens of people skip \nIf the other political science professors are like Eric, I will be switching majors. \nSTEER CLEAR OF THIS WASTE OF MONEY AND TIME\nWorkload:\nThere were a sufficient amount of readings that were actually fascinating. I read most of them but not consistently with the schedule. They are the only part of the class that I took away. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 30, 2014",
            "review_content": "\nI enjoyed/was interested in the actual IR content of the lectures but felt that it was often presented in a boring, slide-by-slide manner. It's obviously very difficult to conduct an engaging class in a lecture as large as this one, but oftentimes only about half of the students enrolled even showed up!  \nProfessor Blanchard himself is clearly very knowledgeable, and it was nice to be able to get his perspective on IR.\nTAs did all of the grading (rumors were that Blanchard went over everything, though).  Loved my TA (Brian Blankenship) but felt that there was some disparity in grading between TAs.  My second paper was graded by another TA and the grade was significant lower while the quality was (in my opinion) about the same.\nEnded with a B in the class- seems to me that the grade you receive will be luck of the draw based on saying the correct things (specific authors on topics) on midterms/finals as well as hitting whatever the particular TA wants to see in the papers.\nAll in all, an important class because of the content, but the grade was frustrating to see at the end, given that I had actually gone to every single lecture unlike many of my classmates.  I wouldn't want to do it all over again.\nWorkload:\n2 papers, midterm, final (both midterm and final in blue books)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 15, 2014",
            "review_content": "\nI come from the inner-city where funding is unavailable and where the misconstrued perception of unteachable students and a dangerous area presides, scaring away top-notch teachers. So I know what shitty teachers are like. I have been in some of the worst classes ever exposed to children. \nThat said, Professor Blanchard is the worst teacher I have ever encountered. The assignments are unclear, the TAs are completely helpless and do a poor job of leading discussion in seminar.\nI cannot believe how Columbia retains this man. \n\nWorkload:\nNot horrible -- standard for a PoliSci course. However, the assignments are so vague and graded so harshly, that it seems like an endless abyss of torment.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 08, 2014",
            "review_content": "\nI have taken two classes with Professor Blanchard and I enjoyed both. Blanchard's classes are straight-forward both in terms of assignments and exams. \nBlanchard is approachable during office hours and will give you valuable advice on assignments. The amount of reading was average polisci level. Blanchard's teaching is mostly entertaining and energetic, because he genuinely cares about making class fun, interactive and he will try to learn your name. The interactive part is great for the most part and when people make meaningful comments, but it can also get annoying when the same people keep talking. There are also times, as with most professors, when lectures or topics are just boring. For some Blanchard might even be too entertaining and not serious or analytical enough, because he loves to make jokes and to tell anecdotes. \nFor me personally going to lectures was very worthwhile and the readings were for the most part meaningful and interesting. Overall, Blanchard is clear when it comes to concepts and I'm sure he'll do a good job getting you excited about the topic. \n\nWorkload:\nThe workload was manageable and his grading seemed fair. His classes were not super easy, but efforts paid out. \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 01, 2014",
            "review_content": "\nFor context - I'm a polisci major in my junior year doing my major subfield in international relations. \nI had heard very good things about Professor Blanchard before deciding to take American Foreign Policy, which is why I ended up beiong rather disappointed with this course.\nThe lectures seemed disjointed, and were tied together with relatively nonsensical slides. I'm not one to argue that a great class requires great slides, but if a class has crappy slides, it must be compensated for by engaging teaching. On this count, I felt that Blanchard failed to provide. He's obviously a smart guy, but he came off as a little arrogant and aloof, and taught in a rhetorical manner that didn't sit well with me. He frequently used witticisms and quips which kept the class giggling, but it seemed to really just be a compensation effort for a lack of obvious material. \nIt wasn't so much that the topics we went through weren't interesting, it was just that their presentation was rather poor, and it wasn't very clear to me what I was meant to get out of each lecture. \nFor all of this negativity though, I don't want to say that I regret the course, because I actually learned rather a lot. The readings assigned for each week tended to be very interesting, and the exams forced you to really learn your stuff. The term paper (15 pages) also ended up being quite a bit of fun, as we were all able to delve into just about whatever topic we wanted and do serious independent research.\nAll in all, AFP was a relatively easy class without many clear aims, that ended up being quite informative but mostly by virtue of the readings that were assigned. I think Blanchard is probably a nice guy, but he should brush up on his lecture presentation, and make the goals of each lecture a little clearer. \nOn a final note, I know many people who liked him a lot, and enjoyed the class a lot more than I did. So don't take my word as authoritative.  \nWorkload:\nLight-Medium:\nAbout 100 pages of reading/week\n1 short paper relatively harshly graded\n1 easy midterm (You get a sheet with about 24 short-answer questions and 4 essays a week in advance of the test. You can use that week to prepare the exam in which you ultimately have to answer 5 of the short answers and 2 of the essays)\n1 term paper of 15 pages on anything you want\n1 easy final of the same format as the midterm (you also get all the potential questions a week in advance)- it's just a bit more extensive. \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 07, 2013",
            "review_content": "\nI was severely disappointed by this class. Blanchard initially seemed like a cool, funny professor and I was very interested by the topic of foreign policy but this class was unbearable. Blanchard is a patronizing dick. Specifically the lectures are very slow-paced with a lot of unnecessary side comments from Blanchard while the reading is difficult and unmanageable, but the articles he picks are good. There were days when I left with less than half a page of notes because I didn't think anything he said went beyond what any poli sci student didn't already know from an intro class or common sense. \nHe definitely picks out his favorites and allows them to go off topic and not really say much at all. As the semester progressed going to lecture was a physically painful experience and I continued to lose more and more faith in his ability. \n The grading is also very difficult for the midterm and paper although he gives you the ids and essays its still fairly hard to get an A. It probably would have made more sense to make this a take This one of the only classes I have regretted taking at Columbia.\nWorkload:\n1 midterm, short paper (2500 words), 15 page paper due during reading week, final; shit ton of reading but you don't need to do it for every class, just for the midterm and final.\n"
        }
    ]
}