{
    "prof_info": [
        {
            "prof_name": "Colin Hunt",
            "prof_id": 1330,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Painting I",
            "review_date": "January 07, 2013",
            "review_content": "\nSo, here's the nutshell: You get to paint a live figure 3 times throughout the semester (or at least that's what happened with us). There's little to no instruction in class and 99% of the homework is done with coloraid paper where you cut out your design from the coloraid and glue it down. There are no grades given throughout the course and Colin never really has a bad word to say about anyone. However, this doesn't mean you're necessarily getting an A. Most ended up in the B+ to A- range. Anyway, that's that. He's not a bad guy, actually he's nice. Really. A little reserved but friendly none the less. \nOne of the few critiques I have for this course is about his teaching, or lack thereof. I was a beginner when it came to painting, drawing and the like and I did fine. I'm actually proud that I was able to do as well as I did, but what I learned about painting I learned through actually doing it and being around others who were as well. Now, Colin is very nice and will encourage you to keep moving through your painting, but generally his comments will sound something like, \"I really like the way you____. You should check out (insert name of painter).\" While it's great to have another artist find something they like about your work, it doesn't really help you to grow or to learn how to improve.\nNow I have to say that as far as grading was concerned I think I was just lucky. About 30% of your grade is based on the final project, which can sound intimidating if you're a beginner painter who has muddled through the course without really feeling like you've received any instruction. But, I'm going to give Colin the benefit of the doubt and say that he had a sense of the overall experience of his students and chose a project that was \"doable\" for all. Now the concepts that he uses for his final projects are a little crazy (this have been conferred with his past students from other classes as well), but more crazy in a \"were you on acid when you thought up this idea\" than a \"this is totally undoable-I'm not Michelangelo\" kinda way. Nothing is beyond your ability, doesn't matter the level and you can do well, but the A is reserved for his favorite(s).\nNow for my chief complaint. I put an INSANE amount of time into this course. Dedicated so much effort in my homeworks and tried my very best in class and yet I had to fight for an A-... That. Is. Frustrating. Very. Very. VERY. Frustrating. I have tried to not let that temper my overall review, but it needed to be said. Effort alone, even if it results in something beautiful that Colin himself likes, will not result in an A. I understand this is Columbia, and professors have to combat grade inflation, but when you give it your all and DO WELL and the subject matter is relatively subjective, you should get an A. Sorry, this is not very buddhist of me. But here's the syllabus you won't get in class should you take this course: know you 1. MUST participate in class ad nauseam (aka till your tongue hurts and your voice goes hoarse). 2. Doesn't matter if you come to this class not even knowing what paint is, take risks with your composition as if you're a master painter. Do what you'd like to be able to do if you painted nonstop for the next 15 years. 3. Chillax, you've done all you can. \n \n\nWorkload:\nWeekly homework assignments with the coloraid paper that are suppose to take you 6 hours to complete. He tells you this up front and it's an honest estimate. It will really show if you put in much less, especially if it becomes a habit. But really it's left to your own discretion. Personally, I always used more. There are occasional readings, which we only had time to discuss in class once and the final project. Again I think the final project is worth about 30% of your grade. The only problem I had with it was that throughout the semester Colin continually referred to having a few weeks to go complete it. I assumed the time was going to come from reading week, so when we approached the end of the semester and hadn't actually begun working on it yet, I wasn't overly concerned. However, in the end it was due the last day of class and we had only one week to complete it. That meant whatever we couldn't complete in that class we had to do on our own time during the last week of classes. Again, it wouldn't have been as big a deal as it was if we would have had a little notice, but c'est la vie. \n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "January 03, 2003",
            "review_content": "\ni get the sense that he knows a lot about art and drawing but he has a hard time conveying his knowledge to his students. hes usually pretty quiet and class time is mostly spent drawing.  we didnt spend nearly enough time critiquing our work, and when we did colin would never really criticize our work...he was a little too nice.  he doesnt give grades so i was pretty much in the dark about what my grade was going to be...\nall in all i think that colin would be a good professor for someone who had never taken any type of drawing course ever, if you have taken a drawing course you should opt for someone else.\nWorkload:\nweekly homework assignments (drawings)\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "December 09, 2002",
            "review_content": "\nColin is kinda quiet, but has lots of good advice to give. Artistic criticism can be tough, but Colin pulls the tough love thing off well. He always knows what direction to point you in to pull your piece together and he always encourages you to be bold and creative. All in all, an excellent class. I actually feel like a real artist now. Who would've guessed?\nWorkload:\nOne take-home drawing a week, so plan on spending 4-6 hours getting messy with charcoal and ink.\n"
        }
    ]
}