{
    "prof_info": [
        {
            "prof_name": "Alessandra Saggin",
            "prof_id": 10333,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 21, 2015",
            "review_content": "\nI have no idea why Professor Saggin does not have a silver nugget. Professor Saggin is one of the best professors that I have come across. She is Italian, lived and went to school in Italy; normally one would think that someone with such an advance level of Italian would not enjoy teaching the basics because it is beyond her. This is not the case for professor Saggin; she loves teaching and prefers to teach Elementary Italian because she says she enjoys how much her students can learn in just one semester. This attitude towards teaching IS KEY for an elementary class because IT WILL GET HARD and she understands that. She is extremely accessible and tremendously sweet. If you have a problem, miss class or get sick you can easily go to her office hours and she will accommodate you. I've taken Italian with Professor Saggin for a year now and the amount of Italian that i have learn is insane. She comes off as a little unorganized at the beginning but her madness has a purpose. Italian can seem easy at the beginning but the grammar is extremely comprehensive and will make you want to give up on the language. I had so much trouble with the grammar but Professor Saggin was so accessible that i have able to meet with her countless times to work the grammar through and not give up on the language. If you are thinking of starting italian from scratch, take the class with Professor Saggin and stick through it. She is a very lax grader because she cares more about you learning Italian than ruining your GPA. HOWEVER, if you don't do anything and don't show up to class, don't expect an A. She will meet you more than half way and will try to make Italian as painless as possible. Also, she is super adorable and stylist; her accent is a plus. She will try to get to know you and your background, which to me was extremely refreshing; she takes each of her sections to lunch, TAKE ADVANTAGE OF THIS BECAUSE SHE IS AN EXTREMELY SMART AND INTERESTING PERSON. \nWorkload:\nHomework almost everyday from workbook, about three compositions a semester for Elem I and four for Elem II. Quizzes after every chapter covered - lowest quiz grade will be dropped. She does start collecting homework for Elem II. There is a midterm and a very comprehensive final. If you actually do all the homework, the quizzes will be doable. She takes participation very seriously, so be expected to participate in every class - if you butcher the Italian she will be sweet about it and walk you through it. Towards the end of each class there will be an oral project, pronunciation counts towards your grade during your presentation. \n"
        },
        {
            "course_name": "Elementary Italian I",
            "review_date": "February 10, 2015",
            "review_content": "\nAlessandra is a terrific professor. She's from Italy and has a great accent. All of her instructions (including the entire textbook) are in Italian, which is a little confusing but does help teach the language. She's outrageously sweet and gets to know her students almost immediately. I would absolutely recommend Alessandra, especially for people just starting out in Italian. She'll regularly have students listen to music during class, or learn about Italian art or food. It's one of the classes where you get out what you put in, because she's a very lax grader. My only complaint is that she struggles to articulate grammar rules in an accessible way because her Italian is so much better than her English, though she manages to get the point across.\nWorkload:\nDaily assignments from the textbook, which she'll rarely check, and all of which can be done quickly. Occasional (maybe 3) compositions of around 100 words. One oral presentation, 4 quizzes, a midterm, and a final, all of which are graded VERY forgivingly. She'll cover your paper in corrections and still give you a 95.\n"
        }
    ]
}