{
    "prof_info": [
        {
            "prof_name": "Simon Porzak",
            "prof_id": 13260,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2017",
            "review_content": "\nI cannot recommend enough. Professor Porzak was a delight to behold, and (I felt) he guided me through my first semester. \nHe is at first snarky and fun (our class spent most of our time chuckling), but is most of all desperately smart. He thinks critically at an inspirationally high level. He would be played by Billy Eichner, but Porzak would sooner diss Decarthes than Sienna Miller (I believe Porzak would also like me to note that he is more handsome - sorry Billy). \nIf you like wit in a teacher you'll be pleased. \nNotably he gives his notes on drafts in youtube videos where you can see your draft as his voice gives you notes on it. I found this to be extremely valuable. Nobody else does that!\nMy favorite Porzak moment of the semester was when I went to his office hours to last minute switch the exhibit (subject) for our P3. In an instant he told me the root of what I was really talking about and without leaving his chair he handed me his copy of Walter Benjamin that had an annotated chapter that became the core of my argument. \nIt can also be noted that the copy of Benjamin was annotated in multiple languages! Also that I still have it, but I plan to return it Friday with a batch of homemade soft pretzels because I'm lame and also I can't thank him enough for all the time and care he put into our class. \nWorkload:\nNormal P1, P2, P3, P4 cycle. (note he's not so stressed on deadlines as long as the work is good).\nHe assigns more pages of reading than other UW professors I've heard about, BUT the texts he assigns are entertaining and are also from the world's best minds. Everything substantial that we read was written by someone who got brought up in my other classes (even in my Intro to Film class). Any writing that isn't deeply significant (I guess if you care about post-structuralism), is funny and easy to read.  Overall, very well curated. \nThe assigned homework on the readings aren't for a grade and Porzak didn't really seem to care about them. We all eventually stopped turning them in. \nYou will be expected to do in depth peer review that is structured and helpful. \nAgain, the youtube videos thing <3\n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 01, 2016",
            "review_content": "\nI had Porzak for a GS section of UW, and I loved him.  He is a writer by trade, so he really knows what he's doing.  He's incredibly knowledgeable about so many seemingly unrelated topics, but he doesn't make his students feel dumb.  In addition to being brilliant, he's also very funny.  I genuinely enjoy his class.  \nThe greatest aspect of his class, though, is the way he helps students revise.  For each progression paper, he makes ~11 minute personal YouTube videos with his comments for each person's essay along with annotations on the text itself.  His comments are insightful, personal, and helpful.  I really feel like I've improved as both a reader and a writer this semester.\nWorkload:\nThe course texts he chooses are really hard, (dense, difficult language or vocabulary, sometimes long) and the daily workload can sometimes be overwhelming.  I highly recommend doing all the homework because it makes the papers easier, but it's not required, so this class is bearable even doing the most stressful times.  I really do think that the difficulty of the readings and the level of interpretation of the class have benefited me greatly and will actually help me in my college experience.\n"
        }
    ]
}