{
    "prof_info": [
        {
            "prof_name": "Anne Levitsky",
            "prof_id": 12785,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "July 20, 2016",
            "review_content": "\nI want to start by saying that she is a sweet professor, there is no doubt about that. She comes prepared and knows her stuff; however, if you are not already familiar with Western culture, then this class might not be for you. I don't want to sound critical, but she doesn't teach on an introductory level. She assumes that the whole class is on the same level, and ignores that half of Columbia students are international and don't necessarily know about Western art.\nI am not a westerner, but i truly wanted to learn about the culture in an effort to better understand the people of Europeans decent, but i was not able to achieve that because i felt like i was in an advance class. Hence, if you have no background in Western music, then you might be better off going with another professor. Moreover, she is a harsh grader, she ruined my GPA.\nAnother reason is that if you care about your GPA, don't make the same mistake i made and think twice register with her.\n\nWorkload:\nreasonable, but not enjoyable\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 09, 2014",
            "review_content": "\nAnne is amazing.\nShe comes prepared for every single class, which results in a well structured course. Participation is a big part of it, so you should really try to speak up as often as possible. The atmosphere is welcoming and inclusive, so even if you're shy, there should be no problem. Beyond Anne's teaching style, she's just a genuinely nice person and seems to care a lot about both the class and her students. She definitely wants you to succeed.\nBe warned about the 8:40 time slot though. I am not a morning person, so there were several times when I overslept.\n\nWorkload:\nVERY doable. The midterm and final were fair, with some extra credit opportunity. Even if you cram everything the night before, you should be ok. \nI found the essays easy, and generously graded, but I know that this wasn't the case for everyone.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 25, 2013",
            "review_content": "\nThis semester was her first time teaching Music Hum, and I must say, she did an excellent job. Her teaching style is very coherent and it's obvious that she knows her stuff. Anne is also a sweetheart and will never make you feel intimidated or belittled; if you make an argument in class that isn't necessarily correct as a whole, she will very nicely tell you why that might not be the case while still finding a way to appreciate your argument and point out the parts that were correct. Her class is very participation-heavy; she will call on you if you do not volunteer, but do not let that deter you because she provides a very comfortable environment for dialogue. As long as you make somewhat sense, your point will be accepted since she understands that we are not professional musicologists. She is also a very fair grader and provides extra credit opportunities. I highly recommend her class! Waking up for an 8:40 was less painful than I expected.\nWorkload:\nVery do-able.\nHomework usually consists of no more than 5-10 pages from the textbook and listening to a song or two, however you can easily get away with doing neither because she reviews the points from the reading during class and plays the relevant song as well.\nMidterm is 20% \nFinal is 25%\nTwo concert reports 15% each (They must be 10 pages in total with one of them being at least 3 pages and one of them must be on the opera that you attend with the class)\nAttendance and participation is 25%. She is very strict with attendance and lateness though. Just one unexcused absence will significantly lower your grade. Be sure to set 10 alarms if you have her for an 8:40 class lol.\nExtra credit is offered on the midterm, final, and through two one-page concert reports of your choice\n"
        }
    ]
}