{
    "prof_info": [
        {
            "prof_name": "Bruce Bursten",
            "prof_id": 12300,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry II",
            "review_date": "February 14, 2013",
            "review_content": "\nThis class was not only brutal it was also insanely useless. It's co-taught by Gonzalez and Bursten, who I've heard was only a visiting professor? Not sure since I can't seem to find him anywhere else.\nProfessors:\nI learned next to nothing, mostly because Gonzalez is neither a good teacher nor is he particularly interested in motivating students to do well. His lectures consist of reading off of PP slides filled with material taken verbatim from the Zumdahl book, which means if you find Zumdahl confusing Gonzalez ain't gonna make it any better. He doesn't work out any problems on the board; he literally just reiterates the steps in the textbook. He peppers his lecture with supposedly engaging clicker questions but really they're a waste of time since most people don't know what the hell is going on since he doesn't actually teach the material. The clicker questions are supposed to help bump you up but that's only if you're one of the top 3 at the cut-off, which means the rest of the people are SOL.\nTo make matters worse he tried to feed us this inane lie about the chem department enacting a policy that prevents professors from posting exam answers online. Consequently, the only way to get answers for practice exams (which ultimately do NOT help you study for the exams since those p.exams were written by a different professor) Gonzalez hosted these ridiculously timed review sessions (read: day before exam) where TA's (Gonzalez was always MIA for his own review sessions go figure) did nothing but put the exams up on projectors and then waited for us to scribble everything down. Everyone pretty much whipped out their iphones, androids and iPads and started taking pictures after we realized the TAs were only going to let us have five minutes per page.\nThis \"department policy\", my friends, is pure and utter BS. Beer's class not only got their exam answers, they got them days before the exam. Moreover the O-chem I and II professors released the answers to their exams days before as well!\nBursten is by far the better lecturer. He's passionate, engaging and he did a TON of practice problems on the board which meant most people did better on his exam even if it was insanely difficult. I'd prefer to have him teach the entire course than to split it between the two of them. Bursten also used clicker questions (those were a doozy but then again it is thermo).\nExam:\nHard. Tricky. Confusing. That's pretty much all there is to it. Gonzalez was obsessed--OBSESSED--with trick questions. He admitted so himself. He seemed inordinately pleased when the average dropped to around the 50s; he told us this is where the average is supposed to be. Say what now? His exams were so difficult, the TAs who mock took them, struggled. My TA at one point just told us to try our best and to stop stressing because most of the questions are designed for people who had studied the same material before in-depth (i.e. AP chem peeps).\nI honestly wish I'd taken Beer's class. I saw his exams. They were straightforward and made sense. Their averages were in the 70s which is appropriate for a G.Chem II class. My friends in his class had less stress; they couldn't figure out why I was running around the chem building like a headless chicken until I showed them one of Gonzalez's exams. That set them straight.\nWorkload:\nLooks minimal but really you should be hustlin'. 24/7. The class is curved to a B/B+ so getting an A-/A means bending over backwards so you can touch your tongue to your elbow. There are assigned problems that are nothing like the exam. The assigned problems ask you 2+2. Gonzalez asks you for the meaning of life. One thing I'd recommend is picking up another chem textbook (Zumdahl is pretty bad in terms of G.Chem books) of higher difficulty and working through it with some friends. Either that or chill out for the semester and ultimately walk out with a B-/B.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 08, 2012",
            "review_content": "\nProfessor Bursten was a great teacher. He came to class with interesting ways to teach the material and was very engaging. \nHe's very personable with the students which is great considering the size of this class.\nHis exams were tough but at least they didn't seem impossible as opposed to other chem exams we have taken.\nHe is very helpful during office hours and tries to make himself available to you whenever you need him.\nThe only negative part is about the class itself and how it is structured. I wish we could have been given additional problems to study from to better be prepared for the exams but I don't think that was his choice but more about the way the class was structured before he came in ( which was mid semester). \nThe exams are very difficult and you have to do a lot of work on your own at home to keep up. You need to use other resources besides the chem book to get a better understanding of the materials. You can also go to office hours which helps but it's not always easy to go to them.\nI would recommend taking him as your professor. He wants you to succeed which is a refreshing feeling.\n \nWorkload:\n3 exams (one can be dropped), one final, weekly assignments that aren't graded, weekly quizzes.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "May 07, 2012",
            "review_content": "\nThis semester, C1404 was co-taught by Professor Gonzalez and Professor Bursten.  Professor Gonzalez taught everything up to Thermodynamics (roughly 2/3 of the material for General Chemistry II), and then handed things over to Professor Bursten for Thermodynamics and Chemical Kinetics.  \nI found the first 2 months of lecture very frustrating.  Professor Gonzalez puts very little effort into enhancing the material presented in Zumdahl.  He takes his slide show presentations DIRECTLY from the textbook, including worked out examples and graphs.  This makes his presentation redundant for anyone who bothers reading the book before class.  If something doesn't make sense in Zumdahl, it won't make sense in lecture.  Professor Gonzalez incorporates 1-2 clicker questions into class, and even the promise of a grade bump dependent on your clicker use wasn't enough to fill the seats of this 10:30am lecture.  In order to obtain solutions/an answer key for practice exams or midterms, you were required to attend office hours.  This was supposedly a policy enacted to encourage students to engage with the material, although several days before the final exam the head of the Chemistry Department said this policy had been enacted to prevent \"exam stocking\" by the frats.  Mysteriously, this section of Chemistry was the only section for which this policy was enforced.  \nProfessor Bursten was a game changer for the last month of Chemistry.  He taught occasionally as a substitute during the first two months, and then taught the remainder of the course (~4 weeks) following the 2nd exam.  Professor Bursten came to class full of energy, with slides that looked nothing like the material in Zumdahl (I think he authored his own textbook a few years back).  Demonstrations were plentiful, and he worked a lot of problems out on the board.  This is probably why Thermodynamics \"sticks\" better in my mind: step-by-step problem solving during class, as opposed to following along on a powerpoint.  However, just because he's an excellent lecture doesn't mean he is an easy professor.  His clicker questions were challenging, and the questions he contributed to the exams could tie your brain in knots.  However, I found it easier (and more pleasant) to learn from someone who clearly put a lot of effort into preparing for class and was eager to see students succeed.  It was too late in the semester to see any appreciable difference in attendance, but those of us who were regulars in morning lecture appreciated Professor Bursten's enthusiasm.\nIn sum, I think the Chemistry Department has some work to do in order to improve this course.  The course should be taught by one professor throughout the entire term, splitting the course between two completely different teaching styles is frustrating for both students and professors.  There should also be a department-wide policy about the use of practice exams/past exams.  It doesn't seem fair that the evening class (taught by Dr. Beer) was permitted to work from old exams, but this new policy was enforced for the Bursten/Gonzalez sections. \n\nWorkload:\nHeavy workload.  3 Midterms (1 equivalent each), 8 Quizzes (1 equivalent, lowest two scores dropped), 1 Final Exam (2 equivalents); lowest equivalent dropped\nPrepare to work, work, work.  The quizzes are tricky, with an average around 1.5 pts (out of maximum 3).  Exam scores were decent for the 1st exam (mean ~65), then took a nose dive for acids/bases and thermodynamics (mean ~50 for each).    \n"
        }
    ]
}