{
    "prof_info": [
        {
            "prof_name": "Adam Winters",
            "prof_id": 12838,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 09, 2016",
            "review_content": "\nAdam is a fantastic UW professor. Engaging during class, approachable after class, and his comments are usually helpful and constructive.\nInitially, I was worried the Sustainable Development section would be a preachy liberal shit-fest, but I turned out to be wrong (about Adam at least). The readings were engaging and varied to the point it didn't feel like we were covering the same thing all semester.\nWorkload is similar to most other UW classes, but luckily the readings are typically short and don't include literature by anybody who died over two centuries ago.\nHe is also a fair grader and will not hesitate to help struggling students. ASK FOR HELP IF YOU NEED IT!\nTake Adam's section of UW, you won't regret it. \nP.S.\nIf you regret it, you're probably just a really shitty writer who ignored his comments.\nWorkload:\nUW norm-\nFour papers with drafts\nAssignments due for every class\nReadings\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 26, 2014",
            "review_content": "\nAdam is a great UWriting professor.  His classes are interesting and he manages to provoke good discussion (despite the 8:40am class time).  I had him for the Sustainable Development themed section, and he really knows his stuff (I guess his background in biology plays a role in this too), and in the process of doing all his readings and exercises I learned quite a bit about both the theoretical and practical sides of Sustainable Development.\nI'd highly recommend his class for students interested in sust dev.  In terms of writing, this class really made me think.  Adam requires you develop detailed, advanced, non-trivial, and very well thought out essays.  Although at times frustrating, the class will no doubt make you a better thinker and writer.\nI thought the workload was intense but largely manageable.  He gives a couple readings and a written exercise (about 1-2 pages) per class, which ultimately will help you for the essay.\nHe's also a fair grader, but expect to get lower grades than you did in high school.  His comments on your drafts and essays are long, detailed, and so so helpful.  I also highly recommend going to a lot of his office hours, because he has great suggestions and comments.  Talking about your essay ideas will definitely help!\nMoral of the story: take Adam's class!\nWorkload:\nIntense but no more than any other uwriting class.  ~2 readings + 1-2 pages of writing per class (not graded).  4 essays, with an exploratory, formal, and final draft for each.  \n"
        }
    ]
}