{
    "prof_info": [
        {
            "prof_name": "Brian Larkin",
            "prof_id": 616,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Maxium Cinemas: India/Nigeria",
            "review_date": "January 07, 2014",
            "review_content": "\nProfessor Larkin is very intelligent and loves Indian and Nigerian cinema, which one can clearly tell when listening to his lectures. That being said, sometimes it was difficult to follow his lectures. Not only does he have an accent, he talks quickly and the material isn't the most clear in the first place. But, the redeeming quality was the cinema. The Nigerian films were hilarious but I wasn't in love with them. The Indian films, though, were fantastic. They had me watching a crap load of Indian films on Netflix during the break, and I now plan on taking a Bollywood class next semester. I have to give it to Larkin for his excellent film choices - not typical, boring films that other classes may require us to watch. They -almost- made it worth being in the class from 6 - 10:15 pm. Tuesdays are my earliest and my worst days but I hardly ever fell asleep because all of the films were so entertaining. But be prepared to stay super late when you watch the three-hour Hindi films, because people will talk and talk and talk (like I'm clearly doing right now - except you have a choice in whether or not you read this) like it's not 10 pm on a Tuesday night. And according to Larkin, despite the fact that on the schedule it says that we're only supposed to stay from 6 - 9, we have to \"commit to the time\"...yeah, okay. He takes attendance too, and decreases your grade if you're absent 2+ times. It's worth showing up just for the films. Plus, the readings were screwed up sometimes and so was the media. This resulted in an extra film analysis being cancelled (one of them never had to be done because of the shot analysis of a short clip) and the shot analysis got pushed back. Good stuff. So, he can be lenient.\nThe grading was a bit harsher than what I was expecting. Fortunately, one of the weekly film analyses is dropped, and it's typically the first one because Larkin didn't exactly make it clear what he wanted until we got it back. In addition to Larkin, there is one TA. If you take all of her criticism seriously (and his because sometimes he grades them), you will do really well on the assignments. But the midterm surprised the heck out of me. First of all, there was one essay question and we had an hour to respond. The TA gave us like 5 - 10 extra mins and then had the nerve to say \"I gave you guys 5 extra minutes, so...\" If only one essay determined the whole grade, it shouldn't have been just an hour in the first place. But, despite how rushed I felt, eventually I began to feel confident in how I did. Little did I know. I got a C+ on the midterm and that was the surprise of the semester. Tuh. BUT, given that the midterm is worth 25%, I figured that if I did well enough on the take home final (40%), that I could still do well in the class considering how well I did on the analyses. I got away with a B+, which is a lot better than what I was expecting based on that midterm. So even if you butcher the midterm, it is possible to do well - just make sure to apply all of their feedback so that you can do well on the analyses and the final.\nGood for you if you read all of this. Good for you. You'll do well reading the articles. Overall, I would recommend this class if only for the films. I will always be happy that it introduced me to Indian cinema...and Nigerian, even if I don't take it too seriously.\nWorkload:\nWeekly 1-2 pg. film analyses (25%), one easy 3 pg. shot analysis of a film (10%), one verbal film term quiz (not graded), one midterm and one final (only 2 four pg. essays). Readings range from 5 - 60+ pages - some are interesting, some not so much if at all. For the verbal quiz, we got a list of terms that we had to memorize in the beginning of the semester. During the beginning of the second or third class, he called on people from the attendance list to define some of the terms, and that was that.\nDo the readings - if no one participates, he will go through the attendance list and call on people. He usually gives a warning beforehand but you should always be prepared.\n"
        },
        {
            "course_name": "Africa: Culture and Society",
            "review_date": "January 17, 2010",
            "review_content": "\nNever mind the name: this course is not Africa-in-a-box, codified and prepared for examination by undergrads hungry for a taste of the exotic. As I often explained it to my friends, \"We don't really talk about Africa. It's more like talking about how people talk about Africa. And it's amazing.\" \nProfessor Larkin is brilliant, but perhaps not for everyone. He takes serious time and care to ask (and answer) questions of the class; however, this practice may result in lectures feeling a bit like they start and stop (the class often ended with 5 minutes of frantic lecture-note reading as he ran out of time). The course is colored by Larkin's professional work in Nigeria and interest in media, which offers a good balance to some of the more heavy theory (the course was also a great introduction to some big names in contemporary African scholarship, at least for someone like myself with little-to-no background in African Studies). You'll *learn* stuff about Africa, no doubt, but more importantly, if you're as enraptured by Professor Larkin's eloquence (okay, okay, and piercing blue eyes...) as I was, you'll learn how to ask better questions - about anthropology, about history, about modernity, about urbanization, about corruption, about development, and well, yeah, about Africa in a contemporary, global context. Ever have one of those \"THIS is why I'm at Columbia (or Barnard, sorry!)\" moments? Twice a week. \nWorkload:\nREADING (c'mon, it's anthro, what did you expect?) some of it pretty heavy and theoretical. 2 5-page papers; in-class final exam: 3 essays in 3 hours (!). Open book, but you'll probably want to have, um, read the books. Quote well.\n"
        },
        {
            "course_name": "Africa: Culture and Society",
            "review_date": "January 17, 2010",
            "review_content": "\nNever mind the name: this course is not Africa-in-a-box, codified and prepared for examination by undergrads hungry for a taste of the exotic. As I often explained it to my friends, \"We don't really talk about Africa. It's more like talking about how people talk about Africa. And it's amazing.\" \nProfessor Larkin is brilliant, but perhaps not for everyone. He takes serious time and care to ask (and answer) questions of the class; however, this practice may result in lectures feeling a bit like they start and stop (the class often ended with 5 minutes of frantic lecture-note reading as he ran out of time). The course is colored by Larkin's professional work in Nigeria and interest in media, which offers a good balance to some of the more heavy theory (the course was also a great introduction to some big names in contemporary African scholarship, at least for someone like myself with little-to-no background in African Studies). You'll *learn* stuff about Africa, no doubt, but more importantly, if you're as enraptured by Professor Larkin's eloquence (okay, okay, and piercing blue eyes...) as I was, you'll learn how to ask better questions - about anthropology, about history, about modernity, about urbanization, about corruption, about development, and well, yeah, about Africa in a contemporary, global context. Ever have one of those \"THIS is why I'm at Columbia (or Barnard, sorry!)\" moments? Twice a week. \nWorkload:\nREADING (c'mon, it's anthro, what did you expect?) some of it pretty heavy and theoretical. 2 5-page papers; in-class final exam: 3 essays in 3 hours (!). Open book, but you'll probably want to have, um, read the books. Quote well.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 16, 2006",
            "review_content": "\nI was excited to take this class because most of Larkin's reviews were fairly positive. BUT, though the class started well, by the end of the semester I wanted to kill myself! \nThe readings were long- some were interesting and even complicated, but others were utterly irrelevant and just plain painful to get through. The second half of the semester was all over the place- nothing was tied together, and I didn't really see how any of those books even tied to Anthropology at all. \nLarkin CLEARLY is obsessed with Africa, which is interesting at times, but REALLY gets out of hand towards the end. He doesn't focus at all on the rest of the world. His interest ends painfully with the final 400 page book about an African prostitute that's more or less written in ebonics. Seriously. \nThe TAs were nice, and meant well, but the sessions were essentially useless and have no direction. \nWorkload:\nReadings nightly that are sometimes managable, but often complicated and lengthy; one 4-6 page paper with the MOST vague topic and ended up being very difficult; one in class essay midterm; one final exam (which he was 20 minutes late for, didn't give us extra time, and still expected us to write 3 complete essays). The midterm and final were open book, but he expects you to have quotes for every argument, and that makes them much harder.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 02, 2006",
            "review_content": "\nGetting through this class was the most painful experience in my academic career thusfar. The readings were boring and dry, the lectures weren't mindblowingly enlightening, and the TAs, though nice, were not that helpful in conveying information. First of all, Professor Larkin was ALWAYS late for lectures. I can understand if the professor is late one or two times during the semester, but he was late so much that students who arrived 5-10 minutes later would still be in their seats before Larkin was in class. Alas, his lack of punctuality wouldn't have been a big deal had it not affected our final examination. He was LATE 20 MINUTES to our final, and worse, he refused to give us extra time, which really sucked since the final was supposed to be three essays in three hours.\nThere was also a lot of reading for an introductory course, which I thought seemed unnecessary especially since it was extremely boring. Anthropology seems like a field that has a lot of flexibility and is applicable to everyday, modern life, which could be really interesting to learn. However, Larkin really killed the field of interest for me. The old Antropological studies that he had us read, albeit helped shape the field and very important to the understanding of Anthropology, was focused on too much. It would have been better if he focused on older studies in the beginning of the semester and then brought in some modern applications of Anthropology to the latter half. I think what Larkin needs to understand is that Anthropology can be introduced to students as a study that can be applied to every society in every time period, not just the indigenous tribes of wherever today or 50 years ago. It doesn't always have to be applied historically or geographically. It can be applied to modern society. Culture is everywhere, not just in Africa.\nIf there was enlightening information that I may have missed and that would have allowed me to appreciate the readings, it was not revealed to me by the TAs during discussion section. The TAs were nice and tried to help prepare us for the exams, but when it came to discussing the readings, we never finished understanding the major points. Someone would ask a question, and we would go down a spiraling tangent of random facts and anthopological thought. Of the 55 minutes we spent in section, probably only 15-20 were really devoted to undersatnding the readings.\nIf you're going to take this course, definitely take it with a different professor. I've heard of other professors giving much more interesting assignments and readings to introduce the field to students (i.e. Prof. Sharpe). But as long as you understand the major concepts Larkin is trying to get through, you'll do fine on the paper and exams.\nWorkload:\n80-125pgs/week of reading, mandatory weekly discussion section, one 5-page paper, Midterm (1 essay), Final (3 essays).\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 29, 2005",
            "review_content": "\nI really enjoyed this class and it made me want to be an anthropology major. Larkin was great - I thought he was well organized, he asked for classroom engagement which can spice up lectures every once in a while and really seemed to do a great job applying what we read in class to the real world in a way that made everything, even the most boring and confusing readings, really interesting. There were also really interesting readings: Boas, Geertz (though probably not enough of him), Evans-Pritchard, etc. THe TAs were really nice and understanding (Caroline and Katie) and each taught one lecture. I highly recommend this class and Larkin. \nWorkload:\nThe first paper was really hard and most people got B's on it - it was a very broad question to which your answer was supposed to include an \"argument\". Then there was an in class midterm and an in class final, which was 3 essays in 3 hours - quite a killer. I ended up with an A- in the class though, which proves you don't have to finish all the readings (but you do have to have a general idea and a lot of quotes available to prove your point for the open book tests)\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 14, 2005",
            "review_content": "\nThe first day of class, I was stunned at the brilliance of this man. The points that he was bringing together and relating to each other just blew me away. While some of the lectures can be a bit boring (especially if you're exhausted and haven't had that morning cup of coffee), they were always worth going to-- even for the two sentences that you did make out through his English accent. Make sure you raise your hand a couple of times to show him you've done at least some of the huge amounts of reading and you should be fine. Also, for the first readings for the first exam, ask him what you should be reading for, I wish I had!\nWorkload:\nA whole big packet of excerpts from the copiers, 6 books (some easier to get through than others, but I'm not sure how many people actually read each book all the way through), a take-home essay, an in class midterm paper (1 hour), and an in class final (3 papers in 3 hrs).  \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 29, 2005",
            "review_content": "\nBrilliant, interesting. Made the class fun, and lectures were great. However, he expects a lot, so try to be a genius. You have to be able to connect many different things from many different theories. \nWorkload:\none take home midterm, one open book in class midterm, one essay, one open book in class final\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 13, 2005",
            "review_content": "\nalthough i read all the reviews about how disorganized he is, i just didn't see it in the class. He comes very prepared with pages of notes and specific quotations. At times, it seems that he's saying the most brilliant things off the top of his head. He does a very good job of relating the readings to everyday observations that anyone can easily understant. Definitely do the readings, but the discussion sections are mandatory for a reason. They help a great deal. It's true that he doesn't answer his email, but office hours are there for a reason, so he can get to know you, which is definitely does do if you make that effort. Definitely one of my favorite professors.\nWorkload:\none paper, openbook midterm, final, a lot of readings but they're discussed in section\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "February 15, 2005",
            "review_content": "\nDon't take this class unless you have a genuine intrest in Anthropology, I took it thinking it sounded easy, but it was both very boring and not as easy as I had hoped.  The reading is pretty dry and at times very long, and Brian Larkin is as the other reviewers have said, quite unorganized, which I found obnoxious.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 24, 2004",
            "review_content": "\nLarkin's class was disorganized, as the other reviewers have said. \nlectures were a bit rambling, and he would forget what he was talking about when he tried to come back from tangents. But for all that it was one of my favorite classes the semester I took it. The readings were both broad and interesting, ranging from writers who founded various schools of thought in anthropology to contemporary writers who question the assumptions of the anthropological method.  Towards the latter part of the semester we began using the methods of anthropology to investigate contemporary issues and modern technologies, such as globalization  and amniocentesis. I also found that his tangents were actually some of the most interesting ideas I've heard. If you've already taken a bunch of anthro classes, maybe skip this class, but as an introduction to anthropology it's pretty good. As for the disorganization-quite frankly, the class is easy enough that organization is not actually required. \nWorkload:\nEasy. Reading was light, maybe 2hrs a week, and most of it is covered (read: summarized) in discussion section. one 4pp paper, a midterm and a final. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 23, 2004",
            "review_content": "\nAlthough the material for the class and the readings are interesting, the lectures tended to be somewhat disorganized. Discussions that should have been conducted in sections were conducted in class making the class slower and more confusing. Prof. Larkin is alright but in my opinion he needs more practice in teaching a lecture class.\nWorkload:\nMidterm, one 4-page paper and final. Its not overwhelming and you can get away with not reading everything. Fair grading.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 08, 2004",
            "review_content": "\n1.) Really cool English accent\n2.) He's never taught this class before, so he didn't seem to realize that it was a 1000-level intro class.  His expectations were WAY too high\n3.) So it was hard.  The readings are dense, his lectures are disorganized, and he doesn't answer email (go to his office hours).\nIn general, I hated the class, but it wasn't totally his fault.  The subject is hard, and too large in scope to cover in a semester.  He needs to lower his expectations a little, but he's a nice person, and maybe with the TAs on strike, he'll read the finals and realize that everything was way over our heads...\nWorkload:\nAll tests are essays (1 question midterm and 3 question final) plus one take home 4-page essay\n"
        },
        {
            "course_name": "The Anthropology of Media",
            "review_date": "April 22, 2001",
            "review_content": "\nAt some point in college, every student should get to have a professor like Brian Larkin. Every week, I have walked out of anthro of media arguing ideas with at least one of my classmates. Run like a true seminar, reading is fairly heavy and often rather dense, but almost all of the readings are interesting and bring something to the class. Larkin is also flexible enough to allow students to bring theory from other classes into the discussion. At the beginning of the semester, everyone is assigned a group and every couple of weeks the group is in charge of presenting that week's readings. In the rare event that discussion gets boring, Prof. Larkin's colorful sock choice and British accent prove to be adequate distractions The overarching goal of the class is to undertake an ethnographic project relating to media. The product is a 15 page paper and a brief presentation the final week of class. Larkin is incredibly approachable and a most enthusiastic and helpful guide both within class and for individual research.\nWorkload:\nseries of movie screenings, two 4 page papers, one 15 page paper based on original research (and five minute presentation), group presentations of readings ever four weeks.\n"
        }
    ]
}