{
    "prof_info": [
        {
            "prof_name": "Nicole Hughes",
            "prof_id": 11273,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to the Study of Hispanic Cultures",
            "review_date": "January 06, 2015",
            "review_content": "\nNicole is friendly and fun, but her class severely lacks depth and any kind of academic enthusiasm/knowledge on her part. If I were to describe her class: it's like that day you have a sub because the professor is sick, but in this case the professor is there. Expect a lot of YouTube clips that vaguely connect to course material, peripheral and superficial conversation of the readings assigned, and small group work on proper teacher-student etiquette (really). The class is not hard nor fulfilling, but I wouldn't necessarily recommend it to anyone who didn't enjoy sustained boredom and lackluster conversation while trying very hard not to fall asleep.\nWorkload:\nReasonable, but a lot of writing - about 8 4-page papers, one final paper (15 pages), and periodic guias (guides) on course readings. \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "December 20, 2011",
            "review_content": "\nNicole's Elementary Spanish I class was fun. She was fun to work with, and she showed us some cool Spanish videos. With that being said, I think her grammar lessons lacked depth. We simply read through what it said in the book--something we could have done on our own. I would much rather have had her spend time actually teaching the lesson herself rather regurgitating the book. \nAlso the system for homework just wasn't efficient. For most of the semester we were required to bring to class three questions that we had about the hw, which on many occasions was very difficult to come up with when the computer program used actual have the answers. I also felt that the hw assignments were arbitrary in that we never went over what we were asked to do in the assignment before we actually did the assignment. So we had to teach ourselves the grammar for the most part. In addition, the MySpanishLab program has to be the most annoying programs I have ever used. Its unbelievably slow, and there were definitely times when it wouldn't let me submit my hw.  \nNicole also is not a hispanohablante, so often when we would ask her what some word means she would just say \"oh you know\" and tell us the word again with a different emphasis. When it came to teaching the lessons, she would start out speaking only in Spanish but eventually she would give up when a student was asking a lot of questions and just revert back to English. Nonetheless, she definitely tried very hard, and she was a nice person.\nWorkload:\nNightly hw online. Compositions that were every two to three weeks. Unit Vocab Quizes(didn't seem to be actually for a grade). Midterm + Final +  Oral Exam\n"
        }
    ]
}