{
    "prof_info": [
        {
            "prof_name": "Aaron Veicht",
            "prof_id": 11292,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Experimental Physics",
            "review_date": "December 26, 2011",
            "review_content": "\nOh, the horror!\nI provide this review not to help you decide whether to take this class (after all, you have no choice) but rather to suggest a coping mechanism.\nA little background: the SEAS bulletin suggests that you complete your lab science requirement some time during your freshman or sophomore years. There were other things I wanted to do, so I ignored these suggestions and put it off until later. At some point I discovered that my roommate had been doing the exact same thing, so we decided to wait until the last possible moment and take it together.\nFirst semester of senior year arrives; we register for 1493. It is so tedious I want to set myself on fire to provide some diversion. It is unspeakably, indescribably awful.\nSo my lab partner and I do what any reasonable undergraduate would do in this situation: we try to make it better with alcohol. We buy a bottle of whiskey, and label it \"Science Whiskey.\" We store it in our suite. Every day before lab, we help ourselves to a generous portion of science whiskey, then fill up a water bottle and bring along some more for the road.\nLab, if not fun, at least becomes tolerable. And extraordinarily, the science whiskey actually makes us better at science. We are the first group done nearly every week, and our lab report grades are consistently higher than those of our classmates.\nThe moral of the story? It's a lousy requirement, but nothing a little creative intoxication can't render palatable.\n\nWorkload:\nI think it's supposed to be fairly heavy. We were out of almost every lab session within 90 minutes, and by the end of the semester were beginning our lab reports 50 minutes before they were due. Haven't gotten my grade yet, but I'd be surprised if there were any serious ill effects.\n"
        }
    ]
}