{
    "prof_info": [
        {
            "prof_name": "Alan Yeung",
            "prof_id": 2197,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Topics in Orgasmicism: The Masturbating Maeterlinck",
            "review_date": "May 12, 2005",
            "review_content": "\nWhere the essay [\"Le Tragique Quotidien\"] is at times comfortable with its cosy mysticism (the kind of cosy mysticism that characterizes Maeterlinck's subsequent writings), the plays it is held to 'explain' instead privilege the sinister and energetic forces beneath the stillness of the surface. Indeed, this is the same cosy mysticism through and by virtue of which the Deleuzian abstract machine effortlessly fuses the inter-, intra-, extra-, para-, pre-, post-, semi-, anti-, pro-, intro-, immanuel-, robo-, socio-, temporo-, economico-, manifesto-, potato-, al-strata (as well as all others this writer has failed to mention) into one singular Uberstratum. Hence the 'stillness' is itself inexplicable--and to 'explain the stillness' is an all but oxymoronic proclamation, which, finally, converts Maetelinck's pitiable masturbatory self into his writerly persona, and thereby propells him to the contradictory saint/satan status equivalent to Derrida's--simultaneously Christ, Mary, the Devil, the Darwinian monkey, and Freud's Dora. It is precisely this peculiar status that this present work intends to negotiate and problematize. In a sense, while Maetelinck the writer enjoyed the celebration of his contemporary Parisian artists and intellectuals, Maetelinck the man never progressed past the Lacanian Mirror Stage and remained in 'infancy' with a muddled self-perception and a complete inability to identify with his German roots. Therefore it is more appropriate and critically fruitful to consider 'Maetelinck' a poststructural, postmodern, postcoital phenomenon--specifically, a conjoinment of contradictory signified-signifier pairs and an illusion unifying fundamentally incompatible selves--than a person. Symptoms of schizophrenia are evident in the semi-autobiographical 'Alliman,' in which Maetelinck's brutal and resolute denial of an allegoric distance between theatre and life proved too much for his acquaintances, family, and indeed his own sanity. To further demonstrate this point I refer to his last play, which he wrote on his death bed in Luxembourgh and aptly, schizophrenically named 'Ich bin mensch? Les Ecrits Orgasmique!'...\nWorkload:\nNot a small a load...\n"
        },
        {
            "course_name": "Topics in Orgasmicism: Philosophical Photography and Photographic Philosophy",
            "review_date": "November 08, 2004",
            "review_content": "\nphoto-cropping, indeed, is a delicate task, one requiring mental concentration, visual acuity, and sensitivity of touch. the blade's trajectory is the fine line of infinitesimal width resting between\npositive and negative space, between the pitch-black within the frame and the absolute white without. where the blade travels, Presence and Absence are split from the whole. obviously, the philosophical potential here is boundless, or at least as boundless as its boundlessness is obvious--what is a photograph's being? what is the being of its logicographical opposite, viz. the nonphotograph? what is the being of one being in the being of the other? what is the being of the being of one and the being of the other being in its entirety subsumed into the being of the sum of the being of the one and the being of the other?--yet the severance is so immediate, so silent, that it seems to disencourage meditation, or even threatens to flee the memory of its effector.\ni know not now to express my feeling in words, but a tension invariably and incessantly plagues me as i shove the materiality of Absence (the unwanted edges) into the blue trash can, and as i glue the materiality of Presence (the cropped photograph) to yet another, albeit smaller, materiality of Absence (the white page of the notebook): am i saving ink, or am i wasting paper? alas, a kind of hell, a kind of heaven, the graph and the letter merged into one, then reduced to none.\nWorkload:\nat once light and heavy, nothing and everything, yet always orgasmic in the deleuzian sense.\n"
        },
        {
            "course_name": "Introduction to Orgasmicist Thinking",
            "review_date": "November 08, 2004",
            "review_content": "\nNo review is more informative than an except from a typical lecture by Prof. Yeung, a devout stylistic and intellectual follower of a certain well-known poststructuralist thinker: \"This assymetry of binary oppositions incessantly disrupts, disengages, and, at last, destroys the weaker of the pair. The sole metaphysical escape that the impossible has from the overwhelming sea of the possible is to withstand ejaculation, then reinject itself into\nthe possible, and finally subversively overturn the dominance granted to it by imperfect human grammar, thereby freeing the subjective floating signifier within the sign from the omnipresent threat of verbal castration by distending the reflexive signification of the former. This difficulty is, at last, precisely the same difficulty\nthat hordes of modern phenomological philosophers of  language tried to tackle and failed--how can two entities be at once disparately different and desperately similar? How can sameness and difference be same or different if the sameness of or difference between the very concepts of sameness and difference is doubted, even challenged? And yet the cause of this apparent difficulty, as I have demonstrated above, is a confusion--due to, I might add, an especially obnoxious\nkind of mental laziness that plagues sadly many of my colleagues--so simple that it approaches the point of sheer idiosy: understanding the words \"possible\" and \"impossible\" as opposites detaches the mind from the obvious reality that, rather than two ends of a stick balanced in the middle, they are much more like a line of infinitesimal width cut out from a pie versus the rest of that pie...\"\nWorkload:\nWhen we asked about the requirements for the 30-page final paper, Prof. Yeung thought for a moment before saying, \"Requirements are the incessant reacquiring by the unintended intents--and, at last, the very key to the Foucauldian pendulum.\" Then he left.\n"
        }
    ]
}