{
    "prof_info": [
        {
            "prof_name": "Paola Castagna",
            "prof_id": 2672,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Italian Literature I",
            "review_date": "January 17, 2014",
            "review_content": "\nPaola is an incredibly caring and fun teacher. Though the class is completely in Italian and the expectation is that each student is more or less fluent, Paolo was patient with every student and created a class in which effort and enthusiasm were all you needed to get an A. The classes were sometimes boring, especially in the beginning, but Paola's passion for the subject wears off on you after a while and you end up enjoying the class just because she is so full of life and care for her students and the subject. I highly recommend taking this class, even if your Italian is a bit shaky and your forte isn't literature, but only if Paola is teaching it. The readings themselves can be boring and difficult and the Italian can be difficult if the professor isn't lenient. \nWorkload:\nA reading each week, two posts online weekly about the reading (1-2 paragraphs each), two essays (2-3 pages each, one assigned around midterms, the other assigned around Thanksgiving), a midterm project, and a take home final. Everything is graded almost entirely on ideas, unless your grammar is horrendous, it pretty much doesn't factor into grading. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 10, 2013",
            "review_content": "\nIf you have the option of having Paola for class, PICK HER! You will not regret it. I wish I had her for the full year! I'll break down the class\nHer: Amazing. She not only cares about the class, she really cares about her students. She will go out of her way to make sure you know whats going on, and will provide you with the feedback you need. Even though our class at 9am's on Monday's and Wednesdays, she brought life and humor to our class. She really knows her stuff, and will definitely make you more interested in the class and the material. \nClass: Discussion based like most. She leads the discussion, but she loves getting our feedback. She'll always find a way to make it fun, and will crack jokes out of the blue. \nWorkload: Standard. She likes to spend a lot of time talking about texts, so you will definitely go slower then most of the other Lit Hum classes. Which is fine! You will have a Wikispace, where she will expect you to post twice a week. Not bad at all. Two 6 page papers. She gives amazing feedback on it. I sent her my draft for my final paper a few days before it was due to see if she could possibly read it. She ended up doing a full review of it, and gave great feedback. Then midterm, and final. All standard. Midterm was only ID's. You would think that it was bad, but she spent a lot of time preparing you. She also held a 3 hour review session for this final as well.\nLong story short, She is an unbelievable, fun, and such a nice professor. If you can get you, get her. \nWorkload:\nStandard. See above\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2010",
            "review_content": "\nPaola is the best! The reviewer below me really summed it up. I've never met a professor that cares so deeply for her students. She puts so much time into this class! Papers are edited IN-DEPTH and will be covered with comments; then, she'll ask for a skype date so you can discuss the essay/your grade on it. In class, she is enthusiastic and kind. She also prepares you well for the final exam with a huuuuge final review that goes over every theme you could think of. Seriously. Be happy that you have Paola! If you put the work in, you'll do well. And she'll love you!\nWorkload:\nNormal. Reading, 2 six page papers, postings online for your participation grade (these are very important to Paola)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2010",
            "review_content": "\nI had this instructor for the second semester of LitHum, and I absolutely loved her. She is the most energetic, encouraging, and involved professor I have ever experienced and probably ever will experience. From day one, she has demonstrated a great knowledge of the texts, unending enthusiasm for these texts, and a real interest in every single one of her students. Basically, she has an awesome personality AND is incredibly intelligent.\nPaola is very friendly and approachable. She treats her students like they are her equals, and just as importantly she is never condescending (which is, in my opinion, a rare find in LitHum/CC instructors). Even when students make not-so-intelligent remarks in class, Paola finds a way to dismiss these remarks in a friendly way that never makes anyone feel inadequate (again, a rare find). \nNow I know that not every student is going to be as energetic or interested in the material as this instructor, but Paola is so nurturing (and overall likable) that pretty much every student in my LitHum class would vouch for how great she is. Even if you are simply not a humanities/LitHum kind of person, you will love the teacher and most likely catch some of her enthusiasm for the texts. \nPaola is deeply dedicated to this course and to her students, and in return she expects her students to also show a lot of dedication. Although she has high expectations, she definitely prepares you enough for these expectations. She is very available for help, and has even offered to Skype in order to reach us. Also, when you like an instructor, high expectations aren't all that hard to meet. I didn't mind actually reading the texts and participating in class because Paola is just so awesome.\nThe main message I want to relay is that having a great instructor is absolutely worth the work and time you have to put into a course, and Paola is absolutely a great instructor. Having someone as dynamic as Paola as a teacher can truly change how you view a course, a subject, and college in general. That might seem like a stretch to someone who has yet to experience such an instructor, but I promise you it is true.\nI feel immensely lucky to have had Paola. Hopefully you will be lucky enough too! \nWorkload:\nReading, two 6-page essays. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2010",
            "review_content": "\nI had this instructor for the second semester of LitHum, and I absolutely loved her. She is the most energetic, encouraging, and involved professor I have ever experienced and probably ever will experience. From day one, she has demonstrated a great knowledge of the texts, unending enthusiasm for these texts, and a real interest in every single one of her students. Basically, she has an awesome personality AND is incredibly intelligent.\nPaola is very friendly and approachable. She treats her students like they are her equals, and just as importantly she is never condescending (which is, in my opinion, a rare find in LitHum/CC instructors). Even when students make not-so-intelligent remarks in class, Paola finds a way to dismiss these remarks in a friendly way that never makes anyone feel inadequate (again, a rare find). \nNow I know that not every student is going to be as energetic or interested in the material as this instructor, but Paola is so nurturing (and overall likable) that pretty much every student in my LitHum class would vouch for how great she is. Even if you are simply not a humanities/LitHum kind of person, you will love the teacher and most likely catch some of her enthusiasm for the texts. \nPaola is deeply dedicated to this course and to her students, and in return she expects her students to also show a lot of dedication. Although she has high expectations, she definitely prepares you enough for these expectations. She is very available for help, and has even offered to Skype in order to reach us. Also, when you like an instructor, high expectations aren't all that hard to meet. I didn't mind actually reading the texts and participating in class because Paola is just so awesome.\nThe main message I want to relay is that having a great instructor is absolutely worth the work and time you have to put into a course, and Paola is absolutely a great instructor. Having someone as dynamic as Paola as a teacher can truly change how you view a course, a subject, and college in general. That might seem like a stretch to someone who has yet to experience such an instructor, but I promise you it is true.\nI feel immensely lucky to have had Paola. Hopefully you will be lucky enough too! \nWorkload:\nReading, two 6-page essays. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2010",
            "review_content": "\nI had this instructor for the second semester of LitHum, and I absolutely loved her. She is the most energetic, encouraging, and involved professor I have ever experienced and probably ever will experience. From day one, she has demonstrated a great knowledge of the texts, unending enthusiasm for these texts, and a real interest in every single one of her students. Basically, she has an awesome personality AND is incredibly intelligent.\nPaola is very friendly and approachable. She treats her students like they are her equals, and just as importantly she is never condescending (which is, in my opinion, a rare find in LitHum/CC instructors). Even when students make not-so-intelligent remarks in class, Paola finds a way to dismiss these remarks in a friendly way that never makes anyone feel inadequate (again, a rare find). \nNow I know that not every student is going to be as energetic or interested in the material as this instructor, but Paola is so nurturing (and overall likable) that pretty much every student in my LitHum class would vouch for how great she is. Even if you are simply not a humanities/LitHum kind of person, you will love the teacher and most likely catch some of her enthusiasm for the texts. \nPaola is deeply dedicated to this course and to her students, and in return she expects her students to also show a lot of dedication. Although she has high expectations, she definitely prepares you enough for these expectations. She is very available for help, and has even offered to Skype in order to reach us. Also, when you like an instructor, high expectations aren't all that hard to meet. I didn't mind actually reading the texts and participating in class because Paola is just so awesome.\nThe main message I want to relay is that having a great instructor is absolutely worth the work and time you have to put into a course, and Paola is absolutely a great instructor. Having someone as dynamic as Paola as a teacher can truly change how you view a course, a subject, and college in general. That might seem like a stretch to someone who has yet to experience such an instructor, but I promise you it is true.\nI feel immensely lucky to have had Paola. Hopefully you will be lucky enough too! \nWorkload:\nReading, two 6-page essays. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 29, 2005",
            "review_content": "\nI agree with about everything the first reviewer said except I wish Paola would provide a little more background information on the texts.  I think the class might even have too much discussion at times because she tries too hard to make us come up with the answers even if nobody has them.  We end up wasting time and then sometimes we never get the real answer.  I understand that a lot of the time there is no real answer, but it would still be nice to know what the teacher thinks sometimes.  But I do agree that she is very energetic and friendly (maybe even too friendly).  I think this class is very good, but I'm not as in love with it as the first reviewer seems to be.\nWorkload:\nStandard.  There's not a lot of wiggle room with lit hum.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 30, 2005",
            "review_content": "\n\"Hi, good morning.  Please, sit down, guys.  LetÂ’s start.  Talk to me!Â”\nItÂ’s 9:10 a.m., and the last few bleary-eyed students are trickling in, gripping half-empty coffee cups in one hand and half-read copies of Thucydides in the other.  Having already reorganized the furniture to create a tighter discussion space, Paola is energized and ready to begin, whether her students share her enthusiasm or not.\nPaola Castagna is very friendly, very intelligent, and very Italian.  She is a good teacher with a great personality, and knows how to guide discussions without interjecting her own ideas right away.  Though she is open to the possibility that there may be multiple answers to many of the questions she asks, if someone comes out with total bull, she will (gently) point that out and bring the discussion back to earth.  An Italian grad student in the Slavic department, she disavows any particular expertise on the Greek works of semester 1, but donÂ’t believe her: she has real insight into the literature and, better, a willingness to learn even more alongside her students.  Even when half the class is either asleep or apathetic, she makes sure they all leave with the right ideas bouncing around in their heads.  For the half that does care, supplementary museum and theatre excursions are encouraged, and you can bet the teacher will be there to make amusing comments about the Greek vases.  \nOf course, she has her weaknesses.  She tries to engage the chronically disengaged, sometimes at the expense of depth in analyzing the subject matter, and though she speaks 99% flawless English, the occasional misunderstanding will occur.  If you find yourself needing to delve deeper, take advantage of office hours--you won't regret it.\nIf you land in Paola CastagnaÂ’s class, stay put; it will be fun if you do your part.  Do your homework and engage your brain.  Paola will do the rest.\nWorkload:\nStandard for the class, but Paola is flexible about the time frame.\n"
        }
    ]
}