{
    "prof_info": [
        {
            "prof_name": "John Martin",
            "prof_id": 5367,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "January 20, 2017",
            "review_content": "\nThis was the most imperial and neocolonial class I have ever taken at Barnard/Columbia. I genuinely want to save any first year from ever taking this class because the overriding message of the entire course was that Third World Countries commit the most violence and are in need of Western countries to go in and change them. The class completely lacked in any critical analysis of human rights as a field / justification for Western imperialism, and completely lacked in tying violence that happens around the world to the human rights abuses of Western civilization. My TA literally asked me once what the American military should do about a conflict between a government in a Southeast Asian country and the indigenous people that live there - as if he was advocating that the American military should enter into the conflict.\nIf you are taking or thinking about taking this class, please do not trust the readings or the professor. HIs framework is ultimately oriented around imperialism and white supremacy, even though he's a nice guy. \nWorkload:\nTons of reading every week from a textbook that provides you useless information, and links to website. The lectures are dry, and participation/attendance obviously didn't count because I went 5 times and got an A. A midterm and a final. \n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "July 25, 2016",
            "review_content": "\nI took this class as part of my major and because I was passionate about the subject, expecting to be able to sit through the class with blinders and just get this prof over with. I was wrong. This class had me considering changing my major because other upper-level classes I needed are only taught by this prof, and he is truly VERY bad. Lectures were quite boring and difficult to sit through, and he has the underwhelming tendency of being able to repeat himself five to six times per lecture, making it seem as he didnt bother to prepare much material. Most of the class didnt even show up, unless it was the final or midterm. The class is so basic that you can skip all of the lectures, not that I am advocating that practice, and still manage to get an A+. \nHe is also VERY racially/culturally insensitive and allows students to be this way as well. On many occasions he has asked some Black Americans to speak about their culture, assuming they weren't from the US. He also has a very dangerous 'white savior' outlook to many human rights issues, implying that \"wealthy, western countries\" need to step in and coddle or heal poor, black and brown countries because they cannot do it themselves and we cannot expect them to make much progress by themselves.         \nWorkload:\nVery Easy. Only two papers due, both under 4 pages. A midterm and final that only consists of looking things up online. \n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "June 06, 2016",
            "review_content": "\nOh lord, what a wonderfully useless class. I'm the type of person that goes to every class, reads every homework assignment and takes copious lecture notes, but, after the midterm, I hardly went to class, didn't do a SINGLE reading after the midterm (not one, I swear) and didn't take even a page of notes and got an A-. That's because your midterm and final are (in-class) open-internet. Yes. Open-internet. As in, he gives you some questions and you google it (aka, Wikipedia, which is allowed) and answer them. You're not even expected to use class readings because, as prof. Martin stresses, he's not interested in \"what you know,\" he's interested in \"how you think.\" Additionally, the two short papers that you have to write don't relate to the readings either. Human rights majors, this class is a gift to you, as it counts for your intro class. On the other hand, it's a complete and utter waste of time if you know even the basics about human rights and the UN. I mean, really, for the second half of the semester, \"homework\" consisted of links to websites that gave outlines of human rights topics (not even readings?) as well as REPEATS of readings that we already did. Really a huge waste of time, but also an easy A.\nWorkload:\nWho cares you don't have to do any of it, \"prepared\" for my midterm and final the night before and even that was a waste of time. Papers took a few hours at most. What a joke. \n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "April 14, 2015",
            "review_content": "\nThe way that Prof Martin conducted this class was appalling. The review before mine was right- he teaches from a neoliberal white savior complex point of view that can sometimes be so naive and offensive that I have to get up and leave class to take a breath and come back. He has referred to Africa, ON SEVERAL OCCASIONS, as an entire country. Apparently he did field work in several countries there, however he failed to recognize the distinct differences between countries, cultures, and the human rights violations/concerns that different countries deal with. \nOn another note, the class itself, despite his disgusting rhetoric, is unorganized and a waste of time. The way he goes over the readings is terrible; he essentially just reads through the whole text and calls it a discussion because he asks a few arbitrary questions that no one wants to answer- you might as well not read beforehand. I don't. I have an A in the class.. The only reason I did well on the midterm was because of the definition sheet he put on the syllabus. No, he did not go over most of these definitions in class. I taught myself through google and the text book. Which reminds me-- the textbook is written from the same white, privileged, naive, ignorant perspective that Prof. Martin teaches from. \nIf you'd like to learn what it's like to live inside the head of an old British man who was a former missionary (yes, missionary) in Africa who only wears monochrome corduroy suits, this class is for you. If you want to have an engaging, interesting class that discusses the nuances of the current HR structures in place in the modern world, stay the fuck away. \n\nDo not take this class. After the first few weeks most people just stopped showing up because he simply stands in front of the class blathering on about random texts he reads off of the internet and the poor little people in Africa. \nTHIS CLASS IS AN ABSOLUTE WASTE OF TIME. YOU HAVE BETTER THINGS TO DO. \n\nWorkload:\nweekly reading that isn't necessary; two papers that have nothing to do with the class; a midterm; a final\n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "March 30, 2015",
            "review_content": "\nThis class was literally terrible. If you're interested in neoliberal, white savior complex human rights, then go ahead and take this class. I feel like John Martin doesn't know anything about human rights and that if I studied international law for a year I could do as good or better of a job. The TA doesn't know anything about human rights either - he's a lawyer and he said he was asked 3 weeks before the class started if he wanted to TA it. I literally did not learn anything of value the entire semester. John Martin's viewpoints are so limited and watered down, I find myself constantly confused by what he's saying and can't imagine that ideas would improve anyones life besides rich white people.  \nWorkload:\nhe assigns at least 40 pages of reading in the textbook per week, but nothing in it is of value and what he talks about in class is much different. 2 papers, a midterm, and a final that is 45% of the grade.\n"
        },
        {
            "course_name": "Graduate Research Colloquium I",
            "review_date": "July 29, 2012",
            "review_content": "\nJ. Paul Martin is a wonderful, wonderful person, but not so good as a professor. I hate to say that, because criticizing paul martin kind of feels like kicking a puppy. He's just that nice of a guy.\nHowever, the course (promoted as a solid research introduction for grad students returning to school after years in the professional realm) was messy, erratic, and confusing. Some students were about to graduate and were just in the class to get feedback and discussion on their almost-completed theses. Good for them - I think they got a few credits and an easy A for showing up and workshopping their research. I do not, however, envy them for spending good money to gain almost nothing from a class, and mostly receive haphazard and often contradictory advice from Martin and the class.\nAs one of the students in the course as a survey of human rights graduate research (again, it was actually billed this way) I was disappointed to find that you cannot do the course unless you know what your thesis topic will be. If anyone tells you otherwise, they are lying to you. It's tempting to believe that \"even students unsure of their thesis topic on day one will get excellent guidance toward penning a thesis proposal by the end of the semester.\" I fell for it myself, and then didn't drop the class because I was naive. Don't make my mistake. The guidance and advice that you get based on your general interests and abilities will not lead you closer to a thesis topic. It'll just confuse the hell out of you because the \"assignment\" and advice from last week's class will be forgotten by the time you return with hours of research under your belt. When you present what you've done on Martin's advice, I guarantee you he will decide that wasn't actually the best idea and you should pursue something only tangentially related, just to return next week again to repeat the process. I got an A, but I'm still fuming over the rambling, aimless, confusing, and imprecise instruction. If this course is required in your program, see if you can waive it OR wait to take it last, when you've already almost completed a thesis designed with the input of professors who are actually capable of guiding your research questions and methodology.\nFinal verdict: I'm adept enough at wasting my own time. I really didn't need to pay GSAS to do it for me.\nWorkload:\nSome journal articles in the beginning to demonstrate structure of inquiry. You don't really need to read them unless you're assigned to present one.\nStudents sign up on rotating basis to present progress so far on thesis proposal. If you already have one completed and are asking for advice on tiny tweaks, it's easy. If you don't already have your topic in the bag, god help you in tapdancing around that mess.\nFinal: depends (because nothing in this class was straightforward), but most people were expected to submit a research proposal around 20 pages. Little clarity in parameters of assignment made it difficult, but the actual work didn't need to be that amazing, so again, it's an easy A if you already know what you're doing before the course begins, and a shit circus if you don't.\n"
        },
        {
            "course_name": "Human Rights in Sub-Saharan Africa",
            "review_date": "December 20, 2011",
            "review_content": "\nI like Professor Martin as a person, and I really liked him in Human Rights in Theory and Practice last semester. this class however was just a mess. It had so much potential to be awesome, but we never really discussed anything and the whole class period was spent listening to two to three of your classmates regurgitate the readings. I was so psyched for this course at the beginning of the semester so when it turned into such an epic fail it was disappointing. Avoid this class if you can and get Martin for Theory and Practice instead.\nWorkload:\nOne presentation of the readings, done with a group. You basically regurgitate the readings, it is not very difficult. \nOne 15-20 page paper (10-15 in the syllabus, he changed his mind a few weeks before it was due) on the topic of your choice, as long as it relates in some way to the course.\nOne 10/15 minute informal presentation on the paper\n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "May 24, 2011",
            "review_content": "\nThis is not the type of course you should just jump into without consideration. Firstly, if you do not know much about Human Rights, you will inevitably end up doing a lot of research on the side about major human rights crises, the UN, and current HR happenings in general. Particularly around the midterm and final, this course becomes very time-consuming because of this. Secondly, it can become a bit overwhelming (and thus, depressing) because the course covers many aspects of human rights: everything from conflict resolution/peace-building to maternal health to the structure of the UN. I find it to be very important that students are educated about human rights issues and what our world faces, but the course sometimes seemed to be without a concrete focus and we never knew what we would (or sometimes, would not) get out of each class. In other words, it was unpredictable, so if you are looking to learn something concrete or specific about HR, you should probably go into this course with much more of an open mind. Finally, as other reviewers have suggested, Professor Martin is very committed to providing students with opportunites for interships and networking. I really, really appreciated this, but it does take up large chunks of some class times. Also, if you plan to meet with him outside of class, he wants to know you as a person and will end up discussing career and internship options more than the actual course material, so be prepared for that. For more HR- specific questions, go to the TA. \nI read the CULPA review before taking this course and almost didn't take it. In retrospect, I'm still not sure it was the best idea. I ended up learning quite a bit, but still feel overwhelmed by the world of human rights. I have actually seen people from this class shedding tears about the midterm and final multiple times, so like I said, just be sure you know what you're getting into when you choose this course. Professor Martin is an amazing person, but perhaps not the best professor for this intro level course. Just be sure you really want to be there, and if you're unsure, I'd recommend taking this course as Pass/D/Fail.    \nWorkload:\n2 Papers (which require research), a midterm, and a monster of a final. 2 books to read and several articles, but these can be skimmed depending on your prior knowledge of human rights. \n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "April 03, 2011",
            "review_content": "\nI love this class, and I love Professor Martin. Provided, I'm a human rights major but that is in large part because of this class. I find him engaging to listen to, and he brings in guest speakers. I think his emphasis on the practical is really important since human rights can be a depressing topic. I appreciate that he is trying to teach us HOW to fix these problems, and not just telling us that they exist. \nWorkload:\n2 short papers (3 pages), a midterm and a final.\n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "May 23, 2009",
            "review_content": "\nBefore you go on to read this scathing review and assume that the person who wrote it is probably just mad she got a bad grade, know that I got an A in this class. That said, this was the worst class I have so far taken at Barnard. The readings were massive, often totally repetitive (I found myself one day taking notes on a reading that I realized we had already done), and usually were left undiscussed in lectures. Lectures themselves were almost half the time taught by \"guest speakers,\" which is a cool idea in THEORY but not so much in PRACTICE, as they were often redundant, the speakers having no clue as to what we had covered, and even less of a clue as to what we were reading at the time. Every now and then we would get a particularly experienced or engaging one and that was gratifying, but too rarely.  In terms of Professor Martin, I was very disappointed. The aim of the class was far too ambitious in my opinion: he wanted to give a broad and general view of human rights in theory and practice, but the reality was that the class wound up being all over the place, erratically honing in on random specific events, bureaucratic proceedings, and careers, and at other times trying to cover wide, abstract notions of philosophy and history. As a lecturer I found him boring and repetitive. My sense was that his TA did all the grading, the writing of questions for essays as well as for the midterm and final, and that was a whole other disaster in and of itself. Though the TA was nice and well meaning she gave us essay prompts like: \"Where do human rights come from?\" and then scolded us as a class of a hundred when EVERYONE got a bad grade because, according to her, people \"misunderstood\" the prompt. Our second paper was no better, asking the question \"Can international law work well enough?\" WELL ENOUGH FOR WHAT?? People did better on that essay... for some reason. Our midterm questions, though we thankfully got them ahead of time, were also poorly-phrased, erratic, and repetitive in content, and due to the fact that most people got 95% or higher on the midterm, Martin instructed the TA that she was not to give us the questions for the final. \nBy the way: I AM APPALLED AT WHAT HE DID FOR THE FINAL. Though the class had minimally covered UN procedures and structure, in the final study meeting that the TA held she told us that pretty much the entirety of the final would be on that. We would be asked questions that would require us to know the most minute details of \"treaty bodies\" (a term I had never before heard), various treaties, a particular NGO of our choice, all the Human Rights organs of the UN, and a variety of other UN tidbits that WE HAD NEVER COVERED IN CLASS. Oddly enough, there was an 100-paged chapter in one of our books that contained most of this material but it WAS NEVER ASSIGNED. I can't even articulate my frustration when the final required me to go two days without sleep doing additional research when I had already done all of the readings and attended all lectures. DO NOT TAKE THIS CLASS. I kicked ass on the final simply because I became a robot for the two days before it  just to spite Martin because I heard he had made it so \"hard\" (more like impossibly unpredictable) because too many people had \"high grades.\" \nconvinced?\nWorkload:\nI don't quite know how to evaluate it: a lot of reading but you can get by with doing hardly any of it because it just reiterates itself, two 4 paged essays, midterm, final. \n"
        },
        {
            "course_name": "Human Rights in Theory and Practice",
            "review_date": "May 04, 2009",
            "review_content": "\nI have mixed feelings about this class, and I'm not sure the 9 am time slot helps much. \nProfessor Martin definitely has a lot of experience in the field, and he wants to teach, but he seems overly career-oriented, always talking about internships and telling guest speakers to tell us how to get internships, etc., which takes away from the class at times. When he lectures, he doesn't really talk as much about the theory aspect of Human Rights as we do the practice, but practice from the practitioner's perspective and not the victims'. Human Rights courses are notoriously hard to teach, though, and so I don't think I can blame him completely. One problem I had with the class, however, was that he left on some Columbia Alumni trip for over 2 weeks, leaving the class in the hands of the TA, who basically runs the class anyway. He could put in a little more effort overall.\nNow, the good part. Every week, Martin lectured one day, and we had a \"practitioner\" the other day. This was an amazing set up for the class, I think. We heard about real life experiences from a variety of sources, from a Turkish lawyer fighting for civil liberties to a Human Rights Watch worker who detailed sexual violence in Cote d'Ivoire. Every speaker was absolutely enlightening. The class was worth it for the chance to hear these people speak alone. \nWorkload:\nmandatory attendance, one 2 page essay, one 4 page essay, midterm, final \n"
        }
    ]
}