{
    "prof_info": [
        {
            "prof_name": "Jennifer Calles Izquierdo",
            "prof_id": 13618,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Arte y Artefactos",
            "review_date": "November 15, 2018",
            "review_content": "\nLet me preface this by saying I loved this class!\nWhether you are taking this class as a Hispanic Studies elective or to better your Spanish-speaking abilities, this class is lovely. Jennifer is the sweetest person. The class is small, and most students are bilingual. I am not a native speaker and I understand and write much better than I can speak. Still, you can tell she truly cares about each of her students because she takes each student's level of proficiency into account when asking for participation and grading our assignments. Every time I have expressed concern about my participation level, she is quick to remind me that she has different expectations for me versus the students who are bilingual, which is really reassuring.\nThat being said, this class is entirely in Spanish. I know my Spanish is improving, but that is because I have put in the effort to try and participate. We are studying art and artists from Latin American countries, and I am in no way an Art buff, yet I have found the class stimulating and interesting. You get more out of the class if you put more in.\nWe don't really get grades, and we haven't done the final project yet, so I don't know numerically how I am doing. When I asked how I am doing in the class, she said that I consistently show up and put in effort so I have nothing to worry about. She also said I got the highest score possible on the midterm project. I truly believe if you put in effort and express interest, you will do well.\nI recommend this class to anyone looking to learn more about Latin American art, major/minor in Hispanic Studies, or become more proficient in Spanish! I think this is a great class and Jennifer makes it so enjoyable. She is a great person/professor and could teach any subject and I would want to learn.\n\nWorkload:\nHomework = ~8 page readings per class (max 12 pages), one time we watched a movie\nMidterm = group project\nFinal = personal project\nNo quizzes/exams!\n"
        }
    ]
}