{
    "prof_info": [
        {
            "prof_name": "Daniel Litt",
            "prof_id": 13285,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IIA, IIIA",
            "review_date": "December 22, 2016",
            "review_content": "\nDaniel Litt is sooooo lit! \nHe is one of the best professors you could ask for. \nNot only does he make class very engaging, for instance with problems maximizing your wealth, but he is also very nice and sweet.If you ever have any problems he is always there to help. \nThe homework was very very hard though but his exams were okay. \nThe midterms were relatively straight forward and the final was much harder. \nDaniel Litt is not only a super nice guy but also a good teacher. \nDisclaimer: His handwriting is sometimes a bit illegible \nWorkload:\n2 midterms \n1 final \nWeekly webassign and written homework \n"
        },
        {
            "course_name": "Calc III",
            "review_date": "December 10, 2016",
            "review_content": "\nWhat a great professor!! He's funny, interesting, and great at explanations and using real-life examples to help students visualize (important in a class like calc 3). He constantly offers extra credit opportunities and it's extraordinarily clear what's necessary to understand and know for the final. He works really hard to learn students names and generally cares about how everyone is doing in the class. He's even on top of responding to emails and questions!! Take Calc 3 with Professor Litt!\nWorkload:\nNormal amount for a calc class. 1 online and 1 written assignment every week, extra credit opportunities, and a midterm and final \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 17, 2016",
            "review_content": "\nThe most legendary calc 3 professor ever. I enjoyed Litt a lot. Took calc 3 freshman fall in 2016. He goes in depth to explain every topic and concept. He imitates 3D/4D graphs using his hands running around. He shows you cool stuff, dishes on Yale(he's from the big crimson). We loved this guy.  \nWorkload:\nOne/two webassigns every week besides exam weeks\none/two written assignments every week besides exam weeks\n2 midterms\n1 final\n\n"
        }
    ]
}