{
    "prof_info": [
        {
            "prof_name": "Jonathan Voris",
            "prof_id": 12767,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Artificial Intelligence",
            "review_date": "December 20, 2013",
            "review_content": "\nAfter reading the rather poor reviews of Professor Stolfo's AI course, I was excited to take the course with his postdoc.  Unfortunately, he failed to meet expectations.\nVoris is a very nice guy, but was disorganized during his lectures.  Also his command of Common Lisp wasn't the greatest, and used code from Stack Overflow in his slides.  Thankfully, he only required Lisp for the first assignment.\nThe assignments were a little much.  I found that I was working on the implementation more than the actual search algorithms.  I spent weeks working on the game implementation for Gomoku and Sokobon, while rushing through the search algorithms hours before the assignments were due.  Also, he provides the easiest test cases possible, while using hard ones to grade.  Most of my assignments assignments passed all of the test cases, but I ended up doing poorly on them because the test cases used for grading were not even remotely as easy as the examples he provided.\nThe reviews from Stolfo's class mostly say that he skims over everything interesting in AI.  Voris wasn't much different, and we actually covered less material than Stolfo usually does.  We didn't even get to machine learning, and our last assignment was on logic, entailment via forward and backward chaining (which I thought was an extremely boring project that again, takes more time to write the implementation than the search algorithms).\nThe midterm was fair, but the final was rough.  Voris said that chapters 1-9 would be on the final, yet he ended up testing us on topics mostly before the midterm.  We did not receive any sample questions or past exams, and were unsure of what to expect on the exams.  I though the final was way to long, and Voris said he had planned to make it even longer.\nWe used Piazza as our forum for discussion and questions outside of class.  To be fair, some students did ask questions that could have been easily answered from a quick google search.  But that doesn't mean the instructor should respond to them in a sarcastic and demeaning way.  Some of Voris' answers to Piazza questions were very defensive and sarcastic, including \"Uhh, you can run Eclipse on the clic lab machines?\" or \"I only posted the text file with puzzles because people complained I didn't post any examples\" and \"Guys, I've already made it rather clear that all of the material in the book chapters that we've covered is fair game.\"  He also would write something like \"please see me in office hours if this is unclear\" rather than post a response.\nBasically all the course material (lecture slides, etc.) was given to him by Stolfo.  There were mistakes in the slides, and he usually correctly them quickly.  Although I did hear him arguing with a student about ambiguity in a final exam question and Voris' response was something like \"[Stolfo] has been using these slides for 20 years and I don't think he had this much trouble with grade arguments.\"\nOverall, I guess Voris was a better choice than Stolfo, but if you aren't required to take this class, I suggest avoiding it like the plague.  At least Voris made the tournament extra credit, and all who participated earned at least 5 extra credit points, even if they lost in the first round.\nWorkload:\nFour assignments: Pattern Matcher in Common Lisp, Sokoban Search Algorithm, Battle of the Gomoku Agents (and tournament), and Inference Algorithms (entailment with forward and backward chaining).\nMidterm - fair.\nFinal - too long.\nTwo pop quizzes.\n"
        }
    ]
}