{
    "prof_info": [
        {
            "prof_name": "Lawrence Venuti",
            "prof_id": 11563,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Workshop in Translation",
            "review_date": "April 24, 2012",
            "review_content": "\nTerrible professor.  This is what I just submitted to Barnard's online course evaluation system:\nWhat did you value most about your instructor's teaching methods? \nNothing.  Professor Venuti is an atrocious teacher without any professional courtesy or respect for his students.  I started the semester doing poorly due to personal concerns unrelated to class.  Professor Venuti and I had a conference in which he brought these shortcomings, and I promised to correct them.  In the class immediately after our meeting, however, he saw it fit to throw a pile of papers at me in front of the class.  Subsequently, he showed up a half hour late to two scheduled meetings without any form of apology.  In addition to accusing me of being anti-intellectual and evasive, he did not read one of my translation projects (as evidenced by certain comments on the paper), but saw fit to sharply criticize it in his comments.  I felt that he created a hostile environment, and I never wanted to come to class or see him.  My heart rate jumps whenever I am forced to see him for class because I feel I am on the defensive in his presence.  His class was a miserable learning experience, and I regret registering.\nWhat improvements in the instructor's teaching would you recommend? \nProfessor Venuti's criticism should make at least a minor attempt to improve the students' abilities as translators.  As it is, I derived very little benefit from his criticism, which seemed primarily intended to tear me down as a translator and as a student rather than to point out shortcomings and address them.  In email communication, Professor Venuti should refrain from writing in ways that can easily be construed as mocking.  In class, Professor Venuti should not throw papers at students.  When scheduling a meeting with a student, Professor Venuti should show up on time or communicate with the student, and perhaps consider apologizing in the event that he does show up late.  In short, Professor Venuti's effectiveness as a teacher would greatly benefit from an understanding of basic professionalism and common courtesy, two features that are utterly lacking in his behavior this semester.\nWhy did you take this course?\nI mistakenly believed that Professor Venuti would offer constructive criticism and effective instruction on topics relating to translation and its theoretical underpinnings.\nWhat did you value most about this course? In what ways did the course meet your expectations? Explain why you would or would not recommend this course.\nThe readings were overall interesting, stimulating, and useful.  Translation is difficult, and applying the theoretical frameworks of the class was a major challenge.  Professor Venuti's absolute lack of ability to help students make this connection and his rude, disrespectful, and unprofessional behaviors towards me personally mean that I cannot recommend his class to anybody in good conscience.\nWhat improvements would you like to see in the organization and content of this course? \nA lack of Professor Venuti.\nHow much effort did you put into this course versus comparable courses? Did the course inspire you to put in extra time and effort, over and beyond what was required?\nInitially, as Professor Venuti's criticism began to mount, I put more effort into the class, thinking that his criticisms were designed to help me succeed.  After realizing that no constructive criticism would be forthcoming, I put in an amount of effort I judged to be sufficient and began ignoring everything that the professor said or wrote.\nWorkload:\nReasonable, but don't expect to hear a single piece of constructive feedback from the professor.  Don't expect him to teach anything useful to you as an inexperienced translator.\n"
        }
    ]
}