{
    "prof_info": [
        {
            "prof_name": "Gerrit Jackson",
            "prof_id": 1516,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 02, 2009",
            "review_content": "\nGerrit has been my favorite teacher at Columbia thus far, and he's not even a professor. He's a member of the German department, but has far more to offer than that. Yes, he added things that he found interesting to the standard syllabus (i.e. Goethe), but his insight into all of the texts were fantastic. Plus, he took the time to read each of them with us, so you didn't feel as bad that you had to read 150-200 pages before class (not that that was the usual assignment). Often, he read them both in English and in the original language!\nI'm writing this review a year after I took his class, which means that it has stuck with me. I learned a great deal from the class, because Gerrit was sure to provide you with a history of each of the authors/texts at the beginning of each class and because we delved into each text.\nOthers have commented that he ignored those with whom he disagreed. I find that to be untrue. He did actually tell you if he thought you were wrong, but I found that refreshing. However, he would try to steer you in the right direction or if you could back up your opinions he would discuss its weight with you. \nWorkload:\nHe actually expects you to try to read before class, but will ask \"Who actually read? Because I was only able to get through.... (insert number of pages)\" if he thinks that his assignment may have been too much. \nUsual course assignments, plus two additional readings. Three papers. Midterm. Final. The midterm and final are in-class essay assignments, plus IDs. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 11, 2009",
            "review_content": "\ngerrit is a fantastic lit hum teacher. he will really challenge you to understand the texts and bring tons of insight, background knowledge, and really good analysis to class. he re-shapes the way you read and helps you understand fiction in a whole new, deep way. he honestly changed the way i read for the better and helped me become a better writer and critical thinker. he is a great instructor and you are really lucky if you get him.\nhe also lets students take turns bringing snacks for the class which is fun, and in the spring when it got warm we had class on the lawn outside. he is amazing!\nWorkload:\naverage for lit hum class\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 01, 2008",
            "review_content": "\nHe may be a good teacher for German. It isn't that hard to mess up as a language teacher. However, as a Lit Hum teacher, he is possibly the worst teacher you can get. He does not know what he is talking about most of the time, walks around as if he has a stick stuck up his ***, and pompously touts his own opinion as the ultimatum that everyone should aspire to. He has a one-track mind and that is counterproductive for a class of this type. If he likes you, you will do well, if he doesn't, prepare for the worst. Also, don't bother doing the reading since he himself has not done the reading most of the time. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2008",
            "review_content": "\nAs with any teacher, Gerrit has his pros and cons. Gerrit is from Germany, but frankly I think his English is better than mine. That just gives the kind of intelligence this man has. Gerrit is very insightful when it comes to the text. He has a habit of directing you to a particular passage in the text and making a point that you think about long after the seminar. On the other hand, if you have a point that he doesn't agree with, he'll let you know by ignoring you. Papers must cater to his particular way of thinking (everything, EVERYTHING, is symbolism). His class is very laissez-faire, and he won't force you to say anything if you don't want to, which can be a good thing or a bad thing. So final judgment? Well, he's the only Lit Hum teacher I've ever had, so comparisons are impossible, but I would say that you could be much worse off.\nWorkload:\nThe standard 12 pages or so of papers. Push him to assign papers early, as you DO NOT want to be doing an 8-page paper due the last day of reading week (as we did); he tends to procrastinate with those. Midterm is same format as Final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 17, 2008",
            "review_content": "\nGerrit is very knowledgeable and is always reading the texts in the original language and writing random words on the board in a different language. That being said. He's pretentious and if you have a different opinion on the book, he'll shut you down. Half of the time he lectures which is fine because no one has anything to add to the conversation but it can be hard to follow along and figure out what point he is trying to make. He's a very hard grader and everything says the powers above made him gives us more papers to write and why he was only going to give out one or two A's. If you're an excellent writer and class participant than go for it, but it's not worth it to be in that class and work yourself into a frenzy and be told that you can't have an A because he's not allowed to give those out.\nWorkload:\nSame as every lit hum with extra reading. He's really into poetry. 3 papers (2 are 5 pagers and 1 8 pager). Midterm setup like final. Final.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "May 13, 2005",
            "review_content": "\nGerrit is a good guy.  He tries to keep class interesting and does a pretty decent job of it.  He is fairly funny and easy going.  I always felt bad if I  had to turn something in late, but he was always fine with it, at least to a certain extent.  I would recommend him, although I have yet to have a bad teacher in the german department.\n"
        },
        {
            "course_name": "Intermediate 1",
            "review_date": "January 28, 2005",
            "review_content": "\n Gerrit doesn't put a lot of pressure on his students, but it's easy to see that he's very engaged in teaching and tries to approach his students as individuals.  Expect him to be fairly critical of your essays, but not more so than most TAs.  If you actually keep up with the homework (which doesn't take all that much time) and attend class more often than not, you'll do fine.  I don't know of anyone who got less than a \"B\" . That's nice for a four credit course.    He's not a real stickler for attendence, but his little performances make most students smile.  So, dragging yourself to language class isn't the bore it so often can be. \n  Gerrit's true advantage as an instructor is his flawless but deep understanding of both German and English.  You won't find that degree of quality in a language instructor every day.   My only complaint is that I can't take fourth semester with him, because he's teaching third semester again.  That means I miss out on one final semester of his warm and wonderful tutelage. \n  Einfach wunderbar!!! (Ach, das Gerritchen! Mein Herz!)\nWorkload:\nRegular assignments are graded thoroughly.  But what's really important is that you make the effort to imporve your German relative to your individual knowledge (just build on what you came into the class with). \n"
        },
        {
            "course_name": "Intermediate German I",
            "review_date": "January 18, 2005",
            "review_content": "\nGerrit has gotten only good reviews here, and they are all deserved. He is my favorite german teacher to date and it was by far the best class I had last semester.  He is (as everyone else has noted) witty and charming and phenomenally intelligent which in my opinion made up for the occasional disorganization of the class. He is a dynamic teacher and brought in a wide variety  of subjects to make us think in german, not just regurgitate vocab words or canned lessons. There was not a single grammar or linguistic question he was phased by, and his english is flawless.  Plus he's good looking. Let's be honest, Gerrit is perfect.\n\nWorkload:\ndaily assignments which we discussed in class, two essays (250 words each)  and vocab lists...not a big deal and though he is a tough grader effort and participation count for a lot. \n"
        },
        {
            "course_name": "Intermediate German",
            "review_date": "December 29, 2004",
            "review_content": "\nGerrit ist fantastisch, and you've hit quite a jackpot of a spontaneous, flexible, compassionate, intelligent, and fun class should he be your instructor. A native speaker from Bavaria, Gerrit won't let the immersion atmosphere of the class slack too much, and your German will have to be quite up to par to keep pace with his occasional in-jokes. You'll have a good enough time anyway to forget that he may be a bit disorganised and fall behind schedule quite a bit at times, forcing you to complete several projects at the end of the semester- nothing too demanding, though. Overall, if you have any genuine interest in learning and speaking German well, discussing German history and German politics, or simply joking around irreverently in a foreign tongue, Gerrit will delight you.\nWorkload:\nTwo surprisingly difficult vocab quizzes, two long vocab lists, two creative essays, two presentations in front of the class, one group project (at the end of the semester, a bit rushed) on something concerning current German events, a portfolio of the semester's work and scattered grammar and vocab exercises for each class- in short, the standard litany of language class work.\n"
        },
        {
            "course_name": "Intermediate German II",
            "review_date": "November 14, 2004",
            "review_content": "\nGerrit is amazing!  He is funny, brilliant, empathetic - everything you'd want in a teacher.  He has standards, but if you are late once in a while or have to hand in a late homework, he doesn't make you feel like you're evil.  His class is simply enjoyable and one in which I learned a lot.\nOn a personal note, Gerrit is adorable.  I have a ridiculous crush on him - his wit, sense of humor  are more than I can stand.  Definitely an added bonus!\nWorkload:\nVery reasonable - a little something due each class to keep you practicing, but never more than you can handle.  Also, personal vocab lists every few weeks (3 or 4 in total) as well as a couple of essays.  Vocab quizes every few weeks (you do have to study for those - while they aren't hard, they are not as simple as vocab tests could be).  No midterm.  Oral Final.\n"
        },
        {
            "course_name": "Intermediate German II",
            "review_date": "November 14, 2004",
            "review_content": "\nGerrit is amazing!  He is funny, brilliant, empathetic - everything you'd want in a teacher.  He has standards, but if you are late once in a while or have to hand in a late homework, he doesn't make you feel like you're evil.  His class is simply enjoyable and one in which I learned a lot.\nOn a personal note, Gerrit is adorable.  I have a ridiculous crush on him - his wit, sense of humor  are more than I can stand.  Definitely an added bonus!\nWorkload:\nVery reasonable - a little something due each class to keep you practicing, but never more than you can handle.  Also, personal vocab lists every few weeks (3 or 4 in total) as well as a couple of essays.  Vocab quizes every few weeks (you do have to study for those - while they aren't hard, they are not as simple as vocab tests could be).  No midterm.  Oral Final.\n"
        },
        {
            "course_name": "Elementary German I and II",
            "review_date": "March 05, 2003",
            "review_content": "\nEasily the best instructor I've had in any class this year. He's a native German speaker, but knows English better than most of his students, and always makes sure he explains things as comprehensively as he can. He understands English and German very well, and knows how to teach German, at least to us beginners. And as an added bonus, he makes the class increadibly enjoyable, peppering his lessons with  both witty, impromptu jokes as well as some crazier antics. You can tell he's having fun teaching, but he still approaches his class with a remarkable level of professionalism for a grad student. It's worth taking his section, even if it entails the dreaded Friday class. If you see him as an instructor, sign up for his section, and work the rest of your schedule around his class.\nWorkload:\nNightly homework, which is not very hard and is occasionally collected. Chapter test once every two weeks and a final-no midterm. Occassional essays, which are graded fairly toughly. You might be having fun, but you still have to work.\n"
        },
        {
            "course_name": "Elementary German",
            "review_date": "February 24, 2003",
            "review_content": "\nI learned alot in this course.  The instructor has alot of creative energy, and makes every effort to make the course fun (although his antics can be distracting at times).  Overall, I would recommend this section.  \nWorkload:\nDaily, but in small doses.  A goodcourse for those who like to put in a little time each day on a subject.\n"
        }
    ]
}