{
    "prof_info": [
        {
            "prof_name": "Yi Zhang",
            "prof_id": 13844,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Foundations of Data Science",
            "review_date": "April 19, 2021",
            "review_content": "\nYi Zhang is an excellent professor! \nLoved this course, well taught and all assignments were fairly graded and he was never shy about giving extensions and we already had late days. After this course, I found myself super interested in data science as a future career :) \nWorkload:\n- 8 hws (every 2 weeks-ish, but some weekly)\n- midterm and final (open book during pandemic semester)\n"
        },
        {
            "course_name": " Simulation modeling and analysis",
            "review_date": "April 14, 2020",
            "review_content": "\nYi is such a caring professor. During COVID he is always accommodating and he tries to make online lectures engaging. He even had office hours until midnight to accommodate students in different time zone. His lectures are always clear as well, and he repeats the key concepts to make sure everyone understands. Also he loves Pokemon and sometimes adds Pokemon memes in class. Super cute.\nSimulation has 8 assignments. We have 1-2 weeks to work on each. They are all programming based and in Python. The assignments at the beginning are not too hard, but the later ones can take substantial time, so make sure to start them early. If you have had some experience with Python before, I would say each assignment takes about 2 hours at the beginning, and progresses to 5-6 hours later.\nI really enjoyed the class overall. Yi encourages participation a lot, and I think if you are paying attention in class it is not hard to do well. Exams are open notes. The content feels pretty applicable and we try to simulate real world systems towards the end of the course. I would say this is one of the best classes I have taken at Columbia!\nWorkload:\n8 Assignments, 2 Open Book Exams (1 midterm, 1 final)\nFirst couple assignments around 2 hours\nLater ones can take 5-6 hours, maybe longer if not familiar with programming\nGrade breakdown:\nHomework (35%), Class Participation (5%), Midterm (20%), Final (40%)\n"
        }
    ]
}