{
    "prof_info": [
        {
            "prof_name": "Rohit Patra",
            "prof_id": 12683,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 13, 2014",
            "review_content": "\n   I have a mitigated opinion about Rohit. Obviously, Rohit is a begginer as a teacher: he would sometimes make mistakes and does not seem to recognize if the class is lost.\nHowever, if one listens during the class, he manages to explain the main concepts in a straightforward way. He is going very fast sometimes, so reviewing the book is useful. \n   Rohit was really doing his best to make sure students would understand the main concepts: he was always ready to answer questions, and to repeat his explanations as many times as possible when people asked.\n    Grading was really fair: he would always give points for trying, even if the solution is completely wring;\n\nWorkload:\nWorkload:\n- 8 problem sets\n- 5 quizzes\n- One easy midterm\n- Final\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "December 12, 2013",
            "review_content": "\nRohit Patra is, in my opinion, absolutely unprepared to be leading an introductory statistics class. While he definitely knows his statistics, his ability to effectively introduce and expand upon basic statistical concepts was almost nonexistent. In most of his lectures, he would just put up some formula without actually saying what it does in terms of statistics and jump into explaining its esoteric properties. His teaching is, at times, impossible to follow for someone who hasn't taken a stats class before (theoretically everyone, as this class is 1000-level). He made countless mistakes while lecturing, some of which would render an entire example useless. His writing was nearly illegible, he moved at a pace too quick for much of the class, and his attempts to encourage questions/improve his lecturing always fell flat on their heads. Case and point: after going on a 10 minute tangent about some concept, he would often ask the class \"any questions?\" to which someone almost always replied \"can you repeat everything you just said?\"\nThe textbook (Devore) helps a little bit, but I learned most of the Stats that I needed for the problem sets/exams from Google and Chegg\nWorkload:\n8 Problem Sets almost entirely made up of textbook questions\n1 midterm that was ok\nFinal\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "September 19, 2013",
            "review_content": "\nAs a new student at Columbia, I have to say that I am disappointed at the professor's quality. Having taken college classes before (I'm a transfer student), I must say that this professor is the worst I've ever had. Terrible lectures, makes little to no sense, and his accent makes it even hard to understand. He goes through the chapters at lightning speed, yet it seems that nobody is understanding what he is saying. All in all, I would say reading the textbooks makes more sense to me. Often, I would walk out of lecture thinking that I knew less than when I started. Absolutely terrible. \nHonestly, if you take this class, I recommend just going online and watch youtube videos. \nWorkload:\nTime consuming problem set every 2 weeks, and a quiz in the weeks with no problem set. Midterm, and Final\n"
        }
    ]
}