{
    "prof_info": [
        {
            "prof_name": "Justin Snider",
            "prof_id": 3505,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "university writing",
            "review_date": "December 22, 2016",
            "review_content": "\nIf you can take Justin's class, definitely take it!\nHis classes were so interesting, as were the topics assigned for the essays. \nThe workload wasn't too bad and the readings were very very interesting as were the short writing assignments.\nI always looked forward to this class, as it was so fun!\nJustin is an incredibly nice, smart and humorous professor who will try to engage the entire class in discussions. \nDefinitely take U Writing with him if you can.\nWorkload:\nConversation Essay\nResearch Essay\n Op- Ed \nCritical Essay \nWeekly readings \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 14, 2016",
            "review_content": "\nProbably one of the kindest and most pleasant professors at Columbia. Grades fairly - not very strict, not very lenient. The readings are interesting and he has useful insights to offer on almost every topic. Would totally recommend this class.   \nWorkload:\nAverage UW workload - 4 essays\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 20, 2014",
            "review_content": "\nFOLKS!! The review downstairs is a lie! I worked my tail off, and I got an A-. However, I am so happy with what I got because with Professor Justin Snider's unflagging help, I have learned how to think from a different perspective, and I have successfully utilized his techniques with my other writing-related subjects.\nI know people before me said this thousands of times, but I have to repeat it. Justin is so far one of the most capable, experienced, and responsible writing teachers I have ever met. At the same time, he is also the most understanding, caring and intelligent individuals. That's not to say he is an easy grader. He is not! Also, You should not expect mere lecturing in a UW class. This is not an ESL class or a political science class.\nIn class, Justin skillfully maintains interactions between everyone involved. He respects students' cultures, knowledge, and interests. He sincerely values his students' opinions and provides everybody opportunities to express their own thoughts.If you put a reasonable amount of effort into the drafts, and truly aim at improving your writing, you just need to call on him. He will always be there for you although he is extremely busy with his 350 advisees. Trust me on this!! He attaches importance to how seriously you take this class.\nHis feedback on each of our drafts is elaborate, encouraging us to think critically and cultivate a habit of answering unanticipated questions! Most of the time, he gives back our essay on time (if he does not, he brings us expensive chocolate as an apology.) During class interactions, not only did he correct our improper English expressions, but he also guided us to think outside the box. Most importantly, he helps his students become independent learners and who love writing.\nAs an ESL learner, I have always had an inferiority complex when it comes to writing. After this class, I became a lot more confident in writing than I was before. And as a former UW student who has observed tons of UW instructors, I have to say this: We do not need a loquacious teacher or orotund entertainer in the UW class.(But, folks!! Justin has a great sense of humor. You will fall in love with him!!) We need an instructor who is truly willing to invest his time in our drafts and in our writing (or other things you want to discuss) after classes. Please seize the opportunity. TAKE HIS CLASS IF YOU CAN!! There are not many UW professors who got a Gold nugget! He got it for a reason!!\nMy last word: Doing a little in this class will not earn you an A. Professor Snider likes to see your improvement and your process of learning (the process of revising, pushing your thinking to more refined levels...).Also, writing your drafts two days before the due date will not likely get you an A. As Justin always told me, spread your draft over several days, everyday, a little bit. And you will write a good essay in no time.\nWorkload:\nTypical UW workload. The first reading is the hardest one. But, always communicate with him and express your difficulties.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 15, 2014",
            "review_content": "\nEasy class, very easy A, but you won't learn a thing. He is a great guy indeed, but a really bad teacher. He did not lecture once, and honestly going to his class was a joke. I got an A and did very little, not complaining. All we did was to \"discuss\" the material. He is very lazy, he will take forever to return your work and you will have to start working on your new material before you get your previous one, so you won't know what to improve. You don't pay Columbia 50k a year to go to class and talk to your peers, you can do that outside class and for free. If you only care about your GPA then this class is for you, but if you actually care about learning stay away from this class. \nWorkload:\n4 papers, very simple. I wrote them two days before the first draft was due, he revised them, I fixed them, got an A.......whalaaa........\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 12, 2010",
            "review_content": "\nProfessor Snider is an excellent teacher! He inspires and guides his students beautifully. He cares deeply about each student, and is as supportive, understanding, sensitive, and kind as can be! Every single one of his classes is deeply enjoyable and exciting!! I recommend him to everyone! I was very lucky to have him as my professor in my first semester at Columbia University. I feel very blessed! He is a true teacher. He teaches with his heart and a deep wisdom. He shares his enthusiasm, curiosity, and love of the subject freely with his students. His youthfulness and sense of fun and irony and his very sharp wit all add to the atmosphere and make it such a pleasure to be in his class. I look so forward to each class! Professor Snider is so easy to approach and very down-to-earth. He's brilliant, but doesn't show it off at all; he's actually quite humble. I like how his classes are conversational, and how he really appreciates the students' input and participation, yet doesn't put pressure on those who don't often speak. It's easy to tell that he really cares about how we feel and what we think and our progress in the class and in life.He really looks out for his students and is always concerned with our comfort and that no one is left behind or confused. And he is philosophical, so it feels like the class is relevant in the \"real world.\" He has a lot of integrity, a strong sense of justice and fairness, and is a righteous person without the judgmental attitude that often accompanies these traits. He really has the spirit and heart of a true teacher. He wants to share and to guide and to support, and he does it so well! The most I can say is that he is absolutely GREAT!!!     \n\nWorkload:\nThe workload is very reasonable and the readings are inspiring and informative and add to the richness of class discussions. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 16, 2009",
            "review_content": "\nHonestly, thinking about Justin makes me want to cry, because he is just THAT amazing. This is not in the least bit an overstatement. I'm being completely honest in that I will die of happiness if I ever can get him for any class again. The day he stops teaching will be the day the world ends. I had him last semester for UW, and man... it was a highlight of my freshman year. you come to columbia thinking, psch how good can these professors be anyway? go to one of Justin's classes and you'll find yourself grinning like a maniac throughout the whole thing, because it just can't possibly get any better than this. true me on this. this is coming from someone who isn't that easy to impress. if I didn't have an exam tomorrow, I can rant about this guy here all night. didnt want to review before this point, because he's just too amazing that i knew I wouldn't be able to stop once i started. i'm not done ranting about justin, so look out for another review soon. he's just awesome\nWorkload:\nvery lax about deadlines. ends up extending the deadlines he gives at the beginning of the year. he doesn't really approve of the end of the year rewrite one paper thing for UW, but he's makes exceptions if you just really want to improve a certain essayHere's a professor who sincerely wants you get better at writing, sincerely wants to have fun in his class, sincerely wants you to do well, and truly truly cares about each and every one of his students.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 12, 2009",
            "review_content": "\nJustin Snider, is by far the best professor/teacher I have ever had. He genuinely cares about you as a person and a writer. His classes are discussion based, but enjoyable whether you participate or not. He will work with you on your drafts until your paper is an A.\nIf you get him, you are incredibly lucky. \nWorkload:\nAverage for UW\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 11, 2009",
            "review_content": "\nJustin Snider is by far one of the best professors I have had. Like the previous review, he is very understanding of the workload of other classes and really works with you so that you do not feel overwhelmed with the assignments. He really works with you to improve your writing skills. His feedback is great! He is also very willing to meet outside of class to discuss your work. The class atmosphere was AWESOME- I genuinely enjoyed going to class (even if it was a 9:10!). Class discussions were engaging and insightful. He really made you think. You are SO LUCKY if you get this guy....really. \nWorkload:\nTypical UW workload. 4 graded essays and many short assignments. Reading is a bit heavy but very necessary and interresting for the most part. Reasonable grader.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 25, 2008",
            "review_content": "\nGreat professor! Understanding of the workload of students, relatively lenient with deadlines. He made UW a great class. Provides excellent feedback on papers and really coaches students throughout the writing process. If you can, get this professor!\nWorkload:\nSame as every other UW class - a significant amount but not overwhelming at all\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 25, 2008",
            "review_content": "\nGreat professor! Understanding of the workload of students, relatively lenient with deadlines. He made UW a great class. Provides excellent feedback on papers and really coaches students throughout the writing process. If you can, get this professor!\nWorkload:\nSame as every other UW class - a significant amount but not overwhelming at all\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 11, 2008",
            "review_content": "\nJustin was an incredible professor! He made UW easily my favorite class 1st semester. He's a knowledgeable, excellent writer who provides great feedback. He brings extra readings to class which are always interesting and enhancing to the topic at hand. The workshopping that he has us do generates a lot of discussion and helps us to either develop our ideas or create new ideas. Either way, class is generally quite fun. He is also understanding of our workload and often extends deadlines to ease our stress. He's a great teacher and I highly recommend him to all!\nWorkload:\nModerate. No more than your average UW class. 4 papers w/ approx. 3 weeks/paper. Extendable deadlines. In class workshopping/writing. Mandatory conferences outside of class do require more time but are infinitely useful.\n"
        }
    ]
}