{
    "prof_info": [
        {
            "prof_name": "Ann Marie Murphy",
            "prof_id": 1334,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "International Politics of Southeast Asia",
            "review_date": "August 10, 2004",
            "review_content": "\nProfessor Murphy is probably the most helpful instructor I've had at Columbia. She was always available to assist with research for the final paper, which was a 20+ page research paper on the topic of your choice. It was great to see a Columbia professor that cared to much about her students. The class itself was interesting because Professor Murphy mixed lecture in with group discussion, which made for a balanced approach. Her notes were always clear and concise and helped with the midterm topics. Allowing freedom on the final paper and then assisting with it made it a great learning experience. \nWorkload:\ntons of reading (most of which is interesting), a few writing assignments based on the readings, written midterm and final done outside of class\n"
        },
        {
            "course_name": "Colloquium: The Political Economy of Development in East Asia",
            "review_date": "January 14, 2004",
            "review_content": "\nProf. Murphy is very intelligent, well-traveled, and once you get to know her she's really very nice.  However, the class is colloquium but is really in lecture format.  That means two full hours of political economy lectures with interruptions only for her to quiz you on the material.  Because I am actually very interested in the material, I enjoyed the class.  It covers a great deal of valuable information and I learned a lot.  However, if you do not have economics background and your own firm opinions, go into this class realizing that she's going to present her own views and push them rather heavily.  She makes a half-hearted attempt to present views more liberal than her own and if you are even slightly left of center, you may have a very, very hard time taking this class.  In all honesty, Prof Murphy would rather be teaching at SIPA and sometimes it really comes across.  She doesn't really give students enough credit to have intelligent views of their own and will therefore basically tell you what your final topic should be.  I also have to say that I also felt that her grading was very subjective and rather unfair.  Also, alert to those who think this is going to include China!  This class does not cover China AT ALL, which was pretty dissapointing.  It also ends after the Asian Financial Crisis so current issues aren't really discussed.  All in all, take this class if you really want to learn the material but consider yourself forewarned.\nWorkload:\nThree short papers and one colloquium length paper (25 pgs.) Hard only because of subjective grading.\n"
        },
        {
            "course_name": "Colloquium: Political Development of East Asia and the Pacific",
            "review_date": "December 11, 2002",
            "review_content": "\nShe is an excellent professor. She actually works over at SIPA and extremely up to date on just about every country in asia. I don't think that she teaches many semesters, but when she does, you'd better take her!!!\nWorkload:\njust right\n"
        }
    ]
}