{
    "prof_info": [
        {
            "prof_name": "Patrick Armacost",
            "prof_id": 2233,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Drawing",
            "review_date": "December 15, 2006",
            "review_content": "\nI don't know what class with Armacost was like a year ago, but I think the other reviews are too hard on him. Patrick is very laid-back, yes, but he's also talented, energetic, and hilariously funny. He inspired a great rapport in our class, leading us all in discussions of what the term \"synesthesia\" meant and picking out esoteric nicknames for everyone (e.g. \"Speech Unit\"). His assignments were open-ended, but if you asked him for help, he was always ready to offer it. If you take an especially competitive, intense, or academic approach to drawing, you might not like Armacost. But then again, if you do all that, why are you taking Basic Drawing? He's lots of fun. The class was a great break for me.\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "September 09, 2006",
            "review_content": "\nIt's true that Patrick Armacost seems like a nice enough guy, but it's also true that he is not well suited to teach a drawing class.  For one, he had trouble remembering the difference between hard and soft pencils....and when describing any type of drawing instrument, concluded with \"uhhh, I think.\"  Basically it was hard to take him seriously, as it seemed like he had no idea what the heck he was talking about.  The other students in the classroom were giggling at him, as if they didn't think this guy was for real either.  I sat in on the first class and then dropped it for a different one.\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "November 27, 2004",
            "review_content": "\nPat is an okay guy, funny and smart.  But not a great instructor.  He's really flexible and interested, but does not offer a helluva lot in the way of guidance or assisstance.  For a \"basics\" class you get a lot of freedom and not as much instruction as one may want.  In other words it would have been nice to learn some ways and techniques of drawing instead of just having time to put pencil to paper.\nWorkload:\nNot bad.\n"
        }
    ]
}