{
    "prof_info": [
        {
            "prof_name": "Karen Van Dyck",
            "prof_id": 1430,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Literature Humanities",
            "review_date": "November 09, 2016",
            "review_content": "\nProbably the easiest LitHum section in the world. Karen is a good teacher, and loves Greek literature, so she's is constantly teaching us about the Greek translation etc. Gave us some sweet hook-ups to Greek events across the city. We rarely had quizzes (and often we could do them together). Our midterm was easy. We only had 2 papers for the semester and that's it in terms of grading. She didn't prepare us that well for the final (bc you didn't have to read the books to get an A in the class) but a little studying helped me through. \nWorkload:\nReading (that's semi-optional)\n2 papers \nAttendance of two Greek plays / events in NYC + Columbia\nMidterm (which was easy)\nFinal\n"
        },
        {
            "course_name": "Greek American Culture- Diaspora/Translation",
            "review_date": "January 10, 2007",
            "review_content": "\nGreat professor, always approachable and definitely available outsde of class. The reading list was bearable, but having been in a class with a total of 4 students, I HAD to do read everything in order to participate. Since the class is small, all students got a chance to talk, and Karen encouraged us to give any and all input, even if she did/didn't agree. All in all, I learned about Greek American lit and would reccommend the class to anyone who is interested in the subject.\nWorkload:\nweekly responses (1p) was easy, maily done to make sure students did the reading, PARTICIPATION (mandatory, I mean you really need to speak up and make your case for the reading), 10-15 page paper on a related topic. Again, the reading can be either light or heavy, depending on the wee and topic covered, but worthwhile.\n"
        },
        {
            "course_name": "Greek American Culture- Diaspora/Translation",
            "review_date": "December 12, 2006",
            "review_content": "\nGreat professor. There is a weekly response due at each class, and it's pretty laid back. You MUST do the reading, especailly if the class is small, because Karen will randomly call on you to ask what you thought of the book/paper, whatever.\nOverall, good course.\nWorkload:\nnot bad, the weekly papers are a little boring, and a paper due at the end of the semester\n"
        },
        {
            "course_name": "Elementary Modern Greek II",
            "review_date": "January 14, 2003",
            "review_content": "\nMostly good stuff.  Karen encouraged/required our attendance at Greek events inside and outside of Columbia that always proved interesting.  The atmosphere inside class was warm and friendly.  Skits and conversation drills were pretty common and painless.  The culture discussions were usually interesting, as they were based on a book that Karen herself co-authored.  My only gripe is that some grammar rules were a little shaky, and vocabulary was not at all stressed.  Overall, a lot of fun.\nWorkload:\nMinimal.  Study vocabulary on your own.  Homeworks were short and didn't require much besides a dictionary.  Tests required little studying.\n"
        }
    ]
}