{
    "prof_info": [
        {
            "prof_name": "Manya Steinkoler",
            "prof_id": 1971,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "September 24, 2008",
            "review_content": "\nTake classes from her.  She's glamorous (think Marilyn Monroe hair with heels and a fur coat) and  unbelievably brilliant.  She conveys her passion to her students.  Her intelligence can come off as a bit intimidating at times, but if you talk and show interest you'll get so much out of her classes.  She's fairly flexible with the syllabus and really wants you to do well.  For someone who seems to do a thousand things at once she makes herself unbelievably accessible (I missed class because I was sick and she called me on my cell phone to talk about a paper I was worried about).  Concerning papers, she's not just concerned with structure, she is more concerned about content and really challenging your thinking.  Take her classes, you will NOT regret it.  Let's put it this way - I decided to take her classes for a full year.\n\nWorkload:\nModerate.  Sometimes she'll have you read a book a week, sometimes only a few articles.  She's flexible.  Papers - about 4 a semester with the option of turning in a rough draft (highly recommended).\n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "December 19, 2007",
            "review_content": "\nProfessor Steinkoler is terrific. She is very approachable and really wants to help. She has a genuine interest in what she teaches and is good at it. If she does seem arrogant that is because she knows what she is doing. Because she cared so much, it made me care. I worked really hard in her class and she would spend hours sitting down with me to revise all the 10 drafts of my paper. I never had a professor that was so devoted to her students. I could really speak to her and it would be okay if I got angry or sad, because she understood. I would love to take another class with her. She is a tough grader, but she is willing to work with you. My writing definitely improved.\nWorkload:\n2 paper and 1 research paper\n"
        },
        {
            "course_name": "FYS Women and Culture",
            "review_date": "October 30, 2007",
            "review_content": "\nProfessor Steinkoler is awesome. Seriously, these reviews of her that are negative, throw them out. I admit, I had my doubts when I first met her as well. But as the class progressed, I LOVED HER! She is brilliant, intelligent, inquisitive, caring, smart and maybe a little bit self-absorbed but that's okay. (Actually if you ever get a chance to talk to her about her life, you'll find she doesn't think so much of herself after all). Her lectures are very interesting and very low-stress. Their actually fun to go to (most of the time) because their so interesting. It isn't that reading intensive, rather, her style is to look at parts of the book and passages that spark interest and relates them to so many other things and changes your perceptions about things you never even thought of. You'll learn a lot from her! What is this about her not caring about her students? That's such a lie. If you ever have a problem with your paper, you can always come to her or e-mail her. She makes herself very available during office hours. If you ever have a problem, she's lenient with extensions on papers and is very understanding. She encourages you to meet with her and discuss your paper. She also wants you to express your own ideas, just be prepared to back them up. She's also good at working with your own ideas to develop into a clear argument (however, this is sometimes confusing because she might contradict herself if you discuss it with her later). She doesn't necessarily shoot down ideas during lectures, but she'll tell you if she doesn't agree with them. Overall, a great class and an awesome professor, definitely take her for First-Year English or Seminar!  \nWorkload:\nModerate/Light. The usual readings every week about 30-50 pages per class, 3 papers 4-7 pages each. \n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "April 30, 2007",
            "review_content": "\nI hated this class in the beginning. I found Professor Steinkoler to be arrogant and I disliked how she prefaced class by explaining what an expert she was. By the end of the course I had a completely different view of her. I was angry when I received a B on a first draft I had worked hard on, but her suggestions were on point and my writing undoubtedly improved. Professor Steinkoler's haughtiness is offset by her terrific sense of humor and love of the absurd. She is able to incorporate moments of levity into some pretty dense literature. The fact that I laughed and didn't cry when we read Milton says a lot. Take her class, throw out your preconceptions and crappy CULPA reviews and enjoy her class.\nWorkload:\nLight. 2 4-6 page papers and 1 8-10 page research paper. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 16, 2007",
            "review_content": "\nShe lectured alot and has a very distinct way of talking.  Her lectures were usually interesting, and the class is much better if everyone participates.  If you listen to what she says during class and take notes and formulate essays from there, you're set.  Also if you need extensions on papers she is extremely flexible.  Not a bad first year English class.\nWorkload:\nLight.  Readings aren't really required, 3 essays one research paper.  \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 15, 2007",
            "review_content": "\nProf. Steinkoler is a brilliant woman. She made herself available for students during her office hours and genuinely wanted to help them improve their writing styles and the way they thought about literature. SHe spent time giving us tips on how to write a good essay, and always made extensive comments on our papers to guide us. \nShe really cared about her students and knew when we just had too much on our plates and was flexible in assigning work. \nI really enjoyed going to her office hours and talking with her. She really gave me alot of direction in my writing and opened my mind as well. \nProf. Steinkoler is wonderful! Take her class and take advantage of her office hours and immense knowledge!\n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "May 08, 2005",
            "review_content": "\nProfessor Steinkoler is a great professor.  Although I do submit to the fact that she can be perceived as highly arrogant and close-minded, I think that \"she has no heart\" has gone a little too far.  Prof Steinkoler is so easy going and very approachable.  I found her lectures really enjoyable, and I'm not the \"enjoying of lectures\" type.  At all.  Attending her class was not a chore at all, it was a pleasure.  I would gladly take more classes with her at this school.  She chooses readings that are very different and extremely engaging, and fills her lectures, (yes this seminar is much more like a lecture, I'll give you that) with many interesting and random facts that make the class more well-rounded, and well, interesting.  I loved this class, and I would definitely take it again.\nWorkload:\n3 papers and a \"creative assignment\" which she is really willing to let you do whatever you want with.  Super understanding, allows extensions with ease.  Readings are not bad at all, and most you will want to read anyway.  Enjoy this class. \n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "May 08, 2005",
            "review_content": "\nProfessor Steinkoler is a great professor.  Although I do submit to the fact that she can be perceived as highly arrogant and close-minded, I think that \"she has no heart\" has gone a little too far.  Prof Steinkoler is so easy going and very approachable.  I found her lectures really enjoyable, and I'm not the \"enjoying of lectures\" type.  At all.  Attending her class was not a chore at all, it was a pleasure.  I would gladly take more classes with her at this school.  She chooses readings that are very different and extremely engaging, and fills her lectures, (yes this seminar is much more like a lecture, I'll give you that) with many interesting and random facts that make the class more well-rounded, and well, interesting.  I loved this class, and I would definitely take it again.\nWorkload:\n3 papers and a \"creative assignment\" which she is really willing to let you do whatever you want with.  Super understanding, allows extensions with ease.  Readings are not bad at all, and most you will want to read anyway.  Enjoy this class. \n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "April 28, 2005",
            "review_content": "\nProf. Steinkoler is an incredibly intelligent woman.   She always has so much to say about every little thing that comes up in class, and could go on forever.  Unfortunately for us, we don't have much input into the discussions, and we don't get to talk about our ideas, especially if they are erroneous in the eyes of Prof. Steinkoler.  \nShe does, however, really try to help her students improve their writing, and tries to push everyone to her potential.\nBeyond the academic considerations, Prof. Steinkoler is a charismatic, funny, and loveable person. If you take her class, you'll get to listen to some amazingly thought-provoking criticisim, and enjoy it, too.\nWorkload:\nTwo 4-6 page papers with revisions (all 4 for a grade) and one creative writing project.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 09, 2005",
            "review_content": "\nArrogance is the word that comes to mind when asked to describe Steinkoler.  I got to know her through the many visits to her office hours and she really is a very intelligent, capable woman who is just full of knowledge regarding psychology, literature, and politics.  But hit on a topic that she doesn't know much about... and she will somehow link it to something she can talk about and then go on for another hour. She loves to hear herself talk and loves to win arguments.\nThat said, she is a great lecturer, she can go for hours on interesting topics and I found everything she said to be fascinating.  But first-year english at Barnard was designed to be a discussion-based class, where students can exchange OUR ideas about great works of literature rather than listen to a professor drone on about her ideas (which she seemed to believe was the only right answer).  \nExample: I spent about 2 weeks writing my first paper, exploring creative ideas and doing a lot of research to back it... and she returned it with a D+ written on it.  So I re-wrote the paper in one night, reiterating everything she lectured about the book in class and reinforcing her opinions and ideas and got an A. \nI would happily go to her lectures, but in my opinion Barnard made a mistake when they asked her to lead a discussion-based class.\nWorkload:\n2 papers, and probably a rewrite for each,  and a final research paper. No rewrite allowed for the final research paper. -- Most students in the class didn't bother to do the massive amounts of reading because she didn't allow us to talk in class anyways.\n"
        },
        {
            "course_name": "English 220",
            "review_date": "December 19, 2004",
            "review_content": "\nThe other criticisms listed on this page don't correspond at all with my experience of this professor. It's most likely true that the commentary she offers for a given text come from other writers, but I'd be disappointed if it were otherwise. It's really the students' who are supposed to be learning to think and therefore offering original commentary. Her style is to give us all that's been said so far and to allow for class discussions. Her personality is so open and generous that I felt as if our entire class relaxed and just offered up whatever thoughts came to their minds. A professor who can create a sense of ease like this is a rarity, a gem to find. And just given the material she chooses alone -- as compared to many other professors -- her classes are well worth taking. She's also accessible and lenient, and though we had a few students who didnÂ’t speak the language too well and others whose comments really missed the point, she demonstrate a sort of easy grace, which, again, resulted in a general sense of ease and good feelings.\nWorkload:\nA lot of reading, not as much writing as she could have assigned. Her idea with writing was that she wanted us to work on our weaknesses. She therefore gave a generous amount of notation, from which it was very easy to understand just exactly what she was looking for in the next draft.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 16, 2004",
            "review_content": "\nUnder NO CIRCUMSTANCES should you take a class with Steinkoler.  She may know about Freud and psychoanalysis, but does not care much for English literature itself, which this class should be about. She mixed up characters, read off disorganized scribbled notes, and totally ignored a comment if it conflicted with her ideas. An extremely hilarious moment in class was when she gave us an overview of Greek history; what she did was print off a timeline from the Internet and picked up important events and nervously read them to us--One good thing about this woman is that she knows A LOT about NYC; she'll give you tons of info on lectures that you can attend for extra credit (of course, on psychoanalysis but these for the most part are really good), museums, operas, and even tango classes.  Her grading isn't that bad; a bit strict on the first draft and she only has minimal office hours which she skips when she's \"tired\", but not that different from other First Year English profs. She's pretty lax with deadlines; she'll tell you that she only extends deadlines for emergencies, but if you give her a pretty good reason she'll give you an extra week pretty easily.  \nWorkload:\nSame or slightly lighter than other First Year English classes: 2 5-6 page papers, and a 10 page final research paper. She doesn't require you to write essays on the supplemental lectures, which some other profs did.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "November 14, 2004",
            "review_content": "\nMost definitely my worst experience at Columbia.  She's VERY close-minded; so much that she won't care about offending her students with her \"witty\" and retarded comments.  Yes, her insight is sometimes astonishing, but just read spark notes before her class and you can simply highlight the comments she made in class from these.  This class could have been amazing because the books for it were great, but unfortunately she elegantly managed to make it a nightmare.  \nWorkload:\nthree papers of 4-7 pages and one final of 10-14 pages\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 15, 2004",
            "review_content": "\nProf. Steinkoler is a person who for all her intelligence lacks one thing, a heart. The woman is vicious in her criticisms which in no way are constructive. An example is once a student was absent and she proceeded to butcher her paper and call it \"garbage\" while constantly sighing in frustration and fixing her hair. She apparently forgets that she is teaching freshman in college who come from all walks of life and need help rather than bashing behind the back. If you want to listen to interesting commentary in regards to literature, take the class. Just be warned that her mouth and pen are her strongest weapons and that in the end everything she teaches is simply elegantly regurgitated and easily found in books on the literature we read. \nWorkload:\npapers every few weeks of decent length, she is usually flexible with dates\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 20, 2004",
            "review_content": "\nOne of the worst professors I could imagine.  She is obviously intelligent, but also obviously cares nothing about her class at Barnard.  Because of my interest in writing and literature, I was hoping for constructive criticism, or at least some form of critism.  She, however, offered absolutely nothing in the way of commentary.  Her discussion of the literature was also cut and paste (and read) from other people's commentary.  A terrible class.\nWorkload:\nlight\n"
        }
    ]
}