{
    "prof_info": [
        {
            "prof_name": "Pascale Crepon",
            "prof_id": 10834,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Grammar and Composition",
            "review_date": "January 12, 2015",
            "review_content": "\nI started the semester thinking that this would be my least favorite class, since I am not a fan of grammar at all. I only registered in the course because it's a prerequisite for the French literature classes I need for my major, but I am so, so happy that I ended up in Pascale's class! She is by far the greatest professor I have met here! The first two or three classes with her were pretty nervewracking, because she tries to scare away students who are expecting an easy class that they can float by in. But you'll quickly see how funny she is, and while sometimes her jokes are at students' expenses, it's all in good fun and she is equally self-deprecating. As a teacher, it is very clear that her students' progress is her number one priority, above grades, reviews, etc. She places a huge amount of emphasis on improving for the sake of learning, rather than for the GPA points. To back this up, she grades compositions fairly but always allows at least 2-3 rewrites in which she'll raise your grade if you actually take the time to better them. She expects you to work on the grammar exercises yourself, and come into class with any questions you might have. At the end of the semester, she asks students what they most want to review and focuses on that. Her exams are very fair, just various grammar questions and a composition or two.\nI can't emphasize enough how amazing of a teacher Pascale is. She really, truly cares about her students' improvement, and she sets up 2 or 3 meetings with each of her students during the semester, in which she goes over the things that you have the most trouble with and gives you advice. Go in to see her as often as you can! I've had some really great chats with her and she's really an incredible person as well as teacher!\nWorkload:\nAbout 4-5 total compositions for the semester, 3 midterms and a final, you're expected to read the grammar lessons that will be discussed in class, though they're quite dense, and a very manageable amount of reading for each week\n"
        },
        {
            "course_name": "Third-Year Grammar and Composition",
            "review_date": "January 07, 2015",
            "review_content": "\nFor people who wish to improve their French writing skills, you should definitely take Pascale's class! It may seem overwhelming at first, but if you put in the effort, you will see the results. She's not really strict about grades or deadline, but she's really dedicated to improving her students' writing skills. And thanks to her help, my French improved to a different level and I'm confident that I want to pursue a degree in French. Your work pays off in this class. \nWorkload:\nModerate. 4 Compositions each worth 10%, Participation 25%, and the rest will be exams (midterm,final, 3 quizzes). She lets you hand in several drafts of the composition,so don't freak out when you get a B or C in your first draft. Make sure to read essays she tells you to read before class and be prepared to actively participate in class discussion. \n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "December 27, 2014",
            "review_content": "\nI'll get straight to the point: Pascale is without a doubt one of the best professors at Columbia. This woman is a godsend. Every single day she came in energetic and ready to teach, with the patience of a mother. I've been here for 2 years and this is the only Professor that I can honestly say wanted every one of her students to succeed. If you have the privilege to take one of her courses you'll understand what I mean. She's also one of the funniest professors I've had here, and her playful personality really made the class a joy to attend. \nIf there was a platinum nugget, she deserves it. She said she doesn't check CUPLA but if you see this Pascale, thank you for everything!\nWorkload:\n Very manageable.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "December 19, 2013",
            "review_content": "\nPascale is tough at first, but by the end of the semester you will find her to be extremely fair.  You can tell she just truly wants her students to learn French, but she's not a dick about it.  If you make an honest effort, your efforts will be rewarded.  She will work with you on assignments to make sure you can make up for doing poorly on tests, etc.  The workload is more forgiving than with other Professors in the French department; she dropped the lowest scored test from our final grade, and gave us extra points for creativity and so forth on the compositions.\nWorkload:\nModerate.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "January 03, 2013",
            "review_content": "\nShe's, quite frankly, the best. I have no idea what else anyone could want in a professor.  She provides work that will improve your skills but doesn't push it on you, she explains things well in class and hammers in details she thinks are important, and she genuinely cares about her students.  Her objective is to make you succeed at learning French, and she believes your performance is a reflection on her.  If you need extra help, she's always quick to correspond through email and happy to meet with you during office hours or whenever you're available.  She made study week a walk-in period for her students who needed help.  She dropped the lowest of five exams.  She shows clips of material she thinks is interesting or useful for you.  Simply put: she's everything an instructor should be and I'm happy to have had her. My french has never been so strong.\nWorkload:\nReasonable, a few exercises and (for 1202) some reading.  The exams, essays, and vocabulary are standard throughout the department, and she adds in an extra credit quiz on, typically, the vocabulary so you'll usually end up with either a quiz, an essay, or an exam each week.  The quizzes make studying for exams significantly easier and raise your exam grades to boot.  \n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "May 13, 2012",
            "review_content": "\nPascale is wonderful. She is funny, kind, and an overall fantastic professor. She comes off as mean and sarcastic at first, but I always found it pretty funny -- she's incredibly entertaining, and she has such a soft spot for her students, she's extremely understanding. \nThe class was 4 days a week for 50 minutes. At first I was unsure about taking it because a class four days a week just doesn't sound like fun. But the 50 minutes always went by quickly, it was a discussion/speaking-based class as all language classes are, I think, and I made a lot of friends and there were a lot of speaking portions. Classes are split into some speaking practice, questions about vocab/grammar, practice with vocab/grammar, sometimes some reading... your general language class.\nPascale is also incredibly generous if she sees that you are working hard. She ended up dropping our lowest test grade and we only had like four I think. There is a quiz before every test on vocab that counts as 0-3 points of extra credit. Each test covers two chapters. For every test there's also a composition which you also get a chance to revise. Her grading is very straightforward and she is always telling us to come to office hours and she always wants to help us. She really wants to see us do well. \nWorkload:\n20% oral presentation/speaking in class (mostly oral)\n20% tests\n20% final - no midterm\n20% compositions\n20% participation (make sure you show up to class and talk and stuff. it's not hard, this isn't a lit class where you might not have anything to say bc you didn't do the reading)\nthere is homework every day, both from the book and on quia (online program). if you don't do it she won't dock you grade wise if you're still doing well in the class/prepared. but if you truly want to learn the language it helps. and it helps you come final exam time.\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "August 13, 2011",
            "review_content": "\nPascale is an awesome french teacher. I was a little intimidated by her at first, but after a few weeks I got used to her sense of humor and really started to enjoy class. She really cares about her students, and tries to make class fun, or at least switch it up every once in awhile. She talks about culture a lot, which is a refreshing change of pace, and she loves to talk about Switzerland (where she is from). She's also very good at explaining grammar rules and very willing to answer questions. She does tend to tease people a little bit, but it's all in good fun and it sets a light tone for the class. \nMy main advice is to go to her office hours. Even if you don't have a question about the lesson that week, just write a paragraph and have her look over it or go practice your pronunciation. She really appreciates the extra effort, and it will help your french and your relationship with her. \nWorkload:\nPretty standard. Turn in your workbook on test day, a few quizzes and compositions, and of course tests. She's very flexible if you need extra time on anything (as long as you have a legitimate reason). \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 25, 2011",
            "review_content": "\nPascale is very sweet and seems to genuinely care about her students. She comments amusingly on franco-american relations, cultural differences and the virtues of Swiss chocolate (she is in fact Swiss). She occasionally lectures us on how we should not binge-drink and how we need to get more sleep. She is easy to understand (doesn't speak frustratingly fast like some language instructors) and clear when explaining grammar. She often gives us lists of questions which we then have to ask our classmates, circulating around the classroom having short conversations, which is a very helpful exercise if you take it seriously. Language classes are always rather boring, at least for me, but Pascale tries to make them less so as much as possible. She's very friendly and accommodating if you need to go to a different class on the same day because you have something to do during your scheduled time-- don't take advantage of that opportunity. Go ahead and take the class if you can, really!\nWorkload:\nFine. She does check your workbook but only on test day, so you can push it off till the last minute if you want. Exams standard for the department, short chapter quizzes that are likely to help your grade, not hurt it. Compositions not too difficult and she's flexible on the due date of the revised version (less flexible on the first draft but if you have a good excuse and ask in advance she'll probably put it off a day or two). We were supposed to have a 10-min oral presentation at the end of the class but she decided it was going to be too stressful for us right before finals and told us we didn't have to do it.\n"
        }
    ]
}