{
    "prof_info": [
        {
            "prof_name": "Kenneth Eisenthal",
            "prof_id": 2090,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "PChem II",
            "review_date": "May 18, 2008",
            "review_content": "\nI didn't find Eisenthal to be as unbearable as some of the previous commenters.  He's a pretty nice guy, but typical of higher level science professors: he knows his stuff, but unfortunately has a hard time making it understandable to his students.  He definitely tries to make the class worthwhile for everyone though.  Judging from the previous comments, it seems that he's changed his exam policies and style--only 2/3 midterms count, and they also got progressively shorter and easier as the semester went on.  What got me through was just memorizing all the formulas before each test (no cheat sheets were allowed).  All in all, this was a decent class.  \nWorkload:\nAbout 6 problem sets, for borderline grade decisions only.\n3 midterms & 1 final that served as the equivalent of two midterms. Best 3/4 counted.  \n"
        },
        {
            "course_name": "Physical Chemistry II",
            "review_date": "May 18, 2006",
            "review_content": "\nExpect a poorly taught class, very little homework, rather easy tests that you are unprepared for, a super long final (we had almost 4 hours instead of the regular 3).   He's pretty hard to follow at times, and your class will share many a classwide smile.  However, he's not a mean person.  And don't worry, I don't know what the last reviewer was talking about, but I really doubt he has an intercollegiate reputation for sucking.  He's on the national academy of science!  He's your only choice for pchem II anyway (unless the department changes this course for the first time in many years), so have fun.  :)\nWorkload:\nI think you have a grand total of 7 problem sets from the textbook (7 problems was the maximum number of problems in a problem set), and you have the answer key anyway (look for former people who took the class, ebay, etc).  There are a whopping three midterms, all of which count (although if you do well on all of them and mess one up I don't think Eisenthal will hold it against you too much).  The final was worth something like 50% of your grade and it was very long.\n"
        },
        {
            "course_name": "Physical Chemistry 3080",
            "review_date": "May 13, 2006",
            "review_content": "\nThere are a lot of really nasty reviews out there about Prof. Eisenthal, but most of these people are exaggerating.  Yes, p-chem II is probably one of the hardest classes you'll take in college.  This is true anywhere, though- it's not like we're in a much worse situation than anyone else.\nThe book is pretty crappy.  The lectures are straight out of the book though, and the entire class only covers a third of the book.  There's a ton of equation memorization for the tests and only a small amount of equation manipulation.  The tests tend to have a bunch of easy questions (ie, \"write this fcrmula\"), and then one or two questions that hardly anyone gets right.  One thing that's really good about the tests is that he'll ask you to calculate a numerical answer, but all you have to do is write the expression- you usually don't even have to correct your units.  No calculators, so you couldn't calculate the answer even if you wanted to.\nYou should probably go to lectures.  You won't learn a ton there, but you'll know what's covered in class, and you can match that up with the book (crappy as the book is), and figure out what you need to study for the midterms.  Sometimes prof Eisenthal messes up proofs or makes obvious mistakes in lecture, but there's always some person who's awake enough to catch it, so it wasn't a big issue in our class.\nAnyone can do well on the tests if they can memorize the equations.  That being said, you have to put in a lot of work into doing something that is completely useless for long term, but if you can motivate yourself to do that, you'll do fine.  The curve is harsh for an upper-level 30 person class, but not overly unreasonable.  I was a bit below one standard deviation above the mean, and that turned into an A-.\nWorkload:\nWeekly homeworks that I'm not sure were worth anything for your grade, even though the TA graded and returned them.  Three midterms (two based almost entirely on your ability to memorize a tremendous amount of equations with the third being more conceptual) and a final.  The final is not hard if you can sit down for  several hours and just memorize 4 pages of equations.\n"
        },
        {
            "course_name": "PChem II",
            "review_date": "July 08, 2005",
            "review_content": "\nSigh.\nI think the best phrase that sums up this semester with Ken. A very defeated sigh. I can honestly say that I've never felt so cheated in a class. \nEisenthal's lectures are, for the most part, nonsensical and trivial--often focusing on patronizing topics such as how to take a derivative or an integral rather than the actual subject at hand.\nOn the first day of class, he is quick to offer up that \"no question is a dumb question,\" but quickly it becomes apparent that that is not the case--he often gets combative when asked questions, and I think the class reached a certain point where intimidation overtook intellectual curiosity.\nEisenthal also fails to communicate the expectations of the class. The homework load is very light, maybe 5 simple problems every two weeks or so, and readings from one of the worst pchem books out there, Tinoco. However, when the exams roll around, you are expected to be able to make some pretty interesting deductive leaps and manipulations of the material that are very difficult to wrangle without the familiarity one would normally gain from doing challenging problems. His grading scheme is arbitrary as well. At the beginning of the semester, he said that he was going to curve the class, but in the final grading all the students hovering around the 70's (the mean) sure got a nice summer surprise when C-'s, C's, and C+'s rolled in.\nHe doesn't do a very good job preparing for class or tests either--there is speculation going around that he refuses to teach anything but pchem on the undergrad level because that is the only thing he has notes for--and it shows. He is constantly backtracking on the boards, gets things blatantly wrong and often leaves it to the students to correct. Not to mention the unsolvable first problem on the final! The lack of professionalism in the class is discouraging and makes learning very difficult.\nI've been complaining all summer to professors at different schools about how sucker-punched I was by this class; when they were told who was teaching it, most of them groaned or rolled their eyes in empathy. Yes folks, this man has an intercollegiate reputation for sucking.\nIt's a real shame that Chemistry majors, after wading through 2 years of premed bs hogging all the departmental resources, have to have an encounter with such a miserable class. Maybe you'll like it. Maybe you'll do fine. Maybe you'll think you're doing fine, and then end up with a C. I'd go with the latter--but no worries, unless your a pchemist, no one gives a shit what grade you get in this man's class.\n"
        },
        {
            "course_name": "PChemII",
            "review_date": "May 08, 2005",
            "review_content": "\nThis was the worst class I've ever taken at Columbia.  Of course, the only reason you would take this class is to satisfy a requirement.\nEisenthal is getting old, and it's showing.   He forgets half the material he's just about to teach.  \nHe says that we should check to make sure what he is writing on the board is correct after class (Eisenthal should get it correct before he comes to class).  \nHe always asks for feedback, then when you give it to him, he shuts you down.  Example: When asked by the class to hand back the graded tests so we can look at our mistakes while he goes over it (yes, he spends a full class going over each test!), he says we'll stop paying attention if he does that.  That doesn't make any sense to me.\nHis tests are very poorly worded.  When you go over the test, he will ask why no one understood.  You'll tell him why, then he will say something like: well this is the only way i could write it.  Clearly, test questions that cannot be expressed in words should not be given to the class.\nFinally, Eisenthal often confuses himself when he's teaching, so you just don't know when to second guess what he writes on the board.\nOn top of all of this, the book is difficult to follow along with Eisenthal's lectures.\nHope for a good TA, that might be the one thing that saves this class for you.\nWorkload:\n3 Tests, Weekly problem sets (you have the answer key...which is full of mistakes!).  The key to the tests is understanding what exactly Eisenthal is asking.  The problem set problems in general will be nothing like what you will see on the tests.\n"
        },
        {
            "course_name": "P chem II",
            "review_date": "May 07, 2005",
            "review_content": "\nEisenthal is a sweet man.  His lectures are pretty bad, but his tests are fair and the workload is pretty minimal.  He is very open to input from students.  Could be worse.  \n"
        },
        {
            "course_name": "PChem II",
            "review_date": "March 31, 2005",
            "review_content": "\nI had Eisenthal last year. He was the worst teacher I have ever had by far. Horrible lecturer. Vague questions on tests. He's really old (early 70s).\n"
        },
        {
            "course_name": "Chem C3080 PHYSICAL CHEMISTRY II",
            "review_date": "May 14, 2004",
            "review_content": "\nEisenthal's class was a nightmare!  His lectures were completely useless; he would skip half of a chapter and spend whole classes on very minute aspects of the material.  I got nothing out attending the lecture, due to his inability to answer questions well and his horribly boring teaching style.  The book wasn't much help either, but doing the problem sets really helps in terms of understanding the material.  \nWorkload:\nThree midterms, a final, and a bunch of problem sets but you have the answer manual.   \n"
        }
    ]
}