{
    "prof_info": [
        {
            "prof_name": "Daniel Aviv",
            "prof_id": 2647,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Genetics",
            "review_date": "September 01, 2009",
            "review_content": "\nEngaging professor, but Yin should not be teaching. As sweet and good-intentioned as she is, she's a horrible teacher. Aviv is interesting, though goes really fast. If you miss a beat, you won't get the rest of the lecture. The subject material itself isn't extremely captivating, at least not the way it is taught. The textbook was much more interesting, at least to me. If you're the kind of person who needs to get a lot of details to work into the general, the book would be useful.\nProfessor Aviv, I know you're reading this so PLEASE put up some sort of powerpoint BEFORE class. As much as you are opposed to this, it'll be a huge help those who are a bit slower at picking up material. And slow down during the Lambda phage lessons. You went way too fast there and did not break up the different stages distinctively enough.\nWorkload:\n3-4 midterms + final. No homework, but you must keep up or you'll be completely lost.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "May 27, 2009",
            "review_content": "\nAviv is an energetic professor that seems to care about his class and his field of work.  That is until he had a first time grad student (Yin Mei Lim) teach a little over half the course (but more (now professor) Yin Mei Lim).  His office hours are in the morning and at the medical campus, thus it is quite inaccessible (why can't he just have them on the college campus?).  His lectures are quite interesting, and you must study them religiously since the exams are solely based on his lectures and some extra material such as a research paper or a wiki article (on lambda phage).  Now, with Lim: she tried at first to write on the black board, to utter failure.  Then she tried writing on a projector, to utter failure.  Finally, she resorted to doing her lectures via powerpoint, like what Aviv does.  But, her lectures were much more tepid, boring, and straight from the textbook.  Also, you must go over all your exams (including your final), because the TAs (I've heard) will make some mistakes on grading.  \nWorkload:\nReadings from a good textbook (but only needed as supplement... wiki and google works much better, and they don't cost over $$$), an research article or two, and weekly problems either made by the profs or from the textbook.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "June 26, 2007",
            "review_content": "\nThe secret to this class is to study the slides, religiously.  Don't bother reading the text, unless you don't understand something from the slides.  Memorize every important concept from the powerpoint presentations.  I found that I didn't need to go to/ask for the Professors' office hours--the TAs should suffice.  (Just talk to them, they will tell you what you need to know.)  Every exam is long and has many points dedicated to short answers so UNDERSTAND what you're memorizing or else it will come back to haunt you.  As an aside, there was a guy in the class who ran back and forth across my row like a crazed monkey during our final.  I thought I did okay--I got an A in the end.  I wonder what grade he got?\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "February 13, 2007",
            "review_content": "\nNo excuse for no office hours. There's just no excuse for that. Lectures were hard to follow, a lot of studying on own necessary. \nThe problem is, though, that so much information is presented that you end up studying a lot of it for nothing; moreover, other stuff you think is too complicated to show up on the test does.\nWorkload:\nNot too bad, but I only got a B\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "May 06, 2006",
            "review_content": "\nAviv and Russo split the lectures. All their lectures are powerpoint based. We had homework due on Monday (only helps if you are borderline between two grades at the end of the semester) and quizzes (20% of grade) every wednesday. Overall, the  class is very typical science class. I attended lectures (I don't understand why one wouldn't at Columbia; you avoid spending more time reading the book and in this class, the book was more a reference for the lectures then actually required reading) and overall found them to be very informative and interesting. However, Aviv's powerpoints are MUCH better organized than Russo's. When I reviewed for the exam, I found it very easy to go over Aviv's lectures. He is less wordy and organizes the slides well. Russo is the opposite. Too many words, not very articulate, and too much information per slide. I never went to recitations so I can't comment on the TAs. The exams were average; not too hard, not too easy. Because they make you take quizzes, I kept up with the material and only had to study/review the day before the two midterms and one final they give. I did above average on both midterms. I haven't taken the final at this point, but it's exactly like the midterms (combination of multiple choice, T/F, fill in the blank, short-answer questions) and is cumulative. One warning about the exams: they take forever. Both midterms, the majority of the class stayed all the way until the end trying to finish. Russo's material is generally harder to study, not just because his powerpoints are worse than Aviv's but because he likes to teach methodology in genetics research, which can be confusing if one doesn't have confidence in understanding scientific research (Aviv more likely will present a breakthrough experiment that helped move genetics forward and you are expected to know the general methodology and conclusion of the experiment; i find it easier to study examples rather than to learn the general methodology like Russo teaches). I liked the professors alright; Not a huge fan of either, but didn't hate them. Overall, I would recommend this class if you're interested in genetics.\nWorkload:\nQuizzes every Wednesday (can drop 1), Homework (optional) every Monday, two midterms and a cumulative final.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "November 20, 2005",
            "review_content": "\nA great class and he actually makes the boring stuff enjoyable. I have learned a lot about genetics. The homeworks are not collected but if you are good at it you will certainly do well on the exam. Dr. Aviv is very organized. It is not that they dont care about students it actually depends on you whether you are self motivated or not; it is true for other columbia science classes as well. Dr. Russo is kind of disorganized and tends to make the exam little harder but if you do the assigned problems you are fine.\nOverall, the class was a great experience.\nWorkload:\nWeekly quizzes on the materials covered in the lectures, and I think there were 3 mid-terms of which the lowest grade was dropped.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "November 12, 2005",
            "review_content": "\nAviv is very young. He pretends like he cares about students but really he and Russo have no office hours. He tries to joke around, tries to be engaging, but it's just very sad. He does seem to care about the material, but in his actions, it becomes clear that he doesn't really care about you. \nWorkload:\nThis class is a fairly standard science class with a fairly high curve. Weekly quizzes and weekly homeworks. Not sure if the homeworks ever counted so I stopped really doing them. \n"
        }
    ]
}