{
    "prof_info": [
        {
            "prof_name": "Quandra Prettyman",
            "prof_id": 976,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Black Explorations in Literature",
            "review_date": "October 31, 2005",
            "review_content": "\nThe syllabus is excellent, the course load is just right and Professor Prettyman is the sweetest person ever. She brought us Halloween treats and talks to us as though we were more than just her students. She's accessible (she'll give you her address and phone number) and helpful. Still, she can't facilitate discussion very well. She seems to hate silence, so she'll talk and talk and talk and read and read and read aloud until someone interrupts her with an idea / comment. You can definitely interrupt her, so that's good. She won't be bitchy about it. Still, you need to make sure that you come prepared to class so that you can interrupt her a good idea / comment and maybe facilitate some good discussion on your own. I know, it sucks to have to kinda do her job for her. But most students attracted to this class are extremely knowledgable and bright and, yes, they do read and, thus, are able to contribute well to class discussion. She'd make us watch videos at the the beginning of each class, which were usually pointless, but hey .... less class time, right? :o) .... And we'd have to post responses to our readings on courseworks. That was sometimes tedious and sometimes enlightening. It all depends on your personal feelings toward journal entries. Some people told me they never did the entries. This is the first semester that Prettyman uses coursework, so perhaps students took advantage of that. She's a tough grader! Your first paper, she says, is usually your worst and, so, usually a C. Still, she's open to rewrites and is there to help in order to get that grade bumped up.\nWorkload:\nThree papers, weekly journal entries on courseworks.\n"
        },
        {
            "course_name": "Senior Seminar: Slavery: Women's Experience",
            "review_date": "January 18, 2005",
            "review_content": "\nThis woman is a total gem, and she's definitely young at heart. She is REALLY interested in what her students have to say, and will get as excited about your thesis topic as you (and maybe even more excited). She seems to love learning from her students, and loves the books she teaches. The material is interesting, although several of the books are long. She listened right away when we told her that there was too much reading for us to finish it all while writing our 25-pagers, and changed the agenda a bit to accomodate our needs. She is also lenient about ever-changing thesis topics; she wants you to enjoy the research and writing process. I, for one, really did. Prof. Prettyman also has a great sense of humor, and is very friendly. She invited the class over to her house twice during the semester, once to watch \"Gone with the Wind\" and once for an end-of-semester party. She also holds individual meetings there. Such a cool lady.\nWorkload:\nthe thesis and a book a week.  she will ask each student to read and be prepared to summarize an article for the rest of the class once or twice in the semester. she gives you a timetable to tell you when things like a topic proposal, an outline, an annotated biblio, and a draft are due. I found this very helpful, since the thesis can seem daunting when it's the only thing you hand in all semester.\n"
        },
        {
            "course_name": "Explorations of Black Literature 1740-1890",
            "review_date": "January 05, 2005",
            "review_content": "\nI love Quandra! Our class was incredibly small the smallest university class ive had so far which may be one of the reasons Quandra could be characterized as a \"sloppy lecturer\" but  I would prefer to call it informal and a pleasant break. I like the homely family feel of her teaching style,Quandra is the embodiment of a sweet grandmother figure.(though I cant really say class time was an intellectual adventure, rather the intellectual challenges were achieved through papers)  The previous reviewer claimed she was pushy about paper topics and the like but dont let that fool you every paper i wrote in her class was born out of my own interest with the text and something i found interesting. and i didnt get an A+ but an A suits me fine.\n"
        },
        {
            "course_name": "Minority Women Writers and Women's Experience of Slavery (Senior Seminar)",
            "review_date": "December 29, 2004",
            "review_content": "\nProf. Prettyman is the type of professor that is invested in her students. She wants you to be so engaged in the topics and the literature that you don't do it for a grade, you do it because you want to. Having said that, I think she is generally a fair grader, you just have to realize that your grades are based squarely on what you've handed in. Personable and very friendly, I've spent more time at her house that I've spent in any other professor's office at Barnard. She succeeds in getting her students to care about what they are doing precisely because she gives them room to find something they like and run with it. I would recommend you take a class with Prettyman before leaving Barnard. I would particularly recommend taking Minority Women Writers, as it introduces you to literature you may not get to read elsewhere in the English department, and its non-English major friendly.\n"
        },
        {
            "course_name": "Explorations of Black Literature 1740-1890",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Prettyman is a jewel in the Barnard English Department. It is true that she truly does love to lecture and she will keep talking and reading from her writings on the course material. HOWEVER, she's just waiting for you to interrupt her. haha.  Once you interrupt her and start facilitating conversation, she will take the class discussion wherever you'd like.  You really can't be a passive student in her seminars. She wants you to be an active learner.  She's willing to guide you with paper topics.  I found that she let me write about anything I wanted, as long as I could support it with the readings.          With regard to the course itself, I'll agree with the previous reviewer, regarding the amount of reading that is required.  However, I disagree with everything else that has been said about this class. The course material was dense, but a true reflection of Black Literary History from the 18th centure.  You have to expect to read narratives(from slaves and free blacks) that are INCREDIBLY religious in nature.  You have to adjust to the antiquated language of the writers. You may even have to do some extra \"Google\"-ing to understand some of the historical background and symbolism. BUT, for those who are curious about the \"ignored for too long\" literary talent of Black Americans in this country, this class is an academic journey, worth taking with Quandra Prettyman as your guide. \n         Also, I found the  aforementioned supplementary video(\"Africans in America\") that Professor Prettyman showed in class a really great visual aid in understanding the historical context of the literature we read. \n        Don't take this class if you're looking for an easy class that only examines the well known, \"Black History Month token\" writings(The Narrative of Frederick Douglass and Incidents in the Life of a Slave Girl).  Professor Prettyman goes WAYYY deeper than that. And I thank her for that. \nWorkload:\n3 papers(1st is 4-6 pages,2nd is 6-8 pages, and the third is either another long paper or biographical sketches of notable Black Americans from the time period under study), a reader(relatively thick), and 2 books. You will walk away from this class with a wealth of knowledge.\n"
        },
        {
            "course_name": "Explorations of Black Literature 1740-1890",
            "review_date": "January 21, 2004",
            "review_content": "\nSTAY AWAY from this class!!! Prof. Prettyman's lectures are sloppy at best, and most class days are composed of her reading essays she wrote from the '70s or earlier, or watching pointless videos. She spends the whole class reading. If you want a seminar, this is NOT the place to be. Her grading is erratic and unfair--she doesn't \"believe\" in intro or conclusion paragraphs, and is absolutely NO help if you're having trouble with a paper. I went to her telling her I wanted to write about Douglass and education, and she told me \"What you really want to do is examine the institution of slavery from Mary Prince down through Harriet Jacobs, and the way it effects the family structure.\" Uhh...\nEvery class was torture, and I would fight to not fall asleep. Prettyman is a very lively reader, but there's only so much you can take.\nPrettyman herself is generally very nice, excruciatingly polite, but can be extremely belittling. I'm an English major, and I've taken plenty of literature courses, and this is NOT a class to take if you love language.\nWorkload:\nThree large papers, a more than average amount of very dense and often uninteresting reading, and lots of outside research. A lot of work, and erratic grading. She also requires journal responses to EVERYTHING you read. It felt like kindergarten.\n"
        },
        {
            "course_name": "Minority US Women Writers",
            "review_date": "March 27, 2003",
            "review_content": "\nThis is the class you hoped for when you thought about Ivy League classes.  Sitting outside under the trees talking about culture, meeting in a professor's book filled apartment, gossip about the great writers of the twentieth century- Professor Prettyman is quite simply the coolest professor on campus.  She's fun, she's challenging, she's incredibly knowledgeable about subjects no one's even writing books about.  There is no stucture to her assignments because she expects her students to rise to a challenge.  If you are not willing to read a lot, think even more, and challenge your own preconceptions, this may not be the class for you, but if you are, you will be richly rewarded.  She can be an erratic grader, but she values commitment and enthusiasm.  She acknowledges that her workloads can be exhausting- but she'll let you present midway through your book.  She is very intimidating the first day of class simply to scare everyone away- don't be!!!\nWorkload:\n4 units- one page biography and five page paper per unit, plus response journal.  (Response journal is very important for your grade!)\n"
        },
        {
            "course_name": "Minority Women Writers in the United States",
            "review_date": "February 20, 2002",
            "review_content": "\nProfessor Prettyman is wonderful. She is a sensitive, insightful, and wholly respectful professor. Though the course is officially a lecture course, she holds it to about 15 students, and it is conducted in a true seminar style. Each student's contributions are considered equally valid, and comments are often more subjective or from personal-experience, rather than concrete details from the texts. The class turns into the one-big-happy-family after the first weeks. Don't let her intimidate you the first day-- I think she does that to \"clear the room\" and keep the students with real interest.\nWorkload:\nRelatively light workload, but be prepared to share your thoughts. One autobiography annotation and short paper per unit (4 units), a regularly kept reading and response journal. You will learn a great deal about yourself from your interaction with peers and with the poetry and prose fiction.\n"
        }
    ]
}