{
    "prof_info": [
        {
            "prof_name": "Louis Le Guyader",
            "prof_id": 3222,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "July 18, 2007",
            "review_content": "\nLeGuyader is an interesting professor. You can easily tell that he loves to teach... His passion, however, is greatly outweighed by his inability to convey concepts in a clear, concise, and understandable manner. Or perhaps I should rephrase - he is unable to explain elementary and fundamental concepts to people who actually need an introduction to accounting and finance. There were people in the class who already knew finance and they seemed to get a great deal out of his course - after all, he is a hotshot veteran investment banker who kicks total ass in his business (no cynicism intended). He definitely knows what he's talking about both theoretically and practically. \nSo if you understand finance to begin with, you'll learn a lot and the course will be easy throughout. Otherwise you will toil through his lectures and come to find on review day with the TAs (who are good) that what you've been studying and trying to understand all this time is not at all what's going to be on the tests. You'll most likely have to work hard throughout the course unless you're good at theoretical math (easy - no calculus), as in understanding the background behind how financial concepts function in math.\nI greatly appreciated his passion though. If you make an effort, you'll probably end up with a respectable foundation of finance. I would recommend him if you're willing to study for it.\nWorkload:\nModerate. Weekly problem sets that may be long either because the questions go totally above your head, or because he assigs A LOT of problems from the book. One midterm and one final - both mostly from the book, but make sure you understand the few \"other\" questions that are on the practice tests because they may end up killing you, even though his catch-phrase is \"I don't like surprises\" (which is definitely true). The curve's not that great, and don't be deceived by his extra credit problem because it won't do anything for your grade. In general though, a lot of people seemed to slack off - so if you're not one of them, you'll probably end up with an A- or above.\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "April 20, 2007",
            "review_content": "\nLou is obviously a brilliant professor.  Further, he is incredibly nice.  The only problem is that his teaching style is quite boring, although the subject matter (Accounting and Finance) probably has a lot to with it.  The class is two hours long from 8-10pm without a break, and it can get very, very boring.  Otherwise, Lou is a really great guy.  His tests seem to be pretty fair, and he is a fair grader.  His problem sets tend to be VERY long however, sometimes taking upwards of 5 or 6 hours to complete.  Luckily, they are only graded on a pass/fail basis.  Just know what you are getting into before you take this class.  \nWorkload:\nWeekly (LONG!) problem sets, midterm, final.\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "April 20, 2007",
            "review_content": "\nLou is obviously a brilliant professor.  Further, he is incredibly nice.  The only problem is that his teaching style is quite boring, although the subject matter (Accounting and Finance) probably has a lot to with it.  The class is two hours long from 8-10pm without a break, and it can get very, very boring.  Otherwise, Lou is a really great guy.  His tests seem to be pretty fair, and he is a fair grader.  His problem sets tend to be VERY long however, sometimes taking upwards of 5 or 6 hours to complete.  Luckily, they are only graded on a pass/fail basis.  Just know what you are getting into before you take this class.  \nWorkload:\nWeekly (LONG!) problem sets, midterm, final.\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "April 03, 2007",
            "review_content": "\nProf Guyader's a pretty nice guy overall.  I didn't really go to a lot of lectures near the end of the semester because he really only talks about actual material in the textbook for about 30 minutes out of the 2 hours.  The rest of the time he just tells stories related to accounting.  Recitations and the book pretty much taught me everything in that class and I didn't do too bad.  Accounting's not ridiculously difficult or anything; it just gets boring really quickly.  I'd recommend taking him though.. he does tend to keep you somewhat entertained during lecture\nWorkload:\nWeekly problem sets, fair midterm and final\n"
        }
    ]
}