{
    "prof_info": [
        {
            "prof_name": "Nicholas Turro",
            "prof_id": 295,
            "total_reviews": 31
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 10, 2011",
            "review_content": "\nWow do not take Organic Chemistry with Turro. Not only is it in that stupid Havemeyer classroom with terrible echoing, but Turro literally mumbles like his mouth is full of peanut butter and marshmallows. That, on top of his muffled, staticky microphone, pretty much meant I could not understand a single sentence he said. I stopped going to class after the first week, and only came to take the exams. Luckily the required recitation section taught me what I needed to know for the quizzes, midterms, and final.\nThe class starts out incredibly easy, the first two midterms had averages in the 90s. But it picked up pace and the third and fourth midterm averages were in the 70s. It was nice to have so many midterms, because by the time the cumulative final came up, I literally studied for one hour and then went off to take it. \nTry to take orgo with a different professor if you can. But if you insist on taking Turro, be prepared to learn everything in recitation and by yourself. \nWorkload:\n4 midterms, 1 cumulative final, weekly quizzes\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 27, 2010",
            "review_content": "\nHow in the world did this guy get the teaching award in the past? He can't teach for life and his powerpoint slides are filled with useless material about chemistry jock and paradigms - seriously, how are these related with learning the language of orgo? Instead of explaining reactions and going over important topics like R&S; configuration in stereochemistry and mass spectrometry, he spends more time blabbering and going on massive tangents about how he worked for almost all the scientists we learned about in the McMurry text (which is a pretty bad book in the first place). \nThis class was a huge drain of my time and energy, for I learned very little about organic chemistry-> bodes well for next semester. In the beginning, Turro seemed to be a decent lecturer, going over the first few \"easy\" chapters PROPERLY, but when we got to IR, it seems like the demons got him. His lecturing skills degenerated more and more as the semester progressed, becoming so incomprehensible and incoherent to the point that I wished I had taken Cornish. I had to consult extra sources to even get the concepts straight, which can be avoided if the professor is at least okay.\nNow the grading - absolutely evil. NO NO NO CURVE!!! I hope I don't have to reiterate it. Initially, a curve was not needed given the ease of the first two midterms, which grabbed a bunch of ques. from the practice problems, but after (and including) the NMR test, boy did the exams become a nightmare. They became so long that they were a rushing contest, to see who can write and work the fastest and not who has the best brains and can think critically enough. To add to the pain and pressure, we were videotaped while taking the examinations (imagine?). The quizzes were also quite unbearable, but at least they were normalized based on a particular TA. \nIn conclusion, I am glad I am done with Turro, for eternity.\nWorkload:\nUngraded problem sets from the textbook (either too hard or too easy) and additional problems (better preparation tools for the tests) \nGrade is supposedly determined by performance on the following, which contain a mix of multiple choice (tricky!!!) and free response: \n7 Quizzes (25 pts each): Lowest two dropped, before rescaling to 100 pts\n4 midterms (100 pts each) \nFinal (\"essentially\" 200 pts)\nEach 100 pts is one equivalent, and the lowest two are not counted. The final CAN be dropped, if it is to your advantage.\nBy the end of the term though, he modified the scheme as he wished that none of us knew what happened anymore. What a mess.\n\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "December 10, 2010",
            "review_content": "\nAHHHHHH! Don't take this class!  It was a roller coaster ride of horror.  The first half of the semester was a complete joke; we covered like 2-3 easy chapters a month, skipping all kinds of sections and important material within the chapters that 99% of organic chemistry classes cover (acids/bases, MO Theory, RS Naming, mass spec).  At one point, he even said that he just wants to take his time, so he wouldn't race to cover material we don't get to and outlined the rest of the semester to include his prior orgo syllabus without chapters 10 & 11 (organohalides and synthesis/elimination reactions).  \nThen, Turro had an epiphany once everyone gave him bad reviews on the surveys, and he decided to make the class harder.  His logic was apparently that since everyone finished the first two tests 10-20 minutes early, he would double the length of the third test.  Obviously everyone raced to finish NMR questions that were now harder than Cornish's and most still failed to do so.  By this point, we had 3 weeks left of class, and had learned a grand total of 1 reaction, but Turro then decided that he would complete his full syllabus after all!  We again raced through 4 chapters of reactions without learning much logic at all behind them and were given a fourth midterm on more material then the other 3 midterms combined.  For some reason, it was surprising to Turro that we proceeded to do badly, so his \"final review\" consisted of him throwing test questions from the fourth midterm on the projector screen and asking us \"Is this a fair question?!  Why didn't you get it right?!\"  Although the published averages for the tests were 84,88,74,and 74, few people know that the exam 4 average was actually 64 and that Turro threw out data points below 50 \"because those people don't care about the course.\"  Still, this wouldn't be so bad if the class wasn't COMPLETELY UNCURVED aside from dropping 2 equivalents out of each of the four midterms, recitation quizzes, and the final (which is two).  Thus, 90% of the class will end up dropping midterms 3 & 4 regardless of how they did compared to the mean since whoever is running this course is too stupid to realize that the exams should be adjusted (up or down) to have averages that are the same if you are going to allow people to drop tests.  As it stands, I might as well not have even taken the fourth midterm even though I scored 20 points above the (real) average.  \nAlso, note that the course is effectively ran by Judy, a grad student in Turro's lab who sent us 75 broadcasts and counting throughout the semester by email.  Getting twice daily emails from her was delightful, but I feel like my other classes distribute the same amount of information to me without needing to do so.  Also, all of my emails to Turro were redirected to her, and all  the other TAs claim to know nothing about what will be covered in the course, how the test will be formatted, etc. except her.  This wouldn't be so bad if she wasn't incredibly ambiguous.  If you ask her if you can take a midterm early, she says, \"See the course page\" rather than \"no\".  If you ask if we have to know the precise solvents for all 100 reactions we learned in 3 weeks, she'll say \"was in the book, lecture, and/or recitation?  If not, you probably don't need to know them, but if so, it's fair game.\"  Just say yes; why do you have to make your responses into riddles?\nBut yeah, I think that about covers it.  Maybe Turro will figure out what to do next year, but right now, I feel like I learned less than the other classes but had just as much work, except it was all crammed into the end of the semester when I was busiest.  Also, I pretty much learned everything on my own because Turro just throws figures up from our textbook into his slideshow.  I kind of felt bad that attendance at lectures plummeted by the end of the semester, and no one could even answer his easy in-class questions about the reactions on the previous slide because the people who showed up weren't really listening.  On the positive, he showed up a funny chemistry jock video on the first and last day of class, which was really funny!  But since you can find that on your own, take Cornish or Doubleday; don't do this to yourself!\nWorkload:\nNo official homework but problems for each chapter that get posted, sometimes with additional problems from other textbooks.  7 recitation quizzes, four midterms, and a final. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "March 25, 2009",
            "review_content": "\nWhether or not you should take this class depends on your view of chemistry, how much you would like to learn, and how much work you have for other classes.  Prof. Turro is a mediocre lecturer at best.  He attempts to shake things up with a funny slide or a cool demonstration on occasion, but for the most part, lectures are useless in terms of learning new material.  Do yourself a favor and don't bother attending because they tell you little that the book doesn't (with the exception of the lectures at the end of the semester...those you should attend).\nYou will learn a good amount of material in this course if you have little or no previous chemistry experience.  Otherwise you will probably just coast, which isn't bad either if you are just fulfilling a requirement.  Exams and quizzes are meant to see if you have been keeping up with the practice problems.  These problems are called homework but in no way affect your final grade.  However, it is in your best interest to look them over and understand them.  They WILL appear on the exams and quizzes (many times in exactly the same form).\nYour final grade is split up into 6 equivelants (one gets dropped, leaving 5 worth 20% each).  Each exam (there are 3) is worth one, a total of your quiz grades (one quiz is dropped) is worth one, and the final is worth two.  The exams and quizzes place an emphasis on \"special cases\" in the material as well as concepts that Prof. Turro deem \"important.\"  Know all of these.  The final is slightly tougher, but still a fair review of the course.\nIf you feel at least semi-comfortable with chem and don't want or need to learn a ton, take the course and don't bother going to lectures.  I got an A in the course with a minimal amount of effort and I am by no means a chem major.  Otherwise, if you need a more fulfilling chemistry experience, find someone else.\nWorkload:\nVery manageable.  Homework optional (but worth looking over).  3 reasonable exams.  Regular recitation quizzes.  Weekly recitation sections encouraged, but not required.  Final also reasonable.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "February 17, 2009",
            "review_content": "\nThis class was a joke and so is Prof. Turro. You have to get used to him and his style of lecturing if you are to not die of boredom in class. The first 2.5 months, I went to class about once every 3 weeks since I found it so useless. However, I failed the second midterm miserably (despite knowing the book backwards and forwards) because Turro took all of the example questions from class (most of which were exceptions to rules) and put them on the exam. \nAfter that mishap, I gave him a chance and started going to every lecture. Eventually, I found myself enjoying lecture and following along with his messy powerpoint presentations. Like I said, you just have to get used to him. By going to lecture and reading the book, I felt like I learned a lot. If you learn how to follow his lectures, he will teach you. However, I find that most people get frustrated the first week by his style, that they never give him a chance and so they don't utilize him as a resource. \nHe would give out optional homework every week (not for credit) and a practice exam before each exam (get extra credit if you score 80% or higher) - all are multiple choice. I recommend you do these, because he repeats a lot of the questions. About 90% of the final was made up of old questions. I finished the final in 30 minutes without even reading most of the questions, since I had seen them so many times before. \nThis class is an easy A for people who put in a little bit of work and who are willing to read the book. Turro can be very helpful and clear if you learn how to decipher his style of lecture, and I would recommend you take him if you are willing to give him a shot. \nFinally, one student summarized the class perfectly at the end of the semester:\n\"If I had one more hour to live....I would spend that one hour in Professor Turro's Gen.Chem. class....because an hour in Turro's class...is eternity!\"\nWorkload:\nNonexistant - optional MCQ homeworks, which I would do the night before the exam and memorize the answers\nThree very easy midterms if you review the homework - not hard at all to get 100%\nOne even easier final - he basically combined the easiest questions from the homework and from the midterms into one test. I got an A+ on it with no effort. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 26, 2009",
            "review_content": "\nTurro does a passable job of teaching the material, trying to keep the class light-hearted enough (wearing a Fantasia wizard hat, playing Flight of the Valkyries, random class videos, etc.). In terms of material, just stay awake in lectures and most importantly, do the practice tests. The three midterms are based VERY heavily on the questions on the practice tests, at times being the exact same questions. Recitation TAs are spotty. While some may not know too much (and basically admit to it), they're nice people and aren't here to sabotage your grade.\nAll things considered, Turro is an above-average professor whose primary concern is molding your young malleable mind into thinking in different ways. The intention is there, even if the presentation is so-so.\nWorkload:\nHomework sets (not graded, but are seen often on tests), practice tests before midterms (extremely helpful, the one thing you need to study even if you never attended lecture), 3 midterms worth one test equivalent each, 5 recitation quizzes worth one test equivalent (easy), and 1 final worth 2 test equivalents. Overall very light and extremely manageable.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 22, 2009",
            "review_content": "\nNick Turro is a sweet man, but a very boring lecturer.  Also, the lectures he posts online are often quite different from the ones actually given in lecture, with a mix of extra slides, missing slides, and out of order slides, which is generally irritating if your trying to take notes on a print out of the given lecture.  \nI thought that the tests/homeworks/quizzes, etc. were difficult until I realized the secret: he reuses the exact same questions (same question, same numbers, same answer options in the same order) over and over again.  One question appear on a quiz, on a homework, on a practice exam, on a midterm, and on the final.  By the time I took the final, I'd already seen probably 70% of those questions before.  Yes, this made it easier to get a better grade.  No, this did not help me learn how to actually do the problems (ie learn the subject matter), since I didn't have to know how I got the answer after a while, I only had to remember what the answer was.  \nSo, not too hard to do pretty well if you pay attention.  Far more important than going to lecture is doing every homework, every practice exam, and taking every quiz (your graded on those last ones, any way).  With that, you'll do fine.  You should know the material anyway (read the book!), but the exams will be much more familiar than you'd expect.  \nWorkload:\nNormal gen chem procedure (6 20 point equivalents, lowest one gets dropped.  One is quizzes, three are midterms, two is the final).  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 13, 2009",
            "review_content": "\nThe class was really easy, perhaps the hardest part of it was to stay awake/focused for the entire duration of the lecture. Frankly, the only reason I went to (or attempted) to go to every lecture was because you can get extra point with the clicker questions that pop out two or three times during the entire lecture. \nThe materials are completely different from those learned in AP Chem, so you would have to actually study on your own. That said, it's fairly easy because all you have to do well is to read over the chapter section once, and then memorize every single problems on the homework and practice midterms he posts on coursework. It's an easy A if that's what you are looking for. \nWorkload:\nVery easy, all hw and practice tests are optional. Go through every homework set and practice midterm. And submit those early too to get some bonus points.\n3 very similar midterms. 1 final that's based on all the midterms (2 midterm equivalent). 5 recitation quizzes (drop 1). Drop one test for final grade.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 15, 2008",
            "review_content": "\nNicholas Turro is the worst teacher I have ever had. His lectures are the most boring I've ever heard. He reads his powerpoint out loud. His homeworks are all multiple choice and totally useless. I can't say anything bad enough about this class. Its only redeeming aspect is that St. Nick clearly wants us all to learn. Also, my TA Ben \"ya I don't know\" Dach doesn't know chemistry.\nGoing to class is completely pointless. You are better off reading the book and doing the homeworks. I haven't taken the final yet, but the midterms were all taken from homeworks and the practice exams.\nWorkload:\nLight, but confusing. Good luck figuring out which sections in the book you're supposed to read.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "September 08, 2007",
            "review_content": "\nThis class was easy, and Turro's lectures were fine, but overall I felt this class was poorly taught.  A lot of the exam questions were sort of like trivia questions.  If you do the practice exams you should be able to figure out which trivia questions will be on the test, but this class will not prepare you for the MCAT at all.\nThe biggest indication that this class was poorly taught was that there were \"broken\" questions on every single exam, i.e. questions that had no correct answer or more than one correct answer.  Couldn't someone proofread the tests just once?  Also, my TA was shockingly bad (in contrast to my TA from Flynn's second semester class).\nI would recommend this class because it was so easy (I got an A+), but this is not a good class.\nWorkload:\nPretty light for a premed class.  Just do the practice exams and the previous years' exams.  You don't really need to do the problems from the book; Turro's questions are much more useful.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "August 27, 2007",
            "review_content": "\nAmazing professor. Makes everythings simple to understand. No need to read the text if you go to lectures and listen. Sample exams are very similar to actual exams; make sure you can do every question on the sample exam.\nWorkload:\nLight. Attend lecture. Do practice questions. No cure, but very possible to ace the exams.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "February 08, 2007",
            "review_content": "\nI was so excited when I was able to register for Turro's class. After reading past reviews, I breathed a deep sigh of relief, thankful that I had gotten into the class with the \"easy professor\". However, while I don't doubt that Turro used to be the easy professor, he no longer is. Tests are not straight from the practice exams like many people have said. They were usually quite different. Many questions were tricky and wordy and often times there were just blatant errors and inconsistencies in both the practice exams and the actual exams. His lectures were horrible and pointless to go to since he basically just read his powerpoints (which he posts online) out loud. The biggest problem with the course was that the notes and the exams seemed like they were structured around the last textbook they used in chem. Apparently, we were the first class to be using the new (blue and yellow) text book. This made certain questions on the test extremely difficult. Some of the questions touched on facts or concepts that were not emphasized as an important part of the chapter (and were probably more important in the previous text). For example, there would be questions about concepts that the textbook only briefly mentioned in a sentence or two and that anyone would have just overlooked. This is a huge problem since there are only 20-30 questions per test so each wrong answer will significantly drop your grade. Also, Turro doesn't curve. Many of the students, including myself, were very stressed by the end of the semester. Hopefully this course becomes more synchronized with the text by next semester. Otherwise, good luck! Also, both TAs were horrible!!!\nWorkload:\nHe calculates the grades in \"100 point\" equivalents. There are 3 midterms (each worth 100 points or 1 equivalent), 6 or 7 quizzes in recitation (drop lowest quiz grade and the rest of the grades combine to equal 100 points or 1 equivalent), a final (worth 200 points or 2 equivalents). Turro drops your lowest \"equivalent\" when he calculates your grade (either 1 midterm, all your quizzes, or 1/2 of the final). Homework is not mandatory but you should do it. I rewrote each chapter in my own words (takes forever), did all of my homework plus extra problems, and studied with a chem tutor once a week for an hour. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 14, 2007",
            "review_content": "\nI have no idea why Turro gets such positive reviews.  Are there really two Turros, and did I get the evil twin instead?\nThe main thing you should get out of your mind is the idea that Turro is Â“easy.Â” He may have been in the past, but thatÂ’s no longer true.  One major reason:  HE NO LONGER CURVES, AND TO GET AN A IN HIS CLASS YOU NEED A 95 AVERAGE ON THE TESTS.  That alone should be enough to scare away most people.  But if it doesnÂ’t, hear this:  your ability to score highly on his tests has practically nothing to do with your knowledge of chemistry.  In fact, studying chemistry will no nothing at all to improve your grade, and may even hurt it.\nSo whatÂ’s wrong with this professor?\n1.\tHeÂ’s a mediocre lecturer, at best.\n2.\tHeÂ’s lazy and makes a lot of mistakes, which he often doesnÂ’t bother to correct.\n3.\tAlthough he thinks of himself as some sort of father figure to the students, he actually doesnÂ’t care about them very much.\n**4.\tHis tests.  This was the #1 bone of contention of every student in the class.  The problem isnÂ’t that they are difficult [in which case studying would presumably help].  Rather, theyÂ’re so badly written that you will often be struggling to figure out what the questions mean.  And this guy doesnÂ’t seem to speak English (at least as defined by WebsterÂ’s dictionary).  So if you rely on the standard meaning of words and phrases to interpret his questions, you will usually get them wrong. The only thing that works is studying TurroÂ’s old tests to get an idea of what questions he might ask, and what HE thinks the right answers are.  And since his midterms only have 25 questions, if you blow just one question, there goes your chance of an A. (Remember, in this guyÂ’s world an A is a 95, although he didnÂ’t actually tell us that until the end of the semester).\nThere was practically an armed revolt in the class after the third midterm.  The class average had been 80 on the first test and 84 on the second, but on the third it went down to 72.  No, we didnÂ’t get stupider, his test was riddled with flawed questions.  He ended up retracting 3 of them, but there were at least a couple of others that should have been changed.  The uproar must have made an impression on him, because the final was much more reasonable, but the damage was already done from those lousy midterms (60% of the grade).\nBottom line, you MAY learn some chemistry in this class.  But be warned:  your grade might as well have come from a random number generator.\n\nWorkload:\nGets increasingly heavy as the semester goes on.  He introduced some extremely difficult material late in the semester and hardly taught it at all, so you were more or less on your own.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 17, 2006",
            "review_content": "\nEveryone fights over getting into this class because they hear the class is easy. However, go to the class mid-\nsemester and there are only about 40 people in that huge lecture hall. This is because Turro relies almost exclusively on disorganized powerpoint lectures, which he reads too quickly (and quietly) for you to understand anyway. And if you don't understand and want to, you probably shouldn't ask him questions. Because he'll tell you to email the TA's or his assistant or some other grad students, pretty much anyone but himself. Its not as easy as everyone says; the average was around 80 throughout which sounds high, but considering how much of the problems are regurgitated from the practices tests....the practice tests, by the way, often contain errors. so he'll send you emails for each correction. sometimes you'll get 5 emails. in one afternoon.  \nWorkload:\nalmost non-existent, you could only print out practice exams the day before the test and figure how to do all the problems and still get a b-plus at least...probably need to really read the book and absorb the random trivia for the high a. (by the way, his lectures are based on the book they used years ago, so they don't match up. )\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "September 03, 2006",
            "review_content": "\nI thought the class was pretty great.  Turro's voice was a bit too soft at times but the lectures were on powerpoints so that wasn't a problem.  The powerpoints were really helpful and because they were online you can skip a couple classes.  Actually, I can't praise the powerpoints enough, they were very thorough and really helped explain the textbook.  And his midterms are strictly based on the concepts on the powerpoints.  if not for the recitation quizzes, the textbook is almost unnecessary for this semester of chem. \nWorkload:\nThe recitation quizzes were surprising easy and straight from the book.  As many have mentioned, 90% of the midterm questions are from his practice problems.  I honestly cannot understand how anyone got below a 21/25 on the midterms (he showed the grade distributions after every test) since at least 21/25 questions were straight from the practice. And there's extra credit for doing the practice tests.  And sure, there are a couple new questions and the final was all new, but those weren't in any way tricky and were in the style of the giveaway midterm questions.  So no problems there.  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "August 06, 2006",
            "review_content": "\nI don't have much to add except to tell you future students that what other reviewers said about the midterms and final is absolutely true: the midterms are mostly from the practice tests and the final is almost completely original. It's not material you haven't seen before, but you can't breeze through it like you can the midterms (I finished one in 20 minutes with a 24/25). Learn the material well for the final! Despite the warnings on CUPLA, the final was a little more difficult than I expected.\nThe killer part of the class is the recitation quizzes. These are written by the TAs, so try to get a good one. I blew an easy A because I didn't prepare enough for the quizzes and final.\nTurro is a good teacher. He sounds like Coach Z, which is entertaining sometimes. \nWorkload:\nIf you're a science person this class should be pretty easy. For premeds who hate science... well, why are you premed? For people taking this for their science requirement: this is not a very difficult course and it doesn't require much math. The textbook is a mixed bag; some chapters are great while others are a mess. Borrow another textbook from reserves for help. Problem sets aren't collected but you should do them; they don't take long. Three midterms and a final as discussed above.\n"
        },
        {
            "course_name": "Chemistry I",
            "review_date": "January 05, 2006",
            "review_content": "\nI really loved this professor.  If you pay attention, his lectures will really clarify things that may not have been so clear in the text.  He's also very sweet and funny.  There is no curve in this class because he doesn't want students competing with each other, he wants us to learn together. An A is very attainable but I wouldn't say it's easy to earn.  You will work for it.  The majority of the test questions come straight off of the practice exams.  The questions you've never seen before are the ones that separate the B's from the A's.  They are not meant to trick you.  If you understand what's going on, you should be able to get them.  Turro is a great teacher.  You will learn enormous amounts if you take his class seriously and you'll have the grade to match.  He truly wants you to succeed.  I probably averaged around 10 hours a week of studying and got an A (I'd never taken chemistry before).  Don't bother with the other chemistry teachers.  I had friends in other sections who were ripping their hair out because they had fussy, tricky teachers.  It's just not worth it.  Take Turro, he's wonderful.  I just wish he were teaching Chem II next semester.  \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 19, 2005",
            "review_content": "\nOk, so here's the whole truth - read it all if you really wanna take this class with him..\nif you dont like chemistry and you sit way up in the auditorium, i guaranty you'll fall a sleep. this is not a way to study chemistry. even more so, the sound is so bad (especially with the mic.) that you cant understand a word! if you want to get something out of this class and not waste your time (and money), sit in the front and take notes! the best way is to print his lectures before hand (he post it a day before) and write on the printed version. \nanother helpful tip is to go over the lecture slides BEFORE class! this way, you have SOME idea of what he's talking about and so the lecture will go much faster! \nyes. it is true - ALL his exams (INDLUCING THE FINAL which i took yesterday) are taken from his practice exams. HOWEVER! dont fool yourself. these questions account for only 80 - 85% of the exam. so if you want to get an A- or an A, you need to put a little bit more effort. nothing more. so lets say you have 30 questions in the exam (all are multiple choice by the way ), you will have 5-6 \"new\" questions you have never seen before. DONT WORRY - these are not brain-surgery questions. if you understand the answers for the practice exams, there is no reason why you should not be able to solve these ones.\n(those of you who never took chemistry before might have to work a bit harder to get it... )\nThe exams are REALLY FAIR!!! its stuff you're suppose to know from the lecture slides and the book. (oh yeah - the textbook is HORRIBLE!!! i had to refer to other text books.. its really impossible to understand it!!)...\nSo yeah, he wants you to succeed, but its all up to how much effort you are willing to put in. if you're good with a B, you dont need to do much just to memorize the practice exams.\nMAJOR MAJOR THING - YOU HAVE TO GET A GOOD T.A~!!! mine was the easier one of the two and THAT made a huge (!!) difference! you have 8 quizzes out of which 5 best are counted. (this means you have a quiz EVERY WEEK except weeks where you have the exams). so get a GOOD T.A - it really makes the difference, and GO TO THEIR OFFICE HOURS! crucial!!\nregarding H.W.... well, its kind of a way for you to test yourself and see if you got it. no question from H.W is given in the exam, but if you can solve them you're good for the test. the H.W for the last chapters (24,25) are really challenging and you dont really have to know them all..\ni cant tell if Turro is better than any other prof. cuz i havent taken anyone else.. yet... but his lectures are NOT THAT BORING!! i actually found him HILLARIOUS! if you listen to the lecture you will catch up some of his REALLY FUNNY remarks... and the class experiments were REALLY COOL!\nI personally hated (!!!!!) chemistry before i took this class... now im fascinated by it. \nthe bottom line is that its all about your attitude. So if you realize that there is no way out, and you come with a positive attitude, not only will you learn something and get a good grade, but you will also enjoy the class.\nWorkload:\n3 exams, one final (not THAT BAD!!! - most questions are taken out of the practice exams) 8 quizzes (5 best count) dont have to hand over H.W but its recommended. not extra credit work though he does give you points for filling out a \"survey\" after each exam. FAIR CLASS!\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "February 16, 2005",
            "review_content": "\neasiest professor in the world...midterms are exactly like the practice exams so just memorize those.  (dont even need to read the book).  but itll catch up to you in the final, where you have to actually know the material.\n i pretty much skimmed the chapters and memorized the practice exam...ended up with an A+....so if you take turro, no need to stress and haved a kick back semester.\nits a self studying class...n get a good TA....i crasehd kathleen's section although she wasnt my TA cuz mine sucked....\nfor those who said this class is hard...i dunno wat to say becuz i think this is by far the easiest class you will encounter if you are premd (as i am)...if you cant pull an A in this class, mebbe you should rethink the whole medical school thing\ni do recommend him becuz he is easy, but for those who thrive on structured and well organized courses, maybe this is not for you.  and if you want to actually learn something, mebbe go with mcdermott.\nWorkload:\n3 super easy midterms, one more challengin midterms, 8 easy quizzes...no hw\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 02, 2005",
            "review_content": "\nthis guy is super easy, only tests the concepts, and repeats the questions from the practice tests on all of the exams... you get to drop your lowest exam grade even if it is the grade obtained by adding up your highest 5 of 8 quizzes given in the rec sessions... he is a good teacher though and he just wants to giv eyou a good basis... its basically high shcool chem in a semester, but not even that difficult... all of the questions on the exams are multiple choice and easy... the lectures arent super fun but they are sometimes interesting and provide information that helps you figure out what you read in the text book..... good luck-- turro is easy. fine is hard. and even though fine requires you to learn more, (my roomate had him), i still think the turro kids learn more because they actually know the basic concepts of chemistry rather than only understanding fractions of complex concepts.... \nWorkload:\n3 midterms, a final, 8 easy quizzes... (take kathleen kristian if she's available as a TA), and thats it... readings and homework problems are assigned but you arent required to turn anything in, lowest grade is dropped... \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 26, 2004",
            "review_content": "\nin my opinion, he is boring, incomprehensible and unorganized.  \nfor example, he would send out practice exams and it would contain 5 errors, then he would send out another copy, and this one would have errors in it too....besically, i had to go to office hours of TAs to clarify a lot of the \"broken\" questions.\nhis lecture does not help you at all.  consider this to be a self studying class.  when you goto lecture, you will only understand what he is saying if you already know that chapter.  otherwise, obscure and difficult.  for me, i crashed extra recitation in order to grasp concepts that were vague in the textbook.\nmidterms are very very very easy, but the final is not as easy.  although i havent got my grade yet, i believe this class is one of the easiest.  compare to fine, people in my class had a vacation while fine students suffered.  and this rumor about the FINAL being impossible....nonsense.  it wasnt hard.  it was just harder than midterms because it actually had some questions you had to think(rather than spit back what you memorized in practice exams) \nall in all, i recommend Turro for the pure lack of good alternatives, and the ridiculously easy tests. (he gave us everything we asked for on test, for example, all the functional groups, amino acids, IR and NMR spectra...basically we didnt need to memorize ANYTHING)\nin terms of no curve for grading, it doesnt matter because you get to drop 1 of the following (a midterm, half of final, or top 5 quiz scores) .  i ended up sropping final becuase i had 98% with everything else.  again, a piece of cake.\nif you want an easy semester, take him.  \nWorkload:\neasy.  weekly quizzes (only top 5 matter), 3 midterms (a joke) and a final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 19, 2004",
            "review_content": "\nIn my opinion the hardest of the three chem professors for one reason....no curve...the midterms straight out  the practice exams and the final is absurd...just wrong...the quiz grade is based soley on your TA...you either have the easy one of the hard one...very subjective...watch out for his final it hurts\nWorkload:\nweekly quiz, 3 midterms, and a final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 16, 2004",
            "review_content": "\nTurro is a very boring professor. Most people fall asleep in class, or have learned to just skip it altogether because you learn more by reading the textbook. It is easy to get lost in the classes, and difficult to understand what he's doing because he jumps around very quickly. The midterms come pretty much straight out of the practice exams, so memorize the answers and you'll be fine! However, the final was very difficult, and even if you memorized every single practice question from the entire semester, it will only be good for about 15/75 questions. The final is unfair because it is much more difficult than the midterms and goes beyond what was learned in class.\nWorkload:\noptional homework, weekly quizzes in recitation, 3 midterms, and a final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 18, 2004",
            "review_content": "\nNicholas Turro is the best teacher for this course. He is friendly and entertaining, and fills his lectures with a variety of experiments, movies, and demonstrations. He tries hard to make the class fun. For example, the TAs took pictures of us on the first day of recitation, and when the semester ended these were shown as a slide show to sentimental music. \nHe goes out of his way to ensure that students don't have to work too hard. He gave away bonus points for just about anything: doing online practice tests, filling out surveys, etc.  He maintains the courseworks website so that it always has relevant information. Test questions are always from the online practice tests. Before tests he has a online discussion board on which he or his TAs answer questions posted by students. \nIf that wasn't enough, he even makes it easy to drop a midterm or decrease the importance of the final. If you think all this makes the class too easy which means you'll get screwed by the curve, relax. There is NO CURVE. \nI got an A- in this class, only because I got really lazy. I also didn't pay attention during his lectures. If you avoid these mistakes, the class is geared to get you an A. Make sure you take this professor.\n\nWorkload:\n3 midterms (you can drop one) and a final. 8 quizzes in recitation (you can drop 3). Homework which is not to be submitted.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 13, 2004",
            "review_content": "\nYes, it's true. At first, all the people in Turro's class thought they were the chosen ones. While those in Fine and McDermott's class slaved over the textbook, those in Turro's class laughed and then went their merry way, practice questions in hand. Midterms came and went, Turro's flock barely having raised an eyebrow, Fine's children cursing our names. Then... the FINAL came... and the moans that rose up out of Havemeyer 309 were worse than those during the Black Death! The pages flipped as each student searched desperately... where were the practice question... where were they? Their minds raced... \"Oh my God\" they thought... WE HAVE TO ACTUALLY DO SOME CHEMISTRY. Heads down, they went up to the TA's to hand in the exam with somber faces... THey knew that coupled with no curve in Turro's class, they had failed. \nOk, so, here's the deal. I hope you liked my dramatic story, because ask anyone in Turro's class... that's EXACTLY how it was. Turro started off with every midterm EXACTLY from the practice questions. And then he screwed the whole class. I'm beginning to think someone from the chem department saw the culpa review that some jerk did in november and chastised Turro for it. Nonetheless, be careful. While it was very unfair for Turro to do that to us, the tests, even without the practice questions, were fair. It was just that no one studied all that much because the practice questions were there. Anyway, word to the wise... he was still better than Fine or McDermott, but don't slack off if he decides to pull a fast one again. \nWorkload:\nStandard.. 3 midterms and a final, one test gets dropped. HOwever, he calculated the grades differently than he said he would. Oh, make sure you get a good TA. THey make all the difference.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 07, 2004",
            "review_content": "\nOne bloody awful professor. Highly disorganized. Comes to class and pulls material randomly out of his butt. I heard him repeat the same lecture three times in a row. Also, he obviously knows what the hell he's talking about but doesn't communicate it well at all. People lost him about a month before the end of the term. Also, he doesn't curve the class and the final is an unrealisitically hard killer. I've heard horror stories of Lenny Fine, but this is one professor I wouldn't recommend to my worst enemy.\nWorkload:\n3 midterms, easy/hard depending on if you memorized the practice exams, 1 final which is impossible, no curve.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 19, 2003",
            "review_content": "\nGreat guy! Bad Professor! He's really funny and his lectures on ocassion are fun. Most of the time, you sit there wondering wut the F**K is he talking about. On average he covers about 1/3 of the material you are going to need for the midterms/exam. The 3 midterms are easy becasue he takes all of the questions from the practice questions he gives you. However, he makes the final impossible, consisiting of question you have never seen. Gotta do your reading or pay attention on lecture since there are weekly quizzes in recitation. They are usually easy of you read or went to lecture. \nWorkload:\nproblem sets by chapter (not collected), 3 midterms, and final (drops one grade)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 14, 2003",
            "review_content": "\nBEWARE!! His lectures start out fascinating and engrossing but quickly become incomprehensible after the second midterm. For the three midterm exams, he takes almost all (like 20-23 out of 25) questions from the practice exams to lull you into a false sense of complacency. This, combined with thte fact that he lectures on a PhD level but gives the first three midterms on a high school level really skews your perception of the course, how to understand his lectures, and how to study for exams. Then, BAM!, for the final, you have a long crazy exam with MUCH HARDER questions and very few (< 5 out of 75) questions taken from the practice exam.\nWorkload:\n3 midterms, easy as pie. One final, deadlier than a black mamba inside a nightshade bush on Venus.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "November 01, 2003",
            "review_content": "\nEXCELLENT! His lectures are interesting (whether you like science or not) and he is always prepared. You can ask questions during lecture. He is so into Chemistry that it makes you want to be into it too (if you're not already). He grades very fairly, and the problems on the tests are never a surprise. He gives you long practice problem sets to do before each test, and he takes the questions for his test from the packets! So basically, you get the test before you take it. I recommend Turro 100%.\nWorkload:\nThere are weekly quizzes in the recitation, which requires you to read the text book, but otherwise there's nothing.\n"
        },
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "January 24, 2002",
            "review_content": "\nWell prepared and well organized lectures. He maintains a good course webpage, and provides ample study materials. A description of C3045 with Prof. Turro as a happy journey through carbocation land is accurate. His grading is fair.\nWorkload:\nWeekly problem sets, three exams, and a final. There is also a required recitation with a possibility of pop quizzes.\n"
        },
        {
            "course_name": "C3045 Intensive Organic Chemistry I (for freshmen)",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Turro is king of the theme-oriented lecture. Very little mechanism memorization is necessary after the first test, or so thought my class. The fact that last year's exam was entirely comprised of the posted historical exams makes me think that Turro assesses how well people do in class, and makes tests accordingly. He is eloquent and understanding. The office hours are always a help.\nWorkload:\nHW problem sets, 3 midterms, 1 final\n"
        }
    ]
}