{
    "prof_info": [
        {
            "prof_name": "Mariel Rodney",
            "prof_id": 10788,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 13, 2012",
            "review_content": "\nIf you have the opportunity to take Professor Rodney for UW you are in the hands of the kindest and most capable instructor one could ask for.  Ms. Rodney is thoughtful, caring, interesting, intelligent, and dedicated. As with any UW class there are 4 required essays which are all carefully explained and for which the students are completely prepared to write. The comments Ms. Rodney's students received on the drafts are  thoughtful and extensive...it is impossible not to improve as a writer in this class. The environment was engaging and at times wrought with humor and excitement. Ms. Rodney fosters the creative and inquisitive spirits of students who really want to be active in their studies, and if every class could be this positive CU would be a veritable utopia! In short, Ms. Rodney is a stellar professor. \nWorkload:\nWeekly readings, none too lengthy, the majority of which were extremely enjoyable. 4 papers, the first and fourth of which are not terribly long. Occasional in class prompts, all of which are super facile if you have read the assigned works...plus they are not graded anyhow, but count towards participation and can only help with each essay. Class participation is pretty major, and a simple way to help perk up your grade! \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2012",
            "review_content": "\nProfessor Rodney made University Writing fun and interesting. I heard from other students how their teachers threw the first essay at them with no warning or gave a lot of extra work. Professor Rodney however, made sure we understood from the first few classes what we were expected to write about. She's always available for questions and is very helpful if you need a little help in deciding what to write about or how to approach an idea. \nWe got the standard four essays for UW with an extra 3 short exercises for the first progression, 2 for the second, and barely anything else. These short exercises are little write-ups that ask you to answer some short questions. Nothing to worry about and since we never got a grade for them, I doubt they play a significant part in the final grade.\nClasses were very interesting because the essays Prof. Rodney chooses for use to read were overall, very engaging. There wasn't a lot of reading either; just enough for us to pick from a few for the essays. \nComments on rough drafts were very useful. Meeting her in person or emailing is also very helpful since her responses match exactly what she expects out of you for the final draft. \nOverall, I would definitely recommend Prof. Rodney. She made University Writing worthwhile instead of being a class to be dreaded like I heard UW was. \nWorkload:\nWe got the standard four essays for UW with an extra 3 short exercises for the first progression, 2 for the second, and an annotated bibliography and proposal for the research essay. The short exercises are little write-ups that ask you to answer some short questions. Nothing to worry about and since we never got a grade for them, I doubt they play a significant part in the final grade. We wrote short \"journal\" entries often in response to the reading in class, but these are not turned in and can be helpful for  the essays.\n"
        },
        {
            "course_name": "university writing",
            "review_date": "January 10, 2012",
            "review_content": "\nProfessor Rodney was hands down one of the best English teachers I have ever had. Even after having completed writing and comparative literature courses I had to take his course at Columbia because it is a requirement for everyone. Surprisingly, Professor Rodney successfully transformed what is usually mundane subject into a class that I looked forward to each time. The readings she chose for the course were not only interesting but also thought-provoking, and we were able to have some great class discussions around them. All in all, I would highly recommend her.\nWorkload:\n100% manageable.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 19, 2011",
            "review_content": "\nI had Mariel Rodney for University Writing, and she was the absolute ideal when it comes to University Writing teachers. Her grading was fair, she was never too pushy in class or discussion, and maintained a very cool and collected composure throughout the entire process.  She was very realistic about University Writing, never over-stressing its importance but still valuing its credibility. Her assignments were light and fair, and she made the essays and drafts seem far less arduous than most other University Writing professors.  While everyone else seemed to hate the class, I certainly didn't mind it at all, and I owe that largely in part to Ms. Rodney making it so enjoyable and painless. \nI would very highly recommend taking University Writing with Mariel Rodney.\nWorkload:\nThe normal, prescribed U Writing work load: four major essays, little ungraded assignments\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2011",
            "review_content": "\nMs. Rodney is AMAZING. I have heard so many complaints about U Writing, and I had a great experience 100% due to Ms. Rodney. She picks great texts to read and is really easy going about the final paper--most classes have to do something bizarre related to a \"seed text\"... Ms. Rodney let us write about whatever interested us, making the project much more enjoyable. That being said, she does expect a lot from her students, but it's worth it. \nWorkload:\nUsual UW workload: lens essay, convo essay, research paper, retrospective essay and various smaller writing assignments throughout. \n"
        }
    ]
}