{
    "prof_info": [
        {
            "prof_name": "Patricia Romeu",
            "prof_id": 2385,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Women & Film",
            "review_date": "May 05, 2005",
            "review_content": "\nSeriously, I'm a pretty enthusiastic student generally speaking and this is not a good class. I took Professor Romeu's class \"Women and Film\" two years ago, but I can see that not much has changed. It's pretty much the only class I've taken at Columbia/ Barnard that felt like a complete waste of time. Sure, you'll get some rudimentary training in film theory, but you'd probably learn far more in any film class. She was incredibly picky about the wrong things when it came to the writing assignments (i.e. \"you were supposed to write a personal essay and this isn't a personal essay, this is more like a review\"). Yet more than half the papers were graded by some dim-wit grad student. \n(Never fun...). The discussions were pretty low-level and, as another reviewer pointed out tended to center on what people \"felt\" or \"experienced\" when watching various movies rather than any more academic criteria for discussion.\nFinally, and this perhaps is a matter of personal taste, but I didn't really understand her choice of movies. Some were definitely typical women and gender studies movies (like Alien, and \"daughter's of the dust\") but there were many questionable choices on her part, and many potentially more interesting movies and directors that we could have discussed. Basically if a film doesn't fit professor Romeu's ideas about what goes in a Women and Film class, it will not be respected by her (this is highly pertinent to your final paper...) and if a film is in her class, well, then it must be a masterpiece. To sum it up: save your time and your money and do not take this class. Instead, take another women's studies class if that's what you're looking for, or take a film theory class, if that's what you wan't.  Stay away at all costs.\nWorkload:\nNot too bad if I remember correctly. But the criteria are kind of vague, and I never felt that I had a clear sense of what Prof. Romeu wanted, which made it next to impossible to do well on the \"mini papers.\"\n"
        },
        {
            "course_name": "Women & Film",
            "review_date": "April 18, 2005",
            "review_content": "\nHORRIBLE. This woman cannot teach.  This class has a lot of potential to be really interesting but she makes it boring.  She doesnt really have a lot to offer, the interesting points she makes are usually taken from the readings that were assigned.  The mini paper assignments are ridiculous and pointless.  She doesnt seem very schooled in film so being a film major it was painful to hear her attempt to teach it.  Basically I really hated her and found myself wanting to skip out on the class.    \nWorkload:\nWeekly readings which arent so bad.  Journal responses to each article. Three mini papers. a midterm paper and final paper.\n"
        },
        {
            "course_name": "Women & Film",
            "review_date": "March 29, 2005",
            "review_content": "\nHonestly I think that this class was the biggest waste of time.  Although the movies are sometimes interesting, the teacher, although seemingly sweet, is disorganized, bland, and only regurgitates what  is said in the reading.  If you have a different opinion than the one that she has or is offered in the reading she merely overlooks you and moves on to someone that will agree with her.  Her assignments seems like wastes of time rather than learning tools and although they are very \"happy\" assignments I would rather spend my time, if I am going to spend it, on something worth while.   I felt that she had knowledge in neither the field of film or the realm of women's studies. In discussion section I felt I learned more from the TA and the students than the actual teacher.  If you want a class that is late at night, wastes about 5 hours of your week, and that you want to sleep all the way through, then this is the class for you.  For a class whose subject is so interesting it is made incredibly boring.  \nWorkload:\na take home midterm and a final with a few 3-5 page papers in between.  \n"
        },
        {
            "course_name": "Women & Film",
            "review_date": "May 20, 2004",
            "review_content": "\nAn incredibly sweet woman, but not the best professor. While I did learn some very interesting aspects of film theory, as well as ways that cintematography can help advance crucial themes, we usually didn't get deep enough into a movie to truly understand it. Also, the presentations by students were essentially summaries of the reading, and thus wasted much time. I recommend the course, but just because it's fun.\nWorkload:\na few short papers, a midterm essay, a final essay. Medium readings per week.\n"
        },
        {
            "course_name": "Women & Film",
            "review_date": "February 24, 2004",
            "review_content": "\nIn my opinion, this woman does not come from an education background.  When she's speaking, she preaches her own ideas, and if she's not doing that, all she likes to talk about are people's personal opinions and personal experiences -- crap no one wants to hear because, really do we care about how this movie reminds you of your sister or an experience you had in summer camp? NO. \nShe doesn't know how to teach, bottom line. She's very rigid about what you write about in these mini-essays you write every few weeks. If it's not exactly what she wants she'll reject it. Clearly, she's not too interested in what the way her students' minds work because if she was, then she would understand that not everyone analyzes films and articles on her agenda. She LOVES her agenda and thinks of nothing else. There's hardly enough discussion on important topics. When it comes to important topics and interesting discussions, she likes to have everyone shut up and talk about her own analysis. \nThis woman turned an excellent course with great subject matter into an absolute burden. She's unstimulating and very amateur. This course would be better taught by someone else. \n\nWorkload:\nFOUR 2pg mini essays, ONE midterm essay, ONE short oral presentation, and ONE final oral presentation/essay.\n"
        }
    ]
}