{
    "prof_info": [
        {
            "prof_name": "Aaron Wallen",
            "prof_id": 12833,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Leadership In Organizations",
            "review_date": "January 23, 2014",
            "review_content": "\nThe material itself is interesting and easy to absorb, and in many ways it seems applicable to any career path.  The course goes over internal biases we have and how that affects behavior in organizational settings as well as \"what makes a good leader\".  Not 100% bullshit despite the title of the course.  I would say a significant amount of it is psych-related so if you have some psych background it might help.\nThe professor is a good lecturer but is very strict...He is a rather harsh, nitpicky grader and will ruthlessly take points off quizzes and exams if you do not have the right wording.  I would say all you need to do well on exams is to have great memorization skills, because he will specifically ask you what the main arguments and examples used by the authors in readings.  There's not that much critical thinking involved on the exams.  For the midterm, the average was in the low 80s and he refused to curve because he was \"content of the distribution of grades\", although he added like 5 overall points at the end of the semester.\nHe also takes attendance every class and requires you to complete mandatory surveys on Courseworks 4-5 times throughout the course, and if you forget to do them he take a point off for each survey you missed from your overall grade.\nI highly recommend making very detailed summaries on the readings after each session so you're not as overwhelmed right before a quiz or exam.  Can't really skim for a lot of these readings.\nTLDR: interesting material, harsh grading, best for seniors if you take it p/f\nWorkload:\nManageable but be sure to know your shit on the readings and lectures if you don't want to be screwed on the quizzes/midterm.\n"
        }
    ]
}