{
    "prof_info": [
        {
            "prof_name": "Aaron Fox",
            "prof_id": 1626,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": " The Social Science of Music",
            "review_date": "July 24, 2010",
            "review_content": "\nEh. Not my cup of tea. Yes, he's extremely intelligent, but I wish I had known beforehand that this was going to be a class on eskimos, because I wouldn't have registered. Seriously, that's 90% of what he talked about: his fieldwork in Alaska with the Inupiat eskimos, which is interesting, sure, but he trailed so far from anything related to the point of the course that half the time I just couldn't hold my attention. Lots of people seemed to like his teaching style, but I didn't take to it. It's more a class for sociologists/anthropologists than musicians - I identify with the latter. \nWorkload:\n1 final paper on a topic of your choice (20 pages)\n"
        },
        {
            "course_name": "Country Music, Music and Language",
            "review_date": "June 27, 2008",
            "review_content": "\nLinguist, musicologist, anthropologist, sociologist, and aesthete, Aaron Fox is a modern-day cross between Imhotep, Douglas Hofstadter, and your fun uncle who never grew up, never got a real job, and is far more stimulating than the remainder of your relatives for it.  Aaron's knowledge base is capacious and ecumenical - he oftentimes seems like a throwback to the days when it was possible to know everything - and both classes I took with him were relentlessly interdisciplinary, touching on topics as variegated as poetics in Baptist bars, Jakobson's six functions of communication, and the adaption of country music to Alaskan Inuits.\nAaron's classes are always laden with misnomers: for example, we read articles about music and language in Country Music, and Aaron's treatise on country music in Music and Language.  In general, anything Aaron teaches isn't so much about the topic at hand as it is about stuff Aaron knows about the topic, stuff Aaron could free-associate off of this knowledge, stuff Aaron could free-associate off the free-associations, and so on.  The first ten minutes of the first class of Country Music were a pretty reliable microcosm of Aaron's teaching style: one tangent follows another, each more fascinating and just as relevant to the topic at hand as the last.  Everything Aaron says is interesting.  This is the brilliance of his teaching style: it's not just the broad base of knowledge, but the connections between thereof, that makes a genius, and to sit in lecture for an hour and fifteen minutes twice a week to watch his mind work in unbounded creativity is endlessly stimulating and inspiring.  Accordingly, the workload comprises one paper (really as long as you want, and on whatever topic you want.)  Some of my classmates wrote about Tim McGraw, irony, and self-reflexivity in modern commercial country; I wrote about country music tropes and picaresque detective fiction in Coen brothers movies.  Whatever you choose as your topic, Aaron is always free for consultation.  A welcome change from the nanny state of most classes, Aaron's pedagogy is all about self-motivation, self-determination, and creativity - essentially a grad-level class in undergraduate dress.  Some will find the infinitude of choices to be baffling, but I loved it, and the first and second paper I've truly been proud of were legacies enough for what I thought was an awesome educational experience.  Categorically recommended.\nWorkload:\nWhatever you want it to be.\n"
        },
        {
            "course_name": "A History of Country Music",
            "review_date": "February 24, 2008",
            "review_content": "\nAaron is a fairly interesting lecturer- and is definitely one of the top in his field.  Its a really chill class- most of the time is spent listening to music or listening to him talk about his field work.\nWorkload:\nEASY! He assigns reading (but you never have to do the readings), but its fine to just read what interests you, he's sure to hit the high points during class.  The only written work was a paper (that wasn't even graded), a take-home midterm, and a final paper.  You have to put some work into the final paper, but he's a fair grader and is willing to look at drafts/help you along the way.\n"
        },
        {
            "course_name": "Music and Language",
            "review_date": "December 25, 2003",
            "review_content": "\nProfessor Fox is one of the few people who have made my experience at Columbia memorable.  He is a fascinating man who bases his knowledge in the subject not only on his studies in classrooms, but on his field work in which he immersed himself in a different culture.  Professor Fox explains the theories of the relationship between music and language and then goes on to show real life examples through his research plus that of fellow colleagues.  Perhaps the most amazing thing about Prof. Fox though, is his relationship with his students.  I have never met a professor that is so open to random walk-ins in his office without prior appointment.  He is friendly with each student and is genuinely interested in the work that his students do.  To be honest, it sometimes feels as if he sees you less as a student and more as a peer.  He will go out of his way to find resources that a student may need for research, etc....  Class is never anything less than entertaining, though still informative.  Attendance is important, as there is no textbook, but he does offer a class webpage that contains the materials (papers, songs, etc....) used in the class.  If at all possible, TAKE A CLASS WITH PROFESSOR FOX!!!!!  It will be a class in your Columbia career that you will not forget.\nWorkload:\nShort research report / article summary, final paper that is open to any topic the student chooses as long as it is revelant to the course.  Generous/Fair grader.\n"
        },
        {
            "course_name": "Musics of India and West Asia",
            "review_date": "November 07, 2003",
            "review_content": "\nThis class is a serious exploration into\nmusical culture.  Prof. Fox has a specific style of teaching that is rich and interesting.  He has a huge knowledge base.  Prepare to learn more than you expected. This class is really an ethnomusicology class with a lot of reading, listening, and attention to detail.\nWorkload:\na concert review, a research paper, a midterm, and a final\n"
        },
        {
            "course_name": "Music and Language",
            "review_date": "May 30, 2003",
            "review_content": "\nProfessor Fox is really cool and I recommend him highly.  Some students have a hard time with the fact that his classes aren't formal, but that's exactly why everbody else loves him.  He runs a fun class in which you aren't itching to go home.  And for those who don't wake up early: I've never seen a class of his listed to start before 5:30.\nWorkload:\nLight.  Basically one oral presentation and a fifteen-page paper as the final.  No tests.  And he's a VERY generous grader.\n"
        },
        {
            "course_name": "Music and Language",
            "review_date": "May 14, 2003",
            "review_content": "\nThere are many good things to say about Aaron Fox, and many bad things. Overall, I think the good outweighs the bad. He's probably one of the two or three most brilliant people I've encountered at Columbia, and this class is a fascinating fusion of almost every academic discipline. (I bet you never thought Marina Cords's monkey sex class would come into play in a course in the music department!) He's also a likeable, very funny guy with a badass-rebel streak. The trouble with Aaron is that he is wildly, hopelessly disorganized. We never started class on time because he was always futzing with his uncooperative laptop; he went off on tangents constantly and talked himself in circles when he was able to stay on task; and we didn't cover half the stuff on the syllabus. But again, he's blindingly brilliant, and he's got a lot of interesting and relevant things to say if you pay close enough attention. And the theory that he did talk about, he explained very thoroughly and clearly. Also, this was his first time teaching the class, and he threw the syllabus together rather quickly after finishing a book over winter break. Some suggestions for the future, for whoever's reading this: 1) the class should meet once a week for 2 hours, not twice a week for an hour and 15 minutes. If it met on a seminar schedule, Aaron's digressions wouldn't eat up entire class meetings, and we'd be able to delve more deeply into the difficult theory presented here. 2) Integrate the theory and the empirical reading. All the reading before spring break was theory, everything after was empirical. The thousands of pages of theory, bereft of context, were overwhelming, especially for those in the class without a strong anthro background. 3) Narrow down the course content. \"Music and language\" is an exceedingly broad topic, and I doubt that even an organized professor could have covered all the ground that Aaron tried to. Overall, despite the frustrations, this is a good class for those with a SERIOUS interest in musicology on a very abstract level. Those looking for a random cool elective will probably find it tedious. \nWorkload:\nTONS of reading, much of it extremely dense, but he won't get to half of it. 20-pp. research paper about anything you want that is fun to write, and Aaron will help you a lot on it. No exams.\n"
        }
    ]
}