{
    "prof_info": [
        {
            "prof_name": "Kate Glasner",
            "prof_id": 707,
            "total_reviews": 30
        }
    ],
    "reviews": [
        {
            "course_name": "Dance in New York City",
            "review_date": "August 30, 2015",
            "review_content": "\nI've never reviewed a class, but after reading the comment bellow on Katie's Dance in New York class I felt like I had to respond. The reviewer clearly had some sort of dispute, because Katie's Dance in New York class was fantastic! She clearly cared about every performance we attended, and her love of every aspect of the theater showed. I will say that the quality of the class was dependent on the quality of discussions, which varied. I can also see where the reviewer might have found the grading arbitrary. The assignments tended to be more creative than analytical. However, you get all sorts of choice and opportunity to better your grade. For each performance, you can choose between four questions, and you only have to respond to four of 12 performances over the course of the semester. She'll also take your four highest grades if you respond to more. You can also turn in papers with corrections a week after you get them back. She really wants you to do well! \nWorkload:\nFour 500ish word prompt responses, maybe 30 pages of reading per class, 12 performances\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "April 14, 2015",
            "review_content": "\nProfessor Glasner really takes into consideration the needs of her students, and manages to address and correct individuals even in large class settings with a wide variety of levels.  This is a difficult task that she manages very well.  She is personable and friendly, and always keeps a sense of humor.  She emphasizes musicality and expressivity in phrase work, and creates an un-competitive atmosphere.  She provides a thorough warm up and builds her class structure around accomplishing particular tasks or focusing on specific skills.  She accepts and always asks for student requests in exercises we want to do or things we want to work on.  She is direct and honest, but absolutely not condescending.  And also more than willing to offer academic or dance advice.  She is lively, enthusiastic and passionate.  I would highly recommend taking her ballet class.    \nWorkload:\nComparable to other mid level ballet classes given at Barnard, and lots of options provided to make up classes if necessary.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "April 14, 2015",
            "review_content": "\nProfessor Glasner really takes into consideration the needs of her students, and manages to address and correct individuals even in large class settings with a wide variety of levels.  This is a difficult task that she manages very well.  She is personable and friendly, and always keeps a sense of humor.  She emphasizes musicality and expressivity in phrase work, and creates an un-competitive atmosphere.  She provides a thorough warm up and builds her class structure around accomplishing particular tasks or focusing on specific skills.  She accepts and always asks for student requests in exercises we want to do or things we want to work on.  She is direct and honest, but absolutely not condescending.  And also more than willing to offer academic or dance advice.  She is lively, enthusiastic and passionate.  I would highly recommend taking her ballet class.    \nWorkload:\nComparable to other mid level ballet classes given at Barnard, and lots of options provided to make up classes if necessary.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "May 05, 2012",
            "review_content": "\nProfessor Glasner is very sweet and friendly. She uses fun, unique analogies to get her point across, and they usually work. However, I received very, very little individual attention throughout the semester. There were classes where she didn't direct a comment at me once during the whole two hours. Considering this, I thought I was doing fine in her class. My final grade did NOT reflect this. This was my second time taking Ballet IV with her, and my grade was lower this time around.\nMy only complaint is that I had no way to expect the grade I received. I thought I would maybe receive the same grade I had gotten before - but a lower grade? I just didn't think that would happen. I wish Professor Glasner had given me more direction and told me more specifically what I needed to work on. How am I supposed to improve if I only hear general comments and never receive individualized pointers or advice? When you see an instructor helping others but not helping you, and then you get a grade that makes it clear you needed help, it feels like that instructor had given up on you. As students paying for instruction, we deserve more than that.\nAs a side note, I have always enjoyed Professor Glasner's bubbly demeanor and passion for teaching. This semester, even prior to seeing my grade, I also noticed that she sometimes comes off as condescending.\nWorkload:\nOne assignment to make up your own barre or floor combination and present it to the class, one assignment to assess your work and grade yourself for the semester.\nShe definitely grades on technique, not just effort and attendance.\n"
        },
        {
            "course_name": "Ballet V",
            "review_date": "December 22, 2011",
            "review_content": "\nI found this class to be less intense and stressful than other ballet classes, but I found it way too slow. Her combinations put me to sleep. She also doesn't understand how to give corrections for the more advanced dancers in the class and instead gives very broad, simple corrections like \"don't tuck your pelvis\" and \"square your hips.\" She's very kind and caring as a person, but I did not find her to be a helpful teacher. It must have been hard for her because the class was so big and there was a broad spectrum of levels. I enjoyed myself sometimes but I didn't improve and felt bored mostly. \nWorkload:\nIf you show up, care about dance and try you will get an A- or an A. \n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "December 10, 2009",
            "review_content": "\nI recommend this class to anyone and everyone. I looked forward to this class every week and the discussions in class were very interesting. The performances we viewed were amazing and ranged from modern to ballet to tap. I love Katie Glasner! She is compassionate, kind, extremely intelligent and she listens to your opinions. We watched interesting video clips in class and I learned about many choreographers and companies. Professor Glasner makes you think about aspects of a dance performance that I had never thought about. Our class discussions were always interesting and insightful. Dance in NYC is a once-in-a-lifetime experience and I felt honored to have Katie Glasner as my teacher. \nWorkload:\n4 papers, 3-4 pages each. There are more than 4 prompts so you get to choose which essays you want to write. 1 final paper, 6 pages, manageable, creative. Required attendance for performances...performances are amazing!!!\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "May 04, 2006",
            "review_content": "\nAs the previous poster said, I know there are already a TON of great reviews for Katie (all well-deserved), but I feel obligated to add another.\nBallet I with Katie was a pleasure. She made getting up for a 9:10 class not only tolerable, but something I actually looked forward to. She is so down-to-earth and SO CARING and encouraging of everyone. She is also a great ballet teacher: not only did I learn a TON of basic ballet, but I am now able to touch my toes for the first time since the age of 7! This was by FAR the most productive \"gym\" class (I used it as my 2nd PE credit) I have ever had.\nAll she asks is that you try your best -- if you do that, she is totally there for you. Katie is EASILY the best professor I have had on either side of Broadway. I just wish she was teaching Ballet I or II in the Fall!!\nWorkload:\nNone ... if you exceed 2 absences, you must write a paper (usually on a performance -- she gives you MANY options and is very generous) ... over 5 absences and you fail the course.\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "March 08, 2006",
            "review_content": "\nEven though there are already a million, I'd like to add to the glowing reviews of Katie.  I took Dance in NYC last semester and loved it.  I don't think it was the content or the structure of the lectures so much as Katie's sparkling enthusiasm that made this class so great for me.  Watching her get so excited about a field that obviously means a lot to her was really inspiring.  I danced seriously in high school but not so much in the past few years, and after taking that class I ended up motivated enough to sign up for dance classes this semester.  I also really enjoyed the performances.  Even though we live in NYC, I think it's sometimes hard to make ourselves get out of Morningside Heights to explore the city, and this class does the work for us.  Katie's a wonderful cross between having the intellect, knowledge, and experience of a college professor and the capacity to nurture and care about her students as much as a displaced elementary school teacher.  That sounds weird, but after all the teachers I've had who seem to wish they could teach the class without the students in it, it's incredibly refreshing.\nWorkload:\n4 easy 3-4 page papers that we can choose out of a bunch of options; 1 6-7 page take-home essay final.  Very little work, and essays were graded very generously, but yes, she cares about grammar.\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "January 18, 2006",
            "review_content": "\nI enjoyed this class because of the performances, not because of the lectures. Although she showed interesting and varied video clips and led some good discussions, most of the classes were rather boring and the lectures were hard to follow. Usually, the papers we had to write had nothing to do with the information learned in class.\nWith that said, I still recommend this class--we saw some amazing shows and she made many different and new forms of dance very accessible. \nWorkload:\n8 performances to see (evenings and week-ends); 4 essays (750-1000 words); final paper (1250-1500 words)\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "November 18, 2005",
            "review_content": "\nGood performances. Good lectrues, a lot of unineteresting history though. \nKatie's very fun and engaging in her lectures and has a lot of experience to share. Very accessible.   \nWorkload:\n4 essays. One final. Readings every week.\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "May 27, 2005",
            "review_content": "\nBefore Katie's class, all the good ballet teachers I'd ever had had been somewhat of a nut. Katie is not only sane, she's also approachable, kind, and sincerely enthusiastic about her students. She emphasizes physical health in ballet instruction and her teaching style fosters a comfortable and engaging ballet class.\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "May 27, 2005",
            "review_content": "\nBefore Katie's class, all the good ballet teachers I'd ever had had been somewhat of a nut. Katie is not only sane, she's also approachable, kind, and sincerely enthusiastic about her students. She emphasizes physical health in ballet instruction and her teaching style fosters a comfortable and engaging ballet class.\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "January 17, 2005",
            "review_content": "\nReally a very fun class to take if you want to get an introduction to what NYC has to offer in terms of Dance.  You get to go see some great performances and meet some inspiring choreographers. Katie is really wonderful and kind. She's a great professor.  The class is not difficult. It fulfills a requirement and it is really a great time. I never knew that I could love viewing dance so much.\nWorkload:\nA few short papers ( She will let you rewrite them if you don't do well). A final take home essay (Creative writing - really easy). Something like- make up your own dance company.\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "January 17, 2005",
            "review_content": "\nIf youve had no backround in PE or arent very athletic, Katie's great. Shes easy going, fun and very cool. However, If youre looking to be challenged, which I dont know if thats possible in a ballet I class, look for someone else. I dont regret takinig this class at all though, Id recommend it.\nWorkload:\nA JOKE. Nothing, seriously. Unless you miss class she makes you write a paper.\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "January 07, 2005",
            "review_content": "\nGreat prof! Not only is Prof. Glasner knowledgable but she truly wants to engage each student toward dance. She covers a variety of dance genre within the course and each class is engaging. Also, it fulfills the Visual Arts Requirement. \nWorkload:\nReadings for every class is often 2 short articles on the dance genre being covered on that particular day. 7 mandatory dance concerts spaced throughout the semester. 6 short 4-6 pg papers based on your interpretation of the dance concerts you see. Not a difficult class at all. \n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "December 29, 2004",
            "review_content": "\nKatie is a great professor who made me WANT to be there every morning for class.  She presents exercises clearly and encourages students to challenge themselves.  Our class was small enough (about 10-15 daily) that everyone got feedback throughout the class.  She also asked us to specify what we wanted to work on in the class (eg advanced moves, better placement, petite allegro, foot articulation, etc) and catered to that.\nKatie is very witty and offers metaphors that are fun as well as engaging, although sometimes I felt like the only one awake enough to appreciate it.  Her accompanist John plays tunes that correspond to her jokes (when Katie told us we were moving our hips too much, John played the hula) and keeps things lively.\nTake this class if you appreciate humor (albiet sometimes very cheasey) in the classroom, but don't come half asleep or you'll miss it along with the opportunity to push yourself.\nWorkload:\nno outside work unless you have more than 2 absences.\n"
        },
        {
            "course_name": "Ballet V",
            "review_date": "December 29, 2004",
            "review_content": "\nKatie Glasner is one of the sweetest persons at the dance department.  She brings her enthusiasm and cheerifulness right into the classroom.  John RIch's accompaniment is also delightful.  He seems to have an indefinite supply of songs stored up in his sleeves.  While her class can be quite slow, especially at the barre, the structure of the class is quite thorough.  The main complaint I have is that the class was so big and seemed much too short.  Not enough time is devoted to the center, which means that every day we have to skip something.  In particular she does not have enough or any pirouette combinations.  But this is probably due to only having an hour and 15minute class.   In addition, if you want to get the full benefit out of this class you have to be willing to push yourself because there are too many people for her to watch at once.  I do believe, however, that she corrects the vast majority of the class individually, although most of her corrections are directed to the class as a whole.  Overall I would recommend this class because Katie makes it fun and has students  focus on \"healthy\" alignment.\nWorkload:\nmaybe a little bit less demanding than most dance classes I have taken\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "December 12, 2004",
            "review_content": "\nKatie Glasner intimidated the pants off of me at first!  Katie often allows her class to dissolve into chattiness; however, the technique stickler in her never ceases its hounding.  The class filled beyond capacity, and this presented problems of overcrowding at the barre and during combinations.  It will probably fill even more next semester as the department will offer no Ballet VI classes.  You need tremendous focus to take this class, or you need need to come with goals of giggling with good girlfriends and enjoying yourself.  Arrive early to claim a spot at the barre.  Otherwise, you might find yourself relegated to a barre end or to the piano.  Lastly, as a great bonus, John the accompanist improvises hilarious musical divertissements to accompany Katie's infamous groaner jokes.  \nWorkload:\ntypical\n"
        },
        {
            "course_name": "Ballet 3",
            "review_date": "December 13, 2003",
            "review_content": "\nKatie is probably the most caring teacher at Barnard.  She honestly and sincerely cares about the well-being of her students.  Her class is very step-by-step, and she makes sure to answer every question thoroughly.  Many times she even brought in pictures of dancers for us to see correct and incorrect placement.  \nThere was a range of skill in this class.  Some more advanced students take it to work on small things like turnout and extensions, and less advanced students take it just to dance.  \nI highly recommend Katie...\n\nWorkload:\nCome on...it is just a dance class...no outside work unless you stretch or something like that.  If you miss a class...she is really flexible about how you can make it up (watch a dance video, write a paper, take another class...)\n"
        },
        {
            "course_name": "Ballet 3",
            "review_date": "December 13, 2003",
            "review_content": "\nKatie is probably the most caring teacher at Barnard.  She honestly and sincerely cares about the well-being of her students.  Her class is very step-by-step, and she makes sure to answer every question thoroughly.  Many times she even brought in pictures of dancers for us to see correct and incorrect placement.  \nThere was a range of skill in this class.  Some more advanced students take it to work on small things like turnout and extensions, and less advanced students take it just to dance.  \nI highly recommend Katie...\n\nWorkload:\nCome on...it is just a dance class...no outside work unless you stretch or something like that.  If you miss a class...she is really flexible about how you can make it up (watch a dance video, write a paper, take another class...)\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "December 07, 2003",
            "review_content": "\nShe spends most of the time at the barre. If the class does it very badly, she'll make everyone do it over again. She does loads of turns at the barre and in the center. Her exercises in the center were long and difficult to remember. Also, in my opinion SHE PLAYS FAVORITES BIGTIME!!! If you're not one of them, expect to hear feedback seldomly. I wouldn't recommend her.\nWorkload:\nnot too bad. at some point during the semester you need to choreograph an exercise and present it to the class.\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "September 25, 2003",
            "review_content": "\nI agree with the other reviewer that Katie is a modern dancer.  Furthermore, while I am sure she is a really nice lady, she is patronizing.  She uses metaphors and SAT words as though it were impressive.  Despite the fact that her tone made me feel like she thought I was nine, I felt like she was more interested in impressing me than teaching me, which is a waste of class time.  If you know what you are doing this class is fine, but don't expect any revelations from Katie.\nWorkload:\nnormal\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "August 08, 2003",
            "review_content": "\ni was so terrified of taking her class because i have no dance background at all. but even though i didn't, i expressed that in every paper, and i guess she took it to heart. every paper i got back was graded extremely generously. just make sure you proofread you paper well. she was an english major and tells you point blank from day #1. glasner is very nice and personable. she tries to get to know eveyrone's names. just try to participate enthusiastically. regardless of what you might say, good bad or indifferent....overall fabulous engaging prof. the other prof she taught w/ was mindy aloff. she was a tougher grader. but you speak with her and try to ask for a rewrite. aloff will accommodate you. aloff can come around and will give you pretty decent grades. but aloff was les engaging and more boring\nWorkload:\n4 reviews on 7 performances(you pick most of the off campus performances) about 2-3 pages... one final=take home...easy\n"
        },
        {
            "course_name": "Baller V",
            "review_date": "June 12, 2003",
            "review_content": "\nKatie Glasner is a wonderful teacher and person!  Her class made me think and internalize the movements in a way I had never examined before.  She makes sure that her students know WHY and HOW positions and movements are being exicuted.  She spends a lot of time making everyone's first positions better not by forcing the turnout but by using the rotator muscles that so many dancers overlook.  Her great sense of humor and wit make for a stimulating environment.  Overall, I would say that Katie's Ballet V class was a positive experience and I am looking forward to taking her classes again in the future.  If you want to be challenged physically and mentally, this class is for you.\nWorkload:\nTwo hour class every Friday morning.  No homework.  One absence allowed per semester.  Encourages make up classes.\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "May 28, 2003",
            "review_content": "\nProfessor Glasner is at first encounter a sweet, even cool woman. The more time you spend in this class however, the more abrasive her name-dropping and opinionated lectures become. Glasner forms staunch first-impressions of students and lets them color her grade distribution. If she suddenly doesn't like you (often for no apparent reason) you have no chance of ever doing well. Do not take this class, it is more hassle than you would think, and less enjoyable than it sounds.    \nWorkload:\n4 reviews of dance performances, lots of class participation required (bummer for those who don't have a background in dance), and a ludicrous, repetitive take-home final. \n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "May 07, 2003",
            "review_content": "\nI have taken this course with Katie for 4 semesters, and every semester it becomes more of a challenge.  It's not because I'm regressing as a dancer (I hope), but because Katie constantly presents each student with new ideas and questions about the ballet vocabulary, the functions of the body, and how your mind and body work together when you dance.  I'm never bored or frustrated in this class; I feel a constant pressure (nothing scary, just positive energy radiating from this great professor) to deepen my understanding of the art.\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "October 16, 2002",
            "review_content": "\nKatie may be a sweetheart but she is a MODERN dancer. This means that although she knows ballet, she sucks at teaching it. She may have amazing feet etc but she does things WAY too slowly and always does the most rudimentary routine. She doesn't employ other positions into one combination and repeats everything 5 million times to make sure EVERYONE got it.\nWorkload:\nnone\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "May 02, 2002",
            "review_content": "\nI really enjoyed this class. Katie is an engaging and witty lecturer who knows all sorts of interesting facts about the New York City dance scene. The syllabus covers ballet, modern, post-modern, tap, jazz, musical theatre, and marathon dancing, and you don't have to have any previous knowledge of dance to take the course. This is probably one of the easiest classes you can take at Columbia, but it's really quite good\nWorkload:\nAttend seven dance performances over the semester; write 2-3 page response papers for 4 of them; make sure you use coherent English because Katie has a Columbia English degree; one longer final exam paper. VERY reasonable.\n"
        },
        {
            "course_name": "Ballet III",
            "review_date": "October 17, 2001",
            "review_content": "\nWhile she's very serious about teaching you the proper technique, Katie is sweet, warm, funny, and genuinely wants you to enjoy the class. She's not an old ballet mistress with a severe bun and a cane ... she'll challenge you both at the barre and on the floor while making the combinations fun.\nWorkload:\nBarre and center work are as physically demanding as you'd like to make them. One assignment per semester - you must develop your own barre or floor exercise. I owe Katie my calves of steel.\n"
        },
        {
            "course_name": "Ballet I, Modern I, Modern III",
            "review_date": "September 09, 2001",
            "review_content": "\nKatie is an inspiring and wonderful teacher for the beginner dancer. She brings out the best in everybody. The first dance I had done since the age of 7 was her Modern I class and now I'm just hooked. Likewise for ballet. She makes everything very accessible. Be warned of her Modern III though, she teaches in the style of Twyla Tharp. If you like that, fine, but I left after I realized that it was going to be mathematical inversions and variations of the same combination for the whole semester. Backwards triplets are not my thing.\n"
        }
    ]
}