{
    "prof_info": [
        {
            "prof_name": "Lisa Duggan",
            "prof_id": 9383,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Thinking Sexualities: Queer Theories and Histories",
            "review_date": "May 26, 2009",
            "review_content": "\nCheck minus.\nYou know how some people just shouldn't be teachers? Lisa Duggan. Avoid her at all costs. I know she has to make a living somehow, but I believe she has an ethical responsibility to stop teaching. Her colleagues and former students surely already know this. Learn from my mistake.\nI registered for Thinking Sexualities: Queer Theories and Histories, having heard great things about the course (which is often taught by Janet Jakobsen). Unfortunately, although Lisa Duggan may be famous in her little, bitter mind, this potentially a great course was ruined by a self-aggrandizing (she is a \"world-famous homosexual\"), hostile (\"no, no, you don't get it\") professor. Lisa Duggan seems to hate teaching, and she takes it out on her students. Or maybe she just hates her students? \nAt Columbia, it is not unusual for a professor's attitude to be \"my way or the highway,\" and I am not faulting Duggan on that score. Sure, she thinks she is the star of the Lisa Duggan Show, and she won't say you have the right idea unless you parrot her words right back at her. But that is not what makes Lisa Duggan a bad teacher. Lisa Duggan is a bad teacher because she does not make her ideas clear. Lisa Duggan is a bad teacher because she gives mostly negative feedback to questions and comments in class (and that is just as demoralizing to watch happen as it is to experience firsthand) and yet, your grade is dependent on class participation, so you have to keep raising your sweaty, shaking hand as you wonder how she'll call you stupid this time (\"No, you don't get it\" is a favorite of hers). Lisa Duggan is a bad teacher because she gives grades of check, check plus and check minus on presentation papers;  gives sometimes vacuous, sometimes sniping, but never constructive critique of written work; and then wonders why her students didn't put enough effort into their final papers? It is because we realized there was no way to please her, and it was demoralizing and a waste of energy to try. \nI got a lot from the readings and from my fellow students. Worst professor I have had in almost four years at Columbia/Barnard. \nLisa Duggan was visiting from NYU, but beware: she could come back.\nWorkload:\nThe workload for this course is steep- it is a seminar, so one book a week- plus two presentations with papers of 7 to 13 pages, and one take-home final \"exam\" paper (choose one of three topics) of 10 to 25 pages. \n"
        }
    ]
}