{
    "prof_info": [
        {
            "prof_name": "Gabor Szekelyhidi",
            "prof_id": 5497,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IV",
            "review_date": "April 01, 2011",
            "review_content": "\nWhat could this man ever have done to earn a silver star? Not only was he EASILY the worst math teacher I have ever had, but he also killed any desire I had to learn any math. I can confidently say I will never take another class in the math department again.\nFirst off, let me say his his lectures are ALL THEORY, NO APPLICATIONS. He will stand up there, droning on and on about theorems and proofs that are completely inconsequential to what the actual test material is on. Lecture is a complete and utter waste of time.\nNow, his tests. The two midterms were not impossible, and I could have scored very well, if it wasn't for his HORRENDOUS grading. He grades his midterms out of 20, and making the smallest mistakes will cause him to slash one point off here, two points off there, and all of a sudden you have a very bad score. However, he does throw theory onto the tests, so you need to know the proofs inside out. The final on the other hand, was a blood bath. Also, he is impossible to negotiate with since he does all of the grading himself. There is virtually no curve.\nIn retrospect, I would have taken Calculus IV with any other professor on campus, period. I would never, and I repeat NEVER, advise anyone to take a class with this spineless, shell of a man. I sincerely hope someone from the math department reads this and either fires Gabor whatever-his-last-name-is, or at the very least relegates him to teaching Calculus I forever.\nWorkload:\nWeekly homework, two midterms, a final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 10, 2011",
            "review_content": "\nNot to be prescriptive, but I'd say Gabor is a pretty good choice.\n1. For one thing, he has basically no accent.\n2. Very organized.\n3. We got through all the material with a few lectures to spare for review days.  Conversely, I heard about a Calc II professor who added an extra lecture during reading period because he didn't fit everything in.\n4. Open to criticism and questions, and actively tries to get the class to participate a little.  Like almost any calc class, it's just the book in lecture form.  But if you like hearing the material, and hearing it in different ways, he'll explain a concept another way if you say you don't understand.\n5. He is simply adorable.  I don't mean in the attractive sense; don't expect someone attractive.  But he tells adorably lame jokes, had some naive optimism that there was at least one future mathematician in the class, and is just generally a pleasant guy.  Somehow it struck me as purely endearing that he wore the exact same pair of jeans every day.  (EXACT same.  There was a loose thread on the back left pocket that was there the entire semester.)\n6. You'll get a good grade.  I got an A-, coming from an AP Calc AB background and putting an average of 2 and a half hours per week into homework/studying, plus studying an extra 5 hours or so before each midterm.  Probably could've gotten an A if I'd had the energy to study extra for the final.\nWorkload:\nWeekly homework, normally ten problems, collectively makes up 20% of your grade.  Two midterms each make up another 20%.  The final gives you the remaining 40%.  My class did badly on one midterm, so he offered to calculate our grade in that way, but also to calculate it with each midterm worth 10% and the final worth 60%, and to give us whichever grade was better.  Curved at a B.  \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 03, 2010",
            "review_content": "\nI loved Szekelyhidi! And I think the below review is pretty on point. It seems like he tries really hard to make everyone understand things, the only problem being his lectures are so boring that there is almost no way to pay attention in class. That being said, if you are able to attend class and mindlessly write down all the notes he writes on the board, you'll be golden. His notes are possibly some of the best I've seen given straight from a professor; they are very easy to understand  and you could teach yourself all the material just from reading them over later. \nHe really tries to answer everyone's questions and I think his grading is way more than fair. He also gave quizzes (which would not hurt your grade if you did poorly, but would help your grade if you did well) after everyone did poorly on the midterm. \nIf you take down all his notes and do the problem sets by yourself, you should be able to get an A in this class.\n\nWorkload:\nweekly problem set\n2 midterm\n1 final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 17, 2010",
            "review_content": "\nIf you take this class with Gabor, then you will certainly experience a tradeoff. His lectures are not colorful or even mildly interesting. If you go to class, everything is extremely dry and boring. He answers your questions, but will make you feel stupid in the process. Nevertheless, I really enjoyed his style. Almost every word he said, he wrote neatly on the board, which made for really good note-taking. If there was something I didn't understand in class, all I had to do was look over my notes, go through the steps again, and it clicked. His pace is almost perfect. His handwriting is neat and legible, and unlike many of the other Calc III teachers, his accent doesn't interfere with students' understanding of the material. If you can handle a class with no humor and unbearable boredom, then I would highly recommend this section.\nWorkload:\nweekly homeworks out of the book, which are never longer than an hour, or 2 TOPS. 2 midterms: the 1st is a walk in the park, the 2nd is a bit more difficult, but doable with the right amount of studying. Final in my opinion was hard.\n"
        }
    ]
}