{
    "prof_info": [
        {
            "prof_name": "Yoko Saito",
            "prof_id": 2127,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Japanese A",
            "review_date": "June 12, 2004",
            "review_content": "\nSaito-Sensee is a wonderful teacher.  I am Japanese and I am familiar with the work ethic of the culture as a whole, so I can appreciate her perfectionism and meticulous attention to detail.  However, if you want to learn this language - she is the way to go, if she's back next year.  She is kind and fair, despite her demanding workload and strict classroom rules.  She wants to hear your questions, she wants you to understand and she will never explain anything to you as \"Well,  it's just like that in Japanese and  you have to learn it.\"  If there is a reason, she will find it for you if she does not know why something is, and she will explain it to the best of her ability.  She is funny and engaging in class.  The class itself is fast-paced though and very difficult, so it thins out quickly.  Saito-Sensee's class started with nearly 30 students and I think by the end of the year there were about 15.  She sees RIGHT THRU people and she knows who is in the class because they want to be, and who is in the class because they took it on a whim.  She will make EVERY effort to help you though, so utilize her office hours when you need to.  She appreciates this effort.\nWorkload:\nHefty. DO NOT take this course because you \"think it would be cool\" to speak some Japanese.  You will have ONE WEEK to learn all 60 plus characters of the hirigana writing set.  You will then be expected to use it on every quiz and test and hw and it does take some time.  You will have homework, every class - at least an hour and a half to two hours.  And every other class you will have a lab due, which will take you between an hour and two hours in the basement of Lewisohn Hall, depending on how much time you spend.  If you have the time, really do the labs meticulously, because the orals on the tests are similar to the lab excercises.  You will also have a quiz EVERY SINGLE CLASS, on vocab and grammar.  You cannot miss a class because you will miss the quiz and get a zero, and when you come back the next class, you'll fail the quiz on the grammar points covered while you were not there the class before.  This class is ALOT of work for 2.5 credits.  I found it to be worth it, but honestly, I did more work for these 2.5 credits than for any of my other regular 3 credit courses this semester.  Only take this class if you have a genuine interest and you intend to go on.  Otherwise, stick to Spanish or French - I've studied both and neither were this intense.\n"
        }
    ]
}