{
    "prof_info": [
        {
            "prof_name": "Douglas Mao",
            "prof_id": 13691,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "James Joyce",
            "review_date": "May 02, 2019",
            "review_content": "\nProfessor Mao is an unbelievable teacher. He is gentle and accommodating - and never comes off as too demanding - but manages to elicit deep, thoughtful, hard work and participation from nearly everyone in the class by simply being engaging and fun. He asks targeted, probing questions about the texts we read, provoking insightful comments from students - and he isn't afraid to provide guidance and advice himself when necessary. He is the sort of professor who is generous about granting extensions, understands if you can't get to all the readings in a given week, and will never shame you for not understanding a text (some of the things we read are extremely difficult), but inspires students to work hard and give the texts their all.\nI also appreciated Professor Mao's dedication to the material. In addition to occasionally sharing his own anecdotes about experiencing the material in real life, he has an extraordinary breadth of knowledge: he chose excellent secondary literature for us to read each week, hand-picked from the thousands of articles about Joyce.\nProfessor Mao also gives extremely thorough feedback on papers that is in line with his teaching style: thorough, helpful, and critical when necessary, but overwhelmingly kind and positive in outlook. I received from him some of the kindest comments I've ever received from a professor, but still came away understanding exactly what I could have improved in the essay and how to be better the next time around. He is also careful to return papers with enough time to incorporate feedback into later papers, and he is a fair - and even perhaps generous - grader.\nIf there is one thing that could have been improved about our class, it's that it often felt like all our discussion was mediated through Professor Mao - generally, students would speak to him, and he would respond with another question, opening the floor for other students. I would have liked if occasionally the floor was simply open for us to respond to each other, without the professor's involvement - but, on the other hand, Professor Mao's comments were always helpful and insightful.\nIn sum, Professor Mao is a kind, generous, insightful professor who brings out the best in his students. I'll always treasure my experience in his class.\nWorkload:\n2 4-6 page papers, one on Dubliners and one on Portrait of the Artist; one 10-page paper, on Ulysses.\nWeekly reading responses (but extremely short ones - 1-3 sentences).\nA good bit of reading, although he is understanding if you don't finish all of it (and it's not all entirely necessary anyway - most of it is incomprehensible, since it's Joyce).\n"
        }
    ]
}