{
    "prof_info": [
        {
            "prof_name": "Douglas Pfeiffer",
            "prof_id": 711,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Shakespeare",
            "review_date": "October 17, 2014",
            "review_content": "\nProfessor Pfeiffer is a nice guy--energetic and enthusiastic about the subject matter. The plays we read covered most if not all of Shakespeare's genres: comedy, tragedy, romance and history. Obviously some were more enjoyable than others. The class was pretty discussion-based, although the professor definitely does most of the talking. There were some students who got away with hardly ever talking (I don't know what their grades were though) and I managed to skip reading one play, and was totally fine.\nI enjoyed this class, but I feel I should give others a warning about the very heavy work load and time commitment. We were required to read about 2 plays a week and there were many assignments: go to and review a play; prepare a presentation; two detailed annotations (same amount of work as an essay); a quiz; a final paper. This was all in the 5-week summer course, so it amounted to reading two plays and writing a paper each week. This class took up absolutely ALL of my time. I am not an English major, but I have been reading and studying Shakespeare since 7th grade. Because of this class, I had to drop other classes I had planned to take that summer, which was very frustrating.\nEven though I like the professor and it is nice to be Shakespeare-literate, I am not sure I would whole-heartedly recommend this class unless you are very interested in Shakespeare and don't mind it taking up all your time. I just needed an English credit, so I wish i had taken a less work-intensive class. I did receive an A (I do not think he is a difficult grader), so if you are willing to put in all the necessary time, you will be rewarded. \n\nWorkload:\nHEAVY!\n"
        },
        {
            "course_name": "Shakespeare",
            "review_date": "October 30, 2010",
            "review_content": "\nA funny man who kept this class interesting with his quips and discussions that went anywhere. However there is his annoying habit of listing everything he knows about a certain subject matter--to include tangents. This could be interesting at times--since any background knowledge can be welcome--but it got tiresome as the information would not seem pertinent as the class wore on. Finally his feedback is spartan at best and it felt like he had never provided guidance to anyone in his life. Frustrating. Mind-numbing. Felt like he didn't know what he was looking for either. Should you want to take this class to actually learn something you would better to look elsewhere (though no one I knew got a bad grade--so that should give you hope) or read Shakespeare on your own. \nWorkload:\nTook the summer course; reading Shakespeare wasn't too hard (enough to make a discussion post and say something profound in class) and the three papers (one for a play you had to go and see) were fairly short and not taxing. \n"
        },
        {
            "course_name": "First year english",
            "review_date": "November 20, 2003",
            "review_content": "\nI don't know if he'll be teaching here again, but all i know is that it was because of him I had such an amazing first year english experience. We fell behind a lot, compared to all the other legacy of the mediterranean sections, but he kept the class fun. He's a frank speaker, and speaks the way we do. It's also amazing how much he knows. We'll be discussing the book of the day and he'll recite passages of other works perfectly because the fit with out topic. He is very receptive to the mood of the class and does his best to keep us interested. \nWorkload:\n2 regular papers, a final research paper, a very simple one page explication on each book we read\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2002",
            "review_content": "\nI'm pretty sure Mr. Pfeiffer's not teaching next year, but if he does happen to teach here again you definitely should not miss the opportunity to take another class with him. He's hilarious in class, and his insights are usually really interesting. If you care about the course and put a little effort in, he'll take a strong interest in your progress and he'll really give you a lot of guidance and support. He's without a doubt the best teacher I've had at Columbia so far. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2002",
            "review_content": "\nSincere, kind, and very smart. Not a particularly easy teacher, but he really helps students look at literature in a unique way. His passion for the material is evident and inspiring. Take him- it's worth it.\nWorkload:\nStandard\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 03, 2002",
            "review_content": "\nDoug Pfeiffer is awesome. He's funny, articulate, knowledgeable, considerate, and intelligent. I remember looking forward to this class every Tuesday and Thursday. What a cool man!\nWorkload:\nAssorted papers, exams, nothing too painful. Keeps with the Lit Hum standards.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 15, 2001",
            "review_content": "\nIt's rare when you say a teacher has changed your outlook on the world, but this is truly the case. Lit Hum has been and is my favorite course at Columbia because of Doug Pfeiffer. He is extremely knowledgeable, very personable, and just an all around cool guy. He does tend to grade harshly, and for that reason I contemplated switching out of his class. I am thrilled that I stayed, however, as the grades did improve and I learned ten times more than my friends in other lit hum classes. Highly recommended.\nWorkload:\nLit Hum curriculum (or spark notes, lol), about 3-4 papers per semester.\n"
        }
    ]
}