{
    "prof_info": [
        {
            "prof_name": "Thomas Bernstein",
            "prof_id": 270,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "May 12, 2006",
            "review_content": "\nThis was a good class in terms of the material covered. Lectures were interesting and the professor would use every moment of class. He is soft spoken, so sit near the front of the room. Attending lectures will benefit you more than reading, though doing both helps. There was section, but if you said you had a class conflict, you did not need to attend. He is a harder than average grader.\nWorkload:\nMidterm, 10 Page Paper, Take Home Final. Reading was about 120 pages per week, but you need to get a lot of books and a coursepack.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "March 30, 2006",
            "review_content": "\nI know many will probably whine and complain about Bernstein, but I found him to be a fine professor.  He speaks quietly and without much inflection, which would be, for me, the only legitimate gripe of students.  If you pay attention (I know, it's a tough task for us Columbia students) the class is interesting and not terribly difficult.  I did not do much of the reading for the first half and got an A on the midterm, because I went to class and paid attention.  Bernstein is cute and has a great wit that you just have to listen for.  The class is straightforward.  If you have to take a PoliSci course and don't have attention issues, I'd recommend this class.\nWorkload:\nEasily handle-able.  Midterm, take home final, book review.  Go to class, and you should be fine.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "March 29, 2006",
            "review_content": "\nMy biggest regret this semester is not dropping this class while I had the chance.  The lectures are incomprehensible and impossible to hear if you don't sit in the first few rows.  There is a lot of reading, on which the tests are mostly based.  The most enthusiastic students in the class are the large number of continuuing-education students; many undergrads don't even bother coming to class.\nWorkload:\nLots of reading--do it, as you will fail the midterm if you don't, I kid you not.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "March 27, 2006",
            "review_content": "\nThink very, very hard before you take this class.  This man cannot stay on a lecture topic to save his life.  Once, after only covering half the material he had planned to in the lecture, he commented, \"I guess circumstances prevented us from getting to the other material...but I'm not really sure what those circumstances were.\"  He frequently refers to all subjects in his lectures as \"they\" or \"you\" so when he took a comparative approach, it wasn't always clear which country he was talking about.  The midterm was entirely based on outside readings; I don't think I would have   been able to write an adequate response to the questions about Leninism if I hadn't been enrolled in political theory at the same time.  TAs were excellent but just as unenthusiastic about the class as all the students; furthermore, they never had any idea where we were supposed to be in the syllabus since it had no dates on it.   Readings were interesting, but not worth the horror of sitting through these lecturers.\nWorkload:\nAs I said, you must do at least some of the readings.  There's no way you will pass the midterm otherwise.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "March 20, 2006",
            "review_content": "\nThis was a fanastic class.  A painless history lesson.  A rigorous political-science analysis.  Statistics and anecdotes.  Humor.  A professor who dresses well and acts friendly, always taking times to answer questions without veering off-topic.  \nHe mentions books and authors, and you'll be jotting down the names so you can look them up later.   Go with that instinct!  (I did, and I'm now reading Solzhenitsyn's _The First Circle_.)\nWorkload:\nNot bad.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "March 09, 2006",
            "review_content": "\nThis is one of the few professors I will remember fondly, 40 years on.  He lectured for 75 minutes straight, seemingly without notes, interjecting jokes and factoids that enhanced our understanding of the material instead of distracting from the topic at hand.  Communist Regimes is one of those classes where you sit in the lecture hall and think, \"FINALLY I'm getting my money's worth at this school.\"  Professor Bernstein is so erudite and articulate... you'll want to have a cup of coffee with the guy and spend some more time talking about Stalin and Mao.  He brings so much passion and insight to his subject; it's as if he lived through communist repression himself.  What a relief to have a professor who doesn't whitewash Marxism and its real-world effects!\nWorkload:\nStraight-forward tests with essays and short-answer questions taken straight from the lectures.  The readings are basically supplemental.  Outside papers required.  Some of the TAs are kind of Marxist-Leninist, so they spend section time ragging on Bernstein a bit... but it's all in good fun.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "January 16, 2006",
            "review_content": "\nI tried hard to give Bernstein a chance, and though I do think he deserves his reputation as a tome of soviet and chinese history and politics, he is hands down the most boring professor I've ever had. This class was at least half graduate students and as an undergrad there were certainly times I felt a little out of the loop-Bernstein is very sweet and understanding and allowed for this, and if you happen to be awake in the latter half of class, as noted he does have a dry sense of humor but by then most of the class has departed for the sweet hereafter and it's just the ancient auditors that get the joke. If you are genuinely interested in the workings of communist regimes this is a worthwhile class but you will have to do a good deal of self-motivation: lectures tend to be rather dawdling and tangential but the midterm and the take-\nhome final were both based heavily on the readings, so you're sort of left to draw your own conclusions. Definitely not for the faint of heart. \nWorkload:\nin-class midterm, \"book review\" of a work regarding communism (I wrote about Pol Pot but it seems you can write about whatever) about 10 pages, plus take home final 10-15 pages. Fair but detail oriented grading.\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "December 21, 2005",
            "review_content": "\nSweet guy.  As pro as you get when you're talking about modern poli-sci experts.  Cutting edge insights.  GREAT reading list (if you do the readings).  You'll leave the class understanding why modern china is the way it is, and what kind of place it really holds in the world.\nOn the other hand, his lectures are only really informative at a BASIC level, with the occasional informative and/or funny personal story.\nWorkload:\nMedium reading load.\nEasy paper (extra credit option is tough though).\nDirect take home midterm HEAVILY based on readings.\nADVICE: do the readings, dont mess around, and you'll be set for the paper, the exam, and you'll get your money's worth out of this class.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "May 19, 2005",
            "review_content": "\nProfessor Bernstein has first-hand experience and a great deal of knowledge about Communist Regimes, particularly in the Soviet Union and China. He has a great sense of humor, and the midterm and final are fairly easy. The book review assignment is extremely confusing - it may seem easy but the criteria are not specific at all. Most of the readings were very interesting.\nWorkload:\nmidterm (essays and identifications), take-home final (15 pages of essays), substantial reading assignments, book review/analysis\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "March 23, 2005",
            "review_content": "\nThe man has a dry sense of humour that is subtle and hilarious. Don't be put off by his quiet mild-mannered demeanour at the onset. He is an old school lecturer and academic, meticulous and really well respected in his field. But who cares about that. The best thing about Bernstein is that you really learn, you really enjoy the learning, AND he is a model professor, helpful, challenging, supportive, etc., Check out the pictures in his office if you drop by for office hours and, if you ask, maybe he'll tell you some cool stories about his China travels. \nHe also teaches and has an interest in some of the coolest, most off the wall subjects. Remember, this man also teaches Major Dictators of the 20th Century. \nHe is very approachable and in general just very professional and adept at dealing with and encouraging students. There is no reason why anybody should ever leave Columbia without taking a class with him. \nWorkload:\nalways reasonable. same as most polisci classes: readings, papers, in class or take home midterm and final\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 12, 2005",
            "review_content": "\nTake this class only if you're interested in Chinese politics, and I mean REALLY interested.  Otherwise, the lectures, with Prof. Bernstein's soft and lulling voice, will put you to sleep.  Only half the class shows up.   If you are interested in the post-Mao era, you'll find his lectures informative and at many times insightful.  Sometimes they seem like he' s been giving the same lecture for decades (esp the Mao era); his best lectures definitely start after the Reform Era.  Outside of class, he is a wonderful, accessible, and caring professor who would make a grandfatherly mentor. \nWorkload:\nIn class midterm (IDs and short essays), 12-15 pg take home final, book review (8-10 pgs)\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 01, 2005",
            "review_content": "\nThis is a great class for anyone who has even a speck of interest in post-1949 China, from the Mao years thru reform and the present day.  Professor Bernstein's lectures are always interesting, informative and well-organized, and the readings were almost all excellent as well.  He was able to boil down an unwieldy and very complex subject into understandable and even compelling sections without dumbing it down.  My only bitch is that this class was filled with students who took advantage of Bernstein's soft-\nspoken and generous manner --  these idiots were half-asleep at best and openly disrespectful at worst.  Every class had at least 5-\n8 latecomers who thought nothing of disrupting lecture by clomping in loudly, slamming doors, giggling to their friends, etc.  Don't get me started.\nWorkload:\nMidterm (essays and short answer questions), 12-15 page paper, Final (take-home, 15 pages, 4 questions -- you choose which ones to answer).\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "December 15, 2004",
            "review_content": "\nBernstein is a GREAT guy.  He knows a lot about Chinese political institutions and puts the problems the face in context with their history and their position in the world.  This was one of those classes that could give you most of what you needed to know in lecture, and youcould supplement the readings later for the paper.  The final was a bitch, but the class was super-interesting and everything was extremely informative and to-the-point.  Every poli sci major's dream.  Give him a chance.\nWorkload:\na midterm, book report/research paper (10 or 15 pages), 15-page take-home final\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "December 18, 2003",
            "review_content": "\nProf. Bernstein is laid back and realistic about his expectations in terms of workload and to some extent quality. He's also very flexible --- term papers can be on almost any subject loosely related to the course. He knows a lot about what he teaches, but isn't afraid to admit when he doesn't , encouraging you to research topics yourself. I highly recommend taking a course with him if you are interested in China, Communism, or Dictators. \nWorkload:\nAverage. \n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "September 03, 2003",
            "review_content": "\nSo Professor Bernstein isn't the most consistently captivating lecturer, and his tone is a little on the droning side, but in general, I found his class to be interesting, and for him to be a fair, if not fairly lenient, grader. There is a bit of reading, but nothing extravagantly horrible. also, he really does know his stuff. and he does understand his own tendencies to be a little on the boring side, but he manages to slide in a few jokes here and there. As for his being unaccomadating to students...I don't really think that's fair. The class material was very interesting, and overall, an enjoyable experience. If you have an interest in the subject, it's a great class to take. and the final was take home, which was lovely.\nWorkload:\nmidterm, book \"analysis\" (essentially a report..I guess he has a preference for them), take-home final\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "April 09, 2003",
            "review_content": "\nby far the most boring lecturer i have encountered thus far at columbia. way too many grad students who know everything about chinese politics beforehand. grading was not as easy as some past reviewers suggested, possibly because the ta's changed. there was not a single lecture when i didn't fall asleep for at least 30 min.\nWorkload:\nlots of reading, over-specific midterm and final questions, a book report (?)\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 27, 2003",
            "review_content": "\nHorrible lecturer.  Too much material left uncovered.  Horrible TA.  Unfair grading.  Stuffy class where on most days 1/3 of the students did not show up.  Interesting material, but not a good idea to lump all of Chinese Politics (modern period) into one class.  Bernstein seemed disinterested in actually helping his students on an individual basis.  Proceed with caution!\nWorkload:\nmidterm, final, paper, lots of reading.  \n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 23, 2003",
            "review_content": "\nThe quick and dirty? I enjoyed this class. Bernstein isn't the most scintillating of lecturers (and he knows it and jokes about it from time to time), but he's got quite a few \"pearls of wisdom\" to share. The subject matter is fascinating, so if you've got any interest in China, all I can say is take this course.\nWorkload:\nMidterm, Final, and either a book analysis (for undergrads) or a research paper (for grad students). Grading of undergrad stuff was done by the TA, and was fairly lenient.\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 19, 2003",
            "review_content": "\nBe wary of the other review of this class--it seems very biased and seems as if the guy has a personal vendetta against Bernstein and TA. I loved this class and highly recommend it to any Poly Sci Major (non-majors stay away, too much reading). I thought that the readings were quite informative, and the lectures were interesting (although I do agree that his droning voice is quite conducive to sleep). As for grading the midterm, I thought Bernstein was quite generous. Maybe because I did the reading (seems as if few students take the time to). Like Bernstein, I thought TA was quite intelligent as well, although it was difficult to understand his English sometimes. \nWorkload:\nEasy midterm on lectures, 10 page book report (yes, a book report), and in-class non-cumulative final testing your knowledge of the readings.\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "January 15, 2003",
            "review_content": "\nWhat a horrible class.  Bernstein, although (supposedly) an authority figure on Chinese Politics, does not lecture or teach well at all.  He stands up in the front of class and proceeds to lecture monotone-and- incoherent-style for every class.  The TA is obnoxious and grades with a ridiculous standard for the undergrads, because for some reason this undergraduate class is loaded (think more then 30 percent) with (obviously underachieving) graduate students who skew the standard of grading.  Both the professor and the TA are unapproachable and are of no help; try emailing them and they will attack you personally.  Basically you are thrown into a class expecting either to know a lot (like the graduate students) or to read and memorize every single text, word-by-word, on the syllabus.  There is no one to help you ever and you have no idea what Bernstien of the TA wants.  Truly disappointing!  Proceed with a lot of caution! \nWorkload:\nIn-class midterm, paper, in-class final\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "December 15, 2002",
            "review_content": "\nVery disappointing class.  For some reason this undergraduate 4000-level course was comprised at least 50% by graduate Asian students.  Far too much reading (and not much of it very interesting).  Bernstein's monotonous voice and by-the-book script-like lectures frequently put me to sleep.  The TA was thoroughly incompetent and graded ridiculously stringently.  Though there is the pretense that undergrads and graduates are graded on a separate scale, I don't buy it.  If you're looking for an intensive albeit boring class on China since the reign of Mao Zedong, go for it.  But if you're expecting an intro. to Chinese politics, stay away.  The material is extremely disarming, not at all preparing you for the ridiculously difficult grading of the midterm.\nWorkload:\nMidterm, 10-page book analysis, and in-class final\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "September 30, 2002",
            "review_content": "\nI loved this class. This has been my favorite class yet. Professor Bernstein is actually quite funny and his lectures were very informative. If you're interested in this subject, take this class!!!! He talks about the origin of Communism, its different stages and forms. The class mainly focuses on the USSR and China and compares the two cases. Other cases are, of course, also mentioned, not as detailed though. I learned so much! Thank you!\nWorkload:\nThere's a lot of reading, but you end up not reading everything anyway ( but what poli sci class doesn't have a lot of reading). If you come to the lectures, you'll be fine. One midterm, one 12 page paper and one take-home final. Grading is fine.\n"
        },
        {
            "course_name": "Life Cycle of Communist Regimes",
            "review_date": "September 30, 2002",
            "review_content": "\nI loved this class. This has been my favorite class yet. Professor Bernstein is actually quite funny and his lectures were very informative. If you're interested in this subject, take this class!!!! He talks about the origin of Communism, its different stages and forms. The class mainly focuses on the USSR and China and compares the two cases. Other cases are, of course, also mentioned, not as detailed though. I learned so much! Thank you!\nWorkload:\nThere's a lot of reading, but you end up not reading everything anyway ( but what poli sci class doesn't have a lot of reading). If you come to the lectures, you'll be fine. One midterm, one 12 page paper and one take-home final. Grading is fine.\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Bernstein is a BIG guy in Chinese politics. From what I can gather from this course, there are about 10 Chinese politics scholars who really know what they are talking about and just get published over and over (another one being his wife, Dorothy Solinger). He's a bit penguin-like, and at times speaks like Porky Pig, but weed through the stutters and he's good. He definitely seems uncomfortable giving lectures--leans back and stops stuttering when answering a particular question. Even better, go to his office hours to chat. He's hilarious. Seems to realize he's boring and doesn't care if you doodle the whole time as long as you don't talk.\nWorkload:\nLighter than it seems. Syllabus is loaded with readings (4000-level class, after all) most of which are not necessary if you pay close attention in lecture. His tests are designed to give you outs if you haven't done all the readings. Midterm, final, one long paper. The grading and paper requirement are way watered down for undergrads--yippy!\n"
        }
    ]
}