{
    "prof_info": [
        {
            "prof_name": "Steven Stroessner",
            "prof_id": 886,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Social Psychology",
            "review_date": "May 04, 2015",
            "review_content": "\nProfessor Stroessner is a great lecturer! He provides interesting examples related to education policy, the legal system, and discrimination (his area of research), which makes class fun and engaging. \nThere are four exams during the course of the semester, none of which are cumulative. He requires you to read the textbook, but I looked up the terms at the end of each chapter an hour before each exam and it's worked out very well. On the first day of the class, he will say he doesn't curve - but it's not actually true. He curves at the end of the course, not each individual exam. \nHighly recommend! \nWorkload:\n4 non-cumulative exams (curved at the end of the semester).\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "May 22, 2013",
            "review_content": "\nProfessor Stroessner is amazing! The lectures were really interesting and he makes class funny and enjoyable.He really cares about his students and is very approachable. In order to do well, you should attend the lectures and take good notes. Reading the textbook also helps because his exams are a mix of book and lecture. Even though his tests can be a bit hard, they are totally manageable, I am not a psychology major and still did well. I definitely recommend this class!!\nWorkload:\nThree to four chapters per exam, 4 non-cumulative exams with multiple choice and short answers\n"
        },
        {
            "course_name": "Psychology of Stereotyping and Prejudice",
            "review_date": "December 17, 2012",
            "review_content": "\nProfessor Stroessner is just the man! He is so kind and caring-- and genuinely seems interested in his students. When I met with him in his office, he made me feel so comfortable and was extremely accessible and helpful. It is clear that he has a real handle on the material he teaches. He is certainly one of the gems of the psychology department, and I wish I would have met him earlier on in my college career. He is truly just a great man with the sweetest demeanor, yet so bright and thoughtful at the same time.\nWorkload:\nsome posts, discussion leading once, and a 15+ page paper at the end\n"
        },
        {
            "course_name": "Psychology of Stereotyping and Prejudice",
            "review_date": "November 06, 2011",
            "review_content": "\nSteve Stroessner is possibly the chillest person I have ever met. But simultaneously, he's very passionate about his subject. He introduces the first day of class with \"we should all learn each other's names, since I'd like to know who I'm arguing with\", which should give you a pretty good idea of his teaching style. He loves to hear what students have to say but also likes for you to hear what he has to say too. He will play devil's advocate to every point you make, but it really helped me to get a better grasp on the material. He is very quick in responding to emails, is happy to meet just to talk about anything, and he's wonderful at helping you understand the many psychological tests used in the studies. Steve also knows most of the social psychologists who wrote the papers we read, so he would tell us anecdotes about the researchers and gave us a lot of insight into what was going on when the studies were being done. Overall, a very interesting, insightful, and easy class.\nWorkload:\nRead 3 articles a week (which vary in length, but usually about 10-15 pages each) but they're research papers so you don'y have to read every fact and figure, and one research paper at the end where you design your own experiment related to the course material. You also lead one of the lectures during the semester with a partner.\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "May 15, 2011",
            "review_content": "\nProf. Stroessner is a great professor and I would highly recommend taking his class. As you'll read in the other reviews, his course is not easy, but the material is so interesting that when it comes to studying for the tests, you might actually enjoy it! I took the class because I'm a psych major and it definitely was way more challenging than my other psych classes. Nevertheless, I wouldn't miss out on this class! He's a great lecturer and is really responsive if you have questions. \nBottom line- take the class!\nWorkload:\n3 non-cumulative tests. Not easy, but with the proper preparation, you can do well.\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "May 02, 2011",
            "review_content": "\nThis class is GREAT. The lectures are always interesting and Professor Stroessner always adds current examples and anecdotes that make his lectures enjoyable. Take good notes and do the reading for the exams, they show up on the tests. Overall, a class I always wanted to attend. He does post his powerpoint lectures, but the studies he talks about are hard to understand without going to class.\nMake sure you study for the exams, they're definitely not easy, but completely doable. \nWorkload:\nJust reading. 3  multiple choice and 2 short answer question exams, the final is one of them and is non-cumulative. Really fair, but not easy.\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "May 06, 2009",
            "review_content": "\nProfessor Stroessner is GREAT!  His lectures are really interesting, and he is great at answering students' questions during class.  If you are interested in Social Psychology, DEFINITELY take it with him!  He posts his powerpoints, but I still highly recommend going to class, because it will be much harder to study the powerpoints if you don't.  The tests are not easy--I've taken a similar class before and I study and I still get Bs.\nWorkload:\n3 tests (2 midterms, 1 final, all non-cumulative).  MC and two short essay Qs.  There is generally about 5 chapters of textbook per exam.  Not super easy!\n"
        },
        {
            "course_name": "Social Psychology",
            "review_date": "June 26, 2007",
            "review_content": "\nOh my goodness, such a boring and self-absorbed class.  Don't bother reading the textbook, just go to class and copy down notes like the other mac drones in the room.  Listening to stupid questions makes lectures just tedious.  Exhibit A: \"Why are mixed people more attractive than you know, one race people?\"  And then, cue 10-minute awkward response.  Don't waste your time...not good enough to merit your attendance at every lecture.\n"
        },
        {
            "course_name": "Social Psychology",
            "review_date": "May 23, 2007",
            "review_content": "\nStroessner is fantastic!  His lectures are consistently engaging and interesting!  You do not have to be a psych major to enjoy the class either!  Take it!\nWorkload:\n3 midterms- a bit tricky sometimes but generally fair\n"
        },
        {
            "course_name": "Social Psychology (lecture)",
            "review_date": "May 10, 2007",
            "review_content": "\nStroessner is a really nice guy. This class is laid back and enjoyable. Tests are lecture based with a few questions from the book. My only criticism is his lectures are a little fast and since there are no slides and he doesn't really use the board you have to pay attention and write quickly (and also attend class). However, compared to other psych courses the exams aren't that tricky and again Stroessner is a super nice guy. very manageable course.\nWorkload:\n3 exams-all same length, format, and noncumulative\n"
        },
        {
            "course_name": "Social Psychology",
            "review_date": "May 11, 2006",
            "review_content": "\nVery enjoyable professor. His lectures are straightforward, engaging and very interesting. The reading is not that heavy, but you will enjoy every aspect of it.\nWorkload:\n3 non-cumalative tests- each covers about 4 chapters of material. The tests are mostly multiple choice with two short answers. Overall, a great class to take.\n"
        },
        {
            "course_name": "Social Psychology",
            "review_date": "October 05, 2005",
            "review_content": "\n\nWorkload:\nI just wanted to make one comment about his tests. The book is important. There are definately questions from the book (for example, detailed questions regarding percentages etc.) Also, for the final, atleast 10 questions were directly from the book- if you read the chapter carefully, the answers were obvious. in short: READ THE BOOK! \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "June 15, 2005",
            "review_content": "\nProfessor Stroessner is hands down one of the best professors i've ever had.  He's laid back & funny while still conveying incredibly interesting material.  His lectures are (despite what another obviously delirious student said) incredibly well structured and highly interesting.  Exams seemed easy, but that's only because he prepares students well and adequately tests what we had learned.  He also brings in examples from experimental research--which is much more interesting than simply stating ideas & theories.  I wasn't in the lab for social psych but I wish I had been--not because the class was particularly difficult without it, but because I think it would have been a lot of fun!   I really can't say enough about how much I liked Stroessner's courses!!  Take him for whatever class you can!!\nWorkload:\n3 exams...notes are more important to review than the book\n"
        },
        {
            "course_name": "Social Psychology",
            "review_date": "June 06, 2005",
            "review_content": "\nExcellent Professor.   Available outside of class.  Our final was scheduled to take place from 7-10 PM  but I went to his office at around 4  and asked him if I could take it then just to get it over with.  He said sure and didn't give me any problems about it.  That's just the type of person he is. Easy to talk to.  Only criticism is that he sometimes has trouble striking a balance between lecture and discussion.  It's a social psych class so everyone remembers \"a time when . . .\" happened to them and 3 examples is really suffiicient.\nOverall grade for professor:  A\nWorkload:\n3 exams, non-cumulative.  Between 1-2 chapters of reading/ week but doesn't really need to be read until before the exam (but definately needs to be read)\n"
        },
        {
            "course_name": "Social Psychology",
            "review_date": "May 16, 2005",
            "review_content": "\nIf you are not a psych major do NOT take this class with Stroessner.  I admit the subject matter was interesting but sitting through class was torture.  I should have known from the first day when he said that his lectures can change depending on the questions of the students.  Well the people in my class asked so many questions that he never really got through the material in class.  You had to study the book and the notes in depth.  Since he never really explained things in class you were left alone trying to figure out what is important and what everything means.  Stroessner thinks to highly of himself.  The psych majors play up on his fullness by laughing along at all his personal life stories.  I was not in the lab and felt that people in the lab had an advantage since the tests questions were geared towards many lab exercises.  If you are a student who likes to learn in class and know what to expect this class is not for you.  We spent one whole day discussing when to have the final exam.  Even though he is accomodating to people's needs come on you are the professor so make a decision and stick with it.  One whole lecture lost to people compl aints.  Oh and lecture notes differ from the order of the book so the class is harder than it should be.  TIme is spent trying to figure out where the notes fit in with the book.  \nWorkload:\nNot so much but exams are tricky, especially when you learn so little in class.  \n"
        },
        {
            "course_name": "Psychology of Stereotyping and Prejudice",
            "review_date": "November 18, 2004",
            "review_content": "\nEvery psych major ought to be required to take this class.  That being said, it can be fairly hard to get into as Prof. Stroessner is deservedly in high demand.   He is an excellent teacher, challenged both our perceptions of the world and our academic skills.   In retrospect, this class seems easy, but while I was taking it was very time consuming. The time spent was soooo worthwhile, I have learned so much about both theories in psychology and psychological research methods that all of my other psych classes became extremely easy.  The skills I learned in this class allowed me to get a summer research job and a TAship that would otherwise have been out of my league.   This course might be a bit too much for non-psych majors, but you aren't likely to get in anyway.   For psych majors, take social psych as soon as possible if only so you can take this course.\nWorkload:\nintense, but I loved every minute of it.  3 journal articles a week, weekly response questions.  Lead one class discussion.  Final Project: write a journal article, without the data.  \n"
        },
        {
            "course_name": "Psychology of Stereotyping and Prejudice",
            "review_date": "November 18, 2004",
            "review_content": "\nEvery psych major ought to be required to take this class.  That being said, it can be fairly hard to get into as Prof. Stroessner is deservedly in high demand.   He is an excellent teacher, challenged both our perceptions of the world and our academic skills.   In retrospect, this class seems easy, but while I was taking it was very time consuming. The time spent was soooo worthwhile, I have learned so much about both theories in psychology and psychological research methods that all of my other psych classes became extremely easy.  The skills I learned in this class allowed me to get a summer research job and a TAship that would otherwise have been out of my league.   This course might be a bit too much for non-psych majors, but you aren't likely to get in anyway.   For psych majors, take social psych as soon as possible if only so you can take this course.\nWorkload:\nintense, but I loved every minute of it.  3 journal articles a week, weekly response questions.  Lead one class discussion.  Final Project: write a journal article, without the data.  \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "January 09, 2002",
            "review_content": "\nStroessner is a great lecturer and he's laid back about letting you interrupt him to ask a question anytime during lectures. He's also very approachable and considerate of students' needs. He even sometimes changed dates of when assignments or exams were to accomodate to the students in the class. One time, he even proctored one exam at 4 different times because he changed the date of the exam from the one he wrote on the syllabus and felt bad that he might have messed up people's studying schedules!! (how considerate unlike other professors who seem to think that their class is the only one you're taking that semester) He spent more or less time on the material depending on how the class was doing with it claiming that he doesnt need to be \"religiously slavish\" to his syllabus b/c its more important that we understood the material. In addition to being a great teacher, he makes lectures and recitations fun by relating the material to real life, including anecdotes from his field of research (social psychology). I'm not a math person, so I was scared of taking this class but now I am convinced that Stroessner can teach any subject matter if he can teach someone like me not only to solve stats problems but to understand and appreciate it! I highly suggest you take him for not only this class, but any other class he's offering.\n"
        }
    ]
}