{
    "prof_info": [
        {
            "prof_name": "Joel Bellaiche",
            "prof_id": 2223,
            "total_reviews": 30
        }
    ],
    "reviews": [
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 07, 2007",
            "review_content": "\nIm taking this class as a Pass/Fail so i dont really care about my grades so this review may be biased.\nI think he's really quite bad as a teacher. You dont understand what hes saying sometimes and you just go in and copy the stuff he writes on the board.ive really learnt nothing much, and the little part that i do, i gain it from doing the homework\nThat said, he tries to be reasonable and he knows when students are facing difficulties i.e when hwk is too much or finals clash with other subjects. He is quite accomodating when it comes to this\nQuite a couple of students score well too, so i guess this should be considered an ok class(personally i found it hard but i guess if you just memorize his midterm practices it should be ok). But if you want to learn,forget taking him\nWorkload:\nweekly hwk, 2 midterms (20 percent each) and 1 final (40%)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 25, 2007",
            "review_content": "\nThis prof seems okay enough teaching the class. The usual fare workload with weekly homeworks, but he sucks when it comes to being responsible outside of class. The whole time he talks to the board, and runs as soon as time is up. It's hard to catch him. When you do, he'll be nice though. HOWEVER, remember to check homeworks with him. He's quite irresponsible with handling homeworks and losing them. So you might end up with 0, and that's just too bad because he ignores you after that and never tries to fix stuff. Mainly, if he made a mistake, he will avoid you for as long as he can. You'll never find him. Take him if you want easy homeworks and tests. DONT take him if you are one of those people who will cry after finding out half of the things you did were lost by the end of the semester\nWorkload:\nfairly light. Problem set due every week. 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "March 06, 2007",
            "review_content": "\nDo not let his thick French accent deter you!  Try to get used to it for the first few classes before you switch out.  He is a very clear lecturer if you can understand him, and he writes everything out clearly on the board even if you can't.\nProblem sets are pretty easy and not very time-consuming, and if you can't get a problem just go to the help room you should be fine.  The weekly textbook assignments are useful if you are confused about any topics, and I would HIGHLY recommend looking at them before exams, because he bases many questions off of them.\nThe exams are doable, like more difficult versions of the problem sets.  There were very generous curves on them so the final grades were very inflated.\nWorkload:\nWeekly problem sets (~3 questions), weekly optional textbook problems, 2 midterms, 1 final, extra credit\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 22, 2007",
            "review_content": "\nBellaiche is not all that bad actually. take his class if you have taken calc in highschool. it will be a breeze. his problem sets can be really difficult but they are doable. midterm and final resemble practice exams. \nWorkload:\ndecent\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 16, 2007",
            "review_content": "\nThis class was pretty easy. Problem sets are due every 1.5 weeks. Sit up in the front since his handwriting is barely discernable. His accent is pretty heavy as well. Besides those two complaints, he is an excellent teacher. I still got an A in his class. The midterm was easy but the final was definitely not cake. Just look over old problem sets and old exams he posts.\nWorkload:\nLight. 1 easy midterm. 1 hard final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 07, 2007",
            "review_content": "\nBellaiche is a decent professor. Definetely not great--his notes are often drawn out proofs that have little relevance to the problem sets. I ended up learning most of the material from the book and a genius who lived on my floor.\nI found the examples he gave in class and the problem sets either incredibly easy or incredibly hard. This was the same experience on the midterm and final.\nWith this in mind, his curves are extremely generous. For our second midterm, he just added 20 points straight up to everyone's grade-- so a lot of people had over 100.\nAlso, he gives an extra credit (which was incredibly difficult, made 0 sense, and my response was complete B.S.)- but I still managed to eke out the 3 points to your average that he promised. \nOverall, I wouldn't reccomend him if you actually want to learn Calc III. However, if you are a student who just wants to get this class over with for say an economics major, then it won't be too hard to do well in the class. \nWorkload:\n12 Problem Sets. 10 are counted (20%). As I said earlier, some are really easy and some are really hard. \n2 midterms (20% each) and 1 final (40%). If you do the optional problems in the book to study for the test, then you will be fine after the curves. The problems on the midterm and final aren't hard as long as you memorized the main formulas of the chapter. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 19, 2006",
            "review_content": "\nProfessor Bellaiche is one of the better instructors in the Math Department.  Yes, he has an accent, but you'll get used to it.  His boardwork is clear, and it makes sense - most of the time.  It usually helps to review the concepts in the book before going to class.  Also, he has a nice curve.  When you make a B on a test it curves up to an A-.  If you have to take calc 3, pick him\n!\nWorkload:\n1 problem set a week - they're challenging so i usually went to the calc help center for help.  the first midterm is just like the practice midterm.  The second midterm and the final are harder.  They are more like the problem sets.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 18, 2006",
            "review_content": "\nThis class is like a roller coaster ride. \nThe lectures jump around a lot, and the problem sets aren't too difficult. Be prepared for a few short, but very involved problems. And while the homeworks aren't too bad, out of nowhere come the tests, which are ridiculously hard. DO THE PRACTICE TESTS!!! They are basically alternate versions of what you will face in the midterms/final.\nJoel is a nice guy, but his accent is a bit dificult to understand, and his lectures are pretty boring.\nWorkload:\nSemi-easy weekly problem sets. 1 hard midterm, 1 easier midterm, and a difficult final (you can always tell by the practice exam).\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "June 08, 2006",
            "review_content": "\nRun away from this course.\nHis accent is not understandable, he lapses into French, and speaks to the blackboard. His problem sets and exams are exceedingly difficult, even though there is a good curve. Even though he is a nice man, this does not make up for an overall painful experience. \nWorkload:\nweekly problem sets, two exams, a final\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "March 20, 2006",
            "review_content": "\nA nice guy, but pretty mediocre on the teaching.  His accent and handwriting are very difficult to interpret which definitely impact my grades as I have trouble referring to what he is specifically talking about (n or m, v or u, capital or lowercase).  His teaching is very heavy on proofs, which is pretty useless if you are not going into mathematics.  Skip this class, if you can.\nWorkload:\n2 midterms, final, weekly homeworks (light).  Everything is graded very harshly.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 05, 2006",
            "review_content": "\nBellaiche is a good professor to have for Calculus III. His accent is definitely penetrable and his teaching methods are clear. It is true that he does not make eye contact, but he is very student-friendly if you see him during office hours.  \nMake sure you do the non-graded homework assignments in addition to the psets. Most of the midterm and final are literally questions from the book with slight modifications. Also, do the extra credit! It's a very generous 4% points added to your final grade. As long as you understand what he says in class and understand the homework, you will have a good experience in his class. \nWorkload:\nvery easy psets, medium midterm, medium final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 13, 2005",
            "review_content": "\nHe's one of the best professors I have had at Columbia, because he actually knows how to teach in addition to being a genius. Prof Bellaiche does have a thick French accent, but if someone like me (who has never had to deal with French in all my life) can understand him by the end of the second class, anyone can. His handwriting's neat on the board, and he writes practically everything he says, so even if you have problems with the accent, it won't matter. \nProf. Bellaiche never gets lecture notes to class, but he still explains the chapter on the board in such an organized fashion that the problems become a piece of cake! Prof Bellaiche really draws the students into math, and he is a very nice person too. He is very approachable - he has very regular office hours, and you can always find him there. I would definitely recommend taking him for any math class (or french class, for that matter :)\nWorkload:\nProblem Sets of 2-3 problems due each week. Very easy, but check answers with classmates to not have careless mistakes. Out of 12 problem sets, 2 get dropped. Also gives homework that is not graded. Compeletely optional, but I would recommend doing it b/c problems on midterms closely matches the homework from textbook. 2 Midterms and 1 final. All three are crazy hard, but his curves are GENEROUS! This was the curve on Midterms:\n70% B+\n75% A-\n80% A\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 20, 2005",
            "review_content": "\nMixed review.  When you first join the class, you can understand nary a word Prof Joel speaks.  His accent is bordering on ridiculous and he occasionally lapses into French.  He also speaks very quickly and toward the chalkboard, exacerbating the issue.  After a few lectures, you realize that he is teaching straight, example for example, out of the book.  Which is for the best, really.\nAll that being said, he is a relatively lenient grader and so earnest and nice it is hard to honestly complain about him.  Sure I could have just read the book and taken the test.  But he ends every sentence with a \"voila\"\nWorkload:\nLight.  Weekly problem sets due.  Two tests and a final.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "November 16, 2005",
            "review_content": "\nFirst of all, let's be fair to Joel. His accent is AWFUL, but only for the first few days of class. Eventually, you get used to it, and his handwriting is not bad. It's just math, verbal explanations aren't even necessary if you can follow his basic steps, which he writes in painstaking detail on the board. Everything is explained, over and over, and reemphasized in later lectures. It's basic, but you come out of the class with a comprehensive understanding of each problem and every proof that goes into it. He also does his lectures without any notes. It's amazing how the proofs and examples just come out of his head. He truly is brilliant, and a very nice man. And he's just so darned likeable!\nWorkload:\nweekly problem sets, 2 midterms, 1 final. If you go to class, problem sets are much easier. Besides, he has a HUGE curve. Like ginormous.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "June 21, 2005",
            "review_content": "\nProfessor Bellaiche looks to be like one of the most nervous men ever while he's teaching.  He will rarely turn away from the board, which makes him even harder to understand, on top of the fact that he has a very thick French accent.  Despite all this, Professor Bellaiche is a very thorough professor who is definitely understandable.  His accent takes some getting use to, but he explains things inside and out, almost to the point of monotony.  We actually didn't get as far as we should have in the material because of this.  It is almost pointless to ask him questions in class as he has a hard time understanding what you're talking about.  He is however an extremely smart man.  He lectures without notes and proofs are done on the fly.  He is extremely nice and has a HUGE curve.  I mean really really big. \nWorkload:\nEasy weekly problems with 3 problems.  2 moderately easy midterms and a fair final.  HUGE CURVE\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 14, 2005",
            "review_content": "\nProfessor Bellaiche is an organized and thoughtful teacher.  It takes a couple of classes to get used to his accent, but it's worth it.  He does the whole class without notes - it's all in his head, but it comes out well.  Unlike other teachers, he goes over the main concepts and then gives examples in a very organized manner.  He's very approachable and doesn't mind questions in class (either about an error on the board or further explanation though of course it IS a lecture, so there aren't many questions).\n He's very understanding and willing to help.\nMy main complaint about this class was the logistics.  The TAs were pretty bad, and Professor Bellaiche could have done a better job taking charge.  We didn't get our second midterm back  until after classes ended (and I still don't have mine which hasn't yet been resolved)..  Also, Professor Bellaiche didn't write our final, and the math department had to come up with something last minute, and one of the problems was on something we didn't go over (though it may not be counted).  But the problems abouot the final were understandable because Professor Bellaiche had a death in his family and had to return to France.  This is more a complaint of the math department's handling of the situation.\nWorkload:\nproblem set every week (just a few problems), optional additional HW problems, 2 midterms, final.  Very reasonable workload.  Helps to read the sections in the book before class.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "April 13, 2005",
            "review_content": "\nHis accent is really horrible; worse than his sometimes illegible handwriting.   But he is a really good guy who knows his math.  I recommend this class to anyone who likes physics; he tends to put lots of physics applications on hw and exams.  Proofs too, sometimes.  But generous grades.  Odd habit of literally running out of class before anyone can talk to him, though.  As if he were scared of his students.\nWorkload:\nA problem set a week, two midterms, final.  not heavy at all.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 02, 2005",
            "review_content": "\nExtremely nice man. Not a great teacher but HW isn't terrible and is an extremely good curver.\nWorkload:\nOnce a week + 2 midterms\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2005",
            "review_content": "\n He's very nice guy.  but you gotta be smart to do well in his class because problems on his exams require are very creative and very different from the ones in the textbook. he emphasized alot on application of what you learned.  I personally never went to his lectures and relied entirely on the textbook to study.  \nWorkload:\nHW problems range from extremely easy to completely undoable.  two difficult midterms and final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 05, 2005",
            "review_content": "\nOn the first day of class he scribbled his email address on the board, something like \"jbellaiche@free.fr\" or something.  Someone asked him to explain the scribble that stood for \"free,\" and he replied, \"Free, like ze number.\"  Although he definitely is a nice guy, who helped me many times in office hours, the language barrier was entirely too much to deal with, and I should have transferred out.  I really have no idea what I was supposed to learn in Calc III, I guess I didn't really do any work  for the class during the year except to cram for exams and that's why I got burnt.\nWorkload:\n2 difficult midterms and a difficult final, and eratic but generally weekly unannounced problem sets (check his website constantly).\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 02, 2005",
            "review_content": "\nHe really knows what he is talking about, however, the language barrier sometimes inhibits his communication.  Yet he always mangages to thoroughly answer student questions.  He does his best to give us as much credit as possible for our work and is understanding in his assignments.  For example, he initially assigned me two physics extra credit problems, and after I emailed him back and explained that I did not know very much about physics, he assigned me two other extra credit problems.  He is a really nice guy who tries to help his students out as much as possible.\nWorkload:\nWeekly problem sets\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 28, 2004",
            "review_content": "\nHeavy French accent.  Lectures to the board.  Nice Guy.  Way too much physics in this class, especially for those of us who want to learn math not physics.  You need to attend all of the lectures to do well in this class.   He spends a lot of time on the geometry and then did not get through all of chapter 14, which includes an important section on Lagrange multipliers that our class skipped entirely.\nWorkload:\nThe problem sets were easy when compared with the test, and the preparation for test did not include warning about all of the physics.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 25, 2004",
            "review_content": "\nA man with an accent yes, but he's clear, concise, and linear in classes (besides his occasional forays into proofs). Very easy. I never read the book, went to most of the lectures, and did very well. As others have said, just doing the homework and the training exercises for his tests will be all the studying required to do well on the tests.\nWorkload:\nEasy 3 problem weekly problem sets, 2 midterms and a final, all heavilly curved.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 24, 2004",
            "review_content": "\nI have to dissagree with some of the other reviewers. Professor Bellaiche is a great teacher. I never read the book, but I went to all the lectures--at 9:00am.  Even though the time was incredibly early, I managed to get up every day and the lectures were good enough to keep me awake. His accent is bad, but easy to get used to if you go to class regularly; plus it kept me attentive at the early hour. True his handwriting is pretty bad, but it is not so horrible that it detracts from the value of this class. I do feel as though I have learned a great deal from Prof. Bellaiche. And for the small amount of work I do, I am getting a very good grade. I would reccomend this class without reservation.\nWorkload:\nVery light. A problem set a week (usually pretty easy), two midterms (with more than generous scales) and a final.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 21, 2004",
            "review_content": "\nAs you can see from the reviews below, his accent stinks.  In addition, his handwriting was absolutely horrible, although it improved somewhat over the semester.  My advice is to email him, as he is pretty coherent then.  This is my first review, and I am reviewing him because none of the reviews talked about him teaching physics.  You know how the textbook likes to cover applications, mostly physics and some probability?  Well, he covers it all.  On the tests, you will be expected to calculate the moment of inertia, solve the equation for damped vibrations, etc.  You shouldn't really be at a disadvantage if you haven't taken physics, as it's just a few extra formulas, but it'll make you dislike the class more if you don't like physics.\nAlso, he has contradicted himself regarding grades.  Perhaps it's because it's his first semester, but if I am to believe his last statement regarding grades, it should be alright (although since so many people dropped his section, the class is pretty self-selecting)\nPS: His paper mobius strip was a little cute, but a pretty crappy attempt at using a visual aid\nWorkload:\nBest 9 out of 11 homeworks.  Two midterms, final\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 18, 2004",
            "review_content": "\n   He has a heavy french accent but he is generous man with massive curves. I almost never went to classes because there were people from my floor who went for me and I basically got their notes. For midterms and final, he gives extremely helpful midterm and final training problems. (a few of them are always on the acutal exam too!). Take this class if you are not going to class, but you can learn out of books. Just take a brief note and write down formulas to study for exams and you will easily get above 85. I personally had a very easy math class this semester.\nWorkload:\n2 midterms, 1final and kind of hard extra credit which can bring up to four points from your FINAL GRADE, <- Very awesome!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 15, 2004",
            "review_content": "\nJoel is foreign like other math professors.  However, his writing on the board is mostly clear and note taking is not a problem usually.  After you get past his accent, the lectures are informative and help with completing the work.  His grading is fair ( tests are curved pretty steeply) and the workload is manageable.  2 midterms, 1 final.  Bellaiche is nice/approachable and quirky/funny because he's foreign.   I was satisfied with this class in general and highly recommend Joel for Calc 3.\nWorkload:\n2 midterms, 1 final, collected problem sets (about 1 per/wk), practice problems (not collected), \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "November 19, 2004",
            "review_content": "\nI like to think of myself as a relatively intelligent person, but I cannot get over the major lapse in judgment I had by not dropping this class and taking a different section.  Our class ended up with an average of seven people attending lectures, with less than eighteen there on test days.  Avoid, avoid, avoid.  Reason one for avoidance: his French accent.  Not merely an accent, but sometimes, full out French.  Unless you know that \"eegreck\" means \"y\" and \"squah\" means square, you will not understand him.  Reason two for avoidance: he does not answer questions, and practically runs out of class at the end.  In retrospect, I fully regret taking calc with this man.\nWorkload:\nWeekly problem sets which are short, but difficult.  Two very challenging midterms, one final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 18, 2004",
            "review_content": "\nHe has a pretty heavy accent but writes most things on the board. His examples are sometimes way too easy to be helpful. Problem sets usually aren't too hard. First midterm was easy, but second was quite difficult... he curves fairly though. Not recommended, but if you're good at math, he's not too bad if you're stuck with him.\nWorkload:\n3 question problem sets almost every week,  2 midterms, and a final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 17, 2004",
            "review_content": "\nI stepped into his class the first day and found myself understanding 40% of what he was trying to articulate.  I found it hilarious and thus, stayed on.  Bad mistake.  Well firstly i must say that Prof. Bellaiche is REALLY nice.  I mean, he entertains any questions beyond his office hours and tries his very best.  Finding a math prof without an accent seems pretty impossible here in Columbia, so i do think that Prof. Bellaiche is the lesser of the evils amongst the other Cal III profs.  So by all means, take his class.  It is not THAT bad despite the accent. \nWorkload:\nOne problem set a weak, not difficult, he is very flexible towards deadlines.  Do not take advantage! 2 Mid terms of 20% each and a final of 40%.  \n"
        }
    ]
}