{
    "prof_info": [
        {
            "prof_name": "Ewa Kara",
            "prof_id": 2878,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 01, 2007",
            "review_content": "\nI have personally been publicly embarrased by Ewa Kara. She has no regard for the barrier between personal and private relations and no concept of student privacy, as she routinely announces to the class her personal opinion on each student's writing skills. while her comments on each individual essay can be quite insightful, her skills as a teacher have much to be desired. She cannot mediate discussion, cannot give clear or straightforward assignments, and is utterly incomprehensible when it comes to deadlines, due dates, and other such inevitable details of University Writing. \nWorkload:\nThe standard UW syllabus, plus some extra petty assignments that were more frustrating and busy-work oriented than interested in content. 3 \"big\" essays and 1 retrospective essay.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 10, 2006",
            "review_content": "\nI don't understand the Ewa bashing that goes on at CULPA.  After reading the reviews, I was a bit neverous about the class.  After the first few weeks I realized that many of the criticisms listed in other reviews are baseless.  First of all, her command of English is perfectly fine.  Obviously her linguistic background means she has an accent, but her written comments demonstrate a more than adequate command of English.  Ewa is fun and promotes conversation in the class.  She is genuinely very nice and wants her students to do well.  UWriting is by nature rather painful because of the sheer absurdity of some of the assignments, but that is hardly her fault.  As it is, Ewa puts more effort into the class than any of the students.  She is willing to meet outside of class to work with students.  If you actually work on her suggestions you will become a better writer, but even if your basic intent is to just \"get through\" the class this should be relatively painless.\nWorkload:\nDepends on your motivation - work hard and you will succeeed.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 08, 2006",
            "review_content": "\nAfter reading the reviews on this site I was terrified on the first day, but I have found Ewa to be a decent instructor who is immensely helpful in reading drafts and suggesting changes. Though she does have trouble speaking english, her comments on my papers are complex and multifaceted, indicating a mastery of the minute implications of the nuances of my own essays. While clarity is lacking as a result of the language barrier, she is a relatively easy grader and the classroom experience is relatively painless and discussion based. \nWorkload:\nVery heavy. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 17, 2006",
            "review_content": "\nEwa is the most terrible teacher I have ever had in any subject ever.  At first I was slightly frustrated with her inability to communicate and explain assignments, but I attributed that to the language barrier (she has a Polish accent and lacks an understanding of various nuances in the English language).  She was obviously nervous during the first few classes, but I still gave her the benefit of the doubt--maybe things would get better once she became more comfortable with us.  WRONG!  She constantly told our class we were stupid when the real problem was that we could not understand what we were being asked to do.  We had to rewrite more extensively than other UW classes simply because she had not explained the assignment well.  She would randomly explode and scream for the tiniest things, such as nail-biting.  Rather than helping us each develop our individual writing style, she had us awkwardly contort our papers to her rigid style.  She obviously did not know how to relate to us and made assumptions about our past in terms of both cultural background and education.  \nWorkload:\nSame as other UW classes: 4 essays in all with multiple extensive revisions\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 06, 2006",
            "review_content": "\n   I'm sure Ms. Kara is a wonderful person, but she really should not be teaching. She cannot handle a class of even 12 people.\n   She gets frustrated as hell over weird little things (like when students begin their emails to her with 'Ewa,' instead of the more appropriate and respectful 'Dear Ewa') and she takes out her frustration by yelling at students and publically embarrassing them. She has been complained about to the director of the U Writing program by several people.\n   When it comes to the papers she doesn't grade terribly hard, and usually makes some insightful comments, but has no idea how to correct grammar. Ms. Kara has no control over her class and conducts herself in a very unprofessional manner. If you get her section, get out, or hope she's toned down.\nWorkload:\nsame as all U Writing sections\n"
        }
    ]
}