{
    "prof_info": [
        {
            "prof_name": "Ruairidh Macleod",
            "prof_id": 11587,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 03, 2012",
            "review_content": "\nI HIGHLY recommend taking CC with Ruairidh Macleod, or any other course that he may teach in the future. He is one of the most all-around exceptionally effective instructors that I've had at Columbia!\nThroughout two semesters of CC, Ruairidh continued to exceed our expectations. He clearly dedicated a lot of his time to preparing for every class, providing us with extra resources for every text and philosopher and incorporating many different methods to try to keep the class engaged and interested. He encouraged every student to attend his office hours or arrange times to meet with every one of us individually, and he is quite approachable. He cares tremendously about the personal well-being and success of every student.\nTo get the most out of his class, you need to actually do the readings. He never called anybody out or chastised us when he knew we hadn't read (he seems to understand that the quantity of reading on the CC Syllabus is just unreasonable), but since he always facilitated rich discussions rather than just superficial details about the texts, it was pretty clear when many of us hadn't read anything.\nHis demeanor and clearly extensive knowledge of philosophy can be pretty intimidating, but he made great efforts to encourage every students' participation - even those of us who are ordinarily too timid to speak up in seminars. Throughout the entire year, Ruairidh demonstrated respect for everyone's opinions and didn't even criticize the students who said totally ridiculous things in class. His thoughtful responses make you feel comfortable discussing in class, knowing that he won't reject you.\nHe also has a charming British accent.\nWorkload:\nThe typical reading assignments for CC and two papers per semester. However, Ruairidh is very empathetic to extenuating circumstances. He frequently made reasonable compromises with our class regarding due dates, extensions, and assignments during both semesters!\n"
        }
    ]
}