{
    "prof_info": [
        {
            "prof_name": "Erica Richardson",
            "prof_id": 12766,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 19, 2013",
            "review_content": "\nErica was a great instructor for UWriting. She's a grad student in English, so she knows how difficult it can be to write, and really helps you out.\nConsidering it's probably going to be next year's freshmen reading this review, just a quick overview: in UWriting you have 4 papers, and each paper you have to have 1) an exploratory draft, like a freewrite where you put your ideas on paper, 2) a formal draft, meant to be like what a final paper was in high school, and 3) the final draft, which is supposed to be your last and best work.\nAdmittedly, at the beginning you have to remind her to give you really harsh comments on the first couple drafts of your paper, so you can fix those errors and get a good grade on the final paper (the only one that's actually graded). If you run over the time limit and need an extension, you can always email her and explain your situation - and you get two \"extension coupons\" at the beginning of the semester. All in all, if you write drafts on time, send it in, and go to her office hours in the Writing Center, you will have a great time in this class. I would highly recommend going to her office hours, just because having her look at your drafts (between formal and final is the best time to do it) considering she's the one grading them is a good idea.\nShe's a fair grader, and as long as you put actual effort into your exploratory and formal draft you'll be alright for the final draft. I didn't do well on the first paper (cuz I tried to bullshit), but the ones I actually worked on I got A's on. Just remember to work freshmen! This isn't high school anymore.\nPS - remember to show up for class, because if you don't you get a penalty on your grades.\nWorkload:\n4 papers\n3+ drafts per paper\n"
        }
    ]
}