{
    "prof_info": [
        {
            "prof_name": "Johanna Urzedowski",
            "prof_id": 9644,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 02, 2015",
            "review_content": "\nJohanna is an incredible teacher and person. She is someone who genuinely cares about her students- go to her office hours, I cannot emphasize that enough. On top of that, her knowledge is immense and she does a great job of making Lithum an enriching and fulfilling experience. She will make your first year experience in Columbia College live up to the reasons that you came here. Everyone in this class came prepared and excited to go over the readings, thanks to Johanna's charisma and teaching abilities. If you get her, you have won the lottery. If not, try to switch in!\nWorkload:\nChallenging, but at least generously graded. Not too intense a Lithum section, but not a joke either. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 27, 2014",
            "review_content": "\nAmazing professor. Discussions were always lively and interesting (and discussions rather than lectures), she didn't push topics she could tell no one was interested in, gave good background info and didn't expect you to have memorised each book. Really helpful with office hours and such and grading was more than fair. She basically made you want to come to the lesson prepared because she was just such a darling. Pretty much everyone kept the 9am class into the second semester for her. \nWorkload:\nTo the best of my recollection, 2/3 papers semester (6-8 pages). Midterm in same format as final. 2/3 reading quizzes per semester (which she warns you about in advance). Also a reading response every other or every third week, 100-500 words: doing them counts towards participation and 2 of them get marked. More than decent for LH.\n"
        },
        {
            "course_name": "Intermediate German II",
            "review_date": "April 15, 2013",
            "review_content": "\nJohanna is easily the best German professor I've ever had. She is an immensely brilliant and kind person who wants nothing more than for her students to learn. She assigns a lot of homework, which I was never too happy about, but she always goes over it in class the next day. I was lucky enough to have a very small class (about 8 people or less) so everyone always had an opportunity to talk (even though it was an 8:40am class which I don't think anyone was too enthusiastic about), but Johanna fostered a very comfortable environment where making mistakes was ok. She made it a point to write on the board a lot, which was helpful and allowed for her corrections to turn into more meaningful lessons than just calling someone out. \nJohanna is also a very opinionated (but understanding) intellectual. She expects a lot from her students in terms of content for the essays and discussions, but at the same time does not expect graduate level vocabulary. The course has a very heavy emphasis on German culture. We watched two movies, looked at art, and read a short play. We also took a trip to the Met on a Friday which was enjoyable, but all the discussion was in German. \nThe final project was to create a short comic book, changing the end of the play we read. \nOverall, it was definitely one of the more challenging German classes I've taken simply because it was not just about memorizing vocab, but actually THINKING in German. This made the experience that much more rewarding and Johanna is definitely the reason for that.\nWorkload:\nVocab lists and essays for every section (about 4 in total I think...maybe one or two more), corrected versions of these, no quizzes, a lot of textbook and workbook assignments for homework but these rarely get collected (but be prepared to discuss in class), one final creative project, and a solo presentation on your topic of choice \n"
        }
    ]
}