{
    "prof_info": [
        {
            "prof_name": "Umed Boltaev",
            "prof_id": 12511,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "December 06, 2012",
            "review_content": "\nThis wasn't stressed enough in the reviews: do not take this class simultaneously with Orgo I.  I's more than just a matter of being disadvantaged.  If you take this class beforehand, you will feel really frustrated by the depth of organic chemistry knowledge that is being demanded from you.  Don't think you can take this class without at least a semester of Orgo (no matter what the Chemistry department claims); it's definitely \"doable\", if you're willing to risk your performance in the other classes you're in.  \nThe reason for this is the quizzes - the prelabs and reports you can get help on, but the quizzes are by far the most challenging I've encountered in the Chemistry department.  Unlike the superficial, lightweight general chemistry lab quizzes, these are long and really demand thorough knowledge of organic chemistry.  Steel yourself. \nBut it's not all bad!\nThe only reason I (and many others) survived this course is because the people teaching leading it were extremely nice.  Always make sure to visit Rosa (very nice, in my experience) and your TA, they are incredibly helpful resources.  The three TAs I've noted above were particularly helpful: Steven is a great TA in the lab and in office hours, Umed is always willing to go over concepts  with you, and Cathy was extremely nice and good at explaining concepts.  Count yourself lucky if you ever come across any of them, for any class!'\nOverall: I'll say it again: don't take this class before completing at least 1 semester of Organic Chemistry!  The department doesn't require it (not happy with them), but the course does presume you know how to draw mechanisms and other general concepts (there are lectures, but they're meant to be rather simple).  If you have to take it, pray for generous, helpful TAs and a low curve.  The grade distribution is very generous, so try to make your work pay off.\nWorkload:\nAt least an hour of preparation for the lab (at least), plus another hour or two for the pre-labs. Study hard for the quizzes, pay attention to the mini-lectures and pre-labs.  If you're having trouble, talk to the professor.\nQuiz averages for my section were around 50% usually, I've heard of even worse averages.  \nThe reports are long and tedious, but I certainly didn't put 15 hours into them - my section had a page limit, and there are guidelines that make it easy. \nBe prepared to work a lot, and make sure to balance out the rest of your coursework as a precaution.\n\n"
        }
    ]
}