{
    "prof_info": [
        {
            "prof_name": "David Epstein",
            "prof_id": 462,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to American Politics",
            "review_date": "November 06, 2002",
            "review_content": "\nJust thought I'd throw in my two cents because everyone I knew in this class, including myself, hated it with a passion. I can see that Epstein is a nice guy and entertaining and all that, and I'm sure he knows a lot, maybe he's just not suited to intro classes. We all agreed that he knew nothing -- he was frequently stumped by student questions, and would just say \"Oh, I don't know...\" to things like how many wars America has fought in the last 50 years, for example. His lectures were full of boring and evident information... my inner monologue throughout the class consisted mainly of \"Thank you, Captain Obvious.\" And I'm not even an American. He was distracted, didn't seem to give a rat's behind about the class, and clearly wanted to be somewhere else (probably why he would show up 20 minutes late every day, not 10, as another reviewer erroneously stated.. I'm all for shorter classes, but when you show up on time, or even late, and still end up sitting around for ever waiting for your prof, wishing you were somewhere else, you start to get annoyed.). His anecdotes seemed more like showing off than like an effort to entertain us: they smacked of \"look at me, aren't I an important person?\". I'm sure he's brilliant, knowledgeable, and an expert in his field.. but I wish I hadn't taken this class. I just got the impression that the only person more bored than I was, was him. Understandable, but doesn't make for an enriching experience.\nWorkload:\nI'm sure it could be hefty, but I didn't do any of it and still got an A-. Oh, and no, you don't need to read any of it, not even the stuff the other reviewers told you to read. And you can skip recitation. Just put something on paper, and hope for the best.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 12, 2002",
            "review_content": "\nAll in all a great teacher to get, Professor Epstein is superbly knowledgeable (and seems to be professionally connected to current American politics) and brings a great deal of humor and personality to his lectures. He's more than a bit disorganized, often coming in 10-15 minutes late, but his lectures are almost always worth the wait. They're always informative and funny, and memorable for his millions of silly side stories that always seem somehow relevant. Never before taking his course did I think that a lecture of over 120 students could involve heated and relevant discussion, but it often did. Just be sure you get a good TA, or you'll be stuck in a boring discussion section to what could otherwise be a most fascinating complement to the great course.\nWorkload:\nWeekly reading, though you can skip the textbook if you attend all the lectures and take good notes. DO read the stuff from the course reader, as this material is rarely discussed fully in the lectures and takes up the brunt of the tests. Midterm and final. These really count, though, since there are no other written assignments. Study hard but don't worry too much Â— Prof. Epstein is a godsend when it comes to grading.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 03, 2002",
            "review_content": "\nYeah, Prof Epstein really is a great teacher. Sometimes (well...most times) his lectures were a bit strange. Like to teach us how a bill becomes a law he outlined every single step of the Voting Rights Act. And he'll put up tiny overhead copies of graphs in the book to illustrate a point which never really works but he took it all in stride. In a large lecture class (maybe 120), he answers questions, asks them, involves discussion a lot, and really gets in touch with the students. I think I fell asleep once in his class b/c I was feeling sick but that alone is a record for me. He drinks Mountain Dew or some other hi-caffeine drink every class, starts 10 or so minutes late, and always completes a good and usually funny lecture filled with insight and personal stories that you'll get nowhere else. If he's teaching the Intro class, take it. (As a side story: during the class before the midterm, he held a review. The kid in front of me brought in a slice of pizza and a large beer. Didn't take notes, but he ate and drank his stuff and left when he was finished.)\nWorkload:\nMidterm and Final. No papers. Big textbook is good for reading over for the lectures. Reading is key to the recitations and the tests. Maybe around 30 or less pages a week. Incredibly easy grader as stated in the other reviews.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 23, 2002",
            "review_content": "\nDavid is a great professor who gives interesting lectures and is a VERY, VERY, VERY easy grader. Take this class if you are American, live in America, or want to get a good grade in an intro class. Go to sections to discuss the IMPORTANT readings that will be on the midterm and final. Otherwise, sit back and enjoy this comical, Mountain Dew-drinking man.\nWorkload:\nGo to sections. Take a midterm with essay choices and IDs. Final is the exact same, only more choices for the essays.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 14, 2002",
            "review_content": "\nWhile at first David's knowlege on various general matters seemed lacking, he managed to prove otherwise by the end of the semester. He usually adds some interesting tid bit to his lectures inciting interest from his audience and showing his political insight. Friendly enough and approachable.\nWorkload:\nText book readings and readings for discussion. Not too bad. Exams are id/essay--not too demanding if you've really read everything.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 14, 2001",
            "review_content": "\nEpstein kicks ass, and this class is awesome. He knows what he is talking about completely, and tells lots of humerous stories that illustrate his points. He is not really accesible, although I e-mailed him, and he wrote back within a day. Also, he doesn't really give a rats ass about the class, so the curve is great (0=C, 79=A). The tests aren't hard if you went to lecture.Oh yeah, you learn a lot also.\nWorkload:\nMidterm, Final, weekly discussion section. Nothing too hard.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "December 13, 2001",
            "review_content": "\nProf. Epstein is a really nice guy, and he really knows his stuff - especially about voting (gerrymandering) and elections. He's a big guy in the PoliSci dept now (might even be a dean) and for good reason, in terms of the amount of information he has stored in his head. Unfortunately, he is ill-suited for an intro course; his lectures are, basically, let's write notes on the board and his tests are, basically, let's ask incredibly tough questions on stuff you didn't think you needed to know. Textbook is superfluous because he just summarizes it during lectures, but the reading for recitation is always on the tests in a big way and you've gotta go to recitation anyway, so you might as well read it. Overall, not a tough workload, tough tests though. TA's are completely arbitrary.\nWorkload:\nMidterm and final. Tough. Reading for recitation (10-20 pp/wk)\n"
        },
        {
            "course_name": "Game Theory and Political Theory",
            "review_date": "September 04, 2001",
            "review_content": "\nThis is a hard course, especially the first half. Grad level text for the Social Choice Theory half of the course (political theory) with heavy math and logic. Only one TA who is burned out and isnt really interested nor able to teach and explain. However, the second half of the course is much, much better. Game Theory was much more exciting and better taught. The saving grace of this class for undergrads is that it is a SIPA course and hence is curved for SIPA (with an A- as the mean most likely). Epstein himself is a very capable teacher (everything makes sense in class) and a nice understanding guy. Worthwhile if you're interested in Game Theory.\nWorkload:\n5-6 problem sets. The Social Choice Theory ones are significantly harder than those from the Game Theory units. Midterm and non-culmative final.\n"
        },
        {
            "course_name": "W4210 Research Topics in Game Theory",
            "review_date": "December 31, 1999",
            "review_content": "\nThe teacher is the man. He knows his stuff. He explains stuff well. Uses a lot of symbols in mathmatical explanations, but okay if you follow. Open style of teaching that allows for question interruptions. Seminar size class. Comes in 10-20 minutes late at times. If something political is going on, you are probably going to spend up to an 45 minutes discussing it, just for interest's sake.\nWorkload:\nThe class is mostly all grad students focusing on something or other. Problem sets due every other tuesday. Meets once a week for an hour fifty minutes. no midterm. final, either take-home or in-class depending on what the class and teacher decides. Difficult as all hell. If you like math, political science, a little psychology, and using logic, and feel like putting in long hours on problem sets every other week, it's fun. read an article or two every month, assigned.\n"
        }
    ]
}