{
    "prof_info": [
        {
            "prof_name": "Charles Zukowski",
            "prof_id": 2523,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Circuit Analysis",
            "review_date": "December 13, 2011",
            "review_content": "\nZukowski is a baller.  Maybe not quite like Vallancourt, but a baller nonetheless.  He starts class with a song to wake you up, and goes through the material in a very clear manner.  He also has show and tell in every class...unfortunately these could be more advanced, sophisticated, and interesting, but they still break up the monotony nontheless.\nI really enjoyed the material of this course, even if you never really progress past RLC circuits, power analysis, filters, etc.  All that stuff is still very useful in building practical devices, even if it is fairly basic.  (no diodes, discussion of rectifiers, etc.)\nPhasor analysis is also very useful.  I recommend getting very fast with imaginary algebra...make sure you know how to use a graphing calculator to check your calculations/to save time on the problem sets.\nThe lab for this class is fairly useful and practical thanks to Vallancourt's and the TA's rejiggering of the lab manual, but the lab writeups become increasingly tedious with the LTSpice simulations.\nZukowski is kind of a hardliner with deadlines, but the TA also didn't pick up PSets always on time.  Zukowski is still one of the best all-rounder profs I've ever had, and the EE dept. in SEAS, like any EE dept, really, probably isn't known for its teaching prowess.  But Zukowski really does care, which is incredibly awesome.\nWorkload:\nThe weekly problem sets are LONG and there are 11 of them.  Be prepared to spend every Friday working on them.  They're not impossible, and they are fairly leniently graded.  I was convinced I did fairly well on both exams, but I ended up getting the average, even if the average did jump drastically from MT1 to MT2 (67->81).\n"
        },
        {
            "course_name": "Circuit Analysis",
            "review_date": "April 13, 2011",
            "review_content": "\nPersonally, I am disappointed that Professor Zukowski doesn't teach more undergraduate courses in the EE curriculum. He is enthusiastic and approachable as a professor can come around here. It is true that his teaching style is one that adheres to \"learn by doing.\" However, he is willing to discuss the material with you in both the moments after class and in his office hours, be they normal or arranged. Do not show up to these office hours expecting to be handed a solution, Professor Zukowski will talk you through the analysis but will leave you to devise your own conclusion (as he should).\nThis course covers a lot of material, but such is expected by the EE department here. The lectures are well organized and filled with examples, but on your homework you will need to think outside of your notebook and build the intuition. \nThe homework is divided in a unique way. 80% of the homework grade with be based on 4-5 questions, called problems, each assignment. These are often straight forward analysis questions that establish you know what you are talking about. The remaining questions, worth %20 for our mathematicians, will take the same if not more amount of time to complete then the prior. From his teaching style I deduce that he is not trying to fail you but have some sort of way to separate the average student from the above average student without making the class average a 50. That being said, often writing out your steps and skipping the math on these questions(very hand heavy if you are not familiar with linear or matlab) would get you partial credit.\nThe exams are straight forward and even though you don't get an equation sheet, doing the homework should have embedded the equations into your head anyway. If not, right them out a few times before the test, it really isn't a big deal. He is very fair with partial credit and even if you mess up some math, or write the wrong equation you can gain most of the points back by writing down your intuition and expressing the qualitative observations (if they are correct).He will also have the TA host class wide review sessions before each quiz. A great thing to attend.\nIf you are not someone who goes to the TA often, you might find that it would be helpful to do so here. My TA was fantastic in F2010, and often provided out of the box insight into the systems. He also knew exactly what was being looked for in the assignment and had amazing patience with student questioning.\nWorkload:\n11 homeworks due on Fridays, drops the lowest, worth %20 of final average. Final 40%, 2 quizzes %20 each. Completely manageable if you attend class and don't wait until after office hours to start. \n"
        },
        {
            "course_name": "Circuit Analysis",
            "review_date": "December 20, 2010",
            "review_content": "\nHomeworks: Absolutely insane. There were 6 \"examples\" and 4 \"problems\" on each homework. The examples were only worth 2 points and the problems were worth 8 points. Most people ended up doing only the problems, since doing all 10 problems could literally take 20+ hours. They were all very long, very involved, and very hard, and they are also worth 20% of the grade. However, at the end the mean for the homeworks was 75%, so if you just try slightly harder than other people, you should get above the mean. They were also due on Friday, which means that you should kiss Thursday nights goodbye.\nLectures: Kind of boring, but they still keep you interested. It's the nature of the subject to be boring, so I can't take it against the guy. He did the best that he could and kept me more awake than other professors, which is a lot to say.\nProfessor: He really cares if you know the material, and he is very approachable. His TA was also amazing and he was even better at explaining difficult concepts than the professor. \nMaterial: WAY TOO MUCH! By the end of the class, it felt as if my head was about to explode. The class moves so quickly past the first midterm that it is hard to keep up. Unless you continuously read the book, it will be a bitch come final time. \nWorkload:\nI don't think the class/concepts were that hard, it was just too much work. Between the homeworks and the amount of material that we had to memorize, this class was a big headache. \n"
        },
        {
            "course_name": "Circuit Analysis",
            "review_date": "May 10, 2005",
            "review_content": "\nOne of the nicest guys you're going to meet at Columbia. Sure, he's a boring lecturer with a somewhat monotonous voice, but that's partially the nature of the subject. He genuinely cares about the students--just stop by his office hours and you'll see. It's not an easy class and the problem sets can definitely be challenging, but he was exceedingly generous with the final grade in the class--I blew off the homework and didn't do well on the final, but still got an A-. He's one of the rare guys at CU that just cares, period.\nWorkload:\nTwo midterms, final, weekly problem sets. Problem sets are hard, but tests are reasonable. He doesn't try to trick you and just covers all of the basics.\n"
        }
    ]
}