{
    "prof_info": [
        {
            "prof_name": "Nancy Workman",
            "prof_id": 923,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2016",
            "review_content": "\nBefore starting Lit Hum, I read the reviews about Nancy and saw that she was a silver nugget professor so I definitely had high hopes for a great experience. However, I was thoroughly disappointed with the outcome. This is the type of class where your performance is solely based on if the professor likes you or not. \nProfessor Workman is knowledgeable, but she also only wants to hear what she wants to hear. In class discussions, her expressions and her opinions are written clearly on her face and she will make it explicitly clear by her facial expressions if she likes what you are saying or not. She cuts off students and also puts down students' comments or thoughts. It's pretty discouraging, especially as your first introduction to the Core. She has a set opinion on the texts and only wants to hear what SHE deems is important or interesting. Thus, the environment of the class was usually stifling and tense - students are always trying to one up each other and say something better than the previous person.  \nIn terms of class load, if you want to be able to spend time on your major courses or more important courses, than do not take this class as you have to turn in a 1-2 page response for EVERY CLASS. You're allowed 5 skips on the responses but it's not that helpful; you basically can't skip readings so you have to read everything. \nHer grading on the essays and midterms are also very harsh. If she doesn't like you, you won't do well in the class. A lot of people switched out of her section after the fall semester.  \nTakeaway: Your Lit Hum experience is heavily, if not solely, based on your professor. So choose wisely. Good luck.\nWorkload:\n1-2 page response due every class so you basically can't skip readings (up to 5 absences on the responses are allowed but it won't really help your grade to skip them)\n2-3 Essays\n1 Midterm\n1 Final\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 11, 2015",
            "review_content": "\nI have so many things to say about Nancy that I don't even know where to start, but first off, I'd like to encourage anyone who is put in her class to STAY IN IT. Even though the workload is heavier than most other LitHum classes, it all pays off, and Nancy herself is well worth the effort. Professor Workman not only knows every single text on the syllabus back to front, but actually makes even the most dull of them totally fascinating. She sheds so much light on every text that you have to end up with some kind of appreciation for them. By the end of the year, you'll probably realize that you've even come to develop some kind of fondness for the Iliad. She's also hilarious-- she can make the class laugh, whether with a personal anecdote or a snarky remark, at 9 a.m. Considering the frugal amounts of sleep you get at Columbia, this is a miracle. She is extremely thorough and supportive. Though tough, she DOES read and DOES care about every single daily assignment that you turn in. She'll sometimes write whole paragraphs of her own thoughts or questions on your response. Always take the time to meet with her about your term papers-- the meeting are informative and instructive, and I've often found that I come out with an entirely new topic or idea that I'm actually excited to write about. At the end of each semester, she hosts a review session at her apartment, which is not only helpful but interesting. In addition to the reviews, she hosted a screening of a 1980s Japanese film version of King Lear halfway through the second semester. There's always nice cats and pizza at her apartment. Definitely an invitation that most professors at Columbia would not extend to their students. Anticipate the discussions on Crime and Punishment at the end of the year; she will absolutely boggle you. Take advantage of this wonderful professor! Even at Columbia, you don't get great professors like Nancy that often. It's LitHum, that one class you hear about like 83 times before you even get here-- make the most of it! \n\nWorkload:\n1 short response (300-600 words) for every assigned reading, 2 essays per semester 5-7 pages each, midterm and final \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 13, 2013",
            "review_content": "\nNancy Workman review_content\nThe following review is lengthy. \nTo Professor Nancy Workman: \nYou are phenomenal. Unreal. I cannot stress enough that you made this class so very worthwhile. In your class, every time I did well I felt ridiculous joy. Not pride - joy. Each time I was drowsy, after staying up all night for some ridiculous assignment for unmentioned science class, I felt ashamed to be wasting time in your class. Each time I was off point, it was ok because you do such a fantastic job of guiding discussion that I knew even if I couldn't come up with meaningful input, I'd be on the receiving end of some. You have changed the way I write, and far more notably the way I read. So much so, in fact, that I remember your fall paper instructions on meaningful reading of text. Every assignment was an absolute thrill because, as you put it, you gave us opportunities to have ideas.\nTo potential students:\nLet me first scare off the people who this class is not right for. Professor Workman is tough. A ton of hard work. An assignment every class on the material you were to read for that class means you can never skip reading, and you have to put in 300 to 800 words (average 650 for me personally). Prof. Workman emphasizes none of these assignments will throw your grade but you want to spend some time on them. They'll give you something to say in class (re echoing an earlier comment), and they'll allow you to come up with your own idea rather than hearing other others' interpretations. They are unforgivingly relentless and supremely fulfilling. \nNever spark note, shmoop, plagiarize in anyway. This woman is brilliant, supremely intelligent, and understands how a student thinks. She catches on to this shit. Do not do not do not disappoint this woman with plagiarism, she deserves so very much better than that.\nYou have to do your reading, not just because of the essay, but also because she deftly handles class so that you go over everything.\nShe asks questions in every assignment, be it her daily stuff, midterms, or fall papers tat make you think. They made me feel phenomenal. It's inspiring stuff. Don't waste it.\nThe perks go on.\nHer insights into the texts are amazing. Yes, everyone says this about her but the way it manifested for me is that I would read and be often bored by the heavy works of the Lit Hum syllabus and I'd get into class and things would start to have meaning. They'd grow into ideas I could cherish and she'd be the one that made it all possible.\nBefore fall papers (worth 20% of your grade) are due, she allots 15+ hours of office hours in the week and makes arrangements if you cannot make those.\nShe cares tremendously for the intellectual development of her students and puts in thoughtful effort to prove it. When you are as stunningly insightful as Nancy Workman, that means you can give the best damn kind of attention each student needs.\nAlso, she is an adjunct Professor and teaches just one class of Lit Hum and I don't believe anything else anymore. This means she's not striving for tenure and pouring herself into published work. That, in turn, means she is absolutely there for you as a teacher.\nShe is supremely understanding and approachable. Her acute awareness of each student means she can sympathize, really sympathize.\nShe is just the best kind of person.\nTo those who have stuck to the end of this, she gives great grades for hard work. She will do her very best to teach you how to think and reward you if you worked your ass off to learn.\nIn summary:\n1. She made the $66000 a year I spend on this institution seem absolutely justified. She imparts something you can learn from few sources - a way of thinking.\n2. All that stuff you wrote in your 'Why Columbia' essay about the Core, that you want to be a part of rich academic tradition, have conversations with other students about the texts etc - by the end of her semester, if you didn't before, you will absolutely mean every word\n3. She'll make English, as a language, look bloody gorgeous.\nTo the Core Office:\nThis woman needs to teach more. Tenure her, even though you can't tenure an adjunct. Give her every award you have. Do something to show Nancy Jean Workman that Columbia College appreciates her and that she embodies what we want out of our Professors. \nTo CULPA:\nGold nugget (see other reviews)\nFind other more valuable nugget (http://most-expensive.com/precious-metal. Rhodium perhaps)\n\nWorkload:\n1. A 300 - 800 word assignment every class + the readings : this takes a while and varies greatly but it's always worth it. These together with class participation make up 20% of the grade.\n2. Two 1000 - 1500 word papers together worth 40% with the 2nd one being a little more, especially if you've done better.\n3. Mid Term of her design that is quite close in structure to the Final. Together these are 40% of grade, with Final being slightly more, especially if you've done better.\nAs I have stressed in the review, tremendously hard work. Do it though.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 18, 2013",
            "review_content": "\nNancy is great. She puts a tremendous amount of effort into the class, which definitely shows. Her classes are very well structured (even if the structure isn't always obvious, she will get you precisely where you need to be), making it very rewarding. \nShe not only encourages participation, but somehow manages to coax fairly sophisticated points about the works out of the students. \nIf you are looking for a blow-off class, Nancy probably isn't for you (which I see as a compliment to her teaching style). You definitely don't need to do all the readings (I certainly didn't), but simply copying Sparknotes will end poorly for you - she smells that shit from 10 miles away. \nIf you want to actually learn about the works and have some interest in literature, you will probably enjoy the class. Nancy enjoys teaching and her passion for the texts is infectious. She is funny and fair, challenging her students just enough to make Lit Hum into a valuable academic experience, rather than another Core class to tick of your list. \nWorkload:\nStandard Midterm and Final, 2 Essays. Short responses for every class (you can miss 5 per term), which can be a pain, but are maybe one of the most useful aspects of the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2012",
            "review_content": "\nProfessor Workman is amazing! Words cannot describe how great of a teacher she is. She's helped me improve my writing so much throughout the semester. There is an assignment due every class (you're allowed to miss 5) but it's totally worth it because it helps you keep up with the readings. The ONLY problem I personally have with this class is that it is at 9 am. I really wish it wasn't so early in the morning (not really a morning person). I think my note-taking ability was definitely impaired by the class being so early in the morning, which kind of sucks because she says a lot of really important and interesting stuff during the class. There have definitely been a few times (especially after getting only 4-5 hours of sleep the night before) that I had been just too tired to absorb much. All in all though, despite me not being a morning person, I'm still sticking with her class next semester because she is just that amazing of a teacher. \nWorkload:\n1 assignment due every class (can miss 5), 2 papers, 1 midterm, 1 final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 29, 2012",
            "review_content": "\nNancy Workman is bar none the best professor I've had at Columbia, and will probably continue to be so through the rest of my time here. I came into Columbia a dedicated science kid with very little interest in humanities, but Nancy managed to make me interested to come to Lit Hum, at 9 in the morning no less. This woman is so undyingly dedicated to that class that it is infectious. She meets with every student before each paper, sometimes multiple times or exchanging emails, and returns pages of constructive comments with your grade. She actively encourages study groups, even going as far to host the finals study session at her own apartment.\nNancy has high expectations for you, so she's a bit of a tough grader -- she is totally and completely fair though. The grade you get is exactly proportional to the work you put in. You don't need to be the next Homer or Ovid, but you cannot half-ass this class. It's worth it though, since I was totally blown away by almost every discussion we had in that class. Nancy knows how to lead and moderate a discussion so that there's just enough freedom for us to respond to the texts in our own ways, but also to stay on topic and hit the major points from the readings. She obviously knows her stuff too. She wrote her thesis on Crime and Punishment -- at the end of the last session on it, she looked at the clock and, with 5 minute left, said \"I don't normally do this, but I have some important things to say.\" Then she launched into this incredibly monologue on how the ending of the novel not only was important commentary on all the characters, but also on life and humanity itself. That sounds like total bullshit probably, but I am being completely serious when I say that I have never looked at a text with so much awe as after those 5 minutes.\nIf you have the chance to take Lit Hum with Professor Workman and you chose not to, you're missing out on one of the best Columbia experiences, no doubt.\nWorkload:\nA bit more than other Lit Hum classes. She asks that you write a short (1 page, double spaced) response to each reading, but you're allowed to miss 5 per semester. Honestly though, it helped with understanding what is otherwise dense and complicated stuff.\n2 papers, each given about 2 weeks. She gives you like 7 prompts so you shouldn't have much difficulty finding a good topic.\n1 midterm and the standard Lit Hum final. The midterm is in the same style as the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 27, 2012",
            "review_content": "\nNancy is the BEST!\nIf you have a chance to take her class, DO IT!!!!\nShe knows everything about everything, and is extremely enthusiastic about the material. You can tell that she really dedicates herself to the class. \nShe is a bit of a tough grader, but she is very fair. If you have a conference with her before you write a paper for her, she is very helpful. \nAnyways, Nancy ROCKS! Take her class! DO IT!\nWorkload:\n2 papers per semester, short writing assignments for each class (do not take that long and are actually helpful), midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 05, 2012",
            "review_content": "\nI know it's ben said a million times before, but this woman is amazing! I switched into this section after my first semester professor left (I thought I loved her). I had low expectations considering that I didn't think LitHum could get better than first semester. As many people say, there is a heavier workload, but it's one of those times when I don't mind the workload because you know every hour you're putting in, she is at least matching. Every single response paper was returned with a plethora of useful comments, quotes from the literature, and passages I might find interesting based on my response.  Plus all the work one puts in for these response papers makes studying for the midterm and final much less of a time commitment. Her ability to engage with the texts is phenomenal. Beyond the fact that she speaks pretty much every language ever and her zest for knowledge is amazing, she has the ability to ask questions that make one look at the text in a whole different light. One thing though, if you don't want to participate don't make eye contact because she'll often call on whomever is making eye contact with her at the moment. I sincerely hopes she gets to teach more Slavic courses, as I would take anything to be in the same room as her again. \nWorkload:\nDaily response papers (you can miss five), a midterm and a final which are both graded curved and are really fair. She also holds review sessions for the final which is great.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2011",
            "review_content": "\nI know it has already been said, but I just want to reiterate it. This woman is FANTASTIC. She puts so, so, so much enthusiasm and effort into this class. She creates an internet page for every reading we do with study questions (we pick one to respond to), a passage from the reading to think about, and additional optional links to articles and other sites that relate to the reading. She is incredibly knowledgeable and adds so much insight to the texts that we read. I looked forward to this class every morning on Mondays and Wednesdays, and couldn't wait to discuss the readings. Professor Workman is also super sweet; she was five minutes late to our midterm because she was baking cookies for our class, and she invites the whole class to her apartment to have a study session for the final exam. She is also completely reasonable about papers, letting students do a rewrite for their first paper with her. Yes, she makes you write responses to the texts, but they really don't have to be anything formal or super well-thought out. Their sole purpose is to get you thinking about the text, which they completely do. I felt so much more prepared for class because of writing my responses. I know a lot of my friends hated Lithum, but that is completely unnecessary. One's enjoyment in this course is based strongly on your professor, and if you get a good one, this will be an eye-opening year. I can honestly say that next year I will really miss waking up to this class. Take Nancy Workman--you won't regret it. \nWorkload:\nPage-long written responses for every reading (but you can miss five)\nTwo papers (around 5-6 pages)\nMidterm\nFinal\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2011",
            "review_content": "\nProfessor Workman is absolutely fantastic. Literature Humanities became one of my favorite classes ever because of the insight she provides. Despite the fact that she does try to tug her students in certain directions, sometimes seeking for specific answers, this is a class where the depth of your thinking is fundamental. Albeit the extra work, the weekly responses are a great way for you to actively become involved with the text. During discussion, the responses will help you consolidate your thoughts and, with the tremendous input from Prof Workman, will ultimately lead to multiple epiphanies. \nProf Workman puts a TON of effort in this class, and that's part of the reason why it is so special. She will have plenty of comments on anything you input into the class-- whether it be a comment during discussion, a weekly response or an essay. At the same time, however, she expects a lot of work from you. If you want your Lit Hum experience to be truly inspirational, Prof Workman is the perfect teacher. \nI am sure she'll get the GOLD NUGGET she deserves sometime soon. \nWorkload:\nMore than your average Lit Hum class. Prof Workman sometimes calls on people so its CRUCIAL that you all the reading (or at least try your best to read as much as you can). \nWeekly Responses (around 1 pg each, for every class) -- You can miss 5, which is pretty generous. 2 Papers (5-7pgs). A Midterm and the standardized final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2011",
            "review_content": "\nDr. Workman is awesome, and one of these days will earn her already-deserved gold nugget.\nShe loves Lit Hum, and her enthusiasm is infectious. She knows these texts inside out--and she should, because she's been teaching the class since the '90s. Her love for the books, paired with her high expectations of the class, stimulates actually fruitful discussion. I honestly learned things not just from her, but from my classmates. And sometimes there were snippy comments back and forth because people disagreed about each others' readings! It was awesome.\nShe has a hilariously dry, sense of humor. She's a solidly UWS person who reads the NYTimes and swears by Absolute bagels over Nussbaum--and she doesn't take herself, or anything else, too seriously.\nSome professors might have better things to do, some grad students might not care about Lit Hum. Dr. Workman has nothing better to do because she loves Lit Hum so much she chooses to focus on it exclusively. She wholly devotes herself to the class and expects the same of her students, who will be better off for it by the end.\nWorkload:\n2 papers each semester, a 1-page reading response for each class (which was excellent preparation for section II of the final!)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2011",
            "review_content": "\nNancy is easily the best professor I've had at Columbia. She has really mastered all of the texts that she teaches, and she expects that you'll get close to that level of mastery, too. This was such a refreshing class to switch into after a semester with a professor who would point to sections that befuddled her and let the class debate about it without guiding or providing any insights. Nancy's method of interrogation is leading- she's looking for specific answers that will send the discussion towards the ends that she wants to get across, although she will allow for slight diversions. This is off-putting for some students, but the quality of her insights into the texts have you by the end of the class feeling as though you've had an epiphany. Every. Time. \nNancy, from what I gather, is fluent in English and Russian, has significant working knowledge of Greek and Latin and has at least dabbled in German. She's incredibly wry and current, referencing tumblr and youtube memes to lighten the mood. And she really cares about Lit. Hum. Even at 9 am, I was always engaged and excited to be there. She invites you over to her apartment to watch Akira Kurosawa adaptations of Macbeth, takes you on interesting tours at the Met, and finds awesome productions in the city for her classes to see. \nReally, I just cannot say enough about her. Where is the gold nugget? \nWorkload:\n1 page response for every class, but you can miss 5 of them (so around 20 auxiliary pages a semester where you can just spew your thoughts), 1 5-6 page paper, 1 6-7 page paper, and a final that will accommodate any changes she has made\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 25, 2011",
            "review_content": "\nNancy Jean Workman is honestly one of the most fascinating instructors that I have ever had. She is definitely one who assigns more work than most instructors by assigning responses, but these responses complement her teaching and oratory beautifully. Workman's passion for the works that are studied in Literature Humanities is one that inspires her students and motivates one to read. \nWorkman's course is definitely my favorite of the year. Her energy is just so thrilling, that students did not mind the fact that the class was held at 9 a.m. One of the most important doings as an instructor is that Workman organized the readings rightfully: the assignments were neither overwhelming or unmanageable. Workman has so much insight, due to her years of teaching, and I loved her commentaries on all of the works. I switched to her class after noticing that my first instructor was not good and I heartedly believe that that is one of the best decisions that I made during my first year of college. \nWorkman prepares one for the midterm and the final quite finely, and ignites a yearning to learn in her students. Her Ph.D. in Russian Literature made Crime and Punishment an amazing study. Her vast knowledge of literature, in general, made its way to the studies of most works. I constantly found myself reviewing various eras of literature that I did not know about before. \nNancy Jean Workman is truly fascinating. I hope that she continues to serve as an instructor of Literature Humanities for Columbia College. Her involvement is a blessing for the school, and I hope that she feels loved and welcomed. We love you, Professor Workman.\n\nWorkload:\nVery, very manageable. I cannot stress enough how life changing reading ALL of the works would be for one. All this requires is good time management. \nStart doing the readings a week before the readings are due so that you'll be reading small amount of pages per day instead of reading large amounts of readings over the weekend. Don't be afraid to read multiple books at the same time, as long as the readings are small. \nYou'll have two essays (5 pgs each) and two exams (midterm and cumulative final). The IDs are not are as hard they seem to be; just have a good understanding of the works and you'll be all right. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 07, 2011",
            "review_content": "\nNancy is amazing!!! She really deserves a gold nugget, and I think after this semester she will get one. Everyone in our class loves her and loves it in spite of the fact that it is in the 9 am slot. I am a relatively jaded English student, used to simply reviewing the texts with most teachers while they clarify it for others, but Nancy causes revelations every day. She is incredibly enthusiastic and incredibly attentive, her responses to both our essays and our daily assignments are insightful and genuine.\nShe really loves her job and makes you love it too.\n\nWorkload:\n3 papers, a midterm of her own creation, the Lit Hum final (with her edits), a daily page-long response. Slightly more than most other classes, but it makes sure discussions are lively and engaged (b/c everyone's written a page on a topic we cover in class, everyone has something to say).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 18, 2010",
            "review_content": "\nProfessor Workman is awesome.  She truly cares about the texts, and also about the class.  After one semester with her, I feel like I read literature better.  I dig deeper, because she showed us how in class.\nProfessor Workman is hilarious, in her way, and also very nice.  She is a great professor, and teaches Lit Hum the way it should be.  When I see other kids struggling to memorize characters from the text for some grad student, they're missing the point of interrogating the text.\nWorkload:\ntwo 6 pages papers, midterm, final, one page reading analysis for each class\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 23, 2009",
            "review_content": "\n She is a great person and really does try and knows her stuff but at times there is a bit of a communication issue. Her class discussion sessions were more like \"guess what i am thinking now\" rather than lets talk about this issue from different perspectives. When you guess wrong, trust me you will know. lol. Maybe she was just nervous because around the end she became much more relaxed. She is a hard grader I must admit but she is fair. I just never felt that we got to really talk about the books because there was always an \"answer\" she was looking for.\nWorkload:\n2 papers and 3 small writing assignments, midterm and final.  She kind of forgot about the writing assignemtns and the papers till the end. We did the final 8pg paper and 3 writing assingments and final in the last 2 1/2 weeks of the class. not fun.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 24, 2008",
            "review_content": "\nNancy Workman is fantastic!  She really knows what she is talking about, and is actually invested in what she teaches-- she's from the Russian Department (making Dostoevsky amazing), but is currently taking classes in Latin!  Yes, the one page daily responses are annoying as hell (and beware-- will actually take a toll on your grade if you don't do them), but they are given on worksheets with multiple, insightful, questions that prepare you for the upcoming class and future tests.  I even gave these worksheets to friends from other sections to help them study for the finals. Nancy does expect a lot, but if you participate in class with enthusiasm, she will fall in love with you.  Not only does she give fabulous background and motivationally facilitate class discussions, but she has a great personality to boot!  Be prepared for a Final study session at her apartment complete with bagels and juice.  Beware however: this is not an easy A.  Workman is a very tough grader.  Meet with her in office hours to discuss paper topics, because if she thinks you are off the mark she WILL grade accordingly.\nWorkload:\nOne page response each class, two 5-page papers a term, midterm, final.  More than most, but well worth it\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 17, 2007",
            "review_content": "\nNancy like most teachers has her plusses and minuses. She is extremely knowledgeable on all of the books for the class, and can really motivate a class to actively take part in discussions. It seems that she really enjoys what she does and is devoted to the class. But because she is such an expert on the books and works hard for the class her expectations are pretty high, which is reflected in her workload. Most other sections of lit hum were many books behind hers and had a shorter syllabus in general. If you keep up with the readings it can be a very rewarding class, she really knows her stuff. If not, it may become slightly nerve wracking.\nWorkload:\n1 pg response papers every class. two 5 page papers. midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2006",
            "review_content": "\nProf. Workman is a great teacher. She is probably tougher than most lit hum professors...she requires a 1 pg response for each class. Her lectures, though, are insightful and interesting. She's really open and an overall great person/teacher. Take this class if you want a \"real\" class, but don't if you are not going to read/want to work. \nWorkload:\nDaily 1 page response, 2 papers (can rewrite the 1st one first semester), tough midterm and department final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2006",
            "review_content": "\nProf. Workman is a great teacher. She is probably tougher than most lit hum professors...she requires a 1 pg response for each class. Her lectures, though, are insightful and interesting. She's really open and an overall great person/teacher. Take this class if you want a \"real\" class, but don't if you are not going to read/want to work. \nWorkload:\nDaily 1 page response, 2 papers (can rewrite the 1st one first semester), tough midterm and department final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 24, 2005",
            "review_content": "\nProfessor Workman is a great literature humanities teacher. While she expects one page responses for every class, which can be slightly offputting initially, the thought questions she provides are actually very helpful in understanding the text and preparing for her exams. She also is a dostoevsky expert, and provided tremendous insight into Crime and PUnishment that in and of itself made any extra work worth it. Take her class! You'll enjoy it!\nWorkload:\n2 papers (dont remember), midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 15, 2004",
            "review_content": "\nDr. Workman is brilliant. I had so many revelations in that class, she literally changed my life.  Like most of you reading this, I'm only at CU because I got rejected from Harvard, and boy did she ever make me thankful. Now in CC with a grad student from hell, I feel even more privileged to have had such a genuinely interested and enthusiastic professor. If you get Dr. Workman, thank your lucky stars. You don't necessarily have to do all the readings if you take good notes, but her insight will make you sorry if you don't.  She's lenient with late papers/attendance, but try not to take too much advantage. Also, discuss your paper topics with her before you write, because if she thinks it's crap she's going to grade you accordingly.  And finally, make sure you reciprocate her interest--speak up in class and say something worthwhile and she'll fall in love with you.\nWorkload:\nMidterm, Final, a few papers, the usual.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 19, 2003",
            "review_content": "\nGreat teacher. I actually enjoyed getting up in the morning to go to LitHum. She's  been teaching the class for a few years and really knows her stuff. The workload is probably the same as in most classes. We had daily homework assignments on the reading. You had to write a paragraph about one part of the reading. You can do this with only reading sparknotes if need be and she just grades them for completion. Two papers a semester also but the first one can be revised for a better grade (my \"better grade\" was the same as what I started off with) and you can schedule with her to talk about both papers before you write them. To sum it up, she's not a hard graders and she makes the material interesting.\nWorkload:\nper semester: 2 papers, midterm, final, daily small hw assignment (you can miss like 6)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 30, 2002",
            "review_content": "\nProfessor Workman is a tough, but capable Lit Hum instructor. She knows what she's doing and keeps the discussion going even if the class seems initially disinterested. She may, as has already been said, be slightly too imposing with her opinions, but is always open to reasonable arguments against what she believes to be correct.\nWorkload:\nA short writing assignment for every class, two papers, a midterm and a final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 24, 2002",
            "review_content": "\nProfessor Workman was by no means a flawless teacher, but she truly loves to teach. Classes ranged from days where I couldn't keep my eyes open to some very interesting and occasionally heated discussions. Many students feel that she dictates her opinions, which she does, but she is usually right too. Besides the day when she cried over Book VI of the Iliad, Professor Workman's greatest asset is her willingness to help you with all your papers. I had some great office hour times with her and she really helped me improve my writing. As Lit Hum teachers go, she's not the greatest, but she's definitely passionate about what she's teaching.\nWorkload:\nDaily \"responses\" to the reading with more emphasis on thinking than actually writing and you can skip five; 2 5-page papers which you are allowed to revise and rewrite for a higher grade\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2002",
            "review_content": "\nProf. Workman is one of the most  challenging professors, but as a  result, you take more from the class.  She really depends on class  discussion, so it's really painful  when no one has done the reading.  Because of the daily writing  assignments, you're pretty much  forced to do the reading anyway. I  sometimes felt like it was unfair that I  had to work harder for the grade than  people who had different professors,  but I probably learned more because  she really knows her stuff.\nWorkload:\nDaily writing assignments graded  with a check, check minus, check  plus, and you can skip 3. Two 5 page  papers which you can edit and re-  submit for a higher grade.\n"
        }
    ]
}