{
    "prof_info": [
        {
            "prof_name": "Charise Greene",
            "prof_id": 9944,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Scene Lab",
            "review_date": "November 20, 2013",
            "review_content": "\nI had never acted before in my life, and Scene Lab with Charise was an incredible experience just in my growth as a person.  I recommend it to anyone.  Thinking about interactions among people in terms of objectives definitely applies outside the stage, and learning to assert what I need from others within the context of a play has helped me \"follow through on my lines in life,\" as Charise would put it.  This class was a huge help in getting over my fear of confrontation.  There is also something very self-affirming about acting.  It isn't \"pretending\" but finding something real in yourself, your version of the character in this situation, and showing that.  You get a lot of chances to explore the way your body's state influences your feelings, and how to control that, but also how you can't fully control that.  She says it's not acting therapy but it kind of is.\nCharise is very serious about being on time, being fully present, and being prepared.  I would even go so far as to say she's a little scary.  She demands a lot of you, emotionally, because acting is emotional work.  But she absolutely gives you praise when it's due, and her high demands make that even more meaningful.  She is an INCREDIBLE actress herself, but she doesn't believe in talent and gives very concrete advice about how to act just as well as she does, down to what muscles in your throat and back to use and how to excercise them.\nWorkload:\nYou work on one scene the first half of the semester and a different scene the second half of the semester, and then we spent the remaining week or two doing monologue work.  It definitely takes time out of your week to read your play, learn your lines, and meet with your group to rehearse.  The exact amount of out-of-class time you put in depends on how quickly you can learn lines and feel confident delivering them, and how long it takes you to incorporate Charise's comments.  Maybe plan for 4 hours outside of class, but it can vary a lot week-to-week.\n"
        },
        {
            "course_name": "acting lab",
            "review_date": "April 05, 2013",
            "review_content": "\nA talented teacher no doubt, but your experience will be largely based off of how much she likes you, as is sadly the case with many teachers in this very subjective art. At her best, she can give you a really solid perspective on acting, but at her worst she can make you feel terrible. Her fuse is amazingly short and she will not hesitate to yell at you in front of your class any time you're not 100%. She has a no tolerance policy on tardiness or lack of investment and will make you remember it for the semester if you make a mistake. Her exercises are novel and fun, but repeated ad infinitum every class until you grow sick of them, even though they're actually good exercises. You will grow as an actor, but be made to fell terrible as a human being, and that bleeds into your performance everywhere else, so that's why I don't recommend her.\nWorkload:\nTake her class pass/fail. She tries to run 'a professional environment,' so if you arrive 5 minutes late one day you will be in her permanent bad graces and if you oversleep or are sick and miss one class, you can kiss a B goodbye. There are only three papers in most of her classes, so much of the grade is based off of her personal opinion of you, and its very easy to get her to hate you. Just be punctual and don't question her, though, and you should be fine.\n"
        }
    ]
}