{
    "prof_info": [
        {
            "prof_name": "Erin Twohig",
            "prof_id": 9636,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French II",
            "review_date": "May 23, 2011",
            "review_content": "\nErin is a great french teacher. She is consistently prepared for class, always on time, and returns assignments in a timely fashion (with good feedback on written items). Her expertise is in French literature, which makes 1202 especially enjoyable because of all of the poems/stories we read. Erin is very approachable and always encouraged us to see her at office hours. She will accomodate your schedule if you can't make it to class, or have to turn in an assignment late. Definitely not a push over, but generally quite understanding and clearly wants her students to have a solid understanding of French language. \n\nWorkload:\nSame most other lower level language courses. One poem/story a week (about 3-4 pages), a few worksheets per week, test and compositions on alternating weeks. Maximum 1/2-1 hour per day.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 17, 2009",
            "review_content": "\nErin's Elementary French I class was very enjoyable. She's a great teacher, she makes sure everyone understands the material, she doesn't move too fast and if you fall behind she is very easy to work with in terms of late assignments. She is a fair grader, If you have past experience with the language she is slightly more strict with your grades than someone who is completely new to the language (but you will still be at a HUGE advantage compared to the rest of the class). The day to day homework is minimal, and with any level of effort can be completed in about 15-20 minutes. There are compositions due every 2-3 weeks, they start out at about a paragraph and by the end of the semester they build up to about a page and a half (or more if you work with a partner). There are 10 minute quizzes after every chapter (10 chapters) and tests after every 3-4 chapters. NO MIDTERM. In class you go over the homework and relearn any material from the nightly reading (also nightly workbook activities, but still nothing extensive). Lots of in class activities that are a huge help with conversational skills, pronunciation, and grammar. She makes it her personal mission to make sure everyone in the class if doing well and understands the material. Overall, GREAT TEACHER. HIGHLY RECOMMEND. ONE OF THE BEST TEACHERS I'VE HAD SO FAR.\nWorkload:\nLight (medium in terms of studying), see review for more details.\n"
        }
    ]
}