{
    "prof_info": [
        {
            "prof_name": "Khary Jones",
            "prof_id": 2638,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Writing Center",
            "review_date": "October 02, 2007",
            "review_content": "\nI haven't taken UW with Khary but I had the misfortune to schedule an appointment with him at the Writing Center. \nOne of the worst instructors I have *ever* worked with.\nI laughed as I read the reviews by the UW people because at the writing center he actually had me do writing exercises. He quibbled with certain of my word choices, inexplicably. He didn't like my approach to my essay but offered no answers. His statements only negated his previous statements. I ended up cutting the appointment short and changing nothing about my essay. Of course, I received an A+ on it.\nSo, to re-iterate what the prior reviews have said, he's sort of a nice guy but avoid him like the bubonic plague.\n\nWorkload:\nWriting exercises...in the writing center. I can only imagine how tedious he is in class.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 09, 2006",
            "review_content": "\nIf you do not care about your grade at all, take University Writing with Khary.  He never clearly explains what he is looking for in your writing, because I suspect that he does not know.  Also, he definitely did not read my papers before class because midway through the semester he told me my posting were inaccessible.  Class discussions are disjointed because he asks for everyone's opinion, but eventually he skips from point A to point Z and forces everyone to agree with some statement of his own.  He is often late or misses class because of his movie and forces us to reschedule. Conferencing is useless because his advice is always conflicting or contradicts the point you are actually trying to make.  You will not learn anything and your writing may actually suffer from this.  Good luck to you.\nWorkload:\nThe four papers, which become progressively more ridiculous, short writing exercises and a group presentation.  As in all UWriting classes, a lot of participation and group exercises are included.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 09, 2006",
            "review_content": "\nAbsolutely terrible professor.  It seems like he has a very clear idea of what he wants your writing to be, and if you have a different idea about it,then you're out of luck.  This may sound tolerable, but he has no ability to explain what he is looking for at all.  I also agree with the below poster that it seemed like he was too busy making a movie to put time into our class, he would come to conferences disorganized, seeming like he had not read our papers before that moment.\nWorkload:\ntedious writing assignments most every night, usually around 500 words and then the usual 4 University Writing projects.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 06, 2005",
            "review_content": "\nif you get this class try and switch out to another writing professor. really nice guy but can't teach at all.  i came out of this class without learning one thing all semester. nothing ever had a point or made sense to anything relevant to what we were doing. it was very annoying to post to courseworks the day before it was due at 7pm. it was a huge pain in the ass. he's seems to be too busy making a movie to teach this class. \nWorkload:\ntedious and pointless exercises that did nothing for any student. ranging from 500-1000 words every night. 3 papers (1500-2000 words) and a group project. (which i still, don't understand)\n"
        }
    ]
}