{
    "prof_info": [
        {
            "prof_name": "Kai McBride",
            "prof_id": 6512,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Photo I",
            "review_date": "May 15, 2010",
            "review_content": "\nI agree totally with the review below.  Kai was a great photo professor, both honest (in a brutal kind of way) and engaging.  Our critique sections (2.5 hours each monday morning) were consistently hilarious and also useful, drilling into us over time what makes a good photo and what does not.  By \"good photo,\" all the photo professors (the once-students of Thomas Roma, usually) mean photos that are about something, something real, something of our lives.  No pretty photos of cute animals or landscapes or the like make the cut in Columbia's photo department.  \nUnder Kai's instruction, everyone in the class improved notably over the semester.  His critiques are harsh, but that's the only way to really improve.  \nIt should be known that Photo I focuses on taking better photos, not on making perfect prints.  In this class, contrast filters, dodging, and burning are not allowed, and pushing or pulling film speed is discouraged.  This is not a technical class, so don't expect to learn all the tricks of the darkroom here.  Expect your photos themselves to get much better, though.\nWorkload:\nAbout 20 rolls of film (36 frames each) over the course of the semester.  8 good prints put on the wall for critique every two weeks (half the students go one week, half go the next).  Expect to spend much time outside of the class hours in the darkroom working on this. \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "December 17, 2009",
            "review_content": "\nI highly recommend taking a Photo class with Kai. He initially seems narrow-minded and disrespectful, but soon you realize that he's doing a great job teaching you how not to read nonsense into life, and, basically... keep it real. \nHis advice for better photos makes its way gradually into one's ability to think of and experience any sort of art, as well as think about larger issues one confronts in the world. \nHis format enables a lot of points for better photos to be reiterated in blunt terms multiple times. \nBy the end of the course, his criticism (very harsh and blunt) about your photos no longer affects your ego, but it's directed at your ability to think about what it means to capture a good photo. He instills an intelligence that allows us to take in the world in truer terms, stripping away meaning that we've added due to wrongly placed judgments, prejudices or misplaced notions of authenticity, Forms, or absolutes.\n\nWorkload:\n20 rolls in the 9 weeks of class. 1 week to print, 2nd week to put up on the wall and be criticized. Photo taking all along.\n"
        }
    ]
}