{
    "prof_info": [
        {
            "prof_name": "Molly Smith",
            "prof_id": 2725,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Painting I",
            "review_date": "May 17, 2006",
            "review_content": "\nMolly is such a sweet heart, she is extremely kind and positive with critiques.  I felt as though there could have been more freedom in choosing our topics.  However, this is art and even if a general restraint such as \"paint on something that is invisible\" is given, you still have a lot of freedom.  I just sometimes would have liked if we could come into class and paint whatever we wanted.  We had to study two artists throughout the semester and for the final presentation present atleast three works (they did not all have to be newly created).  I really enjoyed this last assignment not only because of the artists I had, but because it kept me painting continuously over a couple of days.   I would have liked less homework and to work on very large canvasses.\nWorkload:\nweekly painting homework and research on artists, two times I believe we were assigned to go to a museum, weekly crits, one time we painted in the park which was nice final presentation consisting of atleast three paintings and a one page handout on each of our artists (two)\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "January 17, 2006",
            "review_content": "\nI can't tell you how meaningful this class was to me. During a time when I was having serious doubts about college, it was something I could look forward to and helped me enjoy my life a little bit more. Molly is simply the warmest and kindest girl you could hope to meet and classes were probing and cheerful, not to mentiont the killer mixtapes she made to play during class. Field trips were always fun and helped to make the classmembers enjoy eachother. The times we met in her apartment were blissful and the food was scrumptious. Though I can't say my drawing abilities were greatly altered (i dont think any class can truly do this) I do now put a great deal more thought into my use of lines and movement and the varied textures I can create. Do what you can to take a class with Molly, shes a real gem.\nWorkload:\na couple takehome assignments that are later critiqued, a month of drawing in a sketchpad, a final project of your choosing (she tells you what she thinks you'd enjoy working on/ what would suit your style and helps you choose something you love), portfolio\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "December 18, 2005",
            "review_content": "\nMolly Smith is a goddess. Her teaching style is free and encouraging, her personality is warm and inviting, and her own art is wonderful to appreciate.  This class was my favorite this semester, and for good reason. She helped guide each individual to develop his or her own style and welcomed any sort of experimentation.  The field trips were to some great and hidden places that were wonderful introductions to drawing in the professional art world.  The class even met twice at her apartment, milk and cookies provided, creating a really close class bond.  Highly recommended.\nWorkload:\none month of daily drawings, usually one homework every other class, a final project\n"
        }
    ]
}