{
    "prof_info": [
        {
            "prof_name": "Jennifer Tappan",
            "prof_id": 2693,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "African Civilization",
            "review_date": "July 01, 2006",
            "review_content": "\nIn fairness to Jen, African Civ is not an optimally designed course. In one semester, students are obliged to study not only the entire history and culture of three African societies (which are often bristling with such vast complexity and interconnectivity with surrounding areas that one is unsure such divisions are prudent in the first place) but the works of African nationalist leaders in the 1960s as well as modern West African intellectual movements. What is shortchanged here is immense- vast swathes of Africa go unnoticed, historical periods are left by the wayside, and culture is reduced to a few basic bullet points. Given the circumstances, the course manages to pack in quite a great deal of interesting literature, fascinating films, and even a good amount of complexifying theory and discussion. What such a course needs is an instructor up to the task of prioritizing all these features in an exciting, dynamic, and coherent fashion- one which leaves plenty of room for students to engage in intelligent, organized debate amongst themselves. Jen's style embraced two irreconcilable extremes- she either let us spout off about whatever or pulled the reins in too tight in order to treat us to a kindergarten-light laundry-list of essential items in the given cultures or writings. Another respect in which she treated us like insolent children was her frequent chiming of \"so who did the reading besides ___?\" Often, attempting to interact with her was like talking to a wall; although several would reword the exact answer she would be looking for, she would deny we understood what she wanted- only to repeat the same point we had been mentioning, as Bible truth, the next day. When two grad students from the music department showed up to teach the class one day, they were a breath of fresh air and demonstrated to me what the class could be- still limiting, in other words, but far more engaging. \nAfrica, unlike Europe, has had much greater difficulty weaving a coherent story of itself, and this accounts for the somewhat fragmented nature of the course. But it also renders African civilization a fundamentally more difficult- and, indeed, time consuming subject to teach than that of its cousin across the Mediterranean. To engage in this painstakingly partial survey of a continent, shoehorned into an abrupt semester, is to realize that even the expansiveness with which the Core treats Western thought and culture- in no fewer than six semesters, at least -could not itself begin to contain what is ultimately still rendered, by such a curtailed curriculum, a relatively dark continent. I am glad for the brief glimpses African Civ allowed me, but I wonder what it is one is supposed to distill from it. Too large in scope to be sufficiently taught, too little in student interest to be expanded significantly, it will probably lumber on as another awkward expression of Columbia's attempt to find a more appropriate place for and perhaps a more accurate expession of Major Cultures than the Core's small back shelf.\nWorkload:\nThis is where Jen's mismanagement truly shows. In addition to the vast course requirements stipulated by those who had designed the class in the Core Office- including a weekly evening visual hour, museum visit, short essay, long research essay, and customary exams, Jen appended such ad hoc (and extemperaneous) assignments as the creation of a class vocabulary (to which we each had to contribute items), the need to write a challenging response (complete with thesis and argument) to the visual hours that would fit inside one page (this was graded), online discussions of various readings, and other various required or optional minutia (ex: write a praise poem of the class). The scope and variety of the assignments was so vast that some failed to complete them all- and Jen failed to even notice. It was this arbitrary work dole that disappointed me about Jen more than anything. We did not need busywork atop the already voluminous readings, and the fact we weren't able, from time to time, to discuss certain crucial points in class was her fault, not ours. \n"
        },
        {
            "course_name": "African Civilization",
            "review_date": "December 10, 2005",
            "review_content": "\nJen is nice, young, and totally disorganized. The stuff covered in the class isn't her focus (she's just finishing up her dissertation on Public Health in Uganda), and there are a lot of questions she doesn't know the answers to. She has this tendency to write on the board totally incoherently, and class time didn't always help clarify the general ideas as much as the specific tangents the class discussion went off on. Otherwise, she's nice and approachable enough -- not necessarily recommended but not a nightmare either. \nWorkload:\nThe workload is the same in all the af civ classes: way too heavy sometimes and really light other times. There are two visual hour responses, a short essay, a long essay, a midterm, and a final. It's 4 points for a reason. Jen's grading seemed fair-easy to me, and 20% of the grade is participation/attendence which is a gimme if you show up and speak.\n"
        }
    ]
}