{
    "prof_info": [
        {
            "prof_name": "Sonam Singh",
            "prof_id": 12984,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "December 29, 2016",
            "review_content": "\nThis class was the worst part of my semester. The material itself was enjoyable, but Professor Singh's instruction was terrible. To start, he would not grade or read our essays until a scheduled 30 minute meeting, usually around a month after we would hand our papers in. I would sit down for our meeting, he would struggle to find my paper, and ask me if I had actually handed it in. Once he found it, he would take 5-10 minutes to read my paper (for the first time) in complete silence, write a grade on the last page, then would not let me look at it until the end of our meeting. He, several times, gave me formatting corrections that directly went against MLA style, which he was adamant I adhere to. He only reads the sections of the books we read in class so he has no context for the passages other than what he can garner from a skim of Sparknotes and what he remembers from high school. Avoid this professor if possible. His instructions are confusing and counterintuitive, his expectations are unclear and constantly wavering, and his teaching is unenthused and uninformed. Avoid avoid avoid.\nWorkload:\n3 papers and some reading\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "September 17, 2015",
            "review_content": "\nEnthusiastic professor that really made me appreciate Greek/Roman history more. Unlike what the other person said I don't think he's pompous about having gone to Cornell at all, when he talks about it he seems more self-deprecating or ironic in a way. Although he does take a while to get papers back he is very accessible via email and after class usually. A lot of the class is reading old white men books, but it was an overall nice experience to take the class. \nWorkload:\n3 papers and museum trip\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "August 27, 2015",
            "review_content": "\nAVOID THIS PROFESSOR IF POSSIBLE. His lectures were terribly boring, he never actually grades our papers, holds meetings at random times and only when you remind him, and he is extremely condescending. I had to make my papers 'interesting' or else I wouldn't get a good grade. He likes when you think out of the box - meaning completely unfounded utterly ridiculous fluff based on nothing. \nI couldn't avoid it because first year professors are random assignments, but if he ever starts teaching other classes here, AVOID.\nOh, and he loves mentioning how he went to a much more superior institution than Columbia: Cornell. \nWorkload:\neasy, breezy, but he harshly grades. 3 papers. no need to take notes.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "July 27, 2015",
            "review_content": "\nEh, okay professor. Should provide a better introduction to the texts we read and moderate discussions better. Also: is he gay? Kind of mysterious. The discussions were poorly moderated and monopolized by those who just wanted to pontificate. I wonder if there's a pedagogical intent in not getting our papers back to us on time; I think maybe he likes to play mind games with us. Overall decent though. Enjoyed it more than I didn't. Learned a lot. Have a good appreciation for greek history now. Took in Fall. \nWorkload:\n3 papers and class participation \n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "May 02, 2015",
            "review_content": "\nThe class was difficult to follow because of my weak foundation in Greek/Roman literature. However, he was a pleasant enough individual. He occasionally goes a little off topic and I think that discussions could be facilitated a little better, but he does do a good job at teaching the class. He's respectable and kind, for the most part. I didn't like the readings, but he did a good job at sparking interest in the texts by framing discussions with historical context at the beginning of some classes. He also has a strong personality---in a good way, and is brilliant. I would take another class with him, but he's apparently not teaching any classes but fye/fys classes? 9/10 reccomend. \nWorkload:\nPapers and readings. Manageable. \n"
        },
        {
            "course_name": "First-year English: Legacy of Mediterranean I",
            "review_date": "March 10, 2015",
            "review_content": "\ngreat prof!\nWorkload:\n3 essays\n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "November 12, 2014",
            "review_content": "\nI should probably preface this by saying that this class was not on my list of preferred courses, so I already had some bias going in, but Professor Singh's class was a very frustrating experience. In the beginning of class we would waste so much time looking up somewhat-but-not-really relevant things online, allowing very little room to discuss the readings. I don't feel like I learned much from this class and I can't say that I enjoyed it. There wasn't much of a facilitated discussion, and I didn't feel like Professor Singh provided the necessary groundwork or questions to get discussions going. Yes, I'm walking out of this class with the ability to now say that I've read many famous Greek and Roman works, but not much else. Professor Singh is a nice enough person and definitely entertaining at times, but his class left much to be desired. \nWorkload:\nvery manageable-- weekly readings, 3 essays throughout the semester, each with a first draft and a conference. one of the essays is a research paper\n"
        },
        {
            "course_name": "First-Year English: Legacy of the Mediterranean II",
            "review_date": "November 12, 2014",
            "review_content": "\nI should probably preface this by saying that this class was not on my list of preferred courses, so I already had some bias going in, but Professor Singh's class was a very frustrating experience. In the beginning of class we would waste so much time looking up somewhat-but-not-really relevant things online, allowing very little room to discuss the readings. I don't feel like I learned much from this class and I can't say that I enjoyed it. There wasn't much of a facilitated discussion, and I didn't feel like Professor Singh provided the necessary groundwork or questions to get discussions going. Yes, I'm walking out of this class with the ability to now say that I've read many famous Greek and Roman works, but not much else. Professor Singh is a nice enough person and definitely entertaining at times, but his class left much to be desired. \nWorkload:\nvery manageable-- weekly readings, 3 essays throughout the semester, each with a first draft and a conference. one of the essays is a research paper\n"
        }
    ]
}