{
    "prof_info": [
        {
            "prof_name": "Tovah Klein",
            "prof_id": 1146,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Field Work and Research Seminar: Toddler Center",
            "review_date": "November 07, 2012",
            "review_content": "\nAlong the lines of some of the most recent reviews, there as some incredible assets to this class (getting the chance to work longitudinally with the toddlers in the Center), but they are tempered by its deficiencies.  Yes, the workload is formidable, and the pressure only increases as the year goes on.  However, my struggles were with the actual design of the seminar, the way that our experience as students was framed, and the behavior of Professor Klein herself.\nThe seminar generally consisted of a discussion of the assigned lit, followed by an activity.  In virtually every class, we were told to break into small groups and draw up a diagram of a developmental paradigm (for example: \"attachment\").  We were then told that, no matter what we were able to come up with, a diagram could never encompass the complexities of the topic at hand.  At first, the exercise was interesting, but it became redundant - and therefore pointless - very quickly.  \nRegarding how we were treated as students by both the Center staff and Professor Klein, we were regularly told to leave our perfectionist academic ideals at the door.  I recognize that grades make the majority of us anxious, but this message was conveyed to us so often, that it started to feel highly condescending. What's more, Professor Klein prefaced many of the comments she made in seminar with \"when you are mothers.\"  While I certainly wish to have children someday, I didn't sign up for this class for parental training -- I did it because I want to be a psychologist.  I found this behavior limiting to what I was able to learn from Professor Klein.  \nFinally, I deeply resented the gossipy nature of the Toddler Center staff. I disliked how Professor Klein and Patricia Shim, specifically, spoke about the parents of the children we were caring for, and overheard them talking about the seminar students on more than one occasion.  I thought that this was patently inappropriate.  \nThis is a very negative review, but I do want to finally stress how wonderful it is to actually work with the children.  You are able to learn so much from watching them grow within the context of the classroom, and that experience is immensely gratifying.\nWorkload:\nHeavy.  Ungraded, 1-page assignments throughout first semester, 3 or more large papers and projects in the second semester.\n"
        },
        {
            "course_name": "Field Work and Research Seminar: Toddler Center",
            "review_date": "March 30, 2011",
            "review_content": "\nThis class is extremely interesting. You learn an unbelievable amount about how to study individuals, and absolutely everything there is about toddlers, quite a bit about the process of being a parent, and also about the intricacies of the child-parent relationship. The teaching component is lots of fun, and very interesting as you work with the toddlers (12 in each class) throughout the entire year and, as a result, you know them on a very individual and personal basis. This is hands down one of the Psychology Department's most valuable classes, and the structure of the Toddler Center is non-traditional and highly respected in the academic realm of early child development. Not to mention that its a very competitive program for toddlers to get into, and is in high demand amongst parents in NYC. \nWhile the course-load builds up at the end of 2nd semester, you are forewarned far in advance. Whole class days are devoted to working on Research projects, and you have the support of Prof. Klein, two TAs, the head teachers, and everyone else at the Toddler Center. Also, most of the work is done in groups, which cuts down a LOT on the individual work-load. In contrast to previous reviews, I haven't noticed ANY subjective grading, favoritism, or unpredictable grades. Prof. Klein has high standards across the board for every aspect of this Seminar--which is pretty normal for any Senior Seminar. She also gives you a final grade at the end of the semester, and takes learning and progress into account, so if you don't know what you're doing in the beginning, you have lots of time to learn and improve. You receive your first semester grade at the end of second semester (it just shows up for both semesters since its a year-long course). \nI highly recommend this class for anyone who loves kids, and is interested in working with children and families in any way in the future. Be forewarned that it IS a huge time-commitment, and is based mostly in group-work. \nWorkload:\nWeekly Observation/Reflection, 1 Group Seminar Presentation, 1 Group Research Paper, 2 Observation Papers, 1 Classroom Activity+ 2 pg. Paper (with a Partner). \n"
        },
        {
            "course_name": "Field Work and Research Seminar: Toddler Center",
            "review_date": "April 03, 2008",
            "review_content": "\nI have really mixed feelings about this course. The toddlers are amazing, and the time in the center is incredibly valuable. The seminar, however, is really difficult. The information is interesting, all the people involved with the TC are really experienced and have a million interesting anecdotes, but the workload is extreme. and extremely annoying. first semester isn't bad but second semester is paper after paper after project after project. if you want to go into early childhood ed it will look great on your resume, but if you just want to play with kids i would recommend babysitting. If this class were worth 8 credits a semester, instead of 8 credits a year, i would recommend it highly. \nWorkload:\na lot. \n"
        },
        {
            "course_name": "Field Work and Research Seminar: Toddler Center",
            "review_date": "May 13, 2007",
            "review_content": "\nThe toddler's are great but the seminar workload is hell. Throughout the semester I kept questioning myself about whether or not it was all worth it. You will end up devoting your entire life to this class.  You may put your heart and soul into your work and still not end up with a good grade.  Grading is extremely subjective and unpredictable. \nWorkload:\nA ton\n"
        },
        {
            "course_name": "Field Work and Research Seminar: Toddler Center",
            "review_date": "September 03, 2004",
            "review_content": "\nalthough it's fun to play with the kids in the toddler center, i wouldn't recommend this class.  the grading is completely unpredictable, and i feel that prof. klein plays favorites to an extreme extent.  additionally, i found that most of the people who took this class were more interested in learning how to raise kids than studying their behavior in a scientific fashion.  if you're interested in reproducing as soon as you graduate from college, you'll fit right into this group.  if you're looking for a scientifically-oriented class, don't bother.\nWorkload:\nlots of reading, several presentations.\n"
        },
        {
            "course_name": "Field Work and Research Seminar: Toddler Center",
            "review_date": "August 29, 2004",
            "review_content": "\nGreat class, not enough credits. Be prepared to work your butt off, but I learned more than I had in any other class in college. Also, she's an annoying grader, very subjective, so even if you think you're doing well, you might not be getting an A. That being said, the class is still worth taking. \nWorkload:\nA ton, weekly observations of toddlers, a group project, an individual project, a final paper, another paper (but over a full year). \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "August 29, 2002",
            "review_content": "\nI have to say I beg to differ. I very much enjoyed Prof. Klein's class. Though the master text is dry and long and quite overwhelming, the lectures were interesting and interactive (so much as you could get for a 60-student class). She often told personal anecdotes, and centered the topic of discussion around what seemed to interest the class most. The only thing was, we never really were able to cover everything listed on the syllabus during lectures --though come exam time she would map out for you what you needed to know, and which sections of the text you should review that we didn't cover. Prof. Klein also happens to be a very nice lady, and quite accomodating to her students. It just bothered me the class began at 9:10 AM promptly, when students are not at their fullest intellectual capacity.\nWorkload:\n2 midterms, one final (non-cumulative) -- MC, fill-in the blanks, short answer -- plus a three-page reaction paper to a visit to Fountain House (a mental patient facility) mid-semester\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "May 29, 2002",
            "review_content": "\nI completely agree with the other reviewer, don't take this class. She's a really nice woman, and she's great as a person, but still not worth it. The textbook was hell to read through, and most of the stuff was what you already know from life in general. But that doesn't mean that the tests are easy -- they're not. The multiple choice was really tricky, and there seemed like there could be more than one answer, and there was no curve. It wasn't my style, and it just wasn't worth it. \nWorkload:\nnot bad, 3 tests, non-cumulative\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "May 28, 2002",
            "review_content": "\nI strongly suggest that you avoid this class, at least with this professor. I felt that I didn't benefit from her lectures. It's hard enough when it's a 9 a.m. class, but it gets worse when Prof. Klein is moody or when her test questions are unfair. I felt that her multiple choice questions were particularly tricky-it often seemed that there were at least 2 right answers. She doesn't use the textbook often to guide the test material, and instead sometimes focuses solely on one topic instead of the many discussed in class. Also, I felt that she emphasized the models of psych throughout the course. While that's fine, she didn't really go into depth about any disorders. She could sometimes be helpful, but overall, I left this class wishing that I didn't take it.\n"
        }
    ]
}