{
    "prof_info": [
        {
            "prof_name": "David Gulley",
            "prof_id": 10315,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Entrepreneurial Business Creation",
            "review_date": "May 18, 2014",
            "review_content": "\nFairly easy class, but your grade can drop quickly if you don't put some good work into the projects and studying for exams. This is because he grades strictly on a traditional 90-100 = A, 80-90 = B type of scale.\nYou have two grading options to choose from.\n1. 50 points midterm exam, 50 points final exam\n2. 25 points Case Study project, 25 points midterm exam, 25 points Business Plan project, 25 points final exam\nYou can get up to 10 points of extra credit, mostly from doing well during your project presentations. I think normal class participation is supposed to be factored into potential extra credit as well, but it's hard to say because most people who participated actively during class chose to do the projects anyway. If you want to actually get a feel for some of the concepts EBC covers, and have a better chance at getting an A, it's probably better to choose the projects + exams option.\nNote that the projects are done in teams of 5-10 or so people, usually on the higher end. Coordinating amongst that many people can be a challenge, especially if you have a fair number of masters students in your group. On that note, Professor Gulley is always quick to point out when English isn't someone's first language, and he actually completely stopped one group off halfway through their presentation because no one on that team could speak English that well, and they just weren't able to communicate. It was an awkward moment.\nExams usually focus on general concepts, things like the most important characteristics of an aspiring entrepreneur, what defines an attractive opportunity, etc. Definitely skim through the textbook when preparing for exams because there are lots of lists/checklists of key points, and you'll draw most of your answers from those lists. Otherwise, his lectures are quite good. He's clearly a very experienced and intelligent fellow, and although his pace is on the slow side (meaning we often fall behind in the lecture), he uses a lot of real world examples to reinforce his points. He brings in 4-5 guest speakers, ranging from angel investors to Silicon Valley lawyers, all of whom were pretty damn interesting to listen to. \nOK class overall - I definitely learned some key things that I'll need to remember if I decide to go into tech-based entrepreneurship, but otherwise it's a pretty generic class about entrepreneurial/business skills. Gulley's a nice guy and he's more than willing to talk to you about your own startup ideas, so that's a great thing to take advantage of.\nWorkload:\nEveryone has to take a midterm and final, both of which were pretty easy as long as you've looked through the lecture slides and textbook a few times. The two projects include a 25 page report, and a 10 minute presentation (for which you can get some great extra credit points). Fairly large groups, so each person only writes a couple pages (basically just one section of your case study / business plan), but it's important to give yourself a couple of weeks to identify a good idea, get that approved, assign sections to write, actually write them, and then compile/edit everything so it flows nicely. Don't underestimate the difficulty of coordinating this with such large groups. Otherwise, seems like most people are pretty satisfied with their grades, and there isn't much work you need to do overall. \n"
        },
        {
            "course_name": "Entrepreneurial Business Creation",
            "review_date": "December 25, 2011",
            "review_content": "\nFluffiest class ever. Questions like \"What are the decisions that you need to go through when starting a business? What capabilities should your team have? How will you fund your venture?\" And the like. The class teaches the important questions to ask when starting a business, but it's nothing that couldn't come out of the equally fluffy textbook.\nThen the final came, which was not as fluffy. Bit unfair in my opinion. Doing well on tests requires you to go to every class and pay attention, because some of the questions will be like \"in class we discussed x. What was one example of x?\" And there is no way to know the answer unless you went to that lecture.\nGulley is a chill dude. He seems to understand that his course isn't the most important thing in the world. He also looks for interns for his company throughout the semester. Pretty open to talking about things, but never on campus beyond this one course he teaches. Aside from his confidentiality agreements, he talks about his job pretty candidly.\nThe team projects were kind of annoying in that we got a guide for how to do them, but we had no idea what we were being graded on.\nOverall, chill professor, fluffy course (and he knows it), grading can be a little arbitrary.\nWorkload:\n2 team projects, 25 pages max, optional presentations\n1 midterm\n1 short final\n"
        }
    ]
}