{
    "prof_info": [
        {
            "prof_name": "Steven Feiner",
            "prof_id": 39,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "User Interface Design",
            "review_date": "December 20, 2016",
            "review_content": "\nTip for the Final: shallow understanding of concepts would not work, make sure to read the papers and spend hours fully understand them. Three of four projects involve HTML, CSS and JavaScript.\nWorkload:\n2 individual projects 2 group projects final is hard\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "January 03, 2014",
            "review_content": "\nFeiner seems to be passionate about user interfaces. His lectures, however, betray this notion because they are extremely boring. I found his assignments to be great tools for learning Javascript and how to interact with APIs. The final was ridiculous. He basically asked random questions about anything from the lectures to the grossly large amounts of assigned reading. If you wish to do well on his exams, MEMORIZE EVERYTHING, otherwise you are screwed. I find it to be of poor taste when professors give assignments and exams that are completely unrelated and that rely, not on applicative knowledge, but pure memorization. He seems to be a man of habit, so I'm not counting on this ever changing.\nWorkload:\nRelatively easy compared to most computer science classes. Probably 3-4 programming assignments with detailed descriptions. Some are group assignments. We only had a final but you might have a midterm, both of which would require large amounts of reading and memorization. \n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "November 19, 2013",
            "review_content": "\nUser Interface Design w4170\nI took this course in my first semester as a grad student. And I learned how well coffee does at keeping you up. Most people doze through his classes or do their own work and he doesn't seem to mind that. Some lectures do get interesting but mostly there's not much interest generated by the professor.\nBut the assignments are really cool. Most of them use some form of APIs along with javascript and you get to build pretty neat stuff. You can look up the previous year assignments and projects. And you do see that there is some common sense required while building UIs and the common mistakes to avoid.\nWorkload:\nThe lightest course ever. Gotta write a lot of reports and explain why you did something the way you did it. That's what matters.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "July 18, 2011",
            "review_content": "\nThe class is very well organized but the lectures are really boring. The assignments in this course are all based on Flash Builder with 3 assignments(2 individual) and a final project. The theory exams are totally theoritical. If you have a really good memory, you can do very well in the exam. Just read everything from the textbook as well as his slides thoroughly, as questions can come from anything: Be it a single line mentioned in the slide or rather a random paragraph from the tetxtbook. \nWorkload:\nEasy course. Not too time demanding!\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "December 20, 2010",
            "review_content": "\nThis class is great for someone that is planning to go into UI research. For everyone else, not so much. It should actually be called \"The History of User Interface Analysis and Research.\" Feiner spent many of the lectures describing, in laborious detail, research projects and ideas from 15 to 30 years ago.\nAs the review before mine points out, the tests are sadistic. Unless you have a photographic memory, you are not going to do well. The midterm's questions were based on less than 1% of what was covered in the lectures, textbook, and articles he asked us to read. For example, 20% of the test was based on one random paragraph from one of the many articles. Another 20% was based on a topic he spent literally 5 minutes talking about during a lecture. Why is this a bad idea? It rewards students that have better memories or, to a lesser degree, that happen to get lucky because they studied the 1% of material that shows up on the tests. Studying for Feiner's tests is essentially a game of roulette, but with much a lesser chance of success.\nOh yeah, and Flash Builder 4 is terrible.\n\nWorkload:\n2 individual assignments and 2 group projects. Time consuming, but not particularly hard. \nSadistic midterm and final.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "May 10, 2006",
            "review_content": "\nI would not say that Prof. Feiner has a harmonious relationship with teaching, but it's hard to be more specific than that. He is careful to be organized and to cover material on schedule; yet he obviously hasn't edited the material he teaches in years - it's old and mostly irrelevant, although the final 3 weeks of class finally had some traction. He tries to be a good guy (I guess) by telling you how to prepare for exams and then says \"do all the [voluminous, outdated] reading and review your class notes,\" as though that's helpful -- and then asks a couple of questions on the exams that are calculated to punish all but those who memorized the course material. 40% of the midterm, for example, was based on a topic covered by 3 pages in the text and a couple of his slides -- all of which seems faintly  sadistic.  The individual HW's were interesting; there could have been more of them. The team projects, as always, were an aggravating waste of time. I think that if, as a start, Feiner updated 60% of his course material and learned how to relax, both his and his students' attitudes would improve.\nWorkload:\nNot bad unless you consider reading hundreds of pages of 20-30 year old ACM articles a waste of time.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "April 09, 2006",
            "review_content": "\nA word of caution. Feiner seems to have a predanatural power to remember faces. His class will bore you to tears, so few people show up. However he still knows who people are, and for those that are on this floor a lot (CEPSR 6), this is a big problem. I mean either that or scowling glares are the norm in his lab.\nPS: The material covered is common sense. Any basic design class (in any field) will teach you everything this class does (and then some). The biggest problem with way this class is presented is that there are 200 billion different rules and guidelines, which all together sound like superstitious drivel. The field has few (important) pricinples, all of which are presented in the first week. The rest is a waste of time.\nWorkload:\na few nights worth of coding. Really, really unpleasant coding.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "January 26, 2004",
            "review_content": "\nI mostly agree with what's been said by earlier reviewers, but wanted to point out some ways in which the class was different in the fall of '03 compared to earlier years:\nProfessor Feiner makes extensive use of powerpoint nowadays, as well as videos, some overhead slides, etc. The powerpoint slides aren't especially comprehensible in isolation, though; when reviewing for the midterm, have the notes in one window and google open in another to look up terms that aren't explained directly on the slides.\nApart from that, I don't feel like I really learned the vocabulary and concerns of interface designers working in industry; the class focused more on academic UI research, past and present. I plan to redress this by doing a fair amount of independent reading this term.\nWorkload:\nI found the programming workload for the course to be staggering. Part of this can be attributed to the lack of written problem sets or assignments that were strictly design assignments; for all four we had to handle design _and_ implementation. The first three assignments built on each other (though the final project was unrelated), but assignments 2 and 3 both required significant reworkings of and extensions to what came before. I don't think that an advanced undergraduate course should require its students to produce more than 2000 original lines of code or so, and I wrote much, much more than that.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "January 18, 2003",
            "review_content": "\nSince you really have to take Feiner if you want to ever take UID, you need to just ignore his poor ability as an instructor; just use this opportunity to read a lot of textbook material and research papers in this field. It is a field that is completely ignored in ALL other classes, and it is quite important. Unlike most courses in the department  it actually practical and applicable to anything you'll ever program. I do agree with all previous (bad) reviews. However, the problem with the allegedly harsh grading of the homework is that most of the grade is not based on functionality. Your program may follow all specs, but still get a C. It is the USER INTERFACE that gets you most of the credit. And you can only start thinking of user interface AFTER you completed all specs, which is usually around 5am the night before it is due. And that is truely a big problem with this class. But as you know from the previous reviews, you get some penalty-free late days to use on any combination of the first 3 (!!!)assignments. Another major problem is that there is a lot of reading, and it is all asked about in the midterm and final. As a rule of thumb, if there is a formula of some sort in any of the papers, it will appear eventually on a test. You will probably have to state it and explain it. Nothing too fancy, but you do need to memorize a bunch of them like it's a high-school history test. Not the end of the world, though. \nIt is true, this class feels more like a Humanities class that a regular CS class. You have to read a lot papers, and there are never problem sets (only programming projects with minor explanations of \"why did you choose the interface that you did\"). It is, though, not the hardest class you have taken or will take in the department, and it opens a window to a very neglected (and again, practical) area of compters. Lets face it, in the real world, your boss/client is much more likely  to care about the interface of your program. And like in this class, they are going to take the functionality as a given.\nWorkload:\nNever in groups . 3 programming assignments, a final programming projet + a demo (ALL graded for user iterface rather than for functionality), a midterm, and a comprehensive final. Also, A LOT of reading. While the book can be somewhat skimmed, you do need to know the major concepts of every chapter. As a rule of thumb, after reading every chapter ask yourself 5 feasible questions he can ask. It's pretty obvious. There is no way around reading all research papers, and don't fool yourself you will have enough time to read even a quarter of them during finals.  However, like in every class like this, nobody has time to do all the reading and there's a curve. The midterm and final consist only of essay questions. The trick is that if you understand the general theory (mostly from the book) and use \"the UID language,\" you can totally b/s and get some partial credit on occasion. Finer travels a lot, so there are many occasions that there is a gust lecture, some of them really cool.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "January 17, 2003",
            "review_content": "\nI will admit that his lecturing style is pretty bad. But he does make time for his students in office hours, and looks like he genuinly wants to talk to you. You meet with him once, and he will remember your name. So that is one good part of this professor that shoudl be remembered. Workload in the class is not that bad. \n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "December 18, 2002",
            "review_content": "\nNever in my life have I seen a professor hold so much contempt and disdain for his students.  Feiner's lectures are flat out boring and .  He has you read one or two of around 25 long research papers, and then just stands in a corner and writes sloppily on an overhead projector while discussing it.  He is impossible to approach, because he seems to believe that students (and their questions) are below him.  The three homework assignments here were not hard (about 15 hours each, roughly), but the final project was tough only because of the demo.  Doing a demo with Feiner is basically him apathetically saying \"mm hm\" every two seconds to your explanation, and then bringing up every bad aspect of your program to you that he can find in the 5 minute span and grilling you on it.  Tests are tough, too.  Feiner holds you responsible for those research papers on his tests, which are entirely essay form.  The bottom line: unless you enjoy reading insane amounts of research papers, steer clear of Feiner.\nWorkload:\nThree homework projects (not hard), one final project with demo (hard only because of Feiner's demo practices), midterm and final, based on an unbelievable amount of REQUIRED reading\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "January 03, 2002",
            "review_content": "\nWhy does this Prof. even bother to teach, it's so obvious that he hates it and has contempt for students. There is too much reading for the class, as in addition to the textbook (not bad) he assigns copious amounts of PHD disertations that are total BS. The subject is interesting, but he berates his TAs and they then grade the projects harshly.\nWorkload:\n3 2 week programming assignment, 1 3 week final programming projcet, midterm,final\n"
        },
        {
            "course_name": "Computer Graphics",
            "review_date": "January 03, 2002",
            "review_content": "\nInteresting material but presented in a very confusing manner. Will someone explain to Feiner how to use Visio and Powerpoint so that no other student has to put up with his badly drawn overhead slides, he does also teach User Interface Design. Very confusing and extremly poorly written programming assignments that the majority of students have no idea how to tackle. TAs are swamped with questions. Makes disparaging remarks in class about those who do poorly in midterm.\nWorkload:\n3 programming assignments (poorly written) 1 final project (very difficult and is based on one's perfect solution or lack of a solution on third project) midterm and final are both 75 minutes.\n"
        },
        {
            "course_name": "User Interface Design",
            "review_date": "December 31, 1999",
            "review_content": "\nUser Interfaces contains useful, if somewhat obvious, material. He basically follows the book without adding a huge amount. He has a fair lateness policy, but seems unable to deviate from it when student's circumstances require it (i.e. sickness).\n"
        },
        {
            "course_name": "Computer Graphics",
            "review_date": "December 31, 1999",
            "review_content": "\nA mediocre lecturer who takes a lot of time to confuse you, instead of doing it quickly like other comp sci profs. At least, that was my impression until I stopped going to class. His lateness policy is a breath of very cool fresh air -- thank god, because the assignments themselves are poorly designed and students are ill-prepared for them. Like in some other comp sci courses (ahem, OS), you get the feeling that the professor and TAs started out with very ambitious assignments that they were going to prepare students for -- until they forgot to do the preparation part. But even that may be being overly generous, because the net result is inexcusable: students have no clue how to approach the programming, and TA office hours (again, so much like OS and other high-level CS classes) turn into unofficial cheating sessions where beleagured TAs have no choice but to disseminate crucial information (that the rest of the class doesn't get). I don't know if Feiner and his TAs even realize how much potential for learning gets thrown out in the process. And while there may be worse professors in the department, that doesn't make Feiner good.  The bottom line?  Steer clear.\nWorkload:\nAbout 5 large programming assignments (large in frustration and time-consumption, not in excessive educational value). Midterm and final that (are we used to this yet?) evaluate primarily whether or not you take tests well, and secondarily whether or not you watched the course videos on fast-forward the night before.\n"
        }
    ]
}