{
    "prof_info": [
        {
            "prof_name": "Frances Richard",
            "prof_id": 1037,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 29, 2012",
            "review_content": "\nI'm posting this review two and a half years after taking Women and Culture with Prof. Richard.\nI honestly didn't like this class at the time.  I didn't like her, I felt like she didn't like me, I disliked all the pretentious comments getting thrown around all the time, and I walked out of the class with an A- and felt like my writing didn't improve at all.\nI'm just now realizing as a junior that this is one of the few classes I've taken at Barnard or Columbia that truly made me feel engaged in the class, made me care about what we were discussing, and made me debate and question people because I wanted to, not because I was being forced to in order to meet some minimum participation requirement.\nThat's all I wanted to say.  I'm still not sure I like her, and I still dislike pretentious comments, but I think this class was valuable to me and if you're taking it, I think it will be valuable to you too.  Good luck!\nWorkload:\nOne short paper and a slightly longer one, I think.  no problems.  I do recommend doing the readings--I remember skipping them a couple times and feeling totally lost\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 19, 2011",
            "review_content": "\nAs many other reviews say, Professor Richard has many insightful comments and pushes you to be specific in your writing and comments. She does a great job of facilitating discussion by making sure no girls repeat vague comments they found on Spark Notes -- she really makes you think and complete your thoughts and comments. \nHowever, she was an EXTREMELY hard grader. I am no student who gets mad if teachers have high standards, its understandable, we are at a very rigorous school. My issue with Professor Richard is that she did not help in meeting such standards. After meeting with her many times, I never seemed to learn how to improve my writing skills. When it comes to actual classes, Frances Richard makes it interesting and engaging but for writing the papers she is not helpful at all.\nThat being said, she IS helpful with coming up with ideas just not helpful in the process of writing the papers. She always found issues with my final draft which she did not mark on the rough draft, making it difficult to get good grades in the class.\nShe is also very cold and condescending at times. Not a warm fuzzy teacher in any way. \nAs a first year english teacher I really was unhappy with her because I found she did not help in setting the foundations for writing at Barnard. She did not help teach my how to improve my writing skills. \nWorkload:\nPretty reasonable -- 2 literary analysis, and 1 research paper. Readings are manageable \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "May 02, 2011",
            "review_content": "\nSo obviously there is very little you can do about the professor to which you have been assigned.  You got lucky.  Having her impart wisdom upon you will be the greatest experience of your young college career.  Since you can't exactly change professors (and really, you would be stupid to do so) here is some advice for her class:\n1. Embrace it. Buy into it. Participate. All of the above.  She may ask you to expand on a topic, or make you define exactly what you mean by a particular word, or even call you out for textual support- which, I understand, can be a little intimidating.  Don't let this stop you.  Speaking in class, and participating in the intellectual roller coaster ride on which you are about to embark will lead to some of the most enlightening experiences of your life. READ THE MATERIAL. Pick out key passages to highlight in class. She loves this.\n2. Go to her office hours.  Use her. Really.  Many of the girls in my class were afraid to go speak with her because they didn't have a firm grasp on their ideas...this is the best time!! I would go into her office not having any notion of what idea I wanted to pursue, but, through bouncing ideas off her I gained a better sense of my thoughts and completely grew as both a writer and a reader.  Sidenote: she's great in email as well.  I would send her complete paragraphs and she would send them back with amazing suggestions. \nHonestly, consider yourself the luckiest girl at Barnard.  She's awesome.  Get ready.\n\nWorkload:\n2 text-based essays (turn in an ungraded draft, then the real one) and a research paper. Note on the research paper: start early.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "August 31, 2009",
            "review_content": "\nProf Richard is fantastic!!! If she taught more courses I would legitimately become an English major just to take all of them.  I really wasn't looking forward to taking first-year English, and I didn't get my top choice of section, but this class turned out to be excellent.  Even when we were discussing touchy material (which was surprisingly often) she managed to keep the discussion enjoyable and thought provoking, as opposed to frustrating.  She is also completely brilliant, as demonstrated through her thought provoking questions during discussion and her intense review of all drafts/papers that you turn in.  If you take a class with her, be sure to go to office hours to discuss writing ideas. It will help you IMMENSELY, even if you really have no idea what you want to write about.  I came into college with a pretty good foundation of writing experience, but this class truly taught me how to develop and support my theses.  Do note that this is not a class that is good to come to unprepared.  Although you may be able to get by, you'll feel dissapointingly left out of the discussion.\nWorkload:\nManageable.  Reading for each class, two shorter (~5) page papers, one longer (~12) page research paper, all with ungraded drafts.  Prof. Richard clearly wants this class to be a constructive experience for students, rather than simply a fight for a good grade.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 17, 2009",
            "review_content": "\nThe most brilliant person I've ever had the pleasure to meet and from whom to learn. She truly has the gift of understanding how to drastically improve your writing and expression, based on how your mind works.\nShe is incredibly inspirational, and the reason why I am taking on an English minor, when I had no plans to do so before taking her course. I would recommend her class to anyone that genuinely wants to learn and improve their writing, analyzation, and thinking all together. \nShe is a difficult grader, but her feedback is incredibly specific and helpful if you take the time and effort to improve. \nIn short, Professor Richard is the most gifted professor I have ever had, and I have a feeling that every professor I have in the future will pale in comparison. \n \nWorkload:\n3 papers and short lecture responses that are ungraded. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 18, 2008",
            "review_content": "\nMost inspiring professor I have ever had. Her class is truly a pleasure. Everything she says is genius, she really helped my writing style and changed me as a writer. She's a tough grader, but if you show an honest effort she will try to help you out. I LOVE her. Take this class!!!!!!!!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "May 08, 2007",
            "review_content": "\nAs a disclaimer, I have never liked those warm, fuzzy English teachers who ask you about your day.  If that's what you're looking for, Professor Richard will not be your cup of tea.  If, however, you can deal with a somewhat cold, slightly detached woman who is completely brilliant and can edit papers like none other, absolutely take a class with her.\nProfessor Richard successfully smacks down all those obnoxious vague comments that are so common at Barnard and Columbia: \"Well, I just really think it shows the injustice of patriarchy.\"  What is it?  What is injustice? What is patriarchy?  This is the level at which she expects her students to think.\nIn short, her insights into the literature and life in general are inspiring and enlightening.  What's more, she is one of the best editors I know.  Take a class with her and you WILL be a better person for it.\nWorkload:\nNot terrible.  2 essays, a research paper, lecture responses that are ridiculously easy to bullshit (I didn't go to a single lecture and did fine using wikipedia).\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 13, 2007",
            "review_content": "\nGreat class, great professor. She is quirky, and very willing to help. Go to her for help on your papers. The discussions were fun (i remember many laughs, then again, it may have been that particular group of girls) and the readings were very interesting (though I skipped 'The Rover' because of all the attempted rapes). If you have an interest in Greek mythology, you'll love the first half of the semester. Speak up in class, she is not out to make you look stupid. She may ask for clarification, but as long as you have evidence, you'll be fine. Once again, great class. It was tied as one of my favorite classes for that semester.\nWorkload:\nthe standard stuff for first year english classes, 2 papers, one big research paper, response papers to lectures, small assignments that build up to the research paper, and a meta text.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 22, 2006",
            "review_content": "\nShe is amazing! A tough grader but completely awesome! Knows her stuff and you really improve your writing ---conferences with her are so helpful--always take advantge of them! She's awesome!!!!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "March 30, 2006",
            "review_content": "\nabsolutely intelligent professor. Sometimes very cold and very anal about certain things. She leads very interesting conversations and there is never an awkward moment in class. We always end class right with the discussions and sometimes we go over the time. She is always interested in what you have to say. She has alot of conferences appointments and is willing to help you with your writing. I find her a very hard grader and she tells us this and also said it gets easier as the papers come. If you are looking to discuss and learn alot, this is the class for you.\nWorkload:\n2 3-4 pages paper, 1 research prospectus with drafts, and responses for the supplementary lectures \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 16, 2006",
            "review_content": "\nThis woman is absolutely amazing. She is the most insightful, articulate, and intelligent teacher I've had in my life. \nAt times I didn't look forward (at all) to her class (mostly because of other students whose excessive contributions I found to be boring and useless), but I realize now it wasn't because of Frances. Now that I look back on it, it was really an amazing class. \nBarnard is losing out if they don't tenure this brilliant professor!!!\nWorkload:\nthe reading was totally managable. a few papers- she starts out grading more difficult, but then gets easier. the research paper seemed like a guaranteed A. \n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "April 01, 2005",
            "review_content": "\nShe's a great professor.  Frances really knows how to get a discussion going all the way until the end of class and tries every now and then to weed out people who don't participate because of shyness (but does her best not to embarass them once they are \"found out\").  She is also extremely approachable during office hours, appointments, etc. and answers her emails very quickly.  Her comments are useful, especially for the first drafts of essays.\nWorkload:\n2 5-6 pg essays, and one 8-10 pg research essay (all of them require first drafts).  Very approachable and helpful about the drafts.  I actually found her to be a lenient grader, especially if you show real effort and interest in your first draft, as well as a true improvement (e.g., you take her comments seriously and to heart) by the time you get to the final draft.  Effort really does count!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 18, 2005",
            "review_content": "\nThis lady rocks.  She is god's gift to the english department.  She can think of a perfect analogy in a second, pinpoint exactly what's wrong with your writing without making you feel bad, and she does it all with a nonchalance that makes it seem easy.  Everything positive that has been said about her so far on this page is TRUE!  Wow.  It's also true that, as one reviewer noted, she's not a flower-child of a teacher, but that doesn't mean that she's cold or distant.  She's just not sappy.  She grades fairly, based on student ability, and is somehow able to make the Hymn to Demeter interesting.  How?  Who knows.  There are two smallish papers (4-5 pages) to be written during the first half of the semester, and then one larger research paper for the last half of the semester.  Even if you think your hot shit, your writing will improve.  Unfortunately, you can't tell who your first year english teacher is until you show up.  All you can do is pray!  so do it.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "January 17, 2005",
            "review_content": "\nDefinetly the coolest, smartest, most intellectually challenging professor of my first semester. This lady knows her shit. If your looking to REALLY LEARN, take her class. \nWorkload:\nShell make you work alright, but if youre really into it will pay off not only in your grade but in your writing for eva.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 29, 2004",
            "review_content": "\nFrances Richard is amazing! Her class is never boring and discussions are always interesting. Her class was one of my favorites and it definitely has enhanced my college experience. She is always available to students through email or conferences. Go to meetings with her even if you don't think you need them. She improved my writing a great deal and is a very fair grader. She only teaches women and culture so if you get her you are very lucky. Fabulous teacher!\nWorkload:\n3 3-5 page papers (you get to turn in a rough draft and have it corrected before u are graded on the final), a final 8-10 page research paper (do the prospectus...it will make ur life sooo much easier), and reading (books are interesting and enjoyable)\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 08, 2004",
            "review_content": "\na brilliant, brilliant lady.  if you're expecting warm and fuzzy, though, this is not the teacher for you.  not mean, and will laugh when something's funny, but mostly shows up to class like a board, so sometimes it's very hard what to expect from her.  her articulation, however, and her ability to guide you to formulater your thoughts into words is phenomenal.  her comments on your rough drafts will definitely help you improve, and she's available for help if you need anything extra.  she has the best way of providing examples and talking about literature so that you know exactly what's going on.\nWorkload:\ntwo papers about 4 pages and a 8-10 page research paper at the end.  allows rough drafts for all of them.  tough, but completely fair grader.\n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "August 23, 2004",
            "review_content": "\nProfessor Richard's eloquence will take your breath away.  Listen, respond, and you will learn more than you would ever expect.  Frances Richard is passionate about words and the architecture of language.  She is an editor, and expects your full devotion to writing (and reading).  She will raise the bar for you as a writer, and help you to reach your goals.  I learned so much about myself as a reader, writer, and talker in this class -- I can hardly believe it.  She edges on good discussion.  She will make you want to read harder.  Amazing woman.  Highly recommended as a professor.\nWorkload:\nshort responses to guest lecturers, 4 2-3 page papers, 10 pageish final paper, expects you to be an attentive and annotative reader (so you can be a good talker in class)\n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "April 04, 2004",
            "review_content": "\nFrankly, Barnard should really tenure this brilliant woman. The very first day I attended seemed a bit intimidating because some of the other students in class seemed to have already read the authors on our syllabus, but Prof. Richard eased my worries. She is extremely approachable and leads great discussions in class, without going off tangent so much like other professors.  If you're interested in taking any English course at Barnard, this is the professor to take it with. \nWorkload:\nModerate. She sometimes changes the syllabus according to the pase of the class.  Two 3-5 p papers and a final reseach paper. You've really got to pull out some great ideas on your papers for an A, but the class is definitely worth it. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 20, 2003",
            "review_content": "\nFrances Richard is the most ridiculously awful teacher in the English Department.  The first couple of classes you will be amazed at how pretentious and rude she is, then you'll just learn to tune her out.  Outside meetings involve her showing up late, giving you a couple of sentences of critique, advising you to read the Illiad (no matter what) and then leaving early.  It's a shame because the syllabus is really good, but her presence is grating.  Avoid at all costs.\nWorkload:\nNo matter what you do, she uses her own grading system to determine what your grade should be... a lot of papers and reactions to lectures, but nothing that you write will be reflected in your grade.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 07, 2003",
            "review_content": "\nProfessor Richard (who I don't even think is a tenured professor, which is ridiculous) is the kind of English teacher I have always wanted to have. First of all, she is quite obviously brilliant, and just published a book of her poetry. Secondly, the class was almost always lively, because she was fantastic at facilitating and never letting the conversation go dead and get awkward. \nShe rephrases what students are trying to say into something that really makes sense and, although not big on comments on papers, will always see a student who has a question or wants to discuss an assignment. \nI love her! I'm just upset she's not teaching more classes for me to take next semester.\nWorkload:\nTwo 4-6 page papers, a 10 page research paper, responses to outside lecturers, 6 books and some outside essays.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 19, 2003",
            "review_content": "\nAloof, sometimes cold, and absolutely brilliant. If she doesn't have tenure in 5-7 years, Barnard is losing out. Remarkably astute comments on papers; is able to pinpoint the exact weakness in a thesis and always has constructive criticisms. Seems to know unending amounts about the historical, social, political, and economic situations which impacted upon the literature, and knows exactly how to synthesize all of these different factors and then to relate them to the literature. Always poised and in control of the discussion, but makes sure to focus during first 15 minutes of class on eliciting reactions to the literature. But she's not for those who rely on a gregarious, Mother Earth-esque English teacher. She isn't very personable, which even her incredible fluency and knowledge can't always alleviate.\nWorkload:\n3 5-6 page papers over the semester. Final paper 8-10 pages. Most annoying: reaction papers EVERY SINGLE guest speaker required by the next class, but she's fairly flexible about handing them in.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "April 22, 2003",
            "review_content": "\n   i actually had Frances last year, but she's so awesome that i think she deserves my review. She is quite amazing. the degree of her erudition is almost unbelievable, especially given how young she seems. i loved listening to her talk; she seems so well-versed across disciplines, and can explain anything. she's one of the most brilliant professors i've ever had, and technically she isn't even a professor yet. she is very attuned to each student's strengths and weaknesses, and she won't prod anyone into participation. her comments on papers are always right-on--she knows just what to look for. she can really help you understand writing and reading as participatory and dynamic. really, i swear. i hope she gets an awesome professorship, because she deserves it more than anyone. \nWorkload:\ntypical workload for first-year english. ten books, 2 papers, metatext. pretty light\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "November 21, 2002",
            "review_content": "\nA very elegant and flowery woman. She speaks beautifully when she discusses any writing. She's approachable and definetly willing to help. The only thing I didnt like was that she never agreed with my comments since I didnt have strong feminist values, but had no choice in dealing with it.\nWorkload:\nIts heavy, lots of reading, a few papers, and a final paper...\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "May 05, 2002",
            "review_content": "\nI thought she was a really good teacher. Classes dragged sometimes, but she didn't force anyone to participate and gave really helpful, extensive comments on all papers. She took attendence every class, which was annoying, and shes a hard for fair grader. For first year english, not as bad as I expected.\nWorkload:\n3 papers- 2 topical, 4-6 pages, draft and revision, and one longer research paper- 8-10 pages, draft and revision. A couple of books, nothing really hard. definitely manageable\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "April 29, 2002",
            "review_content": "\nProf Richard is one of the best English teachers I have ever had. Take advantage of the private meetings she offers to students. She comes to class prepared- presents historical info- provides good beackgd of the criticism written on the work at hand... but she opens the floor for comments and questions. She is one of the most eloquent persons I have ever encountered. Expect B+s on your first paper (if it's really good) and youll prob work your way up to an A-. She is not an easy teacher, but you def. come out of the course with a solid background of the diff periods in the development of literature and a nice survery of the various works composed within each one. SHE ROCKS.\n"
        },
        {
            "course_name": "First year english",
            "review_date": "April 23, 2002",
            "review_content": "\nProfessor Richard is an amazingly brilliant woman. Hands down, the most intelligent person I have had teach me. She knows her English. When a book from outside of class comes up, she can generally recite a great portion of it. My faith has been restored in good teachers because of this woman. Take her class, she will truly inspire you.\nWorkload:\nNot too bad ... enough reading to keep you busy but not stressed. She is a decently hard grader but it's all worth it.\n"
        }
    ]
}