{
    "prof_info": [
        {
            "prof_name": "Laurence Marie",
            "prof_id": 13657,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Third Year French Conversation",
            "review_date": "April 15, 2021",
            "review_content": "\nRegardless of what course it is, if Laurence Marie is teaching, sign up for her class. She is simply incredible. Professor Marie genuinely cares about her students and works hard to develop activities that suit their interests. She is constantly asking for our feedback and always open to suggestions on how to make class more fun, engaging, and fulfilling for all. Professor Marie can talk about practically anything with eloquence and clarity, explaining the nuances of French culture, literature and current events with an expertise like no other. Despite class being at 8:40 on Zoom, I always looked forward to the lively discussions and dynamic exercises Professor Marie would lead. Her class was the best way to start the day! \nIf you're looking for an energetic, passionate, and attentive French professor with a great sense of humor, Laurence Marie is the one!  \nWorkload:\n3 short oral presentations -- (all super mangeable) ; overall, a rather light workload, as the course is only 2 credits \n"
        },
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "November 12, 2020",
            "review_content": "\nProfessor Laurence Marie is a QUEEN. 10/10 would recommend her to anyone who is interested in building a strong foundation in French grammar, culture and/or literature. I am literally in awe of how incredible she is as a professor. All of her lectures are so engaging and she works really hard to facilitate class participation from everyone. Professor Marie has high expectations and can be demanding, but in a good way. She knows how to get the most out of her students and she encourages them to take intellectual risks. She is extremely understanding when it comes to completing assignments and is always offering to meet with students outside of class to support them in whatever way they may need. Also, she is a relatively generous grader and gives students the opportunity to revise their essays and exams to learn from their grammatical errors and improve their overall grade. I feel extremely lucky to have had the opportunity to take two courses with someone who is so genuinely passionate about French literature and language. I definitely left her class(es) with a renewed appreciation for French and a much improved language skills. \nWorkload:\nVery reasonable--- Your average amount of work for a language class or literature seminar.\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "January 23, 2019",
            "review_content": "\nI highly recommend Laurence Marie. She is energetic and kind but demanding. I felt that my French improved a lot with her, so much so that I went out of my way to take a course with her again. \nWorkload:\nshort compositions (around 2 pages) about 4 times per semester\nvocabulary quizzes every two weeks\nmidterm and final \nweekly workbook exercises (not graded)\n"
        }
    ]
}