{
    "prof_info": [
        {
            "prof_name": "Liana Finck",
            "prof_id": 13817,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Creative Non-Fiction",
            "review_date": "June 20, 2020",
            "review_content": "\nLiana Finck might be a brilliant comic, just not a good communicator or a good professor. Do not take this class if you want to improve your creative writing or gain a mentor/professor. Take this class for the \"celebrity\" value if you want. It's just not worth it.\nWorkload:\nFine, harshly graded for no good reason\n"
        },
        {
            "course_name": "Literary Nonfiction Workshop",
            "review_date": "May 08, 2020",
            "review_content": "\nThey say don't meet your heroes, and this experience was a testament to that. I went into this class thinking it would be a rewarding, challenging experience, however, I didn't enjoy it because Liana Finck isn't a great communicator or facilitator of conversation. She addresses her class while staring at the ground, and this can get dehumanizing after a point and make it extremely difficult to focus. \nHer office hours were scarce, and students had to sign up using the signup sheet on her door (it seems lazy to do this rather than just coordinate times over email). Often, I'd try to schedule office hours, but she would be unavailable, and when the sheet filled up, we would be asked to sign up the following week. In addition, the syllabus mentions that we're only \"allowed\" to come into office hours 3 times a semester, 30 minutes each. For a creative writing class, that seems scarce and insufficient, especially when we're given deeply personal and thoughtful assignments. She wasn't as supportive as I would have expected. \nI thought the class discussion could have been conducted better. Liana kept the format quite vanilla, where we each spoke in turn in a roundtable. This became boring after a while, and after someone suggested a 'popcorn' style of talking, only then did she change it. What really shocked me was how difficult it is to communicate with Liana. She makes herself unavailable and she's a hard grader for unnecessary reasons, and that can discourage students from going into creative writing/journalism and taking the class for a learning/fun experience. \nTLDR:\nPositives:\n-Medium workload\n-Great peers :) I thought they were incredibly warm and down to earth, encouraging, and offered great perspective on creative work. They kept the class alive. \n-Small discussion group, chance to interact and form connections with Barnard students\nNegatives:\n-BIGGEST NEGATIVE: Can only meet her 2 hours/SEMESTER for office hours at a MAXIMUM (decreased opportunity for developing a mentor/student relationship, less feedback, compare it to 2 hours/WEEK for most professors at Barnard/Columbia) \n-Stickler for rules of the English department. Inflexible on assignment formats or activities in class, resistant to new ideas\n-Class discussion might get repetitive, she's not a great facilitator \n-Hard grader (idk why? it's a subjective class/learning experience)\n-Stickler for deadlines\n-I regret taking this class b/c I wasn't able to form a relationship with Liana, and I wish I had taken it with a more open, communicative, experienced, professor.\nThanks for reading! I hope this wasn't too polarising/vitriolic. If you take away anything, let it be that don't take a class for a Professor's name. Make sure it meets your requirements and that you get all you can out of the class. The English department at Barnard is wide, professional, and experienced: try to take classes where you can make mentors out of professors, compared to just taking the class for a grade/name. And also you can find a community in any creative English class at Barnard and I encourage you to cast your net wide. It can be incredibly useful. Good luck!\nWorkload:\nMedium: 1 short response every Monday, 3 peer reviews every Tuesday, 1 ten-page double-spaced creative piece twice in the semester. \nOffice hours: Can only meet her 2 hours/semester for office hours at a MAXIMUM (decreased opportunity for developing a mentor/student relationship, less feedback, compare it to 2 hours/WEEK for most professors at Barnard/Columbia) \nShe's a stickler for deadlines, if ya miss it then kiss that grade goodbye \n"
        },
        {
            "course_name": "Creative Non-Fiction",
            "review_date": "January 21, 2020",
            "review_content": "\nLiana Finck is a wonderful and slightly odd professor. She started off the semester deeply shy and introductions were certainly awkward, but throughout the course fo the semester, as all the students got to know each other, the class grew to be my favorite. Liana (as she asked we call her) was incredibly thorough and thoughtful in her feedback. She was, I felt, very committed to giving honest but very kind feedback. She helped steer the workshop classroom atmosphere from competitive or critical (which workshops can certainly veer towards) to helpful and respectful. I found office hours with her to be some of my favorite conversations from first semester. I learned so much in this course and feel strongly that if you're willing to cringe a little and feel a bit vulnerable, this is an excellent class.\nWorkload:\nWe submitted a one-page free-write every week, read 3 peer pieces for workshop (ranging from 3 to 15 pages each), as well as an assigned story. Each student submitted two drafts that evolved into 2 15-page pieces for the final submission. I found the workload pretty light and looked forward to it every week. \n"
        }
    ]
}