{
    "prof_info": [
        {
            "prof_name": "Andrea Malaguti",
            "prof_id": 970,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Italian Literature I",
            "review_date": "January 06, 2008",
            "review_content": "\nProfessor Malagutti looks like a nice person, but I think he is just pretending. I took his intro to Italian lit class and in my opinion this was the worst class I have taken so far at Columbia. I did well in the class but I was very disappointed about the professor ability to convey ideas and overall knowledge of the material covered. But the worst part was his unfair grading and inability to comprehend ideas other than his own. \nWorkload:\n3 free topic essays, final. The final was very time consuming. Grading not very fair.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2007",
            "review_content": "\nProf Malagutti is a nice man, however the way he conducts his lectures is a little unclear. Overall he seamed to know Italian literature quiet well, however his class did not stimulate critical thinking and he does not seem to like people who are prepared on the subject. His class was a disappointment and I did not learned anything new even thoug I attended every lecture. I wish I had fullfilled my lit requirement with a different professor.\nWorkload:\n3 essays and a final. Not a fair grader.\n"
        },
        {
            "course_name": "Introduction to Italian Literature I",
            "review_date": "December 04, 2007",
            "review_content": "\nThis class is an intrduction to Italian litterature that focuses on early Italian classics. Professor Malagutti overall is a nice man, but a mediocre instructure, an unfair grader, and policimaker. Students in his class missed more lectures than they attended and were even granted extantions on their papers. Someone may find such policies appealing, and that means you want to waist your time and money. Professor Malagutti wants his students to think the way he thinks and often discurages, to the point of ridicule, everyone who says something he does not agree with. On top of that his English is not very clear. \nI strongly discourage anyone from taking his courses, specially if you are an Italian major (I was one). Even though I was very interested in the subject, this class was by far the worst I have ever; it simply discouraged critical thinking. If you need to fullfil a major requirement I would suggest to choose another professor and preferably a more modest department.\nWorkload:\nFair. Three papers and a final. Make sure to write what he wants to read since it is probably all he knows.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 10, 2003",
            "review_content": "\nI enjoyed Andrea's class, despite some setbacks.  Andrea has some wonderful insights into the texts and has a curious and often roundabout way of explaining them.  You will most likely fall behind in the reading -- the pace is more the fault of the core than Andrea -- and Andrea will not attempt to make you catch up. He's a brilliant man and I think sometimes his mind works too fast for his mouth.  But if one is attentive, patient and willing, there is the potential to really learn. \nJust as a warning: He can be self-depricating and a little crazy (he told us that it was ok to laugh at him) and he sometimes leaves the classroom, randomly. \nWorkload:\n4 essays for the term, midterm, final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2003",
            "review_content": "\nAs has been stated before...Malaguti really is a lovable man. He is a wonderful professor, and while he may be weak in one or two of the works in Lit Hum, he completely makes up for it with his extensive knowledge both of the Greek texts and the early European works. His insights into both Montaigne and Dante really opened my eyes. Yes he is excitable and jumpy. Yes he does stutter occasionally. Yes his italian accent is very noticeable. But that makes the class all the more interesting. He definately is a character...and he keeps you awake for the most part. If you show the slightest effort to understand and explore the works in class, he will be thrilled, and he'll make sure that you benefit from it. I couldn't have asked for a better professor. \nWorkload:\n4 Essays per semester - Varied topics...you can even make up your own if he approves. Midterm - straightforward, pretty simple, include as many works in the essay section as possible. Final - standard Lit Hum.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2003",
            "review_content": "\nAs has been stated before...Malaguti really is a lovable man. He is a wonderful professor, and while he may be weak in one or two of the works in Lit Hum, he completely makes up for it with his extensive knowledge both of the Greek texts and the early European works. His insights into both Montaigne and Dante really opened my eyes. Yes he is excitable and jumpy. Yes he does stutter occasionally. Yes his italian accent is very noticeable. But that makes the class all the more interesting. He definately is a character...and he keeps you awake for the most part. If you show the slightest effort to understand and explore the works in class, he will be thrilled, and he'll make sure that you benefit from it. I couldn't have asked for a better professor. \nWorkload:\n4 Essays per semester - Varied topics...you can even make up your own if he approves. Midterm - straightforward, pretty simple, include as many works in the essay section as possible. Final - standard Lit Hum.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 18, 2003",
            "review_content": "\nDespite his weaknesses, Andrea is a wonderful teacher for Lit Hum.  While it seamed as though he had never truly studied the bible, his knowlege of earlier Greek works was very impressive.  He attempted to engage the entire class by asking questions whenever discussion began to lag.  However, partly due to his problems with English, his questions often seemed unclear and at times failed to gain any response from students.  As noted by other reviewers, you can immediately see if Andrea likes your comments by grunting and head shaking (doesn't like your comment) or smiling and nodding (does like your comment).  Grading is comparitively easy - no lower than B's, and he is always willing to spend lots of time going over papers with you and helping you revise.\nWorkload:\nnormal Lit Hum workload - no extra reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 13, 2002",
            "review_content": "\nProfessor Malaguti is an eccentric but loveable man. You can tell whether you're right or completely wrong just by looking at him - enthusiastic head bobbing mens yes, and an impatient/disgusted look means no. He knows when you're trying to BS him, and he can tell if you've read the books. If you do the reading, the class discussions are very stimulating. If you don't read the books, you won't like the lectures. This class is for people who are actually interested in the material, and if you don't like the books, get anther teacher. Malaguti will go out of his way to get the books's meaning across to you, and if you ask him a question he can't answer, he will do his research and have a thorough answer for you by the next session. The main problem is that he really gets into some of the books and the class gets behind schedule, and then you have to do makeup sessions. Still, he's one of the best professors you can have for the second term of Lit Hum. He can teach a class on Dante alone, not to mention Boccaccio and Dostoyevsky. Once again, if you really want to get into the material, take the class. \nWorkload:\n4-5 Essays (you pretty much pick your topic), a midterm, and a final. Grading is very fair. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 06, 2002",
            "review_content": "\nNot an ideal class but not awful. The previous review isn't much more than a mean-spirited personal attack which says more about the reviewer than the professor. Malaguti is an extremely kind man, and he has your best interests at heart. He is very accessible, and will essentially teach you a personal class for however long you want him to if you go to office hours. He wasn't intimately familiar with some of the Greek texts (he was, I think, reading Herodotus & Thucydides for the first time) but he certainly read them closely and knew them. Classes weren't great, though. Malaguti isn't very good at stimulating discussion (he also clearly plays favorites in class), and his own lecturing is often dull and confusing. Class did little for my understanding of the books. This is his first year teaching, so hopefully he'll improve. Until then, try another section.\nWorkload:\nStandard reading + 5 essays (3-4 pgs.), midterm, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 21, 2002",
            "review_content": "\nHe is a crazy Italian guy with a thick  accent. He really cares for the  material he is teaching and he wants  everyone in the class to have some  kind of an appreciation for it. He is a  good guy and a lenient grader. IF you  show that you have read the books  he will give you the benefit of the  doubt on tests.\nWorkload:\n5 essays, midterm and final\n"
        }
    ]
}