{
    "prof_info": [
        {
            "prof_name": "Robert Jervis",
            "prof_id": 620,
            "total_reviews": 32
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to International Politics",
            "review_date": "August 20, 2016",
            "review_content": "\nJervis is obviously smart and can be quippy but this was the worst class I've ever taken. The first day there were 300 people in the lecture and after one hour long period with his lecturing style, only about 10 people were showing up regularly- that is not an exaggeration. I try to go to class but everyone had a shared understanding that you were never going to learn anything in lecture. He is so quiet and just goes on these long tangents without any rhyme or reason and you don't learn really anything. He is such a sweet old man but his strength is not in lecturing. I would NOT recommend this class to anyone.\nWorkload:\nReading quizzes a midterm and a final. There are so many readings each week its mind boggling but basically everyone just combines their notes on a big google doc so you can split the workload at the last minute. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 11, 2016",
            "review_content": "\nJervis has been doing this for 40 years - he's not going to change and no one is going to try to change him. This is academia at its finest: he may be a brilliant academic and expert on international politics, but he is a terrible professor. \nI took this class optimistically, knowing how famous Jervis is in his field and not afraid of a heavy reading load. I attended each class (along with approximately 40 other students in a class of 270), and struggled to sit through every single one. Jervis sits at a table for each lecture and proceeds to talk/ramble for the 75 minutes. Even if you are passionately interested in the topic, the lack of organization and his many real life examples make it nearly impossible to follow. When he writes on the chalkboard it is literally illegible. Though Jervis does hold office hours and occasionally asks questions, he is a poor communicator and did not seem genuinely interested in interacting with students. \nMy TA was fantastic, but ultimately, the lectures and the discussion sections don't matter: your grade boils down to 3 quizzes on hundreds of pages of reading and 4 take-home essays. Even though the topics felt interesting and meaningful, the readings were mostly dry and the lectures drier. \nThis is not a learning environment I would ever choose to be in. Considering how much money we are paying to go this school and the limited time we have here as students, DO NOT TAKE THIS CLASS. I never felt intellectually stimulated or supported. \n\nWorkload:\n- 2 short take-home midterms: each counting for 1/5 of the course grade\n- 3 quizzes on the readings: 1/5 of the grade\n- A take-home final exam (2 essays): 2/5 of the grade\n- Approx. 200+ pages of reading a week\n\n"
        },
        {
            "course_name": "International Politics Seminar: The Cold War",
            "review_date": "September 02, 2015",
            "review_content": "\nWeekly meetings. Apparently attendance is not mandatory. Focus all of your time on the research paper, don't bother with the assigned readings. \nWorkload:\nOne 40-page research paper.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 08, 2015",
            "review_content": "\nFirst and foremost, Jervis is not a bad lecturer at all. People tend to criticize him for the simple reason that he is relatively old and thus quite slow and for the fact that it is hard to hear what he says (it's the microphone's fault - not his). Jervis is an incredibly knowledgeable man who has remarkable experience in the field of international politics. He always started his lectures with approximately a half hour about current affairs which very often related to the content of the course itself. Lectures were not organized, but very interesting. He presents a solid foundation in international relations theories and a clear presentation of relevant historical facts. Most students choose to not come to lecture - I think attendance isn't mandatory for full understanding of the course. The main points to take away come from the readings, which are very very exhaustive but usually interesting. \nThis was my first class in the Political Science department and was exactly what I had expected. Content is great, lecturer is brilliant, workload is challenging and grading isn't easy. But the class really is worth taking.\nI also attended Renanah Miles' discussion section every week. She is a great TA with remarkable experience and really knows how to clarify all the concepts seen during lecture. \nWorkload:\nVery heavy weekly readings that are necessary for the understanding of the class\nThree quizzes on the readings (non-cumulative)\nTwo take home midterm essays (1200 words each, one week to write them)\nTake home final essay (2 questions, 1200 words each, 10 days to write it)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 30, 2011",
            "review_content": "\nOn the whole a pretty decent class, which does what it's supposed to do - provide a solid foundation in International Relations theories and understanding of significant historical events. The other reviewers definitely have it right in their criticism of Jervis' lecturing, so there's really no need to rehash the flaws in his teaching. Needless to say, Jervis is an absolutely brilliant academic - just reading his work on the spiral model and the security dilemma is testament to that (in particular the Perception and Misperception in International Politics readings), though his teaching doesn't always reflect that. As one of my friends in the class humorously put it, she sometimes wanted to jump on the stage in the middle of his lectures, shake him vigorously, and scream at him for his abrupt transitioning from topic to topic. Also he basically spent the first 20 minutes to half an hour of every class updating us on current events and giving us his opinion on it (which this semester was essentially a rundown of what was happening in Egypt and Libya for every single lesson), so a lot of people in class would usually just come half an hour late. The greatest shame was that the last lecture of the semester took place the day after news broke of Osama bin Laden's death, but he had gone overseas and couldn't give us his opinion on it. \nCrazy amount of readings, as many have mentioned. One week we had a reading assignment that was 300 pages, in just one of the readings alone. You don't have to do all of it to do well, because there is so much of it, just enough to do the in-class reading quizzes. One reading was particularly bizarre - it compared the game of soccer to the pitfalls of globalization. If you're lucky in your selective reading, you would also have done all the most essential readings that would enable you to do well on the take-home papers. Usually if you can pinpoint which readings are most crucial to the point of the essay questions, you can pretty much do well if you incorporate your points convincingly. Side note: I really enjoyed one reading towards the end of class, The Soft Underbelly of American Primacy by Richard K. Betts (another professor at Columbia). \nHaving shopped around for TAs, I would say Mira is easily the best TA. I think having a good TA, and attending discussion section regularly is important in a class like this, with all the reading there is to handle, because it really helps focus your attention on the most crucial readings. Mira did all this and more, and she's also really knowledgeable in the field of IR, particularly nuclear weapons and deterrence. Take her if you can. \nOn the whole, a class worth taking if you don't expect much (or anything at all) to come out of attending lectures, but you'll certainly learn a lot anyway from the very interesting readings and by doing the essays. \nWorkload:\nMountain of reading, which you should do strategically in order to write the midterm and final papers. 3 in-class quizzes (worth 20% in total), two take-home midterms (worth 20% each), one final comprising two papers (worth 40% in total).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 22, 2011",
            "review_content": "\nThe reviews that explain the contrast between Jervis' brilliance and lack of lecture ability have it exactly right. If you don't understand how this is possible, come to the first couple of classes and see for yourself. Jervis is extremely smart, there's no doubt about it. But, his lectures can put even the most caffeinated student to sleep. The material itself is interesting, but his voice just has that unmistakable quality that causes students to drift off.\nAs for the grading, the lectures have basically no impact on your grade, and many students skip them. I wouldn't recommend this, because you can still learn so much from just coming to class. One thing is certain: to do well in the class, you MUST DO THE READING. You have to cite it in papers, and need to know it for the reading quizzes. \nLast thing: the below reviews that say the class is curved are wrong. I talked to a TA after everything was graded and my final grade was not curved. \nWorkload:\nNot terrible - 3 in class reading quizzes (do the reading!) (20% in total), 2 1200 word midterms (erratic TA grading) (20% each), 2 1200 word final exams (40% in total)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 11, 2011",
            "review_content": "\nAwesome lectures, even though they don't always relate directly to readings and are often just about important current events....there's not a lot of stuff that is graded, and it's done mostly by the TAs, but I think he takes more into account than just the grades you get on the 7 total assignments (3 quizzes, 4 papers)...all around good teacher, it was sometimes hard when his microphone wasn't working to hear him, but always an interesting lecture....can't write on a chalkboard worth shit.\nWorkload:\na shit load of reading, not all of which is important....he gives a brief overview of everything in each section usually at some point, you just have to pay attention....usually he will talk about certain authors or ideas, or the TAs will, and that's the important stuff.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 18, 2011",
            "review_content": "\nThe below reviews are pretty consistent. About 99% of the things you learn in Intro to IR don't come from Jervis' lectures. They'll come from the extensive amount of out-of-class reading that's assigned and varies in quality from intriguing to mind-numbingly boring. Jervis' lectures are fairly interesting, but incredibly rambling. He's a brilliant and occasionally funny guy, but he usually doesn't express himself in the most captivating manner. He'll often punctuate his teaching points by drawing a chalkboard graph that doesn't really make sense or scribbling a few letters. It's frequently hard to leave a class with more than a paragraph or two of notes. \nThat being said, the class is worth it as a foray into IR. Do the readings!\nWorkload:\n3 in-class quizzes which actually pretty easy if you buckle down and skim over all the readings, 2 take-home midterms, and 1 take-home final. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 23, 2010",
            "review_content": "\nMost reviewers have the man right. Lectures are solid but his quiet tones will lull you to sleep unless you make the concious effort to remain alert. If you do that, you'll get a lot out of lecture and Jervis's dry wit.\nThe course is structured to give an introduction to a wide range of issues in int. pols, beginning with theory, then looking at the history of international relations and finally addressing some pressing current debates.\nDo the reading and you'll be fine on the quizzes and the midterm essays. In the essays, the way to do well is to make a clear thesis statement in the intro and then support it with numerous references to the readings. Present the view of one school (realist/liberal/marxist or whatever) as if it was your own view basically. \nWorkload:\nA lot of reading (all interesting). 2 midterm essays of 1200 words (20% each), 3 in-class quizzes (20% combined, answer 6/9 questions each quiz), take-home final of two 1200 word essays (40%)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 19, 2009",
            "review_content": "\nI remember how I was torn by the contradicting reviews on Professor Jervis two years ago.  Now I understand both.  There is no doubt that  Professor Jervis is a genius.  Read his articles and books!  You will learn so much more within so little time.  He is very amiable.  You can go to his office hours and get his advice on whatever is important to you-choice of class, recommendation of books.  He is very responsive to emails, too.  The only problem of his class is he is not a great lecturer.  Maybe the intro-course is to basic for him.  But I definitely think you should take an advance class with him, seminar if possible.  I am going to.\nWorkload:\ntwo take home midterm, around 1200 words each; one take home final, same as the midterms; three in class exams, each lasting about 15 minutes, as long as you have done the reading you will be fine\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "August 17, 2009",
            "review_content": "\nThere is no doubt that Professor Jervis is a genius, however that does not help you receive a good grade. He specifically tells the TA's to grade the papers very harshly (most people received a B- or B on their first papers). If you are one of the lucky 2 out of 160 students who receives an A, you have no need to worry, but for the rest of us we definitely had to step it up. Also please do all of the readings. The classes are not very helpful at all when it comes to the papers, but the readings are necessary for the quizzes. They may seem small, but they can make or break your grade in the end. Overall a good class if you are willing to work hard and make this class your priority. \nWorkload:\n2 midterm papers, Final paper (includes 2 papers), 3 quizzes (answer 6 out of 9 questions)\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "August 28, 2008",
            "review_content": "\nSlept through many of his lectures, despite copious amounts of coffee taken to counter his odious style of lecturing. Jervis is prone to spend  half the class reviewing what the NYT has in its front page - which is something redundant for most students, I think. Spent the first two lectures talking about varieties of the prisoner's dilemma.\nReading material was at times interesting - i particularly enjoyed a text from Clarke's Against All Enemies, where he talks about pre-9-11 incompetence. \nWorkload:\ncannot stress this enough: READ AND USE HIS BOOK in papers and for quizzes. Not surprisingly, he thinks his book is the more significant than everything else he assigns\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "June 29, 2008",
            "review_content": "\nJervis is a nice old man who tackles really interesting subject matter in really mundane ways. His lectures pretty much entail him pacing a few steps back and forth while sporadically sipping water from a coffee cup, understandably coaxing many/most of his listeners back into sleep. But, if you're paying attention, what he says really is captivating/sometimes funny. He's brilliant, but don't expect him to respond promptly to emails (he is essentially baffled by the modern day obsession with the internet) or really have much to do with the grading. The TAs grade the papers, and harshly so. I'm not sure I heard of very many (or any) A's, but the class is curved at the end so don't stress (really). Overall, definitely worth taking because of the material, so long as you can overcome the desire to catch another hour of shut-eye and actively listen to Jervis' words. \nWorkload:\nBroken down into fifths, all of equal weight: 3 in-class quizzes (answer 6 of 9 very general questions, based on the readings) which count as 1/5, 2 take home midterm papers that are 5 pages each and each count as 1/5, and a final that is compromised of 2 5-pagers that in total counts as 2/5. Quizzes are easy if you've skimmed, papers are VAGUE and harshly graded, but the class gets curved at the end so it should be ok. Lots of reading, but most of its actually interesting.\n"
        },
        {
            "course_name": "International Politics Seminar: The Cold War",
            "review_date": "May 21, 2008",
            "review_content": "\nThis was the first political science seminar that I took and I really enjoyed it.  When I glance over the other reviews of Professor Jervis from Intro to International Politics, I feel as though every once of those reviewers would change his or her mind upon taking a seminar with Jervis.\nIn a small setting, Professor Jervis is a gem.  He's a brilliant mind in political science, and it's truly a gift to have two hours in a small setting with him.  You will learn so much from him--and lots of his anecdotes are very entertaining.  He is also very approachable for office hours and was extremely helpful, offering to go over your paper with you after he graded it.  He will always make time for his students.\nMy only problem with the seminar was that half of the class didn't take it seriously.  I think that many are reluctant to attend a Jervis seminar because of experiences with the intro class.  Intro to International is boring no matter who you have it with, so please don't let that class turn you away from this seminar.  The reading load was quite easy--a book a week which you didn't really have to know by heart.  There were no presentations required of each person on the reading, just a presentation on your research towards the end of the semester.  \nI highly recommend this seminar--you won't regret it!\nWorkload:\nmanageable for a seminar.  30-40 page paper, no draft required. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 19, 2006",
            "review_content": "\nSO MUCH READING. And you have to do most of it because there are reading quizzes.  The TA grading is erratic on the papers.  That said, the reading is usually interesting, and after a while you learn to skim very well.  Also, Jervis is rather funny and puts politics into a very historical context, which is appropriate for how he teaches the material and also helps you learn more about international politics.  Overall, I was satisfied with the class (except for the erratic grading) and felt I learned a decent amount regardless of having taken higher level international politics classes before.\nWorkload:\n2 take home midterms (5 pages), 2 take home final papers (5 pages each).  Papers are managable. Also, 900 page coursepack for the semester in addition to 1 other textbook and another lengthy book.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 17, 2006",
            "review_content": "\nReviews here are generally accurate - the man is brilliant, no question, but the worst lecturer I've had so far at Columbia.  All he really needs is a mic - his organization is pretty decent, but he swallows half of his words.  Naps were too common, and many people cut lecture altogether- a mistake, given how dense most of the reading was.  Take this class if you must, but sit in the front row and bring coffee.  You'll get something out of it if you work, but don't expect a free ride.  \nWorkload:\nThree short but comprehensive reading quizzes (on 350-400 pages each), 2 1200-word take-home midterm essays, a take-home final of 2 1200-word essays.  Optional discussion section (not so helpful).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 09, 2005",
            "review_content": "\nIf you're going to take this class, make sure the rest of your semester is light. The amount of reading is obscene (he made us buy a $73, 900 page coursepack on top of a very dense textbook). There are three reading quizzes so you have to have a pretty good idea of what's in the coursepack and textbook. The lectures are interesting, if you can hear him. He is clearly brilliant, but he has a tendency yo trail off at the end of a sentence, leaving you in the dark.\nThe grading in this class is weird to say the least. The TAs never give above an A- on papers and only a handful get an A- for the class. Most people either get pulled up or down to B/B+ range.  \nWorkload:\nOBSCENE AMOUNT OF READING, two short (1200 words) take home mid-terms; take home final (two 1200 word essay questions), optional weekly discussion sections (go to them: the TAs are generally helpful); three reading quizzes.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "November 08, 2004",
            "review_content": "\nThe one-sentence summary? Jervis is wasted on the first-years. I took Intro to IR as a freshman and fell asleep regularly every week. the TA made the class bearable, and I did pick up what I was supposed to, but I didn't leave with a good impression of Professor Jervis himself. \nTwo years later I took Conflict and Coop with him, and fell in serious academic crush with the man. I'd trot eagerly to class first thing Monday morning (and I'm not a morning person) to sit and hear his amusing expositions on The State Of The World Today / The State Of Today's Headlines. witty AND incisive, they cut through the crap and helped shed valuable light on what was actually taking place. every time I read about a new political development I'd want to hear what Jervis would have to say about it in the next class. The lectures were for the most part just as insightful and interesting (though I'd be lying if I said I didn't doze off even once). Reading was on the heavy side but all good selections. The grading wasn't easy, but I felt like I worked for and earned what I eventually got - and unlike so many classes, I actually took increased knowledge away with me at the end of the semester.\nBottom line: the man deserves his reputation. Definitely consider taking one of his classes if/when you're not a freshman any more, and better able to appreciate what he's saying. A genuine interest in the world around you also helps.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "October 21, 2004",
            "review_content": "\nMiserabely boring professor but interesting reading material otherwise.  Going to class was a major waste of time--just do the reading and you'll be fine.  My TA was great, though, and was helpful with the quizzes and papers.\nWorkload:\nThree four-page papers, three quizzes.  All on very broad topics and graded by TAs.  Not easy, not hard.  \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "June 15, 2003",
            "review_content": "\nI can't quite put my finger on why Jervis' lectures are sometimes painfully boring. When I made the extra effort to stay with him instead of nodding off, I always found him to be insightful, extremely well-informed and even funny. I learned a lot from the lectures that I forced myself to stay awake for, but it seemed to be a constant battle. The good (or bad) thing is that it is not necessary to got to class since we were quized on the readings rather than lectures.    \nWorkload:\nLots of reading, most of which is necessary to do well on the three in-class quizes. 1 paper for each of the two midterms and 2 papers for the final. Rather broad paper topics (which often could not be narrowed) made it difficult not to go over the limit of 1200 words. TAs were hard, but fair. Good training for other Poli. Sci. paper writing. It seemed like the majority of students wound up with Bs, but only a few got As. Still, an A is possible if you do all the readings and cover all angles of each essay topic. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "June 04, 2003",
            "review_content": "\nJervis is a very difficult professor to review...  He has written a lot of important work and is very knowledgable, but this has created a rather sizeable ego that occasionally becomes irritating.  By far the best part of class is the first 30 minutes in which he analyzes current world events and takes student questions...  He constantly provided subtle and enlightening theories about what was happening; some people accuse him of bias against the Bush administration, but I felt that he was good about presenting different sides of each issue(although he does let us know what he thinks so that we can take his bias into account).  In comparison the actual course material, while still interesting, seems abstract and obscure.  This is not necessary, but Jervis's shaggy-dog style of lecturing can make even the most simple ideas seem complex as he embarks on ramble after ramble.  Nonetheless this course completely changed the way i think and debate about international politics and I recommend it to anybody who is willing to invest a little time into understanding world politics beyond simply reading the news.  \nWorkload:\nA huge amount of reading, much of which is not done by most students, but I would STRONGLY encourage people to do all of the reading.  He gives us essays from all different sides of every debate, so that by the end you understand the field as the debate that it is and can enter any political discussion feeling well-prepared.  The 2 midterm essays are strictly graded, I was happy to get an A- in the class, but it is definitely worth it.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 25, 2003",
            "review_content": "\nI know a lot of people complained about his lectures, but I really enjoyed them even though you could technically miss every single one and still do fine in the class since we were tested on the readings rather than the lectures. Jervis usually spent the first thirty minutes talking about current events, complete with his personal takes on different issues. The rest of the lecture had to do with whatever section we were on at the time. Sometimes the lectures seemed really disorganized, but if you do the reading when you are  supposed to do it, it all fits together. Given that Jervis is a giant in the world of political science, it seemed like a waste of a good resource to skip out on his classes, except maybe if it is a particularly nice spring day.  Not only that but Jervis is funny. He has a very dry wit that colors his lectures. Sure he name drops a lot, but given the list of colleagues he has, who wouldn't? And even if it is contrived, he often humbles himself by admitting his mistakes. Overall, I think he is a good bet for IR.\nWorkload:\nLots of reading, but it is manageable if you keep up with it. But given that the in-class quizes are based solely on the reading, it pays to do it. Jervis usually mentions most of the things on the quiz somewhere or other in his lectures, but unless you go to every single class and take really good notes, doing the reading may be a safer bet.  Three in-class quizes that aren't bad because you can choose 6 out of 9 questions to answer. \nFour papers (one for each midterm and two for the final). Graded fairly harshly by TAs. Everyone was convinced that their TA was the hardest grader, but rumor has it that each of the TAs only gave out one or two As per paper because that is what Jervis requested.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 18, 2003",
            "review_content": "\nGenius, perhaps...but I'm still not convinced. Jervis' lectures cover only the tip of the ice berg that is the thousands of pages of readings that he assigns, offering you the John Madden version of IR (master of the obvious style). Jervis is considered by some to be a giant in is field, but I am fairly sure that he was just the first one to write on topics that everyone else takes as common sense. He devotes the first 30+ minutes of each class to a critique of the Bush administration, and not once stop to offer a retraction when Bush actually succeeded where Jervis said he would fail. Jervis constantly references his \"sources in Washington,\" but I am fairly convinced that he is refering to the Times and the Post, as every little gem of insoide info he offered up was generally in the early edition. Most folks know to avoid this prof, there are certainly better instructors for this course. Take someone else, save Jervis in case you want to specialize in Perception or Game Theory.\nWorkload:\nTONS of reading, most of it not the foundational material that should be offered in an intro class (that material is covered by other profs). Four 1200 word papers (\"midterms\" and \"finals\") on the readings, pretty obtuse topics. Three in class quizzes, fairly picky, to make sure you read the mountains of readers.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 06, 2003",
            "review_content": "\nUnfortunate to say, Jervis is wasted on teaching this class.  He obviously is a brilliant guy, top of his field and all the rest (he has the class read his own book!), but many people have trouble getting beyond his sometimes difficult method of conveying information to figure out what he is trying to say.  Regardless, if you make the effort to attend the classes and do the readings, it is possible to learn a hell of a lot from this guy.  Unfortunately, it is sometimes difficult to produce that kind of motivation for an introductory class.  \nWorkload:\nLots of reading, 3 quizzes on reading, 4 1,000 word papers\n"
        },
        {
            "course_name": "Conflict and Cooperation In World Politics",
            "review_date": "April 23, 2003",
            "review_content": "\nOK so I say Jervis is brilliant, but read this about the class\nOk, Fall of 2002 C&C; is 3618, Fall of 2003 it is 4818 - that is telling.\nInteresting subject matter and advisable to take the class then drop it and take it again - then you'll know what to do. Very theory orientated, which is fine, but sometimes the theory becomes ponderous and redundant.  The room we had our class in was dungeonous. Read everything assigned (lots) and then read it again, and be able to expound on it liberally at the 50% of the grade final. It may sound as if I am outright slamming the class, far from it - it is a great subject taught by Columbia's best, but the set-up of it was neither for the timid, nor for the beginner - which honestly was me. My badge is that I did it and survived, would have preferred a fair warning ahead of time though.\nBTW our class had no Discussion Section - a serious loss! and a P/T TA - kinda unfortunate. \nNevertheless, great class.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 13, 2002",
            "review_content": "\nProfessor Jarvis is the single worst professor I've had in my academic career. Good luck trying to stay awake during his lectures; the man is unbelievably boring. If you don't believe me, just look around. You'll find more people asleep than awake. Additonally, it's no surprise that his lectures are completely disorganized.\nWorkload:\nungodly.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 07, 2002",
            "review_content": "\nOkay, so ..be prepared for a a large amount of reading, most of which is not particularly exciting. In addition, do not attend class..it is really not worth it, unfortunately I waited until after Spring Break to make this decision. Lectures are nothing short of sheer boredom. The discussion sections are suffice enough to handle the 3 quizzes. So watch out, there are better professors who teach this course.\nWorkload:\n3 quizzes, and 2 take-home papers, and a final papers\n"
        },
        {
            "course_name": "Conflict and Cooperation In World Politics",
            "review_date": "April 22, 2002",
            "review_content": "\nI learned very little in this class that I didn't learn in the Intro to IR class, most of the readings and lecture just rehashed the major ideas in international relations,with some more profound development. Most of what I learned was through my own research for the final paper (15 pages). At first, I naively attempted to keep up with the ridiculous reading list, but eventually just settled for reading what I thought was interesting. Professor Jervis' insight into the international relations is incisive, brilliant, but a bit cynical (he's a Realist after all)--but he willingly concedes to other ideas and perspectives, as well as to his own faults. He'a a quirky character who has had a major influence in actual foreign policy in the US, and he loves sharing his personal experiences and perspective on current ffairs. He answers all types of questions, and spends the first half of the class going through current events. Although this seemed boring at first, it was refreshing to see how the theoretical side of IR was actually working in the real world. I went to see him at office hours, a bit intimidated, but he was quite welcoming and gave me several ideas for the term paper. One great thing is that its generally a pretty small class (30-40) for an IR class with such a famous professor, and you can participate and actively gain from what he's saying. If not, you'll just listen to the droning up at the front. I recommend taking this class, but you'll only get out of it what you put in. Basically, because of the grading scheme, you'll spend the whole time wondering how the hell you're doing, and where he's going with this thought, and then at the end you'll realize what has sunk through to you. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 31, 2002",
            "review_content": "\nJervis is TERRIBLE. He's completely boring and prefers name-dropping to lecturing. When he does actually lecture, good luck with keeping your eyes open. Forget entirely about addressing the reading. The good thing is that lectures are completely superfluous. If you want to do OK, opt for the TA sessions instead.\nWorkload:\nLots of boring reading, arbitrarily graded papers, reading quizzes, final\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "September 09, 2001",
            "review_content": "\nWhile he isn't a bad lecturer, it would take a significant stretch of the imagination (or outright lies) to call Jervis interesting. He is occasionally funny, but spends most of the lecture without attempting to make the subject matter vaguely enticing. He presents the lecture materials clearly enough, but it's just a rehash of what you were supposed to read. Of course, this means if you DON'T do the reading, you can get away with going to class and paying (some) attention. There are definitely better lecturers out there, but at least he isn't among the worst.\nWorkload:\nTons of reading, mostly dry. 3 Quizzes, 4 Essays (4-5 pages each).\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "September 04, 2001",
            "review_content": "\nJervis is one of my favorite professors. Although many seem not to like his lectures, I enjoy them immensely. He's absolutely brilliant and even a little funny. What i love most about him is his intellectual honesty -- something you don't find often in academia nowadays. He's a realist and a \"yellow-dog\" (his words) Democrat, but he'll acknowledge any fallacies in or exceptions to his arguments. He's very nice and approachable and, again remarkably, HUMBLE, especially considering he's one of the top people in his field.\nWorkload:\nFairly tough. LOTS of reading, although you can get away with not doing some of it. The grading was pretty easy in the intro class but a bit tougher in the Conflict and Cooperation class. The latter also includes a 15-page research paper.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 28, 2001",
            "review_content": "\nJervis has got to be one of the most boring lecturers I've ever been subjected to. In addition, a lot of the reading is dry and seems pretty pointless, his own precious book included. But you sure as hell don't need to do all the reading, and you definitely don't need to attend every lecture. Oh, and yeah, as you might expect, he doesn't go near your papers or your quizzes.... all the grading bitch work is done by the T.A.'s . But that's not necessarily a bad thing, seeing as that they aren't so harsh. And then of course you've got Columbia's unofficial grade inflation policy to pick up any slack you (or they) might have left behind.\nWorkload:\nReading assignments for each class, but you don't really need to do them all. Two 'midterm' papers, one final paper. Quizzes (announced and easy to b.s.) on the readings.\n"
        }
    ]
}