{
    "prof_info": [
        {
            "prof_name": "Joseph Ackley",
            "prof_id": 13035,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Art History I",
            "review_date": "December 08, 2016",
            "review_content": "\nI found this class to be quite challenging and a lot of work. It is pure memorization,. There are three short response papers, a final paper, and two midterms and a final. There are four museum trips outside of the class, twice by yourself and twice with a TA. \nI found it interesting, but as a non-Art-History major quite challenging. \nWorkload:\ntwo midterms and a final. three short papers, and a final paper. Also once a week discussion sections with a reading for each week. \n"
        },
        {
            "course_name": "Introduction to Art History I",
            "review_date": "November 29, 2016",
            "review_content": "\nProfessor Ackley is an extremely warm and kind person and a great lecturer. He definitely knows how and when to joke around, and he's not pretentious or intimidating at all. For me, his lectures went at a good pace, not to fast or slow, and were interesting, detailed, and helped me prepare for his exams. He was very attentive to students needs and always provided as much information as relevant/possible in his lectures and elsewhere. I feel confident in my knowledge of the material covered throughout the course and would recommend him to anyone interested in taking an Art History course. (Also, Prof. Ackley has to be the most polite teacher I have ever had. He always apologized for inconveniences and thanked his students for their patience. )\nWorkload:\nPretty light. There are readings but it's fine if you skim them. There are 3 response papers, a final paper, and 2 midterms & one late term. Personally found his exams very doable, especially once you know the format of them after the first exam. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 15, 2014",
            "review_content": "\nLittle bit worried going into this class. I'm not a very big art person, and a first-year (I think?) teacher made me kinda nervous. That said, it was completely unwarranted. Joseph (Professor Ackley? I never really cleared up what his title was) was a killer teacher. He made art seem really engaging and understandable, and gave really interesting prompts that made you think about the material. The discussion was great in the class, and you could tell that he really had a passion 1) about art and 2) about helping us learn it. He was really great, a sweet, funny instructor who knows his stuff inside and out.\nWorkload:\nReadings, reading responses every other class or so, midterm, final, two papers. About what you'd expect.\n"
        }
    ]
}