{
    "prof_info": [
        {
            "prof_name": "Linda Bartholomai",
            "prof_id": 12897,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "New York Theater",
            "review_date": "May 15, 2015",
            "review_content": "\nLinda Bartholomai's personality is awfully abrasive and aloof. It was really uncomfortable to have her as a facilitator in class discussion in particular conversations about race, class, sexuality and other social identities. Though she particularly said at the beginning of class, I can only accept 30 out of 70 people in the room and I take into consideration diversity.... In class discussions, she was actually quite racist. She presented herself as THE authoritative judgment call on the plays we watched instead of allowing for disagreement in class, saying things like: \"Nooooo I really don't think that was the playwright's intention.\" \"I didn't think the stereotypically gay character was offensive.\"  It all culminated in a conversation about race-specific vs color-blind casting, which became a cringing experience when two black girls in the class were forced to go against the the class and teacher's opinion. Her feedback on papers was minimal and often dismissive. I didn't feel like I was getting better at my theater reviews or more astute at watching theater.  Grades were pretty arbitrary. I never knew why I got a 90 or a 95. In fact I got 90s and 95s on every single play review, 90 on the  midterm and then got an 85 on the final and somehow that became a B+... Her selection of plays was ok though we could have been spared the awful children's theater at the beginning. All that said, she seems like she is just like every other jaded working theater professional who honestly doesn't get paid enough to do this but like wow... \nWorkload:\nWeekly 2 page reviews \n5-6 page midterm\n8-10 page final \n"
        },
        {
            "course_name": "Dramaturgy",
            "review_date": "May 07, 2014",
            "review_content": "\nPerhaps she knew what she was talking about, but she most definitely does not know how to run a classroom. She didn't bother to engage anyone in the class, whether in terms of discussion or by making the material even remotely interesting. I think the majority of the class wondered whether she wanted to be teaching the class at all. None of us understood the purpose of her assignments, especially taking into account that dramaturgy is meant to be a collaborative experience. Instead of encouraging this type of communal learning that would have been more conducive to actually learning about her subject, she simply assigned generic weekly assignments asking random questions about the plays we were reading. Was this supposed to teach us the fundamentals of dramaturgy? We developed a tendency as a class to talk after it was over about the frustratingly lacking clarity of the material and dramaturgical concepts she was supposed to be teaching us. The class had such potential, considering the range of plays on the syllabus, but it turned out to be very disappointing, along with the teacher.\nWorkload:\nWeekly essays in response to the weekly readings that were unfortunately always very ambiguous in terms of what she expected from us and a final 20 page \"casebook\" that served no true purpose considering we never got them back.\n"
        }
    ]
}