{
    "prof_info": [
        {
            "prof_name": "Ryan Pratt",
            "prof_id": 11804,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Music (Music Humanities)",
            "review_date": "April 28, 2021",
            "review_content": "\nMy first time writing a review because I want to say this is by far the best professor you can have. If you lucky enough to be assigned to him, stay with him. Very kind, flexible and understanding professor. Makes sure you know what you are learning and does not have a focus on grade (which to me made the class much more engaging). All students got A and A+'s I believe.\nWorkload:\nVery light,\n"
        },
        {
            "course_name": "Masterpieces of Western Music (Music Humanities)",
            "review_date": "February 11, 2019",
            "review_content": "\nIt seems that he recently lifted the difficulty of his class and started to give a lot of assignments and readings.\nAs some of my friends who already took him highly recommended me to take him, I chose him amongst many options.\nHowever, I definitely regret having chosen him rather than other good options.\nIf you are not deeply interested in Western Music, you will be having a hard time catching up with his fast-paced lecture.\nOf course, Professor Pratt is quite nice and works hard to ensure that the students understood the material. \nHowever, the materials were quite confusing and difficult to comprehend.\n\nWorkload:\naround 100-150 pages reading a week\n3 concert reflections\n2 papers\n1 midterm\n1 final\n"
        },
        {
            "course_name": "Masterpieces of Western Music (Music Humanities)",
            "review_date": "January 13, 2017",
            "review_content": "\nRyan is a sweet guy who is passionate about music. To be honest, I didn't really like him at first. He's soft spoken, somewhat too young, and sounds a little boring. But he quickly grew on me and I really appreciated attending his class! He is a composer and a drummer (weird mix right) and so his perspective on music is really quite interesting. He sometimes throws in his own experience in attending a conservatory and the weird things he learned. Overall, I learned a lot about music from this class and I want to recommend him to everyone who needs to take music hum. Don't stress yourself about music hum. With Ryan, you will learn something for sure and certainly get a good grade.\nWorkload:\nfinal exam that lasts about an hour and is crazy easy. No midterms. A concert report (3-5 pages) that is graded so generously (I don't believe anyone got below an A). Few discussion posts that can be like three sentences each. Only tested on the last half of things covered in class. I missed quite a few classes because of interviews but I ended up with an A+. I'm sure a lot of other people did too. \n"
        }
    ]
}