{
    "prof_info": [
        {
            "prof_name": "Mara Kashper",
            "prof_id": 1373,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar - Love",
            "review_date": "January 10, 2011",
            "review_content": "\nReadings are half selections from a Lit Hum syllabus, half relatively obscure Russian, all enjoyable.\nKashper annoyed a lot of people.  Some reasons are very valid.  She plays favorites big time, is unorganized, doesn't leave the most thoughtful comments on your writing, and unabashedly promotes her own department in a course whose description does not suggest so.\nYou will be doing a lot of things off campus and on your own time that are only tangentially related to the curriculum.  Relax and have a good attitude.  \nThe way to be successful in this class is to write and discuss ideas with which Kashper would agree.  A lot of students seemed to have an issue with that, but it is a perfectly valid way of running a course, and it is a valuable exercise to express arguments you don't believe.  Don't take yourself so seriously.  \nI promise you're learning.  Your writing isn't improving, your worldview isn't dramatically shifting, but you're learning.\nAnd incoming first-years concerned about the in-residence requirement limiting the number of people they meet, let me just say that you will meet SO MANY PEOPLE your first semester of college.  In-rez helps you establish some sort of bond with a few of them.\nWorkload:\n8 novels/novellas/plays, plus a few relatively short passages she prints out for you, about which she will have you prepare and e-mail thoughtful discussion questions (does not always require totally reading the assignment).  Two 4-page papers, for which you submit an ungraded rough draft.  She'll basically tell you exactly what to do to get a good grade.  So, very very light until the end when she has you make a 12-15 minute film in a group of about 4.  This is right before finals, and takes forever to do well.\n"
        },
        {
            "course_name": "4th Year Russian",
            "review_date": "December 11, 2010",
            "review_content": "\nI would say 'I recommend this class and Mara to lovers of Russian', but the fact of the matter is: you haven't really got a choice. If you make it to 4th year Russian, Mara WILL be your teacher. She's the only one.\nAnd she's brilliant. You should be glad you get her as a teacher. She's interesting, passionate, and with a wealth of knowledge and experience to which you can have essentially unrestricted access, if you approach her. And she is oh so approachable. Really, she's extremely friendly, both inside and outside of the classroom.\nThat being said, all the reviews which say that this class is A LOT of work are absolutely true. The readings can be difficult, class discussion may be a bit overwhelming, the \"socheneniya\" can be demanding. If you're looking for an easy 4 credit A, this is not the course for you. It's tough. But it's worth it.\nWorkload:\nThe syllabus is very... disorganized. Essentially, you'll work through the novel Sofia Petrovna (18 chapters) and various related exercises over the course of the semester. Tests every 3 chapters. 6-8 hours of homework a week for this class.\nSort of take home midterm, not a written test. More like a very long composition in response to a documentary.\nOral final + essay as the final exam.\n"
        },
        {
            "course_name": "First Year Seminar - Love",
            "review_date": "November 19, 2009",
            "review_content": "\nProfessor Kashper Is not only a very approachable and intellectual professor she is also a great person. I looked forward to her class every week. She is incredibly passionate especially about Russian  literature. although she sometimes can seemed biased, her opinions and discussion topics were always thought provoking and challenging. She always made time for her students and when she was unavailable for office hours she offered hour long sessions at coffee shops and restaurants where she would buy us coffee and discuss not only our work but was excited to discuss every day topics. She was incredibly accessible and encouraged us to talk to her about anything we needed in terms of the class. \nWorkload:\nPretty standard. 1 book every week or two, questions and one page comparisons required,  but incredible text selections that were a joy to read. 3 papers and a movie project (which involved a script writing and filming grade). \n"
        },
        {
            "course_name": "4th Year Russian",
            "review_date": "August 16, 2009",
            "review_content": "\nMara teaches Russian the way it should be taught--\nHours upon hours of hard work backed up by a supporting and understanding professor. Don't be deterred by the workload. Really, it's good for you.\nWorkload:\nPretty rough. Start buying index cards in bulk for all those flashcards.\n"
        },
        {
            "course_name": "4th Year Russian",
            "review_date": "November 01, 2006",
            "review_content": "\nI just want to say that this class is A LOT of work. It makes life a little bit rough. Sometimes I think about what a drag it is that there is so much work. There is so much, really, a lot. so much work.\n"
        },
        {
            "course_name": "20th c. Russian lit",
            "review_date": "June 01, 2005",
            "review_content": "\nThis class is no joke. First, the professor plays favorites and grades based on those preferences, with no mercy including the final grade. Kashper cares little for your opinion because she only teaches what she feels is the most important and crucial point in every piece of literature that you read. The benefit of this class is that you learn alot and you read alot. Moreover, you really have a good overview of how literature developed in Russia durign the 20th century. The downside is writting more than you ever would want and making yourself go crazy for trying to get on Kashper's good side, which does not exist.\nWorkload:\nALOT...a 2-page typed paper every week, including reading week and finals week, 1-3 questions sent to Kashper before each class, midterm, final and a book per class\n"
        },
        {
            "course_name": "4th Year Russian",
            "review_date": "May 16, 2005",
            "review_content": "\nSo... you think you've made it this far, and Russian will be a piece of cake!? WRONG. Kashper makes sure everyone works their ass off for the semester, and although she's easy on the due dates, you'll be up to your ushi in work. I can safely say that this class took up 1/3 of my homework time. Granted, you will learn a lot, but she's the hardest grader in the Slavic department and it will begin to get to you.\nI actually found her to be a delightful lady and I liked her style of getting everyone engaged (don't like the Socratic method? don't take this class). She's approachable and friendly,  and invited us to cultural events outside of class, including an end-of-semester dinner.\nWorkload:\nLOTS. Class meets 3x/week and you'll spend 2 hours or more of homework for each one.\n"
        },
        {
            "course_name": "4th Year Russian",
            "review_date": "May 06, 2005",
            "review_content": "\nThe long and short of it is: this class is a lot of work to no end. Work must be justified, it must lead to progress. A small class that always starts late and always ends late: the professor acts as if hers were the only class in the world. She assigns work according to this standard. There is no concrete syllabus: she makes it up as she goes and revises it even as it's printing, I swear. Flexibility is good, but anarchy is not. \nThe verb book she uses (Muravyova) is old and good, but in this class...you will do the same five exercises over and over because the professor has forgotten whether you did them (aloud) already...and she will pass it off as review that she intended in the first place. \nYou read one text the entire semester - Nedelia kak nedelia (A week like any other). The idea is to learn all the vocab really well...the reality is you are bored out of your mind discussing, three times a week, the reasons why the heroine does not have any time...and how do we know that her husband loves her? The text has no literary value but it suits Prof. Kashper's political agenda. (Topics for the final presentation were such: Children and careers, family relations, abortion: for or against; feminism: for or against. Granted, this class is taught at Barnard...but the biased feminism...an abuse of feminism, I daresay...has no place in the University, especially in a language class. \nI learned about human nature in this class - esp. from the way the other students were cowed by the professor and confessed that they would do anything for her...that she was an ice queen whom time would melt. She never treated me as anything other than an unserious school girl. She could not remember - although there were all of five girls in the class - whether I went to Columbia or Barnard; in fact she fondly generalized about \"we Barnard women\" - God forbid a boy should sign up for this class; he'd lose his mind, except she would probably ironically choose him as her favorite. And she mispronounced my name all the time.\nWorkload:\nVarious and sundry exercises for each class; written and oral preparation. The only good thing about this class was that she assigned a term-long story; the only requirement was you write about a hero of your own choosing/invention, day by day. So, seven chapters over the course of the semester, due every two weeks or so. She allowed revisions. She didn't take well to creativity; she preferred you stick to what you knew instead of taking risks. Not the best way to teach language, I think. She unwittingly uttered the phrase that best summarizes her - when someone translated something in a poetic way, or said something using a less standard, more poetic word order, she said, famously, with her sweet smile, \"Stikhi budut vesnoy\" - The poetry will come in the spring. Meaning, a syllabus in her head dictates that learning occur according to a schedule. The picture of ill-health in education. Avoid this class; study on your own. Read aloud with Russian friends. Go to Middlebury for a summer or two. It'll serve you more, and you will be a happier man. \n"
        },
        {
            "course_name": "20th c. Russian lit",
            "review_date": "March 26, 2005",
            "review_content": "\nBEWARE -- she is outrageously awful! This  woman doesn't have the barest inkling of how to teach a class. Instead of provoking some kind of meaningful discussion about the incredibly interesting books we were reading, she simply turned the class into a war zone where the two or three people with agendas yelled at each other. I learned NOTHING. \nOh, and the grading? So arbitrary, you'd think you were back in L&R.; Do not take this class.\nWorkload:\nPaper every week. Midterm. Final.\n"
        },
        {
            "course_name": "Love",
            "review_date": "September 07, 2004",
            "review_content": "\nProf. Kashper is a wonderful, saintly woman.  I missed four weeks of the semester when I was taking her class, and she was flexible, helpful, and understanding.  She encourages class discussions, she respects student's oppinions, and she rarely ever feeds literary criticism.  As she said near the end of the course, we usually come to the same conclusions as the famous critics if we discuss it enough ourselves, and she allowed us to do so.  She grades incredibly fairly, and allows re-writes.  She's very flexible about due dates if you really have a conflict-- but she doesn't take any BS.  She chooses interesting novels and loves it when you discover Russian Literature for the first time through her class.  She also takes you out to lunch or dinner a lot, and her class included a trip to the Metropolitan Museum and the Metropolitan Opera when I took it.\nWorkload:\nNormal.  3 short papers, the rough draft of which is peer edited and teacher edited without a grade,  second draft is mandatory and you recieve a grade, but you still may re-write it again.  BEWARE THE FINAL PROJECT: It is a group film project that you probably won't have enough time to do.  Don't worry: she'll listen to your concerns and give you a few breaks to make it easier.\n"
        },
        {
            "course_name": "Masterpieces of 19th Century Russian Literature",
            "review_date": "June 28, 2004",
            "review_content": "\n*** AVOID ****  The motto is Â“ItÂ’s not about what you learn, but what you already know,Â” which is obviously good for some, but bad for others. This is a woman who cares absolutely nothing about her students, their effort, or progress.  She will grade solely based on her liking you, and her liking you depends on the following:  (1) You have to have a perfect working knowledge of the Russian grammar, which means, if you are in this country for more than 2 years, you better have been attending a Russian school.   (2) You should have read most of the works on her syllabus prior to taking the class  (3) You must have an in-depth knowledge of the Russian History.\nIf you lack any of these, she will put on a \"sweet lady\" mask, but don't be surprised when at the end of the semester she's Â“not willing to listen to youÂ”.\nOverall she doesnÂ’t have a single opinion of her own.  She generally reads a printout, and asks the students to discuss.\nWorkload:\nYou are expected to be able to read approximately one major novel per week.  She can NEVER finish discussing it because the conversations always trail off.  But do not worry, because she will hold make up classes whenever she feels the class is behind (one of them was held during the reading week).  There is about one 3-page paper per week that is judged solely on your grammar and wit.  These papers outweigh the midterm and the final whose grades she shows for 15 sec and is not willing to discuss.\n"
        },
        {
            "course_name": "First Year Seminar - Love",
            "review_date": "January 30, 2004",
            "review_content": "\nI LOVE this lady! She is so sweet and understanding, and she chose wonderful books for us to read. She was my first English prof here and I couldn't have asked for a better teacher. Though she sometimes had unrealistic expectations of what the class could do, I found her to be extremely engaging and I really enjoyed her class. \nWorkload:\nNormal to easy: 3 papers with rewrites, a final project that was a little unrealistic, but she graded it VERY fairly. Fairly normal amount of reading (about a book a week), but INTERESTING books!\n"
        },
        {
            "course_name": "4th Year Russian, Russian Phonetics and Russian Culture",
            "review_date": "May 06, 2003",
            "review_content": "\nI don't know how anyone could give this woman a negative review!  She is absolutely wonderful.  There's no way to get out of her class without learning a LOT of Russian.  So if you want to actually learn something, what a novel idea, take advantage of any and all of her classes.  She does everything in her power to make her classes interesting and enlightening at the same time.  She is a little intimidating in class but an absolute sweetheart outside of class.  I think she just wants to keep things professional so she can teach you as much as she can.  She RARELY get off the topic.  But don't let this intimidate you!  She is always available outside class to help you for as long as you need help.  And I have to agree with the last review, she is one of the only professors at this school that you just want to hug after the class is over!!  \nWorkload:\nPretty intensive but all very helpful.  For all of you who survived the first three years of Russian at Columbia, the days of the endless worksheets and work book exercises are over!  You will have to write a lot, but it won't be as tedious.\n"
        },
        {
            "course_name": "Russian Theater Hands-on; Russian Culture in NYC",
            "review_date": "April 30, 2003",
            "review_content": "\nShe is NOT an easy professor. The classes I took required fluency in Russian, which I don't have, and she is a drill sergeant when it comes to pronounciation and grammar. BUT. . . she is warm, sweet, funny, generous and understanding, and you know what - my Russian improved immeasurably after some time with her. Plus, she is always ready to give praise when you deserve it. One of the rare professors whom you just want to hug after the class ends. \nWorkload:\nIn Hands-on Theater, you just have to be able to read Russian well-enough to perform in a play; Russian-Culture - frequent writing assignments (in Russian) and some really fun field trips, plus in-class presentations (all in Russian) and she expects plenty of participation - if you're quiet, she WILL call on you. \n"
        },
        {
            "course_name": "Russian Theater Hands-on; Russian Culture in NYC",
            "review_date": "April 30, 2003",
            "review_content": "\nShe is NOT an easy professor. The classes I took required fluency in Russian, which I don't have, and she is a drill sergeant when it comes to pronounciation and grammar. BUT. . . she is warm, sweet, funny, generous and understanding, and you know what - my Russian improved immeasurably after some time with her. Plus, she is always ready to give praise when you deserve it. One of the rare professors whom you just want to hug after the class ends. \nWorkload:\nIn Hands-on Theater, you just have to be able to read Russian well-enough to perform in a play; Russian-Culture - frequent writing assignments (in Russian) and some really fun field trips, plus in-class presentations (all in Russian) and she expects plenty of participation - if you're quiet, she WILL call on you. \n"
        }
    ]
}