{
    "prof_info": [
        {
            "prof_name": "Harold Sultan",
            "prof_id": 9784,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "November 19, 2011",
            "review_content": "\nThis course and this teacher were both fine. I almost never know whats going on during math lectures and this course was no different but that has nothing to do with Harold. If that sounds like you, this is a good professor. The material is graspable as long as you put in the effort (i.e. tutoring sessions and solid time in the math help room). He is a very generous and understand grader which is HUGE. I highly recommend.\nWorkload:\nnormal. HUGE curve on exams. \n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "June 21, 2011",
            "review_content": "\nI took Professor Sultan for Pre-calc.  He was really good, and he really tried his hardest to help everyone out.  He was so nerdy at times it was adorable!  Although it didn't give me a renewed interest in Math, I think he was super fair.  He gives lots and lots of partial credit.  As long as you can show that you KNOW how to solve it, you will get 90% of the credit.  But you definitely need to study!  He will go over what types of problems will be on the exam and then the rest is up to you.  Most of the HW is on webwork, which can be a blessing and a curse.  If you just dont get it, and you dont seek out an answer then you wont end up getting credit.  But you find out immediately if you got the answer correct, so you can go to sleep at night knowing whether or not you got 100% on the homework or not.  Overall very FAIR and nice!\nWorkload:\nHW once a week 8-15 problems, allowed to miss 1 problem per HW, and allowed to miss 1 HW.  HW worth 15%, Test 1 and Test 2 are 15% and 30% depending on which one you do better on.  The final is worth 40%.  He curves. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 14, 2009",
            "review_content": "\nHarold is really a great guy and will do as much as he can to make sure everyone understands the material.  Before class he'll always have conversations about pretty much everything and you can tell he LOVES math and enjoys teaching it.  The only problem he has is that he is a little awkward but that's not big deal, trust me.  This was the first time he taught Calc II and I'm not sure if he'll do it again in the near future but he covers everything you need to know. For homework he uses Webwork instead of written assignments which helps you a bit since it gives you extra tries to get questions right but a lot of the problems are hard.  Also his tests are generally hard but he curves at the end and the quiz can count or not depending on if it helps or hurts your grade.\nWorkload:\n13 Webwork homeworks.  1 quiz(which is really a midterm) and 1 midterm, both 5 problems each.  1 final that's 10 questions.\n"
        }
    ]
}