{
    "prof_info": [
        {
            "prof_name": "Anibal Pella",
            "prof_id": 1184,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Photo I",
            "review_date": "November 18, 2002",
            "review_content": "\nI took this as a summer course, and found Anibal to be an awful teacher. He is arrogant, callous, close-minded, and opinionated. He knows exactly what he likes, and if he doesn't like your chosen subject matter (which he probably won't), you'll suffer in critiques. Most art teachers focus on form when discussing work. He never really gets there because he's so busy criticizing the things in the photos. Even worse, there's no hint of his attitude until half-way through the class when you get to the first critique! The only good thing is that everyone's work gets blasted, so no one really feels that bad. The critiques also don't give you any idea where to go or what to improve on - he just lists off all the things he doesn't like about the work you've been doing. Keep in mind, too, that photography classes are expensive. He asks that you shoot 2 rolls a week (12 rolls total) and lowers your grade if you don't shoot as much as he'd like. You have to pull 20 'good' prints to turn in as your final portfolio. Paper is expensive, and you go through a lot if you're learning how to use contrast and vary exposure times.\nWorkload:\nProbably standard, but it seems like a lot because you develop a grudging attitude toward the work.\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "August 04, 2002",
            "review_content": "\nDo not take this course over the summer! Six weeks are not enough to develop your photography skills, and you'll die trying to complete the assignments (I spent roughly twenty hours in the darkroom every week). Plus, Professor Pella is a bit of an ass. He HATES \"sweet\" photos (i.e. anything that isn't depressing and vomit-worthy), and he NEVER gives As (just ask him).\nWorkload:\nFor the six-week Summer Session course, you'll spend roughly twenty hours in the darkroom every week. Plus, you'll fork over a lot of moola for the materials (35mm camera, 100+ sheets of non-rc paper, canned air, negative pages, a binder, and a blotter book ~$200-300). The critiques, which require 6-8 good prints, are mildly painful; however, Professor Pella tends to criticize ugly women more than anyone else. Oh yeah, almost forgot - you're supposed to shoot 2-3 rolls/week. Ick.\n"
        }
    ]
}