{
    "prof_info": [
        {
            "prof_name": "George Padilla",
            "prof_id": 1190,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Personal Fitness",
            "review_date": "April 19, 2012",
            "review_content": "\nGeorge deserves every little bit of that golden nugget.  Taking personal fitness has not only given me an excellent ability to exercise, but lots of knowledge on health and fitness that I can take with me.  Throughout the course of the semester, we worked on cardio, weights, core, etc and learned a variety of different ways to exercise the same areas.  George created a specialized \"workout program\" for each student individually based on what they wanted to target in a workout - he also spent some extra time with my friend and me to create a program for us for the summer, also.\nOverall, George went above and beyond my expectations.  He really loves helping each one of his students and is extremely knowledgable.  This class is a great workout and has a lot of variety, I HIGHLY recommend it (or any class with George).\nWorkload:\nYou can miss no more than four classes.\n"
        },
        {
            "course_name": "Weight training (Barnard)",
            "review_date": "December 07, 2010",
            "review_content": "\nGeorge was an amazing teacher.  Not only did he show us how to use all of the equipment in the weight room, but he was constantly showing us new exercises that targeted different parts of the body.  He was very receptive to our ideas and listened to us regarding what we wanted to learn and do.  George helped us individualize our programs and arranged \"strength tests\" which allowed us to see how much stronger we got throughout the semester.  I definitely learned a lot in this class, even though I came into the course having used all of the machines in the weight room. DEFINITELY RECOMMEND THIS COURSE FOR THE PE REQUIREMENT! It is a great way to force yourself to work out!\nWorkload:\nallowed 4 absences\n"
        },
        {
            "course_name": "Self Defense",
            "review_date": "September 11, 2009",
            "review_content": "\nAt first I was a little worried about taking a Self Defense class with a male teacher but OH MY GOD George Padilla is the greatest man alive. This class was awesome, everything we learned was useful and fun and the entire class was enjoyable and productive, he really is one of the best teachers at Barnard regardless of department. He is so understanding and nice, I just can't say enough to recommend this guy and his class. He is amazing!\n"
        },
        {
            "course_name": "Weight training (Barnard)",
            "review_date": "January 11, 2009",
            "review_content": "\nGeorge is the nicest guy. He was totally aware that he was teaching a weights class of 15 girls and catered to what everyone was interested in.  Unlike a previous weights teacher i had, George was super easy going.  He was very supportive of everyone at whatever level they were at. It was a fun class, he let people bring in music and we even took a few walks.\n"
        },
        {
            "course_name": "Self Defense",
            "review_date": "December 10, 2008",
            "review_content": "\nWonderful class!!  I took this class to get my mom off my case about my living in New York, and was super surprised to discover that it was AWESOME!   George is amazingly nice and really approachable. You cam miss up to four classes (not as many as Columbia PE), but if you need to miss more George will work with you to find a way to make up the classes you missed.  I really enjoyed the stick fighting part of the class.  It's so much fun, and you get so much aggression and built up energy out!  Just make sure you get a partner who understands what is going on.  Dress code is also very relaxed.  Most people go wearing jeans, just make sure you have sneakers and you are fine.  One day we watched an episode of Friends! \nIt's really the best option for a PE course, I recommend it to anyone.\nWorkload:\nCome to class; wear gym shoes.  That's it\n"
        },
        {
            "course_name": "Self Defense",
            "review_date": "January 13, 2007",
            "review_content": "\nFun class. Though, the people he brought in to lecture weren't able to keep my attention, George did. He is very knowledgeable and is very approachable (he offers to write up a program for you so you can work out what you want (i.e. get in fit for spring break)). Some people may be put off by the statistics he presents, but that's life--full of violence. I especially liked the fighting with the sticks (if you take the class, i'm sure you will too.) if you take this class, get ready to be (gently) tossed, tripped, kicked (you hold the giant pad, your partner kicks it), etc. \nWorkload:\nlook up sex offenders in your area, that's about it.\n"
        },
        {
            "course_name": "beginning self defense",
            "review_date": "November 03, 2006",
            "review_content": "\nTake his class. He is the gym teacher you always wanted. You can miss up to four classes, you can email him to politely ask him to write a fitness program for you (which exercises you want to do to get those killer abs/legs/etc.), he brings in articles that relate to the lesson and a video to show other martial art training. He isn't bossy. if he sees you're having problems, he'll come over and show you what you should be doing. \nThe class is a lot of touching between the students (so if you're not into that, you should overcome that fear because at the end of every class he has hand sanitizer for you. You can't deprave yourself from learning from this guy just because you don't want to be touched. The class teachs you how to avoid being touched on the street!) He is also very knowledgable about phsycial education (why you're feeling cramps during a particular exercise, etc.). The class is very helpful and fun. He'll ask 'how do you get out of this?' and you can suggest answers. Note: some answers are very surprising. If your class is odd numbered, you might be paired up with him. Relax, he's very nice and often you have to act like the bad guy to him. This may be the only class you can ever do that to a teacher! \nWorkload:\nThere was one assignment--look on a website that listed sex offenders (just punch in your zip code) and report what you find in the class. Really, that's it. \n"
        },
        {
            "course_name": "Intro to Self Defense",
            "review_date": "May 07, 2006",
            "review_content": "\nWOW!... I don't even know where to begin. This guy is truely amazing!!! he is like the sweetest nicest, and coolest teacher around. His class is soooo interesting and fun and he is just a bonus. He get into the real world applications of everything and trust me, they're useful. TAKE THIS CLASS!!!\nWorkload:\nallowed to miss 4 classes\n"
        },
        {
            "course_name": "Intro to Self Defense",
            "review_date": "December 14, 2005",
            "review_content": "\nHe's an amazing self defense teacher and knows what he's talking about. You learn at lot more than kicking and punching in this class; you learn about subway safety, campus safety and become more confidant as you walk the streets of NYC.\nWorkload:\nYou can only miss four classes.\n"
        },
        {
            "course_name": "beginning self defense",
            "review_date": "February 22, 2003",
            "review_content": "\nGeorge Padilla is an awesome teacher! The class was so much fun and useful. He is always entertaining, never boring. You should definitely take this class, you will not regret it!\nWorkload:\nSo easy.\n"
        },
        {
            "course_name": "beginning self defense",
            "review_date": "August 15, 2002",
            "review_content": "\npretty easy going guy. brings in current articles to make the class more down to earth and reality based. keeps it interesting. fun class...\nWorkload:\num. its gym !\n"
        }
    ]
}