{
    "prof_info": [
        {
            "prof_name": "Savannah Cooper-Ramsey",
            "prof_id": 9724,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 31, 2012",
            "review_content": "\nSavannah is the best!!! She alwas came to class super excited to be teaching us and super motivated. She makes the class fun and you learn tons. Savannah is definitely the best teacher so far in my time in the school. She cares about her students a lot and you can see that she takes student's comments on her teaching very seriously.\nYou'll know so much Italian by the end! Seriously she is the best. \nWorkload:\nThe same as in every Italian class, but sometimes she makes it more fun. You will be ready for the weekly quizzes if you do everything you are supposed to do, which is basically workbook and lab every week\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "August 02, 2011",
            "review_content": "\nHere's the thing you need to know about Savannah: she's absolutely, crazily, out of this world awesome. She makes you actually WANT to come to her class by being super animated, funny, and understanding. Her lessons are always fun and she genuinely cares about her students. If you don't understand something or the class is really not feeling the activity, she's willing to compromise and have extra classes or move on. She's easily accessible and always makes time for office hours and extra review sessions.\nI wasn't a great student last year, but she really helped me see the brighter side of things and I really looked forward to working on Italian assignments because of it. She's actually invested in the well-being and success of her students! By far my favorite class of the year.\nWorkload:\nWeekly quizzes and workbook/lab exercises. A couple of compositions (avg 500 words), but they're all super fun to write and low stress: everything in Savannah's class is! The midterm and final are each structured pretty well--like a super long quiz. One or two oral presentations near the end of the semester. If you pay attention in class you'll be fine.\n"
        }
    ]
}