{
    "prof_info": [
        {
            "prof_name": "Elda Buonanno",
            "prof_id": 2352,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 01, 2005",
            "review_content": "\nIf you are thinking of taking an Italian course, I highly reccommend Elda. Her warm personality makes the class more relaxed and welcoming and she is very approachable if you have questions.She is also a great instructor- she makes the material very clear and she speaks mainly in Italian (although she will intersperse this w/ English if necessary) which really helps you get a feel for the language. Her quizzes and exams are very fair and if you take her evening class, she spends the first half of the class reviewing. She also encourages class participation and by the end of the semester you feel like you know all the people in your class, which isn't often found here. One reccommendation: make a good first impression. She tends to give you the same grade on all your compositions and quizzes so if you do well for the first few weeks, expect a good final grade.\nWorkload:\nFair workload- about 8 quizzes, 1 midterm, 1 final, weekly language lab and workbook exercises, brief oral presentation towards the end of the semester.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 17, 2005",
            "review_content": "\nElda was a wonderful professor. She was always full of life and enthusiastic about teaching our class. By the end of the year, the class felt like a family. Elda was always willing to go back and review for quizzes and did a great job teaching the grammar portions of the class.  If you can take her night class, it was a really great experience. It was an extremely relaxed and very welcoming experience. I highly recommend this class. She is a really fun teacher and her tests are not hard. The midterm and the final were very fair. She makes herself available for questions after class.\nWorkload:\nStandard intro language workload. Weekly lang lab. 8 Quizzes ,1 midyear, 1 final, several writing assignments throughout the semester.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 29, 2004",
            "review_content": "\nGreat teacher, class very straightforward, do the homework, do the language labs, study for each quiz and you will be fine. Attending class is mandatory but she is so nice I felt bad if I missed a class.  If you are doing well on the quizzes, the midterms are direct review, and if you did well all semester, the final won't have any surprises.\nWorkload:\nSeven quizzes, a midterm, a final.  A language lab and two homework assignments per week.  Necessary to have the book and two workbooks.  Dictionary helps also. \n"
        }
    ]
}