{
    "prof_info": [
        {
            "prof_name": "Isabel Lerer",
            "prof_id": 11068,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Philosophy of History",
            "review_date": "December 15, 2010",
            "review_content": "\nI was a little concerned after I read some reviews on CULPA, and found that Lydia was a professor who did not tolerate BS at 9am in the morning, but I am pleased to say that I absolutely loved this class! The professor's lecture style is a bit scatterbrained, but she always provided the class with an outline on the board and always explained all concepts fully. The material is very challenging, and it's often supposed to be (this is a philosophy class after all!), but Lydia is able to effectively emphasize the general ideas of the readings without oversimplifying them. Still, you're going to have to do the readings on your own and grapple with them for some time if you want to truly understand them. Curiously, the professor announced in the first class that she did not want to have office hours with any underclassmen or juniors, only seniors. All non-seniors were directed to the TA, Isabel Lerer. Isabel was a great TA, obviously very knowledgeable regarding all of the material, and she really took an interest in the students that went to her for assistance with papers. She also graded most of the papers, and I found her to be a very fair and easy grader. My biggest complaint with this class is that it was at 9am and attendance was taken at every class and required. Since this class was 4 credits and didn't have a midterm, recitation section, or really anything besides 3 short papers, I guess it's fair that it requires attendance. As long as you can get up in the morning, you won't fall asleep in this class; it's too engaging. But if you can't even get yourself out of bed at 9, you might have to skip this one.\nWorkload:\n3 four-page papers each comparing two texts and answering a general question (like \"What is the philosophy of history?\", \"What is the value of knowing the past?\", etc.) and a final\n"
        }
    ]
}