{
    "prof_info": [
        {
            "prof_name": "Abishek Madduri",
            "prof_id": 10192,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Discrete Mathematics",
            "review_date": "May 04, 2010",
            "review_content": "\nDon't know why the CS department did this, but Abishek was a grad student when he taught this class. First time teaching.\nNot the greatest teacher in my opinion; but for the first time teaching, not the worst. He stated repeatedly that he was limited by the lecture notes, that he was told by the Professor Gross to go straight from his lecture notes. Which he did. He did a decent number of examples, but he didn't do them very well, i.e. skipped a lot of steps. The concepts didn't really stick. If you wanted something clarified, however, he was very good at answering questions.\nThe things he covered in class often carried over to the test, but never to the homework. What the lectures were doing and what the book/homework emphasized were completely different. They didn't have much overlap.\nHe had abnormal ways of going about tests. He experimented with different ways to do review sessions over the web, i.e. TokBox, Google Wave. It was effective enough, I suppose. He answered the questions that people came up with, but it wasn't as easy to understand; it would've been easier if he did it on a chalkboard. Additionally, the way he grades: if you improve from the first test to the second test by at least 15 points, he'll take the higher of the two. But if you had higher on the first than the second, he won't change the scores. If he is your teacher, I would recommend going to class. Looking at the lecture notes tends not to be enough: he'll go into tangents, which he'll end up testing.\nHaven't taken the final, but it seems he plans to curve to either a B+ or an A-.\nHe has a tendency to go a bit too much into his personal life. He's also always telling you good courses to take.\nWorkload:\n6 long problem sets, due about once every three weeks.\n2 midterms, 1st one easier than the second.\n1 final.\nCurved to either a B+ or an A-.\n"
        }
    ]
}