{
    "prof_info": [
        {
            "prof_name": "Aaron Lauda",
            "prof_id": 3017,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "January 12, 2010",
            "review_content": "\nI have to disagree with the people who thought the class was \"ridiculously easy\" or for \"stupid people.\" The class is very diverse with many people that are econ majors or might not be pros at math. That said, I think Lauda is best at communicating the concepts in a way most everybody can understand. He covers the material in the textbook thoroughly and if you can read the book and follow his lectures you should be able to earn at least a B. \nAs a person that was not much of a math person, I think I can safely say this class expanded my knowledge in calculus and made me more of a \"math person.\" Very comprehensive, some of the problem set questions will challenge you and so will probably one question on each midterm and final.\nWorkload:\naround 10 problem sets, one a week, varying in length and difficulty, 2 midterms: first is harder than the second (make sure you understand the mathematical reasoning behind the lessons, there will be one or two problems on both tests that make sure you understand the core of it, and aren't just rote memorizing formulas), one final (surprisingly easier to me than the first midterm, but it is cumulative). \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 27, 2009",
            "review_content": "\nLauda's class was extremely easy and the curve was extremely generous. I have many friends who received A and A+ marks. His problems for the midterms and even final were straight from the textbook and fairly straightforward.\nNevertheless, Calculus III is a difficult subject to make interesting. I attended perhaps 3 lectures all semester and fell asleep during most of them. However, his review sessions before a midterm/final are rather useful, as he outlines pretty much as much of what is going to be on the midterm/final without actually giving out the test ahead of time.\nI would definitely say that Lauda is the best available Calculus III teacher. He really makes an attempt to connect with his students, speaks clear English, and attempts to convey the theory behind the mathematics rather than rote memorization and hand exercises. Unfortunately, Calculus III is not particularly challenging nor intriguing.\nWorkload:\nProblem sets every week with LOADS of problems. As a previous reviewer stated, Cramster Premium makes your life a lot easier for somewhere around $35/year. Lowest problem set score is dropped. Homework comprises 25% of your grade.\nVery reasonable midterms (two of term), and a final. All curved very well. Midterms comprise 20% of your grade each and final is 35%.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 24, 2009",
            "review_content": "\nI disagree with the previous reviewer.  This class was not extremely easy.  I suspect that the class is easy for people who are math wizzes, but so would any calc 3 class.  I don't care about Jacobian Maps - they don't fulfill my science requirement.  \nLauda is a good professor.  Do not worry if you have him.  His lectures are understandable, and he is very approachable after class.  I like his argument that to truly understand calc a student must understand how to derive the concepts himself.  \nI skipped a few lectures will no detriment.  As long as you understand the homework the midterms and final are doable.  \nWorkload:\nWeekly problem set.  10-20 problems\n2 Midterms (Kinda suck because they cap midterm season on both ends. 5-8 problems.  Some of the problems have multiple parts: a,b,c,d,e,f,g...) \nFinal (Same as midterm)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 20, 2009",
            "review_content": "\nThe class is ridiculously boring and easy. \nBasically, he thinks that all of the students in his Calc 3 class are stupid and teaches as if he were teaching stupid people. The first half of the semester was basically review of vectors and complex numbers. \nDon't take this class if you want to learn any of the Calc 3 material; he didn't even teach Jacobian Maps. Basically after the second midterm for 3 weeks, all he taught was 2 sections of the book. (Lagrange Multipliers and Optimization)\nThe tests are extremely easy and reward people who don't make careless mistakes. Basically, you don't need to analyze any of the questions. It basically just memorizing formulas and knowing how to use them. \nWorkload:\nHomework can be done the night before and if you have Cramster premium account, it's even easier. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 03, 2009",
            "review_content": "\nOver the course of the semester, I had the opportunity to listen to many other professors teach the class, including Lipshitz and Greene, and I definitely liked Lauda the best. He clearly explains what the textbook often fails to clarify, and goes through the most relevant examples. If a student doesn't understand, he goes over it again, often trying to use a different way of thinking about the problem. I also find it helpful when he asks us to \"prove\" or \"derive\" the multivariable concepts by analogy to the calc I concepts. It's true that he makes plenty of minor mistakes like addition and subtraction errors or forgetting a negative sign on the board, but it doesn't get in the way of him explaining the concepts. It keeps me on my toes when following his lecture, if anything.\nWould definitely recommend his class because the way he teaches is quite engaging and helpful. Cool guy that is reasonable with grading and takes time to help you fully understand the content. \nWorkload:\nWeekly problem set, collected and graded. Usually not too bad, 10-20 problems. Sometimes he screws up and a problem set takes forever, but generally very manageable homework.\n2 midterms and a final. The midterms were neither easy nor difficult, probably on the easier side.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "October 17, 2009",
            "review_content": "\nGood professor. Goes into more detail than the textbook and does a good job explaining why the material Calculus II (which a lot of people skip) is important and useful. Stresses and does a good job explaining Taylor/Maclaurin series, which actually end up being very important in higher level math (esp. ODE, PDE).\nWorkload:\nStandard weekly problem set.\n2 easy midterms and a final. Decent curve.\nGenerally a sweat-free course.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "July 17, 2009",
            "review_content": "\nLet me start off by saying that I stopped going to class right before the first midterm (there were 2), showed up for review sessions before exams and for the exams themselves, and I did well. I tried out most of the other professors teaching Calculus III in Spring 09 and Lauda was the best, and STILL I could not sit through his lectures. Even though he was going through the material quickly, the pace was incredibly slow. He made a lot of mistakes when teaching, and sometimes would just stand in front of the board and mutter things like \"Now how do you do this again?\" or \"Wait does that look right?\" I'm not saying he was bad at presenting the material. However, Calculus III just happens to be an easier math class in general, so it's not hard to learn, and most of the people in the class were Econ majors or people who skipped Calculus II because it's more difficult. This is not a professor intended for people who seriously like math or any sort of challenge. After taking Calculus II with De Silva (look her up), I was disappointed and was resigned to teaching myself the material rather than go through such a frustrating experience.\nWorkload:\nRidiculously long HW problems sets, of which only a handful were graded. True it was good practice for the exams, but he could've made them suggested problems and then it's your responsibility to do them. The 1st exam was super easy, the 2nd one he threw in a proof he never touched in class (I heard from classmates) and he was, I quote, \"surprised anyone even got it.\" The final exam was 95% material from the last third of the course, even though he said it'd be cumulative, but it was easy enough and he curved well in any case.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "June 26, 2009",
            "review_content": "\nSo I switched into this class based on past reviews and general unsatisfaction after sitting in on a couple of other classes and I have to say I did not end up regretting my decision.\nLauda is clear, concise and very easy to follow. He teaches every thing in a smooth, systematic manner and goes through all the steps involved in getting to his conclusions and makes sure he puts everything down. He is always open to answering questions raised during class or to clarify even dumb queries.\nThat being said, his homework problem sets can sometimes be really, really long as he wants us to get maximum practice (and grades only 5 random problems). His mid-terms were fair but towards the end of the course he started putting 'challenging' questions to show hard working students a chance to show their effort which was quite badly received by most of the class that didn't do well on the second midterm.\nHe eased up a bit on the final but still it wasn't the easiest course you could take. But I would still recommend this class on the fact that his teaching style is a refreshing change from some other math professors here and he genuinely makes every effort to help students understand the concepts behind the material.\nI enjoyed this class and did well overall.\nWorkload:\nWeekly Problem Sets (sometimes he skips some weeks and gives you two-three weeks but then the problem set can have anywhere between 15-35 questions)\nTwo midterms and a final exam\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 22, 2008",
            "review_content": "\nLauda is quite adorable. He makes frequent errors with simple mathematic calculations such as addition, subtraction, multiplication, and division. However, a student is usually quick to correct him on this. His humor is upbeat and oftentimes geeky, which makes the class more like a highschool class in which you feel free yelling out a question without being gawked at. He has a strong understanding of the topics but the lectures flow slowly. Sometimes he will leave gaps in the material and you will need to consult either him or the book outside of class. The Webworks is always several days ahead of the lectures, so in order to complete them you will need to review the text a little bit. \nStudents with previous Calculus experience dominate the class, and beginners tend to be much slower with comprehension. \nWorkload:\nVery fair. An overall easy class. Got an A+.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 22, 2007",
            "review_content": "\nthis man is wonderful, truly wonderful. he makes math bearable and he will make you a better math student. you have to hand in weekly homework assignments. they're not very difficult or intensive, and they help in that you actually have to learn the material instead of just cramming for the final. also, your midterms and final come straight from your homework assignments (literally - he lifts problems from the homework), so it's definitely worth your while to do them. make sure to attend class - the textbook is rather useless and he simplifies concepts in his teaching. all in all, i'd say lauda makes an introductory math class as bearable as possible. \nWorkload:\nweekly homework assignments, easy midterms (there are two), and easy final. he sometimes curves depending on how awfully the class did \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "March 07, 2007",
            "review_content": "\nIt's calc 2, but he manages to make it fun and interesting. His teaching style is a little strange at first, as he writes out every step he does in words as well as math on the board, and he makes a decent amount of mistakes in class. He also gets distracted pretty easily, but he is very knowledgeable and really enjoys math and teaching it. He is a great professor as far as math professors go.\nWorkload:\nLike any other math class, two midterms, a final, and twenty or so problems a week for homework.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "February 11, 2007",
            "review_content": "\nHe was the shiiiizzz.  He made sure everyone had the oppurtunity to get an A.  \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 23, 2007",
            "review_content": "\nWhile Calculus II is really just as hard as everyone says it is, and if you don't have to take it, I wouldn't, Aaron Lauda is the professor to have. He is a genuinely nice guy, and has a perfectly normal accent. The lectures got long and boring sometimes, but if you need help he always willing. \ndo the suggested problems, he takes his midterm and final questions strictly from that pool of questions.\nadvice: make flashcards of the questions, then when you can do a question quickly (because time is short during exams) put it away, and keep working on the remaining problems until you can do them quickly.\nWorkload:\nWeekly problem sets that do take a lot of time.\n2 midterms and a final, all questions taken directly from homework and suggested problems.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 20, 2007",
            "review_content": "\nVery good teacher . . explains everything clearly and even writes every word on the board.  He is a good professor for a student who enjoys a detailed description on the topic at hand.\nVery decent grader, and if you have to take Calc try to get in this class\nWorkload:\nProblem set of about 10 questions each week.Suggested problems as well, not required.Two midterms and a Final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 15, 2007",
            "review_content": "\n Aaron Lauda is an amazing professor. He might not be the most engaging guy on Earth, but he's helpful and cool.\nWorkload:\nWeekly problem sets. 2 midterms and a final. He would tell you 50% of the exam questions and would give you hints about the rest. If you study, there's no way you would not do well. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 15, 2007",
            "review_content": "\nProfessor Lauda made Calc II a breeze.  I agree with previous reviews that at first he seemed a bit scattered but he quickly shped up and his classes turned out to be clear and informative.  Sometimes he gets a little overexcited when the calc we're studying overlaps with physics but his enthusiasm only adds to the lecture and he uis careful not to confuse those who may not particularlybe interested in the physics.  He's mad funny, which makes the class enjoyable, and the exams are straight forward, so as long as you have some grasp on what's taught in the lessons you should be fine.  I reccommend Lauda to anyone planning to take Calc II\nWorkload:\n1 problem set (10 questions) per week, 2 midterms and a final\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 11, 2007",
            "review_content": "\nSeems to be the easiest of Calc II teachers - problem sets and exams very straight forward. Attendance is not necessary for a good grade. Lectures very slow and often boring, but you can tell he's a really smart guy. Non-existant curve, but there's little need. \nWorkload:\nWeekly problem sets (8-10 problems), 2 midterms and final, all exam problems come from homework and lectures.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 08, 2007",
            "review_content": "\nthe final will screw you over. \nWorkload:\nnot too bad\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2007",
            "review_content": "\nlauda is the man. his lectures were very very clear and on both midterms all hte problems were either from the homework, suggested homework problems (not required), or from examples from class. i dont see how it is possible to do poorly in this class as long as you go to class, unless you are completely math inept. \nWorkload:\nweekly problem set, 2 midterms, final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2007",
            "review_content": "\nWhen I walked out of my first lecture with Lauda, I wondered what the heck I had gotten myself into. Lauda is a new professor and had never taught a calc class before, and it showed. He would often make silly mistakes in his lectures and have to erase several lines from the chalkboard. But as the the course continued, he got much more confident and made fewer mistakes, and the class became one of my favorites. Lauda wants people to understand and to like him, and he is sure to go over everything painstakingly until everyone understands. He makes really good notes and is very comfortable addressing questions from the class... so much that it almost seems like high school in its informailty and friendliness. The class is very easy, with no curve, and he is very specific about what he is going to ask on his tests. He also cracks some hysterical nerdy jokes that, surprisingly, make the class very entertaining. Don't hesitate to take Lauda's class, unless you're already really good with Calc II concepts and it seriously bothers you when professors make mistakes. (Otherwise you'll be bored to death as he writes out instructions on EXACTLY how to solve everything, which comes in extremely handy when you're studying.) \nWorkload:\nManageable problem set every week (Lowest grade dropped), 2 midterms, 1 final. Easy easy.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 08, 2007",
            "review_content": "\nProfessor Lauda does a good job going through the Calc II material presented in the textbook.  Every lecture, he presents a topic and works out the example problems from the textbook. He is open to questions and is always willing to put in the extra time. At some times, he can be funny, and as a whole, you cannot do wrong by taking a Calc class with Prof Lauda. \nWorkload:\nUsually 10 problems a week. Two midterms and a final. Every exam question is from the book. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 27, 2006",
            "review_content": "\nProfessor Lauda took a while to get used to, but by the end of the semster I loved him. He gives very easy exams, because he really wants everyone to do well, so there's really no reason for you to get anything less than an A. He will always help you with the homework, which was probably the most difficult part of the course. I was often frustrated, because he wouldn't demonstrate problems that would show up in the homework and sometimes you would have to know little tricks that you couldn't really know, but as long as you work through them, he'll help you. \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 17, 2006",
            "review_content": "\nLauda's a nice guy. If you have calc background, this class will be cake. The problem sets aren't bad at all, and the midterms and final are completely comprised of problems you've done on the problem sets. the lectures can get boring and he takes most of his notes from the book, so since i can read faster than lauda can put notes on the board, it was just more efficient not to go to class. if you have a question about a problem set though, and you ask him about it in class, he'll help you out and put some of it on the board.\ni suggest lauda for calc II.\nWorkload:\nabout 10 problems a week, graded. 2 midterms, 1 final, all problems from homework.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 15, 2006",
            "review_content": "\nVery nice guy.  Knows his stuff.  No accent.  The ocassional spelling mistake.  Reasonable workload. \nQuick and painless math.\nWorkload:\nWeekly set of homework problems. 2 Midterms and a final.  \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 15, 2006",
            "review_content": "\nThe course is pretty straight forward, and Lauda is a pretty good teacher. Most of what he teaches comes straight from the text book, but i attended all the lectures because he simplifies some of the concepts and is good at answering questions. Class can be a bit tough but he's a good teacher. \nWorkload:\nHW to hand in each week (questions from the text book). 2 very straight-forward midterms ( questions come straight from the HW or the suggested HW that is assigned each week)  and 1 final\n\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 15, 2006",
            "review_content": "\nProfessor Lauda is a good lecturer. He goes at a reasonable pace and covers what you need to know. You can get away with getting a good grade even if you don't go to his lecture. After explaining the concept/theorem/formula a couple of examples follow. He tries to be funny at times. Maybe you won't laugh at his jokes but you'll laugh at him for trying. Everything taught at the lecture is right out of the book. But go to his class because he sometimes does homework problems by the end of the class or gives hints on how to do \"hard\" problems.   There is a lot of note taking involved. One of the things that pissed me off at the beginning of the course was the fact that he writes every single step on the board. For example, he writes down \"Today we will use trig identities to integrate...\" or \"we don't have 2x in the integrand, so let's try...\" or \"you might want to...\" Once you get used to it, you don't even notice this anymore. \nOverall, take his class. It's worth it.\n\nWorkload:\nA problem set every week, two midterms and a final. The problems on the midterm are from the suggested problem sets and the homework problem sets.  HW 10%, Midterms 25% each, Final 50%.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 14, 2006",
            "review_content": "\nProf. Lauda is probably one of the best Calc teachers you can find at Columbia, he's American (a rare breed in Columbia's Calc classes), AND teaches remarkably well. His style is a very laid back, easy going approach to each new subject, yet the class doesn't screech to a halt (until one of his numerous jokes bomb, which is entertainment in itself). He explains everything in simple terms and if you put honest effort into the homework and make sure you get all the basics, the midterms and final are a piece of cake (Hint: The problems are all from homework, suggested problems, and class problems). Oh and NO WEBWORKS!!!! (Took the class once before and dropped it due to a terrible terrible teacher, lack of opportunities to switch, and webworks which are a pain in the ass)\nWorkload:\nReasonable Homework once a week (~10 problems) due Wednesday in my class (Tuesday-Thursday)\n2 midterms, 1 final, both easy\nNo Webworks\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 14, 2006",
            "review_content": "\nThis semester was prof. lauda's first teaching job at columbia, but he was still able to teach systematically.  unlike the other sections, lauda's classes never had to use webworks-making life much less annoying when the whole class has the same homework assignment.  he spoke english perfectly (except for when he used words like gnarly and wimpy :)), so he was really clear, as were his lessons.  he's younger, but for lauda that didnt translate as \"i feel like i need to assert my authority to compensate for my closeness in age to you goes so ill fail you.\"  instead, it was like, \"i understand what it is to be in college,\" so if u dont do one homework, ill drop it.  as a teacher, he achieved a good balance between applications and examples, although at the beginning, he would make careless errors, and that was a little annoying.  he's really approachable, and if you have problems with the homework, hes so willing to help.  take him if you can - unfortunately for everyone taking calc ii next sem., he's not teaching it.\nWorkload:\nTotally fair! he would not put a problem on a test unless he had already given it as a homework problem.  weekly problem sets - if u dont get it, ask him or his ta's for a hint, or just buy the answer book - all his problems are from the book.  two midterms, a final, a curve depending on the class's performance.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 13, 2006",
            "review_content": "\nPretty intelligent, but makes lots of little mistakes in class. The midterms and the final come straight from homework problems and extra exercise problems that he assigns. I got an A- on his exam without going to class, and by just studying the assigned problems. Another reason I didn't have to go to class was that he teaches straight out of the book. It almost seems like he's reading out of it, because he says the same things as is written in the book and uses the exact same examples. Take him if you want an easy A, but not if you really want to learn Calculus in depth.\nWorkload:\nreasonable. one pset a week with around 8 problems\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 09, 2006",
            "review_content": "\nProfessor Lauda is a young new professor. He's really amazing, very organized, and really wants you to understand all the material. In addition, he's really fun and quirky, making the normal 75 minute class a little more bearable.\nWorkload:\nWorkload is manageable, with 10 questions from the textbook due every week or so. Midterms are 6 questions each, take DIRECTLY from the homework and suggested homework problems. If you go to class, this is a guaranteed A.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 09, 2006",
            "review_content": "\nProfessor Lauda is an incredible teacher, and is definitely the best math professor I've had at Columbia so far.  He has a great sense of humor, and explains how the material being taught can be applicable to real life.  Additionaly, his exams are not very difficult, and almost everyone does well.\nWorkload:\nA weekly problem set of about 8 to 10 problems, 2 midterms, and 1 final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 08, 2006",
            "review_content": "\nAaron Lauda is one of the sweetest teachers ever!  He has a great personality and is always happy, and best of all he genuinely cares about his students.  His lectures go at a moderate pace, but he is always willing to stop to answer questions.  Just be prepared he does make a few mistakes each class.  Other than that his exams are fair and as long as you do the homework you will be okay.  I definitely recommend you get him if you can!\nWorkload:\nOne problem set a week with about 8 to 10 questions.  Very fair.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 01, 2006",
            "review_content": "\nHe is the greatest professor ever, and his midterms are taken directly from the homework and the suggested problems.  He also does a great job of relating the material he's teaching to real life.  And he has a great sense of humor.  He's the greatest math professor I've had at Columbia so far.\nWorkload:\nWeekly problem sets, about 8-10 problems; not too bad\n"
        }
    ]
}