{
    "prof_info": [
        {
            "prof_name": "Maria Lozano",
            "prof_id": 6620,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Immigration",
            "review_date": "September 03, 2015",
            "review_content": "\nProfessor Lozano is extremely sweet and friendly. The class definitely helped me learn a lot of new things about immigration, even if the readings we did were terribly boring (she did talk about changing the reading material for the next semester, so it might be different now, but the textbook that we used was extremely dry), and I'm pretty sure many people didn't do the readings anyway. I wouldn't suggest not reading, because I think she noticed people slacking off at the end of the semester, and she would ask more specific questions, but she never really grilled anyone, if that's what you're worried about. \nParticipation definitely helps, and she's very open to new/different opinions. Immigration is a very sensitive topic, but she's always asking for someone to offer a perspective that might be different from her own. Our particular class never really had super-vibrant discussions, and we all played it pretty safe with what we said. It's not a tough class if you do the basics. \nWorkload:\nBiweekly compositions that I think were graded based on completion more than anything else, readings for every class, a final project involving a recorded interview with an immigrant and a paper on the immigrant's experiences and your analysis of it, presentation on a Latin American country or Spain and its immigration history\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "May 12, 2013",
            "review_content": "\nAfter reading some of the reviews for other Elementary Spanish professors, I realized that this needed to be written - Maria deserves silver or gold, hands down. She is extremely personable, understanding, and helpful. She keeps the class on pace, constantly engaging with students or having the students practice various skills with each other. There is no down time or \"busy work\" in this class. \nThe Spanish curriculum relies heavily on the \"Gente\" book and materials, so you end up working out of it every class - it is ridiculously expensive, but you use it through Intermediate. Maria set a balance between classroom exercises and book work that was perfect. She ruined me to other Spanish professors - after a few weeks in Elementary Spanish II with a subsequent, sub-par professor, I realized how bad a Spanish class could be when you work directly out of the book.\n\nWorkload:\nHomework for most classes, which consists of a number of online exercises. Two or three \"essays\", which she fastidiously corrects and allows students to re-submit after integrating her corrections. Mid-Term and Final. One cultural awareness-type project (take pictures of Spanish in NYC).\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 03, 2013",
            "review_content": "\nThis is one of the best classes I have ever taken.  Maria is an absolute GEM and I was so surprised she didn't have stellar reviews already.  She's very clear and easy to understand, she makes all of her expectations very clear, and she always stays on task (even if she tangents about her 5 year old son, she always manages to stay on topic).  She speaks at just the right pace, she's always very helpful, and she's very understanding about issues as well.  She's an amazing teacher, and you can be totally honest with her.\nI beg of you, take a class with her, she's wonderful.\n(also we had dinner at her adorable apartment at the end of the semester, and it was the cutest and she made us flan even though she didn't have to she's actually the best)\nWorkload:\nseemingly very little.  well spaced out homework assignments, maybe a couple pages for each class.  sometimes we had an online blog, which was super easy.  3 compositions, midterm, final project and final.\n"
        }
    ]
}