{
    "prof_info": [
        {
            "prof_name": "Ron Miller",
            "prof_id": 491,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 22, 2016",
            "review_content": "\nRon is a nice guy and he clearly knows what he's teaching; but for the class, Ron Miller's course is a pain in the butt. \nThe class seemed okay at first, but the midterm was absolutely horrific. Miller claims that he tends to put one \"really difficult\" question on exams to distinguish between really good students ..and the rest of us. Unfortunately, this question goes miles out of the boundary of what we learned, making it impossiblé to get a good grade.\nIf you HAVE to take this class, then take it and be ready to devote yourself to Mankiw's writing. If you have a choice and want an actually enjoyable experience, RETREAT.\n\nWorkload:\nHonestly not that much is assigned, but plan on spending your life learning the textbook.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 22, 2016",
            "review_content": "\nAfter reading the Culpa Reviews I came into the class with slightly negative bias and what people were saying was mostly true. \n1) There is no question that Ron Miller is a very nice guy who is also insanely intelligent and knows A LOT! \n2) NEVERTHELESS \n3) Class was not very engaging most people didn't come to lectures\n4) THE MIDTERM AND THE FINAL WERE SOOOOO HARD.. No matter how much you study nothing can prepare you for the difficulty of his exams\n5) The quizzes are not too hard \n6) The problem sets are very hard but it's easy to get a good score on them.\nOverall this course is poisonous for the GPA and you could probably learn more in another class, yet Ron Miller is a very very smart guy. \n\nWorkload:\n6 problem sets \n2 quizes \nmidterm \nfinal (cumulative) \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 21, 2016",
            "review_content": "\nAbsolutely the worst...If you have to take this course for your requirement, take it with ANYONE ELSE BUT HIM. He is ineffective in every single sense. He is unclear about the material. His lectures are straight out of the textbook, and somehow they are even more boring that just reading the book. His exams are tough and he does not adequately prepare you for them...he assigns very few problem sets and 0 additional practice problems. I felt so bad for the TAs for this course. He told us on the first day of class that he doesn't reply to email, so don't email him, and then didnt provide any other way to communicate with him...He tells us to be responsible for all the material in the book, which is pages upon pages of minutiae, any of which could come up on the exam. When there were finally practice problems provided for the final (less than a week before), they were either extremely hard or too easy. No one knew what to expect. He doesn't even cover everything that we should be \"responsible for\" in the lectures. He is unresponsive, boring, and an awful teacher. To reiterate what I said before, as have other reviewers: avoid this man at ALL costs. \nWorkload:\nfew problem sets, 2 quizzes, midterm and final that were just crazy. You have to spend hours pouring over the textbook and discussing things that are confusing (which with Prof Miller, is e v e r y t h i n g). Recitations are helpful because at least the poor TAs try to teach us. Lecture is useless, you'd be better off not running your day with an hour of this man. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "November 15, 2016",
            "review_content": "\nNever take his class. \nWorst class ever in my life\nWorkload:\nJust dont take\n"
        },
        {
            "course_name": "Global Economy",
            "review_date": "April 20, 2016",
            "review_content": "\nDo not take Professor Miller's class. Worst professor I've had at Columbia.\n1. Syllabus\nThe syllabus for this class was basically useless. His outline for the course showed how much effort he put into in organizing the course; it was just a list of the chapters from the textbook that you had to read, without any clear distinction as to which chapters will be covered in which lectures. It was no different from the textbook's table of contents. It didn't have any dates, and towards the end, he didn't even bother listing the page numbers you had to read for the chapters. It simply said \"TBD.\" He only updated the class on the syllabus when people asked and made requests on Piazza by saying read the rest of the textbook. \n2. Lectures + PPT slides\nAfter the first couple lectures, I felt like the ppt slides for the lectures were made literally the night before. The PPT slides had SO MANY ERRORS - typos and incorrect explanations of economic models. A TA had to point out that Prof Miller's slides were wrong during a review session, and before quizzes, people flooded Piazza asking for clarifications on the slides. \nThe lectures and slides also did not cover all that was in the readings, which was frustrating because you didn't know what to focus on for quizzes and exams. Also, I felt like he put in a lot unnecessary information - stuff that wasn't even in the textbook, didn't need to know for the class, but was just there, because it was something that he knew and we didn't. Completely useless. \n2. Quizzes and Exams \nAgain, his quizzes and exams were poorly written just as his syllabus and ppt slides were. And it was pretty clear that he wrote the tests at the last minute before the announced exam dates , because every time he announced there will be a quiz next week, he gave the most vague answers as to what the format of the quiz is going to be and what the quiz will cover. Although the tests were not that difficult and straightforward, it was so frustrating to study for them because you just didn't know (and obviously he didn't know as well because he hadn't made them yet) what to study for. \nAnd the MIDTERM - THE HORROR STORY.\nWhat kind of professor doesn't even make sure that he has enough copies of the exam for the class? Half of the class didn't get a midterm, because there weren't enough copies for everyone. If Prof Miller (or the TA's) had acted quickly and professional enough to resolve the issue, it wouldn't have been that bad and this story wouldn't be here. But when Prof Miller asked \"how many of you didn't get an exam?\" and more than half of the class raised their hands, what he said was something like, \"Oh, there should be enough. I printed 10 extra.\" And then, what he did was just go on his laptop (?) trying to figure something out or whatever he was doing, while the entire class just sat there waiting for instructions. Those who were lucky with the exams were looking through the questions and discussing it with whoever was sitting next to them. The TAs warned the students to stop talking and to leave the exams faced down, but the class had 100+ people in it, so that of course was not an efficient or smart way of handling the problem. Prof Miller decided to re-collect the exams only when a TA suggested that they do so, which unfortunately, was another fail, because the extra copies arrived when the TA's had already begun collecting the exams back. Complete BS and a waste of time. \nProf Miller should really put in more effort and time into his classes. The experience I had being in his class was just not worth the time nor the money I paid Columbia for it.\n\nWorkload:\nlight reading\n3 in-class quizzes \nmidterm & final\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 26, 2014",
            "review_content": "\nAVOID!!!!!! AVOID THIS MAN AT ALL COSTS!!\nNever have I taken a prof as lazy and useless as Ron Miller. I thought nothing could get worse than stats with Sheela Kolluri but I was SO WRONG, this class was infinitely worse.\n- Lectures were totally useless. He didn't post slides beforehand so you couldn't print them out to take notes, and they were basically a dumbed down version of the textbook with no math or application. Plus, he'd always say things in class like, \"In the real world, you never use this\" or \"In the real world, this test is never accurate.\" But WHO CARES about the real world, when all this stuff is going to show up on our exams and you haven't taught it to us???\n- No cheatsheets. He would say we wouldn't need them, and then would say that he would \"provide us with any formulas we'd need on the exam\", and then wouldn't provide us with any on the exam really. And he wouldn't provide us the formula sheet ahead of time (obviously since it didn't exist) because he said that would be \"too much work to go through the textbook and look at all the formulas and decide which ones to give.\" Again, lazy.\n- Problem sets most weeks that got harder as time went on and became more and more focused on Stata. Again, nothing he said in lecture ever helped with the problem sets. Find a good TA (shout-out to Shen, the best TA and only helpful person in this class) and go to recitations/office hours. The problem sets were also totally useless in helping to prepare for the final.\n- No practice exams whatsoever, since this is (I think) the first time he taught this class and the first time he's taught in like 10 years. He was too lazy to write up practice exams and there was zero communication between him and the TAs. None of the TAs in the midterm and final review sessions had even a clue of what the exam would look like, only that it would be \"somewhat math/application, somewhat theory/proof.\" We were given the practice exams from other sections (no thanks to the prof, solely b/c of our TA) which helped a bit but not really since his exams didn't look like either of these exams really.\n- Was a total dickhead about rescheduling exams if you had multiple on the same day.\nThe only good thing about Ron is that he didn't give a shit if you came or didn't came or came for five seconds and then left, or fell asleep, or whatever. The class is doable (like most classes at Columbia), but it's completely stressful, unpleasant, frustrating, and overall a truly terrible experience. \nDo yourself a favor and take this class (and ANY class) with a different prof.\nWorkload:\n20% problem sets, lowest dropped; we had 9 total, so about 1 per week skipping some weeks\n30% midterm\n50% cumulative final, with the option of eclipsing your midterm grade if you do better\nexams were difficult, I'm not sure how the class was curved, probably to a B or a B+. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "September 15, 2001",
            "review_content": "\nRon Miller is pretty straightforward. His lectures can get quite boring, but they are very factual and useful. Sitting in the auditorium of International Affairs can put you to sleep. He does tend to give decent grades (I thought so anyway). Going to lectures is beneficial, but the class can be passed without them. The midterm and final are a little difficult (especially 'true, false, and uncertain' problems and anything to do with OPEC), but the grades are assigned on a curve fluctuating with B+ as the median.\nWorkload:\nLight for an econ class. We had only 6 problem sets in over 12 weeks, so you do the math. You could technically devote a hour a week to this class.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 16, 2001",
            "review_content": "\nHis lectures are boring as hell. They're all right out of the book. Going to the lectures are pretty much pointless BUT now and then he'd throw in something that isn't in the book and you'll most likely find it on exam. His problems sets are straight out of the text so if you can find someone who's taken his class, you'll do just fine. Unfortunately his exams are not as easy as his problem sets, I would even say that he grades harder than other professors teacher Principles. Essentially, if you can take another professor, do so.\nWorkload:\nProblem sets about every week to every other week. 1 midterm, 1 final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 31, 1999",
            "review_content": "\nRon is very clear and concise about the subject material. He has notes outlined on a screen, which is basically an overview of the textbook layout. You should copy down all of his overhead notes, in a very quick and efficient manner, because he likes to go ahead onto the next slide, even if half of the class is still copying down the last screen. While you're copying down the notes, you must also carefully listen to what he is saying, to comprehend the material. IF you miss class, no worry, just read the textbook. Many people walk in and out of class late, so don't be surprised if you start doing the same. If you're tired, it will be extrememly hard to stay awake in this class, since it is the same routine over and over again. The one thing Ron lacks is the way he presents the class. Just make sure you're awake and eager to learn the material.\nWorkload:\n6 problems sets (make sure you have some friends you can get help from, if you need any), one midterm, one final, which is 45% of your grade!!!!!!!!!! (you must pass this final in order to pass the class)\n"
        }
    ]
}