{
    "prof_info": [
        {
            "prof_name": "Katharine Bedford",
            "prof_id": 2630,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Gender and Power in Global Perspective",
            "review_date": "March 28, 2006",
            "review_content": "\nBedford is amazing, definitely take anything you can from her.  She's a self-professed nerd, and the most endearing one at that.  Brilliant, very approachable, and brings up interesting, applicable topics.  She gets an A+.\nWorkload:\na lot of reading, it's dense but good.  if i can do it so can you.  don't take it if you want an easy A, you'll work your ass off over it...  weekly postings, mid-term paper, big final paper\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "December 28, 2005",
            "review_content": "\nBedford is very considerate and was a great section leader.  The class was somewhat disorganized, more a function of it being team-taught than anything else, but Professor Bedford was always well-prepared for class and willing to field questions, even those that are critical of her arguments.  Some of the freshmen apparently found her intimidating, but I think that reveals more about their ideas of how a female professor should behave than it does about Professor Bedford.  I daresay many of them would benefit from a bit of her self-confidence...  The reading load for the class is really quite manageable, much less than you would have for a political science course, and many of the readings are pretty easy to follow.  All told the class is a fun diversion from more traditional courses, and it is interesting to see how people write academically about the gender issues we have to deal with every day. \nWorkload:\nfine, a bit harshly graded but somebody has to fight the grade inflation!\n"
        },
        {
            "course_name": "Intro to Women and Gender Studies",
            "review_date": "December 22, 2005",
            "review_content": "\nBedford's teaching is for those who don't want any nuance or opposing views. She doesn't cite her sources in lectures, and when using extremely biased and one sided sources or references she completely refrains from exposing an alternative view. She colors her language and will focus entire lectures around a single concept and will continue to repeat the same biased information hitting you over the head with it. Hirsch, is an excellent teacher and it is unfortunate that her teaching has to be combined with Prof. \nBedford's, but at least it serves as an interesting contrast so you can see just how ridiculous and polemical Bedford is.  \nWorkload:\nI don't recomend this class if you are not a freshman or sophmore, it seems tailored to less experienced students. \nAlso, there is not a lot of work in this class. There is an average amount of reading, one response to one of the pieces of reading per week and a joke \"media file,\" a short paper on a biography, and an easy take home final. \n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "November 20, 2005",
            "review_content": "\nI can't believe the other reviewer called Prof. Bedford a \"feminazi,\" and I think the fact that this person would use that incredibly offensive term at all really says something about how seriously you should take his or her review. \nNow, onto my review.\nTake. This. Class. Even if you are just thinking about it, if you are even just vaguely interested, even if you don't think it's anywhere near your major: this class is life-\nchanging, and Professor Bedford is fabulous. Intro to W&G; Studies will change the way you think about not only sex, gender, and identity, but also who you are as a person, how you think about other people, and how you think about the world. Yes, there is a lot of reading, but it's damn well worth it: the reading is absolutely fascating, and let's face it, you don't have to do all of it. The lectures are brilliant, engaging, well-planned and timed (NEVER ran over), and discussion with Prof. Bedford was always interesting and open: I never felt restricted about expressing my opinion. Bedford is very open and honest, but not a pushover; if you are talking nonsense, or not making any kind of salient point, she will let you know. \nShe is a very fair grader, in my opinion. And her English accent is delightful. :> She is a Mellon postdoc, and probably won't be here for too much longer, so take this class while she is still co-teaching it with Hirsch! (who is good as well but not as fun, in my opinion.)\nWorkload:\nWeekly reading responses (not difficult and fairly graded on a check minus, check, check plus scale); one Life Writing paper analyzing the gendered dimensions of an autobiography (5-7 pgs: really not that difficult), a Media File analyzing 8 media clippings, v. creative. You must also attend 2 events related to gender and write up quick event summaries. Really manageable, if you ask me.\n"
        },
        {
            "course_name": "Intro to Women and Gender Studies",
            "review_date": "October 30, 2005",
            "review_content": "\nBedford co-taught this course with Marianne Hirsch fall 2005. Hirsch was fine, but teaching of the course was dominated by the very dominating Kate Bedford, who is mean, patronizing, belittling, and unreasonable. The co-teaching is not organized, as they keep switching around who teaches the course from semester to semester. The amount of reading is ridiculous, which is too bad because I would have liked to have been able to do it all. This course is simply too ambitious and results in stuttering all over itself. I'm a feminist, but Bedford is a feminazi. My TA was okay, but she was a very tough grader and the grading is completely subjective. In the most recent discussion section we filled out a survey about the course filled with questions like, \"what's working for you about this course? What do you like?\" of course this inherent positive bias is outrageous, so the whole section turned into us ranting about how ridiculous the course was!\nOkay, this class isn't TERRIBLE, but I felt the need to counter Hirsch's reviews from last year that were extremely positive. \nWorkload:\nPretty outrageous. I'm a first-year, but every Senior in the class says this class has the most work in their courseloads too. About 100 pages of reading each weekend, followed by a reading journal which the syllabus says is no big deal but which is graded incredibly harshly and treated like an essay! Additionally, 1 6-7 pg paper, a \"media file\", and a take-home final. \n"
        }
    ]
}