{
    "prof_info": [
        {
            "prof_name": "Martina Mims",
            "prof_id": 6787,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 18, 2016",
            "review_content": "\n  Martina Mims is by far the best professor that I have had in Columbia. I wonder why she hasn't had a golden nugget here. I took Arthum with her last year, and she was very encouraging, but she also commented on what is right/wrong in people's comments, making you learn a lot in a relaxed atmosphere.\n  She genuinely cares about her students. It's been over a year and she keeps asking how we're doing when some of us from that class run into her sometimes, and has written rec letters for a few of us. In fact, at the beginning of the my Arthum class last year when I told her that I felt sort of intimidated because I had no background in art, she took me to a cafe on campus, bought me water, sat down with me outdoor, and encouraged me with really sincere words. I became very involved in that class. She has that attitude towards all of her students, and obviously knows well about them: when someone doesn't talk in class, she will call on that person by pointing our his/her previous experience or probable expertise on this matter and invite him to comment on this. Everyone gets to participate in some way, and actually enjoys the class.\nWorkload:\nLightest among all the courses I have taken, the readings are completely unnecessary; there is this very interesting assignment that asks you to do a on-site schematic sketch of an artwork and comment on it. You get to go to museums all the time.\nOne 3-4 page paper, easy midterm and final. Lenient grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 03, 2016",
            "review_content": "\nI LOVE MARTINA MIMS! Seriously, I've been recommending her to everyone who has yet to take ArtHum. She's really great at facilitating class discussions - I have no background in art/art history/analysis whatsoever, but I found it easy to say something of value in class. It's really relaxed, but I also learned a lot that I didn't think I was going to retain..and then I went to Italy and was able to pull from what she had talked about. Her grading is lenient, and she makes sure you know what to expect for the tests and papers so you're well prepared. \nMartina is great. She's understanding, intelligent, friendly, approachable, and great at teaching the subject. Take her if you can. If I could go back and take this class again, I would!\nWorkload:\nTotally manageable. It's basically what the other person below described, but I only had to write 1 paper on a painting at the Met. There's also a group project - your group is assigned to analyze some museum/subject relevant to what we're learning (for example, analyzing the structure of the Guggenheim and how it adds to one's experience) and presenting it to the class. It's about a 10 minute presentation, so it's nothing to worry about.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 01, 2015",
            "review_content": "\nThis was the best class! Professor Mims is extremely knowledgable on all things art, but she also creates a wonderful atmosphere that I have yet to experience in any of my other classes at Columbia. She lets her students discuss the art in whatever terms you feel comfortable with rather than lecturing, which was really interesting. It also let everyone feel welcome to add to the conversation regardless of how fluent you were art terminology. Professor Mims definitely lead the class and steered conversation, but everyone would talk to each other rather than just spouting off information at her. We also went on two \"field trips\", which were extremely interesting and informative! We went to St. John of the Divine and got an extremely comprehensive and unique tour of the cathedral (we even got to see parts that are off limits to the public tours). Almost everyone in the class did well and I don't think anyone got below a B (the majority of students got A-'s I think). \nIf you want to learn about art, how to discuss art, but mainly how to interpret art using the skill set you already have then definitely take art hum with Professor Mims!\nWorkload:\nEasy!\nEvery other week you have a LST (Look, sketch think), which involves going to a museum and drawing a painting, sculpture or other piece of art and then writing about it. You do all of this on a blank sheet of paper. It's really easy and there's no \"right answer\". You get full credit as long as you turn it in.\nMidterm: super easy! You have to be able to ID the art we learned in class, but professor Mims send out power points with all the art you must know. You just have to know the name, place it was made, medium (marble, oil on canvas, etc) and the decade it was made. Memorizing the mediums was hard, but I know a lot of other art hum classes where they had to memorize the exact date and other unnecessary facts. You also have to compare and contrast two pieces we looked at, which is easy. You can literally write about ANYTHING as long as your argument is cohesive you will get full points.\nTwo papers: The papers were really easy. The first one we were given a choice of three topics that all pertained to different art found at the Met. You have spring break to write it so it's really no rush. The final paper was a bit more abstract, you got to design your own gallery using art that we had looked at in class. It's fun and again there's really no \"right answer\".\nFinal: Same as the midterm except there's a section where you are shown a work we didn't look at in class and you have to make an educated guess on who the artist was. It's really easy and there were no surprises on it.\nThere's some reading, but most of the class never did it. It's an easy class as long as you are willing to participate and again there are no \"wrong answers\" when discussing the art.\n"
        }
    ]
}