{
    "prof_info": [
        {
            "prof_name": "Liping Liu",
            "prof_id": 4401,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "January 08, 2009",
            "review_content": "\nBasically: Awesome teacher. \nI was in her first year of teaching in Columbia and her first year in the States. She's on a two-year teacher-exchange program from Beijing. Her English wasn't too bad, comparable to the other teachers, though not the best. \nShe's very helpful and amiable; you feel comfortable around her. Her slight insecure hesitancy in talking English was always amusing. She has a great sense of humor and got along really well with our class, always accomodating our curious questions which turned into tangents (she usually got back on track after awhile). I felt completely comfortable asking questions (she's not intimidating) and I asked a ton. At the same time she would be clear if she was disappointed in our class and expected better of us in our scores. She really made sure that we understood the concepts and words; she would try and try again until we were no longer confused (ish). She incorporated our feedback very well. After we told her it's helpful to know what individual characters in a phrase or multi-character word mean, she made sure to spend time breaking down characters. She arranged a movie-session after classes were over (Kung Fu Panda) for a last get-together. \nThe Chinese program here in Columbia is just, overall, excellent. The curriculum is carefully designed and rigorous so you really are immersed into all the aspects of Chinese language. My friend who's from China commented that he was amazed at the progress we made in the course of a semester. Within a few weeks we were speaking and reading sentences. \n\nWorkload:\nits the same across all the chinese classes, although she didn't hand out flashcards of vocab words which would've been nice. but i spent about an hour a day, sometimes less and sometimes a lot more (maximum 3), but i know people who spend about 3-4 hours regularly. If you're good at memorizing and are a visual person, it's a lot easier.  \n"
        }
    ]
}