{
    "prof_info": [
        {
            "prof_name": "Patricia Denison",
            "prof_id": 434,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year Seminar",
            "review_date": "December 06, 2012",
            "review_content": "\nI must disagree with the previous review. Pat Denison is NOT useless. Yes, sometimes her tangents may seem irrelevant in the beginning, but she always ties them back. She did an absolutely stunning job arranging the syllabus so that the readings related well and the class maintained a very nice flow. She contributes in discussions because she is interested in the material and has valuable knowledge and experiences to share. In this class, I always felt encouraged to share my thoughts even if they weren't fully developed yet. PD respects her students and recognizes how crazy life can be for them. I left this class with a great deal of knowledge and insight without once feeling overwhelmed by the workload. At the end of the semester, she invites the entire class to her apartment for a nice brunch. I felt like I developed a beneficial relationship with a thoughtful woman, not just a professor. \nWorkload:\nQuite manageable. 2 5-6pp papers and an in-class final essay. \n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "November 17, 2012",
            "review_content": "\nProfessor Denison is, unfortunately, useless. She is a nice enough woman, but she is actually incapable of making some very interesting readings useful to you. Her teaching style is RIDICULOUS - this is a seminar class, and so discussion is supposed to be encouraged. She interrupts everyone, even the person making a presentation every lesson (which everyone has to do), and makes discussion virtually impossible. When she interrupts, her points are virtually useless - she is off-topic, she rambles, and she tells long, irrelevant anecdotes about her life. Really, it makes this class SUCK.\nIf you can avoid her, do. If you can't, I'm sorry. \nWorkload:\nModerate if you do all the reading, light if you don't (which often is unnecessary). \n"
        },
        {
            "course_name": "Shakespeare in Performance",
            "review_date": "March 22, 2011",
            "review_content": "\nI don't know how exactly this happened, but I wandered into this class on the first day as a first-year without any concept of the fact that the class would be populated almost exclusively by seniors.\nProfessor Denison warmly invited me to sit in on that first class, and told me at the end that I could stay.\nNow, as a junior, I realize what a gesture that was.  The difference in competence between a first-year and a senior's writing in an English class is huge, but Professor Denison gave me a chance to prove myself in a setting that was fun and interesting, albeit a bit loose in its organization.\nI earned a B+ at the end of the semester, and Professor Denison announced to the class while we sat in her apartment that I was the only first year there.\nFor me, Prof. Denison embodies the warmth, encouragement, and attention to individuals that Barnard is all about.  Along with a couple of other phenomenal English teachers, Professor Denison seduced me into and English major with a theater concentration, and has proven herself to be a thoughtful, helpful and caring advisor.  \nI agree that if you appreciate a dry and empirical experience, the class is not for you.  However, if you can adapt to the conversational and elegant way that Prof. Denison shows her love for Shakespeare's work, she will not only enchant you, but will remember your face as well as your work long after the class is over.\nWorkload:\nWeekly assignment to watch a performance, short midterm paper analyzing a passage from a Shakespeare play and a thesis on a character an a theme in various performance settings.\n"
        },
        {
            "course_name": "Victorian and Modern Drama",
            "review_date": "January 15, 2010",
            "review_content": "\nI don't know what the previous review was referring to, Professor Denison is not a joke. She is a charming, sweet, stylish woman who led wonderful discussions and created an air of comfort in her class. This was my favorite class of the semester, the readings were interesting and the two/three required shows we attended were, if not remarkable, entertaining. Denison is always available for help outside the classroom. She is open about her life, telling the class stories about her daughters and inviting us to her home. The class environment was always engaging and insightful. I would recommend any class with this Professor! \nWorkload:\nA play a week, weekly postings, various videos and plays to see, two papers 5 pg and 20 pg. Manageable especially for a senior seminar. \n"
        },
        {
            "course_name": "Victorian and Modern Drama",
            "review_date": "January 15, 2010",
            "review_content": "\nI don't know what the previous review was referring to, Professor Denison is not a joke. She is a charming, sweet, stylish woman who led wonderful discussions and created an air of comfort in her class. This was my favorite class of the semester, the readings were interesting and the two/three required shows we attended were, if not remarkable, entertaining. Denison is always available for help outside the classroom. She is open about her life, telling the class stories about her daughters and inviting us to her home. The class environment was always engaging and insightful. I would recommend any class with this Professor! \nWorkload:\nA play a week, weekly postings, various videos and plays to see, two papers 5 pg and 20 pg. Manageable especially for a senior seminar. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 26, 2007",
            "review_content": "\nThis professor is a joke.  She leads shallow discussions on great texts.  She doesn't seem to know much about the books and relies on the students (who don't know anything either) to run the class.  She comes to class 10 minutes late EVERY TIME.  She is a DC native with what I think is a fake British accent.  She grades her papers like a bad fifth grade teacher, overlooking content to correct the tiniest grammatical mistakes.  Completely mediocre class.  \nWorkload:\nStandard for first-year seminar.  Readings and a few papers.  \n"
        },
        {
            "course_name": "Victorian and Modern Drama",
            "review_date": "January 09, 2004",
            "review_content": "\nProfessor Denison leads all her classes as if they are small seminars regardless of the number of students in the class.  As such,  the quality of her classes can depend on the intelligence of the students in it.  Although she rarely lectures, she is very pleasant to listen to and always has a smile on her face. She runs a very laid-back class and is understanding of any extensions a student may need.  The syllabus for this class is wonderful (Ibsen, Chekhov, Wilde, Shaw) but is heavy on the Victorian side with little of the more modern works.  If you like a chill atmosphere and and don't mind Denison consistently coming 20 minutes late to every class, take her!\nWorkload:\nNot easy but far from overwhelming.  A 1-2 page response paper per week (she barely reads them and they aren't even graded), a  20-25 page final paper, and a theater review.  The reading is moderate (although you do have to do it since there are response papers every week).\n"
        },
        {
            "course_name": "Shakespeare in Performance",
            "review_date": "July 30, 2002",
            "review_content": "\nAlthough Denison is one of the nicest professors (quite frankly she is always smiling) and did have us over to her gorgeous apartment for our last session, the class was a disappointment. Denison did attempt to keep the energetic class discussions on track, but her overwhelming politeness seemed to hold her back. Without fail, after starting class fifteen minutes or more late the discussion would turn towards the tedious and trifle. She includes some great films, but the list of plays is almost completely tragedies. Though we handed in weekly response papers and a draft (with few helpful comments and a lot of underlining), she was shockingly harsh on our final papers. What's more disappointing then the mediocre grades is that I learned virtually nothing in this class.\nWorkload:\nVery light for a 4 point class. 1 page weekly responses. About 1 play and 1 film a week. 10 page final paper.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 29, 2001",
            "review_content": "\nShes pretentious alright: British accent, well dressed, wife of Quigley, but shes a nice down to earth lady. She'll go to plays with you, invite you over to her house, and let you meet her kids. HOWEVER, she's a hard grader. She lies when she says that she grades from class participation, response papers and presentations - she only cares about PAPERS. Yep, shes a harsh grader and gettting a B+ is an accomplisment. It's a hard class to get an easy grade, but she's caring and you do learn in the class. So access yourself.\nWorkload:\nResponse papers for every book read, 4 major papers, one class presentation and a final in-class essay.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Denison though offers little guidance in terms of class discussion (the students do it all). She seems to put little effort into grading papers, and the effort she does put in is to correct the odd grammatical error. Her seemingly false British accent can be unnerving, but she's friendly, so her course in not unbearable. This is a mediocre course at best.\nWorkload:\nVery Manageable\n"
        }
    ]
}