{
    "prof_info": [
        {
            "prof_name": "Jenny Boylan",
            "prof_id": 13690,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Fiction Writing",
            "review_date": "April 17, 2021",
            "review_content": "\nAs a fellow trans person, I expected Jenny to be welcoming and want to help me with my creative development. I was wrong. She consistently talked down to me and said rude things about my writing style. To be clear, I'm more than willing to take constructive criticism, but that's not what happened. Her feedback was inconsistent and contradictory. One moment she said the writing felt effortless, poetic, and expertly executed, the next she said that it was jarring and stilted. She said she really loved the thought and messaging behind a story, the next she said that she wasn't sure what the point of it was. When I was talking in workshop, she would consistently interrupt me, though the whole point of the workshop process is to have everyone give their feedback. Again, to be clear, it's not like I would ramble on for ten minutes. I'd give the normal amount of feedback and try to make it as concise as possible. I didn't get anything particularly valuable from the class and didn't really get the chance to connect with my classmates, because any time not in workshop she would ramble about her personal life. On top of all that, she misgendered me. Coming from cis professors, this sucks, but it was extra painful coming from a trans one. I've never had a creative writing teacher treat me this way at Barnard or Columbia. If you're serious about being a writer, I suggest taking creative writing classes with literally anyone else. \n\nWorkload:\nManageable, but if you are even a little late on an assignment she will harass you by email multiple times a day and call you out in class in front of your peers.\n"
        },
        {
            "course_name": "Queer Narratives",
            "review_date": "May 01, 2019",
            "review_content": "\nQueer Narratives was a really good class. I loved reading everyone's work, and enjoyed the fact that we only looked at two writing assignments each class so we could really focus. Jenny (she asked us to call her Jenny) is a bit self obsessed. She made us read her book and have a class on it, which was supposed to show us \"how to write memoir pieces\" but instead was just a discussion on her personal life. She often wasted the first thirty minutes of class showing us videos of her on Facebook or Youtube. The class was good... Jenny is just a character. Overall, I would take it again\nWorkload:\n4 writing pieces (each getting progressively longer) but super manageable (you have weeks in between assignments)\n"
        }
    ]
}