{
    "prof_info": [
        {
            "prof_name": "Michael Williams",
            "prof_id": 12836,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 12, 2014",
            "review_content": "\nProfessor Williams, or Mike as everyone calls him, is a great seminar leader. Most kids hated FroSci, but I didn't actually enjoyed the class and he had a lot to do with it.\nThe classes are pretty standard: he goes over lecture, does whatever activity he has to, asks if we have any questions, and usually let us go a little early if there isn't much to discuss. He has a good sense of humor, and tries to make the lecture material seem as interesting as possible. As a physics professor, his reviews were a little stronger for the first two sections of FroSci, but he does a good job on the other sections too. Basically, I thought seminar was actually kind of fun, and all of my friends couldn't stop bitching about theirs.\nIf you're having trouble with HW or any material in the class, go to office hours and he'll help you out. \nHe also gives you the option to write a research-based essay on pertinent science-based questions for your term paper rather than than the usual taking a research paper and turning into an article thing. The essays are actually pretty cool. Also, if you put some real effort in, you could easily get full credit.\nClass (across his two sections) is curved to a 3.5 (A-/B+) which seems standard for FroSci\nLots of extra credit opportunities (mostly watching movies/attending lectures), but he admits himself that extra credit doesn't count for much.\nBasically, count yourself lucky if you've got him as your seminar leader.\nAlso, I would recommend using the podcasts rather than going to lecture: it really is essentially the same thing, and far more convenient. \nWorkload:\nStandard FroSci workload: HW every week, midterm, final, AMNH visit, basic quizzes for each of the 4 units (super simple and didn't count for much)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 23, 2014",
            "review_content": "\nIf you've ended up in Michael's Fro Sci section,  you are super lucky! He's an amazing teacher, incredibly funny and smart. Honestly, he made fro sci a wonderful experience for me. He's always willing to help out, explain things perfectly, and give valuable advice to his students even when it has nothing to do with fro sci!! Again, you are extremely lucky to be in his section. Fro Sci was definitely one of my best experiences at Columbia, and i'm sure it had a lot to do with being in his class!\nWorkload:\nNot bad - regular fro sci workload. \n"
        }
    ]
}