{
    "prof_info": [
        {
            "prof_name": "Pascale Hubert-Leibler",
            "prof_id": 2781,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary French I and II",
            "review_date": "November 20, 2013",
            "review_content": "\nThe best professor I have had at Columbia.\nShe speaks only French in class and it is overwhelming at the first class because you don't know a word. However, you end up learning to speak very very quickly with her teaching methods.\nPascale is extremely nice, very lively and energetic. With an 8 credit class that meets for two hours every day, I cannot imagine the class being pleasurable if it was not for her.\nYou end up learning a lot, and after just a few month find that the language that made no sense at all at the beginning of the semester does make sense and you can actually speak/read it. I don't think I have ever learned this much over the course of a semester.\nShe makes a lot of cultural comments, so you end up learning about French culture, too.\nAlso uses a lot of outside material in class- videos, games, poetry etc..\nEverybody loved Pascale, we got her a cake for her birthday.\nI was sad when the semester was over.\nOverall, amazing class for somebody who wants to learn French.\nWorkload:\nmanageable. it is an 8 credit class, so expect to do work every day. However, I would say most work is done in-class \n"
        },
        {
            "course_name": "Elementary French I and II",
            "review_date": "January 07, 2011",
            "review_content": "\nWhat an incredible prof.  She has the enthusiasm and energy of a first time teacher with all the knowledge and experience of a seasoned pro.  She has beautifully tailored answers to any question you could ask and has put a lot of thought into her teaching materials. \nI found the course to be a fair bit of work - cramming two semesters of French into one is no small feat.  And while her exams are hard, they're very fair and my grades directly reflected how hard I studied.  \nI adore how she wouldn't let us slide on pronunciation.  A handful of us in the class had backgrounds in Spanish, and were prone to certain errors because of similarities between the languages.  I was maybe the worst about this, and she was patient but insistent that I make strides to improve.  My spoken French still leaves much to be desired, but I'm amazed at how solid my listening comprehension is after this one course.  I catch bits of French conversation on the train and get a lot of dialogue in French language movies. \nIn short: overwhelming positive experience.  H-L is charming and dedicated and exactly the person you want to introduce you to French.\nWorkload:\ndaily homework assignments that took me 1-2 hours when I did them well, 5 compositions, loads of little quizzes, a test for every 3 chapters covered\n"
        },
        {
            "course_name": "Elementary French I and II",
            "review_date": "July 06, 2010",
            "review_content": "\nThe Accelerated Elementary French course with Prof. Hubert-Leibler was perhaps my favorite class during my first semester at Columbia. Prof. Hubert-Leibler truly loves her job and her students, and it shows each day of class. Extremely energetic and thorough, she creates an intense learning environment that doesn't ever actually seem intense. The progress of each student, myself included, was so impressive, and she let us know that too! From the amusing music videos to humorous YouTube clips that helped us with our studies, I give her most of the credit for my continued success with the French language. Knowledgable in multiple languages, she can also often help you if you are having interference with your learning. She doesn't walk around the class even, she runs! I still go and visit her, and every time we cross paths, she gives a huge smile and a \"Bonjour!\" A one-of-a-kind professor, Prof. Hubert-Leibler is most definitely THE person to start your French studies. \nWorkload:\nA typical workload for a language class, but because it was accelerated, there was also a bit more. If you're dedicated, this class is definitely for you. I was never overwhelmed, but there are many quizzes, and you do push through things at a fast pace. The upside of that is that if you mess up on one of them, there are so many others to boost your grade. About 30-60 minutes a night, but it's a language class so it's to be expected!\n"
        },
        {
            "course_name": "Elementary French I and II",
            "review_date": "February 11, 2010",
            "review_content": "\nI had Professor Hubert-Leibler for Accelerated Elementary French and she is AWESOME! Very kind and sincere, she always comes into class with a cheerful \"Bonjour!\" \nShe is patient and does not use any English (unless there is something that she thinks will be too difficult for us to understand). She also uses great teaching techniques--props, skits, and games to make the 2 hour class stimulating. I totally enjoyed her classes and recommend her 100%!\nP.S. This class might be a little intense if you do not have some background. You might want to stick to the regular class if that is the case.\nWorkload:\nDaily homework and reading (about 20-30 minutes), Composition every other week, Weekly quizzes. Manageable and definitely recommended that you do the homework if you don't want to look like a fool in class!\n"
        },
        {
            "course_name": "French Elementary II, accelerated 6 weeks",
            "review_date": "December 20, 2009",
            "review_content": "\nHow Does Professor Pascale Hubert Leibler not have a gold star already?! Pascale is definitely one of the best professors I've had at Columbia. Not only does she have an incredible command and ability to teach french, she is incredibly sincere and actually cares about her students well-being. By the end of the semester I could have a legitimate conversation in french (albeit not fluent but considering we started from scratch, not bad). If you have the opportunity to take a class with Pascale I highly recommend it. Even though our class met at 9am-11am M-TH she was always full of energy and made the class interesting and fun. On a side note, I would not recommend Accelerated French (1 and 2) for those who have no prior foreign language experience (specifically with the romance languages) this class moves very quickly because of the amount specified to be done in the syllabus, and to prepare us for intermediate 1. There is not much time to process information and the workload can be overwhelming if you fall behind. Most importantly, Pascale understands that this class moves too fast for new language speakers to be able to process all the information we're given, and as such she is a very fair grader. \nWorkload:\nweekly, sometimes bi-weekly quizzes, tests either every week or every other week, compositions due once every other week and nightly reading, vocabulary and oral exercises \n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "May 26, 2009",
            "review_content": "\nWow. Professor Pascale is exactly what makes it worthwhile to come to a place like Columbia. She is absolutely amazing, pleasant, and knows her stuff. To make it even better she's fair and understanding. \nDo whatever you can to get into her class and learn French from her, especially in the earlier stages. I am so glad I was able to be her student! \n\nWorkload:\nWhat everyone learning a second language should expect - daily homework, quizzes every two chapters or so, 4 major test, a final, 5 compositions. Keep up with the work and you'll be totally fine. \n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "May 21, 2009",
            "review_content": "\nFirst, this professor is one of the nicest people you will ever meet at Columbia.  She is warm, funny, sincere.  She really cares if you learn the French language.  \nProfessor Hubert-Leibler is the head of the French language department so you wonder how she ever finds the time for her undergraduate classes.  She is absolutely organized when it comes to each class.  She has every minute planned out so it's paced well with no dead zones of time.\nThis professor is very fair with grades and you are really lucky to have her as your professor.  \nI wish the pace of the class was slower so we spent more time on different items but that's how all the classes are at Columbia...no time to take a breath.\nI would definitely and highly recommend Professor Hubert-Leibler.  Our class just adored her!\nWorkload:\nVery fair.  Daily assignments that are manageable.  Four tests plus several quizes.  Four short essays (one page is okay) plus an oral presentation at the end which is really a lot of fun.  Some of the students are hilarious!\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 11, 2008",
            "review_content": "\nHubert-Leibler is a really awesome professor!  Even though the class occurs every day, I never felt like we were going over the same material unnecessarily.  Each class, she would cover basic new concepts, allow time for a couple one-on-one speaking exercises that reviewed the concepts learned, and go over the homework.  She could answer every question--and when the question was directed at something we hadn't studied yet (often), she would point that out then continue to answer the question or to see the person after class to answer it.  She was always patient even though the pace of a beginner's class must seem pretty tedious and the material very basic for a long-time teacher.  I highly recommend this class.\nWorkload:\nDefinitely manageable (even though it looks like a lot...):\nDaily homework (about 20-30 minutes).  Quizzes once a week or a test.  About 4 Papers.  4 Tests.  2 Orals.  Checks homework 4 times (during tests).  Final exam.  \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "November 26, 2006",
            "review_content": "\nShe is absolutely awesome. Consider yourself lucky if you end up with her as your introduction to the French language! She is always smiling, with unbelievable amounts of energy and willing to help you however she can.\nI too, had no clue she was the head of the department as she is in no way pretentious and very good at teaching the basic levels of the language. Sometimes, I think big time professors lose that spark or ability to connect to what they are teaching and the students whom they are teaching. This was never the case with her as she is incredibly enthusiastic and down to earth. \nI have never had a language teacher like her and it is unfortunate that she is not teaching the follow up course next semester (similar to the other review last year)! \nWorkload:\nexpected for learning a new language\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "September 20, 2006",
            "review_content": "\nYou would never know that she is head of the department. She is totally unassuming and charming. \nWorkload:\nYou won't work more or less than you would in any other class--you'll just learn more.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 05, 2006",
            "review_content": "\nDr. Hubert-Liebler was simply incredible.  She came to our 10AM class everyday with incredible amounts of energy and the 50 minutes just flew by.  She explains everything very well and takes all questions and really wants her students to succeed.  I think our entire class fell in love with her, she was always going out of her way.  When we learned about animals she brought in stuffed animals, and she created all sorts of fun and hilarious exercises for us to do in class.  She also showed some of Amelie and an old Truffaut film, the parts she selects are perfectly relevant to what we study in class that day.  Her courseworks is always updated and if even the slightest change happens or she has an idea to help the class, she immediately sends out an email.  My only regret is that Dr. Hubert-Liebler is not teaching the sequence course this semester.\nWorkload:\ntypical and necessary for a language class - daily exercises, Weekly quizzes (negotiable), 4 tests, , 4/5 writing assignments (half page to a page), oral midterm, final.  do the work, not a terribly difficult A at all.\n"
        }
    ]
}