{
    "prof_info": [
        {
            "prof_name": "Bingshu Yang",
            "prof_id": 1869,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French I",
            "review_date": "April 24, 2006",
            "review_content": "\nBingshu was an absolutely amazing professor. I took her 9AM section and she was able to keep everyone awake with her awesome energy and enthusiasm. She cares about her students and is very willing to give help either after class or by appointment; she's also really understanding about extensions. The classes were generally pretty casual, and she would always be thrilled when someone volunteered to speak in class -- she's really big on participation, so if you go to class and show a general interest in what's going on, it's not too hard to get a decent/good grade.\nWorkload:\nThe usual for the course: daily exercise assignments in the workbook and/or readings in the text. Tests every 2/3 were hard, but they're not a huge part of your grade.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "December 21, 2004",
            "review_content": "\nI really think Bingshu is a wonderful teacher and if you are lucky enough to get into her section, you should stay.  Although her Chinese accent is a litle daunting at first, she is a great teacher who is not only nice and funny, but very good at what she does.  She made us typed up review sheets for every grammar topic we covered, so we basically had a review packet for each test and then the final.  We also got to talk in class a lot (only if you wanted to) and you could talk about whatever you wanted... a TV show... just as long as you spoke in French.  We also did other fun activities like watch movies and then make fun of the characters afterwards.  She is definately the most engaging teacher I have had at Columbia and I really learned a lot.  (gasp!)\nWorkload:\n5 Tests, 5 Compositions, Oral Presentation, Final\n"
        },
        {
            "course_name": "Elementary French II",
            "review_date": "January 30, 2004",
            "review_content": "\nI completely disagree with the other reviews.  I took this course in the spring of 2003, and I thought she was a very good French teacher -- much more engaging than others I've had in the dept.  She always had new activities to do in class, I learned a lot, and I actually enjoyed French (which was surprising because I only reluctantly took it to fulfill my requirements).  But I thought the class was actually fun.  At first it took me a litte while to get used to her English accent, but I didn't think that was a big deal.   I'd recommend her.\nWorkload:\nWe met three times a week, so there was quite a bit of work.  But participation counts as a big part of the grade, so it's hard to do too badly in the class.  \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 20, 2004",
            "review_content": "\nShe was by far the worst French professor I've ever had.  If you want to learn anything about the language, I reccommend you find yourself another instructor.  She was confusing, unwilling to review difficult concepts, and almost always unable to clarify herself when she was butchering an explanation.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 18, 2003",
            "review_content": "\nPlease do not take  any classes with this woman.  There was one no one who would not admit taht she is extremly unhelpful.  \n"
        }
    ]
}