{
    "prof_info": [
        {
            "prof_name": "Holger Klein",
            "prof_id": 423,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 07, 2009",
            "review_content": "\nDefinitely the professor to take for Art Hum (perk: Director of Art Hum).  When I had taken Holger (Fall 2007) he had just come back from some random but awesome \"sabbatical\"...I believe he was at an excavation site somewhere in Europe and was also a curator at a couple of museums.\nBack to the course, I left that class with a greater appreciation for art, and also considered taking another class (preferably with Holger) but was unable to fit it into my schedule.\nHe is a very kind, down to earth, and passionate about sharing his art knowledge and appreciation with his students.\nWorkload:\nMinimal Readings, 1 Midter, 1 Final, 1 or 2 short reports based upon museum visits\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 14, 2008",
            "review_content": "\nProfessor Klein deserves a CULPA gold nugget, he is amazing! I had never taken any art history before this course and I am now registered for two art history classes next semester and considering Art History as my second major. Professor Klein presents material very clearly and his discussions are always interesting. He encourages students to participate at all times, answers any and all questions patiently and only calls on those people he thinks have something to say, not on those who are not talking. Everyone in my class spoke several times, even people who usually do not talk in class at all. Professor Klein took us to the Met and invited us for tapas and chocolate covered strawberries at the Met terrace wine bar afterwards. I loved every class and was sad that it was over so fast. My only criticism is that although he is the art hum director, we didn't get through large parts of the syllabus.\nWorkload:\n2 essays, 4-5 pages, one with a visit to the Met and one with a visit to the Frick Collection. The instructions were clear and they were fairly graded. Mid term and final were standard with id's and essays. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 24, 2008",
            "review_content": "\nHolger is extremely pleasant and though he is the director of Art Humanities, dont let this scare you! The workload is small, the papers aren't bad, and the tests are really fair. He really allows even amateurs (like myself) gain an appreciation for art! HIGHLY RECOMMENDED!\nWorkload:\n2 papers, some reading, midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 18, 2004",
            "review_content": "\nHe is a great teacher. He makes Art Hum a GREAT experience. He is a fair to easy grader. He tests are long but very doable and fair. \nHe is fun and enthusiastic although he can get cross every once in a while. He clearly enjoys teaching and you feel as though he truly cares about his students. I recommend him 100%. I was thinking of trying to switch out of his class on the first day when I walked in because I had been turned off by some unkind and harsh reviews, but I decided to stay and I am superbly happy that I did. \nWorkload:\n2-3 short papers, Midterm and Final\n"
        },
        {
            "course_name": "Early Christian and Byzantine Art and Architecture",
            "review_date": "May 21, 2004",
            "review_content": "\nKlein is a nice, reasonable professor, but he is extremely repetitious in his lectures and constantly runs late.  If you have a good deal of patience and are interested in Byzantine art, then you are ready for this class.  Please note that this class has a discussion section, in which you regurgitate what has already been said by Klein in class.   For that reason alone, his class is worth avoiding.  He takes attendance for the sections seriously--if you miss one, you have to write a one page summary of the weekly reading.  I kid you not.\nWorkload:\ntwo short 5-6 page papers, mid-term, final, weekly discussion section, weekly reading\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 14, 2003",
            "review_content": "\nProfessor Klein is absolutely fantastic. I love him.. \nmy class seems to love him... and overall, he makes art humanities an extremely enjoyable experience.  I came into the class with little to no knowledge of art and left with not only a great handle on the basics of momumental art and art movements through history, but a love for the subject and a desire to learn more. He makes art fun. Take his class... don't switch out if you get his section!!!\nWorkload:\nExtremely fair. Participate in class. Go to the museums that he asks you to. Do the reading.\n"
        },
        {
            "course_name": "Medieval Art in Manhattan",
            "review_date": "November 03, 2003",
            "review_content": "\nProfessor Klein is AMAZING. He LOVES medieval art, and his enthusiasm is catching. Ive never been in a class with so many oppurtunities to go and view the actual art with the professor. Every class is interesting and I love it, and Im sorry its coming to an end.\nWorkload:\nPretty big. The readings arent so bad, but very hard to locate in the libraries. One paper, a \"write 3 four-six pg paper\" midterm, and a final research paper of 15-30 pages, with a presentation.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "March 19, 2003",
            "review_content": "\nKlein is from Germany but he corrects your grammar mistakes in your paper more strictly than your L&R; teacher, ach! He is very friend and sweet at first( so i did not drop his class), then his moods varies in each class, be extra-careful because he can be really harsh and cynical from time to time, but he can be very patient and nice another time, he hates lateness although he is always late for 5 min. or so, he publicly yells at the girl slept in his class(then the girl left classroom in the middle), he never tells you the answer but keeps asking you the same question--when you finally fed up with this very difficult to please and moody prof. he gives you an OK grade at the end of the semester( at least not as bad as you thought)-and--you can never be his favorite student in class, who you think worths less than a dollar. - Woohwww--your call! but in general, he is better than any graduate students teaching art hum. \nWorkload:\nyou gotta read all the stuffs before every class, he is pretty stingy with grades until the end of the semester., midterm final with 4 papers, it is actually a lot of work honestly for an arthum class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 25, 2002",
            "review_content": "\nHolger's a good teacher. He really knows all the material and is good at leading discussions about it. Sometimes it gets a little boring and its easy to nod off with the lights off, but he's definitely a good professor to have. Occassionally he calls on people and he doesn't give out assignments until a class or two before, but otherwise he's witty and amusing and uber friendly, and a good teacher to have. \nWorkload:\n2 response papers, 3 short essays, midterm final, light reading\n"
        },
        {
            "course_name": "Major's Colloquium: Introduction to the Literature and Methods of Art History",
            "review_date": "January 21, 2002",
            "review_content": "\nHolger Klein is a-ok. He's not fabulous, but he's not so bad either. He's friendly, he's got a sense of humor, he's not too old yet, and he knows his stuff. He was understanding about late assignments. I tended to be bored when he actually lectured; he droned a bit and his voice is a little monotonous. My biggest problem with him was that he often seemed to have very set opinions about very open questions. He didn't try to force his opinions on others, but neither was he interested in exploring ideas he didn't gel with. I wouldn't seek him out again, but neither would I take measures to avoid him.\nWorkload:\n2 papers (5 & 10 page minimums), 2 presentations, 1 exhibit review\n"
        },
        {
            "course_name": "Major's Colloquium: Introduction to the Literature and Methods of Art History",
            "review_date": "January 21, 2002",
            "review_content": "\nHolger Klein is a-ok. He's not fabulous, but he's not so bad either. He's friendly, he's got a sense of humor, he's not too old yet, and he knows his stuff. He was understanding about late assignments. I tended to be bored when he actually lectured; he droned a bit and his voice is a little monotonous. My biggest problem with him was that he often seemed to have very set opinions about very open questions. He didn't try to force his opinions on others, but neither was he interested in exploring ideas he didn't gel with. I wouldn't seek him out again, but neither would I take measures to avoid him.\nWorkload:\n2 papers (5 & 10 page minimums), 2 presentations, 1 exhibit review\n"
        }
    ]
}