{
    "prof_info": [
        {
            "prof_name": "Veronica White",
            "prof_id": 1757,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 05, 2012",
            "review_content": "\nDr. White is an amazing professor and a wonderful person. I echo all the earlier reviews that sing her praises - she really does deserve a CULPA gold nugget, anything less than that simply doesn't do her justice. \nLike most of the earlier reviewers have mentioned, I entered her Art Hum section with absolutely no knowledge or appreciation of art history and have emerged with a new found passion for art of all mediums, and art history in general, that I never thought I was capable of. Dr. White is incredibly patient and understanding, and despite the fact that she is clearly very brilliant and passionate about art, she never once talked down to us even when we occasionally made less-than-intelligent or inexperienced comments about the works we were studying. She made sure that everyone's comments in class were somehow relevant, and even when someone occasionally felt he/she had made a stupid comment and tried to retract it, she always very thoughtfully tried to make that student feel better by highlighting the relevant points of the comment to the work, and by assuring us that art was always open to interpretation in any case. She was very adept at facilitating discussion and directing it, always making sure that it was of a suitable length and that we came away from each work with the most salient points about it. Also, while she's clearly a very experienced Art Hum lecturer, I appreciated the fact that she always managed to keep her lectures about the artists and periods fresh, and that she clearly enjoys interacting with her students, maintaining a friendly relationship with us as she does laugh at/with us sometimes at funny incidences (good-naturedly, of course!)\nHaving said that, I would say that her class is probably pretty demanding for an Art Hum section and a core requirement in general. The day-to-day workload isn't so bad, with just a couple of readings for some artists and three 5-page papers throughout the semester that require you to visit museums, and which take some time to write if you want to produce good analysis. The midterm and final exams are where you feel the brunt of the course's rigor, since we are required to memorize over a hundred works of art, their artists, their dates (+/- 5 years) and the significant stylistic aspects of the work for the exams, that include IDs, a comparative essay, and a thematic essay (for the final). The midterm was relatively manageable, with only a handful of artists/works being tested, but cramming for the final was pretty brutal. I would definitely recommend studying a few days beforehand for the final since its somewhat cumulative. \nAll things considered, though, Dr. White is a phenomenal professor and a really kind, caring person - the kind of teacher you dream of having in college who changes your perspective on your life and opens new windows for you that you never even realized existed before. I'm definitely thinking of taking more art history classes and potentially pursuing a concentration in it after having her as a teacher, and will also (as I told her at the end of the semester) scour the directory of classes feverishly every semester to see if she teaches any art history classes other than Art Hum in the future!\n\nWorkload:\nThree 5-page papers (worth 10% each), a midterm exam (worth 20%), a final exam (worth 30%) and attendance and participation (worth 20%).\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 21, 2011",
            "review_content": "\nDr. White was absolutely amazing. If anyone deserves a culpa gold nugget, it's her. \nArt Hum with Dr. White was an absolute pleasure. She assigned typical amounts of art hum work (aka not very much at all). She conducted class with about 70% lecture, 30% class discussion and visual analysis of the works on the projector. I normally don't love when professors lecture for so long, but Dr. White's commentary was always interesting, relevant, and helpful. I really feel like I can look at art and understand it/talk about it intelligently. She is incredibly easy going, sympathetic, and relatively flexible if you have any issues/need an extension. Dr. White led the classroom gracefully, starting on the first day with the assumption that none of us knew anything about art. That said, she didn't treat us like kindergarteners, but rather let us start with a blank slate. It was nice to be able to come in to class and earnestly ask questions that you might be embarrassed to ask in other classes. She praised any and all participation, and guided our class discussions so that they were actually productive. After taking her art hum class, I'm definitely hoping to take more art history courses in the future - I just hope I can get another prof like her!\nWorkload:\npretty standard for art hum (not that difficult)\n20% attendance, participation\n20% papers (about 5 pages each)\n20% midterm (1st half of semester material)\n30% final  (2nd half of semester material, need to remember a bit from 1st half)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 17, 2011",
            "review_content": "\nDr. White is incredible. I have no idea why she would go from a gold to a silver nugget. \nIf you have the chance, take art hum with Dr. White. I have no background in art or art history, and I loved her class. I felt like I really learned a lot from her, just by showing up to class (I rarely did the readings, since they weren't really stressed.) She made class enjoyable, relaxing, and interesting every time. Dr. White strikes a perfect balance of lecturing (on artists' backgrounds, biographical information of the pieces, etc.) and facilitating directed class discussion. Before this class, I had no idea what to think or say when looking at a piece of art. Now, thanks to Dr. White, I actually enjoy going to museums. Besides her great teaching abilities, she is just a really wonderfully kind woman. Dr. White is understanding, friendly, and relatable. TAKE HER CLASS. i wish i could again!\nWorkload:\npapers, midterm, final, participation. if you pay attention in class and study for the exams, you will do well. readings aren't really important. minimal actual \"homework\".\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "June 10, 2011",
            "review_content": "\nthis class wasnt that bad. you need to memorize a lot for the midterm and final but you should be fine if you study a couple days in advance and pay attention somewhat in class. the papers werent terrible either since she is willing to help you a lot on them. she edits your paper right on the word document for you and tells you all the corrections that you need to make.\nWorkload:\n3 5 page papers, miterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 25, 2010",
            "review_content": "\nI was slightly saddened to see Prof. White demoted to a silver nugget from a gold, but I suppose it makes sense. I loved ArtHum and I think that I learned so much (from knowing pretty much no art history to being able to analyze and appreciate many more styles) but I do think that it was might have been too much work for a core class. The papers were graded pretty harshly, I think. I was able to scrap an A on the last one, but that was after I slaved away for days trying to write it. Ironically, I sacrificed time on a term paper for another class to try and get my ArtHum paper up to snuff. The term paper I also got an A on, despite it being twice as long and me spending 1/4 the amount of time on it. That being said, Prof. White is extremely willing to give feedback and help you out. Even the night before the paper was due, she read it over by e-mail and gave me extensive edits right on the paper.\nI don't know the extent of visual memorization for other arthum classes, but it did seem a little much. I have a pretty good visual memory so I was able to memorize everything the night before for both the midterm and final, but I can see how it would be extremely difficult and overwhelming for others. \nAs far as class itself is concerned, I would like to reiterate what previous reviews said. Discussions were very open and Prof. White always encouraged any type of comment, and never talked down to anyone. I made some less-than-intelligent comments in class but Prof. White always managed to make it seem worthwhile. She did bring candy to class a couple of times and also bought us pizza on one day. However, it became increasingly harder for me to stay awake. Although Prof. White is very interested in the content, the dimmed lights and her soothing voice were not conducive to staying awake. \nIn conclusion, she is a extremely caring professor who honestly wants to see everyone succeed. I couldn't agree more with what one previous reviewer said: I felt guilty when I thought I wasn't giving my best for the papers. Perhaps not the best choice for anyone just hoping to get ArtHum out of the way, but so worthwhile for getting the most out of the class. I got an A, so the hard work does pay off. \nWorkload:\nreadings for every class (I did them all, but you only need to know a few for the exams), 3 5-page papers (I got B+,A-,A). Essays were time-consuming. I think we had to memorize about 50 works for the midterm and 100 for the final (artist, subject/title, medium, date +/- 5 years). (I got an A on the midterm, and probably an A on the final since I got an A overall)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 21, 2010",
            "review_content": "\nProfessor White is incredibly sweet and very intelligent. She tries really hard to get people to participate and make class interesting, but despite her best efforts it still kind of drags on. She's a pretty fair grader (although I never managed to get above an a- on a paper) but I did think that her midterm/final involved way too much memorization of dates, mediums etc. The Met trips were fun and interesting. Overall a good class and I learned a lot, but definitely more work than I would have liked to have to do for an art hum class. \nWorkload:\nreadings for every class (I never did them), 3 five-page papers, midterm, final, 2 Met trips \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2006",
            "review_content": "\nTake this class with Ms. White. Even if you never cared for art before she'll make an enthused participant out of you with the knowledge, enthusiasm, and grace she brings when teaching the class. She is *so* approachable too, always ready with a genuine smile. This was an evening class but it quickly became one that I looked forward to all the time. She helps convert even inane comments into something worthwhile. Just a great class overall, wished it was more than a semester long even when i hadnt, prior to this class, cared for art. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 22, 2005",
            "review_content": "\nThis class is just amazing period. I was very concerned about having to take an art class because I really had no clue about anything related to art and wasnt all that interested in learning about it. But Miss White is a great teacher that really enjoys what shes talking. I mean could you ask for anything else... She even brings food to class for you. By the end of the class you feel like youve just been hit by a truck of art and without even realizing it youve learned a whole lot. Her papers are hard sometimes but as long as you say something smart  you should be fine. In short you couldnt have a better art hum professor.\nWorkload:\n3 papers two midterms and about one reading a week\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 22, 2005",
            "review_content": "\nGreat class, a little difficult to take in the evening but, Ms. White did a good job with the class. There seemed to be too many slides to go over as well. The trip to the MET was fine, Ms. White does seem knowledgable about the work though. \nWorkload:\nTwo or Three paper, midterm and final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 18, 2004",
            "review_content": "\nMs. White is a really good teacher. She was very nice with the class, and her exams were pretty easy. She was rough on grading the essays but she gives a lot of feedback which helps. I didn't get a good grade in the class but I never looked at the artwork.  So if you get into Ms. White's class, stay in it. \nWorkload:\n3 Essays, Midterm, Final, 2 Museum Visits. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 18, 2004",
            "review_content": "\nNow that I'm no longer in Ms. White's class, I miss it more than ever. \nI was lucky enough to get into Art Hum as a first year, and I completely loved my experience (I've always loved art, but this course solidified my plans to do an art history concentration). Ms. White did an incredible job of catering to everyone in the class, as some of her other reviewers have noted. She made sure to explain the basic concepts to those with little or no background in art history, while working with students who had more experience outside of class to make sure the material was interesting for them, as well. She even lent me one of her personal books for my University Writing papers, since I was writing on Andy Warhol. \nShe was very flexible in terms of setting up review sessions, always extended her office hours, during which she welcomed both academic and non-academic conversation, and always made an effort to keep us awake, smiling, and appreciating the art. I never really cared for art before the 18th century before, but Ms. White gave me a newfound appreciation for it. \nOne of the things most refreshing about Ms. White (aside from the delicious cider and cookies she brought about twice a month!) is the fact that she's not as jaded as many of the other Columbia grad students and professors. She is as willing to learn from her students as they are from her. This really helped foster a sense of classroom community and make you feel like your in-class comments were worth making. \nThis semester, Ms. White even took me and a few of my classmates to some art gallery openings, which were really cool. Her unbridled passion for art was evident on this trip, as well as during the various museum visits we made as a class. \nIf you can find a way to finagle your way into Ms. White's class, then do it!\nWorkload:\n3 papers (one short, two longer), a midterm, and a final. Short, easy readings. Fair grading (lots of constructive criticism!). \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 02, 2004",
            "review_content": "\nMs. White is one of the best teachers I've ever had.  She is approachable and inspiring.  I loved this class despite the fact that I've taken art history courses before, Ms. White ensured that I had engaging assignments and wouldn't be bored.  Ms. White also is willing to adapt to students' needs and spend time with them outside of classtime.  Class discussions never lull, and she participates in the discussion, and doesn't speak down to the students.  The museum visits are a lot of fun, and Ms. White speaks eloquently on many subject areas.  Overall, I had a fantastic time in this class, and I highly recommend Ms. White to any and everyone.  She brings great treats, too!\nWorkload:\nThree papers, midterm, final, and two museum visits.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 14, 2004",
            "review_content": "\nMs. White is God's gift to art hum.  She is beautiful, intelligent, kindhearted, patient, and everything wonderful in a teacher.  I went in knowing absolutely nothing about Art History, and I came out with a functional vocabulary and knowledge of the history of major artists.  If this is the goal of the Core Curriculum, she has managed to achieve it.  We had one particularly awkward and strange person in our class, and she was without fail patient and kind with him, working to make him feel part of the class.  She also did really well at forming a family atmosphere in class.  If you have the opportunity to have class with her, you are very very lucky.  And I got an A.  The kind of teacher where you feel disappointed if you don't perform well on tests and papers, which she is flexible about deadline-wise.  \nWorkload:\n3 papers, midterm, attendance/participation (important, she really keeps track), cumulative final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 12, 2004",
            "review_content": "\nThis is a class you definitely want to stay in (or try to get in to.) Ms. White is fun, easy-going, helpful, and very knowledgeable. She has an extensive background in art history and Italian studies. She is one of a few teachers that make you want to learn and love the subject. She normally gives a brief background overview of an artist, and then shows several works using a slide projector, while she and the class hold a discussion on each work. She is very polite and respectful, and encourages participation. She is available for extra help, and even asks students to call her or email her if need be. She is always willing to help you on your paper assignments, and may sometimes take a re-submission into consideration. She is flexible (all teachers have their limits though) and in no way out to get you! When I was studying with other students from different Art Hum classes, I noticed and felt good about how in depth our class went over the material compared to the other classes (and it never seemed high stress at all during the semester!). The key to doing well in her class is 1) go to class 2) pay attention and take notes (you'll do great on the exams) 3) participate.......The paper topics are clear and generally easy, but she grades them thoroughly, but fairly, with a pick and comb- but don't worry- like the others said the grade isn't as bad as you would imagine. The midterm and final were easy as long as you studied and paid attention in class. The readings were short and almost optional- again, as long as you pay attention to the discussions of them in class, you'll do fine in incorporating them in the exams. The final and midterm consisted of ID's, short answer, comparison, and essay-- they were do-able, just a lot of writing! The museum visits are interesting and exciting- she is currently a curator for the Met. Ms. White made Art Hum informative, creative, relaxed, and enjoyable.   \nWorkload:\nWorkload: Short readings for each class, one 2-page paper, two 5-page papers, midterm, final. Two out-of-class museum visits.\n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 13, 2003",
            "review_content": "\nMs. White is a fascinating and inspirational teacher who is extremely passionate about and knowledgeable in art history.  With an extensive background in art history and italian studies, she carries out informative discussions eloquently and enthusiastically, oftentimes pronouncing words with an Italian accent that's fun to hear.  The work load is manageable- short readings and three papers within reasonable length.  She corrects each paper thoroughly and gives advise on how to improve your writing skills. She never hesitates to provide help when asked and usually stays way past her office hours to help students.  A truly wonderful teacher who's able to make Art Hum fun, relaxing, and enjoyable to learn.  \nWorkload:\nShort readings, 3 papers, midterm, final, and two class trips.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 08, 2003",
            "review_content": "\n\"Ms. White,\" as she requests to be called, is a nice and fairly easy professor. It's easy to doze off in her class because of the slide projector and dim lighting, so make sure you bring a cup of coffee. Her midterm was easy, and so are her paper assignments. There's one 2-page paper and 2 5-page assignments, unlike some of the other art hum teachers, who assign a 10-page \"research\" paper. Watch out, though... she's a stickler when it comes to grading! I think most people got B+'s on the first paper, but one would expect a C- if they looked at the amount of red ink on each page! She's a  knowledgeable professor and is currently writing a thesis on 17th century Italian drawing. She's willing to work outside of class with students who have some background in Art History to make the course more interesting for them. Finally, she doesn't ever give quizzes over the reading assignments, which are always very light. She did require we integrate them into our midterm, but you only had to be familiar with 2 or 3 of them. She's nice, a fair grader overall, has a great sense of style, and isn't afraid to laugh. \nWorkload:\nShort (and essentially optional) readings for each class, one 2-page paper, two 5-page papers, midterm, final. 2 out-of-class museum visits.\n"
        }
    ]
}