{
    "prof_info": [
        {
            "prof_name": "Greg Bryan",
            "prof_id": 3460,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Physical Cosmology",
            "review_date": "May 13, 2011",
            "review_content": "\nThe thing that sticks out the most to me about Prof Bryan is that he's just a really nice person. He will go out of his way to help you, whether meeting in his office or responding to emails asap. This class was pretty difficult. He grades fairly but not easily. The class is satisfying in that you learn a ton. No time is wasted. It's cool because you're learning about an area of astrophysics that is both rooted in the beginnings of the field and also using current result in the course's literature. The course requirements ask only for first year physics, but problem sets asked for more than that. Probably better if you're a physics/math/ astro major, rather than just an interested person. \nWorkload:\nWeekly problem sets of 2-4 questions that would range from tricky to nearly impossible. Midterm and final both of which were hard but you won't fail the class because of them. Don't worry. \n"
        },
        {
            "course_name": "Intro To Astronomy II",
            "review_date": "December 22, 2008",
            "review_content": "\nThis review is more a reaction to the May 25, 2008 review than anything. It is true that Bryan's class was relatively easier than Menou's. And Bryan was a relatively easier grader. But it was a good class, and he's a good instructor. He's a nice guy, and he's very accessible after class and any time his office door is open.\nFirst, the time \"wasted fielding stupid questions\" was because of an obnoxious kid sitting in the front row who wasn't even an astro major. He should not have been in the class, and Bryan handled him with grace while the rest of us were making faces.\nSecond, the first 15 minutes of astro recent events discussion was a lot of fun for those of us who actually like reading and learning about astro. It was a very \"Big Picture\" pedagological tool. Taking this out of the class would be like having an econ class that didn't spend a few minutes talking about the current economic crisis.\nAnd what of spending the entire class describing the expansion of the universe?  First, Fatty kept having his mind blown. Second, the quarks-to-cosmos class took weeks to do what we did in that one class, and those students still didn't have it down like we did.\nAnd finally, this is Columbia. If having to read outside of class to help get the material down is such a pain, then transfer to a state school.\nWorkload:\nWeekly problem sets. Open book midterm and final. Not easy, but not *too* hard either. Bryan is a fair grader.\n"
        },
        {
            "course_name": "Introduction to Astrophysics I",
            "review_date": "May 24, 2008",
            "review_content": "\nAfter taking the first semester of this course with Menou, Bryan's class seemed like sitting in on a fifth grade class learning to add fractions. Much of this class is highly qualitative, and Bryan has no plans of making it more difficult. The first 15 minutes of each class are spent discussing recent developments in astronomy, and lots of time is wasted fielding stupid questions. We spent nearly an entire class just describing the expansion of the universe, which is pretty much how Bryan likes to teach. Overall, this class is a much easier A than Menou's. \nWorkload:\nWeekly problem sets that take decent time, because you actually have to read the textbook and learn the physics behind what Bryan describes, since he doesn't actually teach it in class. Midterm, final both open book and notes, and at a fair difficulty level. Bryan is one of the easiest graders I have ever seen, he will give 5/10 for vomit on a piece of paper.\n"
        }
    ]
}