{
    "prof_info": [
        {
            "prof_name": "Julie Sexeny",
            "prof_id": 3111,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2007",
            "review_content": "\nI was dreading this class, since I've taken several college-level writing courses before coming to Columbia, and I felt vaguely insulted by being forced to take another. I was pleasantly surprised. I found Julie to be very engaging and very capable. We had excellent class discussions which she mediated and participated in without dominating. Sometimes her feedback was a little vague, and I never found the one-on-one meetings with her to be particularly helpful, but she was always happy to answer questions in and out of class. Twice I emailed her with last-minute questions (one of which was very vague, along the lines of \"I'm stuck, help me\") and she responded promptly and comprehensively. Although I wanted more specific feedback,  her open-ended comments challenged me more and probably were more helpful in the long run than telling me exactly what to do would have been.\nWorkload:\nModerate -- heavier in the beginning, eases off after the first month.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 01, 2007",
            "review_content": "\nI liked Julie a lot as a person and she has an enthusiasm for the subject, and we had good discussions in class.  But she sometimes was intimidating because she seemed to be so into intellectualism. kind of very subtely, and not on purpose, made you feel stupid. tough grader.  my main problem with her was that I felt she didn't give thorough criticisms of your papers until she handed them back with the grades on them, before that you only got very broad criticisms.  she spent a lot of time helping you pick topics to write about, but she wasn't interested in fully critiqueing your papers until had to stick a grade on them. at which point it is too late for you.\nWorkload:\nin the beginning a lot, like 750-1200-ish word assignments (ungraded) in class every day but I guess that is just to terrify you because then it drops off to tiny ungraded assignments, like a paragraph due per class.  The usual UW paper assignments.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 28, 2006",
            "review_content": "\nI regret to say that Julie Sexeny is the worst Professor I have ever had for an English class. The work load in this class was heavy and pointless in most cases. It was a painful experience and I would strongly recomed  you to stay away from Prof. Sexeny if you want to learn something in UW.\nWorkload:\nHeavy\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 08, 2006",
            "review_content": "\nFirst off University Writing is something everyone has to take, so that means it is going to suck not matter what and feel like the biggest waste of tuition imaginable, but having taken Julie's class, I feel like the school needs give me my money back. She is the dumbest teacher I have ever encountered. She is nice, I will grant her that and she does extend the deadlines if you ask her, but her teaching style is so confusing and vague that it makes you want to rip your hair out at the thought of going to class. She separates herself from the class and talks down from her high intellectual perch, speaking in the most indistinguishable terms possible. When you ask her questions about her assignments or to clarify points of confusion, she has a tendency to repeat her self, word-for-word, over and over again, and afterwards you are still confused, but at this point it is useless to ask again, because it is like hitting the repeat button on a CD player. If you are a visual learner, who likes pictures to help clarify her theories on writing, donÂ’t take her, because she draws these abstract pictures on the board, with arrows and lines pointing somewhere and nowhere at the exact same time with out any reason or rhyme to them, that will make sense at the time, and when you look at them after class, they will mean absolutely nothing. If youÂ’re a person who needs specific examples to help you with her lessons, forget about it. When asked to give a helpful example she either doesnÂ’t have the capacity or doesnÂ’t have the desire to come up with an example.  Her class has been the biggest disappointment and most of the people that were in my class have agreed. I would not recommend taking her if you have the opportunity to choose.  I know they sometimes do not post the instructors names when you register so it will be like shooting blind. So if you get stuck with her for your teacher and canÂ’t get out, then my sympathies go out to you.\nWorkload:\nHeavier than most. Four major essays along with daily reading assignments, that ranges from 15 to 20 pages and one response per reading that range from 300 to 1200 words. At the beginning of the class the response length increased from 300 words the first day to 1200 words, and these are not graded by the way, leading up to the first graded essay. She is also a tough grader. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 11, 2006",
            "review_content": "\nIf you just got assigned Julie Sexeny as your UW teacher just know that YOU CAN DO BETTER!!!  True: she is a fine person and you will not do horribly but still why put yourself through that?  The initial HWs went from 250 to 500 to 750 to 900 to 1300 to 1500 words and then it cooled down.  It was hell in the beginning and then it was just pretty bad.  Our CCP and retrospective essays were due on the same day right before finals.  I never really got what she wanted and did not find the in-class-exercises helpful in developing my writing.  Overall, UW is a pointless course, but this class makes it harder than it should be.  \nWorkload:\nHeavier than most.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 30, 2005",
            "review_content": "\nWhile Julie's a great person, her teaching isn't necessarily the greatest. Generous with the deadlines - if you talk to her first and have a genuine problem. Listens to student input...but assigns more homework than most and grades a little harder than avg. On the whole - stick with it - you could do worse.\nWorkload:\nFour major papers plus readings and daily assignments (300-800 words)\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 15, 2005",
            "review_content": "\nJulie is a decent teacher.  She was a real bitch at the beginning of the year as she dished out 600 word responses to every 30+ page reading assignment nightly.  It was a drag, but if you start out well in this class, the rest of the semester is smooth sailing.  Make a good impression, see her during her office hours, and woo her a little bit and you're in. \nWorkload:\nlotttts of response papers, long ones too, in the beginning.  lightens up a lot towards end\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 17, 2004",
            "review_content": "\nA good teacher. Although this semester was her first shot, she did a good job. She is approachable, nice and above all, understanding (she can extend deadlines, for example). You should definetely consider taking her class.\nWorkload:\nMedium. 4 long essays (around 2000 words). Exercises&readings; for every class (takes a few hoursper assignment, but they are generally interesting).\n"
        }
    ]
}