{
    "prof_info": [
        {
            "prof_name": "Kelly De Luca",
            "prof_id": 2784,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 11, 2007",
            "review_content": "\nMs. De Luca (she wouldn't let students refer to her as Kelly) led me to hate my first semester of CC.  While some of friends were glowing about their professors and how much they looked forward to going to class, I sat in Butler reading about Queenships.  QUEENSHIPS!! \nIn class, her response was limited to a nod and a weird grin.  I could go on for longer, but my advice is just to avoid her.  It won't be a rewarding experience, let alone a pleasant one.\nWorkload:\nAbnormally large: 3 papers (4-6, 6-8, 8-10), discussion questions for every class, more reading that other classes, and harshly graded exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 09, 2007",
            "review_content": "\nThere were goods and bads about this instructor, but, for me at least, the bads outweighed the goods. On the bright side, she's very good in class--she directs class well, so you don't feel like you're wasting your time. Unfortunately, outside of class, I have fewer positive things to say. I thought the workload was much heavier than most other CC sections. The paper topics are very broad, and that makes them extremely difficult to write. The same goes for essay questions and short answers on exams: she wants you to include all the things pertaining to the question asked rather than taking one aspect and going in depth into it. It's a tall order in an essay written in 40 minutes (on the exams) to include all the things she wants and to synthesize them with a thesis. The course is designed to have a heavy workload, but I think some of the choices she made within the boundaries made the course unneccessarily difficult; for example, the final paper was 8-10 pages, and we had to use at least five sources significantly. The grades on assignments always came back a little lower than expected too. If you feel you worked hard enough for an A-, you'll probably get a B; if you thought it was going to be an A, it'll probably be a B+; at least that was my impression. It could have been a lot worse, but then again, it could have been a lot better too.\nWorkload:\nThree papers (4-6, 6-8, and 8-10 pages respectively), a midterm, a final, and you have to send her three discussion questions (not the answers, just questions) by 9 PM the night before class. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 06, 2007",
            "review_content": "\nMs. De Luca is definitely not for everyone.  As a history graduate student, she tends to give a lot of historical context .. way more than is necessary.  Philosophy is not her strongest point and as a previous reviewer mentioned, the discussions aren't always highly intelligent.  However, she does manage to make the main points of each of the works clear and she is very specific about what we need to know about each text.  The thing to really consider with Kelly is that it is very very difficult to do well - as in there were probably only a couple students above a B+.  She is very picky when she grades the papers .. she expects \"formal language\" and perfect punctuation to an incredible degree.  That means its not impossible to do well, but she makes it incredibly difficult.  Additionally, she requires 3 discussion questions are submitted before each class which go towards your participation grade .. and she gives you a participation grade for each class (though she doesn't share them with you).  Essentially to get a good grade you have to do most of the reading, submit the disc q's, participate in class, and write near perfect papers.  Not impossible, but not easy either.  She definetely makes you work for an A.\nWorkload:\n3 discussion q's per class submitted by 9pm the night before, 3 papers (3-5, 5-7, 8-10 pgs), midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 20, 2006",
            "review_content": "\nDeLuca herself is very smart and funny once you get to know her.  Our class got along really well and it made for enjoyable 9 am classes.  Here's the bottom line: this section is not for people expecting an easy A in CC--she is a very tough grader.  The average grade on the first paper was a B-.  But don't freak out too much, because after she assigns the papers, she offers to read outlines.  Consider this a requirement, not an offer. Talk with her in office hours, e-mail her with your outline and thesis, and she will be very helpful.  Writing papers that she likes takes some getting used to, so use all of the help she's willing to give you.  She wants very well-written papers, and she gave the class two extensions on the second paper so that we'd have the time for that.  This class was much more fun once I stopped caring about the fact that I wasn't getting an A.\nWorkload:\nMore than the average CC class, from what I hear.  A lot of extra assigned readings, and 3 discussion questions e-mailed to her by 9:00 pm the night before class (and she is serious about that time).  3 Papers, Midterm, Final.  Don't expect an A or A-.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2006",
            "review_content": "\nThis teacher was terrible.  She was not meant to teach a philosophy class, but rather would excel at a monotonous history lecture.  If you enjoy boring discussions where every student has free range to give their uneducated and ignorant opinion than this is for you.  The discussion went no where, was never intelligent and I got completely nothing out of it.  She isn't able to direct discussion and NEVER talks about the text, but rather the context of which it was written in.  In class we never looked at the books and rather listened to a history lesson.  If you can do ANYTHING about it find another CC teacher, she grades hard and is anal about every detail of your paper up to commas and paragraph indentation.\nWorkload:\nRegular, 2 long essays and email responses everyday.  But if you participate in class and do the responses well, you will probably still do terrible if your essays aren't what she likes.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2006",
            "review_content": "\nMs. De Luca is a very competent instructor. From what I've heard concerning other CC professors, it seems to me that she's probably one of the best. She's not really warm or relaxed, especially at first, but once the ball gets rolling you'll discover she's very compassionate. She grades fairly and demands an average workload (email responses on each of the readings, 2 longer papers, 6 shorter response papers). If you're assigned to her section, you should probably stay in it. To clarify, slackers should probably avoid her, but reasonably diligent students should not be scared off by her self-portrayal as a stickler. I thoroughly enjoyed my time in her class. Discussion aren't particularly enlightening, as the students do most of the talking without much guidance from the expert, but Ms. De Luca's historical expertise is not to be missed. Whenever she introduces an author or a text, she imparts very interesting details and demonstrates an incredible mastery of the material. She encourages participation and has a very positive, supportive attitude.  \nWorkload:\nModerate; could be a lot worse. CC entails some pretty heavy reading, but Ms. De Luca makes the experience a fulfilling one. \n"
        }
    ]
}