{
    "prof_info": [
        {
            "prof_name": "Pablo Pinto",
            "prof_id": 3205,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Globalization and International Politics",
            "review_date": "January 16, 2012",
            "review_content": "\nThere are two types of students in Political Science and generally at Columbia. One type is heavy on gaining knowledge, reading a lot, digging deep into the subject, analyzing everything (cover pages of the assigned books included) and working really hard - without real concern for delivery or enjoyment of the class. If you fit into this category, Seminar with prof. Pinto is for you. And almost all people in class will be your type.\nIf, however, you happen to be the other type - a laid back student, not heavily concerned about uberanalytical approach, just wanting to learn a little bit and have a decent, interesting time in class - Seminar with prof. Pinto is not for you. You will not enjoy it not because he is a bad teacher or a bad scholar (he is excellent at both) but because of his very analytical, low-key personality. In simplest terms: he is the opposite of a showman, prof-magician, something I was looking for in a seminar.\nEither type you are, it is extremely unlikely you will end up with anything less than A-/B+ for the class.  \nWorkload:\nWeekly readings are long only if you want to do them all, pretty short if you want to do the minimum. Final paper is the biggest deal, mine was honestly quite lame but still got me a decent grade. Overall, very modest workload for a Seminar (and all classes should be like this, maybe Columbia would have less problems with drugs, then...)\n"
        },
        {
            "course_name": "International Politics Seminar: Globalization",
            "review_date": "June 12, 2008",
            "review_content": "\nProfessor Pinto is a really nice, laid-back guy. He's not great at lecturing, but I think his hands-off approach is perfect for guiding a seminar discussion (and he asks though-provoking questions when the discussion gets stalled). I also have no idea why everybody on here complained about his grading -- he clearly grades based on effort, so if you show up and show him you're trying, you'll be fine. Also, he's really helpful during office hours, so go talk to him about your seminar paper (which you can basically write on anything you want). Overally, he's a good guy and I'm glad I took the class.\nWorkload:\nYou really only have to do 1 reading a week, and there's a seminar paper (which can be as long or short as you want).\n"
        },
        {
            "course_name": "International Politics Seminar: Globalization",
            "review_date": "June 12, 2008",
            "review_content": "\nProfessor Pinto is a really nice, laid-back guy. He's not great at lecturing, but I think his hands-off approach is perfect for guiding a seminar discussion (and he asks though-provoking questions when the discussion gets stalled). I also have no idea why everybody on here complained about his grading -- he clearly grades based on effort, so if you show up and show him you're trying, you'll be fine. Also, he's really helpful during office hours, so go talk to him about your seminar paper (which you can basically write on anything you want). Overally, he's a good guy and I'm glad I took the class.\nWorkload:\nYou really only have to do 1 reading a week, and there's a seminar paper (which can be as long or short as you want).\n"
        },
        {
            "course_name": "Political Economy",
            "review_date": "November 14, 2007",
            "review_content": "\nAgree with the April '07 reviewer below. Nothing all too impressive. Regular fare for a poli sci seminar. Very stingy with the grades though. I got straight B-s and C+s. Guy next to me had similar marks.\n\nWorkload:\nNormal\n"
        },
        {
            "course_name": "International Politics Seminar: Political Economy of Trade and Investment",
            "review_date": "November 06, 2007",
            "review_content": "\nI completely disagree with the previous review. Pablo Pinto is a charming man and he deserves a credit just for keeping me awake at 9 in the morning. I would say that if you are Poli Sci major who is interested in Econ as well, this Seminar is your best option. Readings, despite being dense should not take you long. The key is not to read everything but to know basic points and methods about each article. \nYou would never be tested on them, but it is important that you have something to say in class (participation=25%!) Its too early into semester to judge his grading, but considering his comments on my first paper, I DO NOT EXPECT HIM TO BE THAT HARSH. He grades fairly and you get what you deserve. \nThe best part is coming to his office hours and I suggest you take advantage of it. It makes a huge difference to get to know him as a person since he looks much tougher in class than he really is. He is rather kind and warm. Just go and see for yourself. And make sure to check out the pics of his family. He has a beautiful wife and his kids are really cute. \n Last, but not least, Professor Pinto is very intelligent, and if you pay attention in class, you will definitely learn alot from his remarks. \n\nWorkload:\nWeekly readings (which you are not tested on. Just skim through them), seminar paper, two 3-5 page summaries of reading assingments, 2-3 page review of somebody else's paper. \n"
        },
        {
            "course_name": "International Politics Seminar: Political Economy of Trade and Investment",
            "review_date": "April 17, 2007",
            "review_content": "\nLots of work, sometimes interesting, other times boring. Not that impressive. Very typical- other than the grading, which is hell. This seminar will bust your GPA. \nWorkload:\nTypical seminar stuff. 20-25 pg paper. 20 min presentation. 1-2 pg critique of another student's paper right before class. Graded extremely harshly. \n"
        }
    ]
}