{
    "prof_info": [
        {
            "prof_name": "James Runsdorf",
            "prof_id": 2116,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Essay Writing",
            "review_date": "June 07, 2009",
            "review_content": "\nTo be honest, I am really surprised that Runsdorf has so many positive reviews. Yes, he is an incredibly nice man and helpful dean. Yes, you read The New Yorker i. And yes, he allows you to revise everything so it's an easy A. \nThat said, I wouldn't take the class again if I had the choice. I  thought it was painfully boring, and I wasn't the only one. Though I enjoyed reading the TNY articles, I didn't think I learned much in the class in general. If you are a non-native speaker or really struggling with writing, you might enjoy the course; otherwise, I would look elsewhere if you want to learn about writing and improve your own. As a relatively strong writer, I found that Runsdorf didn't particularly help me with my writing; also, class time was boring, and though it was a small class he didn't really creative an environment open to class discussion. All in all, I didn't particularly enjoy the experience or get much from it.\nThat said, he's nice and knowledgeable, and if he ever teaches a lecture, do that...but I would take this particular course with another prof (try Ellsberg or Wendy S.) \nWorkload:\nvery light reading, a short paper every week or so, and a longer research paper as a final. \n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "December 15, 2008",
            "review_content": "\nI s also a great source for recommendations, so make sure to speak up and establish a relationship with him in office hours.\nThat said, the class itself is incredibly boring.. Two hours of straight talk about punctuation and sentence structure will make you fall asleep, but the easy grade is worth it. Plus, if you pay attention, you might actually learn something.. \n\nWorkload:\nWeekly(ish) papers in different styles of writing (argument, compare/contrast, cause/effect, etc.) and final research paper (4-6 pg). All topics are yours to choose, which is totally awesome (I would do the papers the morning they were due).\n"
        },
        {
            "course_name": "Essay Writing",
            "review_date": "December 19, 2005",
            "review_content": "\nDean Runsdorf is an amazing professor. In class, he always brings up good points and he always has something to say which is good for a 9am class. He doesn't force participation which I love. Outside of the class, he was incredibly helpful with my writing, pointing out patterns of mistakes and suggesting many things-he even takes a look at papers not for his class if you   ask him. As the other reviewers said, he is really lenient with deadlines and he always allows rewrites. \nAn essay due each week (around 3 pages), reading (not heavy at all-a lot of it comes from the New Yorker magazine) and conferences outside of class to discuss your essays.\nWorkload:\nclass meets once a week (2 hours) an essay due each week (around 3 pages) and mandatory conference hours. \n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "December 14, 2004",
            "review_content": "\ni agree with the above reviewer. there won't be any sparks flying in this class, but is probably the least painful way to satisfy a lame requirement. most other profs assign 5 papers, each 5 pages for this class (sometimes 4 5 pagers and a 10 page research essay), but Runsdorf makes the papers only 3 pages. and as the semester goes on he gets very leniant about due dates. what more could you ask for? he does run this seminar like a lecture though, which is alright b/c he is pretty knowledgeable and most sophmore english major are not. pretty good syllabus too, once the semester gets going.  also, he's VERY available outside class (ie in the dean's office all day).\nWorkload:\n5 papers, 3 pages each. a novel a week w/ some critical articles.\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "May 24, 2004",
            "review_content": "\nEvery semester Runsdorf teaches Critical Writing, which is probably the least desireable position in the English dept. But he loves it. Honestly, this guy is a total sweetheart, obviously brilliant, and manages to make an otherwise shitty requirement for the English major really interesting. He's totally available outside of class, is very concerned about his students, and gives what I consider to be some of the best writing criticism I've encountered so far.\nDon't hesitate to take CW with him. Class is boring sometimes, but for the most part the syllabus is GREAT, the assignments are standard, and he's very flexible.\nWorkload:\nA LOT of reading and writing, but what did you expect? It's Critical Writing! Usually a slug for the English major but not too bad with Runsdorf. You also don't have to do all the reading to get by in his class.\n"
        }
    ]
}