{
    "prof_info": [
        {
            "prof_name": "Felicity Palmer",
            "prof_id": 1799,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 10, 2007",
            "review_content": "\nI feel like some of the reviews are unnecessarily harsh. While I certainly did not like Felicity, I felt that she was a good person and genuinely tried to help students. In terms of how she controlled the class, however, she was pretty bad. The class routinely got off topic, and we did not discuss important topics that other classes covered in detail. There were very few classes that I actually learned things that I could not have gotten from a cursory read of the texts. One or two people dominated class discussion, and she did not do anything to alleviate this problem.\nOutside of class, though, she was very helpful, especially when it came to paper writing. This is an easy class, but you don't really get much out of it.\n\nWorkload:\nNot bad. I read maybe one of the books and ended up with an A.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 14, 2006",
            "review_content": "\nShe's pretty bad, folks.  This is her first year teaching CC, and I'm pretty sure it will be her last.  In a class like CC where you speak of religion and other controversal areas it is essential to have an instructor who is willing to grade on the support given for a side of an argument rather than the stance taken on the argument itself.  I haven't even finished the class yet, but she is indeed exactly the opposite of the ideal CC instructor, and I wanted to let people know who are transferring into her class what they are getting themselves into.  I know that this applies to a lot of people because virtually all of us in the class now are transferring out, and therefore, she is going to have plenty of spots open in her class.  If you disagree with the argument she gives about the Bible, Aristole, Augustine, whatever, no matter how strong your support is, you'll get a bad grade.  And once she develops a dislike for you based on your opposite stance from hers, it doesn't go away.  It's clear who she hates by the way she seems to blatantly disrespect them.  Don't get me wrong.  There are a few kids she likes, but her choice of who she dislikes and likes does not seem to be based on anything substantial.  Overall, don't take this class, honestly.  Ask anybody in it, and we haven't even recieved our final grades yet.    \nWorkload:\nIt doesn't matter, folks.  She's pretty bad.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 14, 2006",
            "review_content": "\nCAUTION wit this professor.  Shes weird---EnOUgh SaID!\nNot only is she a strange person, her grading is cazy.  Not an easy grader at all, her comments don't justify her harsh grading either. The class is basically lead by the students and she just nodds her head and points to the next person.  there are those occational classes when she will bring up something provocative, but don't count on being blown away every class.    \nWorkload:\n2 papers 4-6pgs, midterm(seemed easy until i got the grade back), final, daily postings on reading.  May I repeat, she is freakish, and a Very HARD grader (her grading doesnt make sense)---STay AWAY if you can!\n"
        },
        {
            "course_name": "African Civilization",
            "review_date": "December 12, 2004",
            "review_content": "\nI have to disagree with the previous negative reviews about Ms. Palmer.  I thought she was a great instructor.  She was very nice and very approachable.  There is a lot of reading and some of it can be a little dry but Ms. Palmer trys to make it as interesting as she can.  This is really a pretty easy course at columbia.  Much of the class is summarizing the readings so if you do at least part of the reading for the class you should have something to contribute.  I would suggest this course for a major cultures class and anyone at all interested in Africa.  There is also a weekly visual hour where we watched movies or heard lectures. This actually was my favorite part of the course because you could sit back and take it in without having to really think.\nWorkload:\nAverage.  A lot of reading.  Take home midterm, 8 page paper and a final.  \n"
        },
        {
            "course_name": "African Civilization",
            "review_date": "November 07, 2004",
            "review_content": "\nMs. Palmer is the best grad-student instructor that I've had at Columbia. She knows what she's talking about and tries to make class discussions engaging. This doesn't work very long though b/c after the first 2 weeks of class, the readings get really long and boring. Try to say something even though you don't do the reading b/c for some reason she takes it personally when nobody reads. The midterm was EXTREMELY easy because she tells you what readings to focus on and tells you the themes that will be covered.\nWorkload:\n3-page paper, midterm, [also an 8-page paper that was optional and cancelled final b/c of the strike]\n"
        },
        {
            "course_name": "African Civilization",
            "review_date": "January 20, 2004",
            "review_content": "\nProfessor Palmer can be very condesending.  The class is organized and straight-forward but she makes the class a drag to attend.  Her assignments are not that hard.  But her grading on midterms and Finals are unjustified.  I suppose I'd reccomend this class for your Major Culture requirement., but I suggest you learn how to get into her head because that's the only way she'll give you a good grade.\nWorkload:\nLengthy readings,1 Midterm and a final.  2 papers one 3-4 p the other 8-10.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 18, 2003",
            "review_content": "\nNot bad, especially considering the course was L and R.   She wasn't such a great discussion leader but did raise interesting points and her assignment were actually pretty stimulating, especially considering the horror stories about L and R papers.  And she had my back when I ragged on this kid for being pretentious.\nWorkload:\nFairly normal L and R load.  However--assignments being her strong point-she deviated from the one-per-class essay structure after only about three or four weeks and then changed the format to longer and sometimes research-based weekly papers.  \n"
        }
    ]
}