{
    "prof_info": [
        {
            "prof_name": "Richard Davis",
            "prof_id": 3441,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "December 24, 2012",
            "review_content": "\nAs an undergraduate who took this class for practical reasons, I can say this: if you are not excellent at either statistics or rigorous math, expect a low grade in Davis' class (in the B/B+ range if you work hard). This is particularly painful because it's a six-credit class. That being said, if what is important to you is to understand the material thoroughly, and you're willing to suffer a little and get a low grade- take this class. \nProf. Davis is an excellent lecturer. He teaches more or less out of the book, but is very clear and his examples are great. He also covers an unimaginable amount of material- partly by filling every minute of his three-hour lectures, and often going 5-10 minutes overtime (which can be exasperating, but I appreciate the fact that he's giving his students their money's worth). So after this class, you'll definitely feel that you've learned a ton. \nIt should also be said that Prof. Davis is very nice and approachable. He has a kind of dry humor that may sound like a put-down, but he really wants his students to do well and was open to ideas. \nIn this section (not sure if this is always true), indeed the vast majority (around 65/70 I'd estimate) were grad students in statistics, which definitely threw off the curve and made it very hard to get anywhere near the average on tests (not to mention homeworks, where the average was probably in the high 90s). So you're really on your own in this class: you can't count on the curve. The curve itself is generous- I think the lower bound for the class is a B-, even with horrendous scores- but the effect is to more or less set you in the B range. \nHomeworks were due every class, which was very difficult for the Thursday class. Usually the homework was around 30% easy questions, 30% straightforward but needs some working out, and 30% hard. If you go to the TA's office hours, though, you shold be able to do it all. \nThe midterms and final were very tough, but more because the material is hard than due to Prof. Davis' own questions, which often relied on things straight out of the book.\nOne final note on the TA, Diego: He is amazing, really the perfect TA. He was unbelievably helpful, often answering questions by email and once discussing something over his lunch break. He knows the material back and forth and always tries to make sure you understand the process. He's nice and also gives tips for how to do well in the class. No matter what course you take, if Diego's the TA- it's your gain. \nWorkload:\n20% HW for every class, difficult to do perfectly but not unreasonable or overly time-consuming. \n20% each for two midterms: very tough, but if you know the problems from the book it doesn't have to be too bad. \n40% final: wasn't too bad, but it covered so much material it was impossible to be on top of everything. \n"
        },
        {
            "course_name": "Probability and Statistical Inference",
            "review_date": "December 21, 2012",
            "review_content": "\nhI recommend taking this class with Professor Davis only if you are a master's student in the statistics department.  The class is comprised almost entirely of master's students from China, which meant all the communication between the students in the classroom was in Chinese.  It was class that this wasn't their first course in probability and statistics, despite this course not having any probability or statistics prerequisite, and this made the course very stressful for the few of us who were trying to learn the material for the first time.  \nLectures for this class went from 6:10 - 8:55 on Tuesdays and Thursdays, but Professor Davis usually ran about 10 minutes overtime.  At the beginning of the semester, the lectures were completely understandable for students who didn't have background in the subject, as the material we covered at the beginning was simple enough: axiomatic probability, counting methods, conditional probability and Bayes' Theorem, continuous and discrete random variables ,and expectation.  These were more or less the topics covered before the first midterm.  The homework, which came straight out of the book for the entire semester, was very simplistic, with at least half the problems being silly and pointless one line computations.  In other words, there really didn't seem like there was anything to worry about.  Homework was assigned and due every lecture, but it wasn't challenging enough to concern anybody.  That being said, almost everybody received 100 on every homework, so the only way homework could impact your grade was negatively (by getting less than 100).\nThen came the first midterm, which he said he was writing to take 90 minutes, though we would have the entire class period to eliminate time-pressure.  Most found the exam quite challenging and long, with 8 problems, each of which consisted of 3 to 5 parts.  Not a single student finished in 90 minutes; in fact, the entire class sat for the entire class period, and many of us still felt pressed for time.  Before he handed back the exam, he tried to reassure us by telling us that grading is relatively generous for master's level courses.  The exam statistics were a bit surprising: out of 130 points, the mean was a 97, the median was a 104, and the standard deviation was a 23.  He drew the distribution on the board, and said that the cutoff for an A- would be around 115.  It was clear at this point that the exam statistics were inflated by students who had significant background in the subject.\nAfter this midterm, the class got a lot harder.  It was once we finished probability with the multivariate normal distribution, the law of large numbers, and the central limit theorem that I began to feel concerned.  There were times during lecture when he'd say \"I'm going to do this proof for fun, although I don't think most of you know the math that is needed to understand it.\"  Examples became increasingly sparse in the lectures.  Then we started the statistics portion of the course, and it seemed that it was going to remain this difficult for the remainder of the semester.  The last lecture before the second midterm was on the Rao-Blackwell Theorem, and he did two examples of it, each one taking him 45 minutes to complete.  Then he assigned a homework over fall break due the day of the exam, that he said was important to complete before taking the exam.  This was probably the most challenging homework all semester, and it turned out that the second exam was heavily based on the concepts from that homework assignment.  The second exam was significantly more challenging than the first exam.  There were five problems, two of which were reasonably straightforward, and the others were extremely difficult.  It took him two hours just to go over the solutions to the exam, and it took everyone the full three hours to complete.  This time, out of 100 points, the mean and median were 63, and the standard deviation was 23.  The distribution showed that nobody was on the same page in this class; some students scored in the 30s and others scored as high as 98.  He said that the cutoff for an A- on this exam would be around an 80.\nUltimately, I feel that Professor Davis made this class a lot harder than it needed to be.  It would've been more bearable if we didn't have to go into the exams blindly (when students requested a practice exam, he suggested doing problems out of the book).  His tendency to try to squeeze difficult results and proofs into the last minutes of lecture (and inevitably run over) was irritating, as lecture lasted long enough as it was.  Finally, he often was presumptuous about what we had learned in previous probability and statistics classes, which was really unfortunate for those of us who hadn't taken any probability or statistics before this class.  While the syllabus said that no background was required, the instructor occasionally appeared shocked when students didn't know elementary results that we \"should've learned in Kindergarten.\"\n\nWorkload:\nThe grade was computed as follows: \n20% Homework  - The great majority of the class gets 100% on every assignment, so not getting perfect scores will negatively impact your grade in the class.\n20% Midterm 1, 20% Midterm 2, 40% Final Exam - The different weights on the midterms and the final was strange because they all were three hour exams.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 17, 2008",
            "review_content": "\nIntroduction to Statistics is not the sort of class that a stellar professor can make stellar. At best he can make it tolerable. Prof. Davis was the latter sort. He gave boring lectures punctuated by awkward and sweet-in-a-nerdy-way jokes and test that were just a tad too easy.\nHe's probably the best you're going to do, but skip class anyway and read the book instead.\nPut every equation in the book on your cheat sheet. Trust me.\nWorkload:\n10 problems in a problem set per week.Two midterms, both pretty easy.Final: Somewhat more difficult + longer.\n"
        }
    ]
}