{
    "prof_info": [
        {
            "prof_name": "Dmitri Glinski",
            "prof_id": 2476,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Politics of Religion in Post Soviet States",
            "review_date": "July 12, 2006",
            "review_content": "\nAt the Graduate School of Arts and Sciences, Professor Dmitri Glinski taught the seminar Politics of Religion in Post Soviet States. \nProfessor Glinski approached the transformation process in the post soviet space from an angle that is usually neglected by political science. The course touches mainly Russian, but also Ukrainian and Central Asian, history, culture and political systems in order to show the importance and depth the politics of religion. This is not a course about spirit or believe but really about politics. Thanks to this course my picture of the post soviet states has gained an important faccette.\nProfessor Glinski is very helpful when it comes to writing papers or doing research. This is defenitely neccessary, since most students have not touched this particular topic before. His lectures/monologes might be a little confusing at times. Class participation will maintain coherence in class discussion.\nI highly recommend this class.\nWorkload:\nNot too much reading, two papers of 10-15 pages each, and an in class exam at the end of the semester. Defenitely doable.\n"
        },
        {
            "course_name": "Revolutions in Eurasia: 1989-1991",
            "review_date": "June 15, 2005",
            "review_content": "\nTo his credit, Glinski knows an incredible amount of info on eastern europe and has so much to offer--he is like a walking-talking library and this class is concerned with many facts and details about the conditions for revolution.  And Glinski seens like a nice guy and very passionate about the subject. That said, the man is the WORST LECTURER you will ever encounter. He stares down at the floor or up at the ceiling, mutters at a low volume almost to himself, and on top of that, has a really thick incomprehensible accent. \nAnd his lectures have no structure or orgainzation whatsoever. Even tho there is a \"theme\" given on the syllabus for each class, he rarely sticks to it, instead rambling from some key date in Bulgarian historty to some protest movement in Kyrgyztan to religious conditions in 20th century Poland, all in one sentence. Make sure to bring plenty of paper for doodling, but be warned that he occasioanlly calls on people in class and can get annoyed if you haven't been paying attention to his mumbling. \nWorkload:\nA lot of readings, but many of  them are interesting, plus 3 papers ranging from brief (4 pgs.) to term paper-length.\n"
        },
        {
            "course_name": "Russian and the World",
            "review_date": "March 22, 2005",
            "review_content": "\nInteresting and fun class, although sometimes a lot of writing. The professor is extremely knowledgeable about the topic and is ready to answer questions. Has brought a lot of personal experience into the lectures.  \nWorkload:\nMedium to Difficult. There is a significant ammount of reading, but it is easy. The assignments are creative and thought provacative, very engaging.\n"
        }
    ]
}