{
    "prof_info": [
        {
            "prof_name": "Edward Leonard",
            "prof_id": 466,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Reactor Kinetics and Reactor Design",
            "review_date": "September 16, 2010",
            "review_content": "\nThe review below tells you everything you need to know. But since Leonard put me and others through one of the worst courses ever, I feel justified in saying the following:\nLeonard could very well be the worst professor in the entire world, and I am not joking at all. His teaching style of rambling and randomly calling on students is garbage, to put it politely. We had a test with an average of like 15/100. I just hope that such low scores make Leonard feel better about himself.\nLeonard gives Chemical Engineering a bad name, and to me, he's just an angry person who needed guidance a LONG time ago.\n\nWorkload:\n3 midterms, final, and homework that was not graded.\n"
        },
        {
            "course_name": "Reactor Kinetics and Reactor Design",
            "review_date": "May 23, 2009",
            "review_content": "\nJust to give you a warning since if you are reading this review, you probably don't have a choice whether or not to take this course.\nThis was the final grade distribution:\n1A, 2A-, 3B+, 6B, 6B-, 5C+, 7C, 4C-, 1D, 2F, and 1 INC\nHappy studying.\nWorkload:\nWeekly homeworks didn't get figured into your grade but if you didn't do at least 70% satisfactorily, you would get an incomplete for the course.  The three exams during the semester make up 50% of your grade while the final makes up the remaining 50%.\n"
        },
        {
            "course_name": "Transport I",
            "review_date": "August 31, 2006",
            "review_content": "\nThere was definitely more than 1 A in the Fall 2005 Transport I class.  \n"
        },
        {
            "course_name": "Transport I",
            "review_date": "April 01, 2006",
            "review_content": "\ni thought he was actually pretty good. it took me a while to get used to his style which i found to be basically understanding the required sections in bird (the book) very well. i don't know about the truth of that one A in the whole class bit as one review said below. just get used to his style (i.e. the book), and the class may be pretty straight forward.\n"
        },
        {
            "course_name": "Biological Transport and Rate Processes BME 3500",
            "review_date": "March 21, 2006",
            "review_content": "\nA lot of the other reviews complain that Leonard doesn't teach anything, Leonard wastes time, Leonard's lectures are useless. That's not true. These people are just so engrained with the idea that teaching entails a professor spitting out equations onto a board for students to regurgitate that when they encounter anything else they complain it is crappy teaching. That being said, Leonard's teaching style is not necessarily better, it is just different. Leonard will stand for 1 hr and 15 minutes and repeat to you that shear stress is proportional to shear rate, that shear stress tau = viscosity *dv/dy, but he will not apply it for you in lecture, he lectures entirely abstractly. He is also very long winded, and if you stop paying attention to him for a split second you will be lost for the next ten minutes. The applications that he expects you to make will appear on his hw, which is unbelieveably hard and you usually won't know what to do, but push him to provide solutions and he will do so, and you will understand what he expects you to do on a test. \n   You have to put in a huge amount of work studying on your own and thinking through these problems. Leonard is not for the mediocre student, no matter how hard working; fluid mechanics is tough enough and his style of not providing concrete examples with accompanying mathematics requires you to do much of the logical connecting on your own. \n   If you can deal with this, Leonard is actually amazingly intelligent, and sometimes can be very funny. More importantly, you will learn abstract concepts rather than useless equations that you will forget by the next test. \nWorkload:\n3 small midterms, the midterms are like a couple parts of one problem, hw but not checked. Bug him for answer solutions.\nHowever, the true workload is very very high, you need to put in a lot of time. \n"
        },
        {
            "course_name": "Transport Phenomena I",
            "review_date": "December 17, 2005",
            "review_content": "\nIf you are taking this class, you are a ChemE required to take it. The material is fairly interesting, however it is sad and unfortunate that Prof. Leonard is teaching the class. He is the worst Professor I have ever seen. His lectures are less than useless, he does not test the material and more over he prides himself in being unfair. He gives 1 A for a class of 42. One A. Thats all, and the grading is unreasonable. He gave a test that he graded and the average was a 19...then he says we are not working hard enough. He isn't working hard enough. He comes to class unprepared to lecture and prepared to waste everyone's time. He does not teach the material. There are too many ways to hate this Professor, so I will stop. If you have a choice not to take his class, don't. If you are a CHEME, welcome to the world of a poor education. \nWorkload:\nMinimal, the material is hard so you have to work on your own, but Leonard requires you to take some tests thats all.\n"
        },
        {
            "course_name": "Transport Phenomena I",
            "review_date": "November 01, 2005",
            "review_content": "\nI can see where the other reviewers' perspectives are coming from - he is quite an interesting character, inserting little jokes in the lectures and whatnot, calling on students...the bottomline is, the material is tough and intense, BUT he doesn't make it any better or easier (in a good? bad? way)\nFirst, there is essentially no class. The class IS the book (which he seems to love so much). His lectures, though amusing, are rarely informative - he merely points out different concepts from the book or problems. It's one of those lectures where you listen attentively for 30 minutes, and then wonder what the heck just happened because the important points he talked about could have been said in like 10 minutes. The book is really great though. The TA recitation sections are also really helpful (go over the homework) and I feel that the recitation should be the lecture instead! An improvement on the lecture time would be going over concrete examples (a walkthrough).\nThe tests are very unreasonable. First, 40 minutes for a test that should have a more appropriate time of at least an hour (full class period would be best). And then he likes to give a lecture, RIGHT AFTER the test??? I'm really not sure where he gets this idea from, because the effectiveness is very very low. I'd rather have a longer lecture time on some other day, that would be more effective. \nSecond, I have no idea what he is testing with his tests, and they are not consistent at all. \nI would like to see this format: 1 question is a basic, definition question that can be answered in under a minute or two (components of Tij, etc.). 1 or 2 questions are straightforward problems like from the homework (maybe 1 level A, 1 level B). last question is a difficult question that would require you to think creatively. and, you would be given the full class time to do this test.\nthis way, maybe the class averages would be more reasonable and indicative of your knowledge (70's?) rather than the way it is now with averages in the 20's. \nSummary: interesting character, un-helpful lectures, helpful recitations, good book, poor test design\nWorkload:\ntests, final, hw (not graded)\n"
        },
        {
            "course_name": "Transport Phenomena I",
            "review_date": "December 29, 2004",
            "review_content": "\nI absolutely LOVE prof. Leonard. You have to be willing to work hard, pay close attention in class, and see things in a very unique way to succeed in this class, but it definitely can be done. He picks his favorites at the beginning of class and often preys on those who sit in the back and come in late. Overall, he is a GREAT guy and more importantly an amazing teacher.......you should feel lucky to take this class. \nWorkload:\nintense, this class should be a priority or you will get a C\n"
        },
        {
            "course_name": "E3120 Transport Phenomena II",
            "review_date": "December 31, 1999",
            "review_content": "\nEd Leonard is perhaps the quirkiest guy in the chemical engineering department. He's been at Columbia since around 1962, but he isn't the stereotypical \"old gruffy professor who hates his students\". He shows a great enthusiasm for the material he teaches, he has a great rapport with all his students, and he's a really nice guy in general. As a Chem. E. student, though, you either love him or you hate him. I don't understand the students who dislike him, though. He's the only professor in the department who will ask questions about the material to random students during the lectures. A lot of people didn't like this, but it helps keep you on your toes. He especially likes to \"pick on\" 4 or 5 students every semester, and call on them for a disproportionate amount of the questions. If the student is having trouble answering his question, he has a hilarious habit of subtly suggesting the answer with cheesy puns. Something along the lines of: \"What is this equation useful for measuring? .... You don't know, what are you, DENSE?\". Of course, the answer would be Density. He seemingly has a pun for almost every question he asks. It's laugh-out-loud funny, believe me. There's plenty of other humor in his classes, and he'll sometimes stop and tell humorous stories that relate to the material. Tests were hard, but Leonard will curve generously. First midterm had a mean around 50, while the second had a mean of only 19 (!!). Leonard was nice enough to re-do that exam, changing only the numbers. So the mean on the \"make-up\" 2nd midterm was much higher. The average grade in the class was about a B. I wasn't one of the students he \"picked on\" (I only had to answer about 3 questions the whole semester), and I found that Leonard made me look forward to class, a feat hard to perform by a professor in a Chemical Engineering class. Because of Leonard, Transport Phenomena II was a really enjoyable course.\nWorkload:\nShort 10-minute quizzes here and there, about 8 over the semester. Occasional problem sets, not that bad. Two midterms (see above) and one final.\n"
        }
    ]
}