{
    "prof_info": [
        {
            "prof_name": "Carlos Alonso",
            "prof_id": 2987,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Theories of Latin American Culture",
            "review_date": "September 10, 2007",
            "review_content": "\nI have the most profound respect for his mind and his words. His verbal performance in class is breath-defying. You will be challenged as never before, and you will be so much better for it.\nIt's a great deal of work, but no other class in grad school has felt as worthwhile as his. If you take his class, you should try hard as hell to not be intimidated. Work hard, be bold and he'll appreciate it. A hugely significant part of grad school is learning to share your ideas, and if you can manage to do so in his classes, you're golden.\nA couple of students panicked, and I think their energy brought down the class. His way of dealing with people who shouldn't be in the program is to let them fail out. It seems harsh, and I myself am committed to a different pedagogy, but I find myself agreeing with him on this issue.\nWorkload:\ntypical for a grad class and very do-able if you don't allow yourself to get emotionally overwhelmed.\n"
        },
        {
            "course_name": "Theories of Latin American Culture",
            "review_date": "May 20, 2007",
            "review_content": "\nHe has a powerful and brilliant mind, and he doesn't teach down to people. Be prepared to work, be prepared to be challenged. It can be rough going; this is not a velvet-lined class, and no class with him is. But they're the type of classes that will stay with you forever. You'll want to bang your head against something at one point, but he'll still be making you think ten years from now. I think he's taught more than any other teacher I've had.\nIf you take a class with him, don't freak out. The few people who freaked out couldn't think or keep up because they were full of fear and resentment. Take the challenges in stride, relish the rigor, work hard, and you'll do well.\n\nWorkload:\nOccasional 1-2pp commentaries read and critiqued in class, a final take-home exam or essay\n"
        },
        {
            "course_name": "Theories of Latin American Culture",
            "review_date": "May 20, 2007",
            "review_content": "\nHe has a powerful and brilliant mind, and he doesn't teach down to people. Be prepared to work, be prepared to be challenged. It can be rough going; this is not a velvet-lined class, and no class with him is. But they're the type of classes that will stay with you forever. You'll want to bang your head against something at one point, but he'll still be making you think ten years from now. I think he's taught more than any other teacher I've had.\nIf you take a class with him, don't freak out. The few people who freaked out couldn't think or keep up because they were full of fear and resentment. Take the challenges in stride, relish the rigor, work hard, and you'll do well.\n\nWorkload:\nOccasional 1-2pp commentaries read and critiqued in class, a final take-home exam or essay\n"
        },
        {
            "course_name": "Lit/Cultural Theory",
            "review_date": "August 15, 2006",
            "review_content": "\nHe is an intelligent, knowledgable man, and his classes are very straightforward. He gave succint summaries of complicated ideas in this introductory course and helped graduate students learn some of what they need to know to thrive in academia. He connected what we learned to the world outside of the ivory tower and initiated an interrogation of the boundaries between them. Future academics should look to him as a model intellectual and know that he has a lot of guidance to give. I highly recommend his classes to all graduate students, especially those in the Spanish department.\nBecause most people seem intimidated (probably not by his person so much as by his reputation), there wasn't a huge amount of discussion. If you're a complete moron, and happen to be aware of it, don't speak too much in his class. He will tolerate you, but everybody else will be cringing. If you've done the reading and thought about it, you should speak in class; he'll respect you for it, even if your thinking is a bit flawed. His reputation for running a tight ship is warranted, but he's not cruel or unfair. He takes his responsibility as an educator seriously, and he has a commendable vision for the department. His door is always open; don't be afraid to go to him if you have any lingering questions or comments after class.\nWorkload:\nIt's very reasonable. There's a fair amount of reading--but it's all stuff you should read, an in-class presentation, and a take-home essay.\n"
        }
    ]
}