{
    "prof_info": [
        {
            "prof_name": "Loren-Paul Caplin",
            "prof_id": 1918,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Screenwriting Workshop",
            "review_date": "March 06, 2005",
            "review_content": "\nBy far the best writing teacher I had during my three years at CU, Caplin taught me more about developing a structurally and creatively sound storyline, replete with effective dialogue, solid themes, and believable characters, than all of my other 7 writing teachers did combined. Conceptualizing a story before you begin to write (those who say \"Oh, I just start to write and see what happens\" rooted themselves out all on their own and were revealed as uninformed and ineffective writers) is what Caplin preaches and my writing improved by leaps and bounds for this simple, but rarely heeded, philosophy. He is also a pisser in class and has the unusual knack for relating to everyone, which is sadly uncommon among faculty in general. Great teacher. Great class. How often do you get both?\nWorkload:\nI wouldn't consider assignments for a class like this work.\n"
        },
        {
            "course_name": "Filmwriting Workshop",
            "review_date": "April 06, 2002",
            "review_content": "\nHaving taken all the screenwriting courses in the Film and Writing depts., the only professor who has ANY CLUE of what's going on is Caplan, which is a sad comment for the Film dept.. Caplan is like a surgeon who with a fine scalpel shows you how a film works using his unique presentation of the beat chart. for the first semester of the course (and second, which will be mentioned later). By the end of the semester you will be able to take apart any film you watch, and know what is working and what isn't, and why! - - without all the guessing that everyone else does (Including some of those Film Dept. \"experts\"). The second semester (this is a year long committment) you start writing your film based on a \"beat sheet\" started at the end of the first semester. You should then be able to scrutinize why your script works in some beats and why not in others. Caplan is not one of those teachers who gives you his spiel and then says: Go write 30 pages - - he shows you why that is b.s.. Caplan refuses to write your script. Instead, using his technique in class, your are forced to evaluate why a scene is not working, and from there make the necessary changes. The best thing about Caplan is that he is not some academic freak. He has no professorial airs like many of the film deptartment teachers who are mesmerized by their own voices and gravity of being. Instead, he is a mentor, who gives each and every student all that he has. Moreover, his classes are three hours, not two. That extra hour is his time!\nWorkload:\nThe workload may not seem to be heavy, but if you don't take the time to watch and analyze the films for each week 's HW assignment - - using his technique - - you will learn absolutley nothing. and will be lost - - and you will feel it it as well. ...\n"
        }
    ]
}