{
    "prof_info": [
        {
            "prof_name": "Alan Gabbey",
            "prof_id": 2192,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "January 03, 2011",
            "review_content": "\nI expect that Gabbey gets mediocre reviews because the majority of philosophy students find the subject interesting to an extent in itself, but rely on professors to make it magical. Gabbey won't be performing any magic. If you're the type of individual who can be made to love philosophy, and you're looking for teachers who will create that fascination in your upper level classes, I might recommend Vogt, the Kitchers, or Bell, among others. And indeed, I wouldn't recommend Gabbey. To repeat most of the reviews on here, he is not a dynamic teacher as \"dynamic\" is traditionally conceived. If that's what you're looking for, you will be bored nearly to death in this class, and while you'll probably still be able to pull off a decent grade if you're quite smart, you'll get relatively little out of the experience.\nHowever, if you find philosophy to be extremely interesting in itself, and are taking this class with the priority of advancing your own knowledge, ideas, writing, and capacity to understand extraordinarily important and complex material, I would recommend Alan Gabbey more highly than any other professor. This man's understanding of early modern philosophy is unsurpassed. He is a scholar in the field, and he is more than willing to share his understandings with his students. You have the potential to gain as much as you want in this class. \nFar too often, I find that Columbia philo professors aren't really listening to students' questions or genuinely responding to the concerns brought up in their papers. Professors often think they know what a student is asking before the student has asked it, for instance, and the professors often aren't quite right. They read papers closely enough to bring up general objections, but not closely enough to acknowledge that the student has already addressed those objections either explicitly or implicitly. I'm certainly not saying that the professors cannot understand what what the student is saying, and I'm sure that most of what the students are saying, given their levels, can be reduced to something completely basic or blatantly misguided. Furthermore, I'm clearly speaking from my own subjective experience. But nevertheless, it's rare that my deeper concerns are ever acknowledged or examined in a way that allows me to understand exactly WHY they're basic or misguided - so I rarely find that my concerns have been addressed in a way that renders them no longer concerns. I think alot of philo students feel this way, and I think that sucks. It's frustrating and discouraging, and sometimes leads me to feel like philosophy is less about pursuing truth than impressing others with seeming-brilliance.\nProfessor Gabbey is above these criticisms. When a question is asked in class, he does not try to reduce the question to something simpler before the student has fully explained what the question is. He does not give general objections, or focus on that which is most fascinating for the most students. He moves slowly and accurately through the material, assuming that you have read it yourself, and are frankly above needing to be fascinated by it. I've always felt that Gabbey teaches to those of us who are looking for the most complete understanding of of the material, rather than to those of us who are looking for the easiest or most interesting way to understand it. He stands against reduction especially. Do not think that you'll be able to come into this class and get away with saying that any parts of Spinoza, Liebniz, or Descartes are \"basically the same.\" And if you ever do, you had better be prepared to defend yourself against a very deep, intricate, and involved explanation for why that stance is indefensible. This class is about learning intricacies and complexities, and that's rarely fast, fun, or easy when done right.\nAdditionally, if you're looking for generalized comments or \"good job!\" in response to your papers, look elsewhere. Gabbey will analyze your papers deeply, giving extremely thoughtful feedback and thinking very seriously about what will make you a better philosopher. Don't expect to be directly encouraged with kind comments, and don't expect to treated in a special way in class if you make lots of good comments; Gabbey answers and responds to all his students - both the ones who proved themselves to be quite good and the ones who proved themselves to be quite questionable - in the same ways. But this is not to say that Gabbey is not extremely kind! If you reach out to him, he will help you immensely. He will give you real help on papers both before and after you turn them in. Not only will he advise you about additional things to read in preparation for your specific paper topics if you let him know what the topic is, but he'll give you a solid amount of real feedback as well. He is also extremely nice about deadlines and absences, and isn't a terribly hard grader. You might receive a page an a half of typed comments outlining all the issues with your paper and still receive an A or A- on the work. \nI think Gabbey most rewards ambitious philosophy, but also seriously criticizes ambition which fails to acknowledge the depth and complexity of the issues involved. And in turn, I found this class to empower both my philosophical ambitiousness and my understandings of the depths of metaphysics. Gabbey is certainly my favorite professor thus far, although I understand why many wouldn't regard him in this way. But for those who are genuinely interested in philosophy, I recommend Gabbey most highly. You can expect to learn from a true master in the field of early modern philosophy, and someone who takes a very quiet but very real interest in you. Gabbey will take you seriously as a philosopher, and he will take your philosophy seriously. In turn, if you take this class to be a philosopher in some sense, and that is your true motivating reason, I think you'll gain more from Gabbey than you could have possibly hoped. But if you're in it for any other reason, especially just to fill the requirement, then I most highly recommend you pursue another class with another professor.\nWorkload:\nTwo papers and a final (which is two short essays - 1.5 hours each).\nYou'll be totally free to specialize in your topics. Each paper lets you pick one essay from five topics, and the final is 2 essays from 7 topics. The topics are always decently general and expect alot of personal philosophizing. Not about repeating the material to show you know it, or anything like that.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "November 22, 2009",
            "review_content": "\nI took Professor Gabbey's class Spring of 2009.  The class is not the most engaging class I ever took in college, but it was a good introduction to philosophy.  I took a more advanced philosophy class at the same time and the topics flowed nicely.  Gabbey is a very sweet man who will happily explain anything to you after class.  He welcomes questions and will actually help you on papers.  If you attend each class and do each paper, you will most likely get at least an A-.  I would definitely recommend this class to anyone who is remotely interested in philosophy.\nWorkload:\nNot too bad.  Three papers and a final.  Reading for every class, but he goes over it very thoroughly so there is no need to read it very carefully.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "November 06, 2009",
            "review_content": "\nYou don't need me to tell you that this class is not the most exciting - in fact many in my class call it their 'nap time' - nor does he give the best explanations of any of the complex philosophical concepts discussed in class but he does grade better than any philosophy teacher I've ever had. \nHe does not give out A+s or As very often. A- is a sign of an excellent job. But he does NOT pick a 'favorite' essay and then judge the rest of the essays based on that one student's essay. He does make a good attempt at grading each paper on its own individual merit. Now what he looks for and the elements he expects to see in 'good' papers are questionable and definitely not made clear at the beginning of the semester but by the second paper you should get his 'style' -- be clear, be simple, and don't use adjectives (he gets picky about adj.)   \nDon't freak out when he goes on half-an-hour digressions or debates that don't apply to the topic you were talking about--he comes back to the topic...eventually...\nAlso, use the restroom before you come to class -- he gives dirty looks to the kids who disturb the class (aka just him) to use the restroom\nWorkload:\nLight - spend some hours on the paper --the questions are easy enough but refine, refine, refine\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "November 06, 2009",
            "review_content": "\nThis is an extremely boring class. Gabbey basically mutters to himself at the front of the class and he's so quiet you can't even hear him from the front row. HOWEVER: he's a sweet old man, very pleasant to talk to, and very friendly. Easy grader. You don't even have to really do the reading for this class and  you can still do well. IF YOU WANT AN EASY (but boring) PHILO CLASS, TAKE THIS. The boredom is worth the A. \nWorkload:\nLots of reading that you don't really have to do. 2 papers, 1 midterm, 1 final (open book). EASY PEEZY LEMON SQUEEZY\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "January 06, 2009",
            "review_content": "\nThis class was decent. As others have commented - he is not a dynamic lecturer. He speaks softly and it is sometimes hard to hear and follow him. His style is to go through the text in depth reading passages and commenting on them. It's a little dry but it was fine background in these thinkers. He clearly knows a lot about the subject. He encourages class discussion but he's not always able to discern (like many teachers) what the questions being asked are. Take it this way - it fulfills a philosophy major requirement, it's not that painful, and you should be able to pull off an A-/B+ easily. Look at the other professors teaching this period of history of philosophy and you'll see that's not the case. Also, he switches the topics he focuses on for the class per semester. Depending on your interests in philosophy, you might find one semester more captivating than another one. \nWorkload:\n2 papers 7-8 pages in legnth (25% grade each) and a final exam (30%). the final is open book (not open notes). it was funny carrying a backpack full of books to the exam. it's to allow you to reference and quote a bit more than otherwise. \n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "January 01, 2009",
            "review_content": "\nI don't understand how Alan Gabbey got tenure, I honestly don't.  He is the single worst lecturer it has been my fate to suffer at this institution; he's inaudible in the front row of seats, he's unclear about his expectations (late papers either aren't accepted at all or are accepted until the end of the semester with no penalty, no one knows, not even the TA), his lectures consist of long quotations from the assigned reading interspaced with vague comments on the translation and other, unrelated philosophers, his responses to students' questions are tangential at best.  The saving grace is that the grading is generous. \nWorkload:\nIt's actually possible to cram for the final in one day and do fine; I resorted to reading critical essays for the three essays during the semester.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "May 20, 2008",
            "review_content": "\nI will be honest; I took this class because I imagined it would be Aquinas for athletes. I was partly right in my initial assesment. After all, this 9am thriller attracts Columbia's best and brightest...and people like me who show up to half the classes, write the papers the night before they are due, do not study for the final and end up with an A. If you need a filler class with some man candy and entertainment in the form of overzealous freshmen and those who literally snore in front of you, take this. Gabbey is nice enough if you're a morning person, and not someone who is going to track you down if you're not. \nWorkload:\nCake. Even for a Barnard intro class.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "May 17, 2008",
            "review_content": "\nAlan Gabbey is a very, very bad professor. \nHere's how he lectures: he stands in front of the class with the book open in his hands and READS THE FRIGGIN' TEXT. No explanations. No synthesis of the material to help you understand what the author of the text was getting at. No analysis of the arguments. He just reads the friggin' text back to you. Pretty much half the sentences he utters during a lecture are quotes from the text. \nBut that's only half the sentences. What about the other half? Doesn't he offer some philosophical analysis? Nope. He does mumble on and on about his own thoughts about the text, but there's nothing helpful he says. For his own contributions to the lecture, he will either:\nA) He'll randomly relate the passage to another one from some other philosopher -- usually one we haven't been assigned. And he doesn't do anything more than just mention the relation -- it's not like he tries to illuminate the text by explaining the relation. No, he just mentions some other philosopher's name and that's it. This is entirely unhelpful.\nB) He might mumble on and on about some useless historical information which is at best tangentially related to philosophy. Again, entirely unhelpful.\nC) He'll very often go on long-winded asides about translation issues. He'll even admit that these don't really affect comprehension of the text, since they're such small issues.  Yup - entirely unhelpful.\nThe most philosophically helpful thing Gabbey will ever do is tell you where the philosopher we're reading got a particular term from. That's it. That's the only thing you will ever get out of the lecture (well, unless you like hearing passages from the text read to you. That might be nice for some people).\nHe never -- not once in the entire semester -- stepped back from the text to explain what the philosopher was trying to argue for and how he went about arguing for it. He didn't, for example, explain what it means to say that Hume is an empiricist. And he very rarely analyzed the merits and faults of the argument. The only time I remember him doing the latter was with an article by Daniel Dennett, and in that case I'm pretty sure he completely got Dennett's argument wrong and tore down a straw man.\nIt's a shame that this man is teaching philosophy at Barnard. He doesn't do the one thing philosophers are supposed to do -- analyze and produce rational arguments. Luckily, the rest of the Barnard department is really good. But you should avoid Gabbey like the plague!\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "April 02, 2008",
            "review_content": "\nWithout a doubt the worst professor I have had so far in college. You could hardly hear a word the man says and I was sitting close to him! He made no sense, never explained himself, and was rude. The most I learned in this class was the time I spent either at the TA's office hour or when the TA taught the class instead. He actually spend an entire class once trying to figure out who had frauded someone else's name on an attendance sheet he passed around. He counted the number of kids in the class and the names on the sheet about five times. Definitely an awful professor and teacher. I thought philosophy would be interesting but now I am scared from taking another course again.\nWorkload:\nOccasional reading which he will never know if you don't do, three papers which the TA graded, and one final which he leniently graded. \n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "February 22, 2008",
            "review_content": "\nHe's absolutely HORRIBLE! The worst professor in the philosophy dept, BY FAR. Stay away.\nAnd he's absolutely nuts - completely loony. For example, he doesn't let students leave the lecture to go to the bathroom. If you want to leave, he asks you to provide a doctors note proving that you're incontinent and you can't hold your pee through class. How friggin' insane is that - and how embarrassing for the students?. I've never heard of a professor not allowing students leave to go to the bathroom. I can't believe nobody's mentioned that little quirk of his in all these reviews.\nAnd that's just the tip of the iceberg with this guy. He's so nuts (and not in a good way) that he's off the charts. Nobody at Columbia or Barnard comes even close.\nThe only redeeming quality: he's a super easy grader. Just don't make grammatical mistakes, and pay attention to the little stuff (putting the question # you're answering on the title page, numbering your pages - he really cares about the little crap like that) and you're guaranteed an A-minus at least. He doesn't care one bit whether you're trying to understand the material - but he cares a lot if you don't number your pages. And God forbid you have to go to the bathroom - you're in real trouble then.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "February 22, 2008",
            "review_content": "\nHe's absolutely HORRIBLE! The worst professor in the philosophy dept, BY FAR. Stay away.\nAnd he's absolutely nuts - completely loony. For example, he doesn't let students leave the lecture to go to the bathroom. If you want to leave, he asks you to provide a doctors note proving that you're incontinent and you can't hold your pee through class. How friggin' insane is that - and how embarrassing for the students?. I've never heard of a professor not allowing students leave to go to the bathroom. I can't believe nobody's mentioned that little quirk of his in all these reviews.\nAnd that's just the tip of the iceberg with this guy. He's so nuts (and not in a good way) that he's off the charts. Nobody at Columbia or Barnard comes even close.\nThe only redeeming quality: he's a super easy grader. Just don't make grammatical mistakes, and pay attention to the little stuff (putting the question # you're answering on the title page, numbering your pages - he really cares about the little crap like that) and you're guaranteed an A-minus at least. He doesn't care one bit whether you're trying to understand the material - but he cares a lot if you don't number your pages. And God forbid you have to go to the bathroom - you're in real trouble then.\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "February 10, 2006",
            "review_content": "\nTrue, not the most dynamic lecturer.  But, he knows his stuff and the class is not difficult. You can learn a lot from this class, if you put in the energy. A good way to get that history of philosophy requirement out of the way. He's a charming old man. I recommend it. \nWorkload:\n2 papers, midterm and final. Lenient Grader..Nice man. An easy B+/A-, though not a gimme A.\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "January 17, 2006",
            "review_content": "\nNot only is the material horribly dull and unintersting, but the fact that Gabbey mutters, never finishes his sentences, and spits does not help either.  You just need to show up and write the essays, no thinking, speaking, or listening involved.  AVOID AT ALL COSTS.  even take history of philos from aquianus to descartes instead, because this is the worst class i've taken at columbia. \nWorkload:\n2 papers, 2 exams, easy... but pointless\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "December 17, 2005",
            "review_content": "\nProfessor Gabbey's lectures might seem boring if you are not invested in the subject (true of most things in life), but he takes the time to repeat the more important concepts or arguments from the previous night's readings. His lectures are very clear, organized, and thorough. In seminars (Spinoza), he is again very thorough. We basically combed through one of the most confusing texts that I have had to read so far at Columbia, the Ethics, and--heaven forbid--he took the time to explain any point of confusion and to contextualize parts of the text in terms of the philosopher's life and the time period in which he lived. \nHe is not a difficult grader and gives extensive comments on each paper, good or bad, to clarify your understanding of what you wrote about and suggest improvements for the future. REMEMBER TO PAGINATE, and to title your paper. He is a stickler about that, for good reason I guess.\nOverall, I really enjoyed all of the classes that I have had with him. \nWorkload:\nEMP: 2 short papers (4 pages each), a midterm and final both of which were open book (but not open notes)\nSpinoza: 2 long (8-10 page) papers and, to a very limited extent, class participation\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "February 18, 2005",
            "review_content": "\nProfessor Gabbey's class was enjoyable.  He is a very easy grader.  He encouraged class discussion, and thus we got to dig a little deeper into the topics that in most survey courses.  He's also very approachable outside of class, and despite the fact that he's obviously an old timer, he also actively seeks out his students' input because he really cares about teaching.  It's not just a sideline for him. And he encourages students to pre-submit papers so he can have a look and give suggestions. I wish more philosophy professors would be so willing to put time and effort into helping students become better writers.\n All in all, a great way to get a requirement met. You may even be inspired to take another class with him. \n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "January 01, 2005",
            "review_content": "\nThis class is very innocuous, you can go or not go, you can do the reading or not do the reading, and you can participate or not participate, it just depends how much you want to get out of it.  Gabbey is very interesting and the class covers a wide array of topics which are discussed in class based on related readings.  He does not force anyone to participate so if you haven't done the reading it's okay, you can still go to class and get something out of it, and just make sure you have some idea of all the topics in order to write your papers and do well on the final.  He is a fairly easy grader, I did not know anyone in the class who got lower than a B- on their papers, most got B+'s and A-'s.  Overall a great introduction to philosophy and a class flexible enough to fit anyone's schedule.\nWorkload:\n2 papers (6 pages), 1 final (3 essay questions), 2 required books and many other photocopies to read\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "December 29, 2004",
            "review_content": "\nAlan Gabbey is passionate and knowledgable about philosophy and comes to class with a certain enthusiasm about the material that he is going to cover.  He encourages class participation, and sometimes the class discussions would get really interesting.  We covered topics such as free will, death, the afterlife, morality, matter, the existence of God, and even the existence of oneself.  Though the class discussions were interesting, Prof. Gabbey seemed to have trouble getting the entire class to join in the discussion.  I don't think that this had anything to do with him, it was just that the class  is currently being taught at the 9am time slot and many students, like me, weren't fully awake at that time.  \nProf. Gabbey doesn't demand much, making \"What is Philosophy Anyway?\" one of the easiest classes I've taken since I started college.  He is very willing to continue explaining weird philosophical concepts until the whole class understands them.  He is willing to meet students in his office hours if needed, and is very willing to go over papers if students have questions about the grades they received.  He's also witty, which made for a few funny jokes in class.  Overall, he's a good  professor and I would recommend him to anyone who wants to take an introductory philosophy class.\nWorkload:\nPhilosophy readings for each class (they aren't long at all, most of them are only a few pages long); 2 papers; a final\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Gabbey is clearly knowledgeable about and interested in the material he teaches, but his class is incredibly dull. Most assigned readings will be familiar to students with any sort of previous experience with Philosophy or even European History, and class discussion in unbearable. When Gabbey is able to lecture on the texts without constant interruption from talkative freshmen, class is interesting and informative. Unfortunately, this lack of interruption is rare. On the bright side, class attendance isn't really necessary, the reading load is light, and paper assignments are easy. A relatively painless way to fulfill a requirement, but probably not the best course for anyone with a genuine interest in the subject.\nWorkload:\nlight reading, 2 relatively easy papers, final exam\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "November 19, 2004",
            "review_content": "\nAlthough Alan Gabbey is not the most riveting Professor ever, I do agree that the 9am time slot isn't helping him at all. If this class had started after noon I think I would have enjoyed it much more. Gabbey is a very knowledgeable professor who has his own subtle sense of humor which I personally found to be pretty amusing. Basically this class consists of some manageable philisophical reading and then class discussions which I didn't feel obliged to be a part of. He was very willing to answer questions, and make sure that students understood the material. \nWorkload:\nManagable readings, 2 six pg papers and a final\n"
        },
        {
            "course_name": "Early Modern Philosophy",
            "review_date": "November 05, 2004",
            "review_content": "\nSeeing as there were only 6 people in this 9 am class, I don't think that Prof. \nGabbey was able to express his full teaching potential, but I found him to be very knowledgeable and always willing to help with personal meetings, on papers, etc.  He also was not the type of teacher who reinforced incorrect ideas, he was very straightforward and let you know if you understood the material or not.  I found him to be truly passionate about the subject and about teaching.\n"
        }
    ]
}