{
    "prof_info": [
        {
            "prof_name": "Julio Fernandez",
            "prof_id": 2595,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Cellular Physiology of Disease",
            "review_date": "July 28, 2014",
            "review_content": "\nI have mixed feelings about this class. Julio himself is a really swell guy- his passion for science shines through and you can tell he actually likes teaching, unlike the vast majority of Biology professors I have had at Columbia. The book is extremely helpful and one of the most clearly written ones I've encountered. It is a little lengthy but it has helpful information and graphs. The class itself is not really about disease as much as it is understanding the underlying mechanisms for how various parts of the body work (explaining the electrical events that lead to an action potential, etc.). That said, it was interesting enough and the papers were generally fairly interesting. Don't be intimidated by the equations and whatnot- you don't need a lot of math or even physics background to grasp the class material.  \nProbably the best thing about the course is how available everyone is for help. The TA's hold office hours twice a week but are really open to meeting just about anytime and Julio constantly offers opportunity for extra help, and if needed, extra credit. Both the TA's, Dan & Ted, were really nice and helpful. \nWorkload:\nIn class midterm & final, read and discuss a paper (3-20 pgs.) weekly, 10-20 pgs. reading weekly\n"
        },
        {
            "course_name": "Cellular Physiology of Disease",
            "review_date": "June 14, 2008",
            "review_content": "\nJulio was probably the best professor I had at Columbia. He is incredibly intelligent and excited about science. Moreover, he is a great teacher-- always excited to share his knowledge and be challenged. This class in particular highlighted his teaching style. Instead of learning principles from cartoons and diagrams in a textbook, we looked at the original papers from which the theories in textbooks are taught. In doing so, you not only learn great science, but also the process by which science is made. All in all, it was one of my favorite classes at Columbia and possibly my favorite science class that I have taken. I would recommend this class for anyone who has a genuine interest in the scientific method or research. The subject matter itself is daunting and difficult, but if you put in some effort you can get a lot out of the class. \nWorkload:\nReading a scientific paper every week and discussing it in class-- don't be afraid to speak up! Midterm and a final that are a little stressful\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 19, 2006",
            "review_content": "\nHe scared me at first because he randomly calls on people during discussion classes, but, he's actually quite easy going whether you know the answer or not.  His discussion lectures can be boring, but a few were actually intriguing.  He's very helpful in office hours, and a nice guy once you get past the initial intimidation.  He's a much better teacher in office hours than in discussion, he can do a great job explaining things if you take the time to visit his office hours\nWorkload:\nusual. WIAs, final, 1 paragraph assignments after each discussion section\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 03, 2005",
            "review_content": "\nHe's great guy.  Very intelligent, of course.  Expects a lot of out of his students, but at the same time, itsn't very hard to please.  He mainly just wants you to show thought and effort.\nHe was one of the lectures for my semester (spring 2005).  His lectures were somewhat dense and dry, but I love that him, and the other lecturers as well (especially Horst Stormer), are really passionate about what they teach.\nI imagine he'll be a very difficult professor, but I hope he'll be teaching one of the upper level science courses I take.\nP.S. He really likes people to come to his office hours. \nWorkload:\nseminar questions, a couple projects, usual frontiers problem sets\n"
        }
    ]
}