{
    "prof_info": [
        {
            "prof_name": "Daphne Carr",
            "prof_id": 3322,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "October 03, 2008",
            "review_content": "\nDaphne is unassuming, approachable, pretty intelligent, and kind of a hipster (and it shows). She was really empathetic to people in the class who obviously had no musical background- we did not need to memorize names, dates, composers of every piece we listened to (unlike a lot of music hum classes). She's not so much a musician as she is an ethnomusicologist, which definitely helps. I was admittedly one of those jackasses who had a lot of music training and knew most theory and  history like the back of my hand and took the class for the easy A. Which I got, but I felt most people did too. If you try at least a little bit, she'll appreciate the effort and reward you kindly. I also learned some really cool anthropology stuff about Yoruba drumming and concert venues- probably the most interesting part of the whole course. There is only so much she can do with the set material, but she did manage to incorporate The Arcade Fire in our discussion of Baroque music, which I thought was pretty sweet. Overall, Daphne makes music hum as painless an experience as it can be.\nWorkload:\nStandard. Varying degrees of reading depending on how familiar you are with the material already. 2 5-paged concert reports that can be handed in pretty much anytime during the semester. Easy midterm and final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 27, 2008",
            "review_content": "\nDaphne is amazing.  I came in with no music background whatsoever, dreading the class, but she not only taught me a lot, she also made it interesting.  \nWorkload:\n2 concert reports, midterm, final, and about 5 other small, easy assignments.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 14, 2008",
            "review_content": "\nDaphne Carr.  You want to take Music Hum with her.  She cares a lot about the class, especially about making this core class interesting to both herself and her students.  She is mostly interested in pop, rock, punk and so forth, and works this stuff into the standard curriculum where she can.  She lets us dance in class.  She lets us give presentations on what we think the best and worst music is.  She appreciates awkwardness.  She's interesting, smart and hilarious.  If you don't take Music Hum with Daphne Carr you are missing out.\nWorkload:\nThe usual--2 concert reports, midterm, final, readings...  Really not bad.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 09, 2007",
            "review_content": "\nDaphne is an absolutely awesome teacher.  If you are looking to learn the traditional Music Hum nonsense and nothing more, than don't take this class.  But if you want to understand music in a new way and learn from a really great teacher who wants you to learn, take it.  Her teaching methods are unconventional but good.  She is just chill.  Hands down.  Switch in if you can...trust.\nWorkload:\nNot too bad.  Readings here and there but they are interesting, not just the standard stuff.  2 concert reports, mid term and final.\n"
        }
    ]
}