{
    "prof_info": [
        {
            "prof_name": "Sharon Harrison",
            "prof_id": 1447,
            "total_reviews": 26
        }
    ],
    "reviews": [
        {
            "course_name": "Math Methods for Economics",
            "review_date": "April 30, 2012",
            "review_content": "\nI would agree with the most recent review and say that without recent experience with Calculus and Pre Calc this class is hard, but I haven't encountered a more dedicated pair of Professor and TA in my time at Barnard. I took this course to fulfill my Quantitative Reasoning requirement, and, though I can't say my grade will be at par with my GPA, I'm so glad I did--this class is a great class to take for that purpose, because it instills you with the real-life knowledge that is the bedrock of the requirement, and with enough work and the guaranteed support of both Prof. Harrison and her TA, Mariann, you'll certainly get through it. There will be a number of students in the class that are Econ majors, or have experience with Econ, but as an English major that had neither, I'm still glad that I took it.\nWorkload:\nBi-weekly quizzes; a midterm; a final.\n"
        },
        {
            "course_name": "Math Methods for Economics",
            "review_date": "October 16, 2011",
            "review_content": "\nI'm so glad the other reviewer found this class so easy but for me, an older student who hadn't seen this kind of math in 7 years, it was the hardest class I've ever taken. I couldn't keep up and I worked really hard. If you are just coming out of high school and have this background this is the ideal time to take the class, but you won't be given a break. She herself is a nice person and most of your interactions will be with TA. I ended up passing thanks to a lot of extra time spent but this is difficult. \nWorkload:\nReasonable but really hard for me\n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "May 08, 2011",
            "review_content": "\nChaos was AMAZING. Prof. Harrison is brilliant. She explains the material well and covers a wide variety of topics. I didn't really know what to expect from this class; I thought it would be interesting but I had no idea what we were going to talk about. We ended up talking about pretty much everything; we'd learn about math one day and have deep, philosophical discussions the next. We did have to read Paradise Lost, which was a pain, but we also got to read Jurassic Park, which was totally kickass. The workload sounds bad but it really wasn't.\nWorkload:\nLight reading; 2 discussion questions handed in on every reading assignment; one class facilitation with a partner; one 3-5 page paper; one 800 word op-ed; 15-20 minute presentation also with a partner.\n"
        },
        {
            "course_name": "Seminar: Chaos ",
            "review_date": "May 05, 2009",
            "review_content": "\nI loved this class! It was unlike any other class I took this year. Before I took Chaos, I had no idea what chaos theory was, but Professor Harrison explains it well. It is really interesting theory and I really loved how it was applied to many different disciplines, not just math. We discussed how chaos arises in religion, literature, science, and art. Also, at the end of the course, we made a presentation about chaos in fields we were interested in. Professor Harrison does an excellent job of keeping students engaged in the material. Everyday I felt we had really stimulating, thought-provoking discussions. Sometimes it was also a little difficult to see the relevance of some of the articles we read to chaos theory, but most of the time you could. We had a number of guest lectures which were fantastic. I also really liked the literature we read. We began with Paradise Lost, which was a little tricky, but so interesting to read from the perspective of chaos. Later, we read Jurassic Park, which is awesome because it really shows the application of chaos theory in a modern world. Our last piece was Arcadia which is an AMAZING play (if you havent read it)! Professor Harrison is also very organized, accommodating, and has a real passion for teaching this class. Plus, this is a seminar so you really get to know your professor and classmates well. All in all, this is a great class. You should definitely take it!\nWorkload:\nNot too heavy, just about right. Weekly journal entries (not graded), 2 papers (the first draft is reviewed by a Writing Fellow and then she meets with you to go over your second draft) and one oral presentation.\n"
        },
        {
            "course_name": "Math Methods for Economics",
            "review_date": "December 19, 2008",
            "review_content": "\nThis class was great! Its a new class and I took it the first time it became available. This class is meant to prepare economics majors for the more complicated math in the intermediate courses. Personally, I am not a math person and was a bit nervous to start learning calculus, but prof. Harrison makes the process painless. The material can sometimes be tricky but if you do the homework and meet with the TA its totally manageable. And her exams are straight-forward with only one or two difficult questions. But be careful because the pace is fast and missing a few days of class means catching up on a LOT of material. Prof. Harrison seems intimidating at first because she focuses very much on the work and is very no-nonsense, but she is friendly, approachable and very helpful at office hours. I recommend this class to any possible Econ majors who do not want to take Calc I or Calc III (seeing as this class counts for both). \nWorkload:\nweekly problem sets with lowest one dropped, 2 midterms and 1 cumulative final - not too difficult \n"
        },
        {
            "course_name": "Business Cycles",
            "review_date": "December 18, 2008",
            "review_content": "\nIf you take extremely good notes in this class, it will be a breeze.  I mean go to every lecture, on time and write until your hand hurts.  Write what she says, write what you think she's trying to say....you get the point.  \nThe problem sets are fair, if you take good notes- but keep your answers brief and to the point (one TA grades like all of them).  Also, if you don't know what the question is asking just make a good guess and go with it.  Hand them in on time, she drops the lowest grade.  \nShe's not available outside of class too much, only during her OH.  \nThere is the option of a paper or debate, either one will be exponentially easier if you take good notes.  She really gives you everything in class, you don't need to sweat anything, doesn't matter if you miss a reading (or 2) or spend less than 30 hours  (duh) on your final assigment, because that's not what she's looking for.  \n\nWorkload:\nLight-load if you take good notes, fair midterm and final if you know some macro-econ, fair final assignment.\n"
        },
        {
            "course_name": "Seminar: Chaos ",
            "review_date": "February 15, 2007",
            "review_content": "\nThis is by far the WORST class I have ever taken.  Chaos theory is introduced, which is only interesting if you have some interest in math- and discussed the first couple of classes.  After that, there is nothing new, ever.  Harrison NEVER lectures and RARELY has anything insightful to say.  She sits back and lets the class discuss instead- which usually leads to trite, dull, forced discussion leading to nowhere.  Don't bother buying or reading \"Does God Play Dice\"- it is unnecessary.  Paradise Lost is the next book read, and little literary discussion value will come out of it, the main focus is chaos.  The seminar is so driven by chaos that no other points are made whatsoever.  \nPlease, please, do NOT take this class.\nIt will bore you.\n\nWorkload:\nPOINTLESS weekly journal and 2 discussion questions every class, 3 papers.  \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 08, 2007",
            "review_content": "\nSo, I didn't do well in her class, but I have to hand it to her...she is a REALLY good prof.  Her TA is very annoying and a stickler.  But, Prof. Harrison gives AMAZING notes and unlike many columbia/barnard profs...the woman can TEACH.  \nWorkload:\nWeekly Prob sets (3-5 hours per prob set).  So it well...its graded harshly.  Managable work load.  REALLY REALLY sttudy the practice final and midterm...\n"
        },
        {
            "course_name": "Seminar: Chaos ",
            "review_date": "October 09, 2006",
            "review_content": "\nWhoever wrote that awful review went way out of line; totally inappropiate. I think you're taking your personal issues out on the class and on the professor. \nThis is by far, the best class I've taken in college thus far. The class discussion were very insightful. Her strong background in math truly made a difference in the class. It made me realize that chaos was everywhere! This class was a great conversational topic on interviews. Many people were truly impressed by the concepts and topics covered in this class. I learned to look at literature, art, and the financial markets in a very different way after taking this class. Professor Harrison is one of the best professors in the university. Not only that, but she is very approachable and helpful. She truly cares about her students. I highly recommend this class. \n"
        },
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "May 07, 2006",
            "review_content": "\nShe basically goes along with the book. You can either go to class or read the book; you really don't need to do both. The weekly problem sets are very easy and pretty short. The test questions are taken directly from the homework. This class is incredibly easy, and she's a generous grader. The class is more of a basic, introductory class for students to \"understand the world better\" and \"understand the news\" (she starts each class with asking students what they've read in the Times recently and relating the events to Macroeconomics...which, don't get me wrong, is pretty cool). All-in-all Professor Harrison is a pretty nice, cool, easy professor to have for a required theory class. But the class doesn't cover a fraction of what the Macro class equivalent across the street does, and it shies away from any difficult math. All you need to know is how to move the lines around in a graph, which is pretty intuitive (Mankiw-like) stuff anyway.\nWorkload:\nVery light: an easy problem set ever week, very straightforward midterm and final.\n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "April 23, 2006",
            "review_content": "\nThis class was awful.  I expected chaos to be an interesting topic to discuss in the various texts that we would be reading, and it was somewhat stimulating, but only for the first three classes.  There was no depth beyond \"does God control the world, or is it chaos theory?\"  I did not expect it to turn into a repetitive discussion on different religious beliefs.  Harrison hardly ever lectured, just threw in random stories about her daughter, despite the fact that she has a heavy background in mathematics.  She didn't offer any new insight on chaos theory after those initial three classes.  There were a few breaks in the boring discussion: one time she had a rabbi, priest, and expert on buddhism present to the class, another time we watched Pi (the most obnoxious movie ever made) with the producer come and speak to us, and one friday we took a trip to the NYSE.  Despite these extra activities, I still didn't stop hating the class.  BARNARD STUDENTS, DO NOT TAKE THIS SEMINAR.\nWorkload:\nWeekly journal entries about absolutely nothing, one time spent leading discussion, three papers and a final presentation. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "February 08, 2006",
            "review_content": "\nThis woman is amazing. She is clear and concise and makes economics interesting. She gives good, clear examples and makes confusing concepts seem easy and straightforward. Also very willing to help students. This is defintely the best econ class I have taken so far.\nWorkload:\na midterm, a final, weekly problem sets.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 23, 2006",
            "review_content": "\nI thought she was a good professor. very thorough and clear. she follows the book exactly which was helpful for me. She is also very prompt with emails and always willing to meet with students. Overall good but perhaps lacking a bit more challenge. \nWorkload:\nweekly prob sets, midterm and final. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 16, 2006",
            "review_content": "\nI have to disagree with most of the views. Harrison is concise with the information, but she completely spoon feeds every single word of her lecture, which makes the class completely boring. Her class is not at all a challenge or mentally stimulating in any way and is only great if you like memorizing information rather than thoroughly learning it. Although she is a very nice person, her  nasally monotone voice successfully lulled me to sleep almost everyday. I would NEVER take another class with Harrison unless she was my only option. By the end of the class, though, you'll find that you have only learned half as much as Columbia students, but who cares about actual knowledge, right? If you don't care how much you learn, I did get a great grade in her class, so maybe this is the class for you.\nWorkload:\nProblem sets, midterm, final...all not too bad\n"
        },
        {
            "course_name": "Business Cycles",
            "review_date": "December 29, 2005",
            "review_content": "\nI have to disagree with the previous reviews.  Prof. Harrison's Business Cycles class is not worth while taking.  All it is is a review of Macroeconomics -- and quite honestly a pretty bad one.  She does not engage any kind of class discussion and her problem sets are only \"busy work.\"  Her style of teaching is like in high-school. \"First we will do this .... then we will do this...\".\nI would not recommend taking this class.\nWorkload:\nweekly problem sets of 5 long questions. One midterm and one final. One long paper. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 24, 2005",
            "review_content": "\nA good professor; genuinely cares about economics.  She sometimes has pretty funny jokes.  This Barnard macro is much easier than the Columbia macroecnomics class and in a smaller, friendlier setting. The course starts on a very basic level, stays there for a little bit, and then jumps into some new material, before ending with some weird stuff that isn't really tested on.  I'd say this is more like a high school class, with a lovable teacher and the material pored through slowly.  She's happy to answer any questions, even if they're pretty dumb.  There's also plenty of articles Prof. Harrison brings in for students to read to mix it up when lectures get boring.  \nWorkload:\nEasy weekly problem sets, and easy but not-so-easily curved midterm & final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "November 21, 2005",
            "review_content": "\nWell, I guess this review is sort of redundant, but I like her so much I am going to write it anyway and echo everyone else. Prof. Harrison is one of the best professor's I've had. Her lectures are thourough and systematic and she makes rather complex concepts suprisingly easy to understand. What I think is especially exceptional is that she constantly puts actual data from the real world into lectures and problem sets so that students see why economics is important and how it is applied. Harrison is wonderful, TAKE HER CLASS!!\nWorkload:\nproblem sets, midterm, final - not hard because she teaches so well\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 22, 2005",
            "review_content": "\nHer lectures are, like everybody said, extremely concise and easy to comprehend. I'd never even taken a macro course before, and I found this class to be rather easy. If you do the readings (a very fair amount) and put some effort into the weekly problem sets, you should have no problem in this course. She's extremely helpful outside of class as well. I definitely recommend this course.\nWorkload:\nWeekly problem sets, midterm, final, both very fair. Readings are short and to the point, occassional articles that are actually interesting.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "February 06, 2005",
            "review_content": "\nExcellent professor--funny, engaging, writes everything on the board clearly and concisely. Midterms were straightforward, as were problem sets. Good mix of problems from the book and from outside, and good use of interactive websites, wide range of articles, etc, to come up with the problems.\nWorkload:\nWeekly problem sets (not too taxing)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 29, 2004",
            "review_content": "\nGreat teacher. She is very practical and common sense. She's not the kind of teacher that will use big words to explain something just because they sound good. She cuts to the chase about Econ and just pays attention to explaining something clearly so that you understand. She's very helpful in her office hours too. She's a fair grader and a just a cool professor. Do not feel worried if you didn't take intro macro or do not have a firm grasp of macro coming into the class. Harrison always reviews material. \nWorkload:\nweekly problem sets (manageable), midterm, and final.\n"
        },
        {
            "course_name": "Business Cycles",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Harrison's lectures are quite interesting, the only detractor being that they are in the morning and not in the afternoon. Her class notes are thorough and she provides comic relief during her class lectures and is in general a very understanding professor, although she is strict about absences and late work unless you have some form of authority helping to excuse you (i.e., your dean)\nWorkload:\n7 problem sets (1 due every other week); one midterm; one short paper which is a review of an article from the business section of the nytimes or financial times; one big term project to be done in groups due at the end of the semester; one final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Harrison is awesome! She really cares about her students and wants them to do well. She teaches at a steady pace and tries not to speed right through the material. She patiently answers questions and never makes a student feel stupid for asking. Everything is very clear because it is written on the blackboard. If a concept is confusing, she rewords it in different ways so that it is more clear. She is definitely passionate about  the subject and makes Economics less intimidating.\nWorkload:\nWeekly problem sets (helps in learning the material and guides you in what you actually need to read in the textbook), one midterm, one final\n"
        },
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "December 26, 2004",
            "review_content": "\nThe first day of Harrison's class, the minute she opened her mouth, I knew that I'd found my major advisor.  SH is the kindest, funniest, most down-to-earth professor I've ever had.  And I wasn't alone in falling for her -- the entire class enjoyed our time with her, and at the end of the last lecture of the semester, we spontaneously applauded.  Harrison made economics fun, and she really wanted us to enjoy the subject as much as she does. \nWorkload:\nA problem set due each week; can be time-consuming.  The midterm and final are straight-forward, thankfully!\n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "June 30, 2003",
            "review_content": "\nAll in all, I was a little disappointed with the class.  Yes, it's easy enough, and yes, she makes it very clear what you need to known to do well.  However, it seemed a little too easy.  We didn't touch on a lot of the more difficult (i.e. important) aspects of econometrics that a friend of mine in the Columbia course covered.  If you just want to take the class and get on with your life, that's fine.  If you want to really learn about econometric analysis for the real and academic worlds, take the Columbia lecture.  Nothing against Prof. Harrison; she's a great, clear, and concise lecturer and extremely available and helpful outside of class.\nWorkload:\nReasonable.  A problem set every week, taking about an hour depending on how quickly you can print from the Stat program.  Graded on a check++, check+, etc system by our TA.  Pretty fair.  Harrison gives you sample midterms and finals that are nearly identical to the actuals.  You get an extremely comprehensive formula sheet for both exams.\nFinal project- try to work with friends.  Takes a decent amount of time outside of class and it helps if you agree on the direction you're heading.  It's a longish (I think most turned out to be 10-20 pages) report, but most of the pages will be full of printouts from econometric programs.  You get plenty of feedback along the way.  If you don't do well in this class, I suggest you drop out of college.\n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "April 09, 2003",
            "review_content": "\nProfessor Harrison is very fair.  She reviews all the material that she wants you to know in class thoroughly.  Her lectures are extremely organized and her notes are extremely helpful.  Moreover, she is an extremely nice and helpful person.  The tests are very fair and there are no real surprises.  I would recommend her classes to anyone.  She makes relatively difficult material a bit easier and more clear than it would be otherwise.  There are weekly recitation sections with the TA, but they are not mandatory.\nWorkload:\nweekly problem sets (graded check plus, check, check minus), midterm, final, and 1 big project.\n"
        },
        {
            "course_name": "Statistics for Economics",
            "review_date": "January 19, 2003",
            "review_content": "\nHarrison is one of the best Econ professors that I have ever had.  Her lectures are clear and concise (everything that you need to know is written on the blackboard).  If you need to take econometrics i suggest that you take it with Harrison because you'll actually come out of the course having learned soo much.  Plus, if you do all the work, there is no reason why you shouldn't get an A.  Great Courses, great Prof!\nWorkload:\nWeekly problem sets(graded on a basis of check check plus check minus so really easy), group project (this is where you learn the most), midterm, final (overall not that bad)\n"
        }
    ]
}