{
    "prof_info": [
        {
            "prof_name": "Sally Aboelela",
            "prof_id": 2437,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "General Physiology",
            "review_date": "December 28, 2005",
            "review_content": "\nIn the period of three weeks, Dr. A went from being my worst teacher to one of my favorites.   For some reason, she at first comes off as cold and apathetic, mindlessly plowing through power points for the first unit.  But if you stick with it and remember that better things are coming, you'll definitely be rewarded.  You learn a lot of really neat stuff in this class, and you actually have a fun time doing it.  It doesn't require that much work outside of taking very detailed notes (write down everything she says) and memorizing them before the test (and perhaps drawing a few connections that she didn't explicitly talk about in class).  The tests are straightforward and fair, with very few trick questions--it's a pleasant change after Mowshowitz' always-out-to-get-you exams.  And Dr. A is very reasonable, approachable, and nice.  \nMy biggest problem with the class is the other premeds who are in it; you know, the ones who always have to show off by asking overly thoughtful questions (and she will answer a million of them) or by stating the blatantly obvious just to reaffirm their intelligence.  Dr. A is NOT good at dealing with these people, but it's more of an annoyance than an actual problem.\nI'm really sad this class is over; take it with your friends and enjoy it while it lasts. \nWorkload:\n3 midterms, drops the lowest one.  Final 40%.  All the tests are fair.  Check in advance how much overlap there is with Orgo, because you don't want to have a double-test day with physio.  And if you're not into memorizing very, very complicated pathways, maybe this isn't for you.  But all in all, it's worth it.\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "May 07, 2005",
            "review_content": "\nProf Aboelela is by far the easiest biology professor at columbia.  This entire course is ridiculously easy compared to the other courses.  It is a total GPA booster in the biology department.  It's all memorization and there isn't even that much to memorize.  I agree with the other reviewer that said she is a dry lecturer.  Her figures are taken out of the textbook and she reads off of her slides.  She talks relatively slow most of the time and it's hard to stay awake in that dark classroom.  She reads off detailed notes for each lecture, which are also online, so it just decreases the incentive to go to class.  Plus, everything she says is in the textbook.  The homeworks are easy.  It's crazy that she tries to hold a \"discussion\" with the entire class about some easy New York Times articles or web articles.  She says that she wants you to apply information on the exams, but everything is straightforward and she already went over the applications in class...so just memorize it.  Some of the material was covered in the introductory biology course.  There are weekly recitations which are optional and totally unnecessary.  One TA this semester gave really good reviews before the exams though, but she always got the smallest room to hold reviews in even though she had the most people, which was more than annoying.\nWorkload:\nbusy work + exams\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "May 03, 2005",
            "review_content": "\nI took the class two semesters ago, but I remember being somewhat disappointed. Like the last reviewer said, many people take the course because its useful on the MCATs and people think it'll be easier than the other advanced bio courses. I took it because i thought physiology was one of the most interesting topics in the intro bio class. I still enjoyed the material and got an A in the class... but Prof. Aboelela is not a good lecturer. She's not bad, she sticks to the book and to the point. She gives outlines for every class (which vary in detail - sometimes i never wrote anything down, sometimes I had hand cramps after class, i'm guessing she does this to force people to class?). Also, the outlines always had mistakes on them, and she doesn't necessarily follow them, and I actually found them more confusing to use than not. Her weekly homeworks ARE busywork, that I agree with. Maybe if she gave them optionally or as study guides, they would be more useful because her exam questions are a lot like (or sometimes the same) as the HW questions. For every topic, we had to read articles, answer discussion questions and participate in a class discussion about a particular topic. It was interesting, but again the discussion questions were just busywork and I think I'd prefer it if they were optional, and students just tried to answer them. \nWorkload:\nHomeworks approx. once a week, discussion questions every month (instead of homeworks), three midterms, one final\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "January 26, 2005",
            "review_content": "\nI found the last review rather harsh.  Professor Aboelela was a thorough and approachable instructor.  One must realize that the majority of students taking the course are pre-med biology majors, or neuro majors, or biochem majors.  No student is taking this course our of pure interest but because of a stern belief that this course will  be easier than others ie. genetics, cell bio, or what not.  We studied five biological systems in depth, which may seem very little, but in the end, you'll see the big picture and realize how all five systems are connected to each other in every possible way.  This is also Professor Aboelela's first time teaching at Columbia, thus, she will need a period of adjustment.  The lectures may seem a little dry, but it is nothing to complain about granted that chances are, you're taking the course because you think its easy.  Her lectures are all posted on courseworks, serving as a study tool for everyone.  The class discussions on research papers are extremely interesting.  All in all, Physio is a very informative course and will be extremely help when MCATs come along, and if you work hard enough, it can also serve as a gpa booster.  Others can go on and on criticizing the way she teachers but at the end of the day, you WILL walk out of class or the course learning a lot.  \nWorkload:\nThree exams, one is dropped.  Biweekly homework assignments.  Cumulative final.  Everything is worth the same: 25 for each exam, 20 for the final etc.\n"
        },
        {
            "course_name": "General Physiology",
            "review_date": "January 19, 2005",
            "review_content": "\nThe worst class I have taken in any science department while at Columbia for four years. This teacher lectures solely from slides in a rote way pegged firmly behind her lectern. This would not be horrible were it not for the fact that her slides have mistakes, she cannot answer questions, she's unapprochable and unwilling to receive student criticism, her assignments are busy-work, and all her content-knowledge is derived from the text book. Do not bother to engage in anything outside from the book; in fact, avoid the class altogether and read the wonderful textbook. She is unknowledgable, cannot admit and correct her mistakes appropriately, and is a tedious lecturer. Her discussions, although considered a highlight by some, were busy-work that were poorly moderated and wasted one class lecture that could have been devoted to review or study time. AVOID Dr. Aboelela! \nWorkload:\nFour Discussions and Weekly Homework (worth 20% of your grade). Three tests and one final with multiple choice, short answers, and essay questions. These \"essays\" were arbitrarily graded, not on answering the question appropriately but on regurgitating the most information - forget an irrelevant detail that is not asked of you in the question and points will be taken off.\n"
        }
    ]
}