{
    "prof_info": [
        {
            "prof_name": "Francisco Meizoso",
            "prof_id": 11293,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "May 08, 2014",
            "review_content": "\nFran was a great Spanish professor in my eyes. Some of the other students in the class felt differently, but to me, I felt that I learned a lot. Fran places a huge emphasis on spoken Spanish, and I felt that I improved by leaps and bounds conversationally in this class. That said, my grammar didn't improve as much, since he spends less time going over that (and because his notes on the board are super messy), but I didn't mind, and still found the class fulfilling for because my speech improved so much. Fran is a super smart guy--he speaks perfect English, Gallego, Portuguese, Spanish and French (maybe Catalan too? Can't remember), but he doesn't hold the class to his (admittedly ridiculous standard). The bar is set pretty low for grades, and I got pretty much a perfect score despite being far from a perfect student. That said, I took advantage of the class, and I feel that I learned a lot from it. \nAlso, Fran has a sweet accent and is a killer dresser. That's two plusses in my book.\nWorkload:\nWebAssign (unfortunately!!!!), a few simple projects, midterm, final.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "September 13, 2013",
            "review_content": "\nThe negative comments below may work to the advantage of students who ultimately choose to take Fran's section. Fran is really an exceptional educator - not a lecturer or instructor mind you, but an educator - and this really comes through in small classes. Fran's approach is to teach you Spanish for the language's sake. Contrast this with lecturers who teach for an exam or otherwise rigidly follow a textbook or check-list. Fran places heavy emphasis on spoken Spanish, expecting everyone to participate without being overbearing or intimidating. On the contrary, Fran is exceptionally sympathetic and patient. He reviews grammar in class but expects students to have familiarized themselves with the topics at home. He is widely read and surprisingly knowledgeable and is willing to let conversations flow where they will. Nonetheless, he does review and assign materials in the curriculum, as he is obliged to do, and one does not feel under prepared for exams. \nFran is a soft-spoken, deeply thoughtful, and invested educator. He is the best language educator I've had the pleasure of studying under and would highly recommend him to anyone looking to substantially enhance their grasp of the Spanish language.\nWorkload:\nAppropriate.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "June 04, 2013",
            "review_content": "\nFran is a very sincere and genuine person. In class, he is really interested in his students learning how to speak and communicate effectively in Spanish. When it comes to actually teaching grammar, vocab, etc.. he does not spend that much time on those things in class, and rapidly brushes by them in his powerpoint slides. This is a great class if you want to converse, but the midterm/final will end up being mostly self-study because he speaks very rapidly and it is hard to understand him. (95% of what he says is in Spanish, while some other Spanish teachers us a lot of English while explaining concepts, which is more effective at this level since we are still only in Spanish 2). As far as work is concerned, he is very lenient and the only things he really checks are the compositions and the myspanishlabs. As far as grading, he really looks for improvement in the course, and at the end of the semester, he changed some of the past composition grades/participations grade to give you the higher overall course grade, which I thought was very fair since he graded kind of harshly in the beginning. I am little concerned about going on to the next level, since I did not really learn that much in class (it is very hard to understand and learn EVERYTHING in Spanish-even definitions of vocab were provided in Spanish, and some students did not understand the words used to define the first vocab word, preventing the students from actually learning the word- at some points just saying the English definition is better, but Fran strongly tries to incorporate as much Spanish as possible, which should be save for a higher level Spanish course). \nWorkload:\nSome of the students called him a bird-brain, since he is sometimes all over the place in class. He is a really genuine guy but it can be frustrating to try to do well on the midterm/final, since his Spanish class is more geared to learning how to incorporate the language in every day life. \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 14, 2013",
            "review_content": "\nI think the other reviewers here were put off by Fran's somewhat unorthodox style, which is definitely unlike those of the other language professors I've encountered here. Instead of lecturing for the majority of the class and requiring students to participate during certain activities, Fran's class is casual and conversational. He does strongly encourage participation, and is willing to restructure class if a fruitful discussion is going on. I don't see any problem with this. If you are in fact trying to learn to communicate in another language, you actually have to speak it.\nIn terms of the organization of the class: he puts a calender up on courseworks at the beginning of the semester which he follows pretty closely. I guess If you're used to professors who holds your hand and remind you multiple times about every due-date, it can be a bit of an adjustment. Otherwise, you'll be fine. If you do miss something, he's very forgiving about deadlines.\nIf you want to chill on your phone while getting the language requirement out of the way, take another section. If you actually want to practice your Spanish, give him a chance. \nWorkload:\nStandard for a language course at CU. Deadlines flexible, fair grader.\n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 13, 2013",
            "review_content": "\nHonestly, this is the first and last time I will ever write a review on a professor again but Fran is the worst professor I have had at Columbia. He is a nice guy but he does not explain things well at all and no one ever knows what's going on in class. He really makes you participate and randomly call on you and will take it as an insult if you don't talk in class. He is very frantic with everything he does and talks extremely fast. It is honestly a waste of time when you walk into class. Seriously, DON'T TAKE THIS CLASS!\nWorkload:\nStandard Spanish workload...midterm. Final. 3 comps and one random in class composition. Maybe a couple random quizzes. Project. And oral.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 26, 2011",
            "review_content": "\nRun!  This professor is probably the worst you could have.  He is extremely nice and he tries so hard but he just really cannot teach.  For me, this was the worst combination because I was constantly trying not to get annoyed or frustrated that I didn't understand anything.   I thought my inability to learn Spanish was something I was doing, but really, I wasn't learning because he just flat-out wasn't teaching.  Fran is extremely unorganized and a bird-brain.  He never tells you what is due or when it is due, and the he gets mad at you when you don't turn whatever it is in.  \nAlso, I know this is hard to control, but his accent makes it almost impossible to understand him both when he is speaking English and Spanish.\nI feel bad for writing such a bad review because Fran is such a nice guy, but honestly, I learned nothing and I'm really worried about how I will do in the next level because of it.\nWorkload:\nTypical for a spanish class. 4 compositions, 1 midterm and final project and a final exam.  BUT you never know when you need to do anything or what you need to do for it!!\n"
        }
    ]
}