{
    "prof_info": [
        {
            "prof_name": "Yoichiro Matsumura",
            "prof_id": 617,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Judo",
            "review_date": "November 19, 2009",
            "review_content": "\nAwesome!\nMatsumura is an adorable little man who is both tiny and powerful. The class sessions are energizing and relaxing at the same time. \nThe class basically consists of a 5-10 minute warm-up (you'll fall in love with the teacher's funny little idiosyncrasies), followed by a demonstration and then practice with a partner. The teachers then walk around and help you if you seem lost or have any questions (if you are an attractive female, they will help you more often). There is never any pressure to be good at Judo or anything. Very laid-back.\nThere's absolutely nothing wrong with this course. Enjoy!\nWorkload:\nYou can skip the class 6 times, and it's really lax. Sessions are never stressful or anything.\n"
        },
        {
            "course_name": "Judo",
            "review_date": "May 09, 2006",
            "review_content": "\nawesome! Take Judo with him. It's a great class and you really learn alot of moves!\n"
        },
        {
            "course_name": "Judo",
            "review_date": "May 09, 2006",
            "review_content": "\nawesome! Take Judo with him. It's a great class and you really learn alot of moves!\n"
        },
        {
            "course_name": "Judo",
            "review_date": "December 07, 2003",
            "review_content": "\nIf you can get this class to take care of your PE credit, by all means DO. Sensai Matsumura is the most wonderful and agreeable person in the world, and apparently a world famous judo competitor. He has designed the class well so that you feel like you're learning interesting things, but nothing you can't handle. He's fairly lenient about absences and he likes to make conversation during class.\nWorkload:\nit's PE...\n"
        },
        {
            "course_name": "Judo",
            "review_date": "January 17, 2002",
            "review_content": "\nThis class is fun because you get to get out a little bit of aggression by learning how to flip someone twice your size. The pace is easy, the moves aren't too demanding, and though you'll probably never use them, they're still neat to know. You'll probably want to join this class with a friend because its less awkward flipping them and pinning them to the mat by their crotch--this class isn't the easiest way to make total strangers your friend. Also, you demonstrate your moves in front of the class and if you have someone you know, you're less like to screw up and make an ass of yourself. Matsumura is pretty easy going about absences so long as you don't whine too much and as long as you participate in the class itself when you are there. However, Matsumura rarely speaks, and when he does, it's in very broken english. Luckily, he has a judo-club teaching assistant who handles attendance and translates for Sensei so it's not too bad (and note for girls, if the assistant is Eric, I'm told that he's so cute that watching him do his moves is a treat in itself). \n"
        },
        {
            "course_name": "Judo",
            "review_date": "April 25, 2001",
            "review_content": "\n I highly recommend the rather goodnatured Sensei Matsumura's judo class, which is not ambitious but probably worth your time as far as Columbia PE classes go.\n"
        }
    ]
}