{
    "prof_info": [
        {
            "prof_name": "Maxine Weisgrau",
            "prof_id": 661,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 03, 2016",
            "review_content": "\nI took this course in the summer session and I will say, the last hour of that block can be rough as the material is a bit dense, especially if you don't have previous Anthropology knowledge. Professor Weisgrau is great though. I know some people in the class were a bit frustrated as she can seem a bit vague at times, but she's incredibly supportive and to be honest, quite a generous grader as well. I won't say it's an easy A, but if you try at all, she notices. She appreciates your interest and your ideas and I found it to be a very supportive environment. I tend to find the students who didn't like her, or didn't like her approach were the egos in the room who thought they were smarter than her. Which is always funny to me coming from undergrads and dealing the PhDs, but that's just me.\nWorkload:\n2 papers\nA midterm and a Final\nTons of reading, but you don't have quizzes, it's just for discussion.\nPretty moderate.\n"
        },
        {
            "course_name": "Families, Feminisms and States",
            "review_date": "January 02, 2010",
            "review_content": "\nYou either like her, or you don't. By the end of the semester my class was pretty set on hating her because recently she'd started interrupting people during discussions and rather than respectfully disagreeing with things, saying someone was wrong as if it were a fact when we were all stating opinions. She lectures during discussions, but at least she admits it. She knows she doesn't and if she's got the energy and she's in the mood she tries her hardest to avoid it. \nGetting advice from her on a paper is pretty confusing. She doesn't make much sense and she sometimes talks in circles. You leave the room certain she didn't like your idea but clueless as to what to write about. \nShe's a pretty easy grader-- no one in the class got less than a B, but only a few got A- and even less got As. Sometimes it was obvious what you'd done wrong, and other times it was totally confusing and she did not clear it up.\nThe material and the readings are interesting, and the discussions were usually interesting. The papers were tough and sometimes a hassle but other times enjoyable. \nWorkload:\ntwice weekly readings, four papers\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 17, 2007",
            "review_content": "\nI know alot of people find Professor Weisgrau boring, and I have to admit that when I first read reviews of her class I was nervous to take it. However, I really like Professor Weisgrau and loved her class. I personally liked the subject matter and thought many of the readings were truly interesting. I have to admit that some of the readings in the course packet were too dense and I ended up giving up on them a few pages in. She tends to go on tangents in class, but they are almost always related to the subject material. In general, if you pay attention, you should get alot of out of the class. It is what you put into it that you get out of it. \nWorkload:\nFair amount of reading but not all of it is necessary. She covers alot of it in lecture. She is also a fairly easy/fair grader. Two papers - one 2-4 pages on kinship, the second 5-7 on a comparison of two ethnographies that we read in class. One midterm with IDs, short answer questions, and an essay. One final with IDs, short answer questions, and 2-3 essays. As long as you take good notes in class and study them before hand, and either do all the readings (or at least have a grasp of them - I definately did not do all the readings) you should be fine. It's really not that hard a class.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "March 28, 2007",
            "review_content": "\nI have never been so dissappointed with a professor in my life.  Professor Weisgrau is unorganized to say the least.  Her lectures lack any semblance of a plan or structure.  Her grading seemes completely arbitrary, with frequent -5's for, it seems to me, little reason.  She doesn't seem too concerned with knowing anything about her students, and when you go to meet with her she often seems condescending and treats you like a child.  She made me never want to take another class at Barnard, which is sad because I know there are plenty of great ones to take.  She also made me completely lose interest in a field that otherwise could have been interesting.  Also listening to her monotonous voice is almost physically impossible.\nWorkload:\nThere is a TON of reading.  Doing it didn't really seem to help me, but go for it if you want to.  It's pretty tedious and she won't stick to it at all in class.  Two papers that are easy A's, especially if you meet with a TA.  A midterm and a final... as I said, grading seems completely arbitrary so good luck.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 11, 2006",
            "review_content": "\nif you see \"m. weisgrau\" listed as your professor do not take the class. even if it sounds interesting. DO NOT SUBMIT YOURSELF TO THIS WASTE OF BRAINTIME. \ni came into college pumped about anthropology, cultural anthropology specifically. then i had this class. i have no idea how or why this woman is teaching here. she speaks in foggy circles, her lectures are irrelevant to her articles, and the TA's kept correcting her during class. everytime she said \"functionalism\" and made her little hand-gesture, i wanted to shrink to the size of a chipmunk so i could gnaw at her annoying face. she spent a total of four months in India conducting field research and thinks she is the expert in India and Hindi. she can't even speak hindi. in class once, she tried to explain the four different kinds of t's in Hindi. she went \"tuh, tuh, tuh, and tuh\" and they all sounded exactly alike. one of the TAs stood up and corrected her and she brushed it off like she knew what she was talking about... which, it seemed to me, she doesn't. after the midterm, i figured out that i didn't need to go to class. so i didn't, and ended up having a much more enjoyable half-semester. the review sessions with the TAs during reading week will be enough preparation for the final.\nmaxine might be a nice person...i don't know. but she's not a good teacher. you're here to learn, so run away from her class. RUN RUN RUN RUN!!!\nWorkload:\nirrelevant articles that have nothing to do with the subject. a lot of them, most of which you don't need to read until pre-midterm/finals-cramming time. she will test you on the little detailed things she doesn't talk about in class, but if you study, you'll get an A. there are two papers in addition to the midterm and final, and they're straight-forward. \n"
        },
        {
            "course_name": "First Year Seminar -- Family: Historically and Cross-Culturally",
            "review_date": "January 20, 2005",
            "review_content": "\nWhile she had her faults, Professor Weisgrau was caring, interested, and involved in her class. We had incredibly varied and interesting readings and open-ended essays so that we could take our own view on whatever readings we decided to use. She talks too much (especially when she's specifically assigned someone to lead the class) and she does have a habit of searching for the \"right\" answer. Still, it was a great class. I'd recommend it to anyone who's not too judgemental--she's very politically correct, but keep and open mind and you'll enjoy her.\nWorkload:\nreally small amounts of nightly reading (but do it if you want to enjoy the class), and four 3-5 pages essays. very doable.\n"
        },
        {
            "course_name": "Family: Cross Culturally and Historically",
            "review_date": "January 01, 2005",
            "review_content": "\nThis was an easy first-year seminar.  The readings, for the most part, were interesting and were not time-consuming.  The class was entirely discussion.  Weisgrau would go off on tangets a lot, so class was often on random thoughts that sometimes would pertain to the readings and sometimes would not.  As a whole, though, I enjoyed the class and her, and I found that I learned a lot from this seminar.\nWorkload:\n4 3-5 page papers\n"
        },
        {
            "course_name": "Living in Society",
            "review_date": "December 29, 2004",
            "review_content": "\nWell I enjoyed this professor.  The material can be a bit dry but Weisgrau enjoys what she does and personally that is better than a professor just teaching for the money.  If you are a big anthro buff... or if you are just interested I would recommend going to the first class to scope it out\nWorkload:\nAlot of reading from a course packet...12 pg take home midterm...kinship chart (easy and fun to do) and a final paper on any ethnography that you would like\n"
        },
        {
            "course_name": "Living in Society",
            "review_date": "December 01, 2004",
            "review_content": "\nshe is horrid. please, if you value the money you spend for your college career, DO NOT take any of her classes.  The reading for this class is so interesting, and dense, but it  class discussions inevitabely lead to Weisgrau's favorite Friends episode.. like when rachel is looking at her sonogram.. Sadly this is where discussions on 300 pages of reading leads to. \nShe's just a bad teacher and is socially awkward.  Its okay to talk about friends or even movies in class and to joke about it.. but not when youre not funny, arrogant, and generally difficult to like.  She's socially awkward, and theoreticallly speaking, an anthropological dinosaur. She is uninterested in your paper making a point. RIghtly so, she is fed up with students probelmatizing everything that an anthropologist says. But she does this, i feel, to everyone, no matter how convincing the argument, no matter the student. She just likes to disagree with everything, and to hear herself give recommendations, advisories, etc. Its a bit maternal, very unprofessional.. generally bad professor ettiquette. Shes kinda of the nagging annoyign mother that you're glad you never had.  In essence she likes to hear herself talk.. which is sad because seh never has anything substantioal to say. She is horrid... please, dont take this class. \nWorkload:\neasy... but you need to dumb down all your papers \n"
        },
        {
            "course_name": "Living in Society",
            "review_date": "November 21, 2004",
            "review_content": "\nProf weisgrau's class is exhaustively uninspiring. Not only are  you  bored, but  you are also frustrated by how much money she makes to stand in front of the class to say absolutely nothing important. I tried day after day to try and appreciate her class.. i really tried. \nOh, and she also has bad professor etiquette in that she is condescending and has to disagree with, or qualify, everything anyone says in class, ever.  And the sad thing is that whatever she says is either so obvious that it implied, or just plain off topic. \nShe also speaks toe slowly, meditates on ideas/words, too long, and after this extended silence,  never says anything profound. \nshe;s also an anthropological dinosaur. I feel like shetries really hard to connect with progressive anthropoloigcal (esp cultural anthro)  ideas but you can tell that it doenst entirley resonate with her, excite her, the way that it does other professors. \nAnd if you want to develop as a writer, this is not the class for you either. She expects straightforward, uncreative papers. \nWorkload:\nits reasonable, but she never refers to teh text in class... NEVER!!!!!  so you dont feel like doing the reading which is really quite interesting. its a sad situation. \n"
        },
        {
            "course_name": "Introduction to Social Sciences",
            "review_date": "November 02, 2004",
            "review_content": "\nSuper helpful as a freshman. It meets just once a week and is only one credit-- but it definitely helped me decide what classes i wanted to take and also which professors i wanted to take as well. Because it is so informal, you can ask anything. It is very helpful if you think you are interested in the social sciences, but don't know much about them. Also great to learn about columbia and barnard's resources in general. interesting discussions as well.\nWorkload:\nno homework except for two easy \"reflection\" style 2-3 pg papers the entire semester.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 06, 2004",
            "review_content": "\nMaxine isn't entirely bad, esp. not if you really enjoy a lighter work  load and missing class.  If you go everyday, you're likely to be bored to pieces with her tangents and extremely uncorrelated asides, but if you're like me and traverse to lecture less you'll get to know what you need to  without the hassle of some more intense instructor.  Remember* anthropology is a very interesting and all-encompassing sort of field- so if you're looking for a really structured, informational type lecture and don't receive it in Maxine's course, it's not her fault.    As for the material: fascinating beyond belief - if you read the book, common sensical and unimportant, if you just attend Maxine's lectures without reading.  As for the reading, the packet has some great stuff: Said, Ortner, etc. I recommend this course and teacher  to people that are interested in gaining a less stressfully attained, yet still informative  knowledge about at least the surface of cultural anthropology.\nWorkload:\nminimal - but necessary cramming for midterms and finals, plus a few little papers\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 06, 2004",
            "review_content": "\nMaxine isn't entirely bad, esp. not if you really enjoy a lighter work  load and missing class.  If you go everyday, you're likely to be bored to pieces with her tangents and extremely uncorrelated asides, but if you're like me and traverse to lecture less you'll get to know what you need to  without the hassle of some more intense instructor.  Remember* anthropology is a very interesting and all-encompassing sort of field- so if you're looking for a really structured, informational type lecture and don't receive it in Maxine's course, it's not her fault.    As for the material: fascinating beyond belief - if you read the book, common sensical and unimportant, if you just attend Maxine's lectures without reading.  As for the reading, the packet has some great stuff: Said, Ortner, etc. I recommend this course and teacher  to people that are interested in gaining a less stressfully attained, yet still informative  knowledge about at least the surface of cultural anthropology.\nWorkload:\nminimal - but necessary cramming for midterms and finals, plus a few little papers\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 06, 2004",
            "review_content": "\nMaxine isn't entirely bad, esp. not if you really enjoy a lighter work  load and missing class.  If you go everyday, you're likely to be bored to pieces with her tangents and extremely uncorrelated asides, but if you're like me and traverse to lecture less you'll get to know what you need to  without the hassle of some more intense instructor.  Remember* anthropology is a very interesting and all-encompassing sort of field- so if you're looking for a really structured, informational type lecture and don't receive it in Maxine's course, it's not her fault.    As for the material: fascinating beyond belief - if you read the book, common sensical and unimportant, if you just attend Maxine's lectures without reading.  As for the reading, the packet has some great stuff: Said, Ortner, etc. I recommend this course and teacher  to people that are interested in gaining a less stressfully attained, yet still informative  knowledge about at least the surface of cultural anthropology.\nWorkload:\nminimal - but necessary cramming for midterms and finals, plus a few little papers\n"
        },
        {
            "course_name": "Living in Society",
            "review_date": "December 26, 2003",
            "review_content": "\nLectures tend to be dull, and Prof. Weisgrau's slow, monotone voice doesn't help much... but the class itself was hardly demanding.  Reading assignments were dense at first but gradually got more and more interesting and controversial (in vitro fertilization, lesbian step families, female circumcision, etc)... class discussion is what you put into it, so be sure to participate and offer your opinion.  Weisgrau herself seems stuffy and distant at first but you'll find that she's extremely understanding and not a bad person at all (and an extremely generous grader, too).  \nWorkload:\nCould be worse.  Fair to heavy reading assignments but you definitely don't have to do it all; she asks that you lead discussion once during the semester, which is very laid-back and informal.  Take-home midterm (for which the average grade is an A-) and a final 7 to 10 page paper on an ethnography of your choosing.  \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "September 01, 2003",
            "review_content": "\nas i take new courses this semester i feel obligated to review this prof.  she completely turned me off to the field.  her classes were extremely painful and she, in my experience, wasn't very nice to her students either.  it was terrible.  don't ever take her classes.  and i will bet MONEY that no student of hers ever wrote the positive review below.  you can just tell by everything about-->especially the positives.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 17, 2003",
            "review_content": "\nI don't think I could stress this more: this woman is a horrible teacher.  While the subject material was interesting, it was presented to the class in an unorganized, nonsensical manner.  She likes to hear herself talk and will continue at any cost -- whether she goes off on some rant about an unrelated anthropological book or continues discussing what she originally intended.  She may be intelligent, but has absolutely no teaching skills.  She was my reminder that professors are not necessarily taught how to teach.  Take this course from another teacher if at all possible...I know someone who entered the class wanting to be an anthro minor and ended up giving up on anthro entirely.  \nWorkload:\nTwo papers, a midterm, and a final.  The midterm and final were pretty bitchy...you had to memorize ridiculously obscure facts and a lot of them, but the papers were graded by an extremely lenient TA.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 12, 2003",
            "review_content": "\nThis prof knows her stuff but this intro class will put you to sleep. By the end of the semester, no one was coming to class because it is pointless and a waste of time. It seems that she would be a better prof for higher level classes where she was actually interested in what she was teaching.\nWorkload:\nEasy, some reading but you dont need to do it, two papers, midterm and final\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "June 18, 2003",
            "review_content": "\nWeisgrau is a very boring woman.  She has boring speech patterns, boring anecdotes, and boring, slow class plans that become even slower as she gives her stumbling non-answers to student questions.  Seriously, anthro folks, this class could be good, there's some great material -- just WAIT FOR A GOOD TEACHER.  That's right.  Don't take it from some depressing hack.\nWorkload:\nTwo really easy papers, two tests.  An easy grader, although you should study for the tests.  The reading is short, and the main text is a joke; she also posts lecture notes.\n"
        },
        {
            "course_name": "Living in Society",
            "review_date": "January 09, 2003",
            "review_content": "\nI strongly disagree with the previous reviews. Prof Weisgrau is an extremely knowledgable, fascinating, and enthusiastic professor- maybe one of the best profs I've had! I took the intro course with her and was so happy that I had her again for Living in Society. This lady  knows her stuff! She is very enthusiastic about what she teaches, is very clear, and gets her students engaged in what she is talking about. Anthropology itself is a theoretical discipline and some people can't really handle that aspect of it, but Prof Weisgrau makes anthro fun. In Living In Society, she discussed each of the readings clearly, in depth, and was excited to teach the material. The course was more like a discussion in which everyone could contribute their ideas. I totally disagree with the last review, Prof Weisgrau addressed all questions and showed true concern when someone did not understand.  On top of the fun dynamic of the course, many students agreed that the reading material was extemely fascinating, and that the prof is very intelligent and approachable. She really wants you to understand. We coud listen to her speak for hours. There is a decent amount of reading, you don't have to do it all for the exams, but you know you're missing out if you don't as the class discussion on the readings get really interesting.\nMy only minor complaint would be the over emphasis on 'kinship' and 'kinship and biology', (something that she really loves to discuss), but besides that the other topics she discusses with the class are very interesting (i.e new reproductive technologies, new family structures, race/economy/blood and family). You'll learn a lot in this class and can definitely earn an A. A great course, and a wonderful much recommended Professor.\nWorkload:\ntake home midterm, final, one short film response essay, kinship chart, and class participation.\n"
        },
        {
            "course_name": "Living in Society",
            "review_date": "December 17, 2002",
            "review_content": "\nThis was, hands down, the worst class of my college career.  The professor did not seem to know anything about anthropology, aside from the one basic statement, \"kinship is not about biology\" which we discussed EVERY DAY OF CLASS.  Literally, we never touched on any other topics.  The professor lectured at the class as though we were thirteen, even though the majority of the class were anthro majors.  Her lectures were rambling and often incoherent, and she wouldn't clarify statements when students asked direct questions.  She blows off any intelligent comments that were not directly quoted from the readings, as it appears she does not understand the theories behind the readings she assigns.  The readings were interesting, but at a very basic level, unsuitable for an upper level class.  All in all, the professor's apparent lack of knowledge about the discipline, her disintrest in intelligent comments, and preference for direct regurgitation on assignments made for the dullest, most uninspiring class offered at Barnard or Columbia.  If it weren't required for the Barnard major, I can guarantee no one would ever take it.  Stay away at all costs, I actually feel dumber after sitting through a semester of this class.  I thought I would get an \"A\" but since her grading system consists of randomly putting letters on assignments without reading them, I have no idea what to expect.  DON'T TAKE THIS CLASS WHATEVER YOU DO!!!\nWorkload:\nLight - easy family tree project, readings you didn't have to do, take home midterm summarizing readings, movie review, and final paper.\n"
        },
        {
            "course_name": "First Year Seminar: Family and Cross cultural perspectives",
            "review_date": "April 25, 2002",
            "review_content": "\nI felt that she was a bit arrogant and likes to hear herself speak alot, but nonetheless, the class was a good seminar. Many of her articles were very interesting. At times, you didn't even have to be prepared for class and you can bullshit your way through. The discussion is contemporary and relevant. She tends to focus on Indian culture because that's where she did her field studies\nWorkload:\nDecent 4 3-5pg papers....a mock trial in class\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "September 09, 2001",
            "review_content": "\nThe first day of class seemed okay, but after that... I was in for it. The professor is very dry, dull, and speaks in monotone. The material however, was very interesting, and the class had such potential to be great. But I could not stay awake in class, and doodled most of the time. Some people were very talkative, and seemed into the material, but not her. The TA was soo helpful, she held a review session before the exams, and we all wish she taught the course.\nWorkload:\n2 papers, 1 midterm and final. She posts the all the notes on the web and has some office hours. Overall, not too bad, but not worth the boring lectures.\n"
        },
        {
            "course_name": "Conception and the Fetus (Cross-Culturally)",
            "review_date": "July 07, 2001",
            "review_content": "\nProf. Weisgrau was awful, awful, awful. The reading, on the other hand, was fascinating... If only this class were taught by another professor! She runs her seminars like lectures, droning on and on about the same three points. Count on endless repetition, redundancy, and slow, over-enunciated speech. Quite frankly, it was insulting.\nWorkload:\nOne 15-page research paper, and each student facilitates class once each semester \n"
        }
    ]
}