{
    "prof_info": [
        {
            "prof_name": "Kledja Bega",
            "prof_id": 11266,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 14, 2015",
            "review_content": "\nDr. Bega is absolutely amazing. She is such a sweetheart, and is always extremely excited about the material (as mentioned by other reviews, especially in regards to the astrophysics section - her specialty). Though the nature of a 2-hour FroSci discussion leaves you dreading going to class, Dr. Bega tries her best to engage everyone in the material. She's possibly one of the happiest people I have ever met, and also one of the kindest, and most intelligent. When you ask her questions, she really knows what she's talking about, all the while understanding that most kids don't really enjoy the lecture. \nShe also basically gives you all of the information you would ever need to know for any FroSci exam, and she is suuuuuper lenient on assignments. \nThe only pain was that instead of the homework being due on Fridays (like everyone else's), it was due on Thursday. Eventually that got to be nice because then while everyone was struggling to finish their FroSci homework before they went out (or while they were already half-drunk), mine was already done and out of my hair.\nWorkload:\nTraditional FroSci workload - all homeworks are graded on completion. \nTwo quizzes before the midterm (generally easy - and pretty much count for nothing)\nGraded on participation (aka showing up to class)\nMidterm\nFinal\nFinal Project\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 11, 2014",
            "review_content": "\nProfessor Bega is phenomenal! I went into the class doubtful of what new knowledge it could possibly bring to me as a student already majoring in a science. While the Big lectures were...ok, Kledja's enthusiasm in the seminar made me really enjoy this mandatory class. In particular, the Physics portion of the class is when she really becomes animated. \nIf you are lucky enough to have her, you may find yourself enjoying this class more than you thought you would.\nWorkload:\nModerate FroSci Assignments\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 21, 2013",
            "review_content": "\nKlejda was able to turn Frontiers of Science into a very enjoyable class. She was able to clarify tough material from lectures in seminars, and her enthusiasm complemented her knowledge of the topics, especially the physics section (she has a physics Phd and Emlyn Hughes was actually her PhD advisor at Caltech). If you have Klejda for your seminar leader then you should definitely stay in her section! She gives quizzes at the end of each of the four frontiers topics which are usually moderately difficult, but only count towards your participation grade. You should study for these quizzes by going over the key questions on the syllabus for each week and coming up with answers to the questions. Participation in Frontiers of Science is very important as it actually counts towards a percentage of your grade, you can participate by offering relevant information during every class and appearing attentive. The draft for the term paper is \"optional\" but you should definitely do it as Klejda gives very helpful feedback on how you should change your draft in order to synthesize a final product that meets her specifications. There was an optional review session before the final where Klejda went over much of the information which was required to know for the final and this was extremely helpful.\nKlejda is from Albania but speaks English very clearly (went to undergrad/graduate school at Caltech) and with only a slight accent. Going to office hours is very helpful and I highly advise you to go to office hours whenever you have any questions (and you're forced to go to office hours because homework is due during office hours). If you're unsure of anything and worry that you may sound unknowledgeable by asking questions, then you can definitely talk to Klejda during office hours. Asking relatively complex questions during class is also a great way to show your participation (you can also answer questions that Klejda poses).\nFrontiers of Science able to be an enjoyable class for me thanks to Klejda, she's a really great seminar leader.\nWorkload:\nNo extra coursework other than the required frontiers workload which consists of weekly homework assignments, midterm, final, museum visit, and term paper (some classes had extra assignments and had to do peer reviews for the paper). Extra credit through going to one of the events (i.e. astronomy star watching, Brian Greene lereview_content. review_content for midterm and final are optional but you should definitely go.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 07, 2013",
            "review_content": "\nKledja was an amazing seminar leader. If you were assigned to her section--STAY! She always came into class super excited to be teaching! During the seminars, she'd explain the lecture so clearly and basically go over what you need to know for the midterm and the final. She'd give us feedback on the homework and quizzes; she even set up one-on-one meetings to discuss the midterm and our projected grade for the course.\nAnd just wait for when you get up to physics! She herself is a physics person, so she gets unbelievably excited for it!\nYou are so lucky to have her!\nEnjoy your semester!\nWorkload:\nNormal weekly homework's, four quizzes for each section, midterm, final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 17, 2011",
            "review_content": "\nKlejda was great. Period. I'm not a fan of frontiers and thought most of the lectures were unbelievably boring. Still, for all that I didn't understand at the lecture, Klejda was able to very quickly explain all that we actually needed to know during our discussion section and explain it in a way that made more sense. She's also very concerned about whether or not she's teaching well and would ask us frequently if she was explaining whatever in a way we understood, even setting up a survey at one point to make sure she was helping us. \nHer grading was also really helpful. She always leaves informative comments. I don't think I made less than a 100 on any assignment.\nIf you're in her section, stay in it. \nWorkload:\nStandardized midterm and final, WIAs (which are just going to suck anyway), participation, in class assignments that aren't graded\n"
        }
    ]
}