{
    "prof_info": [
        {
            "prof_name": "Elizabeth Kendall",
            "prof_id": 2095,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Structure and Style I",
            "review_date": "January 08, 2006",
            "review_content": "\nI found Prof Kendall to be a complete delight.  She has a wonderful energy that she brings to the classroom and is very supportive.  She also offers helpful criticism and insight to her own career.  Taking class with her brightened a semester of annoying self obsessed profs and goes highly recommended.\nWorkload:\nmoderate.  2 poems, a scene, a monologe, short story.  She doesn't ask for more than required.\n"
        },
        {
            "course_name": "W3034 Cultural Criticism",
            "review_date": "May 16, 2004",
            "review_content": "\nElizabeth Kendall co-taught this class with Margo Jefferson, and did most of the line editing this semester. She's just as smart but definitely less enthusiastic than Margo, who tends to be quite ebullient. Elizabeth, by contrast, is more reserved and on occasion can be quite shrewish, though she just as often is quite personable (especially in office hours). As an editor, though, she is always excellent with her criticisms.\nThe class itself is ideal for anyone considering journalism, particularly criticism in the arts, as a career. You do a fair number of reviews - one each of film, dance, and books - and also some essay writing, and while only one gets workshopped in class the comments you get back on papers are often spot-on and quite helpful. Anyone in the creative writing program (or reviewers for the Spec or any other campus periodical) should seriously consider this class.\nWorkload:\nNot bad at all....some short reading assignments, three reviews and two personal essays, which have to be revised for the final portfolio. Participate in class, don't come late, and go to office hours as often as you can.\n"
        }
    ]
}