{
    "prof_info": [
        {
            "prof_name": "Jessica Kimpell",
            "prof_id": 12028,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Nationalism, Republicanism, Cosmopolitanism",
            "review_date": "January 31, 2014",
            "review_content": "\nKimpell is a fantastic professor, and this is a great class. Take it. \nShe opens with a ~25 minute lecture, and does an amazing job at explaining some complicated philosophical texts. The rest of the class is a discussion and she does a good job at challenging people and making sure they stay on point.\nShe is very sweet, and incredibly smart, but also, very strict. She doesn't give out extensions, or even small things like letting you exceed the page limit. It's not a problem with the class, but just be advised that she is not the most easy-going, laid-back professors out there.\nThe class itself was fascinating. I was really surprised how much I enjoyed it, mostly because I had no idea what the title means. \nGrading:\nSo I got a B+ on the first paper, an A- on the midterm, don't know what I got on the final paper but I ended up with a nice A. Participation is 20% but I have a feeling that people who participate tend to do well in the class no matter what. So just try to participate in class as much as you can (don't bs, she knows her stuff), and do fairly well on other things, and you'll get an A.\nMake sure you take good notes, she explains the material VERY well, and that's really all you need for the papers and the mid-term. \nWorkload:\nAverage.\nFirst Paper - 4 pages, make sure you have counter-arguments: she LOVES counter arguments\nMid-term: she hands out 5 questions before the test, and asks 3 on the test. Memorize bullet points for every question and you're good.\nFinal paper - 8 pages, same as the first one.\n"
        },
        {
            "course_name": "Nationalism, Republicanism, Cosmopolitanism",
            "review_date": "July 16, 2013",
            "review_content": "\nI'm happy I took this class. I didn't come into this class very interested in the material (mostly because I didn't even know what the title of the class meant), but she found ways to make it relevant. Her discussions made me question things I have always believed. Professor Kimpell is very approachable and eager to meet with you about questions. I have never had a professor better at leading discussion. I would take another class with her just to be in the same room as her.  \nWorkload:\nI didn't do most of the readings, and I skimmed the ones I needed to. Participation, a take home midterm essay, a final paper, and a final--prompts were handed out ahead of time.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 11, 2012",
            "review_content": "\nProfessor Kimpell is a great professor for CC! The workload is quite intense as is any CC course workload. The discussions she leads are sometimes dry but most of the time they are engaging and she tries to get everyone involved. She is someone who will give you all of the help you need as long as you reach out to her. She cares a lot about the class and will lead great discussions as long as people are willing to participate.\nWorkload:\nTypical CC readings (about 200 pages a week), two papers with pretty interesting topics, a midterm and a final, for which she gives you the questions beforehand. \n"
        },
        {
            "course_name": "Nationalism, Republicanism, Cosmopolitanism",
            "review_date": "May 04, 2012",
            "review_content": "\nProf. Kimpell is one of the best professors I have had in Columbia thus far. She is so brilliant it is actually ridiculous but at the same time she makes her classes so engaging and accessible that it's not intimidating at all. The material is rather abstract, which makes sense considering it's Political Theory, but really I have never had a class which was so worthwhile before. She barely lectures, spending more time having a discussion which worked out well because the class was merely 20 or so people (shoutout to Fred the Auditing Old Guy). Kimpell will meet with you as often as you want and seems to have a vested interest in your success, unlike other professors here. This class really felt like CC Redux in a good way, and I learned a lot. DEFINITELY TAKE THIS CLASS.\nWorkload:\nTwo 5-7 page papers, 1 midterm made up of 3 essays but we got the prompts in advance so that rocked. Pretty interesting reading for each class and it's generally not too much.    \n"
        }
    ]
}