{
    "prof_info": [
        {
            "prof_name": "Feng Li",
            "prof_id": 1088,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "January 06, 2014",
            "review_content": "\nLECTURES: Professor Li is a great lecturer. His lectures are concise yet thorough. In the beginning of class he writes key terms on the board. Learn these terms and you should be set for the exams. One thing to note about the lecture is that his accent can be hard to understand at times thus sitting in the front of the room is helpful. \nPAPERS: The first paper is a text-analysis type paper. It's roughly ~5 pages and is worth 10% of your grade. The second paper is a short research paper roughly ~9 pages and is worth 15% of your grade. For both papers, you're given ample time and a list of suggestions of topic. However, bewary: the first paper deadline falls very close to the date of the midterm. Do not procrastinate on the paper or studying for the midterm as having to do both in one day is not fun. Overall the grading of the paper was pretty strict. I worked pretty hard and still ended up with a B. \nEXAMS: 3 sections on each exam: Multiple choice/fill in the blanks, key term ID (usually the terms written in the beginning of each class), and an essay. The essay is usually a hefty 60% of your grade so do well on this. The Key term ID's are also a good way to get points. The best way to say everything they want is to ask yourself: who, what, when, where, why. I think they liked it when I specifically stated out the significance of the term. \nPARTICIPATION: Each week there is a recitation and a weekly post due. The weekly post is usually about the questions the professor uploads on courseworks but there is usually lots of freedom as to what you can talk about. Attend recitation and talk. Ask questions. That's what it's there for. If you don't just sit there like a log then I'm pretty sure this part of the grade is in the bag. \nREADINGS: Oh god the readings. There are a lot of boring, repetitive readings. I won't lie, I didn't do a lot of them. However, whats important is to read over the certain texts Professor Li mentions in class before the midterm just so you get some ideas rolling around in your head. Chances are that they will a. appear on the exams, b. will be talked about during recitation. \ntl;dr? \nPay attention in class. Plan ahead for the papers. Be smart about the readings. You'll be fine. \nWould recommend to anyone remotely interested in east asian civilization and looking to fulfill a global core requirement. \nWorkload:\nWeekly posts + participation in discussion section: 10%\n1st paper: \"analyze the text\" type, ~5pgs: 10%\n2nd paper: research type, ~9 pgs: 15%\nMidterm: easy-medium difficulty, 25%\nFinal: medium difficulty, 40% \nreadings: lots of boring readings. see above for explanation \n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "May 02, 2012",
            "review_content": "\nThis is a wonderful class!\nAs many of the previous posts indicated, there is A LOT of information to learn in this course. Although it is advisable to keep up with the reading, there will definitely be weeks when you're like \"f**k this ish\" (shout out to my pre-med crew). BUT you should make up for this by attending class and reading your classmates posts before you go to class discussion to at least know what is going on that week. Also, take good notes, it'll save you in the long run!!\nGood luck :D\nWorkload:\n2 papers (first is 5-6 pgs, second is 7-8 pgs)\n1 midterm and 1 final\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "May 12, 2010",
            "review_content": "\nAs some of the other reviews have mentioned, this course suffers from intrinsic flaws such as the amount of history covered in one semester. The information is vast, but keeping good notes will save you as the tests cover only what was spoken about in class. That said, readings are important to prep for lectures, particularly to become familiar with the Chinese names of people and places so you arent ten words behind trying to figure out what he said. \nWatch out for the midterm...minimal information is given as to what to focus on specifically. The TA's become helpful here in sorting out which dates to remember and which primary sources to read thoroughly. The final is very similar to the midterm, but both are heavily weighted on the essays, so be prepared to write three single spaced pages about the big topics.\nProfessor Li is a great professor- of the best Ive had at Columbia. Very knowledgeable and approachable and truly cares about the material and the students. Definitely sit up front if you want to hear everything he says as his volume does fluctuate and almost drops out at points. \nCan get an A by putting in just a bit of extra effort; can get away with not doing all the reading provided you have good notes. I knew nothing about China going in and have acquired a serious amount of knowledge, which feels nice compared with how you walk away from some other classes.\nWorkload:\nTwo essays, midterm, final. \nGrading: They will catch laziness on essays.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "May 10, 2010",
            "review_content": "\nI agree with some of the past reviews about Prof. Li being a well-organized and dedicated lecturer. He moves quickly, his accent is a little heavy at times, and he undulates the volume of his voice throughout his lecture, at times speaking very inaudibly, so sometimes he is hard to follow, but he has a sense of humor and is very approachable and eager about helping his students understand the history of China. However, I also agree with past reviews that the class agenda is exceedingly ambitious, and, to me, impractical. Though Prof. Li puts a lot into his lectures, he cannot sum up each dynasty and all the social, political, and economic events within it in 2 1-hour classes each week. It is too much to try to cover 4000 years in 14 weeks (but I must admit that Prof. Li makes an outstanding effort). Also, the grading is a little unbalanced, and to me, unfair. The bulk of your grade (65%) depends on the midterm and the final, which themselves place the bulk of the grade in one area, so be sure you pay attention to everything said in class and read the readings thoroughly. Although the majority of the information won't be on the exams, the part that is will expect in-depth knowledge of that content. \nWorkload:\nLots of long, boring readings (though occasionally there are some interesting ones) from primary and secondary sources, weekly discussion posts, 2 papers (5 pages and 8 pages), a midterm, a final\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "May 10, 2010",
            "review_content": "\nI agree with some of the past reviews about Prof. Li being a well-organized and dedicated lecturer. He moves quickly, his accent is a little heavy at times, and he undulates the volume of his voice throughout his lecture, at times speaking very inaudibly, so sometimes he is hard to follow, but he has a sense of humor and is very approachable and eager about helping his students understand the history of China. However, I also agree with past reviews that the class agenda is exceedingly ambitious, and, to me, impractical. Though Prof. Li puts a lot into his lectures, he cannot sum up each dynasty and all the social, political, and economic events within it in 2 1-hour classes each week. It is too much to try to cover 4000 years in 14 weeks (but I must admit that Prof. Li makes an outstanding effort). Also, the grading is a little unbalanced, and to me, unfair. The bulk of your grade (65%) depends on the midterm and the final, which themselves place the bulk of the grade in one area, so be sure you pay attention to everything said in class and read the readings thoroughly. Although the majority of the information won't be on the exams, the part that is will expect in-depth knowledge of that content. \nWorkload:\nLots of long, boring readings (though occasionally there are some interesting ones) from primary and secondary sources, weekly discussion posts, 2 papers (5 pages and 8 pages), a midterm, a final\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "August 10, 2007",
            "review_content": "\nProfessor Li is one of the most dedicated teachers and organized teachers I've ever seen.  He puts a LOT into his lectures, which are interspersed with maps and images, and personally reads and comments on students' weekly posts (mind you: this is a large lecture class).  Very responsive to e-mails and research questions.\nThe class itself, however, suffers from some existential flaws: covering all of Chinese history in one semester is a mammoth undertaking.  You'll cover a dynasty a week and barely scratch the surface.\nTake the professor, but think hard before taking the class.\nWorkload:\nTwo papers (first: 3-5 page analysis of a primary source; second: 7-9 page research paper), reasonable midterm and final.  Weekly discussion section and weekly post.  Huge volumes of primary source reading assigned, mostly on Chinese thought and mostly abstract, unnecessary, and untested.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "June 05, 2007",
            "review_content": "\nProf. Li was my favorite teacher last semester - he is an amazing lecturer and fair grader. I can't believe how much history I've learnt over the past few months. He clearly structures each class to make everything clear and comprehensible. It can get overwhelming at times but we have discussion sections to sort out any problems. Hands down best lecturer ever.\nWorkload:\nA lot of weekly reading but not really necessary, weekly discussion posts, 2 papers, midterm, exam\n"
        },
        {
            "course_name": "Introduction to Chinese Civilization",
            "review_date": "May 09, 2007",
            "review_content": "\nProfessor Li is the best professor I've had at Columbia. Even if you're not an EALAC major, take his class for Major Cultures. He is caring, enthusiastic, knowledgeable, everything a good professor should be. His lectures were highly engaging; he brought in personal expereince alongside his encyclopedic knowledge of Chinese history (and I didn't find his accent a challenge). He really cares about his students, and knows how to run a class.\nSections were engaging and productive, and readings and papers were helpful and not overwhelming. It's amazing that we covered such a huge amount of information in such an efficient, manageable, and enjoyable way. Highly, highly recommended. Even if you only take a class with him for MC, you will appreciate the calibre of his teaching and the organization and focus of the class.\nWorkload:\nsection every week, 100-150 pages of reading a week (you can get by not doing it all), 2 short papers (1 a research paper), very fair midterm and final\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "November 18, 2003",
            "review_content": "\nHE's GREAT!  Very organized lectures and when he teaches you can tell that he is VERY passionate about the subject and teaching.  He's very approachable and he's great with emails.  If you go to class and the review sections, I cannot forsee you doing poorly in his class.  An A range grade is definitely attainable.  He's GREAT!!!!!!!!!!!!!\nWorkload:\nMiderm, Final, 2 Papers\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "June 01, 2003",
            "review_content": "\nProfessor Li is a diligent, caring professor who puts exorbitant effort into lecturing his classes and aiding students in understanding the material. This class is an introductory class in Chinese history and civilization, so the workload, although fair and manageable, was appropriate. Professor Li prepares every lecture with painstaking effort, trying desperately and often successfully to overcome the language barrier that encumbers so many non-native professors. But aside from the somewhat thick accent, Professor Li makes his lectures generally very enjoyable and understandable, and any confusion will be cleared up if you ask him a question after class or e-mail him. He is very prompt about responding to students' questions and concerns. Generally, this class was very enjoyable and hopefully sparked some interest in East Asian studies in some students, although many are just taking it for the MC requirement. Kudos to Professor Li; any accolades he receives he has earned.\nWorkload:\nTwo papers, one before and one after the midterm. Their topics are exceedingly flexible, although the grading is not so lax, since the TAs grade them in general. A midterm and final that require attending class and no more, since the assigned readings, although overwhelming, are not necessary in light of the midterm and final. People should, however, skim the readings for personal interest in the subject, for the texts are very well written, and Professor Li makes a genuine effort to post interesting articles and links on his webpage.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "April 23, 2003",
            "review_content": "\nWhat a great teacher! Prof. Li is a very enthusiastic professor who cares a lot about both his students and the subject. You can totally feel his excitement when he lectures, especially when it's about ancient Chinese archaeology. Email him one question and he'll return a 3-page detailed reply along with URLs, book names, and other information in case you want to find out more about the matter on your own. He speaks English with an accent, which may take a lecture or two to get used to, but generally it's not a problem. In fact, if you know the context (i.e. you don't sleep in class), a few missed words here and there are not a problem at all. I highly recommend Prof. Li for any class. (A sidenote that's not related to the professor but to the class: there's usually a large number of freshmen who are there just for the MC requirement and care nothing about the material, such as the other \"reviewer\" who recommends the course because it's easy. their inane chatting during class and recitations and do-only-as-much-as-needed-for-the-A attitude can be extremely annoying. Notice there's no comma between \"freshmen who\" above; I don't mean all freshmen are like that, nor only freshmen can be like that. But most of the annoying people are freshmen. If you're one of them, please consider improving your attitude towards your education. What a waste it is to come here and make a numeric average your goal in life.)\nWorkload:\nA fair amount of reading, not all of which has to be memorized. Read the books once, go to the lectures, write down the key points, and you should do fine in exams by reviewing your notes. Papers, as always, are only as hard as you want them to be. As implied by the review above, there're a lot of people in the class who have no problem with writing nothing but b.s.\n"
        },
        {
            "course_name": "Introduction to East Asian Civilization: China",
            "review_date": "May 08, 2002",
            "review_content": "\nThis is a great class to take for your MC requirement. Very little work (readings not strictly necessary, but assigned in case you're interested) but he still goes through the material enough that you can learn it. The discussion section was ultra-boring, but if you go to every one and post to the board weekly (any old crap your brain vomits is fine) it boosts your grade, because most people are too lazy.\nWorkload:\nReadings (whatever), two easy papers of 4-5 pages, pretty easy midterm&final.; Standards are really not too high in terms of having to learn a lot of facts or come up with trenchant analyses.\n"
        }
    ]
}