{
    "prof_info": [
        {
            "prof_name": "Antonio Tomas",
            "prof_id": 2736,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Film and Culture",
            "review_date": "January 18, 2007",
            "review_content": "\nI generally have big isues with condescending TAs who come to section meetings unprepared and struggle to provide clarity on the lectures. Antonio has renewed my faith in TAs.\nAs mentioned before, Antonio's mannerism can throw you off a bit at first, but as the section meetings progress your admiration and respect will grow.\nAntonio is the ideal TA because he does not condescend to undergraduates, and instead treats your views with respect even when he disagrees. \nHe is very bright, and speaks multiple languages and brings a very fresh perspective to the topics each week.\n\nWorkload:\nMid Term, Final and a Film Journal.Moderately heavy reading.\n"
        },
        {
            "course_name": "Film and Culture",
            "review_date": "January 18, 2007",
            "review_content": "\nI generally have big isues with condescending TAs who come to section meetings unprepared and struggle to provide clarity on the lectures. Antonio has renewed my faith in TAs.\nAs mentioned before, Antonio's mannerism can throw you off a bit at first, but as the section meetings progress your admiration and respect will grow.\nAntonio is the ideal TA because he does not condescend to undergraduates, and instead treats your views with respect even when he disagrees. \nHe is very bright, and speaks multiple languages and brings a very fresh perspective to the topics each week.\n\nWorkload:\nMid Term, Final and a Film Journal.Moderately heavy reading.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 21, 2005",
            "review_content": "\nAt first I was slightly upset that I'd gotten Antonio as a TA -- the discussion sections were 10am Fridays and he talked very slowly and who could make sense of Prof Taussig's lectures ANYWAY?  But I soon changed my mind -- Antonio is amazingly intelligent, well-read, and thoughtful.  He considers everyone's ideas thoroughly, sometimes even emailing us outside of class to finish a thought, and focuses on connecting all the readings to one another, which is very helpful.  He speaks about seven languages and comes at everything from a vastly different -- and more personal and engaging -- perspective than most other CU Anthro students you'll encounter.  He's a fair (though somewhat arbitrary) grader and a great guy.  Highly recommended!\nWorkload:\nSame as every other TA\n"
        }
    ]
}