{
    "prof_info": [
        {
            "prof_name": "Dvora Cohen",
            "prof_id": 3485,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "March 14, 2010",
            "review_content": "\nI had Linear Algebra with Dvora during the summer semester of 2009. I found her explanations to be very clear, in spite of the difficulty of the subject matter. I truly believe that any mature student who has a solid background in Calculus and Differential Equations will be ok in this course. Dvora seemed very approachable and had no problems answering questions. I don't know how accessible she was because I work full time but she did offer opportunities to meet before the class to go over the homework. I found this to be very helpful. I would take her again.\nWorkload:\nThe workload for the summer was weekly homework assignments. There were two exams; a midterm and a final. The exams were difficult because the problems were not exactly in the same format as the homework, but the concepts were the same.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "November 05, 2009",
            "review_content": "\nI had the unfortunate experience of having her for Linear Algebra over the summer. Dvora is someone you want to avoid at all costs, even if it means taking the class a different semester. She has no problem ridiculing a student in front of the entire class, and is unavailable to help when asked. She will ensure that all students in the class know which students are doing poorly. Her explanations are unclear and disorganized, and if you ask for clarification she will tell you how simple it is and that you should have understood it the first time. I cannot stress enough how much you want to avoid her.\n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "April 01, 2009",
            "review_content": "\n I liked this teacher. She is very very reasonable. I recommend her. There is no surprises if you study. everything that she asks for is in the book so if you miss class(or all the classes) you can still do very well if you just read the book. That's it! She teaches you on effective methods how to solve equations and other stuff. I find that to be more effective than memorizing. She is very good as working around office hours that would work for everyone. She does responds to e-mails quickly. Sometimes she cancels classes d/t holidays. She holds extra hours for midterm and final reviews. As far as her personality goes she is pleasant. She tries to remember your name but she is not gonna sit down and explain everything to you till she is blue in a face if you still don;t understand. It's like: \"Hey, I don;t ask too much from you guys, do what you have to do, it is easy{and it is really is}, and don;t bother me.\" That works for me, just as I said, if there is no surprises...and there weren't any. Thank you Dvora. \n"
        },
        {
            "course_name": "College Algebra - Analytic Geometry (Precalculus)",
            "review_date": "March 30, 2009",
            "review_content": "\nDvora is really not a good instructor. Her lessons are unclear and she virtually goes out of her way to make you feel stupid for asking questions. She picks favorites, usually students who are doing well in the class, and will point out students who are not doing well in front of others. Try your best to avoid this teacher.\nWorkload:\nHomework that takes about 2 hours a week. There is also a midterm and a final\n"
        },
        {
            "course_name": "pre-calculus/trigonometry",
            "review_date": "March 27, 2009",
            "review_content": "\nDvora is hands down the worst teacher I have ever had. She is rude to students, will point out students who are doing poorly in front of the entire class, and has a general attitude that she has better things to do. When you ask her a question, she will say things like \"You don't understand that? Thats easy, you should understand that\". She moves far too quickly and does not explain any of the concepts clearly. Avoid this instructor at all costs, even if it means you will need to wait to take the class the next semester. It should also be noted that after speaking to the dean of students, I learned that a number of other students have complained about this teacher as well.\nWorkload:\nHomework assigned once a week that she does not check, takes roughly 2-3 hours to complete. Quiz once a week covering what was covered in the homework. Midterm and Final\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "August 22, 2008",
            "review_content": "\nDvora is amazing! She is really clear and genuinely cares about students learning the material.  She goes over the proofs and examples in such a way that teaches the students the methods rather than simply encouraging memorization.  Her enthusiasm for teaching the material is contagious-I looked forward to going to class!  The only thing is that she definitely likes a bell-curve distribution set around B-, so she does not usually curve since this is generally where the exam grades fall.  But go to class and do the work and you are fine!\nWorkload:\nModerate... the problem sets weren't bad, but the midterm and final were very long--3+ hours were needed to complete them.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "August 22, 2008",
            "review_content": "\nThis is a very straightforward class, and if you have a decent calc foundation (whether through calc I or the AP test), this will be cake. She distills all the book lessons into major points and puts them up on the board. She'll write out all definitions and theories. All new concepts are followed up with numerous examples, which are similar to homework problems (if only slightly simpler). The homework assignments are very, very reasonable (average half an hour to 45 minutes), and they're usually all odd numbered problems, so you can check answers in the back of the book. Midterm difficulty is similar to the homework (which is to say, pretty easy); there are no surprises. The class was split into two main parts: methods of integration and series/sequences. The second part is less intuitive and more annoying, but she usually explains concepts multiple times.\nShe sometimes cancels class due to holidays, but she will always have make up sessions. She's pretty accessible by email and will hold extra office hours before exams. In short, this is probably one of the easiest calc II sessions out there. And you don't have to deal with any incomprehensible accents.\nWorkload:\nWeekly homework quizzes (one problem taken directly from the homework, and since all homework probs are odd-numbered, it's really, really hard not to get 100s), two very easy midterms that don't even take the whole time, and one harder final (but still reasonable and doesn't take the whole three hours). \n"
        }
    ]
}