{
    "prof_info": [
        {
            "prof_name": "Rosalind Morris",
            "prof_id": 835,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Ethnography of the Everyday",
            "review_date": "December 21, 2010",
            "review_content": "\nI have had Prof. Morris for two classes thus far, a large lecture class (The Ethnographic Imagination) and a seminary (Ethnography of the Everyday). While this review is informed by the former, it is principally about the latter.\nSome find Prof. Morris intimidating. If that is case, it is because of her sheer brilliance -- not because she is in any way ever less than engaging, encouraging and constructive. At the risk of being accused of exaggeration, I will say that to spend any time with Prof. Morris is to emerge a better person.\nThis seminar in particular was possibly the best experience I have had in my four years at Columbia. The readings were appropriate and engaging, the workload as interesting as challenging, and the classroom itself was well run, with Prof. Morris ensuring that the discussion stayed intellectually solid and relevant to the materials at hand.\nWhile much of the course content may have been of specific interest to Anthropology majors, I would recommend Prof. Morris to anyone who is willing to take the time and effort to get involved in her class. She is rigorous and demanding, but she is also always fair.\nWorkload:\nThe readings are difficult but worthwhile, and the written assignments of fair quantity. Prof. Morris reads all students' works carefully and makes helpful comments.\n"
        },
        {
            "course_name": "Mass Mediations of Modernity",
            "review_date": "December 12, 2009",
            "review_content": "\nProfessor Morris frustrates me. She's brilliant and direct with a wonderful sense of humor sometimes, but at other times she can be cold and unapproachable. She's also inconsistent in her policy towards academic bullshit. I didn't mind how much we had to read, I just hated that about half of it was essays in which the anthropological buzzwords and name-checking were more important than the actual argument. If she were just a terrible professor I wouldn't have cared, but she has so many good ideas that I found myself really caring about the class, even when I hated it. I'm not sure whether it's better to avoid the class altogether or put up with the worst of it. It's up to you. Just be prepared for her to surprise you in good ways and bad.\nWorkload:\n*at least 30 pages per week\n*1-2 page response papers that weren't really graded or handed back\n*a group presentation on one week's readings, with a longer response paper\n*10-15 page final paper\n"
        },
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "May 06, 2009",
            "review_content": "\nProf. Morris obviously knows her stuff. Her lectures are eloquent and brilliant, but many times incomprehensible and convoluted. She does not avail herself to students and seems inaccessible.  The readings were time consuming and extensive but tied together well and most were pretty interesting. As an anthropology major I enjoyed the class as a whole but would quickly suggest other classes if you're looking for a basic anthro course with a professor more obviously passionate about the subject. \nWorkload:\n6 three page responses (1 per section of reading), discussion section, 12-16 page take home final due a week after the last day of class\n"
        },
        {
            "course_name": "Mass Mediations of Modernity",
            "review_date": "December 12, 2008",
            "review_content": "\n This woman exemplifies the archetype of the brilliant professor who hasn't got the time of day for her students. It's up to you to decide whether you want to take class with someone whose powers of ideological synthesis and interpretation are truly staggering, or whether you'd rather take a class with a professor who will bother to actually answer even a TENTH of the emails you send her. \nWorkload:\nWeekly reading-- it's a LOT (sometimes entire books, and more, every week) but you don't really always have to actually do it\n1 12-15 page term paper [except she distributes the topics so late in the semester you have about two weeks (not an entire term) or less to do the paper if you want to use one of her topics, which almost every student in my class did]\nEvery other week you must submit a 2-5 page media diary on a topic you choose at the beginning of the semester. These can be easily shat out in three hours, or even two, the day before they're due, but they do require you to be full of interesting ideas and synthesize your own thoughts with what's in the reading. She doesn't grade these, but will write a ton of comments on them, and never tells you how well you're actually doing on them or how they'll translate into your final term grade \n"
        },
        {
            "course_name": "Mass Mediations of Modernity",
            "review_date": "January 20, 2008",
            "review_content": "\nIt's true: she's brilliant. You'll find yourself in class copying her lectures word for word because she's so eloquent. She  makes you think, and despite how dense and analytical everything may seem, she repeats things enough for you to understand the main points. She's got a soft voice so sit near the front, but she supplemented the class often with interesting video and audio. The readings were excellent, but who doesn't love McLuhan? Class discussions ranged from non-existent to excellent, but on the whole, everyone has something to say about media. \nOne of the best classes I've taken. She's incredibly accommodating and helpful outside of class. You will want to do well to impress her. Highly recommended.\nWorkload:\nReasonable weekly readings (never impossible), movie screenings, bi-weekly media diary (easy, can be fun if you pick the right media), midterm paper (3 pages, 3 questions, take home), final paper (your choice, 10-15 pages), graded fair \n"
        },
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "June 20, 2006",
            "review_content": "\nRosalind Morris is as thought-provoking, radical, challenging, generous, poetic, tough, shy, bold, knowledgeable, deeply sensitive, open-minded, and thoughful as it gets!  What a beautiful human being, at once bringing you to tears with her intelligence and surprising you with her delightful sarcasm.  You'll want to be her.\nThis is what Anthropology should aspire to.  You will read a broad range of texts critically, and engage with them in your own writing.  Professor Morris' courses provide an opportunity for deep rigor and creativity.  \nWorkload:\nFierce, demanding, and thoroughly enjoyable.\n"
        },
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "May 01, 2006",
            "review_content": "\nProfessor Morris is very intelligent, eloquent, and passionate about anthropology. It took me a while to get used to her lecture style because she has a soft voice and really likes to narrow in on one specific point and belabor it, but her lectures will make you think. The texts that we read in the second half of the semester were much more interesting than those in the first, and they are all so different that you get a very broad view of different anthropological studies with a focus on ethnography. There is a lot of reading in this course, but I would recommend it for anyone interested in anthropology who wants to be challenged to really think. \nWorkload:\nFive 3-page papers (one due every other week) that generally respond to any of the texts we've read, and a long paper (12-20 pages) that is worth half your grade due at the end of the semester, plus lots of intense reading\n"
        },
        {
            "course_name": "The Ethnographic Imagination",
            "review_date": "April 27, 2006",
            "review_content": "\nIf you are an anthropology major, or have any semblance of developing interest in anthropology, you MUST take this class!! [by the same token, people who want a filler course or superficial cultural analysis should NOT take this class. it will be a waste of your time--and a shame--unless you plan to really engage with Prof Morris and the material]\nProfessor Morris is hands down the most brilliant, challenging and inspiring prof I have had in my past three years at CU. The texts on the syllabus are very interesting, but more than that, her lectures highlight and thematically tie together points and concepts that you wouldn't even think of. The bottom line is, she provokes you to really THINK--think about the texts and think about how you think and listen. By the end of the semester, you will have come so much closer to understanding what it means to be an ethnographer and to write an ethnography. \nAnother amazing thing is that despite/along with her brilliance, she is kind and approachable and promotes class discussion (although I admittedly spent half the semester intimidated by her intelligence). Trust me, if you like socio-cultural anthro right now, after you take this class, you will love anthro. And possibly start laying plans to dedicate your life, or at least your college career, to it. \n\nWorkload:\nheavy reading, but like another person said, you'll want to do it. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 05, 2004",
            "review_content": "\nProfessor Morris is porbably the best prof i have had in college. she is utterly challenging, and teaches the most difficult theory in a lecturte course. that shows how well she knows her stuff. and she doesnt dumb it down either. she also presents issues that will beome very personal for anyone who takes thi class seriously - issues that have to do with how we live in this world. she asks the hard questions that donb't have answers. she gives you the background to ask. she gives yoiu access to some of the most difficult theorists of the past two centuries. take the class, its a secret beauty of this school.\nWorkload:\ntough but youll want to resond to the texts\n"
        },
        {
            "course_name": "spring2002",
            "review_date": "January 16, 2004",
            "review_content": "\nProf. Morris is an eloquent speaker.  Her lectures are long and boring.  She has an extremely low voice, which adds to the difficulty level of this class.  The readings are interesting if you do them all, though itÂ’s a lot.  TAÂ’s help if you are in the session with the better of the two.  Over all her lectures are extremely boring.  You have to listen very hard to hear anything she say.  You will also find your self lost in her sentences as they are longggggg, by that I mean you can follow what she is saying in the beginning of the class, as she continues to go onÂ…youÂ’ll be thinking Â“what is she talking about.Â”     \nWorkload:\n3 long exams, which are alll take home, A LOT of Reading. and pointless discussion session\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 09, 2003",
            "review_content": "\nMorris definitely knows what she's doing and the course content is rich and interesting, although a bit dense.  As for her voice, it is soft and permanently set in high register, but tolerable as long as her mic is working.  Although I must say her rhetoric tends to be overblown.  And often you sit there wondering if the sentence she started 15 minutes ago is every going to end.  Is there some reason that we must use \"religiosity\" when religion will do just fine, or why one cannot connect two ideas  with a simple \"is\" rather than \"that which is to say\"?  She's brilliant, but to call her articulate and well-spoken, if you ask me, is to be fooled by a bunch of verbal froth and stutter.\nOverall, the course is worth taking and Morris is an  insightful and more than competent professor.  Plenty of great material and a few fascinating lectures.\nWorkload:\npretty heavy.  lots of reading.  two midterm exams, one final (all take-home).  mandatory discussion sections with not-so-fabulous TAs\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 28, 2003",
            "review_content": "\nExcellent course (if being taught by Morris). Definitely worth it! Lots of heavy reading and difficult ideas, so be prepared to work hard -- as some of the other reviewers were obviously not. Take this course if you want to be challenged to think about life and academia in new ways, not if you are looking for an easy time and grade.  \nWorkload:\nmedium -- heavy\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 22, 2003",
            "review_content": "\nThis lady knows what she's talking about. She knows the material, she knows what she wants to say and how she wants to say it. But that didn't make it terribly interesting for me. Her voice seems to come up in a lot of the reviews, and I have to say it was a problem. She speaks really quietly but likes to have the windows open so the traffic and jack-hammering on Amsterdam drowned her out a lot of the time. As far as the actual class goes, the material was not interesting. I thought I liked anthropology, but clearly no, no I do not. We did read one or two ethnographies that I enjoyed, but a lot of the reading (which is heavy by the way, and expensive) was theory theory theory. Her TAs were alright, but when they decided to grade one of the midterms it was disastrous. When she handles it herself, things are much more fair. She's a nice person and will never tell anyone they're wrong (\"Yes, good, that's a relevant thought, now let's exPAND on it...\") but she isn't very approachable. Her TAs are her mignons and they actually told us \"Anything you want to say to Professor Morris should go through us first. Don't approach her directly.\" Don't take this class if you want an elective. Take it if you are really interested in anthropology and are willing to keep up with the reading and listen to endless inane comments from overly-enthusiastic GS students who don't actually know what they're talking about and want to tell the class about their life as a white girl in the ghetto who couldn't afford Nikes or their \"life\" (i.e. ten days) in Indonesia as a dancer. \"I'm a dancer. That's what I do.\" Yeah okay.\nWorkload:\nmiserable. tons of reading you can't keep up with, but two midterms that are totally manageable if you take good notes. None of the tests are cumulative.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "March 10, 2003",
            "review_content": "\nMorris is obviously very intelligent and highbrow. She knows her stuff and I look up to her for that. She's also great at answering questions. But really could someone tell her to change her teaching style? Her soft mousy voice rattling off theories makes it near impossible to stay awake. And most of what she says I just want to ask her, but what does that mean? What are you talking about lady? How does this theory fit into life?\nWorkload:\nfair work. \n"
        },
        {
            "course_name": "Mass Mediations of Modernity",
            "review_date": "January 04, 2003",
            "review_content": "\nWow, I don't think I've ever enjoyed a seminar like this one. However, while Prof. Morris is absolutely brilliant, I found myself either out of it (comprehension-wise) or sleepy for the first hour while totally enthalled the second hour. Bring some caffeine to get you through that first slot because I always wished I had been awake for it or that the class lasted an additional hour once I was more stimulated from the second hour. Prof. Morris tried to get a group discussion going but it rarely worked well, however she never let a minute be wasted. Every word she says is well thought out and she always ended class on time no matter what. Her points were sometimes a little over my head but as a non-Anthro major, I got a lot from the class in general. She along with the material, really make you think. The best part of the seminar would have to be the discussion section we had once a week. I have never found myself so looking forward to spending the last hour of my week of classes in a discussion but I always looked forward to this one. Don't come to this class if you just want to sit and absorb; even though you can get away with that in the lecture, you have to talk in the section but trust me, you'll want to. The information provokes just about everyone to say something. Hey, don't we all use some form of media?\nWorkload:\n3 short (2 page) response papers that you have to present in discussion. Final was either your own paper topic or 4 selected essay topics out of 8 possible (total 12-15 pages altogether for either).\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "February 19, 2002",
            "review_content": "\nI highly disagree with the previous review. Morris may know her stuff, but she is on a major \"power trip\" regarding her classes. This \"melodious voice\" that the other reviewer alludes to is actually one of those annoying, snooty, Barbara Walters voices. Her language is so obtuse that it actually takes away from her ability to communicate with students. She does not respond to emails, and likes the sound of her own voice.\nWorkload:\nHeavy reading, but easy to skim. Discussion sections are optional. Two straightforward exams and a final, but no room for creativity. Basically, you should attend all lectures and paraphrase your notes on exam questions to get full credit.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 16, 2001",
            "review_content": "\nRosalind Morris is everything a professor should be. She is elegant, and I mean that not only is she composed, sometimes funny, and always focused on the subject at hand but that every single word that comes out of her mouth sounds like it's been polished with a diamond blade. She has this incredible voice that's impossible to describe, very soft and very clear, which is a pleasure to listen to. Speaking off the cuff she still sounds like she spent hours laboring over the structure of each sentence to make incredibly difficult ideas easy to understand without leaving out all the complexity that makes them so rich. She's like Midas: everything she touches turns to gold.\nWorkload:\nLots of work. 1 in-class midterm, 2 take home. More reading than you can shake a stick at. Not an easy grader, but fair.\n"
        }
    ]
}