{
    "prof_info": [
        {
            "prof_name": "Chadwick Jenkins",
            "prof_id": 1289,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "July 21, 2005",
            "review_content": "\nHaving read all the positive reviews about Jenkins, I was really psyched for the course.  That excitement went away very quickly as I spent much of the summer session wondering what people saw in him.  Yes, he is brilliant.  Yes, he does put a lot of effort into the course.  Yes, he LOVES music.... but he also LOVES philosophy, art, latin, and german and if you don't LOVE these things too,  be prepared to be lost.  I felt his lectures were about as organized as a schizophrenic on cocaine.  What he discussed in class never seemed to coincide with the assignments.  He would spend the entire class talking about philosophy and then give us an assignment that had us diagram a schematic for a piece of music...... not something I expected to do in an intro course.  He is a nice guy and he's a pretty lenient grader.... but he's also a nut who thinks that his students all have a music background.    You could tell some people were into the class and others absolutely hated it.  If you are a music lover or you are into philosophy I'd say take music hum from him.  If you just want to get this requirement over with find someone else.  \nWorkload:\nReadings for each class, two papers, midterm, final,  & a few quizzes.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 10, 2005",
            "review_content": "\nChadwick Jenkins is probably one of the best teachers I have had at Columbia.  He connects music to philosophy and other forms of art, vividly illustrating music hum's integral relationship to all those other core classes.  His lectures are intelligent, interesting, and eloquent.   Bits of everything come together, from film to poetry to gritty technical musical details, and it works out incredibly well; I have never had such engaging lectures in my time here.  Look at his Courseworks, and the amount of preparation and attention to detail that he puts into his class syllabus alone puts everyone else I have had at Columbia to shame.  He is incredibly approachable outside of class, often staying at the music library.   Take his section for your Music Hum requirement.  \nWorkload:\nQuizzes (announced) that vary in difficulty, you should take notes and read the assigned readings, which come from a different textbook.  Midterm and Final.   Several papers - one on an opera/concert, one on a piece of music criticism, and one on a piece of music.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 02, 2004",
            "review_content": "\nThere's one thing to be said about this professor; he's terrific.  Chad is, absolutely, without a doubt, a brilliant guy.  Moreover, coupled with his intelligence, he also possesses sincerity and humbleness.  These two underlying characteristics make him a very compelling teacher and friend.   His humble character resonantes within his teaching style and personal conduct. He will never make you feel dumb for not knowing something and he will always explain complex or otherwise foreign ideas in ways that appeal to ones understanding.  He demonstrates various ideas and philosophies in such a way that is lucid and relevant.\n     His preparation and dedication are also amazing.  On the first day of class, he provides 7 CD's filled with Music for you to copy at home.  Before the Final and Midterm he provides extensive review sheets that go over the major items that you must know.  He is also willing to meet with anyone at nearly anytime to discuss the ideas for however long.  His reading assignments are concise and brief and he will also make it a point to go over the important concepts and highlight them, so if you missed everything else, he will give you the core ideas.  He is hillarious in class and never, ever has an uptight demeanor about him.  I always felt like he was an older friend or brother just teaching me about something he knew very, very well.  I honestly do not know how anyone could possibly give Chad a negative review, and at this point, after the class is over, it doesn't behoove me to kiss up or fabricate things; I say this with complete sincerity.  His enthusiasm for his subject and teaching is resoundingly clear.  Even a casual observer of this class will realize Chad's passion for Music and helping people understand various ideas on it.     I came into this class with a very meager knowledge of what we were studying and a very distant appreciation (if not an aversion) for what we were listening to.  However, by the end of this class, I listened to the CD's he gave us routinely.  I am even exploring certain things we discussed in greater depth.  I owe an incredible debt and gratitude to Chad for teaching me a new way to think of things.  He's a great guy just to talk to as well.  He has a lot of interesting ideas.  I'd highly recommend Chad without any reservations whatsoever.\nWorkload:\n4 Quizzes (the lowest one is dropped) , a midterm, a final (both of which he provides review sheets for), 3 short papers and one final paper.  For those that are a bit worried about the writing, he is very open minded about suggested topics and he is willing to read several drafts/discuss the paper as much as necessary.  You cannot ask much more from a professor.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2004",
            "review_content": "\nMaybe the negative review from below resulted from an experience early in Chad's teaching career. I really enjoyed his class. He is incredibly intelligent but also very laid back and makes jokes at himself all the time which puts you at ease. I was afraid he was going to assign a lot of texts and grade harshly but honestly the readings were 5 minutes at best per night and his grading is very fair, I daresay lenient.  I am really terrible at music, but it didn't really hurt my grade or understanding. If you are interested in another aspect of music - philosophy, mainly - then he puts plenty of historical and philosophical background in his lectures to keep you interested. Take notes and you will be fine on the quizzes that he warns you about the day before he gives them. He's just simply in love with music and the knowledge surrounding music. He is comfortable talking about every era, can answer most questions sufficiently and gets excited about it. He's also an incredibly nice person, which is a good contrast with the amount of organization and preparation he puts into the class. Seriously, Chad was the only person in the room who I would want to hang out with outside of class. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 27, 2003",
            "review_content": "\nOK.  This guy really does know his stuff.  However, because he's so into music theory and the philosophy behind the music, he changes Music Hum from an introductory survey course of western music history to an advanced music theory course.  This is great for those kids who already know all their stuff because of past experiences in music; they eat it up.  However, for those of us who have never taken a class like this before, it SUCKS.  To illustrate my point, he not only added extra reading, but an entire extra BOOK to our syllabus.  When I showed this book to people in several other music hum sections, none of them had ever even seen it or heard of it; all they ever had to read was the regular music hum text, which we had to read in addition to the other book.  So, if you know western music already, have a blast.  You'll get a lot from this guy's class.  If not, if you're like me, and are just trying to pass, you may want to look elsewhere.  \nWorkload:\nReading for every class, from the music hum text and the extra music theory book.  Three papers, not too long at all, a mid term, and a final.   \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 20, 2003",
            "review_content": "\nChad Jenkins is a nice guy, very into music. He knows what he talks about so it's not easy to bullshit in this class.  From what i hear, he assigns the most reading of any music hum class, although i cant' say for sure because he's the only music hum teacher i will ever have. His readings are helpful to gaining more knowledge about philosophical arguments in music, but they arent' the most important part of the class.His class can become boring after a while but overall, he's a good teacher and a fair grader. \nWorkload:\na few \"pop\" quizzes, a few short papers, a longer paper, midterm and final. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 20, 2003",
            "review_content": "\nI completely disagree with the previous review.  Jenkins knows his material, and more than just music.  He covers art, philosophy, criticism,history and ties it all together so you get a deeper appreciation for the piece and composer. He is tough and sometimes technical with the music so that it helps to have experience playing an instrument.  But he's fair and will take the time to explain stuff.  If you just want to sit around and listen to Beethoven's 5th, take someone else's class.  If you want to get it, take it with Professor Jenkins.\nWorkload:\na couple of papers, a couple of exams, some pop quizes, required texts and articles for reading\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 20, 2002",
            "review_content": "\nTHIS GUY IS COMPLETELY HORRIBLE. RUN, NO REALLY, RUN REALLY REALLY FAST. He put me to sleep and basically ruined my life. Every moment of the class was timed to a T, We had 2.5 minute breaks at the hour, and he just read a bunch of useless information straight out of the text book for 2 hours. I am a pretty smart person but I learned ABSOLUTLY NOTHING in his class. This was a complete waste of time. I thought this class would turn me onto music and now I never want to hear classical again. His TA was equally as bad and he had this german accent that was barely understandable. He would also go off on tangents about things you would only know if you could play 6 instruments fluently and no one had any idea what he was saying. I could not bring myself to do the work, so I didn't do well, but this class was not worth my time at all. Prof Jenkins is hard and ridiculous, DON'T even think about taking his class even if you are a spring semester senior who will not graduate without this course.....it is worth a 5th year at Columbia, trust me!!!\nWorkload:\ninsane, boring, and you will forget what you read 5 minutes after\n"
        }
    ]
}