{
    "prof_info": [
        {
            "prof_name": "Juliet Forshaw",
            "prof_id": 5678,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2013",
            "review_content": "\nLet me submit this before we get our final grades back--that last review is unnecessarily scathing. If you're the kind of person who's looking for an in-depth survey of Western music as that suggests, you should probably be taking the dedicated music intro classes and not put so much expectation into a class that everyone in the entire College needs to take. That being said, Juliet probably caters quite well to a Core music class and thank fucking Christ because I might have shot someone in the head if it were a stressful class since it was at 8:40 in the morning.\nClasses are mostly discussion based and we spent a lot of time just...listening to music and talking about particular features of it and the social context (what else could you do??). She was really kind about not forcing us to try to identify a particular period or aspect by ear, because to be honest, a lot of people just naturally kind of suck at that. She was really friendly and sweet and handled the large range in experience relatively well. You can walk out of that class knowing generally how music progressed in the Western world over time, knowing characteristics of the major movements in the music world, and the most important figures in music history...and that's really all the average person wants or needs out of Music Hum. For some people this class will be a nuisance no matter what, but I think that in general we were all quite fond of Juliet and her dorkiness/enthusiasm.\nShe does seem to have tightened her expectations a fair bit from the previous reviewer but not to the point of painful. My only gripe is that she doesn't make use of the white board as well as she might and tends to write random things down and circle them, and you have no idea what's important or what you should be taking notes on. Since she thankfully doesn't require a textbook, this can leave you at a bit of a loss of what to study and generate rather haphazard class notes.\nI thought her exams were actually well-crafted and tested how well you'd paid attention in class and whether or not you'd ever opened the music files she posts to courseworks or done the readings. You could potentially do disastrously if you haven't studied but if you do study, you'll do well no matter how much you lack musical ability. \nWorkload:\nLight weekly reading and some music pieces, two relatively short papers (under 10 pages each, the first one significantly shorter), a midterm and a final that is the same length as the midterm and meant to be completed in an hour and a half.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 22, 2010",
            "review_content": "\nJuliet was really nice and everything, but she's one of those grad students who's teaching to fulfill a requirement, not because she's particularly good at it. This is the kind of Core class that makes you resent the crap out of the Core: incredibly shallow analysis, arbitrary content, and a teaching-to-the-textbook method that somehow manages to make music boring. Half of it was the fault of the syllabus, but half of it, I'm pretty sure, was the fault of Juliet. She added virtually nothing to the text and came off as surprisingly ill-informed for a music scholar. Like, really uninformed.\nHowever, DO take this class if you a) want to skip class a lot with little to no effect on your final grade, b) want tests for which you will be basically handed the answers ahead of time, and/or c) want cushy essay prompts that explicitly state \"You need no thesis for this essay.\" That's valid. Also, she is, you know, nice. It's too bad.\nWorkload:\nPlease.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 22, 2010",
            "review_content": "\nJuliet is probably one of the most fun lecturers I've had the pleasure of taking at Columbia.  This means a lot from me, because at first I thought she was such a dork that I considered dropping the class.  You grow to love and appreciate how desperately she just LOVES music.  Like the previous commenter suggested, the 9AM time slot is a killer, but honestly, take her.  Her smiles will take you through the semester with little to no work on your end.  Also, she's the easiest grader I've ever met, so A's and A+'s on assignments will be a breeze.\nWorkload:\n1 short paper (too short to actually count), 1 short concert report (see previous comment), midterm and final (focus on cultural aspects, not musical ones).\nTechnically, reading and listening assignments every night.  But though I hate to admit this, I did none of them - EVER - and still got an A.  She tells you everything you need to know in class.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 16, 2010",
            "review_content": "\nProfessor Forshaw is amazing. She is very laid back and you can tell she loves music. My class was at 9am so there wasn't much participation. She did at times seem frustrated by this, but never did she become angry. She is very helpful and easily approachable. I really recommend taking Forshaw's Music Hum (if you can stand the 9am class time) because she knows a TON about music and makes it very easy to understand and engage. For her midterm and final, prepare the key terms sheet she gives you and know your listening assignments, you should have no problem at all.\nWorkload:\nReadings (around 6 pages in textbook- not bad at all) and listening (usually one, maybe two pieces) prior to each class. She required two essays which were not too difficult as she kept the topics pretty broad; you could pretty much write about what you wanted to. One midterm and One final, pretty standard - if you study you should have no problem.\n"
        }
    ]
}