{
    "prof_info": [
        {
            "prof_name": "Jeremy Dauber",
            "prof_id": 410,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Three Classic Yiddish Writers",
            "review_date": "May 12, 2016",
            "review_content": "\nWhat to say about Jeremy Dauber? From the moment we started class, I fell in love with Yiddish literature and Dauber's teaching methodology. I never had any exposure to Yiddish literature prior to this class, and I was one of two undergraduates in a graduate level class. I read prior reviews of Jeremy Dauber prior to taking him for this seminar, and while I cannot speak to his other classes, I believe that Dauber is best in a small setting like a seminar. To the class itself, it was EXTREMELY small with 6 total students (4 graduate, 2 undergraduate) and I believe this allowed for all parties to shine. I was able to ask (and highly encouraged) to ask questions and really dig into the material. Furthermore, while I myself felt inadequate to speak on literature devices and very technical aspects of the author and works, I was not made to feel inadequate or that my opinion did not matter. In fact, the graduate students, as well as Dauber, made me feel extremely welcome to voice any questions or opinions that I had in the text, even if it was not necessarily aligned with the majority of the class. Overall, I felt that the earlier reviews do not paint an accurate picture of Jeremy Dauber, the classes he teaches, or his attitude and analysis of the works that are studied. If I was not graduating this year, I would definitely take another class with Jeremy Dauber. If you put the effort in, you will be rewarded and it will be worth it. \nTL/DR: Jeremy Dauber is amazing. Take his class.\nWorkload:\nWorkload was typically a work every week. With each work studied we had to write ~1 page response which would guide the discussion. Undergrads had to write a 6-8 page midterm paper, and the final project could have been a traditional paper, or in the case of this particular class, a digital lab option that had us doing various projects for Sholem Aleichem's website, such as a timeline and a map. The class treats you like a big boy/girl and if you do not keep up with the reading it will show, particularly in a class of 6 people. Put the time into doing the work and you will be fine. \n"
        },
        {
            "course_name": "The American Graphic Novel",
            "review_date": "December 10, 2014",
            "review_content": "\nI was really excited going into this class—I'm a huge fan of graphic novels and think it's important that they be viewed as serious literature. This class left such a bad taste in my mouth, though. This class is not an engaging look at the history of graphic novels or a study of the development of the medium. You are literally just given a list of graphic novels on the syllabus to read and the lectures are a string of random anecdotes about them. There is a lot of breadth, but absolutely no depth. All of the assignments are vague and have nothing to do with the lectures, and are just given for the sake of having assignments. They try to run the lecture like a seminar, and what happens is that the same five people talk the whole class and the other students are given nothing to work with. There is also literally a \"race week\" and a \"gender week\" and the way the professors approached these subjects is stale and antiquated. \nWhat made the entire experience worse, though, was that the professors were not open at all to criticism. They wanted our feedback the last day, but spent the whole time justifying their decisions instead of considering the fact that their refusing to plan their lectures or write assignments comes off as lazy and disrespectful of our time. They also told us they didn't want to approach the texts from critical perspectives since they wanted to \"present a buffet\" of works for us to read instead. This class is a survey in the most basic sense, and you could get more out of reading the books on your own then sitting through the painful, shallow lectures. It was also infuriating how strictly the papers were graded when we were given so little to work with. \nThis class was not only disrespectful to the students investing time in it, but disrespectful to the medium itself. It's been fighting for years to be accepted as a legitimate literature in the academy, and this class hurts the progress it has made in the past decades. \n\nWorkload:\n-A one page critical analysis\n-A two page journal entry\n-A 5 page close reading\n-A 15-20 pages research paper\nYou are give no clear directions for these assignments. \n"
        },
        {
            "course_name": "The American Graphic Novel",
            "review_date": "December 10, 2014",
            "review_content": "\nI was really excited going into this class—I'm a huge fan of graphic novels and think it's important that they be viewed as serious literature. This class left such a bad taste in my mouth, though. This class is not an engaging look at the history of graphic novels or a study of the development of the medium. You are literally just given a list of graphic novels on the syllabus to read and the lectures are a string of random anecdotes about them. There is a lot of breadth, but absolutely no depth. All of the assignments are vague and have nothing to do with the lectures, and are just given for the sake of having assignments. They try to run the lecture like a seminar, and what happens is that the same five people talk the whole class and the other students are given nothing to work with. There is also literally a \"race week\" and a \"gender week\" and the way the professors approached these subjects is stale and antiquated. \nWhat made the entire experience worse, though, was that the professors were not open at all to criticism. They wanted our feedback the last day, but spent the whole time justifying their decisions instead of considering the fact that their refusing to plan their lectures or write assignments comes off as lazy and disrespectful of our time. They also told us they didn't want to approach the texts from critical perspectives since they wanted to \"present a buffet\" of works for us to read instead. This class is a survey in the most basic sense, and you could get more out of reading the books on your own then sitting through the painful, shallow lectures. It was also infuriating how strictly the papers were graded when we were given so little to work with. \nThis class was not only disrespectful to the students investing time in it, but disrespectful to the medium itself. It's been fighting for years to be accepted as a legitimate literature in the academy, and this class hurts the progress it has made in the past decades. \n\nWorkload:\n-A one page critical analysis\n-A two page journal entry\n-A 5 page close reading\n-A 15-20 pages research paper\nYou are give no clear directions for these assignments. \n"
        },
        {
            "course_name": "Readings in Jewish Humor",
            "review_date": "December 15, 2011",
            "review_content": "\n   I would like to preface the following review by telling you (the reader) that this is the first Culpa review I have ever written - oblige me as a I shower compliments on an individual who doesn't need the adoration but certainly deserves it. Firstly, Jeremy Dauber is brilliant - Harvard grad, Rhodes Scholar, author, etc.  And while you may find comparable credentials with a number of tenured Columbia professors in other classes, I don't think their genius is presented as palpably in speech and general discourse as it is with Jeremy Dauber.  Dauber knows just about everything there is to know about Jewish humor, and upon responding to any comments you make or questions you ask you will often find yourself blown away that you have a professor that speaks with a stream of consciousness (if you haven't caught on yet, the guy is freakin' awesome).  I specifically use the word 'Jewish,' and not \"Yiddish,\" because this class is a Jewish literature/humor class; save about three works (Tevye the Dairyman, The Two Kuni-Lemels and The Little Man), all of the books, stories and excerpts we read related to Jewish humor: for example, Genesis, The Book of Esther/Jonah, Portnoy's Complaint and even episodes of Seinfeld/Curb Your Enthusiasm. \n  If you have even the slightest interest in Judaism, humor or both, I highly recommend you take this class.  Jeremy Dauber is incredibly kind, intelligent, witty, [insert synonym for someone you strive to be on a daily basis here]...person.  \n   Jeremy Dauber for President!!!      \nWorkload:\n1) One page paper for every class that he doesn't end up grading (unless he does in his head...he certainly doesn't tell if you've gotten one though).\n2) A 5-7 page midterm paper - 3 essay topic choices.\n3) A 15-20 page final paper on which you can virtually write about anything you want.\n- The class itself isn't so easy as Dauber is a relatively tough essay grader, but it's definitely possible to get a good grade.\n"
        },
        {
            "course_name": "Humor in Jewish Literature",
            "review_date": "June 12, 2008",
            "review_content": "\nI enjoyed this class and really like Jeremy Dauber. I mean, this class is Humor in Jewish literature (and media)-that means reading Shalom Aleichem, Philip Roth, and watching Seinfeld, Mel Brooks, and Wood Allen! The main downside is that in some sense it can be too easy and cause people to lack motivation. Because people who pass/fail the class get the assignment lengths cut in half, most people (including myself) lacked motivation and often did not come to class. And since all the assignments are papers, you can really come to just a few classes and do fine. Still, I like Dauber-he's really funny, friendly, and smart-and I would recommend this to anyone who enjoys humor. (Which I hope is everyone)\nWorkload:\n2 paper (now pay attention): Regular students: 1st paper 8-10 pages, 2nd (research) 20-25 pages; 2nd semester seniors/People taking it pass-fail: 1st paper 3-5 pages, 2nd (research) 8-10 pages. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 22, 2008",
            "review_content": "\nAt first, Professor Dauber's Lit Hum class may seem a bit intimidating.  He added three books to they syllabus, while taking a few classes off for Jewish holidays, AND assigns 5 short papers instead of the 2-4 longer ones that most classes get.  That said, his class is great and no one should hesitate to take it.  He never puts anyone on the spot, trying to get them to participate, and somehow always manages to link what we're reading to some pop culture reference.  The reading schedule does seem to be a bit fast, though, so it is understandable to not finish every book.  Since he assigns his papers in a way taht you can write them on any five books that you'd like, all you really need to do is make sure you read 5 books all the way through.  He grades really easily on exams, which I think makes up for his slightly harsher grading on the papers.\nWorkload:\n5 2 page papers on whichever books you want, midterm, departmental final\n"
        },
        {
            "course_name": "Readings in Jewish Humor",
            "review_date": "May 18, 2008",
            "review_content": "\nAbsolutely superb.  Phenomenal.  A joy.  I could go on kvelling forever.  Professor Dauber is brilliant--like, really brilliant--and masterful at using the material, which, unsurprisingly, is the most entertaining I've ever encountered, to reveal points well worth making.  And even if he weren't as good (and just remarkably pleasant, too) as he is, the course material would make the class more than worthwhile: the Marx Brothers, Larry David/Seinfeld, Sid Caesar, Sholom Aleichem, Woody Allen, Mel Brooks...the list goes on. His lecture on Kafka is especially good; you never knew he was so funny.\nWorkload:\nNot too heavy, but two papers, one of which clocks in at 20-25 pages (the other is 8-10).  Seniors and P/F'ers only have to write 3-5 and 8-10.  Halfway thru semester, reading gives way to watching clips in class, so there'e no homework at all.  Really, the perfect class.  Enlightening and easy all at once.\n"
        },
        {
            "course_name": "Survey of Yiddish Literature",
            "review_date": "April 20, 2006",
            "review_content": "\nJeremy is a very good proffesor. He is clearly very knowlegable, he is very personable, he loves his subject, and he cares about his students. He also has a sense of humor and keeps the class entertained. THe class is relaxed and fun, and is good for anyone who wants a quick background in major Yiddish works. \nWorkload:\nLight. 2 papers, one of them a longer research paper at the end of the term, about 10-15 pages. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 30, 2003",
            "review_content": "\nBeing a Rhode Scholar inflated his overly large ego... and it shows in the class.  He knows he's smart.  Nevertheless, in my opinion he doesn't care whether or not you read a single book, just so long as you are a total jock - and if you're not actually on a sports team, just come to class with a CU Lions shirt and 17 powerbars and you're set.  He spent too much time trying to please the general class - most of whom didn't even seem to open a book - and no time whatsoever on the content of the books itself.  While comaring Raskolnikov in Crime & Punishment to Eminem for half an hour in class MAY seem amusing, its not so great when your final's coming up and this is the extent of your class notes.  Tangents are the norm - not a single work was thoroughly discussed.  Also, watch out - he plays favorites.  \nWorkload:\n3 papers (takes top 2 grades) - papers are 5 pgs each and have to be handed in the beginning of the class in which that book's discussed... topic questions are posted on Courseworks in the beginning of the semester, though (hint: find 3 books you think you'll like, read those ahead of time and write good papers)... grading's completely unfair and biased, but you won't get an awful grade... midterm - IDs and essay... IDs had little to do with any work, essays compared TV and one of the works... forgot about the other essay... departmental final... added 2 extra books to the curriculum\n"
        },
        {
            "course_name": "Readings in Jewish Humor",
            "review_date": "May 12, 2003",
            "review_content": "\nDauber is a funny man. Very insightful, he writes for the Christian Science Monitor. He has some keen insights to the texts. I agree almost to a T with another reviewer on CULPA: Yeshiva education is definitely helpful, but is by no means required.  If you are interested in the readings, take the course. Likely, you'll find the readings more interesting than class time itself, but class will be enjoyable nevertheless.\nOn the readings:\nDauber spent *way* too much time on certain material early in the semester, most notably the Biblical stuff. Some of the medieval stuff was great, worth reading, and unknown to almost everyone in the class. There is no need to spend as much time as he did on Tevye and Eastern European materials.  The best part of the class was the last few weeks, in which we read Roth, Allen, and Stanislawski guest-lectured on Brooks's History of the World.    My idea for the course: Dauber either should call it \"20th century Jewish humor\" and do away with the rest or he should work to develop themes that would relate the more modern stuff to the older stuff. Currently, the course is a mish-mosh. Yes, it's all Jewish humor, but these humors are so different, and he doesn't focus at all on comparing, that it's as if there are about four different courses here, with the best one being about 20th century Jewish humor.\nBottom line: Take the class if you like Jewish humor. The readings are amazing and Dauber is engaging.\nWorkload:\nI don't know which class another reviewer was attending: the workload for this class is not very heavy at all. The readings fly - I would say only a few hours of reading a week (but they're humor -- not very dense at all!) until you get to Roth, when the load rises a little bit (but it's still easy! you don't even feel as if you're working). \nTwo papers, one due right after spring break, one before finals begin. First one is 6-8 pages, second one is 15-20. No tests, no homework, class attendance not required (but recommended, if only for fun!).  TA grades papers, and Dauber reviews her grades.\n"
        },
        {
            "course_name": "Readings in Jewish Humor",
            "review_date": "April 30, 2003",
            "review_content": "\nDauber's a friendly guy who knows his subject. But in a class on Jewish humor, I was really expecting there to be way more humor. He stretches out Yiddish folktales (his specialty) for way too long, and spends an insignificant amount of time on mid/late-20th century comics, which was unfortunate to say the least. Still, a good class, and worth taking if it's your kind of material. This is the first time that Dauber's offered the class, and I'm sure it'll be fine-tuned to meet the interests of all students. Incidentally, I disagree with the previous reviewer about the level of Jewish education necessary to enjoy the class. Dauber assumes the students have some cultural Jewish background, but he'll happily explain any topics that your non-Yeshiva education didn't cover.\nWorkload:\n2 papers -- the TA is a little harsh with the comments, though the grades are fairly reasonable. Seniors are given leniency in paper length.\n"
        },
        {
            "course_name": "Readings in Jewish Humor",
            "review_date": "April 16, 2003",
            "review_content": "\nDauber is one of the leading scholars in Yiddish studies.  This said, he knows a LOT about everything in the syllabus.  The books in the class range from the Bible to the scripts from Seinfeld, with Sholem Aleichem, Kafka, Roth and Allen in between.  The readings in general are pretty good, and include jokes, plays, poetry and novels, although some of the translations take out any humorous aspects of the work.  So basically the reading material is good for the mostpart.  As far as the classes... Dauber knows his stuff.  He begins the work with some background about the writer, and what was going on at the time that the work was written.  He opens up a lot of the class time to comments, which I think is a downside, because Dauber is so much better knowledged than those who participate.  Although no knowledge of Hebrew and no Jewish background is required, it is pretty hard to take the class without Yeshiva experience.  Dauber occasionally writes Hebrew words on the board, and the composition of the class (at least 80% had extensive Jewish education) made the class geared more towards the Jewish elements in the literature, instead of the Humor and historical perspective, as those who participate usually include whatever they learned in yeshiva, instead of analyzing the works as humorous literature, or elaborating on points expressed by Dauber.\nWorkload:\nLOTS of reading... about a book a week... some longer than others, mostly fast-paced works (such as Roth), although a few are pretty boring (in part because of what's lost through translation).  2 papers, one 6-8 pages, the other 15-20 pages.  The TA reads them, but Dauber oversees it and may give the grade.  Pretty fair grading.\n"
        },
        {
            "course_name": "Magic and Realism in Yiddish Literature",
            "review_date": "December 25, 2002",
            "review_content": "\nstarts off interesting and dynamic, but over time its easy to get bored in his class. he has insights into the literature, but most time is dedicated to class discussion, which he lets run freely. that  sounds good until you get onto tons of tangents and spend time trying to earn bonus points by talking when you have no clue what your'e saying. definately cares about the subject and is good about analyzing literature in context.\nWorkload:\nreading sometimes really light, sometimes heavy, you don't have to do all of it. term paper, don't remember about tests\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 03, 2002",
            "review_content": "\nBrilliant. He is such an incredible professor. He'll make you work and think for yourself, so you'll really learn a lot. He leads great discussions and rarely wastes your time. He really tries to help his students, but he won't answer questions that students should think of themselves. He's really the best professor I've had. \nWorkload:\nNot too bad. You'll read faster than most classes, but it's all worth it.\n"
        },
        {
            "course_name": "Magic and Realism in Yiddish Literature",
            "review_date": "April 18, 2002",
            "review_content": "\nLet's start with the positives. To his credit, he is brilliant with an impressive, encyclopedic mind and is great about accepting any and all opinions/interpretations that are properly backed in the material. But he needs a lot of work. Without much experience behind him, his lectures are not always organized or structurally easy to follow. The workload seemed ok (reading stories) but then the class was hit with two papers to write, both after the Pass/Fail/Withdraw deadline, which was really poor planning. He was not terrific about giving guidance for papers; he seems to confuse helping a student with \"giving him the answers\" which left a bunch of students stuck with unanswered questions. Most irritating of all is his pretentious attitude- he knows he's a genius, always refers to himself as \"Professor\" and thinks he's Gd's academic gift to Yiddish Literature. He's young, tries to be fun and \"with it\", relating to the students, but more often than not comes off as a pompous brat instead. Frankly, I was disappointed with the course and I learned the most from writing my own papers.\nWorkload:\nReading is a pleasure, two papers- one 5-8 and a final one, 10-15. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2001",
            "review_content": "\nProfessor Dauber made lit hum as pleasurable as possible. He was light-hearted, definitely cared about his students, actively tried to help us do well and get something out of the works, and tried to relate to us on all levels. He was willing to let the students guide him as to whether each class took a lecture or discussion format. He encourages all opinions while forcing students to push their thoughts further by playing \"Devil's Advocate.\" As to the reviewer that bashed him for being to concerned with getting through the works, that is the nature of literature humainites. Take that problem up with the course, not the professor. He had to get through the same amount of books as every other professor and was able to accomplish that more thoroughly than most.\nWorkload:\nMore papers than most other lit hum classes, but shorter and generally easier. Plus, he's a pretty easy grader, both on papers and midterms and finals. Expect inevitable improvement, assuming you put in some effort.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2001",
            "review_content": "\nProfessor Dauber made lit hum as pleasurable as possible. He was light-hearted, definitely cared about his students, actively tried to help us do well and get something out of the works, and tried to relate to us on all levels. He was willing to let the students guide him as to whether each class took a lecture or discussion format. He encourages all opinions while forcing students to push their thoughts further by playing \"Devil's Advocate.\" As to the reviewer that bashed him for being to concerned with getting through the works, that is the nature of literature humainites. Take that problem up with the course, not the professor. He had to get through the same amount of books as every other professor and was able to accomplish that more thoroughly than most.\nWorkload:\nMore papers than most other lit hum classes, but shorter and generally easier. Plus, he's a pretty easy grader, both on papers and midterms and finals. Expect inevitable improvement, assuming you put in some effort.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2001",
            "review_content": "\nProfessor Dauber made lit hum as pleasurable as possible. He was light-hearted, definitely cared about his students, actively tried to help us do well and get something out of the works, and tried to relate to us on all levels. He was willing to let the students guide him as to whether each class took a lecture or discussion format. He encourages all opinions while forcing students to push their thoughts further by playing \"Devil's Advocate.\" As to the reviewer that bashed him for being to concerned with getting through the works, that is the nature of literature humainites. Take that problem up with the course, not the professor. He had to get through the same amount of books as every other professor and was able to accomplish that more thoroughly than most.\nWorkload:\nMore papers than most other lit hum classes, but shorter and generally easier. Plus, he's a pretty easy grader, both on papers and midterms and finals. Expect inevitable improvement, assuming you put in some effort.\n"
        }
    ]
}