{
    "prof_info": [
        {
            "prof_name": "Elias Mattas",
            "prof_id": 1950,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Process I",
            "review_date": "December 11, 2006",
            "review_content": "\nTerrible. Seems to have put no effort into teaching class and has cancelled 50% of all classes. Makes TA grade the tests, HW and course evaluations. Worst professor at Columboa.\n"
        },
        {
            "course_name": "Process and Product Design I (E4500)",
            "review_date": "February 03, 2004",
            "review_content": "\nHe doesn't put a lot of work into this class.  All he does is take powerpoint slides provided by a textbook and present them to the class verbatim.  He gives us handouts of these slides, so it makes this 2.5 hours class so boring.\nHe is the WORST grader I've ever known.  He grades exams on a relative basis.  This means that if your answer doesn't match what the rest of the class wrote, then he's going to take most of the points off (even if you're right but just write it in a different way).  For example, although I knew how to answer most of the problem, because I didn't write the two words he was looking for, he took 8 POINTS (out of 10) for not writing those words.  His grading makes no sense at all, and that is what pisses me off the most.\nThere are so many bad things I can say about him as a professor, but those are the two main problems.  Don't be shocked when you take this class, and you end up with a worse grade than you expect.   He is simply THAT arbitrary when it comes to this class.\nWorkload:\nAbout 4 biweekly HW problem sets, and 2 exams (open notes, open book).  It wasn't supposed to be like this, but because he missed two weeks of classes, he didn't have time to give us more work.  Maybe in the future (if he is still teaching this course), there'll be more work (i.e. group presentation) to it.  Don't be fooled by the format of the exam; it's an open book/notes exam, but the questions can be vague and unclear that even open book/notes won't help.\n"
        },
        {
            "course_name": "Process and Product Design I (E4500)",
            "review_date": "January 16, 2004",
            "review_content": "\nA once-a-week course on practical aspects of designing chemical processes for plants.  Prof. Mattas is an engineer for Bristol-Myers Squibb, so was often able to tie in real-life examples.  PowerPoint slides of most lectures.  The material was fairly light, and Prof. Mattas' presentation was generally interesting, so it wasn't hard to focus on the material, even though it's an evening course.\nWorkload:\nMidterm, final, handful of homeworks (some by hand, some using computer programs).  Workload very light (relative to other courses).\n"
        }
    ]
}