{
    "prof_info": [
        {
            "prof_name": "Kristen Shepard",
            "prof_id": 1855,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "September 04, 2011",
            "review_content": "\nShepard was a pretty good professor. It's biology, so what do people expect? She tries very hard to make sure we learned everything. The first exam was pretty easy for me because probability and math comes naturally to me. However, on the second midterm I did pretty bad because I just can't remember and memorize facts-- which is something you have to deal with in any bio class. The final was reasonable. Her multiple choices were a bit annoying. In terms of the problem sets, they were okay. if you got stuck the TA sessions were helpful. I really enjoyed that class. It was very interesting; particularly the stuff we learned. \nWorkload:\n2 midterms, a final. Bi-weekly problem sets. \n"
        },
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "April 07, 2011",
            "review_content": "\nDon't be fooled by the silver nugget next to her name or the reviews below that rave about her. Kristen Shepard is just not a good professor. However, (unlike now) there were no true reviews of her ability when I took Genetics with her. I guess when she was teaching Bio BC 1001 she was easier on those students since they were mostly freshmen and it's a course for people who don't have a strong background in bio, but she was HORRIBLE for Genetics. First of all, she is very rude and for no apparent reason. It's nice that she gives you a print out of the slides she uses in her presentations and that she tries to learn everyone's name, but I would much rather prefer good teaching over both of those things. The clicker questions were thrown at us in class as we were being introduced to the information and if a large percentage of the class got it wrong she would say things like \"how she didn't understand why we don't understand\" and then would tell us to talk over our answer with the person next to you, which wasn't very helpful because most of the time, they guessed too. \nThe problem sets were hard and there were so few questions that getting 3 wrong would give you a C. The tests were ridiculously difficult and LONG. Expect to be in the middle of a problem in the last 2 minutes. I also spent a majority of the test trying to figure out what she was even asking and got a lot of points off because I only included 1 part when she expected more, despite the fact that it was inconsistent with the problem sets (which were also written in a strange stringing together of random words). I also had to teach myself a lot of the material because she rushed through most of it and sometimes would forget to include important slides of mechanisms we would be tested on! The one saving grace is the fact that the TAs are really helpful and hold sessions almost everyday. \nIn general, this class was harshly graded and really unclear. I came out without a real knowledge of genetics. The course started off really interesting and has some great potential...if someone else taught it. \nWorkload:\nA problem set due every other week (definitely not enough graded practice), a ton of reading (because you will have to do it more than once), lots of practice problems that won't really help because she will find a way to make it harder and less straightforward on the tests\n"
        },
        {
            "course_name": "Molecular and Mendelian Genetics",
            "review_date": "January 12, 2011",
            "review_content": "\nSo I took this class because I love molecular biology. Really, a big fan. But now, I hate it. I really don't like Mendelian genetics because of the way Shepard taught it. I can't say probability comes naturally to me, so just reading it in the textbook and being hit with hard clicker questions in class is not the best way to learn how to figure out the probability of someone being color blind, blood type O, and have hemophilia. She is very disorganized, has typos all over her slides and largely unclear about everything she says. She tries hard. She really does. But for some reason she ends up confusing us even more. The TAs are helpful and her office hours are helpful. But she's not always so welcoming. So really push your question to be answered even if she turns you away. You'll probably have to take Genetics to take any other Biology class, but luckily, she probably won't be teaching it anymore. \nHer tests were difficult especially when the wording of the questions was even more confusing than her lectures. Most questions were backwards english so it made it nearly impossible to understand what the question was asking. Problem sets had just the same problem. Oh, and for any class she teaches, don't expect your assignments or exams returned to you within two weeks of handing it in. She's slow with grading. Overall, I think the class was unfairly taught and graded.\nWorkload:\nOptional quizzes every once in a whiel, bi-weekly problem sets, two midterms and a final.\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 15, 2008",
            "review_content": "\nShe goes way above and beyond in caring for her students - putting on tons of Q & A sessions, learning EVERYONE'S names (unbelievable for an 80 person class) and having extended office hours. She often runs out of time to cover all of the slides, but she does cover everything (and if she doesn't, she won't test you on it).\nAlso, she posts all of the slides with her notes on them online - you really don't need to go to class... I missed two weeks and I still understood everything. That said, it's not that bad of a class, but it's a ton of memorizing of processes and definitions..\nWorkload:\nTwo midterms, one final. Mandatory lab: two formal lab reports (4-6 page papers), one final paper, weekly quizzes.\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 12, 2008",
            "review_content": "\nProfessor Shepard is enthusiastic and makes the class as lively as it can be. Overall, I think that if you study you can do well, although it isn't an easy A. She has great office hours and is really accomodating. She is there for her students and one should take advantage of the Question and Answer sessions as well. Every class she hands out slides that are identical to her powerpoint, which is obviously helpful.\nDown side is that it does take her a long time to grade the midterms, but if you can deal with that, it is a good class to take to satisfy (the first half) of the science requirement. \n\nWorkload:\n2 midterms and 1 final. The final covers the material from the first two midterms, but in less detail. Otherwise, she posts optional extra credit quizzes. \n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "May 22, 2005",
            "review_content": "\nI can't say too much about her lecture styles since I hardly went to class. \nShe was quite popular among students though so it'd be safe to assume that she's not a horrible lecturer. The readings aren't much for 4.5 credit course at all, and she posts a bunch of questions related to the lectures on the Courseworks, which is more helpful than anything else. Print out the questions and know the answers to all of them. That's what she wants you to know. If you do that, you might pass this course with a decent grade like I did even without having to go to a single class.\nWorkload:\nThree exams, all MC, pretty easy if you know what you have to know.\n"
        },
        {
            "course_name": "Plant Physiology",
            "review_date": "April 30, 2005",
            "review_content": "\nProfessor Shepard is very dedicated to teaching and will try to make the material accesible and painless. She makes herself very available outside of class. However...the work assigned isn't the most interesting, especially if you're not a plant person. Biweekly problem sets make the course feel kind of like high school bio classes. Her exams are pretty good, though, and don't require that you read much of the text book to do well. \n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 31, 2004",
            "review_content": "\nThis intro-to-bio class is, contrary to popular belief, requires a lot of dedication and studying. It proved to be much harder than I anticipated. The course covers a LOT of material in a semester (everything from 'what is a cell?' to the future of genetic engineering to plant physiology). While the course is never boring, students who are not particularly interested in a future bio-orientated career should really consider whether or not they want to duke it out for grades with other science majors, people entertaining the idea of going premed and people with a lot of high school/AP bio experience. Lab is pretty typical (doing experiments, short quizzes, etc), but does not always directly pertain to lecture. If you're up for the challenge, bio is a fast moving and interesting course.\nProfessor Shepard, is in general, very good. She clearly understands the material she's teaching and manages to tell students what they need to know without going into complicated detail. While her fault lies in taking random and pointless questions during lecture, her forte lies in her willingness to see students at almost anytime and help them understand. Around the midterms and finals, she often gives Q&A; sessions that illustrate her desire to see students understand.  What no one told me is how important Courseworks is to Professor Shepard-she posts review questions and extra readings, links and her lecture notes on Courseworks. Its really worth looking at on a regular basis is you're taking this class. All in all, Biology 1001 with Professor Shepard is challenging to say the least, but not impossible.\nWorkload:\nRegular reading (approximatly 3-4 chapters a week), two midterms (50 Q's each, multiple choice), one final (100 Q's, multiple choice). Lab makes up a third of your final grade. In the weekly lab, there is a short pre-lab quiz, two lab reports, a short-answer practical midterm and another short-answer practical final. \n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "November 19, 2004",
            "review_content": "\nKristen Shepard is a very good professor and makes all the material interesting.  I disagree with the other reviews that claim she answers all questions; I think that's her one flaw, that during class she often receives questions from students with the response, \"ask me after class\" or \"we'll come back to that later.\"  I don't care about this but for the students with the questions I'm guessing it is a bit annoying, especially if you don't have time to stay after class.  But this is a very minor fault, and otherwise, this is a good course.  If you're taking it for the requirement you'll find you have to do more work than joke science courses like astronomy, but the upside is you learn things about Bio you'll remember in the end.\nWorkload:\nSee other reviews.\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "November 15, 2004",
            "review_content": "\nProfessor Shepard is absolutely adorable, very sweet, take the time in the first few weeks to learn everyone's name in a 80 person lecture hall class.  She takes time out to answer questions, and there it is so funny when she get really excited about plants.  Perfect Biology prof for people who don't like bio--shes organized, makes things as painless as possible, and is a real sweetheart.\nWorkload:\n2 midterms (50 mult. ch.), 1 final, about 10 labs.  You don't really need to do any reading if you go to class, and even if you dont go to class, she posts every powerpoint on courseworks so you can pretty much figure out what happened in each lecture\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 27, 2003",
            "review_content": "\nProfessor Shepard is the first science professor I've had at Barnard, but I'm sure she's one of the best. Every lecture is on Powerpoint, but also printed out and posted on Courseworks - in both PDF and Powerpoint files. She takes time out to answer every question in class, and is always ready to make an appointment with you if you don't understand something or just want to learn more about a topic. She is genuinely concerned about the students and their knowledge of the material, and it is easy to tell that she puts in A LOT of time preparing for each lecture.\nWorkload:\nAbout ten pages of reading per lecture - definitely light for a class worth 4.5 credits. Shepard cuts down the readings to short sections that correspond with the lecture, so it goes by quickly. Two midterms, very fair, and a final that was a bit on the difficult side.\n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lecture)",
            "review_date": "December 25, 2003",
            "review_content": "\nShe is a straightfwd lecturer, who knows her stuff! She is very organized and is always on top of things. She makes bio interesting for science and non-science ppl. I highly recommend her class. \nWorkload:\n2 midterms and a cum. final\n"
        },
        {
            "course_name": "Plant Physiology",
            "review_date": "December 14, 2003",
            "review_content": "\nI took this class not particularly interested in plants, but wanting to avoid taking Animal Phys for my major requirement. What a great class! Shepard is the newest member of the faculty and obviously wants to make sure everyone is comfortable with the material. \nAll lectures are Powerpoint, but she prints them out ahead of time and gives them out in class. The handouts are helpful but don't replace the textbook -- you'll need to study both for exams. She's also incredibly easy to approach and will answer any question you might ask, including subjects that have nothing to do with the material-at-hand.\nWorkload:\n6 problem sets (in a group or on your own, but you can hand in corrections after they're marked), 1 journal club (in a group), 2 discussion leader questions (emailed), 2 midterms, and a cumulative final. \n"
        }
    ]
}