{
    "prof_info": [
        {
            "prof_name": "Mark Lilla",
            "prof_id": 3289,
            "total_reviews": 54
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of 20th Century Russian Literature",
            "review_date": "August 26, 2016",
            "review_content": "\nTaking Professor Lilla's class for Lithum was the best decision I made as a freshman. Lithum lives or dies with your professor, and few teachers are more qualified than Lilla to teach the western classics. Even a cursory perusal of any of his books or articles for the Nreview_contentk review_content of Books reveals his astounding facility with western literature and philosophy. Lilla's method of teaching Lithum is \"old school.\" In class Lilla's focus was primarily on uncovering and discussing the \"timeless philosophical themes\" of the texts we read, and little time was spent doing textual or literary analysis. If you are interested in discussing the iniquity of a curriculum composed of \"dead white males\" then Lilla is certainly not the professor for you. Lilla has little patience for contemporary notions of political correctness, though he never discounts the opinions of his students. More than anything Lilla strives to stimulate debate in class and would often challenge students to motivate their arguments or ideological presuppositions. Besides being supremely knowledgeable, Lilla was a remarkably caring teacher as well. He arranged for every student to meet with him personally during office hours solely in order to get to know his students better beyond the classroom.\n\nWorkload:\n200 word post for every class and 3 slightly larger (800 word) posts. A 5 page paper in place of a midterm. Standard final, though Lilla said that he didn't care about the passage identification section and that the final could not detract from your overall grade.\n"
        },
        {
            "course_name": "History of the Self: Pascal",
            "review_date": "July 02, 2016",
            "review_content": "\nIf you happen to be browsing Culpa for history professors and randomly find Mark Lilla, or are remotely interested in his provocative class titles, or already have experience with his thought via the Nreview_contentk review_content of Books, you’re in luck. You’ve found Columbia’s secret sauce. Prof. Lilla’s teaching convinced me that studying history was the right way to go, but more importantly defined my academic existence as junior unsure of his next academic steps. It is admittedly hard to provide anything more than a gestalt review of Lilla’s classes; taking a course with him (and the cohort of undergraduates and graduates who religiously enroll in his seminars) is really an experience in itself. I’ll try my best.\nProfessor Lilla structures his classes in the following way: He identifies an important theme or author in intellectual history (Pascal, Rousseau, Montaigne, the self, education, etc.), and provides a hyper-focused syllabus aimed at investigating this topic. The key is depth, not breadth, and the assigned readings every week are usually short yet demanding. In his Pascal class, we read the entirety of Pascal’s Pensées and some of Montaigne’s Essais for context. While the assigned readings may only have been 50 pages or so per week, the material required a lot of time and contemplation (the Rousseau readings, it should be said, were considerably longer). \nIf you are not interested in philosophy, political theory, religious thought, or literature, Lilla’s offerings may not be the classes for you. That being said, his Pascal course was my first real exposure to religious thought outside of CC and Lit Hum, and I found it eye-opening. So keep yourself vulnerable. Just know that Prof. Lilla sort of floats around between departments, and assigning disciplinary adjectives to his courses is accordingly difficult. \nProfessor Lilla can be intimidating to an undergrad. He’s no nonsense and expects every student in his classes to be fully dedicated to the books at hand (they all are). In my experience, History, Philosophy, and English majors populate the classes, with the occasional graduate student peppered in. Many students are repeat offenders, sticking with Prof. Lilla after taking Lit Hum with him or another one of his courses. Preparation for each class entails reading the assigned portions of whatever books the class is focused on… and the discussion posts.\nAt the beginning of the first class, professor Lilla divides the students into two “teams” that contribute long papers and short responses on alternating weeks. This is a unique choice, I think, and it forces everyone in the class to synthesize and articulate their ideas from week to week. He usually makes long posts due three days before class, and responses due two days before. It might be a good idea, by the way, to print the whole discussion board from Courseworks out each week and bring it to class, as Prof. Lilla frequently pivots the discussion based on the posts. Don’t be surprised if he calls on you to explain what you wrote; chances are, if he does, he thinks you have something of interest to say!\nThe final paper is a long essay that deals with a question you work on with professor Lilla in office hours and over email. It’s really an investigation into a central question related to the syllabus and themes brought up in class— not sure how much more specific I can get, other than mentioning that you aren’t required to consult outside sources. He does give the option for spring students, however, of writing a much longer paper that involves outside reading and is due even further into the summer. It’s worth noting, too, that, in both cases, you’re given a very long time to write these papers. He expects good work.\nOffice hours were always helpful, and Prof. Lilla really goes the extra mile in trying to help his students along their ways. He is broadly an expert in many fields of ~Western~ intellectual history; if you have any extra-curricular questions about European liberal thought, American conservatism, French politics, classical literature (…) you might want to pop into office hours and ask away. Chances are you will disagree with his worldview. That's valuable at Columbia and—who knows—that disagreement might be temporary. \nUnless he's teaching particle physics, take his class. Also, he should have a gold nugget. \n\nWorkload:\n\n~1500 word discussion post every other week\n~750 word response on alternating weeks (Post/Response/Post/Response)\n~5000 word final paper due three weeks after the semester ends\n~10,000 word conversations with your classmates about the self—not required but it will probably happen.\n"
        },
        {
            "course_name": "Lit Hum",
            "review_date": "May 15, 2016",
            "review_content": "\nReading these CULPA reviews made me skeptical of taking this class at first. But let me tell you, I couldn't be happier that I did. First of all, Professor Lilla treats his students with the respect and expected us to perform at a college level. I'm sure many Freshmen were intimidated by this, but I really think this class was a great introduction to what college courses are like. We engaged with the texts in this course at a much higher level than other LitHum classes. Our classes were basically an open forum for discussion of higher themes and philosophical concepts that made us challenge our beliefs and get outside of our comfort zones. As someone who took AP Literature in high school, I was so sick of spending copious amounts of time analyzing symbolism, metaphors and other basic stylistic tools. In Lilla's class, while we did discuss and break down the writing styles of various authors, the objective was to get to a larger level of understanding about specific cultures and the moral progression of western civilization. I loved this spin on LitHum and appreciated the chance to think at a higher level like this. I also learned so much from my peers in this class and I think we all reached a level of understanding and respect for each other.\nSo in short - do not be intimidated at first by other reviews or by the first class in which Lilla tells his students that \"this is not a safe space.\" Our discussions were well worth the initial discomfort some students felt when being pushed to engage in the conversation. I think everyone in our class progressed as a writer and a thinker which really set us up for what to expect throughout the next 3 years at Columbia.\nWorkload:\nFor each class (2 per week), 3 students were asked to post a longer 600 word response to a text. Then we picked one post to respond to. Individually you were responsible for 3 longer posts throughout the semester.\nMidterm was a take home paper (so much better than an in-class exam)\nFinal was the standard LitHum exam.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "April 30, 2016",
            "review_content": "\nBe wary of Professor Lilla's grades. They are not charming nor they are sometimes fair.HOWEVER PAY ATTENTION TO WHAT HE SAYS BECAUSE ITS VALUABLE BEYOND THE CLASS, ITS VALUABLE FOR LIFE. \nTaking Professor Lilla's fall LitHum section was certainly challenging and rewarding. His class is dynamic, open and he encourages free discussion (as long as you are willing to defend your position). Of course, just as any Professor in LitHum he will guide the discussion towards areas he finds more interesting, but if you are able to make the case for something else, and defend it against his comments, you will see the class steering your way. This class is not for those who do not like to argue, for anything you say he will challenge. Don't take it personally because he wants for you to improve and that's the value of this class. Not only is his extensive knowledge of the works and Western Civilization impressive and engaging, but he knows about life, and pay attention to what he says because you'll learn more about yourself, than about Achilles or any Greek hero in Professor Lilla's class. \nDo not expect fantastic grades. They are not easy to get, although they're not impossible. In terms of feedback, just know that he is not there to mess around so be ready to get feedback during the class, and only after your long paper assignments. \nI absolutely recommend this class (and professor) to anyone who came to college to not only get a diploma, but learn and grow as an individual. You will enjoy the discussions and learn about history, philosophy, literature and much more. Don't hesitate when taking his class, but be careful because it won't be easy and you might shed a tear or two. \nWorkload:\nOnline reflections once per week on the texts assigned, as well as three major papers throughout the semester. \n"
        },
        {
            "course_name": "Rousseau",
            "review_date": "April 28, 2016",
            "review_content": "\nAm surprised to see that Lilla no longer has gold nugget, since he really hasn't changed and probably won't barring unexpected head injuries. I'd like to focus on the seminars so people who didn't take LitHum with him can get an idea of whether it's useful. Or skip the reviews and read this article for his thoughts on liberal education:\nhttp://www.slate.com/articles/news_and_politics/college_week/2005/11/college_makeover_8.html\n--\nIf you're concerned about grades and workload (perfectly understandable), you might want to rethink taking his LitHum section.   I think that if you're humble and you put in the work into writing your posts (most important part, easiest way to tell if you've done the reading) and participate in discussion, you'll be fine.  He is easily one of the best LitHum teachers, and most importantly, he actually really enjoys teaching the class and listening to his students (no, really).  Yes, he does tend to guide the class onto certain interpretations, but generally speaking this is much more useful and more interesting than chaotic speculation (never mind the fact that he knows the books better than any student).  Broader discussions of themes happen frequently, but only as results of conflicts within the texts themselves.  That said, if you have a good grasp of the text or an alternative interpretation, you should definitely be able to contest or augment his own picture, so please do that and don't bitch about the class being an echo chamber.  I actually get the feeling he would like it if people were more combative (at least that means you're invested).\n--\nSeminars: they are glorified reading groups.  Lilla will select a single main text for the semester (in some instances supplementing it with other readings), which the class will read at a slow pace.  The class is divided into halves, which alternate between writing long posts (1000+) and shorter responses (500+) every week.  Depending on how good the posts are, Lilla will organize the class around them (inserting topics or passages that he feels are important).  Classes go like this: he gives a little intro sometimes, then jumps directly to a passage, which becomes the basis for discussion until time demands that the class move onto another passage, and another topic.  On rare occasions, he will lecture a bit when a certain idea comes up (negative theology, for example) or if the class is just lost.  Discussion is usually very good at comparing different readings and different angles on the texts; Lilla will also bring up other thinkers and books, which I've always found useful (if merely tangential). \n---\nLilla has the knack for transforming everyone's comments, both good and bad, into useful observations for the rest of the class.  I have found that the quality of other students (and my own, of course) mattered very little to how much I get out of it, since Lilla seems to make it all intelligible.  This is especially impressive because his class attracts such a random bunch (people from across the humanities, and a couple outside), who are used to approaching problems in their own fashion.  Of course, it also helps that he doesn't take undercooked bullshit - if he doesn't understand you, he will ask you to clarify, and he's really not into patronizing moralists who proselytize instead of analyzing (very rare though).  Lilla takes the discussion pretty seriously, and it's not uncommon for him to take notes and learn from students (it's also pretty invigorating to feel like you're being taken seriously, and I haven't gotten that from any other professor).\nI will say that some people have told me they weren't a fan of the way he approached texts (whatever they meant), and some have said they appreciated other teachers for allowing them more leeway for personal exploration.  I either disagree or do not understand these criticisms (see article), but, they're there... \n--\nIn the past, Lilla's done classes on Montaigne, Rousseau, and Pascal - but he will do different texts in the future.  It's really probably your best opportunity to spend a lot of time trying to understand the text, and I would recommend it for that reason alone.  What really makes Lilla's classes great for me isn't really the discussion or his insight, but the fact that by the time I've turned in my final papers, I will feel like I've come to know these books very intimately, and it would be dishonest to deny that each of time my interests and thinking have shifted.  After you take his class, there's just no way you can read philosophy any other way, and no other class will come close to giving you a similar kind of experience.  It's because of this that I would take a Lilla class no matter what he taught.\n--\nFinally, I want to put in a good word for the man himself: capital fellow, un bonne homme cause he likes French.  He loves teaching and his students, and people across the spectrum of interests and beliefs like his classes (lots of repeat offenders).  He also has a great sense of humor - or am I the only one who's noticed he has/had portraits of (I think) Napoleon and Burke in his office? \nIntellectually, he is a fantastic resource - he's good on basically any period of Western intellectual history, but he's best on early modern and 20th century Europe, and he's especially good on Christian theology and also on politics.  I have yet to receive a bad book recommendation from him.\nTLDR: No, fuck you, I put time into this.  Damn, it's actually pretty long.\n\nWorkload:\nAlways a lot of work.  To be fair, he puts in just as much work (people seem to miss this fact).  If you're a senior taking his class in the Spring, then you'll have less time to finish your longer paper.  Seems pretty dicey to me.  He would give feedback on my writing, but I only got it when I was a sophomore (in other words, when I needed it).  Either I really am the shit, or he likes me too much to tell me I suck.  Not that concerned, honestly.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 07, 2016",
            "review_content": "\n\"I do not provide feedback on short responses. I will provide feedback on your long posts.\"\nThis was the response Lilla gave me when I approached him for feedback on my first short response, because I was new to the class and wanted a general idea of whether I was headed in the right direction. I should have taken it as a warning sign, but I didn't. Ultimately, I only received feedback from him once throughout entire semester, for the 3 long posts I wrote. I was not surprised, but that did not make the experience any less frustrating, especially when I had already made it clear to him that I was an international student who is new to literature. I approached him for help; he rebuffed my attempts. Imagine my frustration when he chalked my lackluster midterm performance down to the \"unfortunate fact that some students are simply more at home in the languages,\" along with some vague reference to my international background. Granted, the factors he named were probably relevant, but I would have appreciated more self-examination on his part. Lilla is also extremely vague about his expectations for the final. I completely concur with his view that the point of lit hum is to learn, rather than simply earn a good grade. However, this led to a great deal of ambiguity over the exams. For instance, he went through the entire semester claiming that he \"does not care about passage IDs.\" When one of my classmates attempted to clarify his expectations regarding the exam, he told her than he \"did not want to talk about it yet.\" We were eventually only provided with information on the final, on the final class before the exam. And yes, he cared about passage IDs a lot more than he let on.\nPersonal grievances aside, Professor Lilla led great discussions, and had brilliant insights on all the works we read. The way he approached the works from unique angles taught me a great deal about how I should approach the readings, which I really appreciated. If you're an independent learner who appreciates a good discussion, Lilla is your man. However, if you'd prefer more support, feedback, and clarity  from your professors, look elsewhere. \nWorkload:\n2 short posts per week, 2-3 longer posts per semester, one take-home midterm, and an in-class final. Weightages for each of these components are not provided, because Lilla thinks of exams as a necessary evil and does not want to spend more time dwelling on it than he has to.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 20, 2014",
            "review_content": "\nThe biggest mistake I made my freshman year was lookup Mark Lilla's (then with a golden nugget) reviews and choose his class. Mark Lilla asks his students to write CULPA reviews which makes it much more likely that students who are partial to him write him good reviews.\nGrades  : Mark Lilla is not the kind of teacher you want if you want good grades. Very biased, judges on style (subjective) rather than on content. He is also very partial to specific people, as one might observe during class.\nContent : Mark Lilla is very opinionated. He will only teach what he think is right, and he will only focus on the part of the text that he is interested in. Any questions leading to some other topic, regardless of how important it may be, will be dismissed.\nWorkload: Mark Lilla's ridiculously enormous sense of self importance about himself and his class makes him assign a massive amount of work that he expects to be done with top priority.\nGiven that, there are some students who do well in that class and those students are very specific to Mark Lilla's taste, and there is not really much of a correlation between whether they are good writers or not. Mark Lilla is very paternally condescending and demeaning, which does make some students worship him, but overall makes his class unpleasant.\n\nWorkload:\nWorkload: Mark Lilla's ridiculously enormous sense of self importance about himself and his class makes him assign a massive amount of work that he expects to be done with top priority.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "July 23, 2014",
            "review_content": "\nFirst off, I want to say that I'm not writing a slightly negative review because this class is hard. Sure, it's more work compared to some LitHum classes, but the workload isn't bad (see below), even if Professor Lilla does grade a little harsh. I got an A; not impossible. I agree in part with some of the reviews here. Lilla is very intellectual and will teach you a lot about writing well. I found many of his musings thought-provoking and valuable. Make sure you schedule a meeting with him at least once; he's interesting to talk to outside of class. He's a funny man with a somewhat sincere, somewhat jocular disdain for our generation and the depravity of modern society. \nOne thing you notice right away with Lilla is that he likes to engage with the \"big\", overarching, important philosophical issues within a text. However, these philosophical issues aren't really up for interpretation. He will hear your views in class discussion, but ultimately presents his own view as the correct one. Of course, his is probably the most valid interpretation, but I personally think that LitHum is more valuable as a course based on many interpretations. Nevertheless, most days I find him fascinating to listen to. \nMy biggest frustration with Lilla's class is that he mainly likes to focus only on the \"big philosophical issues\". This is fine, but it neglects the issues that certain students might want to raise because of their cultural/personal background, identity, or experiences. It disregards the fact that people might have different views because of where theyâ€™ve been in life. (If Lilla were reading this right now, he would call out this review as sentimentalist and â€œsoftâ€\u009d.) If you want that kind of classic, glorified Ivy League professor, then by all means, pick Lilla. Youâ€™ll still learn a lot, but not without frustrations. I certainly did, and I definitely wouldn't trade the experience. \nWorkload:\nCourseworks post for every class, but you can miss a few, paper instead of a midterm (counts for about half your grade), 3 slightly longer posts each semester, no quizzes or other papers, standard final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 14, 2014",
            "review_content": "\nI honestly feel bad for you if you don't take Professor Lilla's class. He goes through the readings in ways that make solid and thought-provoking claims, but also leaves adequate room for students to challenge his ideas and develop their own. He is a genuinely good guy that works hard to get the best out of his students.\nYou can copy and paste this link to view a lecture he gave linking many of the year-long course's readings. https://www.youtube.com/watch?v=cF_AH0rfZe0\nHow to do well in the class: Treat your major posts like graded essays, and make sure you form and have a firm grasp on your own ideas, because they will be challenged in the seminar. Also, thinking about how the different works relate to one another as you read them throughout the semester will help on the midterm and final.\nSeriously though, give this guy his damn golden nugget back! \nWorkload:\nProbably heavier than most sections, but completely appropriate for a four credit class.\nPosts for every class, a take-home midterm (essay), and a standard course-wide final that he'll probably tweak.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 13, 2014",
            "review_content": "\nProf. Lilla takes the readings into the scope of human nature. He tells you this from day 1, and at times it becomes rather philosophical. The class will make you think a lot and learn how to defend your arguments because Lilla is very well read and will quickly propose counterarguments to your response. Sometimes, class discussion feels like it's being pushed in a particular direction with little room for deviation. All in all he's a great teacher, would recommend taking his class if you're not afraid of a little extra work. \nWorkload:\nA discussion board post every day with 3 long posts once in a while that your classmates will respond to. Midterm is an essay. Would consider this to be more than the usual LitHum workload. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2014",
            "review_content": "\nHaving Mark Lilla as a professor was the highlight of my second semester. Of all the courses I've taken in my first year here, I can confidently say I took the most out of his. I just wish he taught my section first semester too. Lilla's guidance through the readings greatly changed my perspective on things (for the better!).\nGetting away with not reading the books is rare -- Lilla seems to have a sixth sense that allows him to figure out who did the reading. The CourseWorks posts probably give him a hint, but I'll go with the sixth sense.\nThe posts, although somewhat time-consuming, are what really make Lilla's class different. By the semester's end, I felt like the posts helped me much more than just reading the material. I had a greater understanding of the themes and their significance not just to the works, but also my personal life. He asks for more work to be put into his class than most other LitHum professors, but it's beyond worth it. \nAs for tests, Lilla gives a take-home essay rather than an in-class Midterm. Upon receiving the graded essays, some students may need to rewrite their work, which isn't as bad as it sounds. When doing the rewrite, take Lilla's comments to heart. To say he is a fantastic writer would be an understatement -- his notes and advice helped me with my writing more so than those of my UWriting teacher. \nTLDR: Mark Lilla is a spectacular human being. If you're in his section, don't switch out. Do the extra work, improve your writing, and brag reading all (or most) of the semester's books.\nWorkload:\n800-1000 word CourseWorks posts from three selected students per class meeting (2x a week, selected students cycle so everyone is chosen 3-4 times); 300-500 word responses to the 800-1000 word posts; 1 Midterm Paper with a possible rewrite (depending on how well you wrote); 1 Final exam. Basically what the below reviews stated.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 09, 2014",
            "review_content": "\nIf you are willing to put the necessary intellectual effort into this class, it will be the most rewarding one you take this year. Each lesson begins with Professor Lilla providing some illuminating historical/philosophical context for the text being discussed that day, followed by a class discussion of the assigned reading with some in-class readings of particularly pertinent passages interspersed throughout the lesson. Lilla requires you to write a short essay (300-700 words) twice a week on the class' courseworks discussion board, each due the night before class, usually in response to a longer essay (at least 700 words) written by another student. You'll be required to write 3-4 longer essays over the course of the semester, and these papers are later discussed during class. \nInitially, I hated the format of Lilla's class: he will frequently call on students that aren't raising their hands, and his manner of interrogation often feels like a cross-examination, during which you have hardly any time to formulate a coherent response to his question - which Lilla will then follow with another question directed at any fragile or ambiguous facet of your shitty argument. While Lilla doesn't intend to make his class agonizing, for someone who requires a lot of time to digest the density of material Lilla presents in each discussion, it can be difficult to focus in class with the constant fear of being unprepared to answer if called on. Some students are skilled and experienced in this style of discussion, but others may struggle to adequately articulate their thoughts in a forum-like setting with Lilla as a moderator. Many students switched out of Lilla's Lit Hum section due to his high demands, but he seemed to relax his confrontational/intrusive approach in class after the first few weeks of the semester. The class will remain demanding, but as you toughen up and adapt to its requirements, you will become aware and appreciative of the transformations it will generate in your writing, thought, and awareness of self. Lit Hum is essentially a Fisher-Price Western philosophy course, but Lilla still makes it worth it.\nLilla has high standards because (I want to believe) he cares about your development as a student, thinker, writer, and human. He makes an effort to give each student the individualized attention and criticism (there will be a lot) they require to improve, and he frequently stresses the importance of establishing proper writing technique early on in one's academic career. Lilla makes himself available through various lines of communication; his email replies are rapid and he holds office hours before classes for a more personal discussion of your work and life in general.\nI should add that the class shifts in difficulty after the midterm as the historical pace within the texts accelerates. In the last few books, I found it more difficult to discern which connections between texts and political philosophies were the \"right\" connections to make, and found my mental repository of relevant knowledge constantly lacking without Lilla's instruction. With this arises an increasing reliance on Lilla's own political interpretation of the history and the text, which can dangerously lead to a stifling of all other potential perspectives - it felt impossible at times as a student to create any argument that wasn't in line with Lilla's own analysis.\nI constantly felt unworthy of even being in Lilla's presence, but being assigned to his Lit Hum section was one of the best things that has happened to me this year.\nWorkload:\nAs said earlier: short essay (300-700 words) twice a week on courseworks, each due the midnight before class. 3-4 longer essays (700 words) over the course of the semester, 1500-word paper midterm, doesn't care much about passage IDs on the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2014",
            "review_content": "\nI have very mixed feelings about Prof. Lilla's class. On one hand, it was an incredible amount of work and at times felt like an echo chamber of students desperately repeating the same thing over and over to earn their professor's approval. On the other hand, when the class transcended this, I really did learn/think a lot about philosophical issues I feel like other Lit Hum classes rarely approach. \nClass: takes the 5-15 minute lecture then class discussion format: participation is mandatory. You'll be called out for saying something outright stupid or totally irrelevant, but otherwise he's not as critical as people have said. Sometimes it seems like he's searching for only one right answer (as in, the interpretation he agrees with), which I found irritating. However, they're often very interesting interpretations. I'm talking about this so much because you have to be totally invested to do well. \nYou also really do become a better writer, as you learn what kind of posts will elicit a response/he lambastes your essay. I did appreciate Prof. Lilla's obsession with word precision, which was never mentioned in U Writing. \nHonestly, I would recommend reading one of his writings (google them) before deciding. If they seem interesting, this really will be a valuable and challenging class (probably the one you think about most the entire semester, rather than a throwaway graduation requirement). If they don't appeal to you, transfer and save yourself a couple hours a week. \nWorkload:\nA lot. Each class requires a 250-500 word prompt that you'll want to take seriously (it took me 45-90 minutes), and you absolutely have to do the reading. Three 750-900 word essays. A 5 page midterm essay that I struggled with.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2014",
            "review_content": "\nHad Professor Lilla for Lit Hum spring semester. It was an incredible experience. Although the adjustment to a heavier workload can be bumpy in the beginning you will soon see the method behind his lectures that makes this class so amazing. Each student comes in with a 300-500 word response to another student's analysis of the reading. Though this may sound like a lot once you have been launched into the course discussions writing these becomes second nature. The lectures themselves are at once informative and philosophical. Professor Lilla begins with a contextual lecture of the source at hand and then opens it up for discussion. This is not a typical Lit Hum class nor is he an easy grader. But, as other reviewers have commented, if you work hard and dedicate yourself to the course material you will walk out not only with the grade you've earned but also with a powerful grasp on the course material. Hands down, best class of freshman year. \nWorkload:\n300-500 word response every class\n2-3 700-1000 word essays \n1 midterm essay, no midterm test\n1 course-wide final\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "January 17, 2014",
            "review_content": "\nLit Hum discussions with Professor Lilla were all well-organized. Every discussion had a introduction, a middle and and an end. During the first 10 to 15 minutes of class, he will speak about the historical and authorial context of the text. Then, he will explain the important themes. This is when he opens the floor to discussion. During the final 10 minutes, he will again take control of the class discussion and deliver a jaw-dropping conclusion.  He will tell you something you had never thought of or unravel a metaphor in the most awe-inspiring manner. Everything we discuss leads up the final 5 minutes of class and that's when he drops the bomb.\nI must also say that professor Lilla is extremely fair. He will take your hard work into consideration. Your grade depends on the quality of your writings on courseworks, the essays and the final. He will give you critics of your responses in a timely manner. If you put effort in his class, you will get your deserved \"A\". \nHowever, I found class to be quite uncomfortable at times. I think it is because Professor Lilla has complete control over the discussions. He may or may not call on you to speak that day. He may or may not ask you to elaborate on the review you posted the night before on courseworks. Class discussions were quite strained because you do not have time to develop your ideas as you speak. You will need to think through your ideas and then explain succinctly. Otherwise, he will interrupt you and ask you to state your point. \nOtherwise, I learned a lot from our class discussions.  By the end of the semester, I had a thorough understanding of the texts.   When finals rolled around, all I needed to do was read my class notes and go through the courseworks responses. \nAll in all, I strongly encourage you to take Professor Lilla's class. He will push you to become a better writer. If you intellectual discussions and \"aha moments\", take his class.  It is very hard to forget Professor Lilla's lectures.  He is one of the best professors I've had thus far.\nWorkload:\n300-500 word review on coursework every week\n800-1000 word review about 4 to 5 times during the semester.\nEssays\nNo Midterm\nFinal\n"
        },
        {
            "course_name": "American Conservatism since 1945",
            "review_date": "January 07, 2014",
            "review_content": "\nI'm glad I took this class, because it exposed me to a field of conservative authors and ideas that I was comfortably unaware of in my liberal cave. Nonetheless, I feel as if I didn't come out of the class with a whole lot -- it really just opened the door for me to now go out and do the digging on my own. I mostly attribute this to my own lack of background knowledge in political philosophy, but I do believe that Lilla and Brinkley could have done a better job of crafting a narrative for the class. Be aware that a good deal of background will be essential for your participation in discussions. This was not necessarily enforced by Lilla or Brinkley, but by other students who sometimes brought the discussion to areas that were uncharted territory for some of us.\nI also learned once and for all that I prefer the Foner-style course approach of historical monographs supplemented with primary documents, rather than primary documents supplemented with some light monograph reading. Obviously, this is an intellectual history course, but if you prefer to learn about the intellectual developments through the lens of historian authors, you're not really going to get it from a syllabus by Lilla (who is an ideas man through and through) or Brinkley (who does seem to like monographs more than Lilla, but is still more document-driven than Foner). I found the Phillips-Fein and McGirr readings (monographs) to be among the best of the semester.\nWorkload:\nMedium to heavy; start your readings early in the week so you can do an early post before others dominate the discussion boards, leaving little room to intervene; there was only one larger paper, though, and we were given plenty of time to complete it\n"
        },
        {
            "course_name": "American Conservatism since 1945",
            "review_date": "January 02, 2014",
            "review_content": "\nOverall, this class was rewarding. You will leave it with a more thorough understanding of the various breeds of conservatism, their constantly mutating relationship with one another and the transformations the different ideologies underwent over time. More significantly, the course compels you to consider the nature of American democracy in ways other \"straight\" (e.g. non-intellectual) history courses might not  -- its fundamental precariousness, the inherent religious devotion of Americans, etc. \nThat being said, there was a bit of a learning curve (it may have just been me) at the beginning of the class; I came in with very little background in American politics or current events and felt like I lacked a basic framework many of my classmates already had. This is not to discourage people who are interested in the class more for its philosophical content; I would, however, suggest coming into the class with a specific question in mind (pertaining to the broader themes of the course) as a way of anchoring yourself for the first few seminars. \nBoth Brinkley and Lilla were great; each was very generous with his time and resources, willing to meet with everyone and soothe our final-paper neuroses (often multiple times, although at one point Lilla will want to \"return the baby monitor\"). By and large, Lilla ran the class discussions; he asked \"big picture\" questions that were thought provoking and, ultimately, made the class for me. He also did a good job of moving the discussion along when it got bogged down. Brinkley would supply historical context when necessary, which I found immensely helpful. They are very different thinkers; being able to learn from both in one class, while ultimately enlightening, was not without its chaotic moments. \nAll in all, a worthwhile experience that is not to be missed.\n\nWorkload:\nMedium to heavy, depending on the week. Weekly postings of about ~500 words (or more) that require effort and real engagement with the text. A final paper of about 12 - 15 pages on a topic of your choosing due about halfway through winter break.\n"
        },
        {
            "course_name": "American Conservatism since 1945",
            "review_date": "December 11, 2013",
            "review_content": "\nThis class was co-taught with Alan Brinkley, but Lilla generally facilitated most of the discussion. He was extremely effective in generating thoughtful discussion. He's not afraid to challenge you if he thinks you're on the wrong track, and will follow up on what you say in case it is unclear what you meant. At times though, I felt that the conversations we were having started to drift away from historical analysis, focusing merely on whether or not the particular conservatives we were reading were right or wrong in what they believed. Lilla is concerned primarily with the history of ideas, and so it seemed to me that he was more interested in the ideas themselves than (as I often wanted to discuss) what made this or that idea possible or relevant at this or that particular time. I think I definitely benefitted from his approach, though, even though I might have wanted to take things in another direction.\nIn general I think the readings (mostly Lilla's choices, it seemed) were very appropriate and interesting, expressing most of the important thought in each area/period of conservatism we covered. Many might disagree with me, but I would have liked actually to see more secondary sources on the syllabus, but that's just my interest in not-exclusively-intellectual history talking.\n\nWorkload:\nSomewhat unusually considering the history courses I've taken before, Lilla actually read our courseworks posts, took them seriously, and brought them up in class. This was a motivation not only to do the reading carefully, but to be sure to have something to say about it.\nFinal paper of your own choosing, both subject-wise and length-wise\n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 23, 2013",
            "review_content": "\nWhen the professor for my second semester Lit Hum class was named, I rushed to CULPA, probably much like you all are doing now. I was pretty intimidated when I read the reviews that were posted before... Lots of \"unfair grader,\" \"critical in class discussion,\" \"impossible to get an A\" accusations were thrown around, which are the words we are all are drawn to, but the words none of us want to see. \nHowever, upon completion of Professor Lilla's class, I have gone back and read these reviews, and I can say for certain that there is a reason he has a gold nugget. I wholeheartedly agree with the overarching theme of these reviews; Professor Lilla is a fantastic teacher in every sense of the word when it comes to provoking thought, encouraging constructive dialogue, and actually bringing real-world significance to the books we read. He did not encourage literary analysis on the micro level (i.e. analysis of diction, syntax, etc.), but instead on a macro level, focusing discussions on the broader ideas and themes of the works we read, which makes sense considering most of these works are translated anyway. While this is a bit of whip lash coming from high school English and other Columbia Core classes, the completion of the class leaves you wondering why every professor doesn't teach the way Professor Lilla does. It's more fun to write, talk, and think about. I won't say that I looked forward to going to class (who looks forward to going to a 2-hour Lit Hum class, anyway?), but once I was there and the conversation started rolling (about 5 minutes into class), I was not only stimulated by the content of conversation, but also genuinely happy to be there. \nProfessor Lilla loves his job. That being said, he takes it very seriously (as all great teachers do). So don't eat, talk, text, or drink anything other than water in his class. You probably would even be better off if you made it a goal not to move in his class. And please, please, please, for the love of God, use parallel sentence structure in your writing. Sound awful? It's really not. He just means business and wears a full suit every day to class to show it. This creates a great atmosphere, and if you embrace it, you will learn a lot more than you realize. He also really cares about his students, not only in his class but in their own lives (I think that was parallel pronoun usage, but if it's not, I can see Professor Lilla writhing in pain...). Go in, introduce yourself. If nothing else, it's quite a sight to see the millions upon millions of books he has in his office, stacked to the ceiling. \nSummary: Take the class. \n\nWorkload:\nsame as mentioned below.\n"
        },
        {
            "course_name": "Montaigne & Skepticism",
            "review_date": "May 19, 2013",
            "review_content": "\nNote: Prof. Lilla asked us to write a review about this class so that people will get an idea of what the class is like â€“ a fair amount of people dropped the class both semesters, so it might help if people had a better idea of what the class is like before trying it.\nThe gist: Lilla is an extremely capable discussion leader, and he gives you free reign to pursue any ideas you have about Montaigneâ€™s Essays.  Very thought-provoking experience and rewarding for anyone who enjoys philosophy, history, and literature combined into a single class.  Not for people who arenâ€™t prepared to work a lot.\nCourse Summary:  The class is a year-long course on the Essays, but you donâ€™t need to take both semesters.  From what I gathered, first semester focused on a lot of different topics â€“ virtue, politics, leadership, the self, customs, friendship, vanity, education, human nature, and some more.  Second semester was definitely more focused on human nature and our relationship to knowledge, so the main chunk of the course dealt with the Apology for Raymond Sebond and related.  While this course sounds like it should be offered in a lit department, Prof. Lilla really focuses on the philosophical aspect of Montaigneâ€™s writing instead of the literary issues that make the Essays unique, and I can see why after finishing the course.  Montaigneâ€™s thought is truly unique, blending a whole bunch of ancient schools of philosophy in different parts of the Essays in order to produce a philosophy that has remarkable connections to later thinkers such as Pascal, Rousseau, and Nietzsche. Useful for people interested in that sort of stuff.\nNow, Lillaâ€™s classes all revolve around the same format: each week, half of the class will post an essay of around 1000 words (some people write more), and the other half will have 24 hours to write a response of about 500 words.  These posts are very important: they ensure that everyone does the reading and has a chance to discuss it online before coming to class.  Lilla can then see what issues pop up and build the class around them, which really makes for fluid discussion (or pontification).  It must also be said that Lilla has a knack for understanding and clarifying studentsâ€™ points when they arenâ€™t clear, so if you zone out during someone elseâ€™s speech, Lilla can quickly bring you up to speed.  That being said, Montaigne can be difficult to unpack sometimes â€“ heâ€™s tricky, and often changes positions within the same essays, leading to confusion once in a while (hence the necessity for pontification).  Also keep in mind that Lilla is one of those professors who learn from students just as much as they learn from him.  It is a little hard to disagree with his reading, but heâ€™s always interested to hear your opinion and interpretation, so he usually tries to refrain from â€˜pontificatingâ€™ in class (although whenever he does so itâ€™s usually extremely helpful).  Heâ€™s also (obviously) extremely well read, and you will emerge from this class with a plethora of other books and venues to explore.\nI would try to offer some criticism of the course but I would end up sounding petty...\n.  \nNote: the poster below who complained about Lillaâ€™s focus on the European cannon will be pleased to know that heâ€™s taken up some Chinese philosophy â€“ which actually has some stuff related to Montaigne (see what I mean?  All these connections to exploreâ€¦)\n\nWorkload:\nGrades: Because discussion is so important, it officially counts as 2/3 of your final grade â€“ the other 1/3 comes from a paper due about 3 weeks after break.  Thereâ€™s no size range, and it can be on any subject you desire, so long as itâ€™s cleared with him during the semester.  Students tend to focus on certain elements of Montaigne throughout the semester, so the paper is really just a deeper exploration of what attracts you the most during the semester.  Now, a lot of people comment on how tough of a grader he is, but I donâ€™t think he is.  Maybe heâ€™s harder on freshmen, but I donâ€™t remember anyone being called out in class.  As long as you put in effort itâ€™ll be fine.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 18, 2013",
            "review_content": "\nMark Lilla's class was one of the most intellectually stimulating experiences I have had. If you're looking for a classic \"English class,\" though, don't waste your time hoping for close textual analysis. Lilla uses the books as a spring board for larger topics. Sometimes, by the time you finish class you are not even sure how relevant the discussion you just had was to the book you were reading, but if you think about it, it always turns out to be. Besides, the discussion is always so interesting and valuable in and of itself that for some works it doesn't even seem to matter how relevant the discussion was to the text.\nWhether or not he chooses to focus closely on the text for a certain work, Mark Lilla seems to have unlimited knowledge of every work we read in Lit Hum... and also of everything else. He begins every class with a mini-lecture on the historical context of the work we are reading, along with any other interesting tidbits he has to share about each book. This part is always really interesting and very useful. He then uses quotations to spark discussion--if you like/are good at reading aloud you are in luck, because there is a lot of reading aloud in this class and Mark Lilla will call you out if you don't read with enough gusto. (He will also absolutely call you out if you are sleeping, eating, or just not paying attention or contributing enough to class discussion.)\nHis evaluation of students is pretty difficult to gauge since he doesn't tell students many of their grades, but he is a stickler for good writing and values good quality class participation a lot. If you're insecure about your writing or shy in class, don't hesitate to set up a meeting with him because he will improve your writing and he will pay attention to whatever hesitancies you have about the course. Besides, he is just a really interesting and nice person to talk to.\nWorkload:\n3 900-word papers based on a specific quotation for other people to respond to\n450-word responses to above papers for every class\n1500-2000-word midterm essay (no in-class test)\nfinal: doesn't care about passage IDs\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 15, 2013",
            "review_content": "\nAll the reviews before this one made me freak the hell out about taking Professor Lilla's class...and they're mostly true. \nHowever, that shouldn't discourage anyone from taking his class, in fact, as some people have said, his class really was the best class I took my Freshman year.\nHere are some things to think about when taking his class, and they will be repeating  some of the stuff in the reviews below. He takes LIT HUM seriously.\n1. Read the books. Although some of the reviews say that you can bullshit the class by not reading, I don't think that's true at all. There was actually one point where he guessed that some of us didn't read all of a certain book, and he called the whole class out on it. Also, you can't really engage in the conversation without having read the book. \n2. Yea, he will call people out sometimes. It's never a \"you suck!\" but you can just kind of tell when he's displeased with something you're saying. He'll show it either with a grimace or if you say something abstract he'll keep grilling you on what you ACTUALLY are trying to say. But there's no need to feel offended. I think it's actually helpful--we should be able to clearly convey our thoughts instead of saying fluffy bs.\n3. He's a stickler about writing. He actually taught more about writing than my UWriting teacher. I actually did ok on all my papers. He has every person write 3 papers throughout the semester and gives feedback the next day through e-mail. (from what I got in my e-mails, I think I did ok), but I heard \"horror\" stories from some of my classmates about their feedback. But hey, if they weren't good writers, it shouldn't have come as much of a surprise.\n4. He gives more work than most professors: I mean, a response for every class and three big papers throughout. I HATED it at first, but then I got used to it around Midterm time, and now that the class is over, I actually thought it was REALLY helpful. It's definitely made me a better writer, and it helped me engage with the text more, which helped with the final.\n5. Other classes like to just talk about the books as though this class is AP lit, meaning some classes just care about learning the plot, the themes, the quotes etc to prepare for the final. But Lilla doesn't really care about that stuff. Our class would discuss the themes, but not in the texts' contexts, but how those themes relate to our own lives, about human nature, etc. It felt more like a philosophy class than a lit hum class, and I liked that a lot I know that some people don't. It's whatever fits your personal tastes.\nAll in all, if you got him, you're LUCKY. He was even rated the #1 professor to have for Lit Hum or CC by BWOG. \nIf you're worried about grades...still take his class. Well, I mean, I'm someone who would have been fine with whatever grade in that class. I hate grade-grubbing and I ended up fine. That whole \"one in five get an A-range\" doesn't seem to be true...\nThe only assignments he'll actually give grades are for are the midterm and the final, and the final doesn't even count for much with him. \nIf you're someone who can't really take criticism, are a softie, and care too much about grades, this isn't your class. But I still advise you to take it!\n\nWorkload:\n1. Postings for every class (only 300 words. If you read the book, this shouldn't take too long)\n2. Three longer posting \"essays\", each one about 1000 words.\n3. Take home Midterm paper\n4. Final Exam\nNot bad as it sounds.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 09, 2013",
            "review_content": "\nIf you have been assigned Mark Lilla as your LitHum instructor, you're in for the most intellectually stimulating (and best) semester/year of your life.\nMark Lilla is sassy, funny, and the most intelligent man I have ever encountered in my life. He knows everything about anything. He quotes passages from books and entire poems. He can critique any philosopher you throw at himâ€”in fact, he is one himself (read his books). You will love this man.\nTo have Mark Lilla walk into the room and teach your LitHum class is a blessing, so don't waste any second of it. He makes LitHum his first priority, and expects you to make it yours as well. So don't mess around, do the reading (a little more than typical for LitHum), and participate in class. You'll actually want to do this because you'll be getting even more out of the class.\nHe expects a lot out of you (discussion posts of ~450 words twice a week, with an extended post of ~900 words three times a semester), so do what he expects and you'll be fine. By fine, I don't mean you'll get an easy A (I probably won't), but you'll be prepared for class and if you really push yourself in class and on the midterm/final, you'll be satisfied with your grade.\nMake sure you take advantage of his office hours. He is a real human beingâ€”we talked about where I'm from, what I'm studying, what my interests are, about his books, and a variety of other things. \"Office Hours with Mark Lilla\" is an intimidating experience, no doubt, but once you get in the room, the legend becomes a normal human being who you can relate to and feel comfortable around.\nI realize this review has turned into me just praising Mark Lilla the instructor. To summarize his class, it's tough but rewarding. Put in the work (a bit above your average LitHum workload) and you'll get more out of this class than your other classes combined.\nWorkload:\nMore reading than your average LitHum class, but bearable and worth it.\nDiscussion posts twice a week: ~450 word response to someone's extended post.\nExtended posts thrice a semester: ~900 words on whatever you want to talk about for the given reading. This is where you shine.\nMidterm: Essay on an abstract question. He wants to see your intellectual development and unique thoughts. The grade you receive acts simply as an indicator of how Lilla feels you did. It is not a concrete grade that will count for a certain percentage of your final grade. It's simply a checkpoint (and a reminder to try harder, usually).\nFinal: standard LitHum final. Emphasis on essays, not passage IDs.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2013",
            "review_content": "\nProfessor Lilla is actually the best.\nHe begins each class by talking about each text's historical context and providing background on the author. He'll also bring in other authors' ideas, particularly those that you'll read the next year in Contemporary Civilizations. After talking for around 15-30 minutes, he'll choose passages from the text for students to read out loud and then discuss. Even though the discussions are student-based, Professor Lilla does a brilliant job in directing them and bringing out latent ideas.\nSome classmates have complained about how discussions are not always entirely based on the text. For instance, he didn't talk about some famous scholar's reading of King Lear, and one class session focused on fantasy/reality more than what happened in the text of Don Quixote. Professor Lilla tends to start out with a specific passage and then quickly branch out and talk about larger ideas and how they apply to us â€“ as Columbia students, as college students in the US, as people living in the US, as people living now. Similarly, our midterm was based on one of two prompts about very vague, broad ideas, not at all like the specific \"compare x and y in works 1, 2, and 3\" that my professor last semester assigned. If you prefer text-based analysis and in-depth discussion about each text as an individual work, you may be better off with another professor. I personally found that being pushed out of my comfort zone made me grow much more intellectually, and I loved it.\nSome of the older reviews mentioned him criticizing students during discussion or calling out examples of poor writing. He wasn't nearly as harsh this semester. He gave us a handout on writing tips and gave us examples of errors from our Courseworks posts once, but was hardly condescending when he did so. His emails are very terse, which might surprise you at first, but I don't think he ever \"screams\" at you.\nGrading is a little unclear. He'll give you feedback on your longer Courseworks essays, but won't explicitly tell you your grade. The midterm is the only concrete grade you get before the final. I agree with the review below about the earlier harsh grading comments being outdated, as most of my classmates got a B+ or A- on their midterms. Though we have yet to take the final and receive our final grades, he did assure us that they would be slightly higher than what we \"should\" receive.\nWorkload:\nCourseworks post before every class â€“ three of them are around 900 words, and the others are 450-word responses to classmates' longer posts. The posts take up a lot of time, but they definitely encourage you to think about the text and develop ideas before each class.\nThe midterm is a 1500-2000-word take-home essay.\nDo the reading! It's definitely worth it for the in-class discussions. He also cancelled a class once this semester because only one person completed the assigned reading.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 03, 2013",
            "review_content": "\nFull disclosure: Lilla does ask that all of his classes write a Culpa review on him, because he doesn't belong to any department and apparently that's how other professors get the word out about their classes.\nLilla is a sassy guy. As has already been said, you either love him or you don't. If you don't, you should probably leave as soon as possible because the way he is on the first day is the way he will be for the first semester. He's not fucking around about anything he says, either. You really do have a miniature essay due every class, he really does read them, and he really does judge you based on how well you can write. That said, he should really pick up a uWriting class, because he will teach you how to write properly in ten minutes. If you already know how to write, you have an advantage. You can do the posts without necessarily finishing all the reading and he will probably still appreciate your opinion. \nLilla does not care even a little bit about what grade you are getting in the class. He gives you only one grade before the final, and that's your midterm grade. You only get an A on this if you manage to come up with something Lilla himself didn't think of, which, seeing as he has a PhD, is a little difficult. That said, all the comments about his harsh grading are a little outdated. I think since last year someone higher up than he is said something to him, and he grudgingly agrees that he should not singlehandedly ruin the GPAs of every student in his class. Your midterm grade is not the final grade you get in the class; he grumpily said he was going to boost our final grades, even though we should remember that \"an A- does not mean you are brilliant.\" \nI spoke to Lilla twice outside of class. The first time we spoke, he sought me out, just because he thought one of my posts was interesting. Outside of class, he is pleasant, thoughtful, and will actually remember your name and your interests. He has an opinion on almost everything, but is never nasty in person. Emails are a different story. Most of his emails are entirely in capital letters and that is because he is screaming at you. \nTake a class with Mark Lilla if on the first day you feel like you appreciate his sense of humor. It will be worth the effort in the end if you can deal with his personality. He is definitely much smarter than you will ever be, and he knows it, but he is also interested in helping you learn something, even if you will never know as much as he does.\nWorkload:\nOne midterm take-home essay, one final. \nThe nightly posts should get a mention. In lit hum, it's a little ridiculous that he expects you to finish all the reading and write a full essay on it by 12am the night before. You get used to doing them after a while, but don't start it at 11:30 only because it's only 200 words long. The 200 word limit is unrealistically low for what he expects you to do in the posts, and you'll find that you actually want to spend more time on it than that. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 03, 2013",
            "review_content": "\nTake his class, take his class, take his class. One of the most rewarding (albeit rigorous) experiences at Columbia thus far.\nThe best way to describe Mark Lilla is intense. He is mild-mannered - he's never raised his voice in class - but he exudes such gravitas that, the moment that he enters class, everyone falls silent. We basically clung to his every word, because he's brilliant. To give you a sense of his intellect, he was independently appointed at Columbia, meaning that he's not affiliated with any department, but Columbia carved out a place for him to be on faculty. Not to mention, he knows an insane amount about literature, history, philosophy, pop culture, likely as a result of being an intellectual historian.\nGiven his immense credentials, Professor Lilla could be more exacting than he is. While his workload is heavy, he's a fair grader, and he's always willing to take the time to work with you in office hours to improve your writing/discuss major themes of the course/just talk about life and your college experience in general. He's clearly passionate about the core - he invests a lot of time in structuring his classes, incorporating our nightly essay posts into his outlines to stimulate class discussion. He strikes a great balance between allowing us to speak our minds regarding the works at hand and guiding our discussion.\nWorkload:\nHeavy, even by the standards of LitHum. Expect to read a book a week, if not two. Everyone writes three 1000-word essay posts for the semester, which are due two days prior to class. If you're not writing an essay post, you must post a 300-word response to one of the essays by midnight before class. Professor Lilla uses these essays and responses to shape our discussions, so he definitely pays attention to them. That said, the extensive amount of writing makes the take-home midterm and exam final much more manageable.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 02, 2013",
            "review_content": "\nProfessor Lilla asked us to write this, so he can have students who want to learn from his style. I am a bit scared in writing this, because I feel like he will be able to tell who I am. However, this speaks to how Professor Lilla really gets to know you as a thinker and a writer. \nI will talk more about workload below, but others have called him as the hardest teacher and I would agree. I cannot speak to grades, because other than the midterm he provides no grade (the way he explains his midterm grading is vague, because he admits to grade inflation, but is still a hard grader...still have not gotten my grade). Regardless, I believe \"the juice to be worth the squeeze.\" If you picked Columbia for the Core Curriculum like I did, he gives you your money's worth. He will push you hard in every aspect in your thinking and writing, (He waits 3 weeks before giving you his criticism). He is very blunt, which can be disconcerting, but also a welcome change to some teachers. He is a purist when it comes to writing, become acquainted with Strunk and White. However, he does appreciate philosophy and exigence, which is a welcome delineation from my 1st semester professor who cared a lot about passage analysis. \nHe also is one of the smartest men, and smartest teacher I ever had. He gives his perspective in the beginning of every class, which is very enlightening. The rest is discussion based, where he either agrees or challenges what you are saying. He really does make teaching an artform, in his appreciation of reading passages. He wants us to soak up the text (He insisted on reading Dante's Inferno, because we did not give it justice). He is a bona fide Ivy League Professor, and writes about really interesting things. He has his roots in political philosophy and theology, but came to Columbia to teach this class with his research. Really cares about his class, but come prepare with thick and skin and motivation.\n\nWorkload:\nWork depends a bit on how much you want to put into it, but every class is like that. Blog post due at midnight before every class with 400-600 words, which responds to your classmate's extended post of approximately 800 words. You will have an extended post 3 times a year. His midterm is a take-home paper. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 19, 2012",
            "review_content": "\nWARNING! Don't take this class if you're concerned about your GPA! That's the very thing I wish someone had told me when I took Lilla's class. As I'm applying to some summer programs right now, I had to go get my transcript, and as you all know, Columbia lists % A range on the transcript. Here's a comparison: \nLilla gives 23% A range grades (I only had him 1st semester)\n2nd semester Lit Hum teacher gave 44%\nMy CC teacher gave 71% A range grades\nUW 58%\nArt Hum 97% (yeah I know wtf...)\nMusic Hum (84%)\nNow obviously as you can see there's a huge difference in grades in the core classes with what Lilla gives compared to other teachers and other core classes. Lilla gave some speech about how he's willing to email your parents if they're angry at your grades, telling them that grades don't matter, but as a premed applying to med school, while your science gpa is most important, overall gpa counts for a huge amount too, so GPA matters a ton so don't buy his BS\nI got a B in Lilla, and got an A- or higher in every other core class (I got a solid A in 2nd semester Lit Hum with another teacher)...meaning pretty much I should have gotten at least an A- in any other teacher for 1st semester Lit Hum.\nLilla is tricky and deceptive. he made us do some coursework posting (before the core class drop date) and he told us how we all were good writers and he was expecting a good semester. After the drop date passed, he stood up in front of the class and then berated us for being terrible writers.\nHere's the thing. Lilla sent us two model essays of what he considers great writing and they were goddam awful. Basically the essays were like \"My thesis is this. In my 2nd paragraph I will talk about this. In my third paragraph I will talk about this. The following sentence strengthens my essay in this way.\" \nI'm not even joking. One of the essays was on Gilgamesh and Enkidu and basically the writer straightforwardly says stuff like \"the purpose of this paragraph will be to explain this\" as his opening line. Of course, it's easy to see why Lilla considers this good writing as he has told us again and again that when in doubt, think \"the cat is on the mat,\" meaning you should do as SIMPLE and straightforward as possible. I can see the logic in that,  but personally  I don't consider that good writing. \nOf course, all that said. The man is amazing and brilliant and he will not take BS in discussion. However, he'll call you out on it and attack your statements and say things like \"well that was a great thing to say, if you had assumed none of us read the book,\" or stuff like \"do you even know what you're saying?\" It's not cruel, I'll admit, but very disheartening and if you don't have thick skin, it makes the 2 hours a nightmare. \nIf you don't care about your grades and you want an amazing, intelligent, and inspiring class, of course take it by all means. But make sure you can stand up to his harsh criticisms and insane standards.\nOh yes...did I mention how after our midterm (an essay), he printed out various sentences from everyone's papers and passed it around, spending 30 minutes laughing at us and saying things like \"terrible, just terrible. How could someone write this?\" in order to give us examples of what was terrible writing. \nWorkload:\nUseless courseworks postings, but pretty light in general.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2012",
            "review_content": "\nMark Lilla should be the prototype of Columbia professors-- and all professors. He almost has super powers. \nI visited his office hours and within half an hour I was a different student. We chatted about life for twenty-five minutes, and then he solved virtually all of my writing problems in the remaining five.\nHis class was the most engaging two hours of my semester's schedule. It was a little tough to handle in the beginning of the semester, but by the last class I wished we had another hour for discussion. Because the class is discussion-based, it's almost a treat when Lilla decides to lecture, but he wants to learn as much from us as we do from him. He will speak for a maximum of fifteen minutes straight. Then he will ask for individual interpretations and opinions, and he values them. \nSome of my classmates didn't enjoy his criticism. He will rarely let bad writing or an unfounded argument slip past him without acknowledgement. It's okay. That's a good thing. In my case, his criticism was so humorous and dead-on, I could only laugh at myself. He let me know what was bad, and I was sure not to repeat it. He wants his students to be a little self-sufficient.\nLilla's class is not an easy A, which is awesome. I didn't come to Columbia for an easy A. I came to learn and think, and learn to think-- and this class is perfect for that. \nWorkload:\nThe same as all other reviews have stated. \nLess busy work; more deep thought. Quality over quantity. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2011",
            "review_content": "\nFirst of all, I would like to point out that the December 5th reviews all came in a bunch on the same day. Yes Lilla is good, but not so good that I would write 5 positive reviews for him. (Although this was probably a group of overzealous students in my class)\nHere is a more realistic point of view... Lilla is a great teacher, the guy is brilliant and will create an incredibly engaging class. You will want to read the books just so you can be prepared to participate in the thought provoking discussions. With Lilla you are getting what you paid for with your Columbia tuition. He changed the way I think about the world and single handedly made me a better writer. \nAll that being said, be careful if you are interested in going into finance or getting into that med school you've been dreaming of. The class is harshly graded. Lilla is one of those professors who does not like grade inflation. For you mathy people out there, the GPA-converted average on our midterm (worth a third of the grade) was around a 3.1. Final grades have yet to come out, but in all likely hood the vast majority of our class will receive B's or lower. I completely understand where he is coming from, but we have to compete against students who have that easy A teacher and unfortunately we are punished a little bit for taking this class. To be fair, if he had a standard curve (1/3 of students get A/A-, and the rest are B/B+) this class would be one that I would highly recommend to all. \nWorkload:\nNot much, but you will want to read and think about the works because he is that good. Also nightly posts on readings but not that bad. 1/3 midterm, 1/3 final, 1/3 participation/posts\n"
        },
        {
            "course_name": "Themes in Intellectual History",
            "review_date": "December 18, 2011",
            "review_content": "\nFirst, a description of the course. Themes In Intellectual History: Education was a weekly seminar on five major works in the history of education by Montaigne, Bacon, Locke, Vico, and Rousseau. We read anywhere from 40-100 pages per week and, every other Wednesday, half the class would post a 700-word essay on a passage from the reading on Courseworks while, that Thursday, the other half would post a 500-word response to one of the longer essays. The reading is short enough and everyone has thought about it enough that the conversation usually carries itself once we all walk in the room on Friday. Depending on the week, Dr. Mark will do more or less \"driving\" to push the discussion along (he's a big fan of having students read aloud passages that he wants to look at closely), but he will at least make sure to cover each author's basic aims and methods as well as some of the questions raised by the weekly essays. The heart of the class is neither a broad historical survey of education in early modern Europe nor an in-depth study of how these authors contributed to that history, but essentially a study in closely reading each text's individual narratives and arguments in the style of Lit Hum or CC. The final paper, only about 4,000-6,000 words and not due until halfway through winter break, will indeed, as Dr. Mark says, naturally \"pop out\" of all the work you've done during the semester.\nSecond, since Dr. Mark asked us to fill out his course evaluations but we didn't get a chance before they closed, some general criticism on the course that may sound fairly petty but will, I hope, be useful:\n(1) The aims of the course were a little unclear. Of course, it seems a bit counter-intuitive for the syllabus of a humanities course to prescribe what you will take away from the class, but I think a clearer idea of what we were supposed to be doing, apart from reading and writing about some really cool books, would have made our weekly discussions and the overall trajectory of the course feel much more focused.\n(2) Dr. Mark has a pretty old-school approach to The Great, Dead, White, European, Male, Liberal Canon that I often found unhelpful when trying to make sense of these books. Without blinking an eye, he'll refer to the Judeo-Christian history of education as \"our tradition\" (whose tradition? which one?) or call Rousseau's Emile \"THE modern book\" (compared with what?). Of course, this universalizing approach to \"The Great Books\" is everywhere in the Core, but I think we could have had more critical discussions throughout the semester about why we are reading THESE books and what their limitations are, lest the ghost of Paulo Freire have a conniption. I think these discussions also would have helped connect the big ideas of these books with the realities of modern teaching, since aspiring teachers who take this course may feel hard pressed to relate Locke's theory of bowel movements or Rousseau's theology to the kind of stuff you learn in Classroom Management 101.\n(3) Dr. Mark is not afraid to tell you exactly how he feels. If you give a wrong answer in class, he will tell you. If you are late, he will call you out, publicly. If he doesn't like something you've written, he will say exactly what's wrong with it, sometimes without any concrete suggestions for improvement. If you write a polite, formally addressed e-mail to ask him something, he will write back no more than he needs to answer your question (no salutation, no signature). All this is refreshing and humbling, but also jarring and not so conducive to open discussion.\nBut don't let these points deter you from taking the course. Dr. Mark deserves that gold star of his, for he's one of the best-read scholars, most careful thinkers, and most patient teachers I've encountered at this school. His classes are illuminating and, if they do nothing else, will reaffirm exactly why you're here.\nWorkload:\nSee above.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 07, 2011",
            "review_content": "\nProfessor Lilla is a great. If you are really looking to be engaged in conversation and if you are looking to really learn from the core, then his class is perfect for you. While he encourages class participation, he doesn't force it, and even when sitting in class and listening, it is easy to become absorbed. Mark Lilla knows how to spark insightful questions that you may not have considered prior, and while his class may differ from others, you're really missing out if you don't stay. \n\nWorkload:\nThe readings are manageable (I was able to complete all of the readings before class), and your expectations are manageable as well. You are expected to write three 500 word responses according to a class schedule on an online discussion board, and the times when you are not submitting your 500 word, you are writing a 150 word response to somebody else's 500 word response. We additionally had one paper and one midterm paper which was a 2000-3000 word essay while other sections had to write an on-demand essay, do passage ID's, etc. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 05, 2011",
            "review_content": "\nProfessor Lilla is one of the best professors I have ever had. \nHe often challenges students with philosophical questions that I have never thought about. He is always well prepared for the class. The discussions we have in class are inspiring. He shares with us his brilliant ideas and is good at facilitating the discussion. He is also very enthusiastic about the works we talk about in class. Lit Hum is a class I actually enjoy. \nAll the readings and assignments are manageable. However, Professor Lilla is very strict about writing. He would find every single little mistake you make in your writing and ask you to fix your paper again and again until it is right. His methods have been really helpful to me. English is not my first language and I have trouble with grammar and diction. I have gone to writing center four times in this semester for my Lit Hum class. And my writing improves a lot by the end of this semester. Although he is strict, Professor Lilla is very patient, approachable and encouraging. When I brought my paper to his office hour, he went through it with me thoroughly, pointing out all the problems and suggesting how I can fix them. He also provided me general tips of writing, which were very helpful. \nProfessor Lilla deserves the golden nugget. I would like to take Professor Lilla's class again no matter what time it is. \nWorkload:\nthree 500-word posts; 200-word short post for every class session; reading is manageable; one midterm paper; final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 05, 2011",
            "review_content": "\nAs has been said by many before me, if you got into Lilla's class, don't switch out. His classes are discussion-oriented, which in general terms means either great or disastrous. When it comes to Lilla, it's the former. By deliberately posing certain questions at certain times, while allowing for the discussion to partially determine its own course, Lilla teaches his class very much like Socrates would; you reach certain conclusions (or identify the reasons why you do not share a given opinion) without having someone else explaining them to you. \nAs with many professors, you can tell what Lilla's opinion is on many subjects judging by the emphasis he places on certain ideas or the way in which he explains them. I believe this, however, is actually a good thing; you can infer where your professor stands on many subjects, yet he always allows room for dissent. In this sense, he is more concerned with how you reach your conclusions than with what your conclusions are. \nPerhaps the only downside is that, since Lilla teaches three courses during the fall semester, you don't get as much feedback on your writing as you could. But then again you could probably always get more feedback, and (at least in theory) that's what UWriting is for.\nWorkload:\nI know some people don't think it's too much, but I differ. The quantity of the readings is manageable but the expected level of \"reading quality,\" if I may put it in those terms, is quite high. It's not how much you have to read but how well you have to read that makes it a lot of work.\n3 essays (500-900), one 150 word response per class, one ungraded \"diagnostic\" essay (900) words and a take home midterm essay (2000-3000 words)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 05, 2011",
            "review_content": "\nMark Lilla was the perfect introduction to what the Columbia Core Curriculum is all about. In this class, I learned to question my ideas in ways I did not think they could be questioned. He facilitates class discussion incredibly well, balancing your input with his own incredibly well-thought out ideas of a text. It is a tough class, and he can seem extremely intimidating at first (for good reason), but the amount you learn from him is entirely worth it. Bi-weekly Courseworks posts may seem like a lot, but it helps you engage more actively with the text, and he reads each post and uses it in class discussion, which is incredible. At times you can feel belittled and will doubt yourself, but he gives you the tools and confidence to rebuild yourself as a student.  My writing and ability to flesh out ideas have drastically improved in this class. My only wish is that he would have taught two semesters, because I'm feeling a bit jipped out of the continuity of a LitHum class with a single teacher all year. But if you want to see everything you loved about the Core when applying to Columbia actualized, get yourself in this LitHum section.\nWorkload:\nTwo 150-word Courseworks posts per week, Three 500-word Courseworks posts per semester. Midterm Essay, Final Exam.\n"
        },
        {
            "course_name": "Themes in Intellectual History",
            "review_date": "December 05, 2011",
            "review_content": "\nI'm going to keep this short and sweet.\nNo other instructor has ever done so much to kindle my academic wonder as Professor Lilla. Plain and simple. He is the instructor every student at Columbia hopes (or should hope) to have. Coupling a masterful ability to guide seminars with individual investment in his students, Lilla does what other Professors of similar caliber sometimes struggle to do: he genuinely cares. Not just about your grasp of the subject matter, but your development as a human being as a result of encountering it. \nI've taken multiple courses with him, and would come back for more if I could. Unfortunately, I'm graduating. \nSo to the incoming freshman who just found out you have Mark Lilla for Lithum - rejoice! Do not fear reports of his harsh grading. You're only going to get the GPA you want if you enjoy what you do, and Mark Lilla can show you how to do that. Years from now, when you run into another Columbia alum, the first question you ask them will be this: \"did you ever take a class with Mark Lilla?\"\nTrust me. You want to be the person who says yes.\nWorkload:\nCourseworks postings weekly, one large term paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 05, 2011",
            "review_content": "\nProfessor Lilla and his class were central to my first semester at Columbia.  The class is discussion and writing based, guided by Lilla; in very few classes did Lilla actually lecture.  This is not an easy class in terms of how much it demands intellectually, but it's more than worth it.  Lilla and this class challenged the way I thought, wrote, and lived; I mean that honestly, even if it sounds melodramatic.  At the end of the semester, I know that I have a significantly deeper understanding of the ideas and themes at the heart of the works.  This is evident especially when I compare my notes to those of friends in other classes.  \nLilla himself truly cares for his students, doling out advice whenever asked.  I am touched at the level of attention (in class and personally) he gives to his students, even the ones in Lit Hum.\nI wish I had Lilla for the spring semester of Lit Hum, and I would not hesitate to take any class he offers during the rest of my time here.\nWorkload:\nReadings are definitely manageable.  I think we read less of the history and of the Bible than other sections, but Courseworks posts before each class are mandatory (3 500-word posts/semester, 150-word responses the rest of the time).  Short writing sample, ungraded, at the beginning of the semester; longer (2000-3000 words) midterm paper.\n"
        },
        {
            "course_name": "Montaigne & Skepticism",
            "review_date": "October 20, 2010",
            "review_content": "\nI am disappointed to see that Mark Lilla no longer has a Gold nugget (star?), because if anyone in Columbia's faculty warrants such a rating, it is this professor. If you want the intellectually rigorous experience Columbia touts in its prospective student brochures, take any -- or all -- of his classes. Lilla conducts his classes seriously: the workload is manageable, but intense. As mentioned in the earlier reviews, you will inevitably become engrossed in the reading, discussion, and writing his classes demand. The level of engagement with the texts and your classmates will prove to be beneficial if you are interested in expanding your thinking or improving your writing. Regardless of the course topic, you will learn more than you signed up for -- his methods focus on in-depth analysis of one or two texts rather than a superficial skimming of various works. Even if taking Lit Hum, the practice of quality over quantity remains paramount, a feat difficult to achieve in the Core. \nBottom line: if you want to take a course at Columbia that will stay with you years after graduation, then go outside your preferred discipline and register for any class Mark Lilla is teaching. If you do, you will find a professor who will test your ability to think and write, as well someone who is genuinely interested in who you are as a student and a person. If you want a challenge, and ultimately a rewarding experience, then this is your guy.\nWorkload:\nCourseworks postings in addition to each in-class session; expect to read a decent amount -- especially for Lit Hum. Postings are formal short papers, and constitute the bulk of the grade. No midterm. Final papers are the other determining grade factor, and can be lengthy.\n"
        },
        {
            "course_name": "Montaigne & Skepticism",
            "review_date": "September 06, 2010",
            "review_content": "\nLilla broke me, but it was for the best. I became a better writer. \nYou will also become a better writer, since he's not afraid to tell you if you're doing a terrible job. His criticism isn't spiteful; it's constructive. You should take a class with Lilla if you actually care about what you study, and you want to test your ideas against someone who doesn't suffer big egos lightly.\nDo not take this course if you believe in your own genius and know you would crumble if certain fault lines are exposed and prodded. You may not like the feeling of being humbled, or having to actually think about what you say and write. Again, this isn't aimed to humiliate (although it can feel that way), but to make you a better thinker.  \nLilla will occasionally impress with what seems to be a boundless knowledge of European intellectual history. These moments are stand out because they seem to extend beyond philosophy, into poetry and other arts. These moments reinforce the sense that the ideas being discussed mattered then and now. \nIf you're interested in an easy A, I can't tell you about the grade distribution. While my GPA is better after having taken his class, that wasn't the point at all. Lilla will challenge you as a human being. All in all, Lilla pulls no punches, and neither should you. Take a class with him if you're intellectually flexible and confident that you can string together comprehensible sentences. \nWorkload:\nLilla assigns a manageable reading load. This is helpful, because it allows for ample time to re-read the essays. Coupled this with an alternation between 1000-word responses to the text and 300-word rebuttals to the responses. A final paper that can be any length above 20 pages. \n"
        },
        {
            "course_name": "Montaigne & Skepticism",
            "review_date": "May 09, 2010",
            "review_content": "\nProfessor Lilla doesn't really belong to a department, but floats somewhere between philosophy, history, and English, teaching courses that intensely examine some topic or author he's interested in.  If it's someone/something you're obsessed with, too, his courses are great.\nThis was an intense, ridiculous, and wonderful seminar.  Two semesters focused on Montaigne's Essais, with no background reading, but just the pure (translated) essays and arguing over our interpretations of them.  He sets it up as two \"classes\" each week: one through posted essays and responses on courseworks, then our seminar discussion.  He's a great professor, excellent at drawing out discussion and points of contradiction.  He guides us through the week's essays in class, usually posing a thesis on them that we're free to attack or support.  He's interested in our ideas, and willing to think them through with us.  \nThis course felt like grad school, and if it and the professor weren't so great, it'd be a parody of Academia. It's impossible to take (and survive) this class without getting really involved in it; you have no choice but to write and think and talk about Montaigne non-stop. If obsessive discussions of philosophy, intellectual history, line-by-line close-reading of dead white men, etc, are your thing, then, well, enjoy.  If not, probably won't be fun.\nWorkload:\nMontaigne's Essais are 1000 pages.  We read most of them.  Divide that over a year, and write a 1,000-word essay for half of those weeks and a 300ish-word response to someone else's essay for the other half.  Add two seminar papers.  Manageable if you get really into Montaigne.\n"
        },
        {
            "course_name": "Themes in Intellectual History",
            "review_date": "May 04, 2010",
            "review_content": "\nI've taken three seminars with Mark Lilla, that alone speaks to how much I've enjoyed his courses. For further proof, I didn't do very well in my first seminar with him, but I stuck around anyway (also because I really liked the people in the seminar).\nLilla's seminars have been some of my favorite classes in college. The coursework postings, as tedious as they may be, really make for lively and intelligent discussions in class. Because everyone has already digested and thought about the text before coming to class, we are able to dive right in. He also expects everyone to participate during class. Somehow the people in the seminars have always been really bright, this isn't one of those classes where people talk about how the text reminds them of this scene out of the Matrix or some personal anecdote. Lilla rarely lectures. From what I can remember, he's only lectured during the final session. \nLilla really cares about his students. He took time out of his summer to go over a badly-written final paper and more or less line edited my paper with me. He's the only professor I know at Columbia who will tell a student that s/he does not know how to write. If this happens to you, he'll actually work with you to improve your writing. I can't think of any other professors that helps students so much. \nGranted, Lilla is a bit intimidating at first (just look at his wikipedia page) but he loosens up. He'll joke around in class and ask you about your summer/future plans. \nOverall I would definitely recommend taking a seminar with Lilla before graduating. Unlike what a previous reviewer wrote, I don't think you need much of a background in philosophy to do well in his class. Lilla himself emphasizes that he works in \"history of ideas\" rather than \"intellectual history.\" The class itself is not your average history class. You won't come out of it knowing dates or names or events. But, as trite as this sounds, you will be challenged and learn how to think critically. \nWorkload:\nLilla expects his class to be your first priority. While the readings are generally short, each week you have to post either an essay or a response to an essay on CourseWorks. The essays range from 600-1000 words, though people generally write long. The responses range from 300-600 words.\nThough Lilla says that the grading is done 1/3 class participation, 1/3 coursework postings, and 1/3 final paper, personal experience has shown that your final paper generally determines your grade. To make it easy on you, Lilla will allow you to hand in the final paper after the semester is over. While this sounds like a good idea, I've had a summer and winter break, well ruined is too strong a word, but his final paper has definitely put a damper on my fun. \nLilla is also not an easy grader. I would advise against taking his class if you're the type that frequently pulls all-nighters for final papers. The man's giving you two weeks after the semester ends to write the paper. Take the time to compose a well thought out and nicely written paper. Lilla is a stickler for writing. You won't get away with jargon in his class. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2010",
            "review_content": "\nI am too very disappointed to see that Professor Lilla has lost his gold star. He is perhaps one of the best instructors at Columbia University. Instead of focussing on the style, rhetoric, and history behind the texts that we read, Mark Lilla focusses on the \"bigger picture\". He tries to get the class to determine the message behind a particular text and the implications of the message. \nHowever, although he is a very enjoyable professor, his class is rather difficult for those who want to get an easy grade in Lit Hum with minimal effort. The point of his class is to improve thinking skills and to learn to write and argue in a coherent manner. Do not expect an easy A. Lilla gives students the grade that they deserve. However, by the end of the course with him, your thinking and writing skills will have greatly improved.\nIf you are willing to put the effort into this course and participate in class, then I highly recommend it. Mark Lilla is one of the most brilliant professors at Columbia.\nWorkload:\n3 600 Word Courseworks' Posts (Alternated between students in the class so there are at least 3 students writing one each week), A 200 Word Courseworks' response to one the longer courseworks' posts each week, Early Writing Excerice (ungraded) 3 pages, A Midterm Essay 2000 to 3000 words, and a Final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2010",
            "review_content": "\nI took to heart Professor Lilla's life advice, such as to guide your own education and to decide what is important to you personally.  I also appreciated his concern for students, his intense class discussions and his fabulous outfits.  However, I feel that Lilla's major flaw is that he caters to students who have a background in philosophy and logic, while leaving less knowledgeable students in the dark.  I found myself sitting in class attempting to guess what he was thinking instead of exploring my own ideas.  \nA perk of Lilla is that if he sees improvement in your logic and reasoning throughout the semester he will disregard earlier failures, but good luck improving, as there isn't a lot of guidance or hand holding on his part. \nBasically, I do not absolutes hate Lilla, but I feel that I was not at the level that I should have been to take his class.  If you take him be prepared to be torn to shreds, and remember to savor ant compliments that you do get... they are usually short lived. \nWorkload:\nHe didn't add any books to the syllabus, a lot of postings on course works, the mid term is a paper, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 14, 2010",
            "review_content": "\nI'm disheartened to see that Professor Lilla has lost his gold nugget status. Lilla is an old-school style \"professor.\" He knows his purpose: teach students how to think. Er, rather, how not to think. In any case, he does his job superbly. As the other reviewers point out, Lilla focuses on the big ideas - the things you go to school to think about before you need to start thinking about the real world. He is by far one of the best professors I've had (I'm a sophomore). At times Machiavellian, he is just as surely a Mentor. If you wish to take college seriously, find some time to take Mark Lilla. If you want to coast, skip him. But I guarantee you will notice high returns in all aspects of your life if you take his class and put in the effort.\nWorkload:\nManageable. No midterm, lots of writing. 200 word posts, a few big papers. You'll come to love the Courseworks blog.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 05, 2010",
            "review_content": "\nMark Lilla's class is what Lithum is supposed to be: discussion of important topics raised by or resulting from the books on the syllabus. It's one of those \"uses of literature for life\" classes; if you're willing, you genuinely think about important things by studying important books. I loved the class, and I feel like while I might not have gotten a perfect understanding of what Homer thought or what Herodotus thought, I got the beginnings of an understanding of what I think about the ideas Homer and Herodotus bring up. It's the kind of class Columbia pretends all Lithum classes are (hint: they're not), or brags about in the blue book, etc. Also, Mark Lilla is an extremely intelligent person, and so if he comments positively on your writing, class discussion, etc., it makes you feel like you're really smart too; I agree with whoever said this is a good class for people who get off on feeling like a teacher's pet. Also, while Lilla rarely lectures in class, he often contributes extremely insightful things, either by saying them himself, or by leading the class towards a specific idea about a given topic, so that it seems like you came up with the idea yourself, but really, Lilla was leading you there the whole time. It's kind of amazing. (If you can't tell, I liked the class.)\nLilla's class is mostly discussion. At the beginning of class, he puts some words up on the board, and then class consists of him telling students to read passages out loud, asking a couple of question, and then class discussion. Then another passage, more questions, more discussion, etc. Occasionally Lilla will interrupt this pattern to lecture just a little, although normally to present a particular perspective (Aristotle on forms of government, for instance), rather than to \"explain\" the work we're reading. If you talk a lot, he'll eventually stop calling on you, so that everyone gets a chance to talk. If you don't talk at all, he might ask you specifically what you think about a given topic to force you to talk. Overall, the class is better for people who feel confident in class discussion. You don't *really* have to have read thoroughly in order to contribute in class because discussion rapidly progresses from the books themselves to the general themes they raise, but you really should read anyway.\nAs for the question of difficulty/workload... if you're a good writer, it won't be a difficult class. If you're not a great writer, you'll have to work fairly hard on your writing to get a good grade. Aside from that, it's not hard, and it is true that you don't have to work exceptionally hard on the postings before every class, unless you have one of the longer (600-word) papers.\nBottom line: if you get into Lilla's section, don't switch out. If you're looking for a section to switch into where you can sit and talk about what tragedy means, how cultures deal with death, the difference between Greek and Christian cultures, how empires work, etc., I don't think it gets better than Lilla.\nAlso, Mark Lilla is a god. Just fyi.\nWorkload:\nThree six hundred word papers (but they should probably be somewhat longer), one longer paper (around 2500 words), and 200 word responses before every class. Really not that bad.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 30, 2009",
            "review_content": "\n     After having Prof. Lilla this semester, I definitely agree with all of the previous reviews. Mark Lilla is the kind of professor that sparks genuine intellectual curiosity from his students; He is the kind of professor that Columbia brags about in its brochures. This class doesn't feel like a requirement at all, I actually looked forward to class because I wanted to listen to his words of wisdom. The class is great, he really knows what he is talking about, and he'll be more interested in teaching you about the philosophical and political themes that show up in the books, than the structure and literary resources of these books. As cheesy as it may sound, you'll learn the most about life in this course-making it a great introduction to the college experience. Don't expect easy grades, you'll receive 'real' grades.\nWorkload:\nBiweekly 200 words posts in courseworks. Three 600 words posts in courseworks. 1 three pages written excercise (doesn't count towards your grade). 1 take home 2000-3000 words essay which counts as your midterm. Lithum final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2009",
            "review_content": "\nEmlil rocked. But I don't understand why people seem to think he's god.  \nAlso, I do not understand why everyone seems to be saying \"don't be a slacker.\" I had Lilla for LitHum, and I can tell you, this is a slacker's class. There are no big papers, except for the midterm, and the two hundred word nightly posts are easily bullshat. I did not read one book I didn't want to for first semester (I didn't have him second, only because he didn't teach). Odyssey? Nope. Iliad? We'll just call what I read \"Selections from.\" \nHe likes to discuss \"the big questions,\" but because it isn't a philosophy course and professional jargon isn't used, what comes out sounds a little like stoner philosophy. All-in-all, great class, and especially if you haven't had a crack at discussing questions \"big questions\" before, absolutely take it...you'll enjoy it.\nHe likes political philosophy. We often joked that the only books we needed to read were Plato's Republic and Aristotle's Politics. \nBut most importantly, if you pride yourself on having been the smart slacker in high school, Lit Hum with Mark Lilla is your class. You should have already realized that discussions about the \"big questions\" often range away from the plot of the books. To participate you did not have to read more than one page of the books, if that. SparkNotes was beyond more than enough. The plot overview, not the chapter reviews. If you don't mind taking an opinion on whether stereotyping is ethically okay, the truth is more important than happiness, the afterlife gives life meaning, or any of two dozen questions along those lines, you did not have to read the books. I know I didn't \nWorkload:\nIt sounds a lot, but don't let people fool you. Two hundred words a night is absolutely nothing, we had our only paper INSTEAD of a midterm. The final was standardized, but I doubt we would have had one if it had been up to him. While everyone else was slaving away to read the books and write papers on them, I could churn out two hundred words and be back drinking in fifteen minutes. Workload is LIGHT.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 26, 2009",
            "review_content": "\nHe has a wikipedia page, he's written for the new york times, he's an author of many books, and probably more than that.  He knows his stuff pretty well.  He's extremely smart and leads thoughtprovoking discussions and brings up things you'd never think about when reading the books for lithum.  He exceeds the capability of most professors teaching lithum.  All of this said, I must warn you... HE'S MEAN.  I learned a LOT in the class but he's a monster to you unless you think, write, and speak perfectly.  And trust me, if you're a freshman, you don't think, write, or speak perfectly, just accept it now.  If you try hard, though, he's a little bit less than a monster.  Just a little bit.  You might think you're a great student, but Mark Lilla will make you think twice.  If you believe America is the best country in the world, if you believe the literature we must read is glorifying only stupid white, old men, if you think you can outsmart him and be the best in the class, you're in for a rude awakening, So I hope none of you get him if you think this way.  If you do get him as a teacher, just brace yourself.  You'll have to think more and B.S. less, even though you'll have a lot on your plate.  Accept his criticism as \"tough love\" as he calls it sometimes.  Don't take anything in that class personally.  One minute he'll say you're a terrible writer, the next he'll say you've improved a lot (as long as you actually have improved a lot).  This might seem like the challenge you're looking for, but I'm telling you right now, its harder than it looks.\nAll in all, I'm glad I had him as a professor because I learned quite a lot.  Even so, I'll bear the scars of that class for a long time...\nWorkload:\n200 word response due midnight before every class except when you have a periodic 600 word paper (~3 times a semester).  A 2500-3000 word midterm and a timed final with two essays and an ID section.  More than most classes, I'll add.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 25, 2009",
            "review_content": "\nMark Lilla is the man. He speaks eloquently, he encourages discussion, and he tears slackers apart. His class will make you appreciate literature. And your writing will improve by the end of the semester. \nHe seems like a hit-or-miss kind of guy. People who aren't really looking to put in the work dislike him; people who are willing and earnest like him. Everybody respects him; some fear him.\nHe brings to class a page of notes everyday that he uses to guide discussion. He will have read your papers and will sometimes ask you to share your ideas with the class. If you do not speak, he will call on you.\nIf you're looking for an easy A Lilla's class isn't for you, but the class is worth the hit on your GPA.\nHe appears to be the UChicago type professor. Purely intellectual plus two Harvard-Kennedy degrees. He dresses up to teach class everyday. I think he's a sweetheart in disguise, though.\nWorkload:\nBiweekly entries on courseworks, three 500-word entries, one 2000-3000 word midterm, and standard LitHum final. Not particularly heavy, but daily class preparation needed to participate in discussion.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 26, 2009",
            "review_content": "\nI'd recommend this class for people who enjoy challenges and get off on feeling like the teacher's pet. Mark Lilla is a really cool guy. He's got a sense of humor, and he is great at leading discussion. He isn't an excessive talker, but he isn't one of those quiet professors who let you say bs without being able to back it up. We had to post on courseworks twice a week. Yes, he has a deadline, but if he respects you, he understands when crap gets in the way. He reads over all the posts, and he keeps an eye out for slackers. Don't be a slacker! Each week three kids have to write a big essay from which all their classmates have to write responses to. After you write the big essay, you'll get a review email from him. You don't want a bad review. They can be cold and heart-breaking like Lilla. Don't slack off. This class is worth it if you make the effort. Your writing will be improved, or you'll become a Lilla-groupie, unless he's ripped you to pieces and left you for dead.\nWorkload:\nBi-weekly a few paragraph responses, 2 or 3 big essays, one final. Not too bad. Make a sincere effort and read over it. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 03, 2009",
            "review_content": "\nWithin his classes, one will be challenged to come to educated conclusions about the texts themselves and to develop original ideas and perspectives about these texts and the ideas in them.  \nThemes in Intellectual History: These courses will focus on a single author, text, or theme (Conversion, The Book of Job + Book of Ecclesiastes, Education (Descartes' Discourse on Method, Locke's Thoughts Concerning Education, Rousseau's Emile), Vico (all of his works), Montaigne and Skepticism (the Essais)...). \nLit Hum:  Most Lit Hum teachers are terrible, spending time doing things like going over plot and having students take turns doing presentations of the SparkNotes they printed out that morning.  This is a deep flaw in the Core Curriculum and a waste of too much time, effort, and money.  By all means try to get and stay in this class.  There is a reason why these are the great books: as Prof. Lilla argues, the greatest critique of the Western Canon is within the canon itself, not from a gaggle of angsty and ignorant protesters of the lineup of 'dead white men.'  Take this class: it will not be easy, but this is what you trudged through high school for.\n\nWorkload:\nTiIH: weekly papers posted on Courseworks that are not graded.  Half of the class will write a 2-4 page paper due three days before the class meets (by midnight), the other half will write a 1-3 page response on the following day (by midnight), and these groups will swap weekly.  Also, a 12-15 page final paper due a week after finals.\nLitHum: similar set up as above, (twice a week, but much shorter posts), with a midterm paper and grade-wide final instead of the final paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 03, 2009",
            "review_content": "\nWithin his classes, one will be challenged to come to educated conclusions about the texts themselves and to develop original ideas and perspectives about these texts and the ideas in them.  \nThemes in Intellectual History: These courses will focus on a single author, text, or theme (Conversion, The Book of Job + Book of Ecclesiastes, Education (Descartes' Discourse on Method, Locke's Thoughts Concerning Education, Rousseau's Emile), Vico (all of his works), Montaigne and Skepticism (the Essais)...). \nLit Hum:  Most Lit Hum teachers are terrible, spending time doing things like going over plot and having students take turns doing presentations of the SparkNotes they printed out that morning.  This is a deep flaw in the Core Curriculum and a waste of too much time, effort, and money.  By all means try to get and stay in this class.  There is a reason why these are the great books: as Prof. Lilla argues, the greatest critique of the Western Canon is within the canon itself, not from a gaggle of angsty and ignorant protesters of the lineup of 'dead white men.'  Take this class: it will not be easy, but this is what you trudged through high school for.\n\nWorkload:\nTiIH: weekly papers posted on Courseworks that are not graded.  Half of the class will write a 2-4 page paper due three days before the class meets (by midnight), the other half will write a 1-3 page response on the following day (by midnight), and these groups will swap weekly.  Also, a 12-15 page final paper due a week after finals.\nLitHum: similar set up as above, (twice a week, but much shorter posts), with a midterm paper and grade-wide final instead of the final paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2007",
            "review_content": "\nI chose this class thinking that, because Professor Lilla did not have an entry on CULPA, he was a grad student who'd lead a class I could sleep through for an easy A. Instead, I managed to find a challenging but worthwhile class with a professor who really knows his stuff. When reviewing for the final with students from other classes, I realized just how in-depth an understanding of the material I was fortunate enough to get.\nProfessor Lilla makes sure to cover all the most important parts of each book, but encourages discussion between students and asks them to raise questions about the text beyond the ideas he teaches. Though intimidating at first, Prof. Lilla is kind and approachable, and a noteworthy scholar in his own right. (He has a Wikipedia article and just finished writing a book.) He gives the impression of having studied each of the texts deeply.  One of the best classes I've ever taken.\nWorkload:\nChallenging but easily manageable. Students write three 500-word essays on courseworks per semester, bringing up questions with the text, and students not writing longer posts that week compose short (150-word) responses to one of their classmates' papers. The midterm is a long essay, and there are no other formal papers. The final is graded with attention to the essays and without much regard to the IDs. Professor Lilla prizes depth of thought over memorization.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 13, 2007",
            "review_content": "\nMark Lilla freaked me out. His unquestioned command of the class, discussion, and material mesmerized me in nearly every class.\nI entered his class second semester after having a lackluster first semester in Lit Hum. The man has such skill in drawing out the specialized discussion skills in each student, and his ability to include everyone in discussion makes for a wonderful and extremely informative class. Though he rules with an iron yet gentle fist, his charisma and brain power are simply stunning, and his sincere care for all of the material makes you care as well.\nPicture this: let's just say you're a slightly sexist individual who has just read Virginia Woolf. Grueling, tedious, and needlessly feminine prose you may say to yourself. By the end of the first class on To The Lighthouse, Mark Lilla will have convinced and proven to you that it is 300 pages of beautiful poetry.\nGet this professor, for godsakes, get this professor.\nWorkload:\nSurprisingly light. 3 posted \"papers\" a semester on Courseworks (about 2 pages each), a 5 page midterm, responses to Courseworks, and a final. That's it.\n"
        }
    ]
}