{
    "prof_info": [
        {
            "prof_name": "Shamus Khan",
            "prof_id": 3319,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "The Social World",
            "review_date": "May 04, 2016",
            "review_content": "\nShamus was a witty, enthusiastic, well-prepared, and brilliant lecturer. He introduced many theories and ideas that broadened my outlook on the world and made me excited to continue taking classes in the social sciences. My biggest qualm with his teaching style, however, is his lecture pace. He spoke very quickly, and used zero visual aids, so it was incredibly hard to take satisfactory notes. I think that he should have either a) maintained his quick pace but also used a visual aid such as lecture slides, or b) slow down. The only way to take comprehensive notes (which were necessary because we were quizzed on the lectures) was to use a laptop. I hate taking notes on a laptop- it's distracting to both me and the people around me, but I wasn't able to keep up. I missed a lot of the names that were mentioned, and I constantly worried that I was missing major points.  Otherwise, Khan was a great professor to experience because he is making strides in the field of sociology and clearly has a passion for sharing his experiences and perspectives.\nWorkload:\nLong readings due every class, a 750-1000 word essay due every week, and a 4 question quiz on the previous week's lectures every week. Something that hindered my enjoyment of this course was the transition from article readings to reading entire books. The articles were already challenging/long enough, so it was a major burden to have to purchase expensive books, then read each one in a matter of days.\n"
        },
        {
            "course_name": "Methods for Social Research",
            "review_date": "September 07, 2015",
            "review_content": "\nJust noticed that there's no review for Shamus's methods class, so thought I'd throw one in there. I took Social World with Shamus and thought it was just okay, but his Methods class (taken Spring 2015) was really superb. \nShamus does what more teachers should but do not do - assign clear projects with deadlines and then present all the information needed to succeed. If you need help, you can seek it out. If you blow it, he does not care, but you know you had everything you need to succeed and then some. This is a refreshing and quite frankly generous mentality. \nAnd he really loves Methods. This class did a phenomenal job of presenting lots of different methods as unique ways of understanding problems that are better or worse in certain contexts (ex. ethnography provides detailed insight that survey data does not; experimental methods are the best way to test causality but often cost too much/are not feasible). He has you try each method and reflect on it in a \"lab report.\" I also appreciated how rigorous his approach to science is - he wasn't trying to make us into the budding genius researchers that lots of people thought they were, but rather meticulous investigators who hesitated to jump to any conclusions. It made me a more skeptical and rigorous thinker and I appreciated it. \nThis is a class taken mostly by sociology majors, and you probably don't want to take it if you're not one. That said, if you have to take Methods, take it from Khan. This was the only college class I regret not doing more work for, and I still learned a lot. Thanks, Shamus!\nWorkload:\nnot a small amount of work, but he tells you that up front. \n2 quizzes (one on general scientific methods and the other on comparative and historical methodology)\n3 research projects: one experiment, one survey, one ethnography. The first two you are free to collaborate with people on to write the \"lab report,\" the last one is a personal written piece. \n1 book evaluation - read some articles and a book, appreciate the strengths of the methodology, offer a few critiques that reveal your knowledge of research methods\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "August 11, 2015",
            "review_content": "\nDr. Khan is the man. The Social world is a great course. Not only did I learn a lot in the course but I also became a better writer. The only problem I had in this course was with the TA. Like most large and popular courses your experience, grades and learning yield can live and die on the quality of the TA your are paired with. For the first time in my college career I had to pass/fail a course. \nNot to toot-my-own-horn, but I've published in peer-reviewed journals and social science publications. However, according to this TA, my reviews were too lengthy and my responses were...to be honest over the TAs head. This TAs grading seemed random and selective. Yet, I didn't want to make waves and thought I'd try to win the TA over with my work...never again! Learn from my mistake, don't sit on my hands when your not receiving an accommodation, or your TA has a chip on his shoulder or whatever the issue. \nIf there is a legit issue, Dr. Khan is more than happy to accommodate. I just wish i would have went to him on week 3 instead of week 11\n\nWorkload:\nThis should be a break from more intensive courses. There is a lot of reading but if your in polisci or soc, than its only to your advantage to dive into it. If memory serves, A short paper, and a quiz, alternating every other week. No midterm, no final \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 08, 2015",
            "review_content": "\nFor the first time, a professor truly blew my mind. Khan is not only an excellent lecturer but also an incredibly knowledgeable man. His classes were always catchy, as much as I never felt the urge to disconnect and check my phone out of boredom. Going to class was never a chore but rather an hour and fifteen minutes of entertainment. Khan knows how to present the material in a very clear and understandable way and tends to use a lot of everyday life example to make concepts seem more approachable. He knows how to get his class' attention in pertaining and hilarious ways. \nTaking this class actually convinced me to pursue a sociology minor - that's how much I loved it! The content of the class was very interesting and the readings were just fantastic. His book, Privilege, still stays in my mind. \nKHAN IS AMAZING, TAKE THIS CLASS UNDER ANY CIRCUMSTANCE!\n\nWorkload:\nReadings: 100-200 pages per class\nEssays: one per week summarizing the readings (750-1000 words) - worst 3 dropped\nQuizzes: one per week on the class content - worst 2 dropped\nNo midterm - no final\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 05, 2015",
            "review_content": "\nThis class was a major disappointment. I had read such great reviews of the class, and to be completely honest, was intrigued with not taking a midterm or a final. Big mistake. The readings at the beginning of the semester were interesting, but about a month in they got very boring. The essays became a struggle to write, and the class is curved so much a 70% is a B+. It's ridiculous. \nProfessor Khan himself I did not find particularly compelling. There were certain days where he would have some interesting points about sociology and society. Other days, he was incredibly boring, and I was reduced to bringing a sudoku book to class to fend off boredom. Some of his lectures I found did not even pertain to the readings we were doing, and focused more on philosophers than on applied concepts. He also has an electronics policy, where if someone is caught on the internet or with a phone up to three times, the class is then banned from technology use. \nI would not really recommend this class to anyone, except people who are very interested in sociology and don't want to take midterms or finals.\nWorkload:\nModerate: numerous readings, weekly quizzes, and weekly essays\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 23, 2013",
            "review_content": "\nShamus was absolutely incredible. At one point in the semester, I had spent the entire night working on a paper and rolled out of bed with maybe an hour of sleep before the 10:10am class. Shamus is so exhilarating, he kept me on the edge of my seat the entire class period. He's the best lecturer I've had at Columbia. Easily.\nDon't expect to be able to finish the readings. I tried at the beginning of the semester and could not do it in a reasonable amount of time. Instead, I did as the CULPA reviews suggested and just skimmed. I even did better on the papers as a result.\nWorkload:\nLong readings but really fascinating. Weekly 750 summary due of the reading + a weekly quiz. The class is not cumulative, so each week stands on its own and you will not be tested on any material that is more than a week old.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "April 22, 2013",
            "review_content": "\nThe reviews below are pretty polarizing on Social World with Shamus- love or hate. He's definitely not a terrible professor, but I don't think nearly as high of him as others seem to. \nTo start with, Shamus is an excellent lecturer. He makes his points clearly, commands the classroom, and often brings in interesting and hilarious side notes that keep everyone engaged. To those who say that Shamus' lectures and readings covered too much random material, I say that an intro course should be examining many different facets of a field. The year began with studies and articles and ended with a book that corresponded to each field- Shamus' Privilege is pretty incredible and was the single most influential text I encountered this year. \nHowever, despite the usually interesting reading material and good lectures, I ended up resenting this class for a few reasons:\n-The reading responses. It was a bit unclear at the start what was valued in the responses, so I did the reading and wrote what I thought was an innovative examination of one point that had interested me. My grade- 4.5/10. When I spoke to a TA, he explained that the goal was simply to summarize the readings and draw out the main points. For the rest of the year, I did just that and got much better grades on the summaries (ended up with an A- in the course), but they became mindless repeating exercises of the reading I had just done. I get that Shamus wanted to make sure we read and understood , but it turned the responses into a waste of time for me. Also, different TAs graded your responses each time and each one had a slightly different preference... annoying.\n-The weekly quizzes. The quizzes were supposed to be on key lecture points, but they were rarely straightforward, and though lecture was enjoyable to attend, a four question, under-10-minute quiz doesn't really reinforce anything. almost everything I took from Social World came from doing the readings. \nWhich brings me to my other qualm about the class- Shamus pretty much NEVER talked about the readings in class. His lectures introduced points that were sometimes parallel to the reading, but if I'm going to read hundreds of pages for your class, I'd like to hear why you thought it was important. \nAll in all, Social World isn't bad as intro courses go, and Shamus is a fine professor to have it with. I especially appreciated that he structured the class to reward week by week engagement rather than midterm/final cramming. I just think the execution of the class was flawed, especially the lecture content/quizzes.\nWorkload:\nHeavy reading, about 200+ pgs/week\nWeekly short essay reading responses, worst two dropped\nWeekly quizzes on points from lecture, worst three dropped\nno midterm/final\nnot bad especially if you're good at skimming\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 22, 2012",
            "review_content": "\nThis class was completely amazing.  I took it begrudgingly as a sophomore as the requirement for my minor after having taken advanced sociology classes and was not excited to the intro class.\nKHAN IS AMAZING.\nI wanted to come to class every day.  Even though some lectures were not very interesting he is super funny and engaging with the ~200 people in the class.  If you want to participate (especially ask him a clarification question) he will call on you.\nAlso, he was a great lecturer because his voice carried throughout the entire room and he was easy to hear when I would come in late and had to sit in the back.  This course is amazing and really lays out important foundational sociological ideas in plain English.  I learned how to use these ideas (for example: different definitions of power) in my other classes and know what I was saying, rather than quote a text or something.\nI cannot stress enough how fantastic this class was.  Khan's book (Privilege) I could not stop talking about.  I recommended it to people in the bookstore I work at, my parent's friends, my neighbors, and my friends.  I recommend taking it with him because you get to read his book and ask him questions about it.\nWorkload:\neasy peasy.  Sometimes the TAs were assholes though and you could really never figure out what grade you were going to get on a paper.  1 paper due a week (summary on the reading, 500-750 words) and 1 quiz a week on the lectured material (4 questions each).  NO MIDTERM NO FINAL.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "December 02, 2012",
            "review_content": "\nI absolutely loved this class. Shamus is a great lecturer. He makes the large lecture really engaging through his wit and side stories that are sometimes related and other times not. The workload is really fair, taking into account the fact that we don't have a midterm or a final and at the end of the semester he lets you drop three papers and two quizzes. Taking this class made me sign up for two more sociology courses for second semester and convinced me to become a sociology major.\nKhan's lectures are well organized, though at times can be a bit long-winded. At the beginning of each class, he will put up on the chalkboard the main points that he's going to cover and he usually gets to about half of them. Sometimes he will get side-tracked when he's explaining a concept, but you can tell it's usually because he enjoys the theory so much or just attempts to make it as clear as possible which ends up confusing the matter. Most of the time, however, he gives clear definitions of the ideas he is explaining and will relate them to issues that can more easily be grasped. He was so charming as a lecturer and it was so clear that he's brilliant that it made it fun to go to lecture.\nWe had to write weekly papers on the articles/books we were reading and send them into an assigned group, which would be graded by the TAs. I always did the reading and when I did I got good grades. When I didn't do the reading, I didn't do as well on the papers. They can tell if you're bullshitting. However, you can also scan the readings and pick up on main ideas and write a good paper that way. Some of the readings are really long and Khan clearly doesn't mean for you to read the entire article. Writing these papers helped me learn how to read quickly and pick on the main arguments and supporting numbers or quotes. I learned not only about social theories and experiments from these assignments but also how to read dense academic articles.\nWhich also had weekly quizzes which were not necessarily consistent in difficulty. Some weeks I felt way better about the quiz than others, but that's what happens when you're not entirely sure what will be on the quiz. This taught me how to pick up on big ideas during a long lecture, when a lot of different things are said. The quizes were definitley not impossible and helped clear up misconceptions or questions from the two lectures before.\nOverall, I really enjoyed this class and think Khan is a great professor. \nWorkload:\nWeekly papers and quizzes. Reading before every class. \n"
        },
        {
            "course_name": "Elites In Democratic America",
            "review_date": "October 08, 2011",
            "review_content": "\nI have taken Professor Khan's The Sociological Imagination and loved every minute of it. His energy, enthusiasm, and, sometimes, cynicism immediately convinced me to follow through with the major. I have not turned back since. When it comes to the intro material, Khan is an amazing professor. \nI was excited to take his course on Elites, since I very much wanted to have the opportunity to take a class with him again. I was unfortunately very underwhelmed. \nOnce again, Professor Khan's lectures are superb. However, his approach to the class (historical, sociological, and literary texts in a single themed \"module\") did not fit my tastes. The texts were very well chosen, but I personally found many of them not too interesting. Additionally, his lecture style was a bit all over the place, which I feel works in an introductory course, but just confused me here. He usually would supplement a text by going through a \"Sparknotes\" version of more classical accounts of that phenomenon. Oftentimes, I found he would try to tackle too much in a lecture, which made the overall experience unsatisfying. Professor Khan is clearly well-read and does knows what he's talking about. He also explains these authors fairly well, and always checks himself to stay away from academic jargon. Still, this does not mean that to bring in all these ideas is appropriate for an undergraduate class. He throws a ton of ideas at us and gives us no opportunity to practice or digest them, nor does he even suggest that we do this. I felt as though we were being trained in \"who to source\" without being give the opportunity to practice these ideas.\nIt is possible that Professor Khan works better with broad material; by the end, I felt most fulfilled by the lectures as \"a place to go to hear some cool ideas,\" and would treat it that way when I wasn't too tired in the morning. I have faith that he will revise his curriculum, since this was the first time for him teaching this class.\nWorkload:\nLong readings across different disciplines (approximately 150 pages per week). Four 3-page assignments, and a longer final paper (12-15 pages). No midterm or final.\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 15, 2011",
            "review_content": "\nThe earlier reviews have covered a lot of what I think about Shamus Khan, but the most recent bashing of him is really unwarranted.  I personally loved Social World, even if I didn't end up getting the best grade, and I really DID feel like we learned a lot. This review exists basically to counter everything in the most recent negative review.\nThe earlier review contains two huge misunderstandings: misunderstanding the approach to the class and misunderstanding what sociology is all about.  First, yes, the workload is a lot and the grading is tough, but never did I feel like the texts were useless, and the grades were curved a lot at the end.  Khan explains early on in the course what we're getting into, and clearly the earlier reviewer didn't pay attention to that enough to know it wasn't for him or her.  And as for a lack of a uniting theme or clear answer to \"What are we learning here?\" that uncertainty has a lot to do with the nature of sociology.  Sociology is in essence the intersection of all the social sciences (and Khan breaks up the course to reflect that, with sections on social psychology, stratification, political science, social anthropology, and social economics), meaning there is no pure answer to \"What is race?\" or \"What is gender?\" or \"What is class?\" etc.  The message of the course from the very beginning is that these things are all linked, that you can't approach sociology in the same way that you can approach other disciplines, and that in order to get an introduction to the discipline you need to be introduced to other disciplines through its social lens.\nOn a more technical level, this course is also very much about fixing the way we go about doing work for our other classes.  We learn best from doing our work regularly and writing about it just as regularly, not when we cram for giant exams at arbitrary points of time.  We also tend to attend lectures and write down word for word what the professor says instead of the larger points that bind the information together, which often clouds the overall message.  So to learn how to distill the main points of what we hear, Khan implements the weekly quizzes that require that we recall main ideas of the week to ensure that we're \"getting it.\"\nOverall, yes.  This course is not for everyone, there is a lot of work, and it is difficult at that.  But leaving it, I was armed with the knowledge that I was actually SMARTER.  I didn't just gain knowledge about a lot of different relevant topics in the social world, I learned how to absorb them and relay them to others. As you choose which classes you should take at an institution that charges us upwards of $50,000 for a supposed world class education, ask yourself if you want to be challenged, if you want to learn, or if you just want an easy A to take you somewhere else.  If it's the latter, this class probably can't save you.  If it's the former, you will learn a ton and be a better student in so many ways.\nWorkload:\nWeekly quizzes and papers, several articles (which unlike most I found to be easier and more interesting than the books) and five books\n"
        },
        {
            "course_name": "The Social World",
            "review_date": "May 11, 2011",
            "review_content": "\nOverrated, plain and simple. Khan's class is structured so that there is no final, midterm, or paper, and instead you have to turn in a 750-word response to the week's readings (for a total of 12 papers) and take a short quiz at the beginning of each week on lecture content (for a total of 13 quizzes). Well, this actually sucks. First of all, it is nearly impossible to get a full score on the papers, since you have to cite lots of textual evidence, provide a 'broad analysis' of everything, yet focus on an 'argument you found interesting', and 'summarize the readings', but also 'make your own argument', while keeping the word count down (if it's too long, they dock you). Might sound simple, but trust me, it's a bitch and each TA uses different grading standards and gives poor feedback, leaving you generally clueless as to how to succeed. The quizzes are straightforward, but can I say, they offer little motivation to come to class as you can usually get a good score by skipping lecture and just getting notes off of a friend and skimming them 5 minutes before class. \nFinally, the readings. ugh. They're all over the place, which at first sounds cool because of the diversity, but what ends up happening is a sort of lack of cohesiveness about what the class is actually about. The lack of a final paper or exam is actually a weakness, in my opinion, because you get no chance to synthesize everything you learn and come up with a bigger picture. Instead, the feeling is a cross between \"well, all that stuff was kinda interesting\" and \"what the fuck did I just learn, anyway?\" You don't really get a solid foundation for sociological inquiry that you can put into your social science toolbox as much as you just get unsatisfyingly brief exposure to a bunch of random different things. Le sigh.\nHowever, the man himself is funny and lectures are definitely lively and entertaining. This in itself is almost enough to make up for all of the above.. but in my opinion, not quite. My advice is, just know what you're getting into before you sign up; it's not for everybody.\nWorkload:\nno final, midterm, or paper. one weekly 750-word response to readings and a weekly quiz on lecture materials.\n"
        },
        {
            "course_name": "Elites In Democratic America",
            "review_date": "April 27, 2011",
            "review_content": "\nFairly straightforward course, a novel, empirical text and a theoretical text due every three weeks or so although you can easily skate by only doing one of the three readings every three weeks as the four paper assignments due periodically during the course of the semester are only on one of the three texts. Important to note that Khan informs his TA's to grade the papers poorly although he enforces a curve at the end to bring up the class average on these papers. One longer assignment due at the end of the semester. \nWorkload:\n4 short papers due every 3 or so weeks. Moderate level of reading, most of which is necessary. One longer paper, roughly 12-15 pages due at the end of the semester. No midterm, No final. \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "April 11, 2011",
            "review_content": "\nThis is definitely a class that gets better as it goes along. The first month or so seemed somewhat chaotic; it was very hard to tell what made a good or bad paper, what bit of trivia would be on the quiz, and how the grading system worked. By the end of the course, at least the first two of those seemed to fall into place.\nHe really cares about teaching and about sociology, and his book Privilege is a great example of the field. He can easily get sidetracked on lectures but will not hold what he doesn't cover against you as something you should magically have known. He also has a great sense of humor so that helps too.\nThe readings are easier by the end of the course (except the Ottoman empire book by the brilliant Karen Barkey, also here at CU) and the papers get better when you take the 'less is more' approach to heart. He also ended up dropping an addition low grade from both the quizzes and the papers.\nThe room is always hot though.\nWorkload:\n2-3 page paper due Mondays, quiz on lecture on Wednesdays. Attendance and punctuality are very important for these reasons!\nNo midterm or final.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "January 12, 2011",
            "review_content": "\nI took this course, which is no longer offered, a couple of semesters ago, but since I'm graduating soon I think it'd be nice to acknowledges the classes and profs who were truly outstanding. This is the class that made me want to become a Sociology major, which in the end I didn't, but the class was certainly interesting enough that it enticed me to go down the Sociology path. \nKhan is really intelligent and he sounded really passionate about what he was  talking about. Some of the material was a little dry -- as an overview course, there is some material you're bound to disagree with or dislike. I really appreciated, though, that Khan took the time to explain the readings; but most importantly, he also outlined some of the scholars' faulty thinkings or problems with the readings. Too often profs don't go out of the way to problematize the readings and this can lead to an incomplete education. \nSo the class isn't offered anymore, but I would definitely take another class with Khan if I could. This means you should take a class with Khan, if he offers one you can take. \nWorkload:\nDoesn't matter. \n"
        },
        {
            "course_name": "The Social World",
            "review_date": "November 06, 2010",
            "review_content": "\nIn a word, amazing. Phenomenal lecturer, good guy, unbelievably smart. I've taken three classes with him (Imagination -- which is renamed the Social World, CC, and a grad class). He also guest lectures in several sociology classes. Not sure why. He doesn't teach a lot, for some reason. So take what you can when you can. His research is really interesting. He writes on rich people. He lets undergrads into his grad classes, which are a little intense. Make sure you have some background. But for undergrad classes everything has been really accessible. And he's one of the smartest, clearest, coolest guys around. \nHe's also young but pretty famous. Google him. The New York Times has written about him, so has Forbes and all kinds of other places. If it sounds like I kinda have a man-crush, I do. But don't go into his class think he's hot. He's not. A little quirky, but totally personable. You don't have to believe CUPLA. Go to his website. He posts all his reviews online. You can see what every student he's taught says about him. Very few people didn't like him. But that was when he first started teaching. As you might guess, his reviews are off the charts (who would put their reviews online if they weren't?!?). Other have called him arrogant, and I guess if you put all your glowing reviews online, you have to be a little arrogant. But I'm not so sure. I actually found him down to earth. He knows everything. So that might come off as arrogant. But really, he just knows a lot of stuff. \nAs for classes, it doesn't matter what you take, it will be great. One warning, though: he's not easy. This isn't typical sociology where you can BS your way through and not do the reading. He requires a lot. You read a lot. You write a lot. But his grading is fair. I think he's the best professor at Columbia. \nWorkload:\nLots of reading, lots of writing, but totally worth it. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 01, 2009",
            "review_content": "\nShamus is a great lecturer, it's a pleasure just to listen to him. He doesn't require participation in class, which is a relief from the usual forced (and dumb) comments that people make in other classes. He is also a well-known sociologist, and brings in fascinating references to sociology and other disciplines to enliven the (sometimes dry) readings. He also took us on two field trips, one to St. John the Divine and one to Riverside, Morningside, and Central Parks. One of the best professors I've had at Columbia. \nWorkload:\nPretty heavy. Take-home midterm and final, 6 3-pg. papers a semester (drop 1)\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "December 27, 2008",
            "review_content": "\nProfessor Khan is great. His Stats course is challenging, and he assigned some dreadfully boring reading, but all he asked was for basic comprehension and many students complained about the difficulty of his tests even after he gave very clear, repeated explanations of the concepts. Khan does tons of preparation, and he lectures with a great deal of enthusiasm and energy.  His lectures are very clear, and he is able to understand and respond to students questions very effectively in class.  For required sociology courses, including Stats and Methods but also Soc Imagination and Evaluation of Evidence, Khan would be a great professor to take. More exciting and accessible than Ferguson, more organized and clear than Whitford.  For courses in the Sociology department, Khan may not be the easiest prof but certainly the most rewarding. \nWorkload:\nModerate; thankfully, he has higher expectations than some professors in the sociology department. \n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "August 22, 2008",
            "review_content": "\nIf you are a sociology major in need of a class that fulfills the statistics requirement, take this class!! The class is based mostly on methods, only one assignment called for statistics beyond simple percentages. The bottom line is this...take Khan's advice on everything he says...EVERYTHING!! HE IS NOT OUT TO TRICK YOU!! He tells you from day one what he expects and clarifies his expectations for each and every assignment and quiz. Take advantage of that fact that he uses the class to spend time answer each individual's and/or group's questions for the projects. Also, take advantage of his office hours and his TA's office hours (since she grades, and he gives the final say). They truly want to prepare you for the assignments. If you ask questions, understand guidelines, and do the work, you will reap the benefits of the class. \nWorkload:\n2 in class quizzes on readings, 3 one page article summaries, 5 page book review for final, and 2 or 3 projects that require observation and data collection. Nice load for sociology majors, maybe slightly more challenging for non-majors. However, the class is definately worth your time. Also, grades are curved so do not get overwhelmed by percentages and scores. \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "June 20, 2008",
            "review_content": "\nI took this class randomly last year, and I have to disagree with what the other people have said about Khan.  I think that he made a really good survey out of sociology and chose some of the most mainstream and vital texts.  I am a sociology major now, and trust me, you NEED to know those texts.  If fact, he chose them so well that I've had about 40% of those papers again on the syllabi for my required classes.  If you're really interested in a major that is applicable to any grad school later on, you wouldn't mind doing the work.  Besides, the papers are all critical summaries of the readings, NOT critiques.  It also gets you into the rhythm of what to expect in other sociology classes...more writing.  He might act like a jerk, but he presents almost everything at face value, and when he doesn't, he warns you that he's biased.  And he doesn't treat students like a jerk.\nWorkload:\n14 papers (summaries), 12 quizzes (really short and direct from notes), drops lowest 3 of each.\nYou only fall to the average of B's if you slack off in the middle of class.  My advice,  if you work hard for the first three months, your last 3 weeks will be optional.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "April 13, 2008",
            "review_content": "\nFirst off, Shamus made a 9AM class worth it.  That cannot be said of too many classes at 9AM.    I am majoring in Biochemistry, and taking a class in Sociology was a huge relief from all the science classes.  Intro courses are usually boring, and from what I know, Intro Sociology classes are usually cut and dry from a textbook focusing on your typical race, gender and equality topics.  Shamus was a new teacher, but he was absolutely brilliant.  The man is a genius.  He knew what he was talking about, and while his method of teaching the course departed from the traditional, I believe it made the course that much more engaging.  While his opinions on particular topics were very strong, this made for engaging class discussions, even though the class was your typical Intro class size.  The discussion was optional; whether you chose to ask/answer questions was entirely up to you.  If you're the quiet type, listening to the discussion in itself was a reward.  He is a bit arrogant, but you must admit, he is pretty damn smart.  I think he is entitled to it.  It did not make him any less of a teacher. \nWhile the workload was pretty intense since you had to read a great deal (several papers weekly in the first half of the term and then several chapters of books weekly in the latter half) and there were weekly papers, the material was interesting.  You can drop a few papers and a couple of quizzes.  The quizzes are on material from the previous week, and they are completely based on class notes.  Studying for them was simple; a brief glance for 5-10 minutes the night before (or prior to class) sufficed.  The best part of the course is having no midterm or final.  It made learning the material much more engaging because I definitely believe that learning knowledge for the sake of an exam is a waste of time because the knowledge disappears immediately after the exam ends.  \nI wish he were teaching classes this coming year.  I would definitely take a class with him again.  \nI can say this about Sudhir Venkatesh (who is teaching the course this coming fall 08).  He is an amazing writer, and his research about the underground economy in Chicago is very eye-opening.  Shamus assigned a book of his (Off the Books: The Underground Economy of the Urban Poor) for our class to read, and I must say I enjoyed that book the most.  \nWorkload:\nWeekly papers and a large amount of reading.  Weekly quizzes.  NO MIDTERM AND NO FINAL.  4 extra credit assignments that add 0.5 points to your FINAL grade.  Not an easy A since it requires a great deal of work, but if you do your work, you're guaranteed an A.   It is not difficult.  \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "March 28, 2008",
            "review_content": "\nI honestly don't know what class the first reviewer was in, or what he was on when taking it. Everyone I talked to seemed to think what I think. Shamus is unbelievably smart. It's kinda astonishing when I think back to everything he covered in class. I don't know how anyone could know that much. He's also probably the best lecturer at Columbia. So not only does he know a lot. He's able to get it across to students, which is super-rare here at CU. The course was really interesting. The major problem wasn't him, it was his TAs (who were terrible). \nAbout the class: the course was an incredibly broad introduction to sociology and the social sciences more generally. I didn't realize how much I learned in the class until the next semester. In my sociology and political science classes I find that I have heard about just about all of the ideas we're covering. This is because Shamus introduced them to me. I marvel at how much was covered. The structure of the class was to introduce us to five major areas of sociology, which all corresponded to other social science disciplines. So you learn a lot about not just sociology, but also anthropology, political science, psychology, economics, and demography. For the first few weeks we read articles and for the rest of the class we read five books. The course was a lot of work, but Shamus tried to make sure that if you did the work you did well (the TAs tried to screw you. But in the end Shamus curved to make sure it was fair). Almost everything we read was really interesting. \nAbout lectures: the lectures are unbelievable. It's just the man and a piece of chalk. He makes ridiculous drawings on the board; he can't draw. He wanders back and forth, pacing like a caged animal. He talks quickly. And he kinda dresses more like a maintanence man than a professor. But oh my God can this man teach. At 9AM I found myself totally amazed. We learned about how race developed as a concept, world demographic trends, the formation of european states, how and why revolutions happen, how to think about culture, what nationalism looks like, the implications of colonialism, the development of genocide, the positive and negative affects of modernity, how to think about inequality, social movements, Marx, Foucault, Mill, gender, class, our emotional lives, etc., etc., etc. I can't even list it all or remember it all right now. It was totally crazy. I'm a junior and each class it was light a lightbulb went off. I suddenly realized what lots of professors in my other classes were trying to get at. As a freshman it might be overwhelming. But if you plan on majoring in the social sciences, it is probably the best class you can take. You'll get a very good introduction to most of what you'll be taught the rest of your time at CU. And not only does Shamus cover a lot, he covers it well. Like I said, it was 9AM and I was kept totally entertained by the man. Some of this is because he's quirky and weird. He's funny. He makes fun of himself and of the people in the class - particularly that the Ivys are places to educate rich people. This pissed some people off. But his humor wasn't mean. It was meant to highlight stuff we were talking about. And more often than not he was the butt of his own jokes. \nAbout the grading: There was a lot of work in the class. But Shamus warned us about this. He basically said that if you do the work and show up to class you'd get an A. Half way through the semester this seemed like a total lie, since the average grade in the class was a 70% or something. But he curved this to be a B+. About half the class gets an A or A-. The problem was totally the TAs. They didn't get the grading done on time. It actually took them up to a month and a half to get stuff back. They were terrible. And they were nasty about it. They almost ruined the class. Hopefully they won't be allowed to TA again. The grading is: no tests, no midterm, no final. Each week you have to hand in a two-page paper on the reading and take a quiz on the lecture. That's all. Shamus said we'd learn the material better this way. I totally didn't believe him, but it turned out to be true. It was a lot of work, and sometimes it felt like busy-work. You have to do all the reading and you have to go to class. If you're not willing to do that, the class will be tough. \nOverall, the class was amazing. I wish I'd taken it earlier in my career here at CU. But I'm pretty much telling everyone I know to take it. This year it was his first time teaching at CU. I'd guess it will only get better. And he's anything but an asshole. In fact, half way through the class he asked us what worked and what didn't work in the class. And he actually changed some stuff around based on our feedback. How many professors at Columbia do you know who would do that? He's really nice and funny, if it bit quirky and weird. Get in a class with him. It's totally worth the work. \nWorkload:\n14 papers, 12 quizzes. You can drop three papers and two quizzes, which means that you can skip two weeks of class without any punishment (midterms, anyone?). The grading was really hard, but he curved at the end. The workload is a lot. You have to do the reading. You have to go to class. But it's worth it. \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "February 26, 2008",
            "review_content": "\nI agree with the last reviewer. This class has potential to make many students interested in sociology, but Khan does the opposite and deters the majority of the students. The readings are not only overly time-consuming, but the topics were too advanced and specific for an intro class. The plus of no midterm or final is completely overshadowed by the workload that Khan assigns. If you are a student taking only three other classes and has a fairly good sociological background and want to take a class taught by a self-proclaimed (and all too accurate) asshole, by all means sign up for this course with Khan. If that description doesn't apply to you, just wait until another professor teaches this class.\nWorkload:\nA paper a week (grades fluctuate seemingly arbitrarily), quiz a week. Readings like you couldn't imagine.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "December 05, 2007",
            "review_content": "\nAlthough I am very tempted to write a long review ripping this class and the way Shamus teaches it, I have decided to keep it brief. Shamus cares a great deal for his student and is extremely accommodating. On the last day of class, Shamus referred to himself as an arrogant asshole- this is 100% true and pretty much sums up the class. Although at times he can be funny, for the most part he is not. Most people take this class for an easy A and to filter those kids out he makes the workload ridiculously time consuming. On the first day he said it would be a lot of reading and writing and this would ensure that everyone was doing the work and you think that it sounds fair and you're willing to do work for each class because the idea of not having a midterm or final is so enticing- the reality is that the readings are long and boring and the 14 papers and 12 quizzes are not worth caring about in an intro so sociology. Bottom line is that this class might be worth taking if it is with a different professor, but Shamus makes this class extremely time consuming.\nWorkload:\n14 Papers- you can drop 3 and 12 quizzes you can drop 2. \nNo midterm no final. But still not worth taking the class.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "November 07, 2007",
            "review_content": "\nThough he is a new teacher, Shamus is extremely intelligent and a phenomenal lecturer...he's also quite witty at times. The class is at 9, and I never want to wake up to go... but as soon as I get there, I am entranced. All in all, I found the readings interesting - we read from a bunch of different sources and books, and cover a wide variety of topics. You can tell that for the most part, Shamus tried to pick engaging papers. Some of the books are a bit dry, but its all bearable and some of it is really intriguing. \nThe nice thing about this class is that there are no tests, not even a midterm or a final, and you can drop a few papers and quizes (see below for more info). So although there's a lot of work and it's a big time commitment, at least at first , theres very little pressure... and its set up so you can just skip and not do the reading an entire week , since you can drop grades - nice during midterms! \nOverall, it's a big time commitment - but if you have the time, its really rewarding and interesting, and not terribly difficult. \nWorkload:\nA lot of reading the first half of the course that you MUST do bc there are weekly papers - but if you do the reading, you will do well on the weekly papers. weekly Quizes are half of your grade and they are very straightforward questions on the lectures from the previous week. Extra credit movie nights can add up to 2 percentage points to your grade. Average in my class was low, but he curves it so that the overall average is a B+\n"
        }
    ]
}