{
    "prof_info": [
        {
            "prof_name": "Azzedine Layachi",
            "prof_id": 3439,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Comparative Politics of the Middle East and North Africa",
            "review_date": "April 28, 2008",
            "review_content": "\nHe normally teaches at St. John's, and he should stay there.\nThis was the worst course I've taken at Columbia - not just the worst Political Science course, and that's saying something.\nThis man is a terrible professor - if the person responsible for hiring him had spent five minutes listening to one of his lectures, Layachi would never have gotten hired to teach this course. The man knows less about the given topic than most of the class, and the readings did not really contribute to understanding of the topic - most of the assigned textbooks and articles were superficial - he made us buy 3 different (and expensive) textbooks, most of which were not helpful. He also did not post the article PDFs online until a few days before we were supposed to have read them.\nAssignments appeared to be created with almost no thought. The topic of Weber and political legitimacy was not relevant to class/section discussions. The country case paper basically required class members to reinvent the wheel - we were basically writing encyclopedia articles on given countries - an assignment more appropriate for middle school than an Ivy League university.\nAssignments were often full of typos and misspellings - not what one would expect from a 4000-level class.\nMy recommendation: Never let Layachi teach a course at Columbia again. The PolSci department should have spent a little time anonymously observing Layachi (and other prospective adjuncts) teach elsewhere before allowing him to teach a course at Columbia.\nLayachi should be avoided at all costs. if you see Mona El-Ghobashy teaching this class in the future, definitely take it. I had her for Intro to Comparative Politics, and she was incredible.\nWorkload:\ntwo approximately 10-page papers on irrelevant but easy topics. If you know anything, the papers are a breeze. The midterm drew on random facts from all over the Middle East and North Africa - easy enough if you have a background in this, but for the non-PoliSci majors, it was extremely difficult.\n"
        }
    ]
}