{
    "prof_info": [
        {
            "prof_name": "Adam Sobel",
            "prof_id": 2814,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "V2100 The Climate System",
            "review_date": "October 27, 2016",
            "review_content": "\nThis class was a lot different than I expected going in. While I was excited for the class, about 3 weeks in I realized it wasn't what I wanted. The labs are very computer based and the hands on part are remedial at best. I felt the entire lab section of this class was not very interesting and was heavily math-based. The class felt like I was taking another math class, but gave entirely new formulas that were given very little context on how to use. If you are a sus dev major and not a math person, I would not recommend taking this class. Sobel's lectures were interesting but packed in so much it's very difficult to retain anything specific.\nWorkload:\nhigh, a math-related questions due Tuesday and lab reports due Wednesday. \n"
        },
        {
            "course_name": "applied mathematics II (PDE)",
            "review_date": "May 03, 2013",
            "review_content": "\nWow this class is such a blast. I have some exposure to partial differential equations through my research in computer science but this class clears up a lot of topics I haven't been able to understand previously. The materials covered in the class provide just enough motivation for me to go on and explore more aspects of PDE that I will encounter in my career. This class is an example of how an engineering class at Columbia should be -- perfect topics, perfect professor, the right combination of intuition, theory, and practical problem solving.\nAdam Sobel is one of the best math teacher I have ever had at Columbia. He is clear, concise, and considerate. Every time we start a new topic he always states the motivation of the topic so we get the idea of why things are derived the way they are. Every time we hit some giant and unthinkable formulae (which arise from Fourier Series, Rayleigh Quotient, or Green's function), he would pause and make sure that we don't just see a bunch of garbage on the board but some profound and meaningful formulae that can be explained with intuition. At the end of the day I always walk out of the class having understood something interesting, but that only makes me craving for more. Man, I have always wondered, why this guy is so good at making me understanding things, I mean complicated things like Green's function, so easily? No doubt, he has been working with these equations for decades, and he has seen real-world problems that PDE models can be applied, in atmospheric science. Who else would be more perfect to teach a class like this, besides a professor who knows the topic so well and balanced, theoretically and practically, and is capable of explaining things so clear like a mirror?\nThe textbook we used is 4th / 5th edition Haberman. Really really good book. The book alone already provides great examples and great insights about several problems in PDE. Very recommended.\nThe class does come with a price (besides your tuition). The exam will be hard, and I mean it can be really hard. You will wonder why that one question is even asked, and how you could even start answering it. This is because Sobel wants you to understand things not only practically but also intuitively. Therefore, some questions in the exam will only be solved if you have solid qualitative understanding of the material. I personally think that the quality of the class as a whole far outweighs the fact that the exam can be very challenging though.\nNo matter where you come from, if you are interested in PDE, don't miss your chance to take the class with him. It will be totally worth of your time and effort.\nWorkload:\n9 problem sets. Somewhere between 1 - 2 weeks each.\n1 midterm\n1 final\n"
        },
        {
            "course_name": "Partial Differential Equations I",
            "review_date": "January 05, 2011",
            "review_content": "\nThis class basically exposes you to a few PDE's and a handful of methods for solving them. Sobel is a much, much better teacher than most higher math professors. However, that places him slightly below the average in clarity and teaching ability. You will not learn everything you need to know in lecture. To do well, you need to be able to interpret the (laughably unfriendly) textbook's explanations and cryptic homework questions. His office hours are lightly attended, though sometimes a few very lost souls monopolize his time with silly questions. Solutions to the homeworks and previous tests are on courseworks which is quite helpful for exam prep. \n\nWorkload:\nWeekly problem sets, of widely varying difficulty. Some are only a few short problems, others take hours and hours of struggle.\n1 Midterm: In my opinion quite difficult because you haven't yet had time to figure out a way to learn from the book. Grades were bimodally distributed; most people got either around 65 or a 100. \n1 Final: A bit easier than the midterm because by the end of the class, you've learned to extract useful facts from the textbook. Very similar to the previous years' tests that you are given on courseworks.\n"
        },
        {
            "course_name": "Partial Differential Equations I",
            "review_date": "March 27, 2010",
            "review_content": "\nGood prof. The material in this class starts easy, but gets pretty difficult by the end (There's a big learning curve if this is your first introduction to Fourier Series / Transforms). Sobel does a good job conveying intuition and providing useful analogies to get a feel for what's going on. The physical motivations are sometimes overly lengthy (especially for someone with no interest in physics), but can be helpful in certain cases. I took and dropped other profs for this course (looking at you, Courdourier) before Sobel; the difference is huge. As a math major in the college, this is the first app math course I took, and I think I walked away with a very good understanding of the material. Recommended.\nWorkload:\nWeekly problem sets which can sometimes be very tough and will probably require trips to the help room. Get a group together asap. Mathematica is useful for some really ugly symbolic matrices later in the class.\nMidterm is fair. Final was doable with a little bit of inspiration. \n"
        },
        {
            "course_name": "Physics of Fluids",
            "review_date": "January 15, 2006",
            "review_content": "\nAh, Professor Sobel. He means SO well. Alas, he still stands in front of the equations that he is trying to explain. He doesn't seem to grasp that you need to write a little bigger on the board than you would in a notebook, particularly if you're dealing with subscripts. \nIf you can look past that, however, Prof Sobel is a great teacher. He a) understands REALLY difficult material, b) understands that the material is REALLY difficult, and c) is nice. That last one matters a lot when you're banging your head against the wall. He wants his students to do well, and is willing to help.\nThe class is hard. This should not come as a suprise to anyone considering a 4000 level physics class. If you don't have a strong math background, it will be harder. This, too, should not suprise you.\nWorkload:\nReasonable. A problem set every week and a half or so. The final was unbelievably difficult, but he curved it. Had he not, I think that the entire class would have failed.\n"
        }
    ]
}