{
    "prof_info": [
        {
            "prof_name": "Pablo Piccato",
            "prof_id": 264,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Mexico from Revolution to Democracy",
            "review_date": "September 12, 2013",
            "review_content": "\nI loved this class. Professor Piccato is smart, humble, insightful, and engaging. His accent is not a big deal at all and he is incredibly knowledgable. He's an expert on crime. And he is super adorable. \nYou get out what you put in to the program--Piccato gives you the hilarious minutia that is 20th century Mexican history, and you string together the tragic themes.It was a great class. Chock full of information, but never trying. Highly recommend. \nWorkload:\n The readings are helpful but not terribly vital to your performance. Outside assignments give you the opportunity to engage with film and literature. They're light and designed to be flexible. We also went on an optional (and well worth-it) field trip to an exhibit on crime journalism. \n"
        },
        {
            "course_name": "mexico revolution through democracy",
            "review_date": "December 18, 2006",
            "review_content": "\ndissapointed with this class. Pablo has a lot of depth and is extremely intelligent, but the class is not structured well! In fact, there is almost no structure...Mexico history is fascinating, but the assigned readings were irrelevant (the only helpful reading was the supplementary bethell book which you should buy even though its no required if you want to pass the class), section was annoying and did not spark interesting discussion. every now and then, pablo will have very interesting lectures, but the power points were totally unorganized. how can you teach history esp mexican history through powerpoint and graphs that are too small to comprehend! \nstill, pablo is a nice man and is very helpful outside of class if you need a scholar on mexican history-he is definitely approachable, its just too bad his class isn't more engaging. if you want a dry history lecture, go for this class, just be ready to bring your lap top and play solitare. \n\nWorkload:\nnot connected to the class so you do it all on your own and without any guidance. included two papers, midterm, final, and weekly reports on irrelevant readings. oh yes, and section where participation counts for 20% of your grade. hah. \n"
        },
        {
            "course_name": "Mexico from Revolution to Democracy",
            "review_date": "December 29, 2005",
            "review_content": "\nThis was a fantastic class that traced Mexican history, politics, and economics from Independence in 1810 to the present.  Prof. PiccatoÂ’s lectures were both engaging and amusing. The TAÂ’s were also helpful and available when needed.  Ignore the previous complaints regarding PiccatoÂ’s accentÂ—I had no trouble with it at all.  My only advice would be to attend every lecture and do all the required readings.  I also recommend that you read the Bethell book.  While not comprehensive, it did an excellent job at complementing the class lectures and provided an overview of Mexican historical concepts.\nWorkload:\nNot too bad...Two papers, midterm, and final. Discussion sections are also required.\n"
        },
        {
            "course_name": "Mexico from revol to democracy",
            "review_date": "January 20, 2005",
            "review_content": "\nOne of the best classes I've taken at Columbia.  What is this about not understanding him????  He barely has ANY accent.  What's wrong with you? This is an amazing, funny, interesting, engaging class that takes some pretty boring history and makes it come alive.  Take any class you can with this professor.\n"
        },
        {
            "course_name": "Latin American Civilization: 1810 to Present",
            "review_date": "August 10, 2004",
            "review_content": "\nLook, there's only one thing you need to know about this course before opting to take something else. It is irrelevant whether or not you hope to find the material interesting, whether you think (and I can't imagine why anyone would, but judging from previous reviewers....) that Pablo is hopelessly adorable, or whether you are just shopping for a Major Cultures req that fits your schedule (big mistake....BIG mistake). \nThe fact is - THERE IS NO WAY TO ACCESS THE COURSE MATERIAL aside from going to class. I'll just let that sit with you for a moment.\nOkay, so the solution to the problem isn't as easy as it seems. You're probably thinking - \"That's not such a big deal. I'll just go to class, no problem.\" No. You can go to class all you like, the likelihood that you will not understand a WORD Piccato says is far greater than the likelihood that you will make it to every lecture. I attended every class and I can't even recall for you a single thing we discussed. I'm not sure if things have changed since I took this course in Spring 2002, but as far as I'm aware, Piccato doesn't even go as far as to make availabe to students an outline or anything resembling an outline. Nothing with names or spellings of Spanish or Portuguese words. You can amuse yourself by guessing as to what these may be, as you will surely need to find things to do to amuse yourself to keep from passing out from utter boredom. I chose to focus in great detail on my penmanship, as Piccato will zip so quickly through facts that, were I to understand him, or have a clue what he was talking about, I could never keep up with him for the purposes of notetaking. \nThis is particularly difficult because, as I said - THERE IS NO OTHER WAY TO ACCESS THE COURSE MATERIAL - comprende? No text, no lecture notes, no outlines, no required reading that is even tangentially related to the course material. You are left without the option of referring back to notes for clarity, (because you will never succeed in taking notes), nor can you refer to any relevant text-like resource. (If you happen to have a keen enough ear to understand the words that come out of Piccato's mouth, I hope you also have a POWERFUL memory because the only way to review concepts or study for the exam is to sit for a few hours and see if you can't remember everything ever said in class. Another technique, which I implemented, was to write down random words and use those as a guideline for the exercise in memory, the sole study option.) There are suggested readings from something like 13 books which, if you are looking for a new and innovative way of buring several hundred dollars in less time than in would take to actually set fire to your credit card, you might consider doing. Or you have the option of being the only person at the Butler reserves, poring over absurd amounts of \"suggested\" reading that will never resurface in class, on papers, or in an exam. \nYou may sit through class wondering how you'll ever succeed in coming up with supporting information for your two papers, which are based on outside readings, if you have no idea what goes on in class. I am here to tell you not to worry. Not only are the readings irrelevant, they are downright strange. One of the books was about a slave revolution in Brazil, and that was alright, but the other was Kiss of the Spider Woman - which is heavy on the homoeroticism, but light on, uh, HISTORY. \n\n"
        },
        {
            "course_name": "Latin American Civilization: 1810 to Present",
            "review_date": "May 27, 2004",
            "review_content": "\nI love history, so overall I enjoyed this class.  BUT...and this is a biggie...Pablo is boring as all heck.  The material is interesting, although it often seems super general and super basic,  but Pablo is just not an interesting lecturer.  He is indeed adorable and very approachable, but not interesting.  I think that if I weren't interested in the subject in the first place, I'd find this class a nightmare.  Covering 200 years of history about a continent and a half is simply impossible, and it showed.  It seemed like the most important things I'd heard of before and hoped to actually learn in this class were left out.  I was shocked when Piccato never mentioned the names Salvador Allende (who magically appeared on the final exam for the first time!) or Augusto Pinochet.  He did go on at length about how sugar cane is processed into consumable sugar in Brazil, the significance of baseball in 1960s Cuba, and the extent of prostitution in Mexican cities.  These are admittedly important topics, but that doesn't mean he should have excluded other obviously important info to go on about that.  But I digress...Very important: make sure you go to lecture--there's no other way to pass this class, since the readings are basically supplementary.  His lectures did not come from anything we read for the response papers. \nWorkload:\nOverall, this is a good List A (although I've heard of better ones)...not too much reading, a few response papers (annoying but the TA basically admitted that as long as you write something and it meets the length requirement, its good enough), midterm and final--both easy as long as you study a bit and write down as much as you know, 2 papers that I must admit were graded arbitrarily.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 19, 2004",
            "review_content": "\nPiccato seemed to grow on the class as the semester went on. He wasn't a great teacher, but he is a nice guy and he generally has clear and interesting things to say about the material and occassionally he asks good questions. Conversation often lulls, though, and people often drone on and Piccato is rarely critical, but the atmosphere is at least always relaxed and open. Basically, Piccato seemed to put in as much work as the class did, which is to say, not much, but believe me you could do a lot worse for C.C.\nWorkload:\ngenerally fair; sometimes a little excessive on the reading, but it seemed except for with kant, you could get away with not doing all of it.\n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "May 07, 2004",
            "review_content": "\nIgnore the previous two reviews.  This class is unbelievably dry.  Piccato is a nice enough guy, and he has a decent sense of humor, but his lectures are hopelessly unorganized and students spend most of the class time just trying to copy down the powerpoint slides before he jumps to another unrelated subject.  The readings are manageable, if unnecessary.  TAs grade everything both strictly and arbitrarily.  Plus, pretty much any problem in Latin America over the last two centuries was blamed exclusively on America, with contrary opinions  being shot down in the discussion sections (both by the TA and by fellow students).  Take any other class instead, preferably something without such a ridiculously broad focus.\n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "May 05, 2004",
            "review_content": "\nThis was probably my favorite class this semester. Pablo is, admittedly, not the most engaging lecturer, but I think he got much better as the semester went on. He is incredibly approachable, charming and obviously very passionate about the subject. He's also adorable - in the way that a puppy is. He does a very good job of covering the material (I found his powerpoint slides to be pretty comprehensive, contrary to what other people here have said). Covering 200 years of history for one and a half continents is not a task necessarily easily done. \n     The TA's (mine anyway) expected a lot from you, but were incredibly approachable and understanding about late work, etc. The readings varied in quality from ENTHRALLING to dry and unbearable, but they were a minor part of the class for me. Overall, this was my favorite class this semester, and I always found it a pleasure to go to class. I highly recommend it.\nWorkload:\n10 2-page reports on the readings (the reading load started out light, but moved up to whole books by the end of the semester - didn't necessarily have to be done). Count for 20% of your grade. Midterm/Final (TA-graded, somewhat arbitrarily). Two 5-page papers on a variety of books around one subject (State Formation in Argentina and Violence in Colombia our semester). Fairly easy.\n"
        },
        {
            "course_name": "Latin American Civilization: 1810 to Present",
            "review_date": "April 20, 2004",
            "review_content": "\nThis class is not fun, but it is informative.  Piccato does an adequate job of presenting his PowerPoint outlines, but is not a particularly compelling lecturer.  He is not intimidating, however, and he responds to questions in the middle of lectures.  I would find another Major Cultures List A course.\nWorkload:\nDoable, but really try to pace yourself with the readings.\n"
        },
        {
            "course_name": "Latin American History: 1850 to Present",
            "review_date": "April 18, 2004",
            "review_content": "\nSome days this class equals death and other days it is extremely interesting but on the whole it is often confusing and overwhelming. It's way too much information for one class; I mean, come on, 200 years of history for over 20 countries in one semester? Whose idea was that? Professor Piccato actually does an impressive job of organizing the information and focusing on the most interesting things. At first he comes of as a little dull and pompous, but he is actually charming and has a great sense of humor. Tis true, the TAs do all the grading, including assigning the participation grade which is determined in the section meetings (hosted by the TAs). And sometimes the grading seems arbitrary but I came to realize that all they are interested in is accurate historical information, and if you don't have that then all the fancy rhetoric in the world won't save you. This class really gets better at the end of the semester so try and stay caught up and your rewards will be sweet...\nWorkload:\n2 long papers, 1 midterm, 1 final, about 10 reading reviews, about 7-10 discussion section meetings\n"
        },
        {
            "course_name": "Latin American History: 1850 to Present",
            "review_date": "April 18, 2004",
            "review_content": "\nSome days this class equals death and other days it is extremely interesting but on the whole it is often confusing and overwhelming. It's way too much information for one class; I mean, come on, 200 years of history for over 20 countries in one semester? Whose idea was that? Professor Piccato actually does an impressive job of organizing the information and focusing on the most interesting things. At first he comes of as a little dull and pompous, but he is actually charming and has a great sense of humor. Tis true, the TAs do all the grading, including assigning the participation grade which is determined in the section meetings (hosted by the TAs). And sometimes the grading seems arbitrary but I came to realize that all they are interested in is accurate historical information, and if you don't have that then all the fancy rhetoric in the world won't save you. This class really gets better at the end of the semester so try and stay caught up and your rewards will be sweet...\nWorkload:\n2 long papers, 1 midterm, 1 final, about 10 reading reviews, about 7-10 discussion section meetings\n"
        },
        {
            "course_name": "Latin American Civilization",
            "review_date": "September 01, 2003",
            "review_content": "\nPablo Piccato is a cute puppy, but this class is...not fun.  Lectures are comprehensive but disorganized and the weekly readings are dry to the point of being useless.  The TA's grade pretty tough, forcing you to devote a lot of time to the papers...which is hard to do, as the topics tend to be uninspiring, at best.  Getting an A in this class isn't impossible, but it definitely isn't easy...skipping classes is enticing, but not a good idea since there is no textbook.  But Pablo is a nice guy...I would just steer clear of this class.  \nWorkload:\n10 one page papers (one per each reading) that you can pretty much do in half an hour...provided you don't actually do the reading; it's not worth it anyway!  Two 5-ish page papers, a midterm (easy) and a final.\n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "May 19, 2003",
            "review_content": "\nDon't pay attention to the previous reviews--the department revamped the course and now it's completely different compared to what it was last year.  Piccato is a PAINFULLY boring lecturer, his powerpoint slides are bad enough to put even the most avid student to sleep.  His lectures are unorganized, uninteresting, and did I say boring?  The material is fairly interesting, but Piccato presents it in the MOST UNINTERESTING manner possible.  You discuss the same aspects for every country and you have trouble while studying trying to keep each country straight.  And unfortunately, there's no textbook, so if you skip class often (which you definitely should do, I regretted going to most of the classes in semester), you need to get notes from someone else.  The TAs are tough graders despite the fact that the assignments for the book reports aren't difficult--nearly all grades in this class are in the B/C range.  Pray that you get an easy TA.\nWorkload:\nFairly light, but the grading is rough.  Light reading every two weeks, around 50 pages with one-page (non-graded) reports on each reading (only counts for 5% of the grade), you can choose to do them or not.  Two 6 pg essays on books of under 200 pages.  Midterm and final, not difficult, based on lectures and readings.\n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "May 11, 2003",
            "review_content": "\nProf. Piccato prepared interesting, organized lectures that grew better as we delved father and farther into the 20th century (apezed around the Cuban Revolution, which is saying SOMETHING). However, the terribly chosen class time, the ugly, sterile room, and the rude students at the back of the classroom  made the okay experience of being in this course much more unpleasant. He is a good lecturer who is able to present the overall historical picture. However, the TA's are terrible (this broad class should definetely have a weekly recitation) and the readings (what few we had) are not enough to fill in the blanks that his survey course lectures leave gapping. Should you take the course? Yes--if you are interested in the subject.... Piccato's class could be super if he had more readings, particularly a course text book or general history, weekly discussion sections, and if he used more cool lecture add-ons like music and pictures. On second thougt, skip this course, quickly brief yourself in modern latin America through Skidmore's classic survey, and take a Piccato seminar!\nWorkload:\nSuper light, not so fluffy. Two strange papers (the topics were totally inappropriate for the history we were learning).  Easy tests, not so easy papers, and esay readings. This courses light, light homework load makes it a great academic, 4th class schedule. \n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "May 01, 2003",
            "review_content": "\nLots of bitching in these reviews, but most of it is unfounded. Pablo does indeed attempt to cram a HUGE amount of information into his lectures, but there is a tradeoff because he doesn't require you to do a lot of outside readings or go to sections like almost all major cultures classes. I'll conceed that he is not the most animated lecturer, but he got better as the semester went along (even cracked a few jokes). He is extremely thematic in his lectures, which helps because you can ignore dates and picky details (they won't be on the tests) and focus on the big picture. I'll be honest and say that this is a pretty outstanding way to get through the major cultures requirement, consisting of both low work and low expectations (I could tell on the first day of class that it had a good reputation based on the number of overgrown jocks that had decided to take the class together). All and all go for it. If you can string together a decent CC paper you will get both an A in this class, as well as a general understanding of Latin American Civilization. Cheers Pablo!\nWorkload:\nLight for an A list course: One page article summary about every other week (ungraded), Two papers on assigned books (6 pages, CC stylee), Easy Midterm (a few id's and an essay, fair grading), same for the final. GO TO CLASS! All test material comes from lectures.\n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "April 24, 2003",
            "review_content": "\nThis may possibly be the most boring class I have taken at Columbia. Professor Piccato definately knows his stuff but its hard to concentrate on his lectures because they tend to be unorganized. The only saving grace is the power point slides he puts up that give you an idea of what he is talking about. Still its hard to follow along because he tends to jump around a little bit and you soon get tired of trying to write down every little thing he says.  The TA's aren't much better either. They want a critical interpretation of the books you have to read but its hard to do because they really don't make it quite clear on what exactly what they want. All in all, I suggest taking a different class if you are trying to finish off the major cultures requirement. However, Professor Piccato is a very nice person and very responsive to students questions.\nWorkload:\nOne page responses on every article you read due approximately every two weeks, 2 6 page papers on two books you read, midterm, final\n"
        },
        {
            "course_name": "Latin American History: 1850 to Present",
            "review_date": "April 23, 2003",
            "review_content": "\nPiccato definitely knows his shit. However, he tries to do WAY to much in this class. I feel like you walk away not knowing very much about anything because it's IMPOSSIBLE to talk about Latin American since 1850 in one semester. His lectures are relatively organized and you'll never take a history class with less reading, but it's easy to feel like you don't know what's going on. The papers are weird- they're based on one book and they discourage you from doing any outside reading, even though you don't know much about the subject. It has it's pluses, but I wouldn't take this class again.\nWorkload:\nVERY little reading- maybe an hour/month. Response papers that are BS. Papers are weird, but easy. Exams are abstract and it's kinda hard to know exactly what they're looking for.\n"
        },
        {
            "course_name": "Latin American Studies",
            "review_date": "April 22, 2003",
            "review_content": "\nPablo's class is my first horrible columbia experience.  5:40-6:55 on THURSDAY night, it not only caused me to miss that really chill feeling on campus on Thur post 4 pm, but I was forced to listen to a heavily accented voice speak with a simultaneous power point display.  The power point BS is the only thing in the entire room that makes it somewhat easy to focus and take notes on what pablo is saying.  I'm done with the class now and I can honestly say I don't even know whether Latin Am Civ is interesting or not b/c I didn't learn a damn thing that I will remember past the final.\nWorkload:\nYou have to read about 10 articles and write a page summary on each-easy\nwrite two 6-8 pg papers on books you've read- easy cept the non-english speaking TA's want a CRITICAL PERSPECTIVE on the books, which is quite hard considering they want you to utilize the material ( what? material?) from class.\nmidterm, final\nmanageable but a little annoying to do the damn summaries\n"
        },
        {
            "course_name": "Latin American Civilization: 1810 to Present",
            "review_date": "March 30, 2002",
            "review_content": "\nJust saw Pablo in the list of the top 15 Major Cultures teachers and wanted to throw a caveat in there. This course is 4000-level, and he means it. You are expected to know a great deal about the history of Mexico, Peru, Argentina, etc. before even stepping into the class. Readings and lectures are extremely focused and worthwhile for the Latin American scholar but virtually impenetrable for the average Columbia undergrad who took Spanish in high school and wants to just get through with the Major Cultures requirement. I hated this class. Readings are dense and boring, and Prof. Piccato's lectures, while insightful if you know the history, are plain awful if you don't have the information in context. Very disorganized, monotone, and (given his accent) tough to understand lectures, throws out information haphazardly.. you're lucky TA's are grading exams and papers, because they have no clue what he's talking about either, half the time. Skip this class and take the 3000-level one instead unless you're a masochist or are really into the minutiae of Latin American social and class structure.\nWorkload:\nLight, surprisingly; 10 medium-length (though dense) readings, midterm, final, two 6-pg papers. Everything's graded by TA's, so not at hard as it could be.\n"
        },
        {
            "course_name": "Latin American Civilization, 1810 to present",
            "review_date": "December 31, 1999",
            "review_content": "\nThis course gave an overview of Latin American history from 1810 to the present, tied fairly well to global context. Professor Piccato is somewhat difficult to understand because of his accent, and he reads what he has prepared in a somewhat monotone manner... BUT his ideas are presented very cohesively (so stay awake! when you reread your notes at the end of class you'll be surprised) and he always has a very good analysis of deeper levels of history, such as class analysis. So many professors (I think it's a U.S.A. thing) are afraid to acknowledge class antagonisms; he's not. The class is stronger for it. The readings Piccato chooses are almost always great. No Mickey Mouse history here; rather, a lot of strong social analysis... a lot of the readings are labor-centric. Also, I should add that Picatto is a very approachable man. I would reccommend this course to anyone; It satisfies a Major Cultures credit if you want. You can take part one, which is Latin Am Civ up to 1810 as well -- I didn't, but it's also supposed to be a good class. There are people who hate the class because of Prof. Piccato's delivery style. Ignore them and tough it out; you'll be glad you did.\nWorkload:\nVery doable workload. As little as 2 hrs/week, less if you can B.S. your way through discussion sections. 3 two-page \"reports\" on articles which are easy as hell. One 7-page paper on an interesting novel which ties in themes of culture, class, etc.. No midterm, and the final exam is a take home. My TA graded all of my papers--but they were all graded extremely easily/fairly.\n"
        }
    ]
}