{
    "prof_info": [
        {
            "prof_name": "Doris Zahner",
            "prof_id": 2047,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Statistics",
            "review_date": "January 19, 2017",
            "review_content": "\nEasiest class I've ever taken. Easy A if you apply minimal effort- and I mean minimal. She's a great teacher, very straight forward, and kind of funny.. \nWorkload:\n1 OPEN BOOK MIDTERM (she gives you a review sheet you can take into the test)\nweekly homeworks based on SPSS (easy)\n1 final project (you can do it in a group)\n"
        },
        {
            "course_name": "BC 1001 Statistics",
            "review_date": "May 12, 2013",
            "review_content": "\nOne of the most straightforward classes I've ever taken.  She explains everything very clearly and often let us out of class early.  She's also really charming and tells wonderful stories every now and then.  You do not have to go to recitation most weeks and even if you do it is NEVER two hours long.  Don't bother buying the textbook, her notes are more than enough.  The TAs were also really helpful.  Exams are open note.  If you understand the problem sets, you'll get an A on the exams.  She never tries to trick you.\nWorkload:\n10 problem sets (25%)\n2 Open Note Exams (25% each)\nTake home final (25%)\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 02, 2013",
            "review_content": "\nThe class is not hard at all. 2 midterms which are open book and a take home final. Each are worth 25% of your grade. You will have 10 HW assignments that will also be worth 25% of your grade.\nThis is a hard class. I took AP Statistics in high school and it was harder than this class. It's not the easiest to get an A+ in because you have to do the tests her way (and write her way) in order to get full credit. I learned to do the tests a different way in high school (the better way in my opinion with a p-value and everything) and it took me a while to get used to her six step formula.\nBasically, as long as you adhere to rules, you should be able to do well. I wish I learned more for a 4 credit class, but I guess it'll pad my GPA. \nWorkload:\n2 midterms and a take home final (each 25%)\n10 HW (together 25%)\nPset every week. very manageable. \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "December 19, 2011",
            "review_content": "\nTake this class!  Professor Zahner is one of the most adorable professors I've had in college, and she genuinely wants students to do well in her class.  This is a side job for her (she also works full time), so she's only doing it because she loves teaching.\nShe posts the lectures on Courseworks, and you just print them out and then fill in the information that she purposely leaves out so you can learn it in class.  She gives examples and explains concepts that people don't understand.\nWe never took the whole lecture time for class - we usually ended about halfway through, and then we either left or reviewed the homework.\nThe recitation is blocked for 2 hours each week, but it rarely took more than a half hour and didn't actually happen each week (it's only when the homework assignment has an SPSS portion).\nWorkload:\n3 open-note/open-book exams (non-cumulative), 10 weekly homework assignments.\n"
        },
        {
            "course_name": "BC 1001 Statistics",
            "review_date": "May 08, 2011",
            "review_content": "\nThis is the class to take to get rid of the Quantitative Reasoning requirement of the 9 Ways if you freak out when faced with numbers. (That would be me.) (Seriously, I count following the model of \"one, two, many, lots.\")\nThe notes are comprehensible, Zahner will go over a concept as many times as you need to understand it, the tests come back fast and annotated, and basically if I had not taken this, I suspect I would've had to fall on my sword and die.\nWorkload:\nten homework assigments, three non-cumulative tests.\n"
        },
        {
            "course_name": "BC 1001 Statistics",
            "review_date": "January 18, 2010",
            "review_content": "\nShe's awesome- enough said. Professor Zahner is engaging and entertaining (often sharing personal experiences) while teaching what could be, given the subject, a very boring class. Slides are made available in advance, Professor Zahner types the notes into her projected slides as she lectures, textbook is NEVER used (didn't open mine), and tests are open notes- lectures/hws/etc.. Also, weekly \"lab\" is used to complete homeworks that require SPSS. Professor Zahner stays around during the weekly lab period to answer any questions about the homework or lectures, but is most easily reached by email for questions during the week (usually replies within a few hours, if not sooner). Zahner's class had a relaxed vibe which she echoed in her open note test policy, cancellation of afternoon Wednesday before Thanksgiving day class, and movement of third exam to the last day of class (instead of the second to last slot of finals week). \nWorkload:\nThree, equally weighted, non-accumulative tests (3rd is considered the final) which are easy if you have gone to class and done the homework.\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "December 16, 2009",
            "review_content": "\nProbably the easiest Stats class you will take in your life.  No, maybe even the easiest class you'll take in your life, ever.  I took another stats at Columbia (also an intro) and it was INFINITELY harder.   \nThe tests are open book, open notes, open everything.  And it's not like you even need all the notes you bring with you, because the questions she asks are sooo easy and simple.  Just make sure you write down everything she says in lecture, and there is no way that you could do anything other than ace the tests.\nTake this class with Zahner.  She is really nice and sweet and you don't need to do so much work!\nWorkload:\nHomework every week.  3 tests.\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 13, 2009",
            "review_content": "\nDoris Zahner is fantastic. She hands out outlines for every lecture that make note-taking easy, helps with homework during recitation/lab, and has remarkably elegant ways of explaining complex concepts.\nIf you fill in your outlines, go to lecture, do the homeworks, and do the study sheet problems, there is no reason why you will not get a very good grade in her class. \nWorkload:\nThree non-cumulative exams, problem sets (not every week and sometimes very short). All the exams are exactly like the study sheets with a few tricky multiple choice questions. This class is a very light load for most, difficult for a couple of people. \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "April 28, 2008",
            "review_content": "\nZahner is great!  She explains statistics pretty clearly, is very nice and chill and easy going.  It is worth it to take the 9am class just to have her as the teacher.  She is a wonderful role model of an intelligent, kind woman.  She still remembers what it's like to be a student (not too long ago she was in grad school), so she gives students a lot of slack (you don't have to buy the textbook, for example.) Because Zahner worked for a few years, she has a lot of practical knowledge about psychology and statistics and makes it interesting and relevant.\nEven though the tests are open-notes, they aren't super easy.  You still need to think about the problems, and preferably study beforehand.  Don't expect to get an A with no effort.  I took statistics last year, so this class is mostly a review for me, and yet I'm still probably going to get a B.\nWorkload:\nThree non-cumulative exams, open-note. (But don't expect them to be really easy.)  Homework--you start and finish in the weekly recitation, usually an hour early.\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 11, 2006",
            "review_content": "\nDoris is awesome!!!!! We definately reccomend this class.  She explains the material really well and makes statistics as interesting as it could possibly be.  Tests are straightforward, exactly what she teaches, and there's a curve.  She is also the best dressed professor in the school and probably the coolest one too.  Basically, Doris Zahner rocks!\n\nWorkload:\nHomework about once a week that she helps you with in \"lab\".  It is also a great way to boost your grade!  \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "February 08, 2006",
            "review_content": "\nThis class was deffinatly challenging, but Zahner is really the best. I have taken stat many times (3) and taking it with her was the only time i actually both computationally and theoretically understood the material. You will deffinatly work hard, but if you do you will get a good grade. And she is the nicest professor I've ever had.\nWorkload:\nWeekly Problem Sets, 2 exams, final\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "June 07, 2005",
            "review_content": "\nDoris is the best! She is friendly, helpful, incredibly approachable, and she really makes sure you understand the information. Stats can be difficult sometimes and she makes it as UNcomplex as possible. I HIGHLY reccomend her stats class. \nWorkload:\n3 tests--not too difficult, graded leniently\nweekly homework that she helps you with during recitation (which is optional). If she finishes her lecture early she give the class the choice of letting out early or doing the homework in class. \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 08, 2004",
            "review_content": "\nI don't know why I am complaing about this class. It was the easiest class I've ever taken, I didn't need to go to class, studied an hour before the exam, and still did well. BUT-the class was so easy that I actually found it to be insulting. This was not a college level course. I bet my AP statistics class in high school was way harder. The tests are open book and notes-so I really can't say I learned anything. You just had to spit the notes back onto the test, and you'd get an A. No thinking needed at all. I have no problem AT ALL taking an easy class, it was great actually...but it was also such a waste of time. Plus, it seemed like Zahner didn't want to come to recitations more than we did.  The recitations (originally 2 hours, cut down to 1...) were optional and she cancelled them frequently.  \nSo the class was easy, and you probably should take it just to boost your GPA. In fact, i'd probably take it again. i was just frustrated at how low the level of the class was.\nWorkload:\n1 problem set each week. 3 tests. (non-cumulative final).  Just be careful with careless mistakes....she takes off alot for those. \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "May 03, 2004",
            "review_content": "\nI LOVED PROFESSOR ZAHNER! To begin with, her class is probably the easiest class EVER. Just show up to class- or don't, if you don't want to, because she posts the notes online. But be aware that if you dont make it to class, you will definitely miss something- it is a pleasure to get to know Doris as a person, and she infuses her classes with tidtbits about her life (her marriage, Graduate school, college days, etc.). She is very well organized and always comes prepared, but she is not afraid to say she has made a mistake. And she takes it slow. If you dont understand something, then ask. It was just great going to class to get to know Doris better, but if youre taking a hard workload or looking for a way to fill that math requirement, Stats for Psych with Professor Zahner was amazing. \nWorkload:\nweekly problem set, which you can do during recitation. three exams; open notes and book (which i didnt look at once). she is VERY approchable and understanding. \n"
        },
        {
            "course_name": "Statistics",
            "review_date": "April 26, 2004",
            "review_content": "\nSHE ROCKS!! Doris is not only a great teacher but she's also one of the greatest dressers i've ever seen!! She is so well organized and so clear in her lectures.  She is always available by email and has weekly labs where she will answer any and all questions.  I don't know why no one else has left any feedback because if you have to take statistics defff take her!!\n"
        }
    ]
}