{
    "prof_info": [
        {
            "prof_name": "Mythri Jegathesan",
            "prof_id": 11100,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 05, 2011",
            "review_content": "\nBasically, this course is the LitHum version of anthropology. It's a survey course and introduces you to some broad themes that really help you understand anthropology and modern debates in context, but you never get the chance to \"do\" anthropology or discuss specific texts in any depth. It's a great course if you're thinking about majoring or concentrating in anthro because it shows you how anthropology has developed as a discipline (it's less than 100 years old) and what that means for anthropology today. You get to read seminal texts and learn a little background on the different \"schools\" of anthropology, but that's it. If you don't plan to take advanced classes, this is probably not a great course for you to take, because you won't learn much that will matter; you'd be better off in an anthro class with a narrower focus.\nPovinelli is pretty fun, and she tries not to bore the class with her lectures. Unfortunately, some of her material (especially that relating to early 20th century British social anthropology) is really dry. She'll give you vocabulary during the lectures (sometimes on Powerpoint slides, sometimes on the board) and you better memorize these words' exact definitions, since spitting back exact definitions will be half your grade on the midterm and final. The lectures deal with the ideas that influenced the readings, but they steer clear of actually addressing the readings. You have to do the readings on your own and hope you get a good discussion group.\nThe discussion groups are hit or miss. My TA was great, but our group sucked. We were supposed to discuss the week's reading on our own while Mythri facilitated, but it was clear that hardly anyone did the readings and those who did had no interest in discussing them. So instead, Mythri asked us questions and we BSed or just waited in silence. I've heard other discussion groups went better.\nAll in all, this is a great introduction to anthropology as a discipline and a great course to take as a freshman or sophomore considering an anthro major. But if you want to take a \"typical\" anthro class, or get a feel for the department, don't (only) take this course. It's unlike any other anthro class, just as LitHum is not like any real English course.\nWorkload:\nTwo papers (one due before midterm, one before final), midterm, and final\nThe papers are like 3-5 pages and graded very generously, but they are only worth 20% of your total grade; give priority to studying for the midterm (30%) and final (40%)!\n"
        }
    ]
}