{
    "prof_info": [
        {
            "prof_name": "Susan Pedersen",
            "prof_id": 2012,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "British Women Suffrage Movement",
            "review_date": "December 08, 2016",
            "review_content": "\nPedersen is like a walking encyclopedia. She knows so much and really listens when people contribute. She's really focused on teaching students how to be \"historians,\" which will be helpful for any research based course you may want to take. She has a relaxed style about leading seminars, making it an enjoyable environment to be in. \nWorkload:\nAbout 3 readings a week that can be pretty long but are well worth it, 1 short paper and accompanying presentation, 1 long research paper (15-20 pages) \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 30, 2015",
            "review_content": "\nProfessor Pedersen changed my entire attitude toward the Core. After several lackluster Core professors, I had almost given up on getting the kind of Core education that I had dreamed about when I came to Columbia, but Professor Pedersen completely renewed my hope in the Core. In her section, I was able to dig into (very difficult) classic texts and really understand what they were saying, and actually discuss deeply with my classmates what it all meant.\nThe section was really discussion-based, which was great. Professor Pedersen was really good at moderating the discussion and getting everybody excited enough about the texts as to participate in class. She also sometimes broke us into smaller discussion groups to talk about various important points in a text, and then we would come back together and go over all of them as a class, which really helped my understanding.\nProfessor Pederson showed us constantly that she really cared about our education and that we were getting the most out of the CC curriculum. As I realized partway into the class, she's a named professor of the Core, so she has a deep interest in making the class the best it can be. She always wanted to hear feedback on her teaching style, the selection of books on the syllabus, and the general method of CC instruction. She also knows every single book on the syllabus inside and out, and can (being a History professor by trade, not a Philosophy professor, remember) discuss so knowledgeably any of the books that it will astonish you.\nBe advised, Professor Pedersen has extremely high expectations for the course. Hers is not a CC section in which you get an easy A--you really have to work for it. There were times at which I got really frustrated with how easy my friends' experiences in CC seemed in comparison to mine, and how much harder I had to work to get comparatively lackluster grades. But ultimately, I think it was definitely worth it, and I did pull out a respectable grade in the end. I learned so much in this class--and so much that I can actually remember, since it didn't just go in one ear and out the other--and it left me with the kind of education that I'd been craving in all of my Core classes previously.\nProfessor Pederson completely deserves the gold nugget CULPA gives her, and, her high standards notwithstanding, I would jump at the chance to take any class with her again.\nWorkload:\nA pretty large amount of reading per night\n7 reading quizzes (2 lowest grades dropped) - instead of a midterm\n2 papers (5-7 pages each)\nFinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 07, 2014",
            "review_content": "\nSusan is one of the very few human beings in this world in whom I cannot find fault. She's absolutely amazing at what she does, and despite the fact that she would frequently stress that she was more accustomed to teaching in a lecture style, her ways of running discussion in CC were fantastic. She can effortlessly stimulate conversation for the entire two hours, and after two drab lithum teachers last year, Susan was a welcome change (also, keep in mind that these discussions were always somewhere between mildly inspiring and ground-breaking).\nAnd her fabulous teaching methods aside, she is a wonderful person to be around. She fully understands the stress that this school puts on us, and because of this, she sets up the curriculum in the most painless way possible. Two papers balanced so that their due dates were not during midterms, NO MIDTERM in the class, and very easy pop quizzes (easy as long as you read, that is) made it so that I hardly had to stress about the course as long as I kept up with the readings.\nOverall, I'd call it a privilege to have Susan as a CC instructor, and if you're lucky enough to get her, consider yourself blessed.\nWorkload:\n2 papers between 5 and 7 pages (due at calmer times of the semester)\n7 pop quizzes (that can usually be predicted) with your lowest 2 scores dropped\nNO MIDTERM\nNO DISCUSSION POSTS\nA manageable final with no surprises\n"
        },
        {
            "course_name": "Britain since 1867",
            "review_date": "May 16, 2013",
            "review_content": "\nSusan Pedersen is a knowledgeable, interesting and very nice professor, whom I had the privilege of studying under for both second-semester CC and for the British history class. \nRegarding CC, there isn't much to say: Prof. Pedersen is excellent at getting students to participate, and there was always an engaging discussion going. She also enjoyed adding a lot of historical background, especially for the British philosophers. \nShe didn't have that much to add herself about the philosophers' worldviews, besides stressing some general points, so mostly you get your classmates' ideas (which is what CC is all about, right?). \nA couple of points you should know:\n1) Her midterms have short answer questions, not IDs, and these can be a little tricky, because they might pertain to a particular part of the works or class discussion. So you need to study harder for tests than usual. \n2) She has pop quizzes (seven per semester), so you can't just not do the reading or even sparknote it if you want a solid participation grade. \nFor British History, this wasn't for me the best history class I've been to (that would be Prof. Janaki Bakhle's \"Gandhi's India\"), but it's a very solid class. A lot of emphasis on the party politics, rather little on foreign policy. But the lectures are engaging and interesting, and the workload typical for a history class. The one thing I really didn't like is that the textbook for the class, Pugh's \"State and Society\", is kind of rambling and all over the place; I hardly ever really used it. If you want to do well, GO TO LECTURE AND TAKE GOOD NOTES, and read the primary sources. \nThe essays for the class are interesting and challenging, but they can be rather difficult. The idea is to give students first-hand experience in historical research. Basically you're prompted to sift through databases. This is really great for history majors and people who just like to see how it's done, but it can be hard to come up with a good argument if the material you looked through just didn't give you what you wanted. So I'd give a word of caution to those who might have trouble with that kind of work, but history majors should have a lot of fun. \nDo not take this as an easy A class, it isn't one, though if you do well in history classes you should do well here. \nWorkload:\nCC:\nTypical 20% each on two essays, 20% quizzes+participation, 20% midterm and 20% final. A few of her selections are short (Weber, Schmitt, Kant) and a few are ridiculously long (Tocqueville), but all in all around 90-120 pages per session, nothing spectacular.\nBritain:\nTypical reading workload (Probably around 100-130 pages per week), usually the primary sources are more interesting+important for the tests+ longer. When she assigns fiction, there will almost assuredly be a question on the exam about some noticeable detail (e.g. what substance does Sherlock Holmes use that Watson objects to? Actual question).\n20% midterm (short questions, you need to know names, dates and major events, plus one essay), 30% final (like the midterm, just more short questions and two essays), two assignments with 20% each, and 10% section participation. \n"
        },
        {
            "course_name": "Britain since 1867",
            "review_date": "July 05, 2010",
            "review_content": "\nFantastic class. Professor Pedersen is probably the best lecturer I've ever had. I had very little interest in British history but i took the class for my distributional requirement. The syllabus is very well put together and between the readings and lectures, you cover a huge amount. Professor Pedersen lectures as if it were a conversation. She has a bare-bones outline of the lecture (which students also get a copy of) but she knows the material so well that she can give a full lecture without any additional notes or slides. \nThe only downside to this is that there's a LOT of reading. If you do all of it, it's generally 175+ pages a week. You can get by not doing all of it but you should do most of it. Some of the fiction, which are quicker reads, obviously. The midterm and final both have a pretty tough ID section (answering very specific questions about names of people and policies). Outside of reading the workload isn't too bad though. \nIf you have any interest in British history, modern Europe or world history, I would recommend this class. It's not easy, but you get a ton out of it. Also, she's the director of undergrad studies so if you're a history major, you can go talk to her outside of class and she's really nice and helpful there too. \nWorkload:\nReading load is heavy (150-250/wk at least). 2 short research assignments (5 pgs ea), in-class midterm and final (short answer/ID section and essays). Weekly discussion section. \n"
        },
        {
            "course_name": "Britain since 1867",
            "review_date": "December 20, 2007",
            "review_content": "\nThis was a very good class.  Professor Pedersen, while not necessarily an inspiring lecturer, is one of the best I've ever had at conveying a huge amount of information and making it interesting.  She also does a good job of managing various strains of British history (political-domestic and imperial, economic, social, etc.) across her lectures. \nThe reading for the course is mostly very good, although I could have done with a few more nonfiction books.  There is also a good film component of the course.\n\nWorkload:\nSolid.  2 short research papers (very specific assignments). Midterm and Final- essays as well as very specific questions.  Perfectly fair if you paid attention and studied.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 19, 2005",
            "review_content": "\nI switched into Professor Pedersen's class for the second semester, and I'm glad I did. None of that airy-fairy philosopher's teaching style here; she's a historian, and she brings a historian's eye to the CC texts. At the beginning of each class, she'd start by giving us an overview of the historical context of the text and the life of the writer. (Sophomores-to-be, take note: This is more helpful than you may think now, but you won't get it from every CC professor.) The quality of the discussions in this class was excellent, no doubt spurred by Pedersen's ability to direct it without being heavy-handed, focusing on asking the right questions instead of supplying the answers. She is also an extremely nice person without being soft. Her pages of comments on papers are absolutely on target; she'll praise the good qualities of your writing, but she'll definitely let you know where you've screwed up. But isn't that what a teacher's supposed to do? If you want to enjoy CC and feel like you've gotten a whole lot out of it, I would highly recommend this excellent professor.\nWorkload:\nCC readings, just like every other class - 50-100 pages a night. 2 papers, midterm, final. She is willing to look at first drafts of papers; take advantage of the opportunity!\n"
        },
        {
            "course_name": "British History 1760-1867",
            "review_date": "January 02, 2005",
            "review_content": "\nThis is by far the best history class I've taken at Columbia. I've never learnt so much from one class (and go through an entire notebook plus 15 more pages). Prof. Pedersen packs a lot of information into one lecture and she starts class on-time. There is a lot to learn and British politics can get pretty messy, but it's worth it. The one aspect of this course that I did not like was a long research assignment. It wasn't very clear on what we had to do and it involves spending a lot of time in the stacks picking out a suitable document to work with. Furthermore, you'll have to spend some more time identifying the characters within your document. Granted, the \"long\" assignment only consists of 5 pages (and you'll run out of room to put everything on), but it takes forever to write. The readings are doable but can get heavy at times. The grading for the entire course is completely dependent on your TA. \nWorkload:\nWeekly readings, workload like all other history classes; midterm: 20 factual questions (identify people, year, place, important causes), map quiz, 1 essay question on one of the primary sources from the weekly readings; two 2-page writing assignments; one 5-page research assignment; final (40% of grade): 30 factual questions, 3 essay questions.\n"
        },
        {
            "course_name": "British History 1760-1867",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Pedersen is great.  Her lectures are always interesting and informative.  If you attend class and take good notes, there is pretty much no need to read the textbook.  There are a lot of primary source and scholarly articles read in the course, but not an overwhelming amount of them, and they are useful in understanding the period.  I loved the class.\nWorkload:\nWeekly discussion section for which there are readings and occasionally small assignments, one 5 page research paper, midterm consisting of IDs, map quiz, and essay question, and final consisting of IDs and essays.  Very manageable.\n"
        },
        {
            "course_name": "Britain since 1867",
            "review_date": "May 20, 2004",
            "review_content": "\nBritain since 1987 is by far the most challenging and rewarding class I've taken at Columbia in my three years here.  I walked into class not knowing a thing about British history and walked out with a good grasp on the happenings of this time period.  Susan Pedersen is new at Columbia, but you wouldn't know that if she didn't tell you.  She did amazing work at Harvard (google her) and the CU history department is very lucky to have snatched her.  She teaches history from three frameworks: the political, economic and social/cultural.  Her strongest point is by far the political aspect.  She knows party politics like it's no one else's business.  Her lectures are comprehensive, organized and always on-topic.  She is also an excellent lecturer.   Don't worry if you know nothing about British history.  You'll learn if you don't mind hard work.  There is a substantial amount of reading from primary sources to secondary texts.   Read them.  If you don't, it'll come back and bite you in the ass come end of semester.  There are also mandatory film viewings.  Section (if run well, which mine was) is extremely helpful; I would highly recommend you attend on a regular basis.   Pedersen is also highly accessible to her students; she will do anything she can to help you out.  I love Susan Pedersen.  If you like the way Mark Carnes (one of my all-time favorite professors), you will adore Susan Pedersen.  They both teach history with passion and a desire for recounting not only the narrative, but telling it in such a way as to challenge your own ways of thinking about the happenings of that time.\nWorkload:\nTwo research assignments (thank god for that Butler tour during L&R; huh), midterm, final, class participation.  The tests are not that bad, but the Fact-Checks can be very detail-oriented.  Take good notes.\n"
        },
        {
            "course_name": "Britain since 1867",
            "review_date": "March 20, 2004",
            "review_content": "\nOH.  MY.  LORD.  This woman is so incredibly amazing.  The entire class sits riveted, fascinated, for all 75 minutes of each lecture.  Professor Pedersen knows every second of British history as if she lived through it.  She is new at Columbia (it's Harvard's loss for giving her up after 26 years) but extremely experienced -- practically at home at the front of a classroom.  This was my ultimate FAVORITE class so far at Columbia, and Pedersen is a gem of a professor.  She could teach the history of fruitflies and make it exciting.\nWorkload:\nWeekly 1-hour section.  Grading is done by TAs, who can be harsh when they expect certain perspectives and answers-- but they are essentially well-meaning peole.  The readings are long; I think students are expected to do some skimming.  The tests are surprisingly good-- short answer, followed by 1 essay chosen from a few options.  Some short answers deal with random trivia (presumably to separate the A's from the B's).\n"
        }
    ]
}