{
    "prof_info": [
        {
            "prof_name": "Maire Jaanus",
            "prof_id": 914,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "English Colloquium: Skepticism and Affirmation",
            "review_date": "April 10, 2014",
            "review_content": "\nWhere is this professor's gold nugget? This professor is by far one of the best professors that I have ever had at Barnard or Columbia. She genuinely seems to care about how her students are doing, and she is extremely nice in her office hours. Though she doesn't give much feedback (if any!) on your work [she did in the first semester, but not in the second semester], she will definitely meet with you one on one to go over any questions you might have about your grade. She responds to all of my emails promptly [sometimes, even late at night] and writes back with thoughtful responses all the time.  The workload is not bad at all, she structures her class in a way that you don't have to do all the readings on the syllabus (the only ones that you do have to do are the ones she assigns to you every two weeks)! (Although I highly recommend reading most of them, otherwise you could end up screwed at the end of the semester playing catch-up [but this is easily remedied with ebooks]).  \nWorkload:\nNot bad at all, 1 page response papers every 2 weeks\n5-6 pg midterm paper on 4-6 authors comparing/contrasting them, your own choice of topic\n10-12 pg final paper on 6-8 authors comparing/contrasting them, your own choice of topic \n\n"
        },
        {
            "course_name": "English Colloquium: Skepticism and Affirmation",
            "review_date": "April 10, 2014",
            "review_content": "\nWhere is this professor's gold nugget? This professor is by far one of the best professors that I have ever had at Barnard or Columbia. She genuinely seems to care about how her students are doing, and she is extremely nice in her office hours. Though she doesn't give much feedback (if any!) on your work [she did in the first semester, but not in the second semester], she will definitely meet with you one on one to go over any questions you might have about your grade. She responds to all of my emails promptly [sometimes, even late at night] and writes back with thoughtful responses all the time.  The workload is not bad at all, she structures her class in a way that you don't have to do all the readings on the syllabus (the only ones that you do have to do are the ones she assigns to you every two weeks)! (Although I highly recommend reading most of them, otherwise you could end up screwed at the end of the semester playing catch-up [but this is easily remedied with ebooks]).  \nWorkload:\nNot bad at all, 1 page response papers every 2 weeks\n5-6 pg midterm paper on 4-6 authors comparing/contrasting them, your own choice of topic\n10-12 pg final paper on 6-8 authors comparing/contrasting them, your own choice of topic \n\n"
        },
        {
            "course_name": "Reading Lacan",
            "review_date": "July 17, 2005",
            "review_content": "\nHer brillance, combined with her teaching abilities, makes Ms. Jaauus one of the most fascinating and competent teachers at Barnard or Columbia.  After witnessing all the over-inflated egos of the mostly insipid crew in E+CL, her accessability is a welcome relief.  You actually want to talk to her and I never missed a class because I knew that teachers like her are very rare.  The work is hard but I never regretted any of it.  Highly recommend this class.\nWorkload:\nIntense but rewarding\n"
        },
        {
            "course_name": "Senior Seminar: Body and Language",
            "review_date": "December 17, 2004",
            "review_content": "\nFirst off, Prof. Jaanus is simply an extremely nice person.  The class in general tended to drag when we looked at theory (all Lacan) and the theory-based readings were terrible.  When discussion focused on a literary text, however, the class was almost enjoyable (for a thursday 6-8pm class, thats a feat).  The course load was extremely light (can easily get away with reading practically nothing), just some response papers at the beginning of the semester and then the thesis  on topic of your choosing (20-25 pages) at the end.\n"
        },
        {
            "course_name": "Novel and Psychoanalysis",
            "review_date": "November 15, 2003",
            "review_content": "\nI have to say that this was the most frustrating academic experience I have ever encountered.  I vehemently agree with those students who say that although she may be brilliant, she should exercise her intellect and education in an arena other than teaching.  She can not complete a linear thought.  She goes off on incomprehensible tangents and speaks what can barely be construed as English.  Steer clear!!\n"
        },
        {
            "course_name": "Novel and Psychoanalysis",
            "review_date": "January 22, 2003",
            "review_content": "\njust had to put in my own 2 cents- although i didn't like this class much at the beginning, i must say that it really grew on me, as did prof. jaanus-- by the end of the semester it was one of my favorite classes.  although prof. jaanus wasn't very well prepared and did ramble, she is clearly brilliant.  She won't expect you to grasp all the finer points, so don't worry too much about it- just get as much as you can from the material.  Another huge bonus-little work involved- we had one paper and a straightforward final; she seems to be a fairly easy grader.\n"
        },
        {
            "course_name": "Novel and Psychoanalysis",
            "review_date": "January 20, 2003",
            "review_content": "\nHated the class.  I expected more on the literary aspects of each novel; but most of the class was focused on the psychoanalysis section.  Heavy focus on Freud, and how all his theories are seemingly validated by parallel examples from novels like Wuthering Heights.  To me, it sounded like a load of BS.  Do not take this class if you're not in love with Lacan, Freud, and all the nonsense about seeing phallic and sexual symbols everywhere.  Her grader also doesn't seem to know the requirements for the class, either.  Not a hard class, but be sure you're patient enough to withstand praises on ridiculous theories.  Be prepared to fall asleep from time to time.\nWorkload:\nAbout 8 reading responses posted online, plus a final literary paper and a final exam evolving around Lacanian theory.\n"
        },
        {
            "course_name": "Junior Colloquium, The Novel and Psychoanalysis",
            "review_date": "January 20, 2003",
            "review_content": "\nDon't go into either of Professor Jaanus's courses without extensive preparation in philosophy, literary history, and psychoanalysis -- Lacan in particular. She's probably the most intensely intellectual member of the department, and this does not work to her advantage when she's teaching. She tends to ramble, and I'm being generous -- sometimes it borders on the insane. Her instructions for paperwork are unclear -- but use it to your advantage: her grading's incredibly lax. If you don't get an A minus from her you must not have handed anything in. And all her quirks aside, she's goddamned brilliant. I lived for the gems that she'd just toss out in the middle of all her extraneous thoughts. She's so smart she can't organize her lectures into something coherent, but this actually allows you to watch her think, and to see how an incredibly intelligent person's brain works. If I had to attend a lecture in the Barnard English department, and I had my choice of speakers, I'd choose to listen to her, because she not only passionately believes in her work, she exudes a sense of intellectual passion that is unmatched. If you can handle her nature, and you actually want to think, take her classes. \nWorkload:\nWeekly responses, an 8-10 page term paper, and a final. The final is always short essays (no identification questions). \n"
        },
        {
            "course_name": "English Colloquium: Skepticism and Affirmation",
            "review_date": "January 17, 2003",
            "review_content": "\nProfessor Jaanus may be a literary scholar in her own right, but she simply cannot teach. There was no clear structure to the class, and it was not clear how work was being graded (or even what exactly was expected for the work). Classes were boring, and the professer's comments did not inspire at all. The worst English class I've ever taken.  \nWorkload:\n8 short responses throughout the semester and a final paper and final exam. \n"
        },
        {
            "course_name": "English Colloquium: Skepticism and Affirmation",
            "review_date": "January 11, 2003",
            "review_content": "\nThis was the worst class I've taken at Barnard.  Some of the books we read I found interesting, but the class \"discussions\" were virtually never enlightening.  While this was supposed to be a small discussion group, Professor Jaanus let everyone who showed up on the first day in, so there were about 27 of us in the class (since there were not enough chairs for everyone around the table about a third had to sit in chairs around the outside and balance notebooks in their laps).  The class consisted in listening to Jaanus ramble for two hours.  She was very disorganized and never seemed prepared.  On any given day the majority of the class would be dozing, doodling, or looking otherwise like they were about to disintegrate into bored heaps.  \nAlso, we never got any feedback in the course.  While we had to post 8 one page online responses she never told us what she expected from them.  I never received a single grade or comment until I saw my final grade online.  The guidelines for the final paper were so vague they were almost a joke.  \nShe gave us a lot of readings.  At the begining I read them all conscientiously, but after a while I realized that it didn't matter if I did or not, since class discussions were non existent, classes were not enlightening, and online postings could be written on virtually anything.  \nI never felt I understood the connection between the readings, or how they connected to what was happening in the Renaissance then, how they influenced contemporary writers, or even what the point of the class was supposed to be.  It was disorganized, vague, and worst of all boring; I resented having it as a requirement. \nTo be fair, Jaanus in a nice person and enthusiastic about many of the books we read, but somehow she was unable to convey that enthusiasm to the class.  I'm sure she is well meaning, but that does not erase the fact that this was a horrible class.  It seems clear that she does not put much effort into her teaching.  \n\n"
        },
        {
            "course_name": "culture of the novel",
            "review_date": "November 12, 2002",
            "review_content": "\nI found prof Jaanus at times brilliant and other times completely incomprehensable. When she grounded what she was saying in the text she was insightful and interesting. However, she tends to become abstract and consequently confusing. Her thinking and explanations were sometimes disorganized and hard to follow. I wouldn't recommend her classes to anyone who doesn't have an extensive background in philosophy/english/Lacan. She assumes you know everything she knows which is sometimes flattering but often unhelpful\nWorkload:\neight responses, one research paper, one exam\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "November 12, 2002",
            "review_content": "\nIn response to the other review on Jaanus - it is a love hate thing. She is incredibly knowledgable about the renaissance and equally incredibly disorganized about the class. While she knows what she's tlaking about her subjects don't seem at all connected and she does not leave room or time for discussion which is the point of a seminar/colloquium class. Also she is a bit too into the dead white male thing for a female professor - its downright weird. Take her if you are interested in random knowledge about the renaissance but be weary if youu expect her class to be understandable and the requirments straightfoward.\nWorkload:\nLots of reading though it is up to you how much you complete. 8 one-page responses posted to courseworks (one a week for whichever 8 weeks you choose). a ten page research paper - most clear cut requirement. 3 hour essay final on everything 'covered' in the semester.\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "November 12, 2002",
            "review_content": "\nIn response to the other review on Jaanus - it is a love hate thing. She is incredibly knowledgable about the renaissance and equally incredibly disorganized about the class. While she knows what she's tlaking about her subjects don't seem at all connected and she does not leave room or time for discussion which is the point of a seminar/colloquium class. Also she is a bit too into the dead white male thing for a female professor - its downright weird. Take her if you are interested in random knowledge about the renaissance but be weary if youu expect her class to be understandable and the requirments straightfoward.\nWorkload:\nLots of reading though it is up to you how much you complete. 8 one-page responses posted to courseworks (one a week for whichever 8 weeks you choose). a ten page research paper - most clear cut requirement. 3 hour essay final on everything 'covered' in the semester.\n"
        }
    ]
}