{
    "prof_info": [
        {
            "prof_name": "Peter Kelemen",
            "prof_id": 6936,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Earth Resources and Sustainable Development",
            "review_date": "January 06, 2017",
            "review_content": "\nI really enjoyed this class.  While I agree with other reviewers that Kelemen's lectures can sometimes be boring because they really are mostly just graphs that don't mean much when you're presented with them in such rapid sequence, I think that Kelemen tries (and often succeeds) to be an engaging professor.  He's witty and sharp and tends to break up the monotony of the data- and memorization-driven slides with interesting stories about his past and ramblings about kayaking, politics, and Willie Nelson (lol).  He also tries to present all of the information in the context of a larger story, which helps.  I completely disagree that he expects prior knowledge of geological concepts (or really of anything).  I think that in order to completely and fully understand everything he discusses, this may be necessary, but to follow along, you don't need to know anything (this is coming from someone who knows nothing lol).\nThis class was the first one I took in the Sustainable Development major and I actually think it did a decent job of presenting me with the basic issues in the environmental science/earth science fields.  Because of the requirement of two term papers OR one term paper and one presentation, you also get to know a couple of topics (you can literally choose anything) fairly in-depth, which I liked a lot.  If you're looking to learn a lot of in-depth stuff about climate change, renewable energy, etc., this probably isn't the class you want to take.  But if you want a general overview of resources available across the globe and the basic background of some of the most important issues in sustainability, go ahead and take this class.  Kelemen is a smart guy who cares about what he teaches and who's done some really cool work with carbon capture and sequestration, which was really interesting to learn about.\nAlso, it's pretty easy.  The term papers can take a lot of time if (like me) you're not used to writing research papers, but other than that I literally didn't do any work or reading outside of class (except for some studying for exams).  I think it would make a pretty good class to fulfill the science requirement because of this.  I opted for doing two term papers rather than a discussion section so I can't say how those are.  As long as you pay attention during lectures and put a moderate amount of work into studying and your papers/presentation, you can probably expect to get above a B+.\nWorkload:\nParticipation - 15%; based on iClicker responses - I think it's just participation points though since I got almost half the iClicker questions wrong and still got an A-\nMidterm - 10%; fine - if you take the time to actually memorize the questions he puts on courseworks, you could get near 100%.  Multiple choice\nFinal - 15%; same deal as the midterm, just longer\nTerm paper 1 - 30% (up to 2000 words, not that bad just time consuming)\nTerm paper 2 OR discussion section and a presentation - 30%\nEverything is chill and graded leniently\n"
        },
        {
            "course_name": "Earth Resources and Sustainable Development",
            "review_date": "November 01, 2016",
            "review_content": "\nThis class is very boring to say the least. Professor Kelemen simply rambles on about geological processes and data for the entire class period. His lectures consist solely of graphs and random data often taken from other sources including Wikipedia. He expects his students to be versed in highly technical geological terms and calculations and as a result most of his lectures are impossible to follow and understand fully. If you take this class expect to not understand the majority of topics discussed. The textbook that is required reading is hardly ever discussed in class and also highly technical. I guess the workload can be considered as light--two essays for the entire term plus a midterm or final, or one essay and participation in a discussion section (in which you give one presentation) plus a midterm and final. The midterm is simply 50 multiple choice questions so you can get away with not paying attention at all in class and studying the possible midterm questions posted on coursework. If you are genuinely interested in learning about sustainable development I would not recommend this class unless you are prepared to do all the reading and suffer through incredibly boring lectures. If you are someone looking to get the science requirement out of the way, this is a class that you can get by doing little work and still do reasonably well. \nWorkload:\nMinimal--in class clicker questions (very obscure), two essays or 1 essay and attendance at a discussion section (you must give one presentation in this discussion section)\nMidterm + Final \n"
        },
        {
            "course_name": "Earth Resources and Sustainable Development",
            "review_date": "December 10, 2012",
            "review_content": "\nI'm not really interested in sustainable development so I honestly found this class to be pretty boring.  Professor Kelemen isn't a particularly engaging professor so I had a really hard time paying attention in lecture, although I wish I did because I missed out on easy points on the easy pop quizzes he gives out.  That is probably going to bring my grade down significantly.  \nThat being said, the class is really easy.  The two term papers are graded really generously and have easy requirements, the midterm and final are based on questions we get before hand and vote on.  If you're looking for an easy way to deal with the science requirement, I recommend this class.  Just take it more seriously than I did.\nWorkload:\nreading you don't have to do\ntwo term papers, 60% total.\nin lecture pop quizzes, 15%.\nmidterm, 10%\nfinal, 15%\nIn short, go to lecture and decently pay attention so you can get easy points with the pop quizzes, it really can make the difference between an A and a B, etc.\n"
        },
        {
            "course_name": "Earth Resources and Sustainable Development",
            "review_date": "January 11, 2011",
            "review_content": "\nOverall, I'd recommend this course and Professor Kelemen. It was definitely a painless and interesting way to deal with the science requirement. (Note, however, that this course doesn't count for sustainable development, despite its deceptive title...) The material covered was generally interesting, and there was a great deal of latitude with the papers; we could write about virtually anything. His lectures were often interesting and relevant, although I'd get bored just because this isn't my passion. Grading was lenient. Professor Kelemen is easily approachable and unpedantic. My one complaint is that he is EXTREMELY slow at getting out grades; it's already Jan 11 and my winter term grade hasn't been posted yet. Oh yeah, and he sometimes jets off to Oman because he works for the Sultan in desalization. No biggie.\nI highly recommend both this course and Professor Kelemen if you're looking for an interesting way to deal with the science requirement in a course that isn't intended to be a joke (as some science requirement courses are wont to be.) As with most things, you will definitely get out of it as much as you put into it. Difference is, no one is going to threaten you or twist your arm to make you learn. In short: I learned a lot in a relatively stress-free atmosphere.\nWorkload:\nLots of readings that you don't have to do; Participation (5%) based on attendance (evaluated through insanely easy pop quizzes); 2 Papers on anything collectively worth 70% of your grade; Midterm + final collectively worth 25% of your grade based on questions created by the students--for which you will receive a study guide that includes all of the questions. Pretty light and pretty generous grading.\n"
        },
        {
            "course_name": "Intro to Earth Science I",
            "review_date": "December 21, 2010",
            "review_content": "\nThis class was ridiculously easy. I haven't gotten my grade yet, but right before the final I was getting 101%, and I don't have a particular talent for earth science. Professor Kelemen curves very generously.\nI definitely got a good overview of earth science in the class. We didn't go too in-depth on any of the topics, but learned enough to understand the concepts. For some reason our class moved really slowly. We would review lectures two or three times before quizzes and I got pretty bored sometimes. If you like earth science, though (and really, who doesn't?!), this is a fun class that fulfills part of the CC science requirement. There is a lab section, but you can also just sign up for the lectures, which is what I did.\nProfessor Kelemen is really nice. I never talked to him after class or during office hours, but he seemed very willing to help. He managed to be knowledgeable, yet not pompous like some professors. I would recommend  this class. \nWorkload:\n4 quizzes (and he drops the lowest one), midterm, final, all easy\n"
        }
    ]
}