{
    "prof_info": [
        {
            "prof_name": "Jeannie Im",
            "prof_id": 698,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2003",
            "review_content": "\nI was going to write, \"If you get Jeannie for your teacher, drop out of Columbia,\" but luckily for all humanity, she's not teaching l&r; again. Jeannie, in my opinion, is incredibly insecure about many things....[CULPA CENSOR].... and she compensates for her insecurities by treating her students like mud. [CULPA CENSOR] She takes pleasure in humiliating and ridiculing her students; she can never see what one does right, but only what ones does wrong; and it is impossible to write a paper that pleases her. She will destroy your self-confidence, your verbal dexterity, and your love of writing. She plays favorites to an unimaginable degree, not even bothering to hide her preference for those students who agree with her during class discussions. As for possibly disagreeing with her, that will entrail ridicule, a bad grade, and an overall horrible experience. It is my sincere hope that this insecure, conceited, arbitrary-grading anal-retentive freak, this combination of Stalin and Monica on \"Friends,\" will never become a professor in Columbia or anywhere else where people want to learn to write better, and to experience the pleasure of writing rather than just pain and despair.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 05, 2003",
            "review_content": "\nGoing into Jeannie's class I was terrified.  With CULPA reviews telling me to \"run, run, run\" I was prepared for the worst.  However, I was pleasantly surprised.  It's true that she feels the need to show off her knowledge of philosophers, writers, literature, etc. but she is really not a scary lady (did i mention shes barely 5 feet tall and probably weighs 90 lbs?)  She assigns fewer papers than other L&R; instructors because she wants her students to have enough time to write them.  Her suggestions for revisions are also really helpful.  She really does want her students to succeed.  Her grading though, appears to be based more upon whether she likes you (and is in a good mood as shes grading your paper) than anything else.    While Jeannie is probably not the best L&R; instructor, she's also definitely not the worst.  \nWorkload:\nMuch ligher than other L&R; classes.  One paper every week (sometimes every two weeks) for the first half of the semester.  2, rather than 3 long papers.  Midterm, Final, optional\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 02, 2003",
            "review_content": "\nHaving recieved a good grade in Jeannie's class, I can assure anyone that whether or not the other reviewers are mad about their grades, Jeannie is still a crap teacher. From her unwillingness to answer questions to her inability to explain anything well, Jeannie defies every characteristic I look for in a teacher. The only passable features of the course were those she had nothing to do with, like the small class size and the ability to write. Then again, her topics were so mind-numbingly uninteresting that she could make anybody hate L and R.\nWorkload:\nthe other reviewers covered it. the usual.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 01, 2003",
            "review_content": "\nBasically I have decided that the people who usually do culpa reviews are just bitter overachievers who did not do as well as they thought they deserved in the particular class.  Jeannie was definitely one of the coolest teachers I have had.  She is young and understands that there is a lot more to life than school but she also realizes that it is important to be a good writer.  I learned a lot from her and had a great time doing it.  I never missed the class because everyday the class discussions got more interesting.  She totally incourages everyone to get to know each other and the environment in the class is awesome because everyone knows each other so you can say anything.  I definitely recommend this class to anyone.  She rocks!\nWorkload:\nUnlike most L & R classes she only assigns one paper a week which is way more productive because you are able to spend more time making a better paper than simply throwing a paper together in a few minutes the night before it is due.  \n"
        },
        {
            "course_name": "College Composition",
            "review_date": "January 15, 2003",
            "review_content": "\nAh, The Im, Jeannie is a very brilliant but a very insecure young woman who mistakes aggression for authority. Her curt and hostile manner is a vain attempt to desguise her fears of being a new teacher. My class complained to the department on three seperate occassions about her unproffessional manner which caused the class as a whole to feal uncomfortable and nervous to ask questions...not the kind of situation that promotes learning. She was spoken to by the department and things did get slightly better. I have to say I learned a huge amount in her class but under one of the most uncomfortable situations I've ever encountered at college. I hope someday Jeanie will losen up and gain the confidence to share her knowledge with others without feeling threatened.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 25, 2002",
            "review_content": "\nL and R is the bane of the freshman experience and should be eliminated, or atleast totally restructured, in order to be somewhat complementary to the Core. If you get Jeannie---run. No matter what, you will never ever be as cool as her, and your writing will always be terrible according to her tyrannical grading ability. She basically uses this class as a platform for her intelligence, and although I would have appreciated the opportunity to learn more about great modern intellectuals, I was so turned-off by her ego that I couldn't digest anything she said. \nWorkload:\nusual L and R stuff. in other words, you will spend your time answering completely inane questions and learning to how to use the library. L and R is a perpetual thunderstorm clouding your head and creating shadows over your future. Whenever you've knocked out another great 500-worder on the intricacies of your favorite stuffed animal, you'll have another essay slap you in the face. \n"
        },
        {
            "course_name": "College Composition I",
            "review_date": "December 14, 2001",
            "review_content": "\nThe very idea that this graduate student would EVER be considered for a permanent position at Columbia is too horrifying to contemplate. She is a terrible teacher on every level. She is hostile to questions, condescending, arrogant (believe me, without reason), tolerates no opinion but her own (which, obviously, she believes is always and absolutely correct), gives conflicting definitions/explanations, and spends more time trying to impress you with her \"knowledge\" than making any effort to increase yours. This review is coming from someone who did well in her class, so it's not about \"sour grapes.\" By any and all means DO NOT waste your time or desire to learn (not to mention money), by taking any class given by Jeannie Im.\nWorkload:\nShort and long papers as required by the department, a quiz or two, midterm and final. Even short papers were extremely time-consuming (8 hours or more) since the topics were often indecipherable and what she was looking for (other than correct grammer) usually a mystery.\n"
        },
        {
            "course_name": "College Composition I",
            "review_date": "December 11, 2001",
            "review_content": "\nRUN LIKE HELL to the registrar, phone system, or web registration if her name appears on your schedule. She is cold, harsh and devoid of all creativity. You will not have the opportunity to improve your writing (or anything else for that matter) with her as your teacher. I guarantee that you will be frustrated. I guarantee that you will be unhappy. I guarantee that you will not get a decent grade. Please, for me, do not do this to yourself. With a whole University like Columbia out there, you have better options. The condescending nature of this graduate student will be enough to make your blood boil and there is no sense in sitting through a whole semester with a woman who feels the need to prove her intelligence at every turn. It is pointless to disagree with her in any class \"discussions\" because she is always right and clearly, that makes her smarter than you. You deserve better for your money, time, and efforts. This is an important class for the Columbia core; do not blow it with Jeannie Im. Now, go in peace to change your registration. \nWorkload:\nAbout a paper a week (7 short, 3 long and two revisions) plus a few random grammer quizes. The research for the longer papers will kill you as will trying to decipher the topics. Expect to spend roughly 4-8 hours per paper...that seemed to be our class average. One midterm (class choice of topic) and one final which was standard to the whole Composition Department.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 11, 2001",
            "review_content": "\nAt one point my class discussed printing up tshirts that said \"I survived L&R.;\" You dont do well in her class, you dont really learn anything, you survive. Well, maybe that isnt entirely true. I learned that writing ability has nothing to do with the grade you recieve. Jeannie is obviously brilliant, so brilliant that anything you hand in will be drivel compared to her writing, and she grades accordingly. I also developed an intense fear and loathing of Foucault and the word hermenutic, both of which she harped on constantly in class. Some semblance of humanity did develop at the end when she brought in tiramisu and apologized for being so harsh. But that didnt really do much for us since our grades were already down the toilet. \nWorkload:\nThe standard stuff, papers every class, midterm and final. If you get Jeannie, you will be writing about such fascinating subjects as the weather, pencil sketches of turtles and finally a long series of papers based on your intended major. This does nothing except make you regret your major. Of course, it doesnt really matter what that is, it will inevitably bite you in the ass.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 04, 2001",
            "review_content": "\nI have to disagree with the other review posted here; Jeannie definitely made L&R; the best class I have taken at Columbia (no joke). She's not an easy grader, but not the hardest either. She injects her class sessions with readings of Kant and Nietzsche, as well as selections from books written by Columbia professors and scholars. Often, essays are based on philosophical debate. Jeannie is a master at nit-picking your work, ensuring you learn how to write the \"L&R;\" way, and although some may complain it's stifling (I did, early on in the class), when it's over you realize how much you learned about writing. Highly recommended, although you don't really have a choice.\nWorkload:\nNormal L&R.; Easy midterm and final.\n"
        }
    ]
}