{
    "prof_info": [
        {
            "prof_name": "Till von Wachter",
            "prof_id": 2106,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Econometrics",
            "review_date": "November 20, 2006",
            "review_content": "\nIn econometrics, you learn how to do linear regressions, i.e. quantitatively determining how one or more independent variables correlates with a dependent variable.  Most of the class is the math behind it.\nItÂ’s a hard class, and it sucks.  In lecture I felt like I was sitting in a dark room, and there were only glimmers of light.  I habitually became infuriated when working on problem sets and realized that Prof. Von Wachter had not covered the material yet.  I found the lectures somewhat muddled, the textbook only marginally better.  The TA didnÂ’t know a thing either.  This was by far the worst class I have taken in my econ major.\nWorkload:\nTextbook readings, Bi-weekly problem sets, Midterm, Final.  Exams were very fair.\n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "May 21, 2006",
            "review_content": "\nMake no mistake about it, Till is not a nice man. You think he's nice because he says everything with a smile on his face, but in my opinion he's a mean and unsympathetic person who goes out of his way to be as unhelpful as possible. The lectures are all abstract proofs which are very confusing and mistake laden- sometimes the TA's don't even know what he's talking about. \nIf you try and ask him to go over something again in class, prepare to be ridiculed and embaressed. The problems sets are difficult and also filled with proofs, but the midterm and final have no proofs on them, so class is more or less optional (I would say more). Regardless, this is a difficult class with a very steep curve (mean is about a B- and it was only around 20% got an A- or better). Anyone has to be better than Till, avoid his section if at all possible.\nWorkload:\nWeekly problems sets that vary in difficulty but are usually harder than not. Midterm and Final that are very straightforward.\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 15, 2006",
            "review_content": "\nTill von Wachter is a funny man who makes an effort during class to enliven students.  The subject matter is obviously a bit dry (although I don't mind it too much), and he realizes it and jokes about it.  There are several problems. He never answers emails.  I emailed him at least 4 or 5 times in the first 2 months of the semester and then gave up, as I never received a response.  Instead, I went to section--one TA was excellent and the other was mediocre. Another problem is that problem sets are rather time consuming and difficult.  A third is that von Wachter never does any examples in class--he just presents the theory--which makes the problem sets even more confusing. The convenient bit is that the problem sets and midterm can count for nothing, with the final being your entire grade.  This means you can even skip the midterm if you want.\nWorkload:\nWeekly problem sets, time consuming but you can do them as a group\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "June 06, 2004",
            "review_content": "\nHope you remembered your stats and probability, because this is a prob/stats class.  Till is a very nice professor who is more than willing to help you out with a subject that can be difficult and frustrating.  He was always willing to answer students questions or spend time with someone to help them through a particular topic.  I know that some students complained about the problem sets being to long and difficult and he did respond by cutting down on some of the workload.  The TAs that I worked with were not very helpful, though I heard one other was very helpful with homework, so it's probably in your best interest to shop the TAs.  I also discovered that my TA didn't always agree on everything, that the Professor taught, which did lead to confusion when attending the midterm and final study sessions, or during the recitation.  One negative about Till is that class tended to run five to ten minutes long every session.  After an hour and fifteen minutes of econometrics, you are ready to leave!\nWorkload:\nWeekly homework.  difficulty of homework varied, but it was pretty challenging more often than not.  Midterm and final.  He gives practice test with solutions for both the midterm and final which is very helpful.  The final was almost identical to the practice exam, he just changed some numbers and added a few questions.  \n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 26, 2004",
            "review_content": "\nTill is an overall real nice guy.  He is very personable and actually tries to make the class interesting.  He isnt one of those teachers that talks on another level and doesnt care that the class cant understand a thing of what he's saying.  Its the fact that there is too much material covered that he must go ridiculously fast, not that he doesnt care if you learn.  His grading policy is amazing.  He even says that when he took this course in college he didnt understand a damn thing.  He gave you the option to have the final count for your entire grade.  This made problem sets optional essentially, and gave you a way out if you messed up the midterm.  Then to make our lives even better, he gave us a sample final and used that pretty much with minor changes in numbers as the real final!  This guy is amazing, for a class that sucks bigtime he made it manageable.  I would def recommend him esp if you just want to get a good grade in this horrible requirement.\nWorkload:\nweekly problem sets, midterm, final.  Prob sets and midterm are essentially optional because if you do better on your final that takes the place of both your ps and midterm grades. \n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "May 20, 2004",
            "review_content": "\nA pretty standard middle of the road professor. If you take his class try not to schedule another one just after it. Till lets his students out 10 minutes late pretty consistently. The class itself was unspectactular. His teaching style was fine if a little dry. It took him a quite while to realize that height is not pronounced like hate, which confused things. The problem sets he assigns take a while but you can do them in groups. The midterm was difficult while the final was pretty much a carbon copy of the practice final he gave us (with solutions) and as a result was a breeze. The grading scheme is such that your final can count as your entire grade if you have mucked up the midterm and problem sets. \nWorkload:\nProblems sets once a week. Midterm. Final. \n"
        }
    ]
}