{
    "prof_info": [
        {
            "prof_name": "Daniel Newsome",
            "prof_id": 12635,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Science Across Cultures",
            "review_date": "May 09, 2013",
            "review_content": "\nThis class sounded amazing. It was maybe the worst class I've taken in my time here. READ: DO NOT TAKE THIS CLASS.\nThe concept of intercultural science sounds interesting, and it could be - but not with this class. The readings are devastating. They are long and dense - it's like reading ancient scientific textbooks. If fact that is what you are doing - and unless you happen to major in whatever the texts cover (units were astronomy/cosmos, physics, optics and the body) they are impossible to comprehend. There is very little context for what you are reading. Also this isn't reading about things that are fascinating - it's literally a bunch of explanations of scientific concepts (geometrical proofs etc.) - so there isn't much actual culture in the readings.\nThe seminar itself is maybe even worse than the readings. If that was possible. Professor Saliba is clearly a giant (and basically the founder of the field) - but he clearly doesn't realize how far out of touch he is with students who haven't studied Arabic mathematicians etc before. He is also mostly deaf - this means that the discussion format of the class is useless. He can't actually hear what you are saying, so he lets you speak and then just says whatever. The class is entirely composed of non-sequiters. That being said, he's clearly a smart guy.  He also is obsessed with California and grad school. If you aren't ready for either of those things - be prepared.\nProf. Newsome is clearly aware of the problems with the class. He tries to bring in lots of gadgets and pictures to explain the unconquerable concepts. Sometimes they are ridiculous - but overall a really interesting way to learn. The thing is - he is clearly hyperaware of Prof. Saliba's place in the field. He is often too intimidated to actually assert himself to make the class function. \n\nWorkload:\nA lot of really dense readings every week (easily 200+ pages). Prof. Newsome even told a number of the students that he didn't expect we could get through them. They were awful. \nRequired weekly post on courseworks. These form the content for class \"discussions.\" Note class was on Wednesday, posts were due Sunday night. So that's when you had to get at least some of the readings done by - three days before class.\nThree papers over the course of the semester (5-7 pages each). Problem is there is absolutely no guidance - we were told write what will be interesting to Prof. Saliba. With material this dense this isn't an easy feat. It honestly would have been much easier if there was some direction.\n"
        }
    ]
}