{
    "prof_info": [
        {
            "prof_name": "Jean-Christophe Cloutier",
            "prof_id": 9576,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 24, 2010",
            "review_content": "\nThis professor was really, really helpful throughout the term. He definitely helped me grow as a writer and as a student at this university; thanks to him, I feel much more prepared for my future classes.\nThis is a professor that will stay after class if you have questions, respond to any e-mails you send asking for advice, be incredibly supportive and personally e-mail you if you miss a day for valid reasons, and give RELEVANT, interesting reading material for class. We do print a lot of pages and you should expect to write in margins, underline, highlight, etc., when reading essays,  but that will help you in your class discussion. \nHis feedback is *extremely* helpful on each essay, but it is very nit-picky, as it should be. Use this advice and apply it all in your final paper, and you will do well. Make sure you complete every essay in time to submit it for your draft paper so that you can get tons of advice. He doesn't just write in the margins and write notes on your paper everywhere, he also types up a whole sheet with advice on it for each draft you do. \nYou WILL become a better writer, even if you think you're already an excellent writer. His job is to teach you what Columbia U will expect you to be able to write like, so don't walk in as if you know everything about writing, because you don't know what your new expectations will be.\nAs an addition, you should know that you often read things about film theory, pop culture, and art, but 99% of all of the readings are things that you should probably know more about as a college student receiving a liberal arts education. \nWorkload:\n4 essays (Lens, Conversation, Research, Retrospective), lots of reading, small assignments to help with the writing process.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2010",
            "review_content": "\nHis university writing class is good, and he's a good teacher, but when it comes to grading, he's a real hard-ass in comparison to the others. In terms of how well he teaches you to write, he's pretty good, but to be honest, he overcompensates. It's as if he purposely adds material just for the sake of adding material.\nFor instance, he often has the class do peer revisions. We switch papers, read them, comment--the standard dig. But JC will give us sheets specifically detailing how to do peer revisions, like, circle these type of sentences, underline these particular words, draw a pink pony near the thesis statement. Just kidding about that last one, but the point still stands. Who seriously needs to learn how to do peer edits?\nNear the end of the term, JC seemed increasingly annoyed with our class. Perhaps it was our lack of interest and participation. Perhaps we were a particularly weak bunch. His annoyance was apparent, though.\nIf you're looking for a funny, nice guy then JC's your man. But as for a UW class, I'd generally recommend to shy away. \nWorkload:\nStandard UW material, but with injected materials.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 03, 2009",
            "review_content": "\nI started the class knowing that I would hate university writing. After taking JC's class, I still can't say I really enjoy it. But I know for sure I could not have gotten a better teacher for the class. \nFirstly, his class was engaging. Interesting discussions were cultivated in class, assignments revolved around thought-provoking topics, and he himself filled the awkward silences with witty but insightful comments and explanations. Class was efficient, yet casual and open at the same time.\nFurthermore, he was a very cool guy. Quite reasonable with deadlines; not because he doesn't care about them, but because he cares more about your work. He understands perfectly that students have work in other classes, or that students get sick sometimes. \nMost importantly, his class genuinely benefited us. He tried to cater to our needs as a group and as an individual. His feedback was always extremely relevant and helpful. He was approachable, and set up appointments where you can go and talk to him about your essay or the class in general. It was clear that he cared about our work, and that he knew how to help us. I actually feel like my writing improved thanks to his class, and I have a better understanding of finding sources and I am better able to organize my thoughts on paper.\nI was under the impression that having grad students for teachers would take away from the class, but JC definitely knows his stuff and shows it. I know everyone else complains about their uwriting classes, and I understand why, but this one is golden.\nWorkload:\n3 major essays and 1 reflection essay. Various ungraded assignments or exercises that are meant to help you write your essay, and not too time-intensive while being very useful. The essays themselves range from 1500 to 3000 words, and finding suitable sources may take a while. Expect to start on the essay at least a week in advance, or pull an all-nighter. \nOverall, workload is as expected for a writing class. \n"
        }
    ]
}