{
    "prof_info": [
        {
            "prof_name": "Raymond Kennedy",
            "prof_id": 2599,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Fiction Workshop",
            "review_date": "October 11, 2005",
            "review_content": "\nI really enjoyed and looked forward to my class with Kennedy who is a sweet little man and subtly witty professor. True, he is a little hard of hearing but I imagine I will be too when I'm that old! During conference, he's very friendly and interested to learn more about you as an individual. As for feedback, he writes a good amount of comments on students' work and is genuinely concerned with providing constructive criticism. Having said that, your experience in one of his classes will largly depend on the input of other writers since they are workshop based. I am surprised by the two disapproving reviews below but suspect the writers received poor grades. True, your grade may seem arbitrary since it pretty much reflects Kennedy's taste but creative writing is a highly subjective field itself (unlike Calculus or Physics) so it's unfair to single him out.  Kennedy tends to go easy on euphemisms so you'll know early on in the semester what he thinks about your pieces. He told my class that the abilty to write is something that you are or are not gifted with much like musical aptitude, which I don't agree with but is good to know before the class or else you may feel upset to learn he thinks you're not innatly endowed with literary genius. Just REMEMBER: like any professor of writing, his opinion is only one of a bizillion. Sure, you will be taking a gamble signing up for the course as far as your grade goes but, more importantly, whether he likes your writing or not, he will make all efforts to help you reach your potential (be it high or low potential). Also, it may be a good idea to read some of his books to get an idea of how he writes.  I ended up loving the class and the professor but you may want to test it out for a week or two before comitting.      \nWorkload:\nReading and commenting on others work as well as workshopping three of your own pieces (around eight pages each). \n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "September 22, 2005",
            "review_content": "\nI really liked this professor and, although I had my doubts initially, I really liked this class.  One of the biggest problems was that, because it was a summer class, participants weren't screened for writing samples, with the result that nearly half of the students in this class had very basic problems with writing, including spelling and grammar.  Reading and workshopping these pieces was often, given that this was supposedly an intermediate writing class, a waste of time.  \nDespite that serious problem, Raymond, though he IS hard of hearing and DOES ramble, is great.  It's amazing, as a young writer, to have a mentor who has been there.  He doesn't really give a sh*t about a lot of the niceties of professorship and is kind of a renegade character, but that all just makes me like him more.\nThis class is recommended for anyone who knows how to write and doesn't have a stick up their *ss.\nWorkload:\nA short vignette, three stories, no revisions.  \n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "September 05, 2005",
            "review_content": "\nThe class is a waste of time.  You write short stories, workshop them anonymously (but since he calls on everyone else for feedback except the writer, it's obvious) and then at the end of the semester, you get a grade.  How he grades it?  Who knows.  The point is, you won't learn anything about your writing or how to write \"a good short story\"  Either he likes your work or he doesn't.  It could be the best story in the world but if it doesn't go with his taste, forget it.  He'll tell you he \"didn't care too much for that piece\" if possibly, point how a few good things he liked and that's it.  \nWorkload:\n3 Short Stories (though we only had to do 2).\n"
        },
        {
            "course_name": "Narrative Forms",
            "review_date": "August 19, 2005",
            "review_content": "\nPerhaps the epitome of a waste of time. The instructor is old, hard of hearing, and has a tendency to go on and on without actually giving any useful information on writing. \nEven in conference I found myself not really getting a lot of what he said, and I don't think I learned anything that I couldn't have figured out on my own. Grading, as is typical in the Creative Writing, comes at the end without any real evidence to back it up. \nAvoid.\nWorkload:\nA couple of stories that you have to workshop during the term. Light.\n"
        }
    ]
}