{
    "prof_info": [
        {
            "prof_name": "Xiaobo Lu",
            "prof_id": 3989,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: Political Economy: Corruption and Control",
            "review_date": "January 16, 2017",
            "review_content": "\nIf you are expecting a perfectly organized and predictable lecture on corruption theory, do not take this class. However, if you enjoy open discussion on current events and divergent thinking on politics,  TAKE THIS CLASS! Some people might not like his impromptu presentation but I would say it actually help to stimulate critical thinking. Professor Lu often connects abstract theories with specific practices in daily life, which, in my opinion, is one of the best methods to learn political science.\nMeanwhile, Professor Lu is always eager to help. He welcomes all kinds of questions including inquiries on the assignment, lecture or career in general. He is also willing to discuss your research paper with you extensively before the deadline. \nAs for getting an A, I feel like choosing the right topic for your research paper is extremely crucial. Professor Lu will urge everyone to present her proposal a month before the ddl. If Professor Lu does not challenge your topic much, that probably means you are on the right track. \nWorkload:\none-page reading response per week, 20-25 pages research paper at the end. \n"
        },
        {
            "course_name": "Colloquium: Political Economy: Corruption and Control",
            "review_date": "December 23, 2016",
            "review_content": "\nProf. Lu knows corruption extremely well -- but only corruption in China. He plays favorites with Chinese students almost as if to exemplify the very concepts of amoral familialism and guanxi he discusses in class. \nI have taken two classes with Prof. Lu and I have never gotten a terrible grade from him, but his grading is so arbitrary that he bumps grades and lowers them after individual complaints from students. Do not take a class with him if you expect him to read your papers and give you a grade you deserve. He does not care about the work of his students. His expectations are unfathomable and changeable. If you can settle for an A- or B+ and would like to get one just by playing nice with the professor, and don't mind not learning anything in your class, take this course. If you'd enjoy a challenging class, and a professor who can improve your knowledge of a field, and give you a grade that matches your hard work, then do not take this class. \nWorkload:\nIt doesn't matter. No matter what you do, Lu will give you a random grade according to how much he likes you. \n"
        },
        {
            "course_name": "Colloquium: Political Economy: Corruption and Control",
            "review_date": "January 17, 2012",
            "review_content": "\nFall 2011 Political Science G8471\nThis Professor does not care about his students and almost all his classes were filled with Chinese students who wanted to get an east ride. And to their surprises, he seldom gave out A-range grade as he perceived papers of publishable quality in major journals can only get A- in his course.\nAnd his seminars were disorganized, randomly touching upon topics that came across his head. What a waste of two hours when students had to do presentations one by one.\nDon't take this class unless you want to get a B, most and very likely.\nWorkload:\nOK. 25 pages of a research report that can make a major and unique contribution to the existing literature. How easy is that?\n"
        },
        {
            "course_name": "Colloquium: Political Economy: Corruption and Control",
            "review_date": "April 17, 2007",
            "review_content": "\nI really liked the class and the professor. Lu is famous in the corruption field and he gives an awesome overview of corruption and how it affects politics, economy and business relations. The class is power point heavy, but if you manage to type fast enough and get down everything from the screen (do that, cause he does not post his lectures on CourseWorks) you will do well on the midterm.\nThe readings were great and informative, but there was still a heavy load of theoretical work, which was not particularly thrilling. \nThere is no final, but you have to write a 15-20 page term paper. Lu is extremely helpful with the paper and you can pick any topic you want as long as he approves it. \nOverall, interesting, informative and cool class.\nWorkload:\nTake-home midterm (5 pages - use the lecture notes for theory, back up with some examples from the readings and you will be fine); 15-20 page term paper on the topic of your choice; no final\n"
        }
    ]
}