{
    "prof_info": [
        {
            "prof_name": "Owen Gutfreund",
            "prof_id": 213,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "August 06, 2007",
            "review_content": "\nThough I generally enjoyed learning about specific \"case studies\" as an Urban Studies major, there were a few things about this class that bothered me.  1) This is a history class, and at times the information given to us during lectures seemed irrelevant or unnecessary.\n2) Neither in lecture, nor in discussion section did we ever had the chance to analyze anything.  Everything was thrown at us on a purely factual level.\n3) At times Prof. Gutfreund felt it appropriate to treat us like children in the middle of class (ie. making people shut computers during films, scolding us for finding amusement in the films... etc).  It was condescending and insulting.\nDespite this, he loves Urban Studies majors and is very helpful one-on-one.  SimCity is really fun, but don't leave it to the night before, as I did on more than one occasion.\nWorkload:\nSimCity assignment, a few papers, midterm & final - not too bad if you study well\n"
        },
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "December 15, 2005",
            "review_content": "\nThis class changed my perspective on cities, to be sure, but only because I had never taken another urbanization class.  That said, only take this class if you enjoy the style of learning history which reccomends memorizing facts without any sort of theory or explanation as to why they're all important. Owen talked really fast and clearly was very knowledgeable, but he was unable to discern between relevant and irrelevant facts to include in his lecture.  So I did learn many things about the cities we studied, but I didn't learn many methods of analysis specific to urban studies, or how to go about investigating cities in the future.  We investigated GIS methods in our discussion section, but as the class was large and only had one TA, discussions sections were biweekly and therefore very cursory.  Part of the grade was also to post in discussion on CourseWorks, but I feel it would have been better if Owen had provided questions to guide our discussion, since it ended up being very unfocused and generally people made uninteresting comments just so they could fulfill that part of the class.  Many people in the class enjoyed it; I did not.  Just be clear before you take it about what sort of experience you're looking for.\nWorkload:\nPretty easy, but don't take the class if you don't enjoy playing SimCity.  However, let me attest to the fact that it IS possible to play the game only a few hours before each paper is due and still get an A, despite what he may tell you.\n"
        },
        {
            "course_name": "Junior Colloquium - Urban Studies",
            "review_date": "December 12, 2005",
            "review_content": "\nWhen I signed up to take Gutfreund's section, I thought I was in for something special. I was terribly wrong. His teaching was uninspiring and tedious, and what makes it all the worse is that he is the DEPARTMENT HEAD of urban studies. I really expected more out of a department head. \nIt seemed as if he wasn't very enthusiastic. I felt he was kind of dismissive of our interests and opinions and didn't do much to stimulate our interest in urban studies. What really got me, though, was when we were presenting our final research papers - 25-page papers we had clearly spent a lot of time and effort on all semester - and all Gutfreund really seemed to care about was whether we went over the ridiculously short 5-minute time limit. What's more important here?\n"
        },
        {
            "course_name": "20th Century Urbanization",
            "review_date": "April 20, 2005",
            "review_content": "\noverall, a really interesting class. the lectures are not always organized as well as they could be, but they are definetly interesting. there are no books, only a website (which you really dont have to look at unless youre interested in the material)...you do have to come to class every time or else find someone to take notes for you, because that is the only way of getting the material. i found the class very interesting and would recommend it to anyone who is interested in cities in any way. i do have to say that prof. gutfreund is not my favorite prof, and sometimes i think he wants things done his way a little too much, but he can also be friendly and funny. and none of his personality really effects how the class goes. \nWorkload:\n2 papers (5-7 pgs each), midterm, final, (not too hard if you study), online discussion (once every two weeks, not bad). overall it is very possible to do well in this course if you put in effort.\n"
        },
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "April 10, 2005",
            "review_content": "\nGreat class.  Prof. Gutfreund is a well-prepared, engaging lecturer and is clearly passionate about the city.  His lectures are so interesting and he uses websites, videos, and guest lecturers to complement what he has to say about the cities that we are studying (Denver, Melbourne, Kano (Nigeria), Beijing, Singapore, Brasilia, Mexico City and Toronto).  The SimCity assignment is not much fun if you don't get into the game, but he gave us a lot of freedom on the other paper.  Discussion sections (run by the sole TA) are informative and interesting as well, and we got the option of taking a discussion-based section or learning GIS.\nWorkload:\nNot too bad.  No books, but instead scrolling on websites for each city (he made his own website for the course) and engaging in online discussions.  2 short papers (~5pages each), midterm, final.  Thus far in the course (with one paper graded, the midterm graded and the second paper being due in a couple of days) I have to say that every assignment has been straightforward and the grading is extremely fair.\n"
        },
        {
            "course_name": "History of American Cities",
            "review_date": "January 21, 2004",
            "review_content": "\nI'm an Urban Studies major, but it was definitely not this class that \"cemented\" my decision as another reviewer wrote.  Gutfreund takes his lectures directly from the readings so there's no point in going to class.  He thinks he's being helpful by writing the list of the five or ten largest cities every decade and their populations on the blackboard when you could look at the tables in the books and find the exact same stuff only better organized.  \nI stopped going to this class mid-way through, and didn't do the readings.  He said to the class the day before the final: \"You know, if you skipped the last 2 months of this class you're not going to get an A.\"  This is hilarious because when he said this, I thought he was talking just to me .  . . but I still got an A in the class.  Don't take this class if you want to hear a nuanced approach to cities; take it only if you know nothing about cities and want a large lecture class and 3 easy credits.  \nWorkload:\na couple of papers, (1 using sim-city); midterm and final-- easy because possible IDs are given on review sheet and essays are so general that it's impossible not to do well.  The other reviewer says you need to go to class to know IDs-- this is not true, just take your review sheet home and google the terms to study.\n"
        },
        {
            "course_name": "History of American Cities",
            "review_date": "August 29, 2003",
            "review_content": "\nWow, what a great class!  I went into this class considering a major in Urban Studies, and History of American Cities totally cemented that decision. Professor Gutfreund knows everything about cities in America, and like the other reviewers say, he wants us to know everything too. It was not often that I took less than six pages of notes per class. However, everything he talks about is extremely interesting, and he expertly ties all the minutia into the overarching themes he presents. His lectures are organized and coherent, and very easy to follow. The professor was also very friendly and approachable, and would stick around for ten or fifteen minutes after every class to talk with the students. \nIn this class, I didnÂ’t only learn the history of cities, but rather the whole story of how people live in America. As a displaced suburbanite here at Columbia, Professor Gutfreund helped me understand why my hometown, and New York City, exist as they do in the present. And that is the best way to sum up this class: it teaches you not only the Â“whatÂ” of history, but also explains the Â“why?Â” of the present.\n\nWorkload:\nTwo papers: one five page about anything you want, and a longer one involving the computer game SimCity. The first paper is easy, the second one is too if you already know the game-if not, itÂ’s going to take weeks. The midterm and final consist of IDs and essays, both very, very easy if you go to class and take good notes. The discussion sections didnÂ’t start until 5 weeks into class, and were unbearably boring, yet assigned no work. Interesting and easy: take this class!\n"
        },
        {
            "course_name": "History of American Cities",
            "review_date": "May 04, 2003",
            "review_content": "\nThis class was incredible, it was fascinating and comprehensive, but very fast-paced. I used two notebooks, and filled every single line and some margins. I learned so much about so many interesting things, but the information was presented in a clear and logical manner, with readings that were both interesting and helpful. My only complaint was that the professor wasn't so accomadating when I had a family disaster and asked to re-schedule the midterm. His only response was that I should go through the bureaucracy. However, professor personality is not so crucial in a large lecture (which this is) so don't let it deter you. Section, which should make up for that is totally skippable, and nearly useless.\nWorkload:\nOne midterm and a cumulative final. The midterm was easy. Two papers, a 5-page research paper on a topic of your choice, and a 6-page paper on the game SimCity, which was much more challenging and time consuming than it would seem to be. Start playing the game as early as the professor suggests.\n"
        },
        {
            "course_name": "History of American Cities",
            "review_date": "August 01, 2002",
            "review_content": "\nGutfriend is somewhat knowledgeable about cities, he's aware he's not that intelligent and tries to compensate by spewing out every useless piece of information he's gathered into lectures. If you actually listened to everything he said, you'd have aprox 6 pages of notes per class. Ridiculous. He then has the nerve to put minor terms on exam (\"grain elevator\"). Essays however, are quite vague and open ended. Discussion section is a pain, particularily if your TA is named Nancy. Her goal is to put you on the spot and embarrass you. She basically fires questions at everything you say and then attempts to turn your fellow classmates against you. Try to get the older male TA. Grading isn't based on what you wrote so much as your style and grammar. \nWorkload:\n2 papers, one interesting on a topic of your choice, the other a useless review of some sort of exhibit that relates to cities. He doesn't really explain this one, just go to the Tenement Museum or NYC museum and pick something and bs. Exams are term defnitions and essays. Terms can be obscure, essays are very very general. 4 extremely painful discussion sections.\n"
        },
        {
            "course_name": "Urbanization, Junior Colloquium",
            "review_date": "January 27, 2002",
            "review_content": "\nOwen is incredibly interesting and a great professor---***IF***---you are interested in the material. If you're taking it as an easy class, you'll be bored. But if you love city planning and politics and the ideas of sewage pipes and transportation, then he's great. He has high expectations though and is very anal about stuff---don't go to class a minute late. But he's interesting and very knowledgeable and would love you to come to his office hours and talk about anything. \nWorkload:\nFor urbanization---people say it's an easy A---it's not---it's an easy B, though. You have to go to lecture. There's no reading, just a website you can ignore. You have to post though every so often. Your papers have to be decently researched. Two are on SimCity though, which is kinda fun. Midterm, Final and 3 papers. Junior Colloquium---one book a week that you HAVE to read. Your final paper which is 20 pages or so and has to be up to par, and you really should be working on it the whole semester not just the last week, b/c he tests you before class on your progress.\n"
        },
        {
            "course_name": "Urban Studies Colloquium",
            "review_date": "January 23, 2002",
            "review_content": "\nOwen is a dedicated, fair teacher. If you don't like him, urban studies is not for you. His voice can drone sometimes, sure, but so what? If you're interested in the subject matter, you won't even notice. He is also a handy advisor to have. Careful - he can be a little moody. Don't take it personally.\nWorkload:\nA fair amount - the final paper is a bear - but what did you expect from a colloquium?\n"
        },
        {
            "course_name": "20th Century Urbanization",
            "review_date": "April 08, 2001",
            "review_content": "\nThis class was, far and away, the best I have taken so far. Perhaps the previous disparaging reviews were from non-Urban Studies majors. A word of warning: if the structure of cities and all that goes into them doesn't make your blood steam, don't bother. I, though, do get a little hot under the collar when it comes to sewage systems and zoning restrictions and mass transit systems. Owen's lectures are well-organized, and he's fantastic about getting the information packed in, and leaving time for questions at the end.\nWorkload:\nFair/easy. I wouldn't call it a flake class - Owen's interested in seeing that you've attended the lectures. A simple paper on one city - basically a book report - and another simple paper on SimCity. No readings to buy (!). A midterm and a final - do be careful to study the details. \n"
        },
        {
            "course_name": "URBS V3525 20th Century Urbanization in Comparative Perspective",
            "review_date": "April 08, 2001",
            "review_content": "\nForget what everyone else says. He is a really dedicated, interesting teacher. If you find him boring, it just means Urban Studies is not for you. You aren't going to learn about the development of crack ghettos in new york, exciting gang fights for neighborhoods, mafia landlords, or lakes catching fire in ohio. What you are going to get is a really solid introduction into urban development, and it actually can be interesting. You can't be lax about the course though.... it will bore you to tears if you miss a day of class or don't particpate in the online discussion sections... because you will have no idea about what is going on. If you have about two hours outside of class each week to devote to the course, you WILL stay interested, and you WILL do well. THERE IS NO HOMEWORK. There are three papers - one a short research paper on the city of your choice (fun to do, just do your research ahead of time so you don't kill yourself or wonder why your work wasn't good enough for him) and two papers based on a simcity project. You have to play Simcity throughout the term, though, and it is actually really fun. (yay games as homework!) But do it, otherwise you're going to miserable the last part of the term, when you need to turn in one successful city of a million people that you create yourself.\nWorkload:\nmid/fnl. 3 papers. simcity. it is an easy class - but if you slack off, he will grade you down. And he will know.\n"
        },
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "December 31, 1999",
            "review_content": "\nI was expecting a lot more out of this class, but the sad thing was how boring the class was. I thought this would be an exciting look at different cities and an overview of urbanization in the global world, but the course ended up being a static look into a few specific cities. Often we would spend extraordinary amounts of time covering minute historical facts about a city that were truly irrelevant to the purpose of the course. I do not recommend this class.\nWorkload:\nPapers, midterm, final.\n"
        },
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "December 31, 1999",
            "review_content": "\nThis was not a very good course. Too much time was spent on esoteric matters of too few cities. One glaring omission was the lack of any look into European cities. It seemed like the professor had little expertise on many of the cities and relied on reading straight from websites. There is very little work in this class - NO READING - there are no texts and the website reading is irrelevant. The required work includes posting to a newsgroup, 3 short easy papers (one being a SimCity project), and a fairly easy midterm and final. There just isn't much material in this course. Expect somewhat harsh grading as it seems like the professor is defensive about qualifying this course as a legit class. Also, expect the prof to get irritated by stupid little things. TA's are second-rate.\nWorkload:\n3 short papers, newsgroup posting, midterm, final.\n"
        },
        {
            "course_name": "Colloquium on the Shaping of the Modern City",
            "review_date": "December 31, 1999",
            "review_content": "\nThe readings are excellent. Tells you about the history of metropolitan political, social, educational, residential, and transportation systems for major cities like Chicago and New York. Guttfreund is a much better lecturer than a discussion leader. He's quick to shoot people down about ideas that he does not agree with. He's also quick to pick favorites even if they're major slackers. Makes you turn in in-depth questions on weekly readings and grades them (ughh). Pretty anal guy.\n"
        },
        {
            "course_name": "20th Century Urbanization in a Comparative Perspective",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is a relatively new class in a relatively new department, so expect there to be many changes from semester to semester. I suppose the lectures were adequate and Prof Gutfreund knows quite a bit of esoteric facts, but this class really couldn't capture my interest. The grading was a little harsh, particularly considering that this is more of a fluffy class.\n"
        }
    ]
}