{
    "prof_info": [
        {
            "prof_name": "Emily Cooke",
            "prof_id": 4578,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 10, 2009",
            "review_content": "\nUniversity Writing with Emily was an excellent course.  She is an expert in writing (at least compared to me), but is also able to see things from the perspective of the student--the better to explain to us ideas we don't understand.  She is not an easy grader, nor an overly difficult one: grades on class essays typically ranged from C to A.  She is strict with her in-class rules, but is more relaxed about the content of the course--she essentially allowed the students to write about whatever we wanted, regardless of the technical restrictions established by the department for a given essay. Most important, though, Emily will definitely help you improve your writing.  Highly recommended.\nWorkload:\nThe same as every other University Writing course--three major essays (with drafts), one minor one, and plenty of readings to improve your style.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 28, 2009",
            "review_content": "\nEveryone bashes UWriting, but it was a delight with Emily.  She's incredibly thoughtful and intelligent, and also a great person.  She was totally willing to meet outside of class when I couldn't quite find the right topic for a paper, and she really encouraged us to write about things that interested us, even if the connection to the seed text was tenuous.  \nAbove all, she tried to help improve our writing while retaining our own individual writing styles, instead of forcing us to conform to some personal or departmental standard and grading down if we didn't.  Emily is the best--do whatever is in your power to get into her section!!\nWorkload:\nStandard: long-ish readings and short writing assignments, most of which help prepare you to write your 4 papers.  The grading is fair (if a tad hard) during the semester, but I was pleasantly surprised by my final grade.\n"
        }
    ]
}