{
    "prof_info": [
        {
            "prof_name": "Arden Hegele",
            "prof_id": 12937,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "September 02, 2014",
            "review_content": "\nArden is the coolest UW teacher, hands down. If you have a chance to take Uwriting with her, TAKE IT. She runs what is best described as a totally no bullshit class: she doesn't give homework except the progressions, and each progression is one rough draft, one final draft. You can send her more drafts and she'll give you feedback on all of them, but they're not required. Her readings are very well chosen (and not the stuff the other UW classes do either). The comments she gives back on progressions are really helpful. Also, you get cookies from Artopolis on a regular basis.\nWorkload:\nAll interesting reading, no BS. Each of them is for a reason.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 26, 2014",
            "review_content": "\nArden was a pleasure to have this past spring for UWriting.  This was her first time teaching the course, and she really did a great job.  Any complaints I had with the class were really based in the course itself not Arden.  Arden was incredibly responsive to emails (emailing back always within a few hours), a super fast grader (most we ever had to wait was three days), and she was very understanding (sometimes slightly amending the rules for certain progressions if people had certain ideas that didn't quite work with the rules).  Class was always somewhat engaging, which is a real feat, because it can be hard to make UWriting interesting.  We mostly discussed readings, which were usually pretty thought-provoking, ranging from essays about writing itself to essays on gender.  However, where this class really stood out was in its assignments.  The four progressions are really well thought-out and Arden's great feedback, usually typing out a full page or so in response (in addition to the mandatory one-on-one meetings), really gave us a chance to work on our writing and to learn.  The only complaint I had with UW was that I wish the actual class time was more spent on learning how to write and less on the content of the readings.\nAll in all, Arden was a very fair grader, an engaging writing instructor, and really a sweet person.  I would recommend her to anyone.\nWorkload:\n4 progressions, and a commonplace book (journal) where we logged some thoughts on the weekly reading assignments (very very low stress).\n"
        }
    ]
}