{
    "prof_info": [
        {
            "prof_name": "Yeon-Koo Che",
            "prof_id": 2874,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "MARKET DESIGN",
            "review_date": "April 21, 2016",
            "review_content": "\nWhile I found this class very challenging, I have been highly rewarded for my hard work.  I've noticed that the professor deliberately presented difficult material in order to weed out the weaker students.  Those of us that stayed on board were in for quite a treat.  His early slides were somewhat disorganized, if only to throw some of us off the scent.  After the first few weeks, it really got cooking.  Too often we Economics majors are patronized by professors that teach to the lowest common denominator.  If you are serious about the study and research of markets, Professor Che is a must have.  What I would never have expected is the joy and humor that Professor Che revealed on our take-home exam.  Hint: do the last problem first- it will save you a lifetime.  Call me a sycophantic try-hard, but I would even say the professor was pretty cute.  He brought candy to class, couldn't stop smiling, and cracked some side-splitters.  When he invited the entire class to dinner, we met his wonderful and warm family.  The eldest, undeserving son was far from a chip off the old block, the youngest had the humorous countenance of his father, and his wife was a dreamy dime piece.  No surprises there- he teaches so well he should have a lion's pride of wives (#LionPride).\nWorkload:\n5-7 problem sets, 1 midterm, 1 take-home final\n"
        },
        {
            "course_name": "Law and Economics",
            "review_date": "May 21, 2009",
            "review_content": "\nI don't know what the other reviewers are talking about.\nI was extremely excited when I signed up for this class. The class sounded fascinating. But I was extremely disappointed. The professor, yes he's a nice man and obviously is intelligent, didn't teach me anything. The only thing that saved the class were his unclear powerpoint presentations. I tried to listen, I really did, everyday but I could barely understand what he was talking about. The class was disorganized, most of the time, I didn't know what he was trying to teach us. My friend and I were always joking about how lost we were and how all we could do was laugh at the class. I don't think I learned nearly as much as I usually do in a class. Sure, I know a little bit more about property law, torts, contracts, etc. and yes, you do get better at finding the Nash Equilibrium (hopefully, you're already good at this from the intro econ classes) but all in all, I wish I had taken a different econ elective. The material isn't particularly challenging - it's just frustrating because you don't know why you're learning what you're learning.\nWorkload:\n5 Problem Sets (individually), 1 midterm, 1 final, textbook reading (not particularly difficult), 1 group presentation. Don't be tempted to take the class just because it isn't that hard.\n"
        },
        {
            "course_name": "Law and Economics",
            "review_date": "May 20, 2009",
            "review_content": "\nThis review is more recent than the two below.\nChe is definitely not as good as previously advertised. For one thing, his class is no longer that easy. The previous two reviewers may have found the class easy because Che was probably only beginning to teach it. But (he told the class himself) he found that everybody was getting straight A's, so he had to increase the difficulty of the material.\nFor my class, his midterm caught a lot of kids completely off guard. The midterm was several times more complicated than the homeworks. Moreover, his final was even MORE difficult than the midterm. He successively made his tests harder to force a bell curve on the class. Beware.\nThe class is a lot of game theory. The game theory can be extremely confusing if you don't spend the time to sit down and learn the stuff.\nChe also tends to be a not very interesting lecturer. He won't bore you to death, but for a subject like law/economics, better lectures may be deserved.\nAlso, he wasted like 5 lectures on student presentations. These student presentations were terrible, and people just stopped coming at some point.\nWorkload:\nFour graded homeworks, not a lot. Presentation.\n"
        },
        {
            "course_name": "Law and Economics",
            "review_date": "May 16, 2009",
            "review_content": "\nA very nice guy, knowledgeable, intelligent. Nice that he provides incomplete ppts or pdfs for you to fill in along with him. Midterms and finals usually dont resemble practice materials in any way whatsoever, Stressful in that way. but exam are usually fair and straightforward.  \nyou sort of review random econ and math for the first half of the class, then you get into the Law stuff near the end which is what i wanted to study all semester. I mean i can learn about that other shit in principles (torts, liability, negligence etc.) \nI am furious with him because after problem sets, project + paper for project, final, midterm he cant even get the grades in on time. \nNo diploma for us on commencement day. If you want your diploma on commencement and not in the middle of the summer don't take this class. Waste of fucking time WTF? \nWorkload:\nProblem sets (usually extremely straightforward except for last problem) , project w/presentation in front of class,  paper for project, final, midterm (exams resemble form of practices, but are usually easier and more straightforward) yes he tries to scare you\n"
        },
        {
            "course_name": "Law and Economics",
            "review_date": "June 04, 2008",
            "review_content": "\nHe was by far the best economics prof. I had at Columbia. \nHis slides and lectures teach you all you need to know on the (very simple) subject, so doing the problem sets was not a matter of relearning everything from the textbook, which is the case in many econ. classes. \nThe subject is as far from quantitative as you can find in the department, so a great bet for anyone more interested in concepts than application.\nOne flaw in the class is that there was very little guidance for the group presentation and paper. He seemed to just listen and nod his head for every presentation. But he's definitely as easy grader, because my group missed every deadline and still did well.\nWorkload:\nfive simple problem sets, midterm, final, group presentation with 10-page paper on any contemporary issue of law and economics. The tests were simple definitions, short answers, and two problems (one extremely easy, the other slightly harder). Really good students finished both tests in about 15 minutes. They took me a while but I got an  A...felt more confident on the subject than anything else I did in economics.\n"
        },
        {
            "course_name": "Law and Economics",
            "review_date": "April 03, 2006",
            "review_content": "\nSimply put, the class is very good. Prof. Che is a good lecturer Â– slight accent, but no impediment to understanding. The topic is interesting, as are the lectures. Although I thought the fact that we all had to present on one of the topics would be a drag, presentations to date have actually been pretty interesting.\nProfessor is approachable, and more than willing to help with both problem sets and presentation materials.\nProblem sets are pretty easy though they convey the material well, and grading is not too harsh. \nOverall a really good class if youÂ’re interested in micro theory / mechanism design, or just law and econ. \nEspecially good when there are less than 20 students registered, and about half showing up!\nOverall highly recommended. \n\nWorkload:\nnot too heavy -  a few problem sets, midterm and final, presentation and paper.\n"
        }
    ]
}