{
    "prof_info": [
        {
            "prof_name": "Gerrard Bushell",
            "prof_id": 13624,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Cities, Government, and Politics",
            "review_date": "December 04, 2018",
            "review_content": "\nPOLS UN3921.006\nAmerican Politics\nCities, Government, and Politics\nGerrard P. Bushell\ngb28@columbia.edu\nThe Contemporary influences of American Cities in American Government and Politics \nWhat did you learn - in terms of knowledge, skills, or perspectives - in this course?\n--- Hospitals and Universities help the economic structure of urban cities. \nWhat is your overall assessment of the course?\n--Horribly structured. waste of my senior seminar. Structured as a lecture not a discussion. I still don't know anything about urban local governments I still can't even figure out the name of the course. \nWhat is your overall assessment of the course?\n-- POOR\nWould you recommend this course to another student?\n--Definitely not recommend\nSenior seminars are suppose to be like capstones. This class makes the political science department look bad. Not engaging, interesting or demonstrated what I have learned in my major. \nPlease evaluate Gerrard Bushell. \n--Not engaging at all, could hardly hear him speak. Spoke in circles without making much sense. Would ask a question regarding one sentence from one paragraph and expect that we all know what he is referencing when we had to read an entire book. Literally ZERO direction in the final paper. No office Hours or TA to consult. I had to go to an old Poli-sci professor for direction and assistance on where to start with my final paper and proposal since he was no help. \nWhat is your overall assessment of the effectiveness of the instructor?\n--POOR\nWorkload:\nHow does the workload in this course compare to Columbia courses with a similar structure (e.g. a lecture, seminar, laboratory, or language course)?\n--Similar workload\noh ya and NOTHING IS ON COURSEWORKS good luck finding these books they are outdated, old and not relevant to current times. So an even bigger waste of time to read \nHow many hours a week did you devote to this course? \nabout 4 hours per week for the reading. Final paper and proposal probably took me 40 hours. Depends how fast you can read and take notes on the reading that you will never reference again. All of the annotations and notes I took for the reading were not relevant for my paper so thus a waste of my life. \n"
        }
    ]
}