{
    "prof_info": [
        {
            "prof_name": "Karen Hiles",
            "prof_id": 2394,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "April 13, 2005",
            "review_content": "\nKaren is a great teacher, and a really nice person. She's very interested in what she teaches, and is very accessible. She's a fair grader, too.\nWorkload:\nOne midterm, one final. Concert Report and another paper. Not a lot of work. Fair grader.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 15, 2005",
            "review_content": "\nEndlessly patient and attentive, she will engage any question and develop explanations to fit any mind. She is brilliant, teeming with nuanced understanding and an ability to get to the root of any student's confusion, yet she is wholly approachable, as professors should be, though often are not, at Columbia.  She's also a fair grader and favors a multiple choice format for the terminology sections of her tests (something non-music majors will adore). \nWorkload:\nTwo papers, one creative, 3-4 pages, and one analytical, 5 pages. Fair and prompt grading and good feedback. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2005",
            "review_content": "\nThis instructor is a gem- interesting, organized...she made a potentially awful class so enjoyable. Class at 9:10 became a pleasure. Very fair grader and always available to help, either in office hours or by e-mail.\nWorkload:\nMidterm, Final, 2 papers (concert report and first nights report), trip to the opera, rare hw assignments\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2005",
            "review_content": "\nProf. Hiles saved my Core experience.  She knows that she is teaching a general and required course and she sets her goals accordingly.  She keeps the readings short and the listening good.  Her lectures are lively and personal--you will leave the class feeling more like she is your friend than your teacher.  If you think that you might have trouble with Music Hum she is especially great since she is eager to meet with her students and spend lots of time reviewing.  She will even read drafts of your papers.  I highly recommend this course.\nWorkload:\nOne concert report (3-5p); one creative response paper (3-5p); midterm; final and some ungraded check-up assignments along the way.\n"
        }
    ]
}