{
    "prof_info": [
        {
            "prof_name": "Xiaobo Liu",
            "prof_id": 2652,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "April 22, 2009",
            "review_content": "\nXiaobo was a great Calc III teacher.  He made sure to teach everything in the book and everything that would be on the hw.  His lectures actually do apply to the hw.  HW was also not hard and the worst scores are dropped.  Take him for Calc III for sure!\nIn my class he even gave extra credit on the final cause on of the midterms was hard.  \nWorkload:\nWeekly HW(10 problems very easy).  2 Midterms(He gives sample ones that are very similar so just study them).  1 Final( Study sample final)  If you know how to do all the problems, you should see an A at the end of the semester.  \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "February 25, 2009",
            "review_content": "\nPretty decent professor. If you took him for Calc III, his teaching style is still the same. He teaches straight from the book as the other reviews have already mentioned.... so a bit boring. He goes at a good pace as well. You never really feel overwhelmed during lecture. Be warned of some differences though. For Calc IV, he posts practice problems that no longer reflect the midterms or final 100% i.e. It ISN'T like Calc III in which the practice exams were exactly the same as the real exams expect different numbers. So... be prepared for that. But as long as you know how to do the homework and the practice exam problems, you should be fine for the exams. Oh... btw... he has a Facebook, so add him for extra credit! jk, but I thought it's cool that he has a Facebook.\nWorkload:\nWeekly problem sets, 2 manageable midterms, and a very fair final. Workload is medium to low relative to other Calc IV sections. Take this guy if you get the chance!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 17, 2008",
            "review_content": "\nProfessor Liu teaches straight from the book, often using book example problems as his class lesson.  His lessons are relatively boring, but will basically ensure that you can do the homework. His accent is not difficult to understand and some of his mistakes are quite amusing. The exams are based on specific book problems, so if you do the homework, you'll likely do well on exams. The sample exams help even more, since problems are exactly like the exams, though be careful and don't become too focused on any version of a specific problem.\nWorkload:\nWeekly problem set of 8-10 questions, usually 1 more difficult problem; 2 Midterms with EXTREMELY similar samples provided; Final also has samples provided.  \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 16, 2008",
            "review_content": "\nXiaobo is what every teacher at Columbia should be like. He teaches directly from the textbook which makes it easy for you to refer to it when you don't understand something. During lecture, you just mindlessly take notes. You won't understand what he's teaching and where he's getting at, but when you do the homework, you'll understand everything. He gives breaks during lecture.\nAs far as tests, he gives a sample midterm/final the week before with solutions. The actual test will almost be exactly like the sample. All questions come from the textbook. \nWorkload:\nNot bad at all, just a problem set due every week. And they aren't too difficult.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 14, 2008",
            "review_content": "\nProf. Liu is a very relaxed teacher. His lectures are pretty much straight from the textbook and he's very boring. However, he is clear and thorough and gives you a short 5 minute break in the middle of the class. \nHe's also open to seeing students with questions and he has been very approachable. I went to see him to go over one of the midterms(I hate going all the way to Millbank math help center) and he was very patient. \nMidterms and finals are pretty much identical to the sample he gives in class to help you study. A good teacher if you want a good grade and just know the basic operations in Calc 3. However, not really a good choice if you'd rather have a dynamic teacher who challenges the students a bit with proofs or intermediate level questions. \nWorkload:\nWeekly short problem sets, 2 easy midterms, 1 final. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 13, 2007",
            "review_content": "\nWORST!!!!!!!!!!!!!!!, worst professor/ teacher i have ever had! yes the man is brilliant, and yes he is famous but he still doesn't know how to teach. maybe its a language barrier!!!if you want to learn don't take his class. you will pass but you wont learn anything you didn't already know or taught yourself. all he does is regurgitate the book and when asked to go further into detail or explain something ( other than word for word) he just gives a blank stare and smile. again, this is where the language problem comes in. in my opinion he's a nice but but horrible teacher and can't explain things well.\nunfortunately, if you aren't like most of columbia and haven't taken up to calc 3 in high school, he's not the professor for you. get used to hours upon hours at the math lab and meetings with ta. although, you will probably be happy with your grade just wait till you get to calc 2& 3. the whole point of taking calc 1 is to have a good foundation not just pass a class. thank goodness the people at the math lab.... oh and don't, if you make the first mistake, no matter how tempting take him again. when you finally do switch professors your grade book is in for it\nWorkload:\nhe doesn't assign much but the amount of time wasted in class ( which you have to make up) really isn't worth the energy. definitely use an outline from another class. i suggest Cohen. eventually, most people stop going to class after they realize you can still get an A without ever showing up\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 03, 2007",
            "review_content": "\nI highly recommend you to take this guy if you have taken Calc already in highschool, and is being a lazy bum by taking it again.\nAlthough he is not a good lecturer (you tend to fall asleep in his classes), he is a very fair and lenient grader.\nHis midterms/finals are very similar to his sample exams, so do the sample exams and you should be fine.\nThe exams themselves are not difficult and the curve is generous.\nHis accent isn't that bad (I mean, all the math profs are foreign anyway) and nothing beats his grading system.\nFinal Word: take Xiaobo for calc!!\nWorkload:\n10% Homework (weekly problem sets), 10% Webworks (10 in total for the semester), 20% 1st midterm, 20% 2nd midterm, 40% Final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 08, 2007",
            "review_content": "\nHe's a very nice guy, at first it was hard to understand his accent, but it got better as the semester went on. He gives you the option to not go to class, says it is your choice. Fair grading, fair homework assignments. If you don't go to class and read the book you should be fine, but I still found it more helpful to get the notes from class just because it helped me learn the material on the spot rather than have to learn it on my own. \nI really enjoyed having him as my professor and would definitely take another one of his courses.\n"
        },
        {
            "course_name": "Colloquium: Political Economy: Corruption and Control",
            "review_date": "March 30, 2006",
            "review_content": "\nProfessor Lu is a fine professor.  The course material is kind of dry, but Lu handles it well.  He's laid back and helpful when writing the final paper.  A very nice guy and very engaging.\nWorkload:\nWeekly responses to the readings, not a big deal, and a final paper... like any colloquium.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "March 30, 2006",
            "review_content": "\nReally found the guy not to be a good teacher at all. I scraped through the class by memorising the practice exams. This wasn't all his fault, as I had been misadvised by my program director, who told me it was an ideal course to take alongside Calc 1 (Calc 3 is a pre-requisite)\nI agree with the other poster regarding the obnoxious student, he was a class A prick\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 03, 2006",
            "review_content": "\nProf. Liu comes prepared to class with clear notes and only a very slight accent you get over by the end of the first lecture. He seems quite shy and many times fails to understand the simple questions from the students. In general, not a difficult class at all...although I'm not too sure how much I actually learned from it. He solely focuses on the methods and completely ignores the applications of Linear Algebra. Many times he fails to give clear instructions on his homework assignments whenever he decides to modify them resulting in a horrible homework average. For once I relied on the exams to get a decent grade. Basically, go to class the second half of the semester to get certain concepts clarified and make sure to memorize the practice midterms/final since they are pretty much exactly like the actual exams. \nWorkload:\nweekly problem sets(15%) ranging from riduclously long to pretty short, two miderms(25%,25%), and a final(35%)\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 27, 2005",
            "review_content": "\nFirst off, the man can't speak english well at all, which is a big hinderance as a professor and can be extremely funny when annoying nerds try to ask unneccesarily complex questions. That said, I liked the man. He was funny and brutally honest with his students (which I appreciate). I went to class about half the time, and his lectures were only marginally more useful than the book. His midterms and finals were basically the exact same as the practice tests, which (obviously) was very helpful. Anyways, another math professor who can't speak english and a class where you don't have to go, but I thought he was a little funnier than most and I ended up liking the guy (even If I was completely unable to communicate with him).\nWorkload:\nWeekly p-sets out of the book (15%), two midterms (25% each) and a final (35%)\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 25, 2005",
            "review_content": "\nProf. Liu is new to the Columbia Math Department, and he did an excellent job in Linear Algebra for Fall 2005.\nHe followed the textbook (Linear Algebra, by Steven Leon) closely, but this is good thing because the textbook is well-organized and contains the right material.\nFirst, his lectures were great.  Prof. Liu improved upon the textbook by clarifying a lot of the explanations, especially the proofs, where the textbook fell short.  He is very well-spoken, and he explains complex concepts very clearly.  Professor Liu was also a very friendly guy personally.  He should be commended on the fact that he included in the class a detour into mathematical logic.  It was very eye-opening, helped a lot with the proofs we had to do, and it will likely pay dividends in later math classes.\nI have two very minor complaints: First, the class was at 9AM, so everyone was exhausted, and I think that a large chunk of the class just skipped the lecture (probably at their own peril).  Second, there was this obnoxious student (who said he already knew linear algebra) who would sit at the front of the room during each lecture and guffaw and sigh at Prof. Liu while he was lecturing.  Sometimes, this guy would fall asleep and snore, and sometimes he would get up out of his seat and stamp loudly as he walked out of the room (he said that he was bored and he thought that the material being taught was too easy for him -- which raises the question of why he's in this class in the first place).  Prof. Liu was always very classy about it and ignored this student.  But, honestly, no one should have to put up with this kind of regular disruption, and I wish that Prof. Liu had told this guy to shut up or not attend the lectures.\nThere were weekly homeworks (15%), two midterms (25% each), and a final (35%).\nThe homeworks were incredibly long, and, towards the end of the course, they took at least twelve hours each, due to both the number of questions assigned and the computational intensiveness of the material.  Although I did not like it at the time, now I'm not sure if the length of the homeworks was such a bad thing, because they provided so much practice before the exams.\nThe two midterms and final each contained one proof, and I think that everyone found this to be the hardest part.  However, if you memorize the proofs in the book and lectures in addition to the proofs that you must do in the homeworks, you can always easily adapt them in order to get the proofs on the exams.  The other questions on the exams were fair -- not horribly difficult, not too easy.\nIt is very difficult to teach Linear Algebra well -- there is a severe trade-off between understand and rigor.  However, I think that this particular textbook (by Linear Algebra, by Steven Leon) and Prof. Liu together pulled it off without much loss of either one.  I don't think that you will find a Linear Algebra class anywhere that is better than the one Professor Liu gave.\nWorkload:\nWeekly homework assignments (15%), two very fair midterms (25%), one very fair final (35%)\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 23, 2005",
            "review_content": "\nI wish I could say a lot about this professor, but, after the first two classes, I made the rational decision that any CU student should be capable of and stopped going to his lectures. I'm sure Liu might be a great person, but he is as good a professor as a random man picked off the street, given a textbook, and put to the blackboard. His lectures are straight out of the book, word for word, and so are the examples he gives in class. I remember on one occasion he could not even solve the example he gave in class (which, once again, was straight out of the book). So you will probably be more productive reading the material on your own. He has a mild language problem, not too bad though. \nTAKE LIU'S CLASS if you have insomnia problems. He talks to the board and is hard to hear- this droning will help you fall asleep nicely and easily. You can be sure that the rest of the class will be joining you in your nap, too. And I mean, everybody stops going. Out of my 40-ish people class, only about 10 actually came to the final review. So if you can manage to get your homework done by studying on your own (and attending lectures would be a big mistake and waste of time), you'll be okay. The course is relatively not too difficult, def. more fun than calc2 but can be demanding if you are weak on conceptual thinking and doing proofs. Liu- BORING but innocuous.\nWorkload:\nweekly hw sets, typical of any problem set you get for science/math class, not too bad; 2 midterms and a final- each of these exams completely paralleled the sample test he posted on the website, not too bad\n"
        }
    ]
}