{
    "prof_info": [
        {
            "prof_name": "Sarah Lazur",
            "prof_id": 4861,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French II",
            "review_date": "April 12, 2010",
            "review_content": "\nJ'ADORE Sarah. She obviously has a lot of fun teaching, and that is infectious, even when she's teaching a class full of half asleep/sometimes hungover students at 9 am. She's bubbly and charming and obviously cares both about the French language and her students. Plus she's super nice and very understanding. She'll give you an extra credit opportunity near the end of the semester which will help if you've slacked off on attendance or something. As a grad student she's obviously working within the boundaries set by the French department, but she does her best to make what is for quite a few students just something to fill the language requirement an entertaining and worthwhile experience.  \nWorkload:\nShe teaches off the the standard syllabus set by the French department, so, regular chapter quizes, and short midterm, a long final, and an oral presentation. Short compositions due every other week or so.  \n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "January 24, 2009",
            "review_content": "\nSarah Lazur is a really nice person and a lot of fun.  She was always prepared for class and brought in videos and music that were contemporary.  I learned a lot during a relatively short period of time.  She also hosted \"Crepefest\" for our class on a Friday evening.  The homework assignments are what you can expect for a language class. I would definitely take one of her courses again.\nWorkload:\nTypical for a language class.\n"
        },
        {
            "course_name": "Elementary French I",
            "review_date": "December 28, 2008",
            "review_content": "\nSuch a fun professor. I loved her. She makes learning French fun. Expect to learn by watching music videos and expect emails with stuff to watch for fun (like a french version of the Simpson's \"Spider Pig\" and music videos from Yelle). She is a normal grader and truly wants to see her students succeed.\nWorkload:\nQuizes every once in a while, 4-5 tests (you will be well prepared for them simply by showing up to class and doing your work), a midterm \"interview\", a final presentation, a LONG final, and weekly workbook activities.\n"
        }
    ]
}