{
    "prof_info": [
        {
            "prof_name": "Sharon Marcus",
            "prof_id": 1845,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 21, 2016",
            "review_content": "\nIf you have Prof Marcus for CC, you are very lucky. She might be scary at first, and requires written responses emailed in before every class (with citations!) but this is to make sure the majority of the class has a good enough understanding to have a good discussion.\nShe leads discussions amazingly well. Even if I barely got a text reading it myself, I always came out of a class with a much better understanding of the author's argument, assumptions, weaknesses, and how it relates to broader issues. I took this class spring 2014, and now looking back and reading some of my responses and essay, I realize how much the class has prepared me for other philosophy courses by teaching me how to think creatively. Prof Marcus really brings out the best of her students!\nThis being said, the workload is definitely heavier than other CC courses, but you will be rewarded for your work. If you are interested in philosophy and willing to put in effort, this class is for you. If you want to blow-off CC class, then it's not. This class probably embodies what the Columbia core wants to do for its students.\nProf Marcus also stays after class every time if you have questions for her. She's pretty accessible despite being the dean of humanities, but if you want to meet her outside class you'll have to schedule and not just drop in.\nWorkload:\nWritten responses (about a page) for every class, with citations. Midterm, final, one essay, one presentation.\n"
        },
        {
            "course_name": "19th Century English Fiction",
            "review_date": "January 08, 2013",
            "review_content": "\nI can't say enough good things about Sharon Marcus.\nI took her 19th Century English Novel class this semester and, despite my initial misgivings about a 60-person English class, I ended up loving this class and this professor.\nFirst of all, she is an amazing lecturer. I've always liked small English classes with a lot of discussion, but every day I would walk into this class and sit there entranced for 75 minutes. She clearly spends a good deal of time preparing her lectures, and they are brilliant and cogent and really elucidated the novels. She still encouraged class participation and was receptive to questions and comments. \nDespite the large class size, she was always available during office hours to talk about anything--life, career paths, religion, you name it--and just generally had a lovely demeanor. \nShe gave a ton of feedback on the papers (though you might have one of the TAs as your grader) and offered extra credit assignments to give us opportunities to improve our writing/analytical skills. \nThe novels themselves were fantastic; she introduced a few literary theories on the novels every class, but mostly focused on the novels themselves. \nGoing to lecture really helped with the final because the prompts all addressed ideas discussed in class. (You should also never miss a lecture, because, as I mentioned above, Marcus gives fantastic lectures and you're doing yourself a disservice if you miss them). \nDon't take the class if you want an easy A or if you think you can skip the lectures and still do well. If you do the reading and attend lectures you'll be fine.\nAnd go to office hours!\nWorkload:\nSix novels (down from the original seven because Marcus perceived that we weren't doing all of the reading), which ranged from relatively short (Northanger Abbey) to quite long (Daniel Deronda). Very reasonable workload. \nYou need to do ALL of the reading for:\nTwo 8- to 10-page papers (each had to be on two books and the four books could not overlap), and \na take-home final, which required short(ish) essays on six prompts (which means you have to write one essay on every novel, so READ ALL THE BOOKS).\n\n"
        },
        {
            "course_name": "19th Century English Novel",
            "review_date": "January 02, 2013",
            "review_content": "\nProfessor Marcus is an AMAZING professor. She is a fantastic lecturer, nice in office hours, and unbelievably knowledgeable in her field (seriously, this woman's a genius). I don't think she wastes even a minute of lecture, ever -- I was basically taking notes the entire time to get down everything she was saying. She provided really thorough analysis and insight into the novels we read (the structural analyses she does are really amazing) but still made some of the more daunting novels (i.e. Daniel Deronda) approachable. \nWe read six novels over the course of the semester, with 3-4 classes (about 2 weeks) devoted to each. Marcus cut the seventh novel because she realized less and less people were keeping up with the reading, i.e. she's very understanding (the only time she wasn't was when she expected us to have read 200 pages of the next novel the same day one of our papers was due). She covered a lot of different themes/ideas (like marriage plot, realism, gothic elements, technology, etc.) and introduced a bunch of literary terms like physiognomy and exegetic/diegetic time, etc. She also did a really great job making the course come together, by showing similar themes in novels and how each author related historically to one another. \nWorkload (mostly reading) got heavier as the semester went on, because the novels got longer and other classes also simultaneously got busier. The first we read was Northanger Abbey which is fairly short so we were only reading 60-80ish pages for each class, but we read The Woman in White about halfway through the semester which was like 150-200 pages per class. However, novels were enjoyable and reading was flexible in that she would say to read x amount of pages for a certain class day but if you were a bit behind it was alright. She tried to not spoil the end of the novels for those who were a bit behind. \nTwo 8-10 page essays, one after the first three novels (around midterm season) and the next due at the end of the semester. She always gave topics pretty far in advance (around two weeks, sometimes more) so you have plenty of time for brainstorming, running ideas by her/TAs in office hours, and if you bring in an outline or a draft to office hours/class (no email) she'll look it over. The TAs are super cool and super nice, also. The same person (either her or a TA) grades both of your essays, and then I think the grades are streamlined at the end since each person reads every essay. Essays are graded kind of difficult (you have to have a really flawless essay to get the A, I believe), but the final is easy and she offers some extra credit opportunities, if you're on the borderline of a better grade she'll bump you up if you've been going to/engaging in class. \nOverall, the class was amazing, and I'll definitely be looking out for more of Marcus's classes in the future. I'd agree that she sometimes covers the material so thoroughly it's hard to find something to write about (she tells you not to write your papers about anything discussed in class) but the paper topics are good and more importantly, there's a lot of learning both on the reading and writing fronts. She seems a little intimidating in lecture because she's such a genius, but super nice and helpful during office hours! Also syllabus was fantastic - Austen, Bronte, Dickens, Eliot, etc. \nWorkload:\n25% Essay 1, 8-10 pages\n35% Essay 2, 8-10 pages\n40% Final exam, easy -- you get 48 hours for it but it takes maybe 6-8 (6 questions so about an hour each question plus some time spent preparing beforehand). Regurgitation of lecture so make sure to take notes, and I'd advise writing down page #s she says in class so during the exam you don't have to spend a lot of time looking for in-text examples\n"
        },
        {
            "course_name": "History of English Novel II",
            "review_date": "July 09, 2009",
            "review_content": "\nSharon Marcus has an amazing wealth of knowledge about Victorian fiction. She makes what can be extremely complicated novels, such as Daniel Deronda (Eliot) and Barchester Towers very approachable.The only issue is, sometimes, Prof. Marcus gives such a thorough lecture that it is hard to choose a paper topic which doesn't address examples or examine similar themes as those Marcus discusses in class. Professor Marcus was very willing to meet with her students outside of class, and made even non-English major students, such as myself, feel fully equipped to discuss and write about masterpieces of 19th century fiction. \nWorkload:\napproximately 2/weeks or 3-4 class sessions per book. 1 quiz when people seemed not to be doing the reading. 2 8-10 page papers. She (and her TA) are not easy graders. However, it is possible to submit drafts for comments prior to handing in final papers. \n"
        },
        {
            "course_name": "19th Century English Fiction",
            "review_date": "January 30, 2004",
            "review_content": "\nWow.  If you like reading and don't like writing, this is the class for you.  Seriously.  All we had to do was read a book every week/week and a half and write 500-750 words on it.  I'm not sure she realized how little work that was, but it was her first semester so she'll probably change her ways.  She delivered very interesting and organized lectures, though mainly on the same topic (marriage), and used discussion as well.  She made an effort to get to know everyone's name, which I guess people here think is great.  So overall, take a class with her, it's worth it b/c you don't have to do much but read enjoyable books.\nWorkload:\nNonexistant.  No midterm, no final, just those little papers every once in awhile.  Crazy, huh?\n"
        },
        {
            "course_name": "19th Century English Fiction",
            "review_date": "December 09, 2003",
            "review_content": "\nProfessor Marcus just arrived from teaching at Berkeley. She is articulate and well organized. She managed to keep  me awake and keep my attention even though class was at 9 am.  Her choice of novels was diverse, and her lectures always enhanced whatever novel we were reading. She came off as slightly severe in the beginning of the semester but softened as time went on.\nWorkload:\nLots of reading and writing.  About 8 long novels with a 2-3 page paper on each one. Topics were always specified and usually interesting. No midterm and no final.\n"
        }
    ]
}