{
    "prof_info": [
        {
            "prof_name": "Thomas Roma",
            "prof_id": 221,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Photo I, Photo II",
            "review_date": "October 11, 2017",
            "review_content": "\nI took Thomas Roma's Photography I class over five years ago. I am, in this very moment, listening to Richie Havens cover of Jerry Merrick's \"Follow\" (something only those of you who have already taken Roma's class would understand). You might be wondering why, after such a long time, I am now writing a review. To be fair, I have always wanted to write a review for his class. Probably since the first day I met him, which was when he was selecting his upcoming class roster, which he did while concurrently complaining that he was being forced to accept virtually all seniors (I was a senior at the time). \nI left Columbia for four years during my junior and senior year to pursue a life in another art form. When I returned to Columbia, I had quite a bit more experience than most Columbia undergrads. Upon my return, I had heard that Thomas Roma was an artist (a term I do not take lightly), and I was immediately drawn to him. For those of you who are wondering if the mentioning of Photo I on your resume will be hard to explain to your future bullshit employers or to your parents, please, just please, don't sign up for this class. This class is not for cowards. If you intend to live a cookie-cutter life, good luck. I am instead speaking to you young people who are drawn to the idea of Thomas Roma because you seek meaning beyond your dumbass GPA or your intro base salary. You may not understand this desire, whether it is real or merely some figment of your self-described \"privileged, first-world problems.\" But you are drawn, and this is the class for you.\nI majored in philosophy. When I was a second semester senior during my high school years, I recall telling an elderly alum that I was intending to major in econ. He scoffed at the idea of majoring in econ. He said, \"Do something more interesting.\" I thought to myself, \"f--- this guy.\" Well, the first year, I was an econ major. Second year, first semester, I had an existential crisis. Second year, second semester, I checked to make sure I still had my balls, temporarily became an econ-philosophy major, subsequently realized I was half-assing it, then demanded myself to pursue the one major I actually gave a shit about: philosophy.\nThomas Roma is on my mind now because I have been in the real world (as a performing artist) for quite some time. Every year, I get more rejections than successes. But for the past year, I have grown tired of my failures. I have lost the anger and drive that I immediately felt after every failure I had, which, in the past, I used as fuel to catapult myself to the next level. I have become apathetic. I have become an artist who thinks only of clocking in and clocking out, the very thing I despised that led me to my path in the arts.\nSo this is why I think of Roma now. He is perhaps the only artist who has not only been able to sustain his interest in his artistic expression, but also in his ability to speak so enthusiastically and eloquently about his pursuit, as if he is now just starting off in his career. You're not going to be a photographer. Who gives a shit if you can take a great picture. He will teach you what it means to express and to care. \nMany of you are too young to know what I speak of. Many of you are too stubborn to even consider the notion of apathy. But the real problem for an artist is not whether you will be able to withstand the pain of failure. It will be your ability to resist the urge to not care. \nI am desperately trying to shake this apathy from my soul. The memory of Thomas Roma might be one of the few things that could help me. \nWorkload:\nIf you're worried about this, please, just please, go take a class that will guarantee an easy boost to your GPA.\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "April 28, 2017",
            "review_content": "\nProfessor Roma is without a doubt the single most influential professor I have had during my four years here at Columbia. He is a kind and wonderful human being. He is dedicated to his students, his craft, art, family, music. Everything he does he does for a reason and with dignity.\nThe stakes of this class are high. Professor Roma treats his students with respect but he expects you to fully commit to his classes. He believes that everyone who walks into the first class of Photo 1 is an artist and he treats them as such. That means students are expected to be able and willing to be intimate and vulnerable with their photography. If you are unable to do that, or unwilling to do that, do not take this class. \nWorkload:\n8 prints a week for Photo 1. This is a lot of work, but doable. Professor Roma will have you obsessing about his class constantly. \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "May 24, 2015",
            "review_content": "\nThe previous reviewer basically articulated all of my thoughts about Roma word for word. I must give him more credit though. \nTaking both of the classes that he offers to his undergraduates, I can assure you that Roma certainly embodies the term \"cult of personality\" more than any other professor I have encountered throughout my time year (I have another year left, but I doubt I'll meet any professor that matches up to Roma's charisma). However, while I must say that, yes--my photography has improved after taking both of his courses, I do wonder how much I (and others who listen to his every word with the assumption that they are words of wisdom) could have improved even more if such a large part of my time in those classes was not spent on listening to his musings like a disciple. Especially with his Photo 3 seminar--which is handled much more leniently than Photo 1--where much of the class is spent on chatting with Roma and there is much less pressure to produce work consistently. As a result, I found myself scrambling at the last minute to put together the final project for that class. If you really want to improve your photography, definitely reach out to Roma with specific questions and he will answer them, as well as the TA's. The TA's provide the helpful/technical counterpart to Roma's philosophical take on the classes. But of course, Roma is not a world-class photographer for nothing, he is of great assistance if you badger him in your office (which he loves!). Don't be fooled by his intimidating and bully-ish aura (though you inevitably will be at first), he is honestly a very kind and dedicated person who is ready to sit with you in his office for hours and feed you yummy cannolis during the seminar. \nIf you're gonna take Photo I, definitely try to take it with Roma, simply for the fact that it will be a standout class in your Columbia experience, regardless of how much you end up liking/not liking it. Be prepared to seek out for help on your photography skills and don't fall face first into the trap of Roma's charm. Definitely listen to what he has to say but don't assume that everything he speaks is passed down through God. Like the previous reviewer said, he gets away with a lot more than other people do.\nP.S. Don't be afraid to disagree with Roma on something he says! He is (somewhat) open to engaging debates.\nWorkload:\nPhoto I: 6-8 prints for critique every other week. Mid-term quiz that is an analysis of a photograph. Come to each critique prepared to ask Roma about any question, in which he will respond with his untested words of wisdom.\nPhoto III: You make your own photobook for the end of the semester. A lot of little in-class assignments (some filming is done). About 7 guest speakers in which you need to prepare a question for them. \n\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "March 01, 2015",
            "review_content": "\nThis class should not be called Photo-I, it should be called Thomas Roma-I. If you want to immerse yourself in a semester of Thomas Roma, take this class. Incidentally, if you're lucky, you might learn some photography as well. Thomas Roma embodies the phrase \"cult of personality.\" He is quite the personality: funny, witty, mean, kind of like the extremely self-assured bully. But I do believe that having high standards and expecting people to live upto them is a good thing, and definitely developed me in some way. Having been the recipient of a number of brutal critiques, that often left me questioning my entire personality, I was definitely inspired to really think about why I was putting up the works that I was putting up and what they meant and in this sense the class was better than other workshops I have been in where professors are nice to your work whether they suck or are good. So as opposed to other people who didnt like him, I really was grateful that he was honest with his critique and called out things that sucked for what they were.\nDid my abilities as a photographer improve in this class. Yes. However, the price one pays to obtain this in terms of feeding his enormous ego is almost not worth it. In a 2.5 hour lecture he spends about an hour or 45 minutes actually talking about why your photograph is good or why it sucks and spends most of the time relating random (and probably made-up) stories about his life that have nothing to do with photography. In critiquing your photo not only will he insult your photograph if it sucks but he will also make it a point to directly insult your personality and you as an individual, which to me didn't really matter that much but was quite unnecessary wrt to improving me as a photographer and was done more for his pleasure. He is an individual who knows that his popularity and cult-status affords him power and he definitely uses this power to the maximum and gets away with a lot of stuff that no one really could get away with. Thus a lot of this class is in my opinion quite unnecessary. As opposed to the students who hung on every word he said as if he appeared in the clouds and ordered us to write all he said on stone, I was quite unimpressed by most of his stories. The most annoying part of the class was that we each had to ask him a question unrelated to photography, about his personal life, after each critique. So that is like 20 irrelevant stories per class already, not counting the ones he launches into during a critique. I kind of went there to learn about photography, not to fill his ego by laughing at and being audience to his stories about his girlfriends and mother and son and what-not. You have to really have drunk the Thomas Roma kool-aid deeply and fully to willingly sit through his lectures with wide-eyed wonder.\nIn short my opinion of this class is that there is a lot of bull-shit, a lot of unnecessary insulting but in the depths of all this there is genuine honest critique to be found and genuine honest growth as a photographers to be realized. And that is actually pretty rare to find. So my final verdict is take this class, but take it with a an entire spoonful of salt\nWorkload:\n8 prints a week. To get a good 8 prints a week you should shoot at least 2 rolls per week\n"
        },
        {
            "course_name": "Photo 1 & 2",
            "review_date": "March 30, 2013",
            "review_content": "\nIf you're not sure about taking this class:\nThere are only two kinds of people at Columbia. Those who have spent a semester with Roma and those who haven't. If you don't have a serious case of FOMO yet, develop one (no pun intended). Fast. Before it's too late. It's not about being a great photographer or knowing anything about cameras. It's about recognizing your own inhibitions and then violently murdering them. If you do it right, you'll never be the same. Don't be afraid! Go towards the light.\nPractical advice : \n - If you've never studied photography or looked at a photograph before that's more than fine, that might even be better, but learn the name of at least one photographer before the first day.\n- If you don't get into the class, keep showing up, he'll probably let you in eventually. \n- The TAs do 100% of the grading, get to know them. \n- Don't throw anything away. You're going to need your contact sheets and workprints for the end of the semester.\nThis class is not for:\n- People who need to know what grade they are getting before grades are released after the semester\n- Anyone who doesn't have a sense of humor\n- Anyone who hates music and/or poetry \nWorkload:\nHeavy, 8-10 photographs every other week, or sometimes every week. Small amount of written work. One or two qreview_content. review_content of your work at the end of the semester. \nGrading: Show up to every class, have photos every time you're supposed to, don't get defensive during crits, and you'll do well. Be aware that he doesn't give mid-term grade reports, so you won't know your grade until it's too late to change it. \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "December 16, 2010",
            "review_content": "\nTake this class if you want to do something meaningful with your life. Thomas Roma is extremely intimidating at first, but secretly is one of the most sincere, well-meaning and yes...even kindest people you will ever meet. Yes, he tears apart your work (sometimes literally) but somehow does it in a way that's so helpful you end up wanting the criticism. And it's not a weird masochistic thing. Because he's not attacking you, he's attacking the parts of you that you don't need, the aspects of your personality that are preventing you from communicating honestly with your photographs. It's basically a class on how to be a better human being. As he said in the last classes, it's Photo I but it's also \"Stop and Think About It I\". Just do it. \nWorkload:\nHours in the darkroom making 8-14 prints every other week, hours spent taking pictures- will take over your life a little but if you're serious about photography or art, you should let it (also- photopaper and manual SLR cameras are really expensive- be prepared to spend about $300 for this class- again, worth it) \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "April 13, 2008",
            "review_content": "\nYou are doing yourself a severe disservice if you leave Columbia University without taking a class with Professor Roma. \nThis is not in any way to say that Photo I will be an enjoyable experience.  You will leave this class at least once crying, if not from Roma's unrelenting criticism, than from the intimate, if brief, glimpses of truth that this man shares with his students. True, he doesn't give a shit about your feelings  and he's always quick to remind you of your inherent immaturity as undergraduate students, but in the end it doesn't even matter.  Take this class if you are creative in any capacity.  What he demands from you is basically to put the most secret and sacred page in your journal up on the wall for everyone to see.  He knows when you mean it, and you will too.  As long as you're at least partly comfortable with this idea, please, please take this class.\nWorkload:\n8 or more photos every two weeks (not from the same setting) and a midterm (written analysis of an unknown professional photograph). \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "January 23, 2008",
            "review_content": "\nTaking a class with Roma is like a theatrical experience.  He screams, sings, plays great music, recites poetry, and is undeniably funny, even if it is at your own expense.  He is immensely honest with his students about the details of his life - he ends critiques by allowing each student to ask him a question about literally anything but photography - and his stories will really make you think.  Taking a class with Roma was without doubt the best decision I have made at Columbia so far, as other reviews have said, and I recommend it to anyone with a backbone.  Go into critiques expecting criticism (EVERYONE is criticized), and when (*if*) he says something positive, it actually means something.  Another note:  he does not grade on the inflated Columbia scale.  Some people do the work and still do badly.\nWorkload:\nAs everyone has said, 6 - 10 photos a week.  But Roma will also having you thinking about his class constantly.\n\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "December 27, 2006",
            "review_content": "\nMixed feelings.  I agree with all of the positives and all of the negatives that have been stated.  It's all true.  If you're serious about your creative work, you may find this the single most useful class you take at Columbia.  If you can't handle burning criticism, you may find yourself hurt - damaged, injured, disabled - by this class.  If you can, you may find yourself incredibly inspired one week, bored the next.  \nI would add three damning criticisms, in terms of Roma's pedagogy, to those levied in other reviews:  1, in the end, it's very difficult to control your grade in this class, because the criteria are never clear, and they won't even discuss your midterm with you, let alone tell you how you're doing.  2, you have to make the TA's work for you or you're not going to learn much about the mechanics of photography - and yet, you'll be judged on those mechanics to some degree.  3, don't EVER argue with him during your critique.  Just nod and look like you understand, or you will be sorry at the end of the semester.  \nI'd say those three criticisms add up to a pretty negative picture.  And yet, I'm very glad I took the class, and I think most people are.  \nWorkload:\nRather intense, unless you're gifted.  In our class, he required EIGHT photos on the wall every two weeks.  That is quite a challenge.   There are two books you're supposed to read, but in fact, you're never tested on them.   \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "May 24, 2006",
            "review_content": "\nEveryone at Columbia should take Roma's class.  He doesn't really teach you anything directly, but somehow you end up with a better understanding of the world in general and definitey yourself.  And your photos will get way better, if you're into that.\nWorkload:\nPut at least 8 pictures up for critique every other week (or really whenever you feel like it--no one is keeping track).  After a semester of this, you get an A.  Everyone does.  \n"
        },
        {
            "course_name": "Photo I",
            "review_date": "May 07, 2005",
            "review_content": "\nyou will most likely have mixed feelings about this class.  Roma does provide a good intro to photography and you will probably be left a bit inspired by his brand of absolute truth.  but sadly, in the end, his rants get a little old.  his revolutionary attitude starts to wear thin when you realize the circumstances of his life, how he achieved success; how he spends his life making pictures for fatcats on the upper east, then lectures to their progeny.  in the end, his philosophies on life boiled down to admonishments to 'let go.'  i think there are more responsible and better informed thinkers, more effective teaching methods, more ultimately caring people [he doesn't even WANT to know your name].\nWorkload:\ntaking pictures...\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "January 23, 2005",
            "review_content": "\nFirst of all, Tom Roma is NOT an asshole; To be fair, I do agree with many of the contentious points about Roma made by the other reviewers. Yes, he is a tyrant, but  you will come to the realization that it would actually benefit  you to take down and burn into your brain the rules and life credos that he has gleaned from his rich life, and apply them to your own.  .... for Roma does not teach Photography; he teaches life, and how to live it. (I know it sounds corny, but it's true.)\n  And make no mistake-- he Loves teaching and his teaching is a gift that he wholeheartedly offers to his students. The gift he gives may come in dirty, recycled, and unattractive wrapping paper, but the gift itself, if you bother to open it, is raw gold.\n Do yourself a favor, and TAKE A CLASS WITH THIS MAN. It might hurt a bit, but you will grow as a person as a result. I especially recommend this class for artists and seekers, but people interested in still and motion picture obviously will benefit as well.\nWorkload:\nDon't expect to learn the basics of photography all semester-- you will know how to develop & print  by the second week. You're even better off coming into the class knowing this stuff already. Roma doesn't spend more than a class and a half on it; that's what the TA's are for. Do be prepared to produce a roll or two a week (*rolls are 36 frames); developed, proof-sheeted, and having at least 3-4 prints for crit presentation. I've been doing photography for 11 years now, and I can tell you: getting 2 good shots from 2 rolls is an accomplishment. Work hard and you will get A LOT out of this class!! You will get out what you put into it.\n"
        },
        {
            "course_name": "Photo 1 & 2",
            "review_date": "March 29, 2003",
            "review_content": "\nBeing an artist isn't easy & Tom Roma, thank G-d does not pull any punches.  He is brutally honest but his vehement critiques are actually manifestations of passion & love.  It may take you a while to see it that way --as your ego may be bruised along the way-- but if take his class and you will.\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "February 18, 2003",
            "review_content": "\nthe first reviewer had it right.  roma is a tryrant, and he wants it that way.  but if you take the class, you might learn something worth thinking about......\ntheres no point in being afraid of the class, as long as you know what you're getting into.  prof. roma has a powerful personality, but he is the same person who is obsessed with robert frost.  if you cannot relate to this, too bad, maybe the class really isnt for you.  if you think he sounds interesting, he is.  the incessant and adamant opinions that will arise in roma's wild speeches and critiques display, if nothing else, his intense passion for photography and for his teaching.  i wish other professors had such passion for their work, and were so hilarious during class.....\nphoto 1 with roma is hard, and creates a lot of anxiety. (although  the criticism isnt as painful if you are wise enough to give up your prints the instant you pin them to the wall) amazingly, everyone's photographs get exponentially better by the end of the class, regardless of how they started. \nin the end,  you gain from the class what you allow yourself to lose.....\nps.  to art majors: do you sometimes get the feeling that no one is EVER honest about the work that is up on the wall?  do you ever just wish the teacher would, for once, tell the truth about that piece that everyone knows is terrible?   this class has, as mentioned, brutally honest critiques, but it can be a relief, in a way, even when it is your own work that sucks.\nWorkload:\nshoot three rolls+ of black and white film per week, plus processing and printing which takes several hours.  critiques of half the class held every week (meaning that each person presents 6-10 prints every 2 weeks)\n"
        },
        {
            "course_name": "Photo 2",
            "review_date": "January 28, 2003",
            "review_content": "\nI took this class two years ago and I still have nightmares about it.  I sleep with the light on now.  I learned more about photography from Roma than I have from any other source, but he is a genuine asshole, don't be fooled.  He knows what a good picture looks like, I'll give him that, but honestly when I saw his own work for the first time, I almost laughed.  I thought it was a joke, it was so horrible.  He got where he is today out of sheer charisma and dominance, not because of the quality of his photographs.  But back to his teaching - if you cry easily or don't love (Love!) criticism, don't take any course with him, even Photo 1.  Walk out after the first day, it's not worth it.  There are other, more nurturing, art teachers out there - it depends what you need.  A lot of people love Tom Roma, and in every class, he'll always have a few groupies that can't wait to kiss his ass.  Also in every class will be the group of kids sitting quietly in the back, glaring at the horrible man.  He will tell you that YOU (not your photographs, YOU) are a horrible person, he will rip your work off the walls, he will embarass you in front of the class (and, yes, everyone will surely laugh at you because goddammit, Roma's witty).  He's a cool guy in every way, really.  But the problem is that he's a big jerk in the classroom and he loves being that way.  Good for some, crippling for others.  So you be the judge.  It's an experience you won't forget.\nWorkload:\nabout 6 new prints every other week, but if you skip a week later in the semester, he probably won't care/notice.\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "January 12, 2003",
            "review_content": "\nRoma is no joke.  He is frustrating, difficult to work with, and you will curse him many a time outside of the classroom.  However, it cannot be denied that he knows his craft...he is damn good.  If you are a major or concentrator, know that your path will be extra difficult.  AND...if you have issues about being corrupted and cloned into a \"Mini me\" version of Roma do NOT sign up for this course.  I think his ultimate goal is to have little Romas running around the department spewing Romaisms.  Heaven help us.  But then again...he's good.  dammit.\nWorkload:\nHa.  You're going to have an intimate relationship with the darkroom.\n"
        },
        {
            "course_name": "Photo I, Photo II",
            "review_date": "December 31, 1999",
            "review_content": "\nThe guy who started the Photo program at Columbia is also an immensely successful professional photographer. A tyrant in every way, you either love Tom or you loathe him -- and believe me, many students loathe him. His classes are fascinating trips from one subject to the next, covering stories, legends, radical politics, and of course, how much your photographs suck. In the end, he really knows his shit, and can talk better than anyone I've ever met about what exactly it is that sucks about my work. I would say he is the best teacher I have had at CU; some would say he is the worst. He wants it that way.\nWorkload:\n8-10 new prints every two weeks. Note that the course will cost you $200 or so in outside fees for your own photo paper, etc.\n"
        }
    ]
}