{
    "prof_info": [
        {
            "prof_name": "Martha Kim",
            "prof_id": 4221,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "December 27, 2016",
            "review_content": "\nHer class was my absolute favorite in the CS core. \nHer lectures were crystal clear and the workload felt like the perfect amount. It was challenging enough that it would genuinely help me apply my knowledge of the material, but it was not overwhelming like in many of the other CS classes.\nThis is definitely one of those CS classes you can use to balance out your heavier classes. \nThe first half of the class is said to be easier for the Engineering people, and the second half of the class is said to be easier for the CS people. However, I found the first half to be easier (and more interesting/fun), and I am a CS person. So, this may or may not apply to you. \nProfessor Kim makes all of her slides available online, so you can take a peek at the material beforehand to get an idea of what the class will be like.\ntldr: The class is one of the lightest in the CS dept. She is a clear and approachable lecturer. Take a class with her if you can!\nWorkload:\nPsets and tests, one HW with MIPS\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "January 22, 2015",
            "review_content": "\nProfessor Kim was a great, engaging lecturer. She was clearly working hard to make sure everyone in the class understood the material, and showed a level of commitment to teaching that's unusual at Columbia.   She offered very clear and thorough explanations of topics. She took many questions during lecture, and answered them quite well. She was incredibly patient, including spending lots of time in office hours answering questions.\nI didn't work with the TAs much, but they seemed to all be pretty decent, and were generally very responsive on piazza.\nI felt like this class was the easiest in the CS core, along with CS Theory. However it was useful and I found it kind of fun. I would have actually appreciated slightly more workload, and slightly harder exams, since a tiny mistake could have cost you a lot given the structure.\nOverall I highly recommend Kim.\nWorkload:\n6 homeworks. Most of them were quite easy, one took under 30 minutes.\n2 \"midterms\" this semester - I think due to her pregnancy she didn't have a final, but had a \" second midterm\" on the last day of classes. Both were easy, which very averages of like 90%+. \n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "December 19, 2014",
            "review_content": "\nProfessor Kim does a really good job with this class. If you have a decent CS background it shouldn't be too challenging -- you don't even have to go to class if you read the textbook, because she follows it very closely -- but it's pretty neat finding out what happens below the level of the level of C code. Professor Kim is a good lecturer and really good at explaining tricky concepts to the greener students.\nIf the class hadn't been at 10 AM (waaaay too early for this senior) I would've gone more often and likely gotten a lot out of it. When I did go, Professor Kim would mention neat factoids not covered on exams but still good to know, like (my favorite): Intel kept adding more stages to its pipeline in the '90s so it could ramp up its clock speed, and had to change its advertising strategy to deemphasize clock speed when it turned out fewer stages was optimal and clock speeds decelerated as a result.\nWorkload:\n6 reasonably easy homework assignments, lowest 1 dropped. One of them is coding in assembly.\nMidterm and final, equally weighted, both fairly easy. If you paid any attention in class you should do fine on these.\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "January 03, 2014",
            "review_content": "\nI agree with the review below that Martha totally puts in 110% effort to give good feedback and make sure the class runs as smoothly as possible. A further example is that when she found out that her final letter grade script had a bug in it, she sent personal emails to anyone who contacted her about it (within 24 hours on top of that) and promptly fixed the issue.\nWith regards to her teaching, I would say that she is not quite on par with Adam Cannon or Jae yet. However, in looking at her previous reviews and comparing it with my experience with her this semester, it appears that she has improved a good amount. My guess is that if she keeps refining her teaching skill, she can eventually teach at that level.\nOne thing that others have not mentioned is that you will be programming in MIPS Assembly Language for one of the psets. My suggestion would be to take AP (3157) before or at the same time as this course (I did the latter) since AP really gets you thinking in terms of lower level computing, which makes the assignment much easier. On the whole, AP and Fundamentals really seem to complement one another, so try to get AP in first or at the same time.\nWorkload:\n6 problem sets (5 theory, 1 programming) with lowest score dropped\n1 midterm\n1 final (non-cumulative, only second half material)\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "December 11, 2013",
            "review_content": "\nMartha is the kind of professor who doesn't mind reteaching an entire day's worth of material if students seemed like they weren't totally clear. She is also the kind of professor who takes in student feedback about ambiguity of problem sets, sends out the clarifications well before the sets are due, and changes how the question is worded so it will be clear for future classes. (Her slide sets are like finely aged wine.)\nShe gives eminently reasonable problem sets and tests (1 midterm, 1 final, noncumulative) and once got off an airplane to fix a glitch in her website that students needed to access for a problem set.\nShe also had a great sense of style, is genuinely and adorably amused by things like slow processors, and will explain things for you in multiple different ways until you get it. She's on par with Adam Cannon and Jae in CS-prof god(/dess) status. If you get her for fundamentals, be elated.\nWorkload:\n6 problem sets, 1 midterm, 1 final. All slides and psets are accessible online.\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "November 15, 2013",
            "review_content": "\nProf. Kim really cares about the students and their learning. I appreciated her approach to midterms and homeworks - there is always ample material to help aid your studying, and she and the TAs are very responsive via email. She leaves a day to review before the midterm, and we could send in questions to help direct the midterm review session. \nGrading seems very fair, and solutions are explained in class when we receive our homeworks back. \nThe material is nothing incredibly exciting, but Prof. Kim does a good job breaking it down into understandable chunks so that it's not too overwhelming at once. \nThe midterm was an accurate assessment of what we were learning in class, and the average was something around a 76 I believe, with many people scoring in the 80 and 90 ranges. \nAdditionally, there is no required textbook, and she only expects you to know what she covers in the slides, which was a relief when studying for the midterm.\nOverall, solid class. I have no complaints.\nWorkload:\nNot too bad. 6 homeworks, lowest  grade is dropped. One midterm, One final. Homework assignments are somewhat time consuming but it is very manageable if you've been paying attention in class.\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "October 09, 2013",
            "review_content": "\nMartha Kim is fantastic for several reasons:\n1) She is a VERY clear lecturer; she teaches directly from slides that on their own are very descriptive, and goes through them at a pace that is easy to follow. She is extremely eloquent and obviously very knowledgeable about the subject material, so it's really easy to follow and engage with what she's saying; she's not one of those awful lecturers who you have to really actively try to pay attention to for the whole class. She intentionally goes over slides with diagrams a little longer than other slides so that students who like to take notes have time to copy them down. There was one day when she had to rush through how Karnaugh maps worked, and in the next class she apologized for the lack of clarity and spent probably the first third of that class re-explaining them and really making sure everyone understood what was going on. If you go to class (and are at all awake/paying any amount of attention to her) you will understand the material. Point of the story: her lecture style is succinct and easy to follow and if you pay attention in class she will teach you the material.\n2) It seems like she really genuinely wants everyone to succeed. She holds more office hours than any other compsci professor I've had and every time I've gone she is really approachable and has seemed genuinely concerned about making sure I am not confused about anything (not to mention she's just super nice). She assigns a very reasonable amount of work because she doesn't want the class to be a source of unnecessary anxiety for students. That being said, the assignments are challenging enough that they definitely do make you learn the material to do them (which I think is a good thing). This is not an easy A class. You will have to do work. But she actually wants you to do well at it, which is definitely not true for every professor at Columbia.\nThe only bad thing I have to say about the class is that the problem set grading has been a little haphazard - on the first assignment, the grading was really harsh, which a lot of students made a big fuss about; then on the next assignment, the grading seemed really easy. But this discrepancy in grading tolerance seems to stem from the TAs more than Martha Kim. \nOverall, she is very intelligent and also very nice and I think she's been a fantastic instructor for Fundamentals!\nWorkload:\nPretty much what you'd expect; Nightly readings which you don't actually have to do but can be helpful for doing the assignments, which are roughly bi-weekly problem sets that take about 3-7 hours (depending on how fast/focused you work on them), a midterm, and a final.\n"
        },
        {
            "course_name": "Principles and Practices of Parallel Programming",
            "review_date": "January 23, 2013",
            "review_content": "\nWell, I am tempted to write this review because I dont want people to just live in ignorance that she happens to be from a great school/university and she can teach well.\nWELL NOTHING APPLIES.\n Also, because I am many of my friends got poor grades that costed me GPA and later job, I want to put my views/feedback/complains for all of you to view.\n1)This course can be done in 30 minutes essentially. What I mean is that you wont learn anything great here except simple synchronizations mechanisms, which if you do 1 or 2 good problems, you can learn.\n2) Whole purpose of \"Vijay Saraswat' and IBM crap to teach this course is to get their language i.e. X10(that you are suppose to struggle to learn in this course) their research project @IBM famous in academia. NOTHING ELSE. There is not even documentation worthwhile reading for X10.\n3) They have no clue how to teach, but SEAS department is really dumb fuck department that allows such courses to happen even when intentions are very clear of parties involved in teaching.\n4)Martha kim is highly incompetent teacher. Her job in lecture hours will be just to sit back and reply to emails on her Mac. Once a while she would turn up to do announcements, afterall Columbia pays her for teaching.Really is that what she is required/supposed to do?\n5) Vijay Saraswat's bubble is to let people try 'TRICKY' problems and they will learn rather give tricky problems in quizzes or exams. Asshole, if that is what is required to be done, why are you in class and even taking this course. Is that how a course is supposed to be taught.\n6)I should say first Vijay and Martha should learn how to teach, take this course elsewhere say GaTech and then think about teaching.Assholes I just wasted my tuition hoping that I would learn something great. SHIT \nSeriously, I just feel so sad that Columbia being Ivy league could allow such cheap bastards to teach and even after complaints last year nothing was done ever to improve, except to remove exams from  course.\nNot worthy course to waste your tuition on.\nWorkload:\nIf you are good programmer already, you will be able to do relatively well, otherwise you will struggle like I did. It seems this year they tried to reduce workload, but frankly speaking, they wont teach you anything worthwhile. You will repent later like me for having taken this course under Martha and Vijay.\n"
        },
        {
            "course_name": "Principles and Practices of Parallel Programming",
            "review_date": "December 06, 2011",
            "review_content": "\nCourse without any textbooks/reference books\nOnly thing you can *rely* upon is class lectures that are nothing more than few lines long on topics that range from almost everything to everything in parallel computing.\nOne Instructor Vijay Saraswat is more interested in telling what X10 can do and what HE can do rather than teaching something that we could understand. One of the worst courses I took in all my life.\nVijay did not teach rather he just tested again and again what students know beforehand....everything he spoke only 3-4 in class could make out what he is talking about.Worst idoit I have every seen.Really sick of this person and unable to find suitable words to match culpa requirements.\nAll IBM bastards were equally crap and they were also not so interested in teaching but i dont know wtf..\nJust could not make out things unless you studied them beforehand(I mean in your undergraduate or so..)\nGot really really frustrated after taking this course, did not learn anything great here except some shit like asyncs , streams etc..\nDont take this course unless you have to just fulfill credit requirements and there is no other course to take.\n\nWorkload:\nheavy with assignments with stuff that they rarely teach in class well.He will just talk some shit in class about some sentences and give you to figure out rest....such an ass\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "May 18, 2011",
            "review_content": "\nThis class is basically two classes combined into one. The first half covers digital design and the second covers computer architecture involving learning elementary programming in MIPS assembly.\nThe Good: \nMartha Kim is friendly, approachable and helpful. She willingly answers questions in class and for the most part she answers them well - especially when it comes to the computer architecture, she knows her stuff well. She teaches from slides, and what's in the slides is pretty much what you're going to be expected to know for the class. The slides are easy to read and understand and have intuitive diagrams. A lot of the pictures are taken from the textbook. I found the course material interesting and valuable.\nWhat was wanting:\nThe lectures were mostly very boring. She spent a lot of time explaining trivial things that we could have understood better and more quickly by glancing over the slides on our own time. Most of the lecture was spent in teaching relatively straightforward concepts but almost no time was spent teaching us to apply them. In other words we did almost no real problems-solving or \"thinking\" in class. Any examples covered, were for the most part trivial ones. As a result, there was a gap between the lectures and homeworks and an even bigger one between the lectures and the exams. The lectures certainly prepared us very poorly for the midterm on which the mean was a 52 and which was so long that almost no one actually finished.\n6 homeworks in the semester, one assigned every two weeks, about 4 questions per homework. Given that we had two weeks between hwks, it was really very little work. I spent an average of 4-5 hours on each assignment, only about 2 of the questions out of 4 actually required thinking, although these ones could be tricky. The problem was that we didn't have enough of these questions and didn't have enough homeworks so when the midterm rolled around, we got killed.\nThe final was non-cumulative and included everything from after the midterm. It was about the same length as the midterm but we had double the time so it was manageable. The mean was 63 - I got a 92. I recommend reading the slides and textbook very carefully. You need to have a complete understanding of the single-cycle and pipelined processors - especially the pipelined one and also get some practice coding in assembly.\n\nWorkload:\nSee above. 6 hwks, lowest score dropped (40%). Midterm (30%). Final (30%). Class curved to a B+ she said (and thankfully so).\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "May 14, 2011",
            "review_content": "\nLike the person before me said, Martha is an incredibly nice professor. The course was well laid out with clear lecture slides that were all posted online before the class. That being said, if you miss a class (or a few) it's not too big a deal, but make sure that you go back and listen closely to the next lectures that expand on those topics because it can be easy to fall behind. Personally, on a few of the homeworks, it took me a little bit to understand what the questions were asking, but a quick conference with a friend uncovered that they were a lot simpler than what I was expecting. And if for some reason a concept doesn't stick, she drops your lowest grade. I would definitely recommend Prof. Kim optimistically to anyone who has to take fundamentals. This isn't a class to worry about and should interest people of all areas of study in CompSci, EE, and CompE with at least one topic.\nWorkload:\n6 homeworks worth 40% and a midterm and final worth 30%\n"
        },
        {
            "course_name": "Fundamentals of Computer Systems",
            "review_date": "May 10, 2010",
            "review_content": "\nMartha is one of the nicest professors I have met here. She takes the time to try to help out students, wants to know their names, and tries really hard to be available. That being said, she is a new professor to Columbia, and it shows. Homework lengths varied greatly, and she often seemed surprised that things took as long as they did. She corrects herself in class so many times that it is hard to know what the conclusion is when she is finished. The midterm exam, for example, arrived nearly 20 minutes late since there was an issue with the printer. Why not print it out the day before? The average on the midterm was a 50%, and she seemed happy with that (I think it was higher than last year's). Hopefully with some more experience some of these rough edges will go away, as she has a lot of potential. A friend who took this class both with her and Rubinstein said that it is definitely better to take it with her.\nWorkload:\n6 HWs (40%), of varying time requirements and difficulty with the lowest score dropped. One midterm (30%) and a final (30%) which is non-cumulative. Exams are open book, but that doesn't mean that they are easy.\n"
        }
    ]
}