{
    "prof_info": [
        {
            "prof_name": "Marcus Gardley",
            "prof_id": 2544,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Playwriting",
            "review_date": "January 16, 2007",
            "review_content": "\nworst possible writing class for three reasons. one, we didn't prepare at all for the workshops. we would come in to class, hand out scripts, have people read the parts out loud, and then comment on what we'd just read. no real insight was gained. no real help was offered. total waste of workshop time. two, as evidenced by his idea of workshopping, marcus is completely scatterbrained. he would never respond to emails, forget all of your previous meetings with him, and never read your work thoroughly unless you demanded it. three, the grade is based on quantity not quality. i could've written 65 pages with a crayon and called it avant garde and marcus would've had to give me an A. \ni know i'm being really harsh here, but i felt completely duped by the other two reviews of marcus. sure, he's a really nice guy. there's no doubt about that. but so is my dad and he doesn't teach a writing class at columbia and charge tuition. i obviously don't believe in the easy A standard when it comes to assessing writing classes. what's the point if all it offers is 2 hours a week of pure pain and an unedited product? i could do that at home with a nice couch and alcohol.\nWorkload:\ntotal bs. as long as you turn in something, you're good.\n"
        },
        {
            "course_name": "Playwriting",
            "review_date": "January 16, 2007",
            "review_content": "\nworst possible writing class for three reasons. one, we didn't prepare at all for the workshops. we would come in to class, hand out scripts, have people read the parts out loud, and then comment on what we'd just read. no real insight was gained. no real help was offered. total waste of workshop time. two, as evidenced by his idea of workshopping, marcus is completely scatterbrained. he would never respond to emails, forget all of your previous meetings with him, and never read your work thoroughly unless you demanded it. three, the grade is based on quantity not quality. i could've written 65 pages with a crayon and called it avant garde and marcus would've had to give me an A. \ni know i'm being really harsh here, but i felt completely duped by the other two reviews of marcus. sure, he's a really nice guy. there's no doubt about that. but so is my dad and he doesn't teach a writing class at columbia and charge tuition. i obviously don't believe in the easy A standard when it comes to assessing writing classes. what's the point if all it offers is 2 hours a week of pure pain and an unedited product? i could do that at home with a nice couch and alcohol.\nWorkload:\ntotal bs. as long as you turn in something, you're good.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "May 17, 2005",
            "review_content": "\nMarcus is a pretty nice guy, and is very generous with his compliments. Of course that can be annoying when you begin to notice that even the worst writing earns his praise. The workload was pretty light, and overall he's lenient about deadlines. But whatever this class will do for you, it definitely won't help you hone your writing skills. If you happen to get lucky and have some talented writers in your class, good for you. Otherwise this class is a wasted exercise. Marcus means well, but he doesn't do a good job of it.  If you're the type that expects an English instructor to know how to spell, pronounce words correctly, and understand semi-abstract ideas, this isn't the one for you.  It's not a hard class so there's no great harm if you do land up here, but it's no fun either. Try for a different section if you're passionate about writing. \nWorkload:\n2 poems, 1 prose poem, one short story, 1 play. . . as he says himself, it's not about quality. . ..go figure what that means\n"
        }
    ]
}