{
    "prof_info": [
        {
            "prof_name": "Robert Weston",
            "prof_id": 561,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 27, 2004",
            "review_content": "\nWeston is the best professor I've had at Columbia, and I've had some big names.  This course has truly changed my outlook on life, and like the previous reviewer said, made me take to reading again, for both pleasure and an intense need to know and understand.  Not one person from our class could say they didn't gain something from every single period we had with him, and as Robert himself titled it, CC was not so much a class as an intellectual journey.  It's a shame he's finishing up his PH.D., I advise Columbia to snap him up as soon as possible before he's stolen by some other philosophy department or the country of Germany.\nFinally, he's also a genuinely nice guy, very available for discussion (English or German or French or like the dozen of languages he speaks) outside of class and just fun to talk to.\nWorkload:\nThe readings, the papers, etc.  But trust me, you'll be thinking about it all whether he assigns that \"think time\" or not.  Found myself discussing the materials extensively outside of class with both friends and Weston himself.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 13, 2004",
            "review_content": "\nA true scholar and man of the world. He speaks what seems like an endless number of languages, and has read every peice of literature. Purely brilliant, he shares his wisdom, but makes you work for your grades. I am a SEAS student and thoroughly enjoyed his class. He taught us how to engage with a book, rather than just to look at it, and if you gain nothing else from this class, you will learn to read again.\nWholeheartedly reccomended.\nWorkload:\nLots of papers and lots of reading. standard CC stuff.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 14, 2004",
            "review_content": "\nyou will thank your lucky stars, sophomores, when you see \"robert weston\" on your CC schedule after registration. winning the CC crapshoot, you'll begin come to class actually feeling guilty for not doing his assigned reading because you have just not fully taken advantage of one of the most brilliant CC teachers out there. unfortunately for me, i didn't have weston for CC the first semester, but after various recommendations through CULPA and his students, i managed to squeeze myself in for the second semester. i recommend every student who is unsatisfied with their original CC teacher to transfer to this class. weston speaks in a very eloquent and intelligent manner that suits the material that CC covers. he also likes to throw in a few German words here and there to better explain the many works that we read that we not originally written in english. in addition, he's refreshing - not your typical babbling arrogant grad student, but a down-to-earth who ironically likes to don himself in a sharp three piece suit and delicious looking ties. yes, he understands us... but he doesn't underestimate us. he expects a lot out of his students and his materials are very advanced, but these works are essential to western philosophy. and of course, you feel like you're getting more bang out of your buck. his papers topics aren't hard in the sense that some teachers give obscure subjects and leave you guessing, but that you feel pressure to prove that you've truly garnered something from his classes. about 2-3 papers per semester... not difficult. the hardest part of the class is to keep up with the massive readings, but believe me, you'll want to. i ended up getting an A-, the same grade that i got in my previous CC class, but i left feeling much much much better abt the Core experience. weston will revolutionize the way that you think.\nWorkload:\na lot of extra readings that the majority of students in other CC classes will ever get to, unlucky for them. read the works he assigns if you know what's good for you!!!\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 06, 2004",
            "review_content": "\n  A true scholar and artist, Mr. Weston is, in Nietzsche's words, one of those \"more nobly formed natures, who actually feel profoundly the weight and burden of existence,\" and this is evident to all from the first day.  That he values the ideals of the Contemporary Civilization course itself was made quite clear to everyone in my class; but we had to wait until second semester to really discover how far he was glad to push the most talented students.  To me, his expectations of his students seemed limitless--and with grace does he hold himself to even higher standards.  He has such faith in us undergraduates!   Let me explain all of this in more helpful terms: Mr. Weston is himself thirsty for knowlege.  He sees both the aesthetic and metaphysical power of philosophical concepts--as well as their necessity--and he, like few others, manages to convey to his class just how powerful these ideas are.  He also knows, if I'm not mistaken, at least five languages (yes, he's one of those).    Mr. Weston also has a great sense of humor.  But there's something to be wary of when it comes to his jokes: he usually means much more than he seems.  Not that the lighter things escape him, of course.\n  Oh yeah, and almost everybody who had him last year totally adored him and felt indebted to him for his contribution to such an amazing intellectual experience.\n  Our first semester pretty much went as planned.  Second semester was something else altogether.  Though we cut out Mill, we kept most everything else that comes in the standard CC package.  However, Weston added to the cannon Mandeville, Bataille, Foucault, Adorno, two extra essays by Kant, Benjamin, Debord, Samin, and Veblen, to name a few (there were many more).  It was absolutely mind-blowing.  The experience has changed me irrevocably.  If any of this excites you, and you're willing to do some extra (and invaluable) work, then check Weston out and see what you think.  But if you're already dreading the course,  and the idea of extra philosophy gives you panic attacks, then by all means, steer clear of this man!  If that's the case, though, you should probably just steer clear of the course altogether, right?\nWorkload:\nMore readings than one would otherwise have under normal, reasonable circumstances.  Much, much more payoff, though.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 23, 2003",
            "review_content": "\nProfessor Weston is an awesome teacher. He really knows his stuff and is quick at adapting to the learning style of the class, so that by the end, everyone in the class has a clear understanding of the complex texts that we read during the semester. He explains the material in a lucid and academically stimulating fashion, mixed with jokes, history of the time in which the text was written, and the personalities of the philosophers. If you ever have trouble, he is always available and ready to help.\nPart of this review is in response to a review from a previous SEAS student. I also am a SEAS student and I loved the class. I recommend that students in SEAS TAKE THIS CLASS. I was one of the top students and a leading participant in this class. Being SEAS is in no way detrimental to your performance in the class. In fact, being in SEAS is quite beneficial as Weston bases his course heavily on logic and reasoning, and appreciates the comments of his SEAS contingent. For me, as a SEAS student, I found Weston's class to be a refreshing break from my endless science classes. Weston's class has really opened my eyes to philosophy, which studies the most important aspects of civilization and humanity. (You'll be surprised that many of the philosophers use mathematic and scientific examples that SEAS students will have an edge in understanding). I definitely recommend this class to everyone who has to take CC.\nWorkload:\nThere are the typical amounts of reading, 10 short reading responses, and two papers. The benefit is that if you stick with it and put in the time, you will definitely reap the benefits, both in terms of an understanding of the philosophy and in your grade. Weston is a very fair grader and if you have done the work for the class it will pay off. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 22, 2003",
            "review_content": "\nYour first two days in this class will be hell.  You'll hear about how he's going to run you ragged, and you'll hear about writing 20 short papers and 4 long papers while all your friends have CC profs who are much cooler and give them just 2 papers to write for the semester.  Your friends in the class will be switch out, and you'll try to join them, but the registrar won't let you.\nAbout 6 months later, you'll realize it's a damn shame they left.  The class is excellent.  The workload is quickly pared down to a managable size (we had 2 papers to write and 10 short responses second semester, which is nothing), and the guy is crazy intelligent.  Discussions are driven by the class, and he only intervenes when necessary.  When he does, its always brilliantly insightful, and almost always succeeds in restarting the discussion.  He obviously puts a LOT of time into this class, and his students reap the rewards of his copious preparations.\nWeston invariably finds ways to inject humor into the classes, and believe it or not, you'll find yourself perfectly comfortable laughing at and with this decked-out academic type.\nIn sum, if you take this CC class, and you do a moderate amount of reading, you will leave a better person.  For serious.\nWorkload:\nif its above average, its only slightly above.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 17, 2003",
            "review_content": "\nRobert Weston is a phenomenal teacher, and a total trip. He bears a closer resemblance to Kant and Freud than your average TA in his perpetual three piece suit and spectacles (with a sly grin, he claims the \"streetwear\" comment below is ironic, but with this man - who knows?) His eccentricity carries over to his teaching, but in a good way - I swear. His photocopied texts are covered with meticulous notes that appear to have been done with ruler and compass - a testament to the time and thought he puts into each class. While his lectures are brilliant, he is firmly committed to class discussion, and unless the class is dragging, student input constitutes about 60% of each class. Weston jokes that CC, a class with goals too ambitious to be met by any reading list, \"nibbles on the crust of knowledge.\" With Weston at the helm, you realize this is true: his understanding of the texts is far more profound than what is conveyed in 2 hours, and you often wish he would can the class discussion and tell it to you straight, (which he is happy to do in office hours).\nWorkload:\nHeavy: 2 papers a semester and a 1 page response about every other class, in addition to midterm and final. Grading is fair, but by no means easy. You'll be glad you put in the work.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 17, 2003",
            "review_content": "\nRobert Weston is a phenomenal teacher, and a total trip. He bears a closer resemblance to Kant and Freud than your average TA in his perpetual three piece suit and spectacles (with a sly grin, he claims the \"streetwear\" comment below is ironic, but with this man - who knows?) His eccentricity carries over to his teaching, but in a good way - I swear. His photocopied texts are covered with meticulous notes that appear to have been done with ruler and compass - a testament to the time and thought he puts into each class. While his lectures are brilliant, he is firmly committed to class discussion, and unless the class is dragging, student input constitutes about 60% of each class. Weston jokes that CC, a class with goals too ambitious to be met by any reading list, \"nibbles on the crust of knowledge.\" With Weston at the helm, you realize this is true: his understanding of the texts is far more profound than what is conveyed in 2 hours, and you often wish he would can the class discussion and tell it to you straight, (which he is happy to do in office hours).\nWorkload:\nHeavy: 2 papers a semester and a 1 page response about every other class, in addition to midterm and final. Grading is fair, but by no means easy. You'll be glad you put in the work.\n"
        }
    ]
}