{
    "prof_info": [
        {
            "prof_name": "Eric Wubbels",
            "prof_id": 2790,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 14, 2007",
            "review_content": "\nWhoever wrote that Eric's music hum class is very chill was definitely right.  I was one of the people who knew almost nothing about music, and I very rarely felt stressed out by the class.  Eric is a good teacher who takes time to explain things and does his best not to let class become boring: he brought in a friend to perform part of an opera, he played the prepared piano for the class, etc.   Also, his sense of humor made the material a lot more interesting, especially when he gave us the composers' biographies.  He chose some very weird/interesting pieces for us, especially as the semester progressed.  Also, while his midterm and final definitely weren't easy, he graded very leniently and wrote lots of helpful comments.  Consider yourself lucky if you get Eric as your music hum teacher.\nWorkload:\nsemi-frequent 2-3 page responses at the beginning of the semester, two 5-7ish page papers, 2 concert reports, listening before class. totally manageable.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 13, 2006",
            "review_content": "\nWubbels' music hum class is very chill. He's a funny, nice guy who obviously knows his stuff when it comes to the masterpieces of western music. At times I found the class to be slightly boring, but more than anything that was due to the fact that I found it hard to really get into a lot of the stuff we had to listen to (which isn't Wubbels' fault, as he doesn't have complete freedom to choose what we  listen to). The workload isn't bad at all. There's no textbook; just listen to the selections and come to class. For the first half of the semester we had to do response papers once every week/two weeks, but this stopped after we started having essays due. The grading is fair as are the exams. Stick with him if you get him! \nWorkload:\nResponse papers (see above), listening to the music before coming to class, one concert report, one analytical paper (about 5 pages long). That's about it.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 03, 2006",
            "review_content": "\nAlthough what the other reviewer says is all true it doesn't do Eric justice whatsoever... he's a really great guy who knows a ton about music.  He really tries his best to keep the class interested and really pushes the core requirement envelope by covering music regardless of the historical \"importance\" and  ties together themes and effects throughout many different genres of music.  I loved his anecdotes about each of the composers that really gave you insight into the person and allowed you to understand their music at a deeper level instead of focusing on the accepted criticism of musical scholars.  He leaves lots of room for class participation and questions so don't ever hesistate to ask- he will have something really interesting to say.  I think he makes the course more about understanding what elements of music successful or enjoyable instead of indoctrinating you with what you \"should\" know.  He plans a bunch of special classes w/ performances and a trip to the met --Consider yourself very lucky ;) \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 07, 2006",
            "review_content": "\nYou could definitely do worse for Music Hum than this guy.  First of all he has an awesome name.  I got endless amusement from telling my friends I was going to to class \"wif pwofessa wubbles.\"  But mostly he's just a cool guy.  He's funny, relaxed and down to earth.  He organized the syllabus by themes (War, Irony, Virtuosity) rather than chronologically, which was a pretty interesting way to do it.  He always kept things pretty simple, yet could go into more depth if you asked him to.  I had absolutely no musical background, and I really didn'thave much trouble understanding any of the concepts.  The tests were fair and of reasonable length, and he only assigned one paper and one concert report.  Pretty much all you have to do to do well in this class is come to class and stay awake.   Unfortunately, I did neither of those, and thus I got a really bad grade.  I don't really hold that against Wubbels though.  I would say I have only two complaints against him.  The first is his attendance policy, which is only one absence before he starts taking off from your grade, which is pretty ridiculous to me.  The other were these weekly to biweekly listening responses he had us do, which I guess isn't really that big a deal, but they were really tedious.  One last thing. This class is at 9 am.  While Wubbels was cool, he wasn't cool enough to hold my attention, or many others', at that hour.  So think long and hard about whether you'll be able to get up that early and stay awake through the class.\nWorkload:\nweekly/biweekly pagelong responses (probably 8 or 9 in total).  1 paper (3-5) pages.  1 concert report (3 pages).  fair midterm and final.  average listening assignments.  All in all probably slightly less than average for a music hum class.\n"
        }
    ]
}