{
    "prof_info": [
        {
            "prof_name": "Tian Zheng",
            "prof_id": 754,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Data Science",
            "review_date": "May 13, 2016",
            "review_content": "\nTian Zheng is a wonderful professor. She really made this class one of my favorite at Columbia through her humor and teaching style.\nApplied Data Science is entirely project-based. The course grade is based on five projects - a group of four or five people (randomly chosen) works on each project (except for the last project - you can pick your own partners). \nProfessor Zheng had a great vision for the course, from exploratory analysis of US Census data from Kaggle, to image recognition between cats and dogs. Even though the projects seemed very daunting (especially since most of the students in the course are statistics MA students), Zheng was very helpful and provided useful tutorials and offered valuable guidance on Piazza. It was very clear that she wanted her students to learn and grow, yet she provided enough autonomy for the students to work independently (without lecturing all the time). She even provided snacks in class and got class stickers!\nOn another note, I was initially intimidated by the requirements of the course and how I could stack up against statistics MA students. However, Tian Zheng created a very supportive environment for all of the students and ensured that everyone could use his/her strength to contribute in some way. Because of her, I felt that I learned a lot and made a lot of friends.\nI highly recommend this class and Professor Tian Zheng. The next logical step for statistics majors is to apply theoretical concepts to practical problems, and that course offers exactly that. It will be challenging, but you'll have a nice GitHub portfolio at the very end of it!\n\nWorkload:\nFive projects - each weighed equally. They vary in difficulty - the first one was the easiest while the third one (image recognition) was the hardest, while the students could choose what to do for the fifth one. \nMake sure to start early and to communicate with your group members. Zheng does require groups to mention whether everyone contributed equally to the project or not.\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "May 10, 2011",
            "review_content": "\nAmazing! She has a slight accent but is very easy to understand. She's a great teacher, cares about her students, is extremely nice, and is very organized. She really explains concepts well and can help make the sometimes confusing material easy to understand.\nShe also spends time teaching you how to use R. She doesn't test on it, but she makes you use it in the problem sets. A good skill to learn.\nThe material isn't super exciting (unless you're very into statistics) but can be interesting on occasion -- especially with Tian teaching and trying to keep things fun.\nWorkload:\nWeekly problem sets -- usually 3-6 question with a combination of proofs, theory questions, and computational problems. That's 40% of the grade + midterm (20%) + final (40%).\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 15, 2009",
            "review_content": "\nTian makes intro stats painless. Her lectures are well-organized, and though they are all Powerpoint-based, she works out a lot of examples on the board. She answers questions during class and always stresses the important points. She also provides in-class copies of lectures and uploads them online afterwards. When she taught us, she didn't hold a lot of office hours, but there were two Tas, each of whom held a recitation during the week (separate from her office hours), so it was easy to get help. Her accent is not an issue, and she's very good at explaining confusing concepts. The final data project is pretty annoying and useless, but the grading is generous, and she provides plenty of resources. \nIn short, this is a very easy class with very fair and transparent expectations. Can be easily tacked on as a sixth class. Tian is understanding of the fact that her class is probably not a priority for most people.\nWorkload:\nEasy midterm (with a super generous curve) and slightly more involved final. MC quizzes every other week. You can bring cheat sheets to all quizzes and exams, (1 one-sided page for quizzes, 1 double-sided for midterm, 2 double-sided for final). Weekly problem sets that aren't hard at all, and the lowest one will be dropped. She'll even occasionally give extra credit questions on the problem sets. Finally, a data project that you have over a month to do. \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 28, 2005",
            "review_content": "\nOh, Tian!\nListen, I do not like math very much and I wasn't looking forward to statistics.  But Tian made this class go as smoothly as it possibly could have.  She works extra hard to insert jokes into lecture and write problems about interesting things.  She is completely aware of the fact that not many people enjoy statistics, but her own enthusiasm is surprisingly contagious.  I'm not going to say this class inspired me to switch my major to statistics, but Tian got the job done, and painlessly.\nWorkload:\nSeems like quizzes all the time, which are actually every other week, but they're ridiculously easy, you get to drop one, and you get to bring in a page of notes.  Midterm (1 pg of notes) and final (2 pgs of notes), relatively straightforward.  Problem sets are pretty annoying, but fine.  This class takes some TIME, but no anxiety.  You just do the homework while listening to your iPod, and it's all good.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 12, 2005",
            "review_content": "\nAWESOME.\nI read some of the older reviews and must say that Prof. Zheng's communication skills were a non-issue.  Didn't even occur to me that it was once a problem.\nShe's just awesome!  And will make everything possible to make the relatively dry material interesting for you.\n\nWorkload:\nWeekly problem sets; midterm, final, and 5 quizzes.  E-Z, E-Z, E-Z if you do the work.\n"
        },
        {
            "course_name": "Statistics",
            "review_date": "February 06, 2005",
            "review_content": "\nI honestly couldn't dislike T.Z. if I tried.  She is such a sweet, adorable person.  Wicked smart, too -- if you check out her CV.  She goes slowly through the material and seems eager to make sure every student understands.  Her jokes are ... well, let's just say it's the innocent, untutored delivery that makes people laugh.  She's one of the profs you'd like to get to know over coffee.\nWorkload:\nWeekly homework.  Totally manageable.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 15, 2004",
            "review_content": "\nTian is a good professor. She posts lectures online, and gives thorough examples in class. For those who can learn on their own, there is no need to attend the class. You only have to go to the recitations, where there are quizzes and homework is collected and returned. \nWorkload:\n10 Problem Sets (Kind of long), 5 quizzes, 2 Projects, Midterm & Final (Both straightforward and with a good curve). \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "February 23, 2004",
            "review_content": "\nTian is very nice person and I am glad her English is improving. In a few years maybe I might understand more than half of what she is saying. The class and the recitation sections are very well organized but you might be better off staying home and doing problems from the textbook. I leave class every day totally lost and hoping the textbook explains it better- and it usually does. \nWorkload:\nweekly homework helps you understand the material. Easy quizes in section. Time consuming lame project with a partner\n"
        },
        {
            "course_name": "Linear Regression Models",
            "review_date": "January 19, 2004",
            "review_content": "\nI've had Tian for two classes:  stat 1111 and this course.  Over the years her accent has improved immensely, thus making her one of the best statistics professors in the department.  Her explanations are straightforward and she includes her own examples, which give students another way to understand the material.  The book is very good, straightforward and if you take the prereqs, this class should be pretty easy.\nWorkload:\nHomework- 40%, Final - 30%, Midterm - 30%.  At the end she changed the grading so that a better grade on the final took the place of the midterm.  The homework are all questions from the book and they're pretty easy if you read the section.  The tests, while challenging, usually have a decent curve.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "November 18, 2002",
            "review_content": "\nWell, out of all the bad teachers in the stats department, she is one of the better ones. She tries to give students as much extra credit as possible, is always avialble to help on the homework during the office hours, and basically will help you out in whatever you ask. The biggest hindrance is her lack of english, which can make things a little harder to understand. She seriously tries her best to teach an understandable class, and her courseworks website has the notes from every single lecture. I would recommend her more than all the other monsters in this department. She is also very approachable. \nWorkload:\nHomework due every week, quiz every recitation session, no MIDTERM, class project (with a group), and final. None of these hard if you actually read the book and do the HW. \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "November 12, 2001",
            "review_content": "\nThe class might not be that hard if you were able to understand her broken english, which ranges from borderline to incomprehensible. She might be nice beneath that robot-like exterior, but its pretty tough to say. The class is bearable, but by no means good. Watch out though, good instructors in this department are pretty slim pickings.\nWorkload:\nProblem set every week or two, Midterm, Final, annoying data collection project.\n"
        }
    ]
}