{
    "prof_info": [
        {
            "prof_name": "Sara Zaidi",
            "prof_id": 12871,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Issues in Education",
            "review_date": "May 03, 2014",
            "review_content": "\nPros:\nThis is a very discussion-heavy course. She does a good job of facilitating dialogue and offering challenging questions to the class.\nZaidi is very passionate about educational policies, and her passion is shown in class. She has strong opinions on certain policies which might seem overbearing at times. However, she does not shut anyone down or disregard differing opinions.\nShe integrates media well by showing relevant videos and even music\nCons:\nSometimes, she focuses so much on the presentations and discussions that she does not have time to lecture. There is usually no time for her to lecture, especially when presentations began some time in the middle of the semester. As a result, the readings are not discussed. \nShe does not return assignments and work on a timely basis. This is perhaps my biggest issue, since by the time she returns work, it might be too late to drop the class if need be.\nYou must take individual responsibility for your own work. It's ultimately up to you to submit work on time since she does not offer reminders in class. Also, be sure that you ask her specifically for guidelines on assignments - she doesn't go over that in class either, so some students were unclear on how to do her assignments.\n*Note: Zaidi is expecting a child, so she probably will not be teaching for the fall semester*\nWorkload:\nFieldwork and Reflection Paper - Zaidi requires a minimum of ten hours of fieldwork (classroom observations, interviews, surveys, etc.) in a school to research an assigned topic. Then you have to write a paper on your fieldwork. Be sure to start early, since the fieldwork can involve a lot of work. \nLitreview_contente review_content - Read research literature on your assigned topic and write a paper synthesizing the sources and offering your own opinion.\nreview_contentl Article review_content - Read one journal article on your assigned topic and write a paper on it.\nDiscussion posts and readings (weekly) - Zaidi requires a weekly discussion post in which you post a question relevant to the readings by Friday. Then you have to answer two of your peers' questions by Sunday. Readings can be quite heavy, but don't worry too much about the specific - just get the general idea. \nPresentation - Some students are assigned the same topic. Those students will work together to create an interactive multimedia presentation to teach the class about the topic. People usually do well on the presentations, but they usually take up all of the class time, thereby limiting time for lectures or reminders about assignments. \n"
        },
        {
            "course_name": "Contemporary Issues in Education",
            "review_date": "April 17, 2014",
            "review_content": "\nProfessor Zaidi is young, passionate, and well-informed, especially on issues of race in education which are essential to an introductory Educational Studies course like this one. She's a pretty radical education activist and runs with that crowd, so if you ask she'll be sure to hook you up with interesting events and forums you can attend to get more involved in radical education reform. She'll also make time to go grab coffee with you and just talk about life, if you're interested, despite a busy schedule that has her teaching at several colleges at once. She knows her stuff and is great if you're interested in just arguing and learning about, well, contemporary issues. \nDoesn't mean she's a great teacher, though. She's terrible about budgeting classroom time and actually getting through the material on her syllabus, partially because she encourages student presentations to be as interactive and discussion-based as her own lessons. She doesn't expect you to know things she hasn't taught, so she's got that going for her, but she doesn't post the lecture slides online, either, so you never know what you might have learned if she was better at time management. She often interrupts classroom discussions with her own self-admitted subjective opinions and sometimes go on for five or ten minutes as though she were just that classmate who talks too much, and not your professor. If you're a good writer, though, she's a fair-to-easy grader, and leaves good comments on your work (thank you, Education Program, for being rubric-crazy). \nThe course itself is well-designed. It's a survey course, so expect to do a lot of reading on a wide range of topics - if you're interested in the topics, the week is a treat. If not, well, plough through. But if you like education and want a seminar-type course to blow your mind, this is it. \nWorkload:\nKind of heavy. Weekly readings, a weekly discussion post based on those readings due on Thursday and two replies to others' discussion posts due by Sunday (which takes up a surprising amount of time). You choose one of the \"issues\" at the top of the semester, such as \"School Finance\" or \"No Child Left Behind,\" and you have to choose a scholarly article to write a paper on 1/3 of the way through the semester, and then expand on it with a second paper which includes other scholarly articles (a literature review) about 2/3 of the way through the semester. You also design and teach a 50-minute class on your issue when it comes up in the syllabus, usually with one or two teaching partners. The final project is a research paper that requires observation and primary research in an actual school - which you have to organize yourself, so do it EARLY in the semester.\n"
        }
    ]
}