{
    "prof_info": [
        {
            "prof_name": "Jonathan Vogel",
            "prof_id": 4472,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "March 12, 2015",
            "review_content": "\nJonathan Vogel figuratively teaches economics with a metronome. There, you see the beauty of math and economics. He writes his exams in a way that require that same metronome and thus a real skillful set of hands during the exams (and later lectures) in order to hang.   \nWorkload:\nVery standard: a problem set associated with about a weeks worth of the lectures, and a ton of weight on both the midterm and the final. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "February 25, 2015",
            "review_content": "\nMan, this guy really loves his game theory. He posted slides, but they had blanks that you needed to go to class to fill in. His midterms don't have any numb Curve was harsh but fair. All in all, I had a lot more fun than Elmes kids that semester.\nWorkload:\nLight-ish, 5 psets, 2 midterms, final\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "September 12, 2012",
            "review_content": "\nIt was hard to follow along with Professor Vogel. He went way too fast for people who were not familiar with the concepts. He seemed to assume that everyone was naturally going to understand the concepts. Yes we all go to a prestigious school where there is the expectation that most students are fast learners but it was hard to follow and even harder to catch up. \nProfessor Vogel was also intimidating. I was afraid to ever ask him questions or go to his office hours. I went once and when I asked him something he told me I was suppose to know it. Though he did explain it to me, that comment really made me feel bad. \nI went to two separate TA's. Asher was much more helpful than Sam who made it apparent that he did not care about the students and the class. Everytime it turned 9, he would rush out and said he wasn't going to take any more questions. In addition, Sam was never sure about the problems. A general problem about the two TA's are that they never looked at the material before recitation so they were never familiar with the questions we asked them. They worked on the problems on the spot which took more time.  \nI have never felt so helpless in any other class. The homework assignments were fair. But the exams were incredibly ridiculous and did not reflect what we learned in class. I understand Vogel wanted to challenge us with the concepts we learned in class but it is unbelievable how confusing the questions were on the exam. Most of the people who did well, did so because they had extensive math background. Other than that, having spoken to multiple students, they either did average or really bad. \nYes there is the curve but the class average was around a 50/60. I don't understand the rationale behind preparing such hard tests. \nWorkload:\nHomeworks were easy but did not prepare you for the tests at all. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "August 23, 2012",
            "review_content": "\nFor starters, Professor Vogel is actually a good lecturer. He will repeat key concepts and make it so that you will know them by heart. I don't think that I will ever forget that a Nash Equilibrium is a set of strategies such that no individual player has a unilateral incentive to deviate given the strategies of all other players.\nWith all that said, there are some drawbacks to being in his class. The two midterms and final account for 85% of your final grade, and neither the problem sets that he assigns nor the lecture slides he posts are of any help. Since Professor Vogel likes to bring up baseball from time to time, let's do that here. Taking one of his tests is like hitting a curveball. Actually, it's more like hitting a knuckleball, as in you have no idea where the test is going to go, and no amount of studying can truly prepare you for one of his tests. You just have to close your eyes, swing as hard as you can, and hope to make contact. On the plus side, almost all of your classmates are doing the same exact thing.\nFinally, a note on grading. Professor Vogel tries to curve the median to a B+ and the mean to somewhere between a B+ and a B. This could wreck your GPA if you're not careful.\nWorkload:\n4 problem sets (15%), 2 midterms (25% for the higher of the two, 20% for the lower), and a final (35%). Problem sets are easy, tests are not.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 31, 2012",
            "review_content": "\nI simply don't see how Prof. Vogel does not have a silver / gold nugget (well according to experience it seems gold ones are reserved for professors who hand out grades in the A-range for free). He is by far the most interesting professor I have ever had.\nThe best thing about him is that he goes through everything through first principles. He makes the class look back, slow down and think, rather than immediately turning to cranking out the math. If you want to improve your attention to detail and learn to how to systematic, I recommend taking Microeconomics with Prof. Vogel if you can.\nThe course is pretty manageable and the way he taught it, it was quite engaging (although I have to say that I did not attend every class). He teaches Microecon through game theory and the amount of game theory he covers in the second-third of the class, was pretty much exhaustive for a semester-long Introductory Game Theory class (sans the formalism).\nHis exams were really engaging, and I loved solving them: I would not agree with any reviewer for the part of calling them \"hard\". They are more of the thought-provoking type. For example, he makes you think of the corner solutions in an optimization problem, and sometimes makes things a little abstract.\nConsidering the homework and the final, I would agree that his homeworks are in comparison easier to work out, but similar in concept to the exam.\nIf you are the kind who likes \"honors\" classes better than regular ones or you love heavy curves, this is the class to attend. Prof. Vogel says that he plans to get the average to around 50 (it ends up being around 50 - 60), so get used to that. Remember there exists a curve.\nOh yes, he sometimes reads CULPA reviews. Hi Professor!\nWorkload:\n4 - 5 problem set, 2 midterms (25% higher one, 20% lower one) and a final.\nProblem sets refresh your memory, look at practice problems that he posts, and if you think you are doing bad, FOLLOW through the solution and every logical step.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 15, 2012",
            "review_content": "\nIt reflects poorly on Columbia that a teacher like this is part of the economics department. Having had teachers like Gulati and Xavier I had come to have a lot of respect for my economics professors. However, Vogel's class was nothing but an excuse for him to please himself. The class was not cumulative at all, or at least not in a way that Vogel showed us. His classes were conducted by projecting the relevant functions on the board and then having us sit there solving problems in class for another 30 minutes (this mostly was comprised of people saying pass and the same 2-3 kids grudging through the problems every time). Needless to say, you don't really get the feeling that he teaches you anything. \nWe were given 4 problem sets.The questions on these were easy and simplistic, there was absolutely nothing similar on the test except for the first gimme question. The problem with how he sets up his tests is that there is 1 very easy question worth about 40 points and then another 2 questions worth the other 60 points on average. I completely understand the motive for wanting a class average of around 50 so that there will be a nice spread around the mean and it will be easier to curve up. However, the average ends up being around 50 but without any spread and kids who end up being great at economics but not being able to answer his brain teasers on tests will end up lumped in with the kids who only know the basic materials. Basically everyone gets the easy question and a handful end up being able to decipher his page-long convoluted questions. Honestly, if you end up taking this class don't worry about studying the material for 12 hours to get an A, this isn't possible. Instead you pretty much hit a wall at some point once you have the knowledge to answer all the questions, the only problem is you need to be able to figure out how it factors into a problem which is a lot easier said than done. The midterms were not cumulative, they only focused on the sections that preceded them: utility and game theory. After the second midterm we went over about 5 chapters (which is a lot - each of the other midterms covered about 3 chapters). We didn't have a single problem set on this material and Vogel ended up rushing through it so we could fit it all in. On the last day he announced that he would post information on his review session for the final - didn't happen. Instead he posted 2 final review question sheets covering problems we had never seen on the latest 5 chapters. Most people took this as meaning the final would focus on this material and when we got to the test and opened it, he was asking us for esoteric terms from the 1st few chapters on the \"easy\" questions. The new material showed up on one question in the exam and it was the hardest one (it was only worth 20 anyways I'm pretty sure).\nThe absolute worst and most frustrating part about this class was Vogel's nasty attitude in the class. He was snarky and full of himself. He constantly talked of himself as a master of mathematics yet was skittish when it came to solving out the basic math on his practice questions. He was 100% reliant on his slides all the time (none of my other teachers in economics really even used slides). The post-test classes were the worst. We would come in and he would yell at everyone to put their pens and pencils away and that they were not allowed to have anything out. No test could leave the room. In reviewing the first test we spent most of our time going over the easy problems that everyone knew how to do and skimmed through the last two that barely anyone knew how to do. We weren't allowed to take notes to go back and figure out where we went wrong either. One girl even asked him poignantly, \"How are we supposed to learn from our mistakes?\" to which he pretty much replied, \"Too bad.\" He seemed extremely distant from the class and could only remember one or two students' names in the entire 70 person class, even though half the class relied on us walking him through problems that we had never seen before. Additionally his slides were useless and were posted online but missing all calculations, answers and steps. This was particularly problematic if you were unable to write down all of the information or missed a class for an interview for example.\nMy recommendation for anyone who is an econ major taking this class. DO NOT TAKE IT AT ALL COSTS. He is the worst teacher I have had at Columbia and by far the worst in the economics department. You will have a very difficult time getting a respectable grade in the class (he curves to a B from what I understand) and you will have an even more difficult time enjoying it. Take Elmes and get a group together for the problem sets, you will retain the information and have a much more enjoyable experience learning from someone who has earned her spot in the economics department.\nWorkload:\n4 extremely easy problem sets (15%), 2 Midterms (45%), 1 Final (40%)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 09, 2012",
            "review_content": "\nOther reviewers maintain that Vogel is \"amazing\", but if you want to learn microeconomics, this couldn't be farther from the truth.\nIf you want to take a class on mathematical brainteasers that are tangentially related to economics, then take this class.\nFor example, production functions, cost functions, perfect competition, monopolies, etc. make up the bulk of economics; however, in Vogel, we rushed through these topics at the end of the course without any practice on problem sets. Also, the final only included one question on production optimization, while all of the others were brainteasers in game theory and utility optimization. You should be able to leave this class with a firm knowledge of Cornout, Bentrand, etc. Sadly, I'll forget all of these important topics in a week or so. \nIn a subject where constant application is key to learning, Vogel decided to give us 4 extremely short and easy problem sets. Reptition and application are necessesary for learning micro, but you won't get this in Vogel. \nThis class is about excessive pressure and tricks. If you want to learn in a productive environment, then don't take this class. \nTake Elmes. The problem sets are much longer in Elmes, but the tests will make sense, and you'll walk out with a better grade and better understanding of the material. \nWorkload:\n2  tough midterms (average of 50%), one really tough final (average of 40-50%), 4 extremely easy and short problem sets (average of 90%)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 23, 2011",
            "review_content": "\nThis class is amazing. Vogel teaches you not only how to do microeconomics, but also how to break down problems and progress in a logical manner. He teaches you the mindset that you need to go on in future economics courses and careers. He actively engages the class, calling on anyone and everyone and attempting to learn everybody's names. He's funny and brought up a couple real-world solutions in class as well.\nThat said, I could see why people hated his class. It's a hard class - this isn't one of those grade inflation classes. You have to know your shit to make an \"A.\" The TA's aren't much help, and he actually acknowledges that a lot of people don't go to recitation. One of the TA's used the wrong version of the midterm to grade, so the grades were off by a couple points for the entire section. DON'T BUY THE BOOK. It is completely and utterly useless. He used two example problems from it the whole year, and you can just borrow one or get it from the library for those. REALLY don't buy the book. No matter what he says at the beginning of class or whatever. It's not worth it. \nIf you like a challenge and really want to learn economics, then take this class. If you just want to ace a part of the core, then take a different teacher. Great class, great experience.\nWorkload:\n4 or so problems sets - way easier than the tests\n2 midterms and a final that get increasingly difficult and build on each other\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 18, 2011",
            "review_content": "\nThis class isn't nearly as bad as the rest of the reviews make it seem. I actually liked it for the most part, and it's way less work than Elmes' section. Vogel's lectures are pretty entertaining, which is good since going to class is really the best way to do well on tests, and he has a very specific way of teaching the material and sets up his exams accordingly. There are only a couple problem sets and they're quite easy, which is a nice boost to your grade if you don't blow them off entirely. The exams are pretty hard, but they are curved generously. If you go to class and make sure you know how to do the problems, you can get a decent grade with only a few hours of studying. Everyone who complains about the math is just stupid--the most complicated thing you'll ever have to do is take a derivative. I wouldn't say it's an easy A, but you can get an A-/B+ with almost no effort compared to what you would have to exert with other professors. Also he reads these reviews and talks about them in class. (Hi professor Vogel!)\nWorkload:\ntwo midterms (sucks because it feels like your taking midterms all semester, but good because if you do badly on one you can make it up on the other, and he weights them accordingly)\n3 or 4 easy problem sets\nfinal\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 17, 2011",
            "review_content": "\nVogel (a fairly recent Columbia grad) admits to wanting to be like Xavier Sala-i-Martin.  He says it, and you can tell in the jokes he attempts to make.  He can be a little awkward, but in a couple of years he truly will be a great professor.  He explains what's on his slides, and you have them for reference later.  He's open to quesitons, even though he can't remember more than 4 students' names for the life of him.  He is renowned for his difficult tests; this is true.  Practice as much as you can beforehand, but know that you probably WON'T get an entirely correct solution on the exam - or even remotely correct.  Just keep plugging through the simple-but-ugly algebra, and know that the curve will carry you the rest of the way.  I think Vogel is a great choice for understanding the material.  \nWorkload:\n4 (easy) problem sets, not worth much; 2 midterms and a final.  Difficult!\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "April 07, 2011",
            "review_content": "\nWhile I agree that Vogel's classes are sometimes entertaining as a result of his self-deprecating humor and vague SNL references, he is not a particularly good teacher. He rushes through all the material and certainly relies much more on the math side of econ than the theory side. This would be fine if he himself were able to do the math that he is trying to teach us. He consistently messes up his calculations on the blackboard and has to turn to either his TAs or his slides to rectify his errors. The upside to the class is that he does not focus too much on graphs (unlike Elmes), and his problem sets are short and relatively easy. That being said, it is not worth it to suffer through his impossible exams for easy problem sets. \nWorkload:\n4-6 Short problem sets\n2 Unbearable Midterms\nFinal\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 19, 2010",
            "review_content": "\nFirst things first, you will learn in this class. Vogel is a great teacher who actively engages the class (you will not avoid the random Vogel interrogations) and legitimately teaches the material in efficient fashion. Funny, self-deprecating, and brilliant, Vogel epitomizes what a good Econ teacher should be. Do not let any of what follows take away from this fact. Vogel is awesome.\nThe flipside to this are his tests. These, in short, are a barrel full of monkeys worth of mathematical fun. Making up pretty much the entirety of your grade (only 3 easy homework assignments which are worth a negligible portion of your grade otherwise), these test are fair yet surprisingly brutal. They solely focus on material covered in class, yet combine individual concepts into single problems that range from doable to utterly insane. You will be pushed to the limit trying to finish these tests. Means on the tests were 70, 55, and 40 for first midterm, second midterm, and final respectively. Oh, I forgot to mention that the class is curved to a 3.0 GPA average. If you inordinately care about your GPA, then buyer beware regarding this class. If what you learn matters, then I highly recommend Vogel's class.\n\nWorkload:\n3 homework assignments (easy and trivial), 2 midterms (5 problems each, 1 problem on each will be very difficult), 1 final (very difficult, time-consuming). Overall, grade is completely dependent on how good of a test-taker you are.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 18, 2010",
            "review_content": "\nVogel's class...always entertaining and engaging but prepare to get shafted on the tests. Maybe he gave a generous curve last year but he definitely did not give a generous curve this year. He curved to a B this time around. You also need to realize that in taking the class, you are going to compete against the smartest econ students since you're confident enough in your econ abilities to be willing to take his class. \nHis tests are much tougher than Elmes', as much as Elmes' students might think otherwise. Nevertheless, Vogel's tests are fair; you are given enough time to complete all of the questions and each of his questions are reasonably challenging to the point that if you looked at the solutions to any given problem, you would realize that you were capable of completing it. I got whacked on the first two midterms because I studied the basic content of his lectures and I made the algebra in his problems more complex than it needed to be (note to future students: while Vogel's problems are hard, the algebra in them should not be, otherwise you're probably on the wrong track). Vogel forces you to go beyond the given content and learn \"how to think\"...as cliche as that phrase has become. The problems on his tests are interesting and challenging, not recycled from the problem sets as is often the case. But once you figure out how to approach his test problems, it becomes more straightforward (my final grade was a lot better than my two midterm grades.\nIf you care much more about learning than grades, take this course. That being said, I have mixed feelings about taking this course since I got a whole lot out of this course but my grade was far less than spectacular.\nWorkload:\nOne gripe I had was the lack of workload in his class...as odd as that might sound. His recitations are somewhat useful, although the problems that the TAs go through are usually pretty easy. There were only three problem sets and all of them were ridiculously easy. It would have been better if we could have seen a few problems simlar to those that appear on the midterms a little earlier on the problem sets. 2 midterms & a final. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 10, 2010",
            "review_content": "\nThis is a ridiculous class. No matter what, do not take it! Professor Vogel rushes through the problems in his class and even though his slides are very structured, he doesn't teach the material on them at all. No matter how much you study, there is no way you will be able to answer the ridiculous questions that he comes up with in the final. Vogel almost finds it entertaining when students can't do his problems. There is a reason the averages on the exams in this class are so low. Don't be like me and think \"I will do fine because I do better than the average in every other class\". This class is just not the same. Trust me.. Stay away!\nWorkload:\nNot much work. He only gave us three problem sets throughout the year and it was easy to get hundreds on them. However there were 2 midterms and a cumulative final. The midterm averages were 69% and 57%. Oh and he curves the class to a B-\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "February 28, 2010",
            "review_content": "\nI agree with most of the other reviews on here. Vogel's class was pretty engaging and entertaining, and he made me look forward to going to class each day.\nHe made the book useless, and his slides were excellent materials. He even put the slides online so you didn't have to go to class, but not going put you at a disadvantage as he really explained the slides well. After I took his class I felt like I knew everything that he had taught and I knew it well.\nHis class wasn't as mathematical as some other econ classes I took. The only exception being his first class which was (necessarily) full of math as it described how to maximize with Lagrange (which was essential). He didn't particularly explain this well and his slides/first homework were very math-scary (this was my worst homework grade by about 20 points. Luckily he drops the lowest homework grade). But once you figure out how to do it (unfortunately, you have to do so through his examples, but they are very fluid and understandable), the rest of the class becomes much more understandable. After the first class, probably about 25% of the class dropped it because they were too scared.\nHis tests, the average on the first one was a 90, the second was about a 70 and the final was a 40. Yes the final was excruciatingly hard and the first one was way too easy. But, with that came a nice curve. \nIf you go to class and pay attention, you'll really understand the material and know the answers when he randomly calls on people.\nWorkload:\n2 midterms, final, biweekly psets\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 19, 2009",
            "review_content": "\nVogel is a pretty good teacher who makes the textbook worthless (it costs 110 dollars and you should not buy it. If you do buy it, buy the international version, which is cheaper but has the same things). He is entertaining and pretty funny at times. He keeps the class participating by calling on random people during lectures (you can pass on a question if you want) and goes through examples of problem types in class.\nThere is a recitation that is very very helpful where you review what you learned in class by going more deeply into the mathematics of it, but he is nice enough to post the recitations online when you miss one. \nThis class is very heavily math oriented and he himself said it was a little more mathy than the other sections, but he does an adequate job of teaching it most of the time. \nThe only complain I have about this class was the difference in difficulties on the exams. The midterm was really easy where most of the class got an A, the second midterm was difficult, with an average of 72, and the final was IMPOSSIBLE, with an average of 42.4. Of course, he curved it at the end. To give you an idea of the curve, I got an average of 95/100 on the homeworks (20%), a 95/100 on the first midterm (25% since it was my higher midterm grade), a 77/100 on the second midterm (20% since it was my lower midterm), and a 59/100 (35%), and I got an A- as my final grade. This was definitely a challenging class but it was doable.\nWorkload:\n6 Homework Assignments worth 20%, 2 midterms worth 25% for the higher midterm and 20% for the lower midterm, and a final worth 35%. Recitations almost every week with extra problems that are not graded.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 16, 2009",
            "review_content": "\nVogel's class was so much better than my other classes. He was interactive, funny, and really straightforward with the lectures and what we need to know. A warning: he is slightly more math-oriented in what he teachers, because he was an econ-math major at Columbia. If you have a hard time with math/game theory, you might want to take another teacher. He's such a funny teacher, and tries to relate everything to real life including wall street or his favorite drink, cherry coke. His homework sets don't take that long and are either very easy, or slightly more challenging, but VERY do-able. I would advise to go to hte TA sessions because sometimes they give the answers to homework. \nOH yeah, and beware of the fact that he randomly calls on students in class. If you're really shy, literally just wear like a blank tee shirt or something, or else you have a chance of being called on. It's really not that scary, because practically everyone he calls on answers \"pass....\" so there's no need to be ashamed if you can't answer his question and he calls on you. \nMy only complaint is he could have spent slightly less time on game theory, because I felt really rushed at the end of the class. and didn't feel as well prepared for the second midterm/final. but that could be because he REALLY prepared us for the first midterm with tons of practice questions. also, it really was not necessary to have two midterms, since the second one was literally two weeks before the final...\nWorkload:\nnot that bad. homework every other week. TA sessions that review practice problems. Two midterms (first=EASY,second=all right. kind of tricky and he made some big mistakes) Final=REALLY HARD AND LOTS OF MATH(mean=41). but had a pretty big curve. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 14, 2009",
            "review_content": "\nWorst professor at Columbia. He has no idea what he is doing, and though he may understand economics he in incapable of teaching it to anyone else. Half the class dropped out after seeing the first homework assignment which was very poorly written. It's not that microeconomics is a difficult course, it's just that all of his questions are so convoluted that you don't know how to answer them. His lectures are the only source of class material but he frequently has typos on simple algebra and can't explain how he gets his answers. On top of that he can't stop talking about how he graduate from Princeton and that he is such an expert in the Economics field. His tests got exponentially harder as the semester went on so that the final was impossibly difficult. Every question came out of left field to the point where no one knew where to start.\nWorkload:\nHW due every Wednesday\n2 hard midterms\n1 impossible final\nbe prepared to teach yourself everything\n"
        }
    ]
}