{
    "prof_info": [
        {
            "prof_name": "Bruce Preston",
            "prof_id": 1765,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Macroeconomics Seminar",
            "review_date": "January 07, 2011",
            "review_content": "\nBruce's teaching style is very laidback, which makes for a pretty stress-free seminar, especially one with only 10 students.  He was also flexible on the paper deadline, letting us hand it in anytime before the end of the semester.\nWe could write the final paper on any topic of our choice, as long as it related in some way to the seminar topic - central banking and inflation targeting.\nMy only critique would be that the seminar was light on discussion, although this improved during the second half of the semester when we were giving our presentations to the class.\nHe had to cancel or reschedule several classes because of travel conflicts, but he was great about working around our class schedules.\nWorkload:\n1 problem set, 2 page outline due in October, 45-minute presentation, and 7000 word paper on a topic of your choice\nGrading was 50% paper, 25% presentation, and 25% participation\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 23, 2010",
            "review_content": "\nBruce Preston is a solid guy and his intro to macroeconomics is a solid class. The lectures are based primarily on the textbook, which is comprehensive, although Preston also adds some more advanced theory and case studies for interest. You will need to be familiar with some fairly complicated multi-variable calculus (NOT in Calc I!) to understand some of the maths which Preston will walk through whilst expecting the class to follow.\nSPEAK UP IN CLASS. When Preston asks questions they are not rhetorical, he will wait until you answer. If no one answers he does get disheartened, but if you attempt to answer (even if wrong) he is happy. Also, he learns the names of the people who show up to class and speak regularly so that is always going to be a help grading-wise.\nHomework is tough and again very maths based. Both midterm and final will replicate some questions from the homework so give yourself an advantage and memorise the long answers (at least one will appear practically word-for-word on each exam). Also, read the additional readings he sets as the exams are meant to catch people out who havent done this, and his questions in class are also meant to give those who went the extra yard an opportunity to show this.\nFinal grade is generously curved. \nWorkload:\n6 bi-weekly problem sets (lowest score dropped) 25%, Midterm 25%, Final 50% (or 75% if you do better in the final than in the midterm, in which case the midterm is dropped). Generous curve.\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "March 09, 2009",
            "review_content": "\nThis guy is probably really smart but he stumbles around like Johnny Depp in Pirates of the Caribbean, and describes the substitution effect by saying that if wage increases, his one hour of leisure at the bar drinking beer becomes more expensive, so instead he might work an extra hour. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "September 24, 2006",
            "review_content": "\nI really don't know enough profanity to describe this guy's teaching style.  I know he knows his stuff, like pretty much everyone here, but he obviously does not want to be in class.  Most of his examples are as follows: \"Say I'm at a pub, imagining that I don't have to lecture to morons all day, and I have to choose between beer and wine...\" He complains that no one shows up; he should check out Elmes' class, which is packed full every lecture.  You will learn if you apply yourself, but god in heaven is it boring.\nWorkload:\nPretty tough, but doable problem sets every other week, with cumulative final and midterm.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 09, 2006",
            "review_content": "\nDO NOT TAKE MACRO WITH PRESTON, under any circumstances.  Wait two years to take it with someone else if you must.  I'm sure he knows his stuff but he is just a terrible teacher.  He obviously does not want to be in the classroom ,he's probably just here to do research.  You can go to his office hours and he's pretty nice but he might  make you feel  a little stupid.  I felt that he just made the class alot harder than it had to be.  I'm no longer an Econ major after taking his class.  \nWorkload:\nbi-weekly quizzes, 6 5-question problem sets 1 midterm, 1 final..hard.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "September 11, 2005",
            "review_content": "\nPreston is a pretty good lecturer, but he doesn't really venture beyond what's in the textbook. I'd call that a minor deficiency as I look for professors to enrich the material a little more than he seemed inclined to. \nThe material for the class is standard stuff: Aggregate Supply and Demand; asset, goods, labor markets, etc. You will spend about 25% of your time understanding the concepts and about 75% of your time connecting scenarios to the concepts. If you can justify your answers within the system, Preston will grade you well.\nPreston is very hung up on attendance (justifiably so) and did an amusing exercise at the end of the semester where he correlated grades with attendance. If  you attend the class, you barely need to read the book, and vice versa. \nWorkload:\nProblem sets are involved, expect to spend 5 hours on each. The midterm and final are difficult, but the class is curved so if you manage to get through 75% of the tests, you will do just fine.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "September 11, 2005",
            "review_content": "\nPreston is a pretty good lecturer, but he doesn't really venture beyond what's in the textbook. I'd call that a minor deficiency as I look for professors to enrich the material a little more than he seemed inclined to. \nThe material for the class is standard stuff: Aggregate Supply and Demand; asset, goods, labor markets, etc. You will spend about 25% of your time understanding the concepts and about 75% of your time connecting scenarios to the concepts. If you can justify your answers within the system, Preston will grade you well.\nPreston is very hung up on attendance (justifiably so) and did an amusing exercise at the end of the semester where he correlated grades with attendance. If  you attend the class, you barely need to read the book, and vice versa. \nWorkload:\nProblem sets are involved, expect to spend 5 hours on each. The midterm and final are difficult, but the class is curved so if you manage to get through 75% of the tests, you will do just fine.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "June 02, 2005",
            "review_content": "\nHe's definitely one of the more articulate professors I've had, but not very interesting. It is hard to stay awake in his class and he seems to care very little about his students or teaching, though he did get pretty annoyed by the poor attendance midway into the semester. His lecture notes outlined the book exactly, so you don't really need to go. I stopped going to class about halfway into the semester because I found going to class a waste of time since I fell asleep everytime, and so did about 75% of the class. Just read the book and do the problem sets and you'll be fine. Macro is really all about bsing. There is no one right way to answer a question. \nWorkload:\nbiweekly psets-not too bad; midterm and final-both very fair; and extra articles he posts on courseworks\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "June 02, 2005",
            "review_content": "\nHe's definitely one of the more articulate professors I've had, but not very interesting. It is hard to stay awake in his class and he seems to care very little about his students or teaching, though he did get pretty annoyed by the poor attendance midway into the semester. His lecture notes outlined the book exactly, so you don't really need to go. I stopped going to class about halfway into the semester because I found going to class a waste of time since I fell asleep everytime, and so did about 75% of the class. Just read the book and do the problem sets and you'll be fine. Macro is really all about bsing. There is no one right way to answer a question. \nWorkload:\nbiweekly psets-not too bad; midterm and final-both very fair; and extra articles he posts on courseworks\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 12, 2004",
            "review_content": "\nLet me first respond to one of the more critical reviews.  The reviewer acknowledges not going to the lectures and then complains about the lack of examples.  Hmmm... That should raise a red flag or two.  While Preston did not give an example for every problem, the combination of actually reading the assignment and going to the lectures was more than enough to figure out the problems.  \nIf your are interested in Macro, take this class.  Preston covers all the basic material.  The best part, however, is when he goes off on interesting tangents about case studies of the material.  He does a much better job of covering this aspect of the material than the text book does.  To summarize: If your are interested in economics and want to learn how models you learn are applied to the real world, you will probably enjoy this class.  If you just want to escape with doing as little as possible, you probably won't.\nWorkload:\nOne problem set a week 2-3 hours per set.  Your are encouraged to do these in groups so it's easy to check your answers.   Midterm (30%) and Final(50%).\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "January 08, 2004",
            "review_content": "\nBruce Preston may not be the most interesting lecturer, but he is definitely competent.  He is very organized-- his lectures are on powerpoint, and cover all the topics succinctly.  The only problem is, they also parrot the textbook, which does not toot my whistle.  If you are the type of student that learns in lectures, this is an excellent course.  If you prefer to learn from the book regardless of what lecture is like, take this course, you won't miss anything.  If you like your lectures to cover supplementary or slightly different material from the textbook, prepare to be disappointed.\nIt must be noted that Bruce is a newly-minted professor straight out of Princeton, so his teaching style has not matured yet.  He even seemed rather hurt when class attendance dropped precipitously a few weeks into the course.  He does make the effort to try hard, though, and does a pretty good job.   The only complaint is that he's a bit dry, but I suppose the Australian accent does help a little.\nWorkload:\nWeekly problem sets of moderate length and difficulty, straightforward midterm and final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 19, 2003",
            "review_content": "\nI thought Macroeconomics would be more interesting than Micro and I was completely disappointed. And the only reason is the way Bruce presents the material. He is very inexperienced in terms of teaching and explaining stuff. Everything is straight from the book. In other words, there is nothing he adds to this course as a professor. His lectures are not interesting at all. And since they are at 9 in the morning after a month you will not go to any of the lectures. His homeworks are so long and there are not enough examples to make you understand the analytical questions. I mean he is not too bad but not too good either. The midterm was OK but looooong. The final was even worse. I think this class can be very interesting if the professor puts the necessary effort into it. I went to his office hourse a couple times and he never gives you precise explanations and confuses you even more. I would certainly not recommend him if you want to learn something.\nWorkload:\nLooooooooong homeworks. Looooooong Midterm (30% of your grade) and Looooooong Cumulative Final (50% of your grade). Not a fair course\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 07, 2003",
            "review_content": "\nThe reviews critical of Bruce are clearly written by people who aren't interested in macroeconomics. Listen, if you're looking for a song and dance, or for a teacher who tells lots of anecdotes about his thirty years working at the Council of Economic Advisors, or a professor who adheres closely to some ideological view of the world, then sure, this isn't the class for you. But if you're interested in really understanding the framework for macroeconomic analysis, then Bruce is excellent. He's clear, he gives a thorough and repeated explanations (which is very helpfu in a class where the theories are not always intuitive or simple) and he's more than willing to answer individual questions during office hours. \nBruce is a young guy - he just got his doctorate from Princeton. This was his first time teaching the class. Anybody that's taught before knows that it isn't simple to produce your first syllabus. Near the end of the course, we start applying the theories towards current events, which is very fun. Although it's true that Bruce stuck closely to the book, I know for a fact (he told me) that he's planning on expanding such analysis in future classes. The book is a good text - sticking to it while laying the theoretical groundwork is very helpful, in fact, because it allows students to use the text to compliment the lectures, and it makes homework sets more applicable. There are different ways of understanding the economy, and if Bruce were giving a drastically different model than what the book used, that wouldn't be too good, would it?\nIf you like thinking about economics, and understanding the way models work (or don't work), the Bruce is a good professor. And I can only see him getting better. Why? Because he's exceptionally intelligent and he's nuanced in his understanding of the material.\n\nWorkload:\nProblem sets take about 3 hours a week . Mid-term is straight-forward if you've done the homework .\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 16, 2003",
            "review_content": "\n1) Imagine Ben Stein's character from \"Ferris Bueller's Day Off\".\n2) Add Australian accent.\n3) Subtract 20 years.\n4) Add euro-style clothing and haircare. (lots of black turtlenecks).\nHe seems nice enough, and shows all signs of knowing the material quite well.  Unfortunately, his lectures are completely unengaging, unspirited, and other than an unnecessary detour into the mathematics of consumption smoothing, follow the book to a tee.  He seems to be as put off by the 9:10 start time as the students.  On the upside, you'll never find yourself unable to find a seat, and the dim lighting accompanied by the lecturer's muted delivery offers ample opportunity to rest up for your next class.\n\nWorkload:\nA midterm (more long than hard), final, and laborious weekly problem sets.  \n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "November 16, 2003",
            "review_content": "\nProf Preston is organized and he has done a good job of conveying the concepts thoughtfully considering it is the first time he is teaching it. He makes himself available for office hours quite readily. And for those who take the trouble to attend class, his subtle sense of humour - like a fine Australian wine - can grow on you...\nWorkload:\nLong problem sets\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "November 12, 2003",
            "review_content": "\nNo one should take this class with Preston - he is the most boring guy in the world and everyone falls asleep during his lectures. He is not well organized, follows the book so precisely that it doesn't even pay to go to class. I am telling you - Columbia needs professors in economics who can really make the material interesting. Preston killed my will to major in economics....don't ever take a class with him.\nWorkload:\nvery long problem sets every week, a midterm and a final\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "November 12, 2003",
            "review_content": "\nWell I really can't say this is going to be a good review because I didn't really attend class that often. More like never.  But when I did go he basically bore me to sleep.  Not that he's a bad professor....he's actually quite good and the material is interesting.  He just doesn't do anything or talk about anything interesting during lectures, the lectures are extremely boring.  But not a bad class to take to be honest.  Not hard at all, work is easy.\nWorkload:\nProblem sets every week, they aren't hard but can take maybe 2 hours to do.  It's like busy work.  Midterm that was pretty easy and the curve was great.  Final.\n"
        }
    ]
}