{
    "prof_info": [
        {
            "prof_name": "Russell Romeo",
            "prof_id": 2195,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "January 23, 2011",
            "review_content": "\nProbably one of the easiest classes I have ever taken.  I did minimal studying and I got only 2 questions maximum wrong on one test... The others I only got 1 question wrong.  He presents his slides very clearly, so it is easy to understand what he is talking about. He is also very open to people asking questions during lecture. Honestly though, I think that this course does not really go that deep into the science.  That made it really easy to learn. For example, I was taking Hormones and Behavior with Kara Pham at the same time, and we had to know SOO many more details.\nThe lab for this class is harder, but it's not bad either.  Overall very easy to do well in this class.\nWorkload:\nMultiple choice question tests that were incredibly so much easier than anything I encountered in high school. . . I thought AP exams were supposed to prepare you for college, not make you bored at college?\n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "September 08, 2009",
            "review_content": "\nwhile i didn't enjoy this class (not a psych major; took it for the requirement), it was more or less painless. romeo is incredibly organized and straightforward. the lectures are basically verbatim from the textbook, but that isn't to say that lectures aren't worth going to. he's good at explaining things, which was helpful for me because i considered this class way out of my comfort zone. all in all, i wouldn't recommend this for someone taking it for the requirement, because it's more neuroscience than psych. also, the lab part was way more science than i ever imagined, and i struggled a bit, although she's an easier grader than she appears. \nWorkload:\nstandard 3 multiple choice exams. readings from the text. if you take the lab part too though, a little more work, and especially difficult if you're not science oriented. i stressed about the reports, but it turned out fine in the end. \n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "August 30, 2008",
            "review_content": "\nRomeo is awesome. He quite possibly knows everything about everything. Ok not really but people asked some pretty specific questions in class and he almost always knew the answer. Wasn't BS'ing his way through it either.\nVery approachable and yes, there's a lot of information, but take some time with it and you'll be fine! There were some questions on the textbook readings. I thought the reading added some good depth, but I can see how it would be overwhelming for a non-science person. If you don't read the textbook you aren't screwed. But do know everything in the lecture notes. And don't worry he goes at a good pace.\nWorkload:\nGood amount of reading which you can save until the week before the exam if you would like. Tests were fair. Approachable through office hours and after class.\n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "July 13, 2008",
            "review_content": "\nRomeo is a totally nice man who tries hard but falls short of being a good professor.  I really liked him at the beginning of the semester because he made jokes and seemed very casual.  However, the first two exams were obscenely difficult and required hours and hours of studying minute details.  The last exam was substantially easier, I assume because so many people complained that he finally gave in and gave a fair test.  He's very easy to approach after class or in office hours and generally seems to enjoy getting to know students.  However, lectures were straight from the text book and the powerpoint slides were boring.  He could have added some interactive component to this lecture class to make it more exciting, but instead I found myself browsing the internet for an hour like everyone else around me.\nWorkload:\nTwo midterms and a final.  The midterms were extremely difficult, the final not so much.  Reading and memorizing hundreds of terms for the tests, but no work other than this.\n"
        },
        {
            "course_name": "Behavioral Neuroscience",
            "review_date": "May 20, 2008",
            "review_content": "\nThough Professor Romeo covers a broad range of topics, the class is really interesting. Romeo was very good at explaining the material which wasn't difficult for Neuro majors (I'm in this group) and not too terrible for psych/non-majors. You'll do fine on the exams if you just study the notes. They have a lot of information, but it's really just a matter of memorization - not a lot of conceptual stuff. If you have any problems with it, you can always talk to him - he's incredibly smart and very approachable.\nWorkload:\nTwo exams (50 q's) and a final (non-cumulative, 65 q's). All multiple choice. The class had a pretty high average (B--> B+) so he didn't curve.\n"
        },
        {
            "course_name": "Hormones and Behavior",
            "review_date": "November 11, 2004",
            "review_content": "\nDr. Romeo is one of the best professor I've had in my 4 years at Columbia.  He's patient and down to earth; he hasn't forgotten the demands of life as student nor the curiosities. \nWorkload:\nExams are easy; study the notes and you'll be fine\n"
        },
        {
            "course_name": "Hormones and Behavior",
            "review_date": "November 07, 2004",
            "review_content": "\nGreat class! The material is interesting, relevant, and doesn't require a strong background in science to grasp. Though the textbook goes into extreme detail it is not entirely necessary to read it in order to do well. In class, the lectures are well organized and paced with allowances for questions. Later in the semester, in addition to the lecture material you also discuss recent and classic studies relating to the chapter being covered at the time. If you have any interest in psychology definitely take this class.\nWorkload:\nLight-Medium: Two fair midterms mostly based on material explicitly covered in lecture. Non cumulative final. \n"
        }
    ]
}