{
    "prof_info": [
        {
            "prof_name": "Evan Neely",
            "prof_id": 2080,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 30, 2013",
            "review_content": "\nI was not planning to write a review about Evan, but when I saw the below review I was spurred into action. Evan might be well-read, cocky, somewhat standoffish, and a little \"unprofessional.\" But he knows it, and he owns it. Evan respected us as students, and we respected him as our teacher. But he wasn't about to assume the role of a buttoned-up professor who is willing to cater to the every need of the Columbia student who thinks he's the smartest kid on the block. He might be opinionated, openly politically active, and perhaps a self-proclaimed anarchist, but in this very same way he tried to break down the BS that surrounds higher level education and offer us a different kind of experience. In other words, he was the kind of professor who wouldn't be afraid to go out with you, grab a beer (or three), talk about the world, and call it a day. I think that's something to be appreciated--not criticized.  \nTo better understand Evan, and \"how\" he taught CC is to first understand \"what\" Evan taught in CC. This was by no means a typical CC class, and Evan had no intention of making it one. He didn't want us to sit in a CC class, talk about our feelings, and regurgitate arguments on an exam or in papers. He encouraged us to look beyond WHAT is said by the many authors we read, and rather focus on HOW it is said. Because in the end, how a philosopher structures what he/she says fundamentally informs what is being said in the first place. To truly understand the philosophers we study in CC is to dig beneath the surface, recognize patterns of discourse and primary assumptions, understand the crux of the matter, and ask the right questions.  He challenged us to expand the depth of our thinking, and move beyond the kind of stagnant analysis that is required of us in other classes. Evan desperately wanted us to take these skills with us into the world and employ them everywhere we go. And while it takes years of studying philosophy to hammer them down, I can confidently say that Evan has at least impacted the way I consider the literature I read and the world around me--in true Columbia Core fashion. \nI didn't always support the way Evan taught class, and sometimes he was a bit much. But I appreciate the experience he offered me, and I hope others do as well. Most classes here are taught in a similar way, and so we arrive on the first day with a rigid set of expectations. Evan challenged those expectations, and for that I thank him. \nWorkload:\nA fair amount of reading, but more variety than on a typical CC syllabus. 2 papers\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 24, 2013",
            "review_content": "\nThis was Evan's last semester at Columbia, and he made that patently obvious. His unprofessional attitude often undermined class time, mostly because Columbia students weren't actually impressed by his ability to throw down beers. Additionally, many students found that Evan's inability to secure employment next year adversely affected their grades and class room experience. Fortunately, I did well, but many students who had him for the full year were flustered by his condescension and aggravated demeanor during the latter half of the year.\nIn short, Evan is well-read but cocky, which makes him seem standoffish. He often reiterated he did not like having a boss, but then again, he is also a self-proclaimed anarchist. I think Evan would make an excellent teacher down the road, but he needs to be more constructive and less sarcastic. Also, no one had the courage to tell him this, but his abuse of polysyllabic words and run-on sentences underscores his lack of knowledge (i.e., proclivity for BS).\n\nWorkload:\nMore reading than the average CC class\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 27, 2011",
            "review_content": "\nI took CC with Professor Neely this semester, after switching out of a horrible class. What. a. difference. Professor Neely seems scary at first, but if you are willing to discuss the work, and answer his questions, you'll see that he's generally a pretty cool guy. He does expect you to read, but the way he traces the arguments of each author makes the reading actually make sense. Grading was exceedingly fair, and other than that, it's a pretty typical CC workload. Take his section if you can....you'll do a lot of reading, but after this class, you will actually be able to explain the pattern of argument of any author on the syllabus.\nWorkload:\ntypical for CC, 2 large papers, etc.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "March 24, 2011",
            "review_content": "\nI took CC with Evan Neely, I switched into his class at the semester change. I love his class. I'm an athlete and I have no time to read all the required reading. He understands that if you don't want to talk in class he isn't mean about about. He jokes around which is nice because he lightens up the class feel. Neely is really smart and makes sure everyone knows that. He talks a lot throughout class, which is nice if you want to just relax, sit back, and listen. If you're an athlete take this class because you wont have to read for every class.  \nWorkload:\n2 papers and a final \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 06, 2010",
            "review_content": "\nEvan is a boss in general. He has a very wry sense of humor and has no issue picking on the kids that can take it. He is really smart and he definitely knows it so if that is a put-off for you, don't join his class. He takes a very different approach to CC than many other teachers do. He is trying to teach you how the authors make their arguments from scratch, and through the way they see the world and explain it, are subsequently airtight.\nThere are two long papers but he is super helpful and you can turn in as many drafts as you want up until a week before it is due. He will write you an essay back and is very nice and good at explaining things. He appreciates it if you've read the whole book before you talk to him about it, but even if you haven't he is still pretty chill and helpful. I liked him and i'm a math major aka suck at humanities. \nWorkload:\n2 papers\nfinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 16, 2009",
            "review_content": "\nProfessor Neely's approach to CC is perhaps different from that of other professors, but is, in it's own way, quite interesting.  Neely clearly demonstrates his background in philosophy through his focus on argumentative structures, and admittedly much of the class is spent discussing how people say what they say rather than discussing what they are saying in the first place.\nThis can be confusing and frustrating for those who aren't used to this approach, but it is punctuated with \"eureka\" moments when you figure out exactly what he is pushing you towards and understand, for example, not just how, but also *why* Locke and Rousseau disagree.\nNeely also alternates between being quite serious and being rather silly - he's willing to poke fun at students (and to take some needling in return) but if he asks for 8 pages on a paper, 7 1/2 simply won't do.  That being said, grading is fair so long as one follows the constraints of the assignment.\nWorkload:\nOne 8 page paper, one 10 page paper, class discussion.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 10, 2007",
            "review_content": "\nMr. Neely is cocky, arrogant, and declarative.  But that's not a bad thing.  He's great.  He'll be missed (this was his last semester as an instructor, according to him).\nHe's a little mis-leading when it came to the mid-term, but when the guy meets you at the museum and walks you through the works...he's smart and passionate.  He'll answer every question, and NEVER make you feel dumb.  He respects you.  He was a tough grader, but overall Mr. Neely will be very successful where ever he ends up.  \nHe could be a little more tech savvy, but hey...he's an art historian...\nWorkload:\nThree Papers, a mid-term.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 10, 2006",
            "review_content": "\nJudging by my peers' experiences with Art Hum, this course could have been a bore but Evan brought the material to life. He would answer every question posed in class in detail and was always willing to meet up outside of class to dicuss any art-related questions. He planned multiple trips to the Met, MoMA, and various galleries in an effort to accommodate our busy schedules. At the end of the term, I visited the Met again with a friend (not from CU) and she was amazed at the amount of knowledge I had about Western art. The best part was that I didn't even notice that I had learned all this information about art because the class was so enjoyable. If you want to have a meaningful Art Hum experience -- take it with Evan Neely.\nWorkload:\nNo required reading (thank god), 4 papers (done in groups, require that you travel to museums but Evan is flexible with due dates so there was little pressure), a midterm, and a final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 05, 2006",
            "review_content": "\nArt Hum, in the hands of the wrong person, can quickly become a boring parade of who's who in Western Art. Thankfully, Evan was not the wrong person. His lectures were compelling, challenging, and interesting. He always encouraged classroom discussion, allowing for minor tangents while still maintaining enough control to cover the necessary topics. Evan also always went out of his way to accommodate for his students' schedules - planning extra trips to the Met, MoMA, and PS.1 so that all interested students could go to these places with him and hear his lectures there. \nI really enjoyed this class and highly recommend him as a teacher!\nWorkload:\n4 papers done in groups - if you submit a rough draft the week before the paper's due and modify your paper according to his comments, you're pretty much set. Also a midterm and a take-home final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 14, 2006",
            "review_content": "\nWhile I agree that at first Mr. Neely seems totally pompous, once you get used to him, he is hilarious.  He assigned no reading, and realized that we are all forced to take this class.  This meant that he made sure to make it enjoyable and about understanding the actual art, rather than the published critique of the art.  He also was willing to meet students in pairs at the various museums to discuss art for papers, which is amazing because it is like having your own personal docent for almost an hour!  Mr. Neely is a great teacher, and a pretty cool guy as well.  Take his class.\nWorkload:\nno reading. 4 four page papers written in pairs. midterm. take home final.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "August 20, 2006",
            "review_content": "\nMr. Neely is something of a rarity at Columbia (and I would imagine at most major research universities that often have to rely on TA's to teach important portions of classes): he knows what he's talking about, and he's eager for you to understand it too.\nMore than willing to read papers in advance, he really carefully considers what you're writing, which, as another reviewer noted, is a welcome change from most other classes.  He finishes the semester by giving you a few recommendations for books that might fit your interests, which was pretty neat.  He's a pretty good museum tour guide, too.\nIn short, if get him (or can maneuver into getting him), consider yourself lucky.  He's the raddest.\nWorkload:\nWhatever Rosalind Krauss deigns to require.  We didn't have to do reading responses or anything, though, which was neat.                \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "July 13, 2005",
            "review_content": "\nEvan is extremely smart and not self-conscious about being so, but the fact is, he DOES know his shit.  He's a fair grader and if you show any genuine interest in the material he will absolutely go the extra mile to help you out.  I definitely recommend getting into his section because he will enrich the class immeasurably.  \nWorkload:\nIf he tells you to turn in a draft, do it.  It will help your grade a ton.  \n"
        },
        {
            "course_name": "19th Century Art",
            "review_date": "July 09, 2005",
            "review_content": "\nI completely disagree with the other reviewer. Evan is a great TA-- smart, patient, nice, fair. Yes, he expects a lot from his students, but he is a great teacher who comes to class prepared. He was able to clarify the most difficult texts and help us to develop skills to read well on our own. Always available to talk outside of class, Evan makes it very clear to his students that he cares about their learning. \nYour papers will come back with notes all over them because he has taken time to read and think about them. After writing so many papers for professors who glance at them for a second, I found this a refreshing change.\nThe bottom line is this: if you work hard, you will learn a lot from Evan. He will challenge you to think carefully, independently and thoughtfully. If you don't work hard, you will probably get an A anyways. (He gives As to practically everyone because he's cool). Take his class.\n"
        },
        {
            "course_name": "17th Century Painting and Sculpture",
            "review_date": "May 09, 2004",
            "review_content": "\nEvan is really pretentious.  He obviously thinks a lot of himself, but you can tell he's really trying hard to seem like he knows what he talks about.  YOu can tell it's really important for him to seem knowledgeable, but he clearly doesn't know much about the material.  He also makes really nasty and unnecessarily mean comments in his grading.  He's really petty in his grading and \"takes favorites.\"  \nWorkload:\nThere's a lot of work, but I guess that's more McPhee's fault than his.\n"
        }
    ]
}