{
    "prof_info": [
        {
            "prof_name": "Adam McKeown",
            "prof_id": 1244,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "World Migration",
            "review_date": "May 21, 2009",
            "review_content": "\nThere is one positive aspect of World Migration, and one alone: Professor Moya, who is knowledgeable, engaging, and clear in his presentation of the material. The negatives: McKeown's incomprehensible lectures, the unhelpful TAs, and the horrific and impossible exams. \nTake anything you can with Prof Moya, but NOT this class. Even his superior teaching does not balance out the stress caused by the negatives. Previous reviews say that this course is an easy 'A,' which is completely beyond me. Most people I talked to took this class P/D/F, and STRUGGLED to pass! Studying for exams is difficult because McKeown's notes and lectures (which comprise about 1/2 of the material and therefore 1/2 of the exam questions) are pretty much useless. I remember sitting in his lectures, pen in hand, attempting to take some worthwhile notes down, and leaving class with a blank sheet.\nBottom line: this class is completely overrated.\nWorkload:\nMidterm and an exam - both IMPOSSIBLE and probably should have been curved, but were not. 1 paper that I think is graded fairly, but does not balance out the horrors of the 2 exams. TA-led discussion sections that are a complete waste of time.\n"
        },
        {
            "course_name": "World Migration",
            "review_date": "May 13, 2009",
            "review_content": "\nIt's obvious everyone takes this class because Moya teaches it. McKeown--his other half--is abosuletly by far THE worst lecturer i have ever had. he talks about extremely broad themes but never stays on point and is a complete bore. He doesn't seem very knowledgeable either. The TAs for this class are INCOMPETENT and the grading is HORRIFIC. Everyone Pass Fails the class after realizing what a HORRIBLE HORRIBLE mistake they made by taking it. The class average on a midterm should not a 70, especially when everyone is actually trying to do well and is studying. STAY AWAY STAY FAR FAR AWAY \nWorkload:\n2 HORRIBLE mult. choice midterms and finals that are not curved, 1 essay\n"
        },
        {
            "course_name": "Globalization in History",
            "review_date": "May 01, 2006",
            "review_content": "\nAvoid this class like Ebola.\nBasically, Professor McKeown introduces a loaded concept like \"capitalism\" \"imperialism\" \"neo-liberalism\" \"inequality\" etc. Then he asks us what we think these terms mean. He points out the great contradictions in our definitions. Then, without any resolution, he concludes that these concepts are ridiculous, yet without giving us ways to think about such terms (except that they are ridiculous).\nThen, he'll start delving into a bunch of graphs, data sets, and tables, in which he applies the understood-ridiculous terms into his analysis. Meanwhile, he throws out new terms like \"GINI coefficients\" \"productive hegemony\" without defining them. Yet, during the whole impressive display of a poorly constructed powerpoint presentation, he fails to discuss the readings at all. \nFinally, the TA (Sam White) will later tell you that we need to pretty much understand all the readings. You'll have the final exam, final take home exam, and the book review thrown at you in the last week of class. And you'll be in complete confusion in the meantime. He says to you that it's not a good idea to pick out a few concepts that we're interested in, rather he's looking for a comprehensive understanding - a contradiction, I might add, given the fact that the lectures are anything but clear, so if we can't choose our interests, then there's no meaning left. \nSam will grade you harshly and *appropriately* criticize that we should understand everything learned (but really unlearned) in class. Although he clarifies the lectures in a way that the professor can only dream of, the TA will only add to the contradictions experienced in class by intimidating the students with unfair expectations. \nFinally, if you're looking for a \"history\" or a \"globalization\" class, \"globalization in history\" is everything but. It's not about *globalization* and it's not about *history*. It's too much and too little.\nYou'll analyze the processes of globalization since the rise of civilization (literally) down to the present day. He'll mention the Han Dynasty and WWII in the same breath. \nBeware: there is no narrative in the class. It's about using economic theory to make fun of economics as it happened throughout global history, without explaining the economics of global history.\nStories in history need not apply (except perhaps some stupid vignettes of his goofy travel photos). Globalization? What is globalization anyways?\nThis class will make you feel lost.  \nThe man can't teach and he has poor backup.  \nWorkload:\nToo little in the beginning, too much at the end, with disorganized + incoherent lectures in between. Added in is a completely unrealistic but rational looking TA.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 18, 2004",
            "review_content": "\nYou could do far worse than Adam Mckeown for a CC professor.  He is definitely a bit awkward, but it would be unfair to say that he doesn't know what he is talking about.  He was definitely much more in his element spring semester.  He did a nice job of placing the readings in historical context and in relation to each other.  The notes that the other review refers to were often insightful and served to guide the discussions.  Because he allows a lot of student input, I would definitely say it's the kind of class where the students in it make or break it.  However, Adam was very enthusiastic and it was evident that he liked teaching CC.  His roleplaying and debates, though weird and not always successful, were testaments to his willingness to take different approaches in order to engage his students.  He was also very available outside of class, easy to talk to, and a nice guy all around.\nWorkload:\nreadings comparably light.  two papers, midterm, final.  (the midterm and final were take-home essays second semester).  weekly postings.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2004",
            "review_content": "\nI have to say I honestly hated this class.  Though everyone told me CC would be better than LitHum, when you're coming from Tom Dale Keever's section (this guy is a gem for LitHum), Mckeown just doesn't compare.  He seems very nice and laid back initially, and I guess he is nice and relaxed, but bottom line is that he doesn't know his stuff.  He comes into class with a small sheet of notes prepared and begins lecture on whatever topic.  If the class went off on a different but still worthwhile topic, he would immediately end that discussion and bring the class back to his sheet of notes.  He's not very good at answering the class's questions, and I felt that at times he was rude with his responses.  Though many of my friends' sections spent 2 or even 3 class periods on Locke, McKeown didn't touch it (like, basically, removed it from the syllabus) because \"I don't really understand Locke.  I just don't get him.\"- that was his response to someone asking why we weren't reading it.  As another reviewer said, he does role play, and it takes all your efforts not to burst out laughing during his little scene.  I think there were 2 scheduled debate days, where kids were assigned to teams and had to go along with his role playing bits.  The same kids spoke in class most of the time.  You don't really have to say anything if you don't want to.  Class always started and ended 10 minutes late.  Toward the end of the semester, fewer and fewer students came to class.\nWorkload:\nlight compared to other sections (which is why only half of my class switched out after the first semester)- the reading is doable and necessary to say anything worthwhile in class.  Weekly online responses (not too bad) which varied greatly in length and quality from student to student.  only 2 papers, each about 6-7 pages- topics are ok, not great.  papers graded very harshly, and comments not that helpful.  it helps a lot to go see him while writing a paper and see if he agrees with what you're saying (because he grades on what he likes).  midterm and final were easy id's and lots of essay writing.  \n"
        },
        {
            "course_name": "Global Inequality",
            "review_date": "May 24, 2003",
            "review_content": "\nThis course has no focus. Prof McKeown is nice and passionate, but you will emerge no hardly more about history than when youcame in. it is sort of about colonialism, sort of about the world bank, sort of about trade, sort of about ideologies. sort of about everything and about nothing you can sink you teeth  into. youll leave with both fewer questions, and fewer answers\n"
        },
        {
            "course_name": "Global Inequality",
            "review_date": "December 27, 2002",
            "review_content": "\nExcellent course readings, fascinating syllabus. McKeown is young and too eager to let his students--the lame, halt, young and pierced all--fumble for the words to describe what they think they're learning. Teaches in the post-modern style, opening discourse to multiple answers, which is a fine way of thinking but a problematic way to teach. better to do some old-fashioned pedagogy, lay the material on us and then set aside time to discuss. Very friendly guy, though, and I still have to recommend the class because the material is interesting in 17 different ways.\nWorkload:\nNo tests, 4 essays, does notice if you've been to class, though most didn't bother to come.\n"
        },
        {
            "course_name": "Global Inequality",
            "review_date": "December 07, 2002",
            "review_content": "\nI actually really enjoyed this class, if only because the readings were so fascinating and the paper topics, if strange, really ended up making me think about the subjects at hand. I'm glad the class had such a historical and cultural rather than contemporary focus, because there is no way global inequality can be explained without talking about history and culture. History majors looking to fulfill requirements may find the class frustrating, but those truly interested in global poverty and its roots should not miss this class.\nWorkload:\nfour 4-5 page papers.\n"
        },
        {
            "course_name": "Global Inequality",
            "review_date": "November 18, 2002",
            "review_content": "\nThe first day that i went to class, i thought this class would be about globalization, and would explain to me why we see such disequalities in peoples wealth across the world. This course focuses tremendously on the 19th century and what happened during colonization, and explores concepts such as 'what is civilization?', not exactly as contemporary as i thought it would be. Don't be fooled by what the syllabus says. The workload does not seem like that much, considering it is totally optional to go to class (at least a third of the class never showed up) and there are no tests. However the essay questions make no sense and have nothing to do with what he talks about in class, so you get fustrated when you actually make the effort to go to class. This class is not really fun, and i think can be greatly improved if there was atleast some organization and structure to the course outline. \nWorkload:\n4 essays, 4-5 pages each, NO midterms or finals\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 11, 2002",
            "review_content": "\nmy goodness is this man out of his element. he has no business teaching cc -- nice enough, but knows nothing about the material. lets students prattle on ad nauseum because he doesn't know enough about the works to tell them where they're wrong. known to make comments like \"whoo, aristotle exhausts me!\" and \"i don't really follow descartes here...\" also has a strange affinity for role-playing -- brought a big pole into class and pretended he was the king of spain. stayed in character the entire time, accent and everything. drop his section like a hot potato. \nWorkload:\n2 papers, 5-7 pp. 2 points out of possible 200 deducted for each day late -- the one redeeming quality of the class. weekly responses to texts. \n"
        }
    ]
}