{
    "prof_info": [
        {
            "prof_name": "Matthew Wallenfang",
            "prof_id": 2859,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Cell and Molecular Biology",
            "review_date": "May 28, 2011",
            "review_content": "\nProfessor Wallenfang is leaving Barnard, but for the record, he is one of the best professors I have had in all of my time at the college. Professor Wallenfang's courses are always interesting, exciting and relevant. He is so friendly, and approachable and has such great enthusiasm for teaching his students. Professor Wallenfang's BIOL 1502 course is a difficult intro bio, but so worthwhile. He manages to always (consistently through the years) keep the content challenging and captivating at the same time. His incorporation of articles that are related to new developments make the textbook material come to life. Three years later, looking back at my notes in studying for the MCAT, I feel so lucky to have taken such a thorough course that really set me on the right track for bio success. I have come to know this professor very well and just want to say that learning from him is a true privilege! Barnard will not be the same without him. \nWorkload:\nTwo midterms and a final exam. Extremely reasonable, and just the right amount of work required to intimately know the material. \n"
        },
        {
            "course_name": "Introduction to Cell and Molecular Biology",
            "review_date": "May 16, 2010",
            "review_content": "\nI actually really enjoyed this course. Hertz's class I felt was much more intense than this class. Wallenfang let me actually enjoy the subject material. The reading load is a lot lighter this semester but it is still quite dense. I found I had to really go through the textbook in order to understand some of the lecture points. I really enjoyed how Wallenfang focused on mostly lecture. I made the mistake the first exam on focusing a lot on the textbook, which really isn't necessary.\nSo overall, I would definitely recommend this class. It isn't too intense, and Wallenfang is pretty enthusiastic and wants his students to learn.\nWorkload:\nReading for each lecture that is pretty dense. Two midterms and a final. Weekly online quizzes.\n"
        },
        {
            "course_name": "Introduction to Cell and Molecular Biology",
            "review_date": "May 03, 2010",
            "review_content": "\nProfessor Wallenfang is incredible! I truly enjoyed this class, and a large part of my positive experience was Wallenfang's infectious enthusiasm about Biology. He truly knows what he is talking about, and he even throws in contemporary examples of the material (i.e. NY Times articles and a clip from The Colbert Report)! Take this class if you are interested in upper-level Biology or if you are pre-med. That being said, the class can be difficult for students with limited exposure to advanced Bio... so if you never took the AP, you may struggle a little. All in all this was a truly worthwhile class! I looked forward to lectures even though they were at 9:00AM :) \nWorkload:\nModerate/Difficult depending on prior knowledge of Biology. 2 midterms and 1 cumulative final. Exams emphasize material covered in lecture. Weekly online quizzes that boost your grade (it counts that you do them, but it doesn't matter what you scored on them). Moderate reading, but once again, emphasis on lecture.\n"
        },
        {
            "course_name": "Introduction to Cell and Molecular Biology",
            "review_date": "February 19, 2010",
            "review_content": "\nAll I can say is that I miss Professor Hertz! Professore Wallenfang is seemingly impossible to follow. Even if you're a great student, there's no way to do well in this class without having had an excellent biology professor in high school. Wallenfang is a horrible professor, andhetalksreallyreallyfast! Boo. What a disappointment. I wish Hertz taught both semesters of intro. biology at Barnard. I think they should make Wallenfang go back to school to learn how to teach.\nI recommend attending the SI sessions, because I imagine you can learn a lot more there than you can in lecture. Also, be sure to do the reading, or else you will be screwed.\nWorkload:\nNot much reading, but the reading is dense. \n"
        },
        {
            "course_name": "Cells and Tissues: Cell Biology",
            "review_date": "November 24, 2009",
            "review_content": "\nThe bad reviews of Wallenfang on here are really surprising to me. Maybe he's improved a lot in recent years? All I can say is that as of fall 2009, he an excellent teacher. Most of the reviews that criticize him seem to be written by people who aren't interested in biology or haven't taken many bio classes before. DO NOT TAKE THIS CLASS IF YOU ARE NOT PREMED OR A BIO MAJOR. That being said, if you are premed or a bio major, TAKE THIS CLASS.\nWallenfang is insanely, insanely smart. He talks through cellular signalling pathways like they're nothing, he can answer 90% of the questions he's asked, and most importantly, when he doesn't know the answer, he will say so right away. That is the mark of a truly bright person. He's very helpful, nice, and reasonable, and can even be funny at times (although there isn't much time for humor in such a dense class).\nLike a previous reviewer mentioned, Wallenfang does not mess with your head. Questions on the exams will not come out of left field. They will be what you expect. It's not impossible to do well, and it's a lot easier to do well if you pay attention in class and look over your notes often. Of course you have to do the immense amounts of reading as well, but that's the nature of an upper level bio class.\nI would suggest printing out the slides before class really large, one to a page, and taking notes on those instead of the 4-to-a-page handouts he prints for everyone. Once I started doing that I found it much easier to pay attention and I took better notes.\nAll in all, it's a tough class, but because it's well-organized and well-taught, I never felt frustrated with it. I would definitely recommend it to majors looking for an upper-level lecture.\nWorkload:\nTwo midterms and a final, plus a presentation on a disease at some point during the semester (you pick the date). The midterms are hard, and each covers maybe 150-200 pages of the textbook. Final is cumulative but focuses on the last third of the semester material. If you can read the textbook sections before each class, you'll have a much easier time studying for the exams, but if not, it's not impossible to cram for a few days before -- I'd suggest giving yourself three or four solid days to study. I'd say it is harder than Intro Bio, but not as hard as Orgo.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "June 07, 2009",
            "review_content": "\nGreat Professor! He is very knowledgeable and always available to help students. I highly recommend taking the bio class with him.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "April 24, 2009",
            "review_content": "\nProfessor Wallenfang is by far one of the best professors I've ever had at Barnard.  I've been planning to write a review for him forever and now that my classmates are asking me about his Cell Biology course and I've spent countless times raving about it, I can say with great confidence that you DEFINITELY should take this class with him (if not another course) because\n1) He is extremely organized: Sure some (very few) of his outlines and lectures take more than one class period, but this is trivial compared to the structure of the entire course, and he works really hard to adjust his teaching to help students understand the information.  He posts his slides on courseworks and what I like to do is dl the outline before hand, format the figures, read the outline, and then take notes on my computer.  Organizing is fun. PLUS the pictures are hella colorful.\n2) There are no tricks to his tests: ngl, this class is difficult and if you don't keep your crap together, then you won't do well.  Don't underestimate this tests, but they are not impossible to do well on.  It's all about how well you know the information and how well you can apply it to certain situations (you'll see).  Another thing I like about this class is that it really makes you THINK.  No rote memorization and verbal vomit.  My friend and I reminisce about this class and talk about the pathways we remember and random protein facts.  It's one of those classes where if you study hard, the tests are friggin FUN.  No joke.  It's soooo rewarding.  \n3) He is a fair grader:  Wally doesn't mess.  with.  your head.  If you have a question about the test or the class material, he will tell you exactly what you need to know and grade you exactly how he says he will grade you.  You don't have to guess.  \nOh lordy, there are so many other reasons, but most importantly, he cares so much about his students!  He reads his CULPA reviews!  he wants to know how to improve!  I mean, how...friggin...  Yeah I heart Wally.  Seriously, to take constructive criticism with great humility is an admirable quality in general.\nAnyway, take this class (but if you have other difficult science classes, find a way to manage your schedule and drop some classes).  It's so good.  the end.\nWorkload:\nIt's been a year, but I think 2 midterms (we all sucked on the first one, but he curved it), one awesome final.  Clinical Correlations presentation (really fun, if you have a good group).  sorry if i'm missing some stuff, but it's been a year.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 12, 2009",
            "review_content": "\nThis class is not easy for a non-Bio person like me. Maybe it's different if you've taken AP Bio but with only freshman biology I couldn't understand the material being taught without doing the reading, even if Wallenfang says you don't need it. It takes a LOT of time to keep up with the reading, but if you read before each class suddenly lectures are much easier to understand. My recommendation is to always ask questions. Wallenfang is always up to answering your questions and though he get swamped before midterms, understandably so, if you stop by his office hours  or just go up to him after class he's always willing to talk with you. The hardest part of class are the midterms which are really hard. Part of being able to do well has to do with how good of a multiple choice test takes you are, but you definitely need to know your stuff. Read the questions REALLY carefully and no matter what your normal studying habits are make sure you get enough sleep before the midterms because he asks very tricky questions that require you to apply everything you've learned. There's really no way to predict what his questions will be like, even with the online quizzes and the old test questions before every class. I definitely recommend going to class though, and reading the ny times articles he assigns, because there are always questions on the midterm based on those and if you just read the book you probably won't do so well on the exams. Overall Wallenfang isn't the best lecturer but he is really dedicated so he'll do everything he can do to help you out. Just be prepared to actually work in order to get a good grade, unless you took AP Bio.\nWorkload:\nTwo midterms (hard) and a final (haven't taken yet). Weekly online quizzes where your grade doesn't matter but doing them counts towards your grade.\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "April 11, 2007",
            "review_content": "\nHighly recommend this course! You'll learn a lot, he's accessible, approachable, knowledgeable, and enthusiastic... take the lab too if you can! \nWorkload:\nThe reading is not as important as the notes from his lecture. Study the notes and the CC's and you'll be fine. \n"
        },
        {
            "course_name": "Molecular Biology",
            "review_date": "February 10, 2007",
            "review_content": "\nAfter having a horrible AP Bio. teacher in high school, I didn't think it could get any worse, I was wrong.  If I had not taken AP before, i would have NO idea what is going on. He loves to complain about how the textbook has some mistakes, talk about calling the kettle black.  One of his favorite things to do, is to go into tedious details about certain subjects, and then say \"but you won't need to know that for this class\", inferring \"I need to continually remind you that I know everything about microbiology...\". Last class we switched between the lecture notes for three classes because he has no focus.   \nWorkload:\nlight reading, but know every detail.quizzes that get graded on completion.  2 midterms, 1 final.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "January 31, 2007",
            "review_content": "\nI have to honestly say that I hate this class.  I read on the reviews on here, most of them being bad, but I still thought there was a chance that this class wouldn't be as bad as they said. Well, I was wrong.  His lecture are very very disorganized, and his explainations make no sense. I find myself every night simply learning everything from the textbook. Plus, he moves incredibly slowly.  I spend most of the classes looking at things online on my laptop.  This class is a total shock coming from Paul Hertz class. Even though I didn't do well in that class, I still find myself wishing I could go back to it.  So, unless you're a pre-med or taking this class for another major (like me), I wouldn't suggest taking this class.\nWorkload:\nNot much reading, but if you don't understand what he's talking about in class, you might want to spend a little bit more time with the textbook. 2 midterms, final.\n"
        },
        {
            "course_name": "Advanced Cellular Biology",
            "review_date": "January 20, 2007",
            "review_content": "\nSo... Wallenfang definitely knows his stuff and wants to teach it. In fact, he wants to teach all of it. He is really enthusiastic (which is great, actually), BUT the reading load borders on ridiculous.... it's really, really heavy. If you care about your grade at all, you will either not take it at all or should take it with as low a credit load as possible. \nThat being said, you will learn a TON. The class is entirely bio and neuro majors and approximately half the class is in the lab (which he referenced specially to them during lecture several times, leaving us non-lab people out!). He does have an impressive background - hopkins, upenn, etc, and he is genuinely easy to talk to - on the first day he asked us all what we did during the summer (FYI - just about everyone did research - from Columbia to Mayo to ER-volunteer /pre-med-y stuff). He also tries to relate what we learn in class to real-life diseases (\"clinical correlations\" that students present). He will answer just about any question and really likes people to talk and ask questions in class. Arguably, he picks favorites, but it's hard not to feel that way in a cut throat bio class.  \nWorkload:\nlots of reading... it looks like \"only\" 20 pages, but it will take you two hours to read it. one clinical correlation presentation worth about 20percent of the grade, two non-cumulative midterms and a mostly non-cumulative final. Tests are very hard... although it should be said that the hardest part about the class is not the material, but the competition. \n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "July 15, 2006",
            "review_content": "\nI agree with many of these reviews--Wallenfang isn't terrible, and his enthusiasm for the subject is impressive at 9 am. That said, though, this class really wore me down by the end of the semester, mostly because it requires a lot of interpretation of what, precisely, the man is trying to say. He makes a lot of mistakes, often corrected somewhat embarassingly by one of the TAs or lab instructors, and my notes were a big mess--firstly because of these mistakes and subsequent corrections (although some were left uncorrected, so I had a lot of contradictory information that necessitated many google and wikipedia searches), and also because he draws a lot of diagrams with a lot of arrows and they aren't really all that helpful. Another annoying trait is that he never, ever spell checks his exams, emails or online quizzes--it's a little thing but seems unprofessional or something. Also, while the first exam was really straightforward and fair, and the class average was a B+, Wallenfang was clearly compensating on the second exam, for which the average was, I believe, a C-. The final evened it out somewhat, but the guy is still trying to find his place as a young professor and doesn't always know what he's doing. If this class is necessary for a major requirement, it's manageable. If you can avoid it, though, take something else to fulfill distribution requirements.\nWorkload:\nThe reading is only a few pages a night but if you're taking notes and reading intensely, it can take an hour or so to do the assignment. Every week there is an online quiz, for which the actual grades don't count but taking the quiz itself counts for 5% of the grade (I'd recommend taking all of them--that amount could definitely push you up a grade). Three exams--two \"midterms\" and a final, which is cumulative but focuses on the end of the semester.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "June 08, 2006",
            "review_content": "\nWhile many students seem to be enamored by his cute appearance and likeable personality, this does not compensate for disorganized lectures and mediocre teaching. \nHowever, the TAs for this class tend to be good, and you can get by with not going to class and keeping up with the reading. \nDon't take this class though if you aren't pre-med--it isn't worth the competition or the teacher. \nOverall, it is a mediocre experience--not the best and not the worst. \nWorkload:\nlight reading, two exams, and a final\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "May 05, 2006",
            "review_content": "\nIf you're at all interested in biology, Wally Wallenfang's class is great (on the other hand, if you're just there for the requirement, you probably won't like it). He's very passionate and interested in the material and wants you to be as well. Reading is absolutely not necessary as long as you listen during lecture. If you do do the reading, it's light. His sleek attire is a definite plus to a 9am class. \nWorkload:\nTwo midterm exams and a final, light reading that can be done before the exams. \n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "April 01, 2006",
            "review_content": "\nWallenfang isn't the greatest professor ever, but he isn't the worst either.  The first thrid of the class seemed really slow and drawn out, especially if you've ever taken any form of high school chemistry, but the pace picks up after the first exam.  As the material gets more difficult, Wallenfang gets more disorganized in his lectures, providing an extremely complex long-winded example of a very concept and then failing to give a simple definition that can be studied.  Overall, not bad for a first time teaching, and I'm sure he'll get better as the years go by.  He's an earnest guy who wants us to do well, and from what I've heard, he's very approachable and available outside of class.  What can I say, not a great class, not a terrible class.\nOh, and he seems to REALLY like his cat...I'll leave that to you what to make of it.  \nWorkload:\nTwo midterms and a final.  The questions come heavily from the lectures, but you really need to pay attention to everything he says in class to do extremely well (especially when there are people who consistenly set the curve ridiculously high).\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "March 30, 2006",
            "review_content": "\nThis guy is not everything everyone says he is. All he does in lecture is draw pictures of examples and he tries to explain things. His lectures really have nothing do with the midterms or finals. Lecture is a joke half the time. He may be young, \"cute\" and nice but staring at his physical appearance is not going to help you understand what he teaches and give you a A in the course. If you want to do well study your textbook and make sure you pay attention at lecture to see what he might include on the midterm and finals. \nWorkload:\n2 midterms and a final, readings about 10 pages per lesson\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "March 29, 2006",
            "review_content": "\nHe tries hard and seems nice but is very very boring. He is not as organized as Hertz and makes a lot of mistakes. His tests are fair. He is not a very good teacher; his way of teaching is not systemized.  \n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "March 20, 2006",
            "review_content": "\nSo basically, I love this class. Prof Wallenfang is really funny and even though the lectures are packed with info, he makes it easier to sit through which at 9 in the morning, is appreciated. He really knows what he's talking about and what's more is that he really wants us to know it as well as he does. He's excited about what he teaches which is adorable but it also makes it easier to listen to him since he's not just droning on and on. He makes jokes during class, he's really organized (with handouts every morning), and he's really approachable if you make the effort. \nWorkload:\nReading the textbook is really repetitive since his lectures come from the text and the test questions come from the lectures. Still, good idea to do the readings. No more than 15 pages per lecture (sometimes it's only 2 pages). 2 midterms and 1 final exam. **Go to office hours - He really wants to help you understand what's going on so you should go talk to him if you need help.\n"
        },
        {
            "course_name": "Molecular and Cell Biology",
            "review_date": "March 16, 2006",
            "review_content": "\nProfessor Wallenfang is just so darn cute! Some of the Barnard girls in my morning class give him a hard time (I think because he's new), but in all honesty, he's really energetic, passionate, and enthusiastic about biology.  He was a little nervous about speaking in front of all us girls in the beginning of the semester, but now he's golden. \nWorkload:\nDo the reading if you like.  The tests are mostly on lecture.  Multiple choice = super challenging (especially when you have all those psychotic girls who study 24/7 setting the curve for you) \n"
        }
    ]
}