{
    "prof_info": [
        {
            "prof_name": "Wolfgang Mann",
            "prof_id": 113,
            "total_reviews": 32
        }
    ],
    "reviews": [
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "December 12, 2016",
            "review_content": "\nDisorganized, unresponsive, not transparent, uncommunicative and ineffective. We have been behind since week 2. The syllabus was never updated but rather, Professor Mann would send us email updated every week to tell us what to read. Those email updates came later and later throughout the semester until he emailed them on Monday morning when my recitation section was scheduled for Monday afternoon. I never knew what reading to do, I never knew what the lecture was going to be about. He never updated us about the first paper and gave us the topic very late and pushed the deadline. He updated us about the second paper the LITERAL LAST DAY OF CLASS when it was supposed to be due in early December. He pushed the deadline to December 19th and made the final due on December 22nd!! ON TOP OF THAT, he scheduled make-up classes for both Tuesday and Thursday during reading week and only when enough people complained about his ineptitude did he finally cancel the Thursday make up class. He is a horrible professor and frankly a boring lecturer. Make someone else teach that class. \nTake this class only if it required for you. \nWorkload:\n2 medium-length papers and take home final (short answers)\nRecitation section (attendance taken and we had to submit 2 questions about the reading before each section)\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "June 14, 2014",
            "review_content": "\nI agree with everyone who says Mann is not an easy professor.  As another reviewer says, if \"you're just in that stage of 'being curious about philosophy,' \" don't take Mann's class first.  It's harder than your standard intro classes.  This is especially true if it's your first time taking philosophy, or if you're a freshman new to college (because college classes are structured very differently from high school classes).  Also keep in mind that it is a HISTORY of philosophy class, so there's not that much philosophizing done.  Most of it comes from the readings (which you should 100% keep up with if you hope to pass the final).  I'd take intro to philosophy instead if you're not a philosophy major.  And if you're taking this for a major requirement before you're officially sure you want a philosophy major, DON'T TAKE THIS CLASS. Save yourself the \"unprecedented stress\" (see other reviewers) that it will definitely give you.\nAs for Mann's lecture style, he tries to structure things on the board, but ideas invariably end up crossing all over the place. If you do the readings beforehand (aka on time), it'll help you a lot. Yes, he is a boring lecturer - I managed to nod off in his class though I never fall asleep in any other class - but only if you're not 100% invested in the subject. Usually what happened to me was that my mind glazed over his words (confusing/abstract philosophical ideas from classical philosophers).\nIN CONCLUSION: I was one of those people agonizing over \"should I take Mann for fun or not.\" Answer: If you're willing to be dedicated (eg your life is philosophy, I'm saying this seriously, you do NOTHING with your time except philosophy), fine, take his class. If not (eg You enjoy life outside the library and spend your hours on things not philosophy), DON'T TAKE THIS AS YOUR FIRST PHILOSOPHY CLASS. Save yourself the trouble.\nWorkload:\nshort assignments, 2 short papers, 1 long paper, no midterm, final. Read Aristotle's Physics and Nicomachean Ethics, Plato's Republic and Euthyphro and Protagoras, Stoics (Cicero's De Finibus, Diogenes Laertius), spent last 2 classes on Augustine.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "October 02, 2012",
            "review_content": "\nI took this class in the first semester of my freshman year. At first, I was really concerned that I would be lost because I hadn't taken any 1000-level philosophy courses, but it turned out that this is a pretty good introductory class. My TA, Nick Engel, kept asking me if I'd taken any basic logic classes, but apart from those exchanges, I don't see any reason why you can't start out in this class.\nNick Engel was a decent TA. He led good discussions, and he was very patient. However, when I met with him to discuss my essays, it was always clear that he hadn't read my drafts. One time, he admitted this right off the bat, then proceeded to spend the next half hour telling me things I already knew. He eventually read my essay draft and gave me comments -- the day before it was due. To be fair, though, I did decently well on all three of the essays - B plus to A range. From what I heard, the other TA, Moss, was better.\nMann is a good lecturer -- I can see why people get annoyed with him for sounding monotonous, but that didn't bother me, since the content was interesting. He assumes that you've read and more or less understood the material before each lecture. His lectures are all based on the ambiguities and multiple interpretations of \"wrinkles\" in the material.\nWriting essays was kind of a pain. I struggled, especially with the first one, but the struggle probably helped me understand the course material more than the discussion section. And like I said, the TAs grade VERY generously. For the first philosophy essay I ever wrote, I was expecting a gentleman C, but I got an A minus.\nThe final is passage IDs (he gives you the author & book, you just explain the importance of the passage), and then a brief essay.  I didn't study very much for the test -- how could you, except by rereading everything? -- but I thought it was pretty easy.\nI ended up with an A minus. Interesting class, TA could have been better, don't hesitate to take it if you're a freshman who's interested in philosophy -- you can do it!\nWorkload:\nFine. Short selections from the Pre-Socratics. Selections from Aristotle's Physics and Metaphysics, as well as his De Anima. Maybe half a dozen Platonic dialogues (my favorite readings). Some brief readings from Epictetus and other Stoics (my least favorite). Some silly but short selections from Anselm\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "April 11, 2012",
            "review_content": "\nThis was my first philosophy class and I was really excited to study the great philosophers whose names were ubiquitous on libraries, statues, etc. Suffice it to say that I was genuinely curious about philosophy. \nUnfortunately, this class was extremely difficult and caused me unprecedented stress as a first-year. The works were, of course, challenging to get through and writing philosophically was something I had never done before. I really needed guidance, but lecture did not provide me with this. \nWorse, I went to every single lecture and struggled to stay awake every single time. For those insomniacs out there, get your hands on a recording of Mann lecturing and I can guarantee you that you're problem will be solved. Okay, that's a little harsh, but you get the idea. Maybe that's my fault... The point is, however, by falling behind in understanding lectures and readings, I never felt comfortable talking directly with Mann. I never asked him questions and I had plenty. \nDespite all the trouble I had with this class; I made it through, thanks to the TA, Matt Moss. If you're looking up Matt Moss to see how he is as a teacher - whatever it is- take it! He's phenomenal. His recitations made philosophy exactly what I envisioned when I signed up for this course: engaging. He is an upbeat character, listens to students really well when they pose ideas, and is ultimately quite understanding that members of the class are at different levels. Moreover, he provides support to everyone and does a thorough job every single time. All this is only possible because he loves thinking and wants to help others do the same!\nAll in all, I recommend Matt Moss and I do not recommend Mann or this course if you're just in that stage of 'being curious about philosophy.'\nWorkload:\nDense. Very dense. Most could not keep up with the reading, but that will be okay assignment wise... you'll just have to prep hard for the final. \n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "April 09, 2012",
            "review_content": "\nOh man, what a terrible professor. I've seen people locked in their ivory towers, but nothing quite like this. He called someone's question outright stupid, was intolerant for the most part of other opinions and questions, and did not show intent to engage the class critically. He also delayed giving us assignments beyond the dates provided, but still expected us to do everything (he did cut down the third paper a bit, but it was still long and under time constraints). That said, I do have to give him credit for well-constructed (and super-boring) lectures, analyzing the material painstakingly in order to make the material as clear as possible. He was challenging and his assignments compelled us to think about the readings, not just read them. Still, I would have far rather taken this with pretty much anyone else. \nWorkload:\nTons--three papers, final exam (lots of materials and long), short assignments (three that became one)\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "January 27, 2012",
            "review_content": "\nMann's class is difficult. His papers are difficult and he makes no attempt to soften his explanations for student. At the end of the class however, you feel as if you have accomplished something so if you are looking at being a Philosophy major, you should definitely take Mann's class. It is not an unrealistic class however. If you are an independent learner who is comfortable with reading difficult texts, you will probably get a good grade in the class. Mann's lectures are difficult to stay awake in if you have not already done at least some of the reading. His spoken sentences are long and convoluted -- you will either hate this aspect of lectures thoroughly or will get used to the idiosyncrasies that make Mann a peculiar but definitely interesting character. If you stay abreast and develop a real interest in one of the texts, talking to him after class or during office hours will prove to be a rewarding experience as he expects an intellectually maturity from his students. \nWorkload:\nIt seems to change from year to year but the readings are heavy. He usually does not give too many papers but the questions are challenging. Nonetheless, your TA is likely to be very good and will understand that the class makes unusually high demands. My TA willing to spend large amounts of time working through essay drafts with every single person who requested for help. The exams draw on a solid understanding of the later parts of the course but are not usually as difficult as feared. Grading is fair. \n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "March 15, 2011",
            "review_content": "\nAn incredibly engaging class, but Mann does not make it easy. That is, he has so much thoughtful analysis to share that it is easy to be overwhelmed. The whole lecture from beginning to end is filled with complex concepts and rarely gets anything repeated. Prepare to be taking notes and going over them after class if you want to understand the material fully. Being now 'treated' to the Hist-Phil II by John Morrison, I look back sentimentally to the days were I needed to attend lectures. Mann did not explain the readings, but rather gave additional perspective and introduced the work of different scholars (which made the already large reading load just more intense, since long and dense scholarly articles were added to a 'recommended' reading list). I hear Katja Vogt does this segment at least equally well and I am inclined to believe it, but this class was certainly no waste of the significant time I spent on it. The only downside in my perspective was that Aristotle took up some time initially alloted to the Hellenistic period and Augustine. Suffice it to say I'm no fan of Aristotle.\nWorkload:\nSome texts by the pre-Socratics, 5 or 6 platonic dialogs, the whole Nichomachean Ethics, most of the Metaphysics and De Anima and several chapters of other Aristotelian lectures. Stoic, Skeptic and Epicurean fragments and as mentioned scholarly articles on all of those. 3 5-page papers all with exceptionally helpful and detailed comments and a comprehensive final exam.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "December 05, 2010",
            "review_content": "\nThere is no doubt that Professor Mann is absolutely brilliant. Every single class, he delivers a lecture profound enough to be the thesis of an articles in scholarly journal. That said, the lectures may be too profound for the class. To appreciate the lectures depends on your coming to class with a full understanding of the content of the readings, as Professor Mann devotes zero class time to a study of what the readings are actually saying. \nMy favorite Mann lecture was about Plato's Republic, because I had already studied it in CC. Because I was already pretty familiar with the text, I was literally blown away with what Professor Mann had to say about it. However, when we begin reading harder material, despite having done the reading, it was difficult for me to keep up. For this reason, many people in the class don't do the readings: because unless you spend a lot of time working to understand the readings on your own, it's easy to get nothing out of the class. \nIt's also worth mentioning that Professor Mann is not very approachable, and seems to dislike taking questions during class. Students probably ask one question a class, and he usually waits to call on them until he's done making a point, sometimes even appearing annoyed about being interrupted. That said, if approached after class or during office hours with a legitimately worthy question, Professor Mann is willing to talk to you.\nThis is not a bad class, it's just too advanced for a 2000 level survey course. Overall, I'm glad I took it, especially because the TAs were really great.\nWorkload:\nThe amount of reading is not bad for a philosophy class. There are a few short assignments, two short papers, and one longer paper. Professor Mann deviates often from the due dates on the syllabus, which can make things a little harder.  \n"
        },
        {
            "course_name": "Plato",
            "review_date": "July 26, 2010",
            "review_content": "\nLook, I understand why Mann gets a bad rap.  I didn't like him at first, either.  He doesn't interact with the class much, snaps at people who show up late or text each other during class or just drop things, and he has this way of moderating every clause in his sentences -- \"Socrates'  message, if Socrates can be said to have a message, which is debatable given the ambiguity of the Greek word 'eudaimonia,' might be intended...\" -- but after a few classes and a few cups of coffee, I realized that there's a great reason for all of those things.\nThe reason is simply that this man is brilliant.  He zeroes in on distinctions in the texts that seem insignificant at first; but if you do the reading and make an effort to follow his lectures, you realize that he's actually giving you a nuanced and completely fresh way to read the text.  He does take questions at the end of class, but they tend to be questions that don't reflect an understanding of his lecture, and he can be a bit short in answering those.  However, if you ask him something worthwhile -- which is difficult to do; make no mistake -- he'll sometimes devote a whole lecture to working on the problem.  After class, he's generous with his time (he reads everyone's papers, even though the TAs have already graded them, and leaves comments), and he's a walking library of scholarship, ready with an article for any topic you can think of.\nIn short, he's the opposite of pedantic.  He's a good-natured and profoundly wise person under the gruff facade.  His classes are not for the intellectually lazy, but if you demonstrate a real desire to learn from him, he'll hold your hand the whole way.  He's not even a particularly tough grader, although you find yourself wanting to work for him.  And he's actually very funny.  He's often making jokes during class that go by totally unnoticed -- \"To the extent that this is a good chair, what attributes make it such? Perhaps this question is too difficult.\"  He is also surprisingly self-aware and will make subtle and clever jabs at his own jargoned speaking style.\nI'm about to be a senior, and as far as professors go, I've had them all -- Dames, Gray, the Kitchers, Mercer, Moyn, Neuhauser -- but no one has made me fall in love with a book the way that this man has.  Take anything he offers, do the reading, and drink a cup of coffee before class.  Your life will turn around.\nWorkload:\nNot bad at all.  Two 8-page papers, difficult to write but graded kindly.  Occasional single-page assignments which don't really affect your grade (they're graded in checks).  Reading varies.  Never more than 20 pages of text.  Some of the supplemental essays are difficult but worthwhile, and Mann explains them very well in class.\n"
        },
        {
            "course_name": "Plato",
            "review_date": "May 13, 2009",
            "review_content": "\nProfessor Mann is very intelligent and capable, he is good at explaining complex ideas and conveys information splendidly. If you pay attention in class, you will do well - no need to go above and beyond outside of the classroom, Mann chews your food for you. However, he is NOT very sociable and throughout the entire semester there must have been 3 or 4 questions asked in total. Get ready to be talked at. No interaction. He is also a very easy grader. \n\nWorkload:\nLight. Two papers - Five and Ten pages. One final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 22, 2008",
            "review_content": "\nOh, Professor Mann. How I disliked your class. Let me count the ways. You are ever so knowledgeable about Plato, but when you speak you are so boring I cannot follow what you say. You know ever so little about everything else, and yet you still lecture instead of having even one discussion. You say \"you might think\" so often, but you never ask us what we do, indeed, think. You are hands down one of the least interesting teachers I have ever taken at Columbia, and although your reviews were bad I thought you might be controversially interesting. I was wrong, Professor Mann, and I had to sit through the driest lectures known to Man(n) t know CC could be so uninteresting, but you rose above my hopes and made it literally the worst class it could possibly be. Thank you for my pain and suffering, and I hope you stick to not-CC in the future. I did quite like your rainbow plaid shorts with the high white socks, however. I might attend a Wolfgang Mann fashion show, if indeed such a thing existed.\nWorkload:\nHe took things off the normal CC thing and didn't add too much extra stuff, which was nice, and you don't actually have to do any reading because it's a lecture. . . which sounds nicer than it is. Easy grader. Not worth it for the painful lectures, though.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "December 27, 2006",
            "review_content": "\nA melange of disasterous delivery and eloquence, if such a thing is possible. Overall an erudite, intelligent, damn smart man with a thorough grasp of Greek and a ferocious attention to textual detail. He definitely knows what he's talking about, unlike some professors in this department. However, the fact that he knows what he's talking about does not mean that you will too. At moments, when I was able to follow his arguments, I found him brilliant, though more than ninety percent of the time it felt like the class was running after him while he was off somewhere floating on a socratic cloud of revelation.\nProfessor Mann is very approachable during office hours and he will take time to go over whatever you need help with, be it the material or papers, but be aware that you likely will not go to office hours because you will not know even how to begin asking for help. I think a lot of this has to do with the fact that he requires that you do all of the reading, and no my sparknote-reading friends, sparknotes won't help, and that's a given. This is philosophy, not lit hum. Because his lectures consist of jumping through theoretical hoops in a monotonous, circuitous, agonizingly slow speech that makes you feel like jumping out the window or anestesizing yourself with that ten pound complete works of Plato, if you do not understand the works for yourself, from your independent reading, you will not get anything out of this class. \nWith that said, he's really trying and I am by no means saying this is a horrible class. Be sure you are aware that you need to put work in, otherwise you'll feel like you went scott free all semester and then at the end the final will draw and quarter you (bulshitting does not seem to be an option, ever). He's a generous grader, however.\nWorkload:\nThree papers, (5-6 pp.) and a final - IDs, short response, and essay. \n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "February 01, 2006",
            "review_content": "\nFor some people this class is probably a godsend.  I did not like it at all.  Mann's lectures are very clear.  He is very, very, very passionate about ancient philosophy, as I discovered by looking up his resume.  He is the ultimate philosophy geek.  He showed up to the first few days of classes with his thick rimmed glasses, unkempt beard, and disturbingly greasy hair wearing a shirt and tie with grimy old tennis shoes.  He later ditched the tennis shoes, but you get the point.  The readings are, as expected, extremely dry, and as you can guess, Mann assigns quite a lot.  This was the trouble with the class for me.  I think that if I had enough passion for philosophy to wade through the hundreds and hundreds of pages of insanely dry philosophical texts, I would've enjoyed the lectures a lot more and would've loved the class in general.  As it was, I didn't do many of the readings, often became lost or bored during lectures, and scraped by with a B.  My advice is to take this class if you know you LOVE philosophy (specifically ancient philosophy, and by that I mean READING actual philosophical texts by those guys).  If you don't, DO NOT take it.  One other thing that I should mention is that I found Mann's demeanor to be MOST unpleasant.  He is one of the most high-strung people I have ever laid eyes on, and he seriously snapped at students on several occasions for their cell phones ringing in class.  You could hear a pin drop.  Once he snapped very rudely at someone for accidentally dropping a book. \nWorkload:\nTwo papers which I didn't try that hard on and didn't do too well on.  No midterm.  The final was easier than expected, but I still didn't do that great judging by my final grade.  And, of course, there is the proverbial shitload of Aristotle, Plato, Parmenides, St. Anselm, etc. etc. etc. that you will have to slog through to get anything out of the course.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "January 21, 2006",
            "review_content": "\nOverall, I enjoyed the class.  Professor Mann is very intelligent but can get boring in his presentation at times.  He has a very academic approach to the works and often provides interesting insights into how they relate to one another.  He has tough standards for his papers so be prepared to write papers that are in accordance with what is expected of philosophy papers.  The class has a nice balance between providing the different philosophies of the time period and going into detailed analysis.           \nWorkload:\nTwo papers and a final.  \n"
        },
        {
            "course_name": "Plato",
            "review_date": "May 22, 2005",
            "review_content": "\nMann really isn't that bad. The key is to do the readings beforehand. I didn't do this for Aristotle and I thought he was pretty bad. For Plato, I did do the readings beforehand and realized that he's actually pretty damned good despite his horrible speaking style.\nHe's a really easy grader, too.\n\nWorkload:\nAristotle: midterm and final, plus two papers.\nPlato: two papers and a final.\nIn both courses, the paper topics were on stuff we hadn't covered in lecture, so we had to interpret the text on our own. If that kind of stuff throws you, you may want to stay away, but like I said above, he's an easy grader. \n"
        },
        {
            "course_name": "Aristotle",
            "review_date": "May 11, 2004",
            "review_content": "\nProfessor Mann is without a doubt intelligent; however he is consumed with the pedantry of a classical philologist. At no point during his seemingly endless lectures did anything of philosophical interest emerge. The majority of the class was spent pondering how to translate and re-translate various Greek terms, I guess in the hopes that such a futile exercise would give fuller meaning to AristotleÂ’s already dry and ponderous texts. The result was an exquisite torture that not even Dante could have concocted.  Abandon all hope ye who enter this class.\nWorkload:\n4 page paper, 8 page paper, midterm (impossible) and final. an exercise in hairsplitting.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 25, 2003",
            "review_content": "\nThree words to describe Prof. Mann: verbose, circuitous, and confusing.  Although he knows the material well, you won't get much out of his classes thanks to his miserable delivery and penchant to dwell upon seemingly irrelevant minutiae of the text.  Discussion is reduced to some token questions and answers that lead nowhere. \nHe's a nice guy, but like the reviewer before me said, is in dire need of social skills.\nWorkload:\nnot too bad--he actually cut down on the reading list\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2003",
            "review_content": "\nI think many of the other reviews were a lot harder on Prof. Mann than necessary.  Granted, he's not the kind of professor with whom you will develop a deep personal relationship, but he definitely knows his stuff.  He's very smart and his lectures are well-structured and interesting.  No matter how stupid the question, he answers fully and seriously, and he grades very generously.  He is very concerned with his students understanding of the texts and always available and ready to explain further.  Conversation in class was a little stunted at first, but the class warmed up by the end of the semester.  Mann was a fine professor *CULPA censor*\nWorkload:\n2 longer papers, 3 or 4 short (1 1/2-2 pages) reading responses, midterm, final--the usual lit hum workload and never a pop quiz. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 19, 2003",
            "review_content": "\nWay boring; way weird. hard grader.\nWorkload:\nnot too bad. \n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "May 13, 2003",
            "review_content": "\nFirst of all, Augustine was not touched on in this class, and the pre-socratics were only covered briefly as a useful background setup for some of Plato's ideas etc.  Mann himself made a joke about this the first day.  His lectures were absolutely precise, and any complaints about boredom (see virtually all other Culpa postings on this professor) reflect a lack of true interest in learning the subject material.  For a survey course, a surprising level of depth was reached on all the material, but Plato in particular, since we spent the majority of the first half of the semester reading his dialogues.  Mann draws illustrative diagrams, and comprehensively plans every single lecture, building up a solid framework for the class to attempt to wrap their minds around.  Unlike the stand-up-comic-like Christia Mercer (who teaches the second survey history of philosophy course), Mann's lectures do not stray from the subject material; this allows, in my opinion, for a much greater depth to the understanding of each philosophy.  He does not approach it, like some do(mercer...), from a standpoint that his students aren't capable of fully understanding the concepts presented...doesn't dumb down everything to examples from holywood, etc. just for a laugh.  You will not become buddies with Wolfgang Mann, but, if you are dedicated to the subject, you will learn a lot about plato.  Highly recommended.\nWorkload:\nLot's of fantastic reading.  2 short papers.  midterm and final.  I think about 35% of the class (according tot he transcript) got in the A range.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "January 14, 2003",
            "review_content": "\nProf. Mann's lectures are fairly informative, and relatively well structured. However, his delivery is so bad that I never managed to pay attention for more than a few minutes at a time and eventually just stopped going to class. The material is interesting, and Mann seems like a good guy, but I (and all my friends who were in the class,) found his lectures pretty unbearable.\nHe is however, a somewhat easy grader, and one does learn a good deal about philosophy. I would strongly advise against this class for non-majors and say it's a fine way to fulfill the requirement for majors.\nWorkload:\n5 page paper, 8 page paper, midterm, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 12, 2003",
            "review_content": "\nThis man comprehends the material, but doesn't necessarily know how to communicate it smoothly to the class.  He fails to motivate the students to actually partake in discussions because he either dictates the integral points of each work or opinionates over the material.  In addition,  he has trouble returning papers or quizzes on time.  Nevertheless, he's a compassionate, well-educated man who is in need of social skills.\nWorkload:\n3 review quizzes, two or three 3-4 page papers, and one 8 final paper.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 15, 2002",
            "review_content": "\nHe's a really nice guy and is very willing to help students during office hours.  He knows the material well but tends to be pretty boring in class.  The class is more of a question and answer session than a discussion section which also adds to the boredom (b/c the same 5 kids answer every question).  He grades pretty easily and everyone gets an A or a B.\nWorkload:\nOne or two review quizzes, two4-page papers, one 8-pg paper, midterm and final\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "May 07, 2002",
            "review_content": "\nThis professor speaks in a monotone and in a very slow pace. I used to photocopy people's notes for classes i attended because i slept through them. His lectures are very clear, however, but elementary. It is a good intro. to philosophy because the readings are not very abstract and not too difficult to read. I would have loved this course if it was taught by a different professor because the actual content was philosophy before it is really abstract and complicated. \nWorkload:\ntwo short papers, midterm and final. the grading was pretty good especially on the tests-those are very easy. Also, on the final grade he is pretty nice.\n"
        },
        {
            "course_name": "Plato",
            "review_date": "January 30, 2002",
            "review_content": "\nProf. Mann usually gets a bad rep for being a dry lecturer, but his Plato class was really outstanding. Clearly, he knows his stuff backward and forward, but the nice part about it is that he seems to want to put out questions that interest him to the class, rather than just recapitulating questions to which he already knows the answer. He was able to get some pretty exciting discussions going in the class, and we ended up talking about a range of philosophical issues with regard to the texts. Mann seems more interested in language and knowledge than in politics, which is good to know if you're thinking about taking the class and expecting/worrying that it will be about how to form a just government or something like that. The paper topics for the final paper, although very straightforward questions, turned out to be quite difficult--not in the tricky way, but in the way that good philosophy is supposed to be difficult. \nWorkload:\nMainly just reading Plato dialogues, with the occasional secondary article thrown in. The reading was not overwhelming, but it was certainly substantial. Midterm, miniature assignments (an outline of the text, a recapitulation of the third man problem, etc), final, and taxing final paper. There are no surprises in any of this, just hard work.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "January 29, 2002",
            "review_content": "\nMann is one of the most brilliant professors I have had at Columbia. His understanding of the material as well as his critical insights make his course very worthwile. I found his lectures to be powerful and very educational, but you do need to be able to stay alert during them. He is extremely kind and always willing to chat further about subjects during office hours. I found that I learned a great deal during his course, especially in my ability to structure a philosophical argument.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "January 19, 2002",
            "review_content": "\nIf you do all the readings thoroughly you'll find the lectures are really helpful - he talks about the authors, the purpose of the text, and the context. Don't expect it to be entertaining though - especially not if you haven't read up. Also, don't rejoice too much if he has to cancel class, he will have a make-up session for every single one of them. Only take this if you're very into the material... or if you have no choice. \nWorkload:\n2 papers, 2 exams. fairly easy grader and approachable - somehow he learns your name, which is nice.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "January 06, 2002",
            "review_content": "\nFirst of all, the course is really pre-Socratics through Stoics (with a moment of Epicureanism). He certainly is dull, but my greatest criticism is that he taught the class to the lowest common denominator, often taking 20 minutes to explain concepts that warrant 5 or less. I feel like there's some amazing intelligence under the drawl (he knows Greek, Latin, and Kant, as well as he knows Plato). He doesn't handle questions too well, but there are a lot dumb questions anyway. Aristotle is pretty turgid and tiresome to begin with, but he doesn't really make it any better. And while he's very, very sweet (no pomposity at all), he's so shy he avoids eye-contact, even in office hours.\nWorkload:\nTwo papers, midterm, final. All graded with lenience. Easy A.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "December 06, 2001",
            "review_content": "\nHaving read other CULPA reviews, I decided to take this class anyway and found that Mann wasn't nearly as bad as everyone said he was. True: he does not have a dynamic lecturing style, but the content of his lectures is good, and sometimes he's actually funny. I wouldn't just take this class for shits and giggles, you should have a serious interest in philosophy in order to enjoy it. His lectures do NOT just rehash the readings. He is more interested in talking about how we should organize our thinking about what these philosophers were trying to say. Gave me a good sense of what ancient philosophy is really about.\nWorkload:\n50-100 pages of reading per week. one 5 page paper, one 8 page paper, with esssay questions that really force you to think on your own, two tests, no final.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "April 09, 2001",
            "review_content": "\nDo NOT even think of taking this class unless you're a torture-loving masochist. Prof. Mann manages to take thoroughly interesting material (like Plato and Aristotle) and turn it into pure mind-numbing nonsense. His lectures only address a few unimportant aspects of the books you read, and the bordom they induce qualifies them as the worst lectures I've ever heard. Prof. Mann sucks all the life from philosophy, and I'm not sure why. I honestly feel bad for him because he's so bad at his job. He can't even hold a conversation in office hours. (Forget about any questions or discussions in class; they just don't happen.) This guy needs some serious advice on how to be a philosophy professor.\nWorkload:\nHeavy. Lots of reading for every class. One 5 page paper, one 8 page paper, two exams. He's a tough grader. Lots of busy-work, not much learning.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "April 09, 2001",
            "review_content": "\nDo NOT even think of taking this class unless you're a torture-loving masochist. Prof. Mann manages to take thoroughly interesting material (like Plato and Aristotle) and turn it into pure mind-numbing nonsense. His lectures only address a few unimportant aspects of the books you read, and the bordom they induce qualifies them as the worst lectures I've ever heard. Prof. Mann sucks all the life from philosophy, and I'm not sure why. I honestly feel bad for him because he's so bad at his job. He can't even hold a conversation in office hours. (Forget about any questions or discussions in class; they just don't happen.) This guy needs some serious advice on how to be a philosophy professor.\nWorkload:\nHeavy. Lots of reading for every class. One 5 page paper, one 8 page paper, two exams. He's a tough grader. Lots of busy-work, not much learning.\n"
        },
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "April 09, 2001",
            "review_content": "\nDo NOT even think of taking this class unless you're a torture-loving masochist. Prof. Mann manages to take thoroughly interesting material (like Plato and Aristotle) and turn it into pure mind-numbing nonsense. His lectures only address a few unimportant aspects of the books you read, and the bordom they induce qualifies them as the worst lectures I've ever heard. Prof. Mann sucks all the life from philosophy, and I'm not sure why. I honestly feel bad for him because he's so bad at his job. He can't even hold a conversation in office hours. (Forget about any questions or discussions in class; they just don't happen.) This guy needs some serious advice on how to be a philosophy professor.\nWorkload:\nHeavy. Lots of reading for every class. One 5 page paper, one 8 page paper, two exams. He's a tough grader. Lots of busy-work, not much learning.\n"
        }
    ]
}