{
    "prof_info": [
        {
            "prof_name": "David Gutkin",
            "prof_id": 10953,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 22, 2011",
            "review_content": "\nDavid is the absolute best. I've never had a better experience in a core class, or many other columbia class in general really. He's incredibly intelligent and insightful, especially for his age, and he made what could have been a really awful and boring survey course, a really fun and intensely interesting time. He gives you a lot of things to look at, listen to, watch, or read on the courseworks page, and it certainly helps to do them, but most of the time you can get all of the information from David in class the next day so it's not usually all that necessary. He is definitely very lenient with assignments and doesn't care whether you turn them in by hand or email, so long as he gets everything at some point or another. He specializes in minimalism and some other really great avant-garde kind of music, so he puts more weight and time into the 20th century section of the semester I think, which is totally fun and engaging (so, so much better I would guess than having a teacher who specializes in Renaissance madrigals or something). I also feel like the class was very centered around the philosophy and theory surrounding periods in music, composers, etc. so you read some pretty challenging articles (like some really crazy dense Adorno articles), but he does a great job of unpacking them with the class. He's open to anything you have to say, and even if you can tell when he doesn't agree with what you said or that what you said was wrong, he never shuts anyone down and if he doesn't understand your comment right away he'll ask you questions to try and figure it out instead of just moving on to someone else. Pretty much the nicest guy in the world, and really wants the class to be happy. Also, he makes the best witty comments at random all the time that never failed to make people laugh. He's fairly new to teaching so he gets kind of nervous and flustered sometimes, at least at the beginning of the semester, but its totally endearing and doesn't even remotely take away from what a great teacher he is. I can't say enough good things about David, it's a shame he's only a grad student because I wish I could take like five more classes with him. If you end up with him as your teacher, be happy, your core curriculum will be a hell of a lot more interesting because of it.\nWorkload:\n-Short assignments every week to 2 weeks on readings (Never a set length ~2-3 paragraphs, up to a few pages sometimes, but really however long it takes you to answer the questions), and I don't think he really grades them, just reads them to make sure you're putting in some effort.\n-2 easily graded concert reports and you can go to any show you want, from classical to jazz to Radiohead to Lady Gaga even if you so desired.\n-Midterm and final that he gives you essentially everything that will be on it in advance and holds multiple review sessions beforehand\nAll in all you can get away with doing very little work and reading, and he's not a tough grader, but you can get so much more out of the class if you do do the readings and put some effort into assignments, and I ended up doing all the reading/work even when I knew I could've skated by.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 11, 2011",
            "review_content": "\nDavid is so great. Really good experience, really learned alot, and actually found music hum to be killer interesting. Of course alot of the material is kind of boring and awful, but David does make it as good as it can be. He's just a really nice guy across the board...multiple review sessions for both tests (which are not intense enough to even merit students' worries), huge willingness to help with anything, very understanding when it comes to missed classes/deadlines, etc. If you get him for music hum, be happy. You're not going to have a super easy experience all the time, but the class is super A-able and the experience/learning will be as good as you want. Unless you're a music freak who wants desperately to get into the deep intricacies and technicalities of music, you're gonna end up happy with the class.\nWorkload:\nMidterm, final, 2 concert reports, and occasional (like once every 2 weeks or so) short writings in response to readings.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 22, 2010",
            "review_content": "\nBeing in David's Music Hum class has been the most joyful, personally rewarding and intellectually stimulating experience of my semester. Right away he struck me as smart, well-read beyond the scope of music history, and clearly interested in the material he is teaching. His curiosity about all kinds of music always rubbed off on the entire class. In fact, many times I wished the class went on for longer. From talking to friends in other Music Hum sections I gather that David's syllabus is very well balanced: we studied women composers while drawing attention to issues surrounding the male-dominated canon, we discussed popular next to high art genres with regard to commodity culture, the cultural elite, the concert hall, and the various historical functions of music, and many times we looked at the role of music in film. \nDavid put great care into preparing the Courseworks web resources for the class: he included the text of most songs, so I could sing along to Machaut's \"Rose, liz,\" which helped me memorize it for the exam. As a sometime screw-up, I appreciate that David is sensitive to the problems of the average college student and also any special needs you might have. I wish my friends were more like that. I truly recommend taking his class. \nWorkload:\nTwo concert reports, midterm, final - pretty easy!\n"
        }
    ]
}