{
    "prof_info": [
        {
            "prof_name": "Mariana Olvera-Cravioto",
            "prof_id": 3158,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "W3600 Introduction to Probability and Statistics",
            "review_date": "May 03, 2015",
            "review_content": "\nThis class started out very well - Prof. Olvera-Cravioto explained things very clearly, providing both intuitive and formal explanations. I think she probably went too slowly - do we need to spend more than 30 minutes reviewing how double integrals work?\nThen, there was a period of 2 weeks that she was gone at some conference, and two TAs filled in for her. The first TA was fine but the 2nd went way too fast and didn't explain things well. \nWhen Prof. Olvera-Cravioto came back, she picked up where they left off and was going as fast as she could to cover as much of the remaining content as possible. This ended up being very confusing - I don't think the class ever recovered. \nWorkload:\n~1 written homework per week. The first ones are deceptively easy, because as the semester progresses, we cover material more quickly. \nToward the end there was one pset that took me 4 hours because we had to repeat the calculations of each problem around 15 times for different cases. \n"
        },
        {
            "course_name": "Intro Probability/Statistics",
            "review_date": "May 20, 2014",
            "review_content": "\nMariana is an average teacher. She's super nice and you shouldn't be afraid to ask her for help. However, her teaching ability is questionable. She started off the class horribly slowly. It took us an entire 2 weeks to get to Bayes' Theorem. Don't worry though. She picks up the pace, in fact, her speed rises exponentially as the term progresses. Soon she's going so fast that you'll have no idea what on Earth is going on. As soon as we started joint distributions, most of the class got lost. She would show up, talk really fast and write down a bunch of equations and then have a quiz at the end.\nThe textbook this class uses is garbage. You'll have to look up the textbook a lot to do the homework since she doesn't do enough examples in class. Try using Introduction to Probability and Statistics for Engineers and Scientists by Ross. It's infinitely better and Mariana actually teaches straight from it. Unfortunately, I only discovered this towards the end of the semester.\nThe homework started off easy and got harder towards the end. It's still very doable, though you spend a lot of time going over your notes and textbook since you won't learn much from class.\nThe quizzes are similar in difficulty to the homework. You might experience somewhat of a time crunch on many of them since she puts up the question on the projector and they're generally super long. You spend 3 minutes just reading the question.\nThe final was OK. It had more probability than expected and very little statistics. Make sure you revise the older material so you don't get screwed during the final. Grading was fair to generous.\nSome weird stuff about her - Mariana likes talking about movies a lot and sometimes she says kind of racist things that are inappropriate for class. Nothing to worry about, but it's super funny when she goes off on these tangents.\nOverall, Mariana's an above average professor by Columbia standards. You'll learn a lot in this class. Probability is a super interesting topic, so if you're interested, you should definitely consider a class that goes into it in more depth than this one.\nWorkload:\n11 Assignments 20%\n9 Quizzes 40% (lowest dropped) (Difficulty differed with each quiz - could be really easy or very hard)\n1 Final 40% (Medium-hard. 4 questions on probability, 1 on stats)\n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 21, 2010",
            "review_content": "\nOn the first day, she started by saying that probability is hard and that it took her until after she received her PhD to truly understand it (which is really an indication of her lack of ability and of her condescending attitude. more on that later). She also told us that we shouldn't expect to understand probability in just a semester. That's a great way to start a class right?\nLecture: She teaches right out of the book (which is available free on the internet as a pdf. So don't buy the textbook if you are fine with printing out the book). This means that if you are fine with reading from the textbook, then you will gain almost no extra understanding from attending class. Also, don't expect her to have a great handle on basic math concepts either. For example, she doesn't understand basic calculus. If you see the way she does double integrals, you will understand what I mean. \nHomework: She assigns a homework on Wednesday and it is due the following Wednesday. This means you will get plenty of practice. On the first day she promised us that she will write up all the problems in the homework and that we won't be able to find solutions. Don't worry. That is a lie. Most of her problems are copied verbatim from similar courses at other universities. So, with creative googling, you will probably find solutions to most problems.\nExams: The exams are fair and open book/open notes. They usually take most students the whole class time. If you did the homework and know your way around the textbook and your notes, then you should be fine. Just a tip: print out the wikipedia pages for the different distributions like binomial, poisson, etc. the pages have some useful proofs and lists of useful expressions like PMF, MGF, etc.\nTL;DR: the class is manageable, and the professor is horrible. Find solutions to the HW on the web. Print out wiki and bring notes and book to exam. Lecture is straight out of textbook.\nWorkload:\n11 Homeworks (roughly 1 per Week)\n2 In Class Midterms\n1 Three hour Final\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "May 18, 2010",
            "review_content": "\nIf you got to be God for a day, I bet you couldn't create a being as rude, obnoxious and condescending as this professor. The TAs (John Zheng, Juan Li and Yiping Du) had the same attitude - \"we are Ph.D.s, - undergrads are stupid and the cash cow MS students even stupider, so don't waste our time on doing the TA work for we are being paid because they don't deserve it.\" \nOne gem includes telling us on Thursday, the last of the reading days, at 6:00 pm, that if you want your 2nd mid-term back you have only 1 chance to pick it up - tomorrow Friday 4-6 pm. \nThe worst is how they took out the grade-book on course-works once the finals were done so that you never found out how much you got on the final. As far as I am concerned, this is what they did - due to graduations etc they had to submit grades by Friday night, 2 days after the exam - since the TAs grade those and Ph.D.s generally don't have exams this was doable, but why bother doing an all-nighter for these bunch of loser students so lets just put in the same score as their current average as the final exam score, assign the grade and not bother grading the finals, or do it eventually and make sure they get exactly what we put in earlier (given that grading in this course is completely arbitrary this is not very difficult to accomplish). I know that sounds impossible, but I don't put it beyond this teaching staff to do it.\nThe shame is that this is probably the single most useful course to have taken when you end up on the job-market. So, do your best to avoid this professor and teaching staff.\nWorkload:\n20% Weekly homeworks - will be assigned rain or shine including right before and right after exams. Graded by graders (completely arbitrary). Officially, there are \"extra credit\" problems, but until today I don't know how they factored into the grade (does the extra credit count only towards that homework, or does it count towards homework in general?) . They are due at \"6pm\" on Fridays outside the professors door, but since slum-dog MS students will steal the stapler if they are let into the department with no one to supervise, your id card won't open the main door after 5 pm, so effectively, it's due at 5pm for you if you are an MS student.\n25% 1st mid-term. Extremely long, not by accident, but by design. This will be after a deceptively short practice mid-term is posted on course-works, so don't be fooled by the practice. Basically a bunch of algorithm to simulate this or that questions which have at least 10 answers, but unless you do it the way she's thinking you won't be able to do the remaining sub-parts which build on the algorithm from subpart a) of the problem.  \n25% - 2nd take home midterm. If you want an A range grade in the class it's imperative that you cheat on the on this \"48 hours\" mid-term by working in groups although you are supposed to work individually. The way it works is that you will be given a bunch of incorrect code written by the professor (implementing things about Markov chains that you haven't yet seen in class so you can't just go correct it yourself) and incompletely specified questions and these will be modified in the ensuing 24 hours when people send her emails with questions, so you effectively have only 24 hours to do the supposedly 48 hour exam. If you work alone, you will run out of time, but if you cheat by working in a group, while you waste time trying to make incorrect code handed to you spit out the numbers, you groupmates will solve the other problems so you won't run out of time. If you don't cheat then you will end up with a high 80's score and get a B/B+, the cheaters will get 90s and A's. No action will be taken against the cheated.\n30% - Final. not long and straight forward, but probably never graded, so don't rely on it to get you across the post.\nIn all cases, grading is either completely arbitrary or non-existent. Don't expect 1 meaningful feedback on anything.\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "May 13, 2010",
            "review_content": "\nMariana isn't really as nasty as the other reviews make her out to be. Though she does say some strange things in class eg smth like ' if you thought this class will be easy, you're wrong', from her grading system and course structure, it doesn't seem like she's really out to punish students.\nThe exams are quite reasonable- if you work through the assignments (for which the TAs provide more than enough help for), it should be okay. \nHer lecture notes are also VERY structured and clear- perhaps even the best structured amongst the courses at the IEOR department I've done, which I really appreciated. I found that I didn't actually need to use the course textbook as all the required information was in the notes.   \nNot sure about her lecture style as I didn't actually manage to make it to very many of the 9.10 am lectures. But from the few that I went to, and from comments by some friends, she seems like a pretty clear, well prepared lecturer. \nWorkload:\nWeekly assignments. Programming involved can be time consuming at first, but gets easier as the semester goes along. 2nd takehome midterm was quite awful, but very generous grading done for that. \n"
        },
        {
            "course_name": "Simulation",
            "review_date": "May 06, 2010",
            "review_content": "\nWORST PROFESSOR IVE EVER HAD BY FAR. Incredibly rude to students, condescending when asked questions, and basically just a cold heartless zombie. Simulation is a hard class to begin with, and hard classes come with questions - of which she will answer none because she feels you \"should already know the answer\". \nStay away. for the fucking life of you - STAY AWAY. This can be impossible if you are ieor, as the department must have decided that Mariana is awesome enough that she should be the sole teacher of this class-- but if for some reason there is another option - take it. you'll hate yourself, and your life, and everything you once loved if Mariana is in your class schedule. trust me. \nThe only plus side is she posts her lecture online, making it unnecessary to have to go to class and see the miracle that is a body working without a heart. \nP.S. she just had a baby, which is what a lot of students have been attributing her meanness to, but I had her for a different class, before the baby, and she was exactly the same way.\nWorkload:\nTime consuming, difficult weekly problem sets, unfair in class first midterm, long take home second midterm with programming. in class final. \n"
        },
        {
            "course_name": "IEOR 3600 - Intro to Probability and Statistics",
            "review_date": "October 22, 2009",
            "review_content": "\nTerrible, Terrible, and Terrible.\nshe is extremely condescending - refuses to explain complex material in ways easier to understand. Told the class that she was \"not afraid to fail many of us\" if we didnt perform better.\nHorrible teacher for a class that shouldnt be that difficult.\nAvoid her at all costs.\nWorkload:\nunfair problem sets, mid-term, final.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "December 18, 2008",
            "review_content": "\nVery Hard class. make no mistake about it, this is a very hard class. It says its for people who have never seen probability, but its really not. If you haven't taken a class in probability before, don't take this class expecting to coast. Mariana is a good professor who follows lectures very closely to the textbook. The course starts off easy, but gets very hard in the middle section. By the end, this was a big time commitment with homework, which would have been impossible without the recitation where the TA gave you the answers(go to recitation!)  Overall, tough tough class with a good professor.\nWorkload:\nA lot, weekly homework assignments which are time consuming and tough, be prepared to work a lot on these. Two midterms(first was a piece of cake, second was much, much harder) final which was very tough as well.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "April 11, 2007",
            "review_content": "\nProfessor Cravioto is straightforward. Her lectures follow very closely to the text about 70% of the time. The thing is, her lectures are very concise and she tells you all the information you need to know. The homework assignments arent too taxing but there is usually a problem or two that will take some thought, especially if like me you had no exposure to probability/statistics before. I recommend attending recitations because TAs clarify somethings you may not get from her lectures. The first midterm was insanely easy, the second (almost in response) was way harder with a fair number of people failing it, and the final was fair and not too hard at all.\nWorkload:\nweekly homework sets take a couple hours or so to complete but are mostly good preparation for the exams. the workload is fair as is grading\n"
        },
        {
            "course_name": "Probability",
            "review_date": "February 18, 2007",
            "review_content": "\nPossibly the worst class I have ever taken at Columbia. She was new this year and seemed not to realize that the problems sets should not be exceedingly difficult for an introductory probability course. The exams were straightforward.\nWorkload:\nHard homeworks, medium exams.\n"
        },
        {
            "course_name": "Simulation",
            "review_date": "January 15, 2007",
            "review_content": "\nProf. Olvera was great.  I thought Simulation was going to be a nightmare but Mariana made it much bearable.  Class starts off relatively easy but gets pretty complicated after a while.  You should attend most of the classes and at least a few of the recitations if you want to do well.  A background in programming helps a little but more importantly you need to have a solid understanding of probability as she spends little time reviewing.  \nEverything before the midterm is a lot easier than everything afterwards so study hard for the midterm and get an average score.  After that you should be fine for the course as long as you do all your home works and do a good job on your project.  The final is a bit tricky but if you managed to attend most of the classes or review the lecture notes weekly and remain on top of the material you should be fine.  Luckily she posts her notes online so you always have notes handy even if you never went to class.\nWorkload:\nWeekly homework, some can be tedious and extremely aggravating if you have forgotten your probability.  Midterm was easy, project wasn't bad at all, and the final was fair.  Curve was awesome. \n"
        }
    ]
}