{
    "prof_info": [
        {
            "prof_name": "Jonathan Platt",
            "prof_id": 1168,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "The Question of Language",
            "review_date": "May 18, 2005",
            "review_content": "\nI pray that Jonathan will offer this class again, for the good of Columbians interested in the theoretical/philosophical side of linguistics. The class was incredibly interesting and rewarding without being too demanding work-wise. \nWhile the readings could be complex and difficult, they were all short articles and all immensely interesting, particularly after Jonathan clarified them in class. \nJonathan is very smart and articulate, with a good sense of humor, even if he is a little awkward at times. He is open to people's ideas, although he will not shy away from telling people when they are a little off, which I think is a good thing. \nThe class was extremely well-organized, with some sessions dedicated to lectures and some to discussion. He brought in great material for the discussion periods. Some of the video art he brought in was particularly entertaining. He grades pretty easily, but you have to put some thought into your work.\nWorkload:\nNot much. 20-30 pages of reading (if that) per class. Sometimes no reading at all. You have to write 8 one paragraph reading responses that are fun and graded check/check plus. A mother of a midterm but it's take home. A final or final paper. I opted for the paper, which was graded easily and was fun to write.\n"
        },
        {
            "course_name": "Second Year Russian I",
            "review_date": "May 06, 2004",
            "review_content": "\nI agree with the previous reviews, both about the strength of the Slavic Department TA's in general, and about Jon's excellence even among this elite group.  The third Grad Student instructor I've experienced in my Russian Language course history, John has been the best of the bunch.  He is an excellent teacher for all the reasons mentioned in the other reviews; he knows how to teach the language to non-native speakers, he prepares extensively for each lesson, knowing exactly what he wants to get accomplished...but most of all, he keeps the pace of the class moving; it's not so much that we're covering material at a faster rate, but rather, that we're covering the same material from a wide variety of alternating approaches, and through different sorts of excercises. As opposed to simply having us read through the examples in the no good, poorly organized text book, John brings in his own excercises, which are always much better, and always include a healthy dose of that peculiar slavicist irony that keeps the class moving.  Great teacher, I have no complaints at all.  Highly recommended.  \nWorkload:\nTo learn a language, it seems, one has to practice speaking it.\n"
        },
        {
            "course_name": "First Year Russian I&II;",
            "review_date": "July 23, 2002",
            "review_content": "\nJohn is certainly one of the best teachers I've had at Columbia; he's certainly a credit to his department and the TA ranks. The mere fact that he's American (a rarity in most foreign language departments, it seems) is a big help, since he suffered the same difficulties with the language and knows how to help you get over them. He's animated and interesting during class, and he really cares about his students, to the extent that he's visibly disappointed when we don't perform (you can take that as a good or bad thing). And while that may simply be a result of the fact that, as a grad student TA, his fate is inextricably bound to ours, the end result is the same: he'll go to great lengths to help his students. One warning: he will tease you for repeated errors, but you'll deserve it, and it'll help you remember.\nWorkload:\nThe other reviewers have it right, and besides, this stuff is all standardized. Watch out for listening exercises that will take forever, particularly ones that the language lab won't have (grrrrr)! There's also a required grammar lecture for first year Russian with Frank Miller, a man who defies description (in a good way).\n"
        },
        {
            "course_name": "Russian V1101-2",
            "review_date": "June 20, 2002",
            "review_content": "\nYou wouldn't expect it from a language as unforgiving as Russian, but the department actually boasts quite a few amiable instructors, foremost among them John Platt. John is still only a grad student, and perhaps that explains his youthful exuberance. In addition to being really easy to get along with, he is very dedicated and will gladly go out of his way to give students extra help. His lectures are also peppered with amusing anecdotes about life in Russia, and he has a beard to match. A damn good teacher.\nWorkload:\nRussian is not for the weak-hearted. Homework practically every night, weekly quizzes, rigorous mid-terms, finals. You better want it bad.\n"
        }
    ]
}