{
    "prof_info": [
        {
            "prof_name": "Elaine Combs-Schilling",
            "prof_id": 1347,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Opera's Dialogic Stage",
            "review_date": "January 05, 2005",
            "review_content": "\nIt's impossible not to LOVE Elaine!  She is a truly independent thinker and scholar, and will open your eyes to the bridge between opera and theory.  There's something for everyone in this course.  As both a performer and an anthro major, I found the material to be a perfect mix of literature, critical theory, and music studies.  However, you do not need a music background for this course.  But if you do, you are welcome to use your knowledge to analyze the operas.  Some highlights of the semester: weekly response papers that can be as informal or in depth as you want, opening night tickets to the Magic Flute at the Met, and informal, yet rigorous in-class discussions (even some musical demonstrations by talented classmates).  Elaine does not pretend that opera (both its viewership and content) is a world of equality; in fact, she accentuates societal heirarchies and how they are translated to operas of their time.  All I can say to sum up is that Elaine is an enormously inspiring and fair professor, and a truly kindhearted person who cares deeply about her teaching and her students.\nWorkload:\nWeekly responses and a final paper.  Oh, and outings to the opera!\n"
        },
        {
            "course_name": "Opera's Dialogic Stage",
            "review_date": "February 02, 2003",
            "review_content": "\nAMAZING!!!!!!! I am so thrilled that I had the opportunity to take this class with Professor Combs- Schilling.  She is the best teacher I have ever had, because she really cares about her students' learning.   BRAVA!\nWorkload:\nLots of small papers, two major papers.  However, she motivates such that the work is inspired.\n"
        },
        {
            "course_name": "Opera's Dialogic Stage",
            "review_date": "February 02, 2003",
            "review_content": "\nI just wanted to amend my previous review, since I realized that I reviewed the class more than I did the professor, and I didn't sound as glowing as I'd meant to be:\nProfessor Combs-Schilling is damned smart, deeply passionate about what she teaches, and loves each student like her child.  She's a treasure.  Amen.\n"
        },
        {
            "course_name": "Opera's Dialogic Stage",
            "review_date": "January 02, 2003",
            "review_content": "\nLess a class than a cozy and intriguing discussion group.  Professor Combs-\nSchilling lavishes personal attention on her students and adores her subject.  The class can be a little uneven: lots of lecture and theoretical discussion one week, and a giggly bout of video watching and critiquing the next, but who cares? The readings are interesting and range from anthropologists (the dreaded but appreciate Schechner) to opera critics (Abbate, etc.) to literary theorists (Bakhtin).   The class takes the readings and theories and then applies them to opera productions, live and on video: we focused on Don Giovanni and Le Nozze di Figaro.  Professor Combs-Schilling is generous with her time, flexible, sensitive to her students' needs and concerns, and really helpful during office hours and through e-mail.  Morgan, her TA, was also insightful, helpful, and generous with her time.\nWorkload:\nWeekly readings range from the manageable to the hefty, but breaking up larger assignments over a few weeks works just fine, since once each author is introduced, he or she is consistently brought up in discussion for the rest of the semester.  Weekly two-page \"stream of consciousness\" papers on readings, paper topics, opera scenes, etc.  Two major papers: one 5-7, one 10+; you pick the topic and run it by her.  Her suggestions are really useful.\n"
        },
        {
            "course_name": "Opera's Dialogic Stage",
            "review_date": "December 15, 2002",
            "review_content": "\nThis is a difficult review to write, simply because there are _so many_  really good things to be said about Elaine.  She is amazing.  While the backdrop of her course, opera, may not necessarily be one that excites many people, take any class with her that you can.  She is, hands down, the best professor I have had at Columbia.  She is extremely engaging and excited about the material; she is also quite knowledgeable and active in her field, but is more than willing to hear opposing and new views.   I love having her as a professor -- the discussion is great, and the readings are very appropriate and erudite, even for those taking her seminar as their first anthropology class.   More than just the pedagogical, though, she is warm, funny, kind, thoughtful, and understanding.  She treats students with respect -- and she really cares us and our experiences in her course.  Elaine wants her students to be comfortable within the classroom (For example, our class met at the ADP Fraternity, as two members were in our class -- she wanted us to be in a more comfortable setting, as so much of the course revolved around viewing performances and discussion.), and she encourages communication.  Take advantage of such a rarity at Columbia...you will not be disappointed.  \nWorkload:\nWeekly stream-of-consciousness-like reaction papers to the readings; one 4-6 page paper midterm and a 10-12 page final paper.  Participation and attendance in the weekly seminar.  Trips to the New York City Opera (though we only went once).\n"
        }
    ]
}