{
    "prof_info": [
        {
            "prof_name": "Xavier Sala-i-Martin",
            "prof_id": 1,
            "total_reviews": 82
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 24, 2020",
            "review_content": "\nOverall, this class was an enjoyable, though perhaps slightly challenging, experience online. What the reviewer below me says about the jokes, metaphors, eccentricity, and engagement is true. \nUnfortunately, what they say about the pacing of the class is true too, but I don't think it's as big of a problem as made out to be: while the number of \"chapters\" (really just pdfs of some notes - there's not an actual textbook) is heavily concentrated in the latter half of the course, the presentation of the material doesn't feel substantially faster or more difficult. While some important topics in business cycle theory are glossed over a bit more, Xavier has the skill of clearly explaining the complex nuances. He's simply more passionate about the growth topics, and I don't see a huge problem with that. Also, lectures always begin with about 10-20 min of a recap from the previous class which helps you get in the mindset of the new content that's about to come.\nThe TAs: did their jobs well but perhaps not outstanding. Personally, I didn't know that they did office hours until the weekend before the final but that's probably on me. I also don't think their response to student complaints were unreasonable: from my understanding, the complaints were variants of \"but this is hard.\"\nOne complaint that the professor didn't handle well was relating to the synchronous nature of the midterm and final. Many international students would've had to take the final at odd hours of the day, but the professor didn't seem to have much sympathy, citing that the only way to make the final asynchronous would require making the final open note which would require increasing the difficulty of the math. I find that reasoning to be erroneous. \nAnd of course, as others have noted, I should emphasize Xavier's jokes and metaphors: I think they help facilitate learning, and I think they helped make this course entertaining for me even if I didn't find the content as interesting. \nWorkload:\nAverage 2.7 hours of out-of-class work a week.\n4 problem sets (should've been 8 but we fell behind): 3-10 hours each.\nMidterm and Final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 17, 2020",
            "review_content": "\nHaving completed the Holy Trinity of the introductory sequence(Gulati, Elmes, and Xavier), I must say Xavier's class is the most disappointing of the talk-ed up intro econ professors. Xavier himself has a truly unique background and eccentric personality, clearly passionate about growth economics, soccer, and Catalonia. The class, however, is a garbage fire. \nThe first half of the semester consists of Xavier's bread and butter speeches about theories of economic growth, his personal anecdotes with leading economists and world leaders, and various quirky metaphors that make otherwise dry material very engaging.\nThe second half of the semester is where the pile-up begins. Increasingly larger, but not necessarily more complex concepts are thrown at you without rest. Whereas the first semseter and midterm cover literally a chapter of Xavier's textbook, the second semester covers 6-7. Pacing as a concept does not seem to exist in this class. While I enjoy thinking about growth economics, I do not even think the first semester is even the most important from intermediate macro! Key differences between the Keynesian and Classical schools, monetary and fiscal policy, all are blazed through unmercilessly.\nNo help is to found from the TAs in this course. Reading other reviews, it seems like TAs are lost every semester, but this cohort was especially disorganized. Conveniently cancelling their office hours before major deadlines, complaining about the unreasonableness of student questions when the majority of us just wanted a clear timeline as to when things might be due, and showing a general lack of initiative in attempting to address student concerns are only a few examples. This is not to say that the TAs did not go above and beyond in other ways: creating video series and holding extra sessions to explain concepts illustrated their personal interest in seeing students suceed. Going above and beyond expectations however, is better appreciated when the bare minimums are being met, namely a clear communication of deadlines and expectations regarding course material.\nAs for the course material itself, it isn't too difficult. The math prerequisite is more than sufficient for the material in the course, and is used sparingly. The homework and exam questions themeselves can get frustrating at times, as though they may appear opinion based, they are really looking for the direct text found in Xavier's textbook. I did not find the midterm particularly hard, and though I have not taken it yet, the final appears to be a considerably larger amount of work. Although one may find it easier than other sections to obtain an A in this course, this comes at the expense of learning fully several of the more foundational topics of Macroeconomics. For this reason, I really can't recommend taking this course with Xavier if you are intending to major in econ. While his energy is infectious, this course was a bust in my opinion. \n \nWorkload:\nVery light, ~5 hours a week with no p-set and ~10 with. Your mileage may vary, but if you've read the readings for the material being covered, the homework is just regurgitation.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "November 25, 2020",
            "review_content": "\nI totally agree he's funny, humorous (debatable), well-respected, and genuinely a good guy but his class is very unorganized.\nWhat he teaches in the class is not what you will normally learn in other macro class. Some materials include topics from micro (utility function, etc.). Also, he spends too much time on unnecessary stories like how he met Sharon Stone at Davos. But the worst part is there is too much gap between what he teaches in class and pset/exam.\nIt makes things very difficult because he's super against using textbooks so that we don't really have a formalized materials to study, yet his lecture is just different from pset/exam.\nI understand most of the econ-core lectures at Columbia are terrible, but if I'm given a choice, I wouldn't take his class.\nWorkload:\nPset every 2-3 weeks. 1 midterm and a final.\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "September 29, 2020",
            "review_content": "\nPROFESSOR X IS AWESOME!!! This is still my favorite class I've ever taken. Prof. Sala-i-Martin is an extremely interesting guy and a great, engaging lecturer (he would get standing ovations from my class lol.) Definitely recommend anyone to take his class. I think the 2019 nobel prize winner in econ was his student.\nWorkload:\nweekly homework, midterm, final. challenging but nothing too crazy\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "June 20, 2020",
            "review_content": "\nThis was honestly my favorite class that I've taken at Columbia so far!! Professor X is such an engaging professor and makes every class super fun to listen to. He specializes in growth, so the growth section is particularly good, but this does mean the rest of the course is super rushed and hard to learn. However, there is no textbook, and his TAs release notes for every unit, so the course load is certainly manageable and you have access to all the material that will be on the exams. P-sets can get a bit long, but not unreasonable, and exams are very fair. Grading on everything is very fair as well. Not a difficult class if you show up and read TA notes. \nWorkload:\n8 psets\nMidterm and final (final replaces midterm grade if final was better)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 25, 2020",
            "review_content": "\nDon't do it.  It's pretty poorly run.  Lectures are vague and material is spread very unevenly (1 chapter for the midterm and 7 for the final).  Grading is not super hard but it's sort of a waste of time.\nWorkload:\n8 problem sets (20%)\n1 midterm (30% if grade is higher than final, 0% if grade is lower)\n1 final (50% is grade is lower than final 80% if grade is higher; there is no way your final grade will be higher)\n"
        },
        {
            "course_name": "Introduction to Macroeconomics",
            "review_date": "April 14, 2020",
            "review_content": "\nOVERRATED!!! Thought it would be better based on what I've heard but really just ended up just learning about the Solow growth model. The problem sets are not like what we see in class. Midterm was four questions but complex. You barely have time to finish half of it. I ended up doing okay but not as good as I thought I would. His class is big (about 300 students), which makes it harder to ask questions and less approachable. \nWorkload:\n8 Psets\n1 Midterm\n1 Final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "February 21, 2020",
            "review_content": "\nXavier is generally a decent lecturer. But I have a bone to pick with him for a couple of reasons. Tho keep in mind that this is also just my biased opinion. \nFor the first two weeks, instead of actually teaching us economics, he gave us propaganda lectures on how the world has seen tremendous economic growth over the last few centuries(the message being that we gotta stop to smell the roses), and how inequality is really not such a serious issue because a) cross-country inequality is decreasing, and b) a rising tide lifts all boats!! It felt like a very self-serving message. Like hey guys, check out the splendid achievements of economics (btw I am famous growth economist), the people who grumble about poverty and inequality are totally just missing the bigger picture.   \nThen for the first half of the semester, he focuses on the solow-swan model of growth. The model in essence is pretty simple. In a nutshell, the key result is that because there are diminishing returns to capital, economies cannot achieve permanent growth through investing in capital alone (only technological progress can facilitate permanent growth). Okay, not so mind blowing. This also is a highly oversimplified model of the economy of course. \nBut Xavier made a really big deal out of it. He claimed that throughout the latter half of the 20th century, African countries and international aid agencies just kept building more machines because they thought increasing capital was the key to economic growth. But the Solow-Swan model states that you cannot achieve permanent economic growth this way!!! So in conclusion...that's why Africa continues to lag behind in economic development today. Case cracked! Like bro c'mon, that's a seriously oversimplified, distorted picture of reality.\nWorkload:\nnot too bad\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 30, 2020",
            "review_content": "\nTook Xavier last semester and had really high expectation after reading previous reviews. I would recommend Xavier because he is a great lecturer but at the same time he is slightly (actually more than slightly) overrated. He is a really funny, passionate guy and he definitely knows a lot about economic growth/development. We spent the first half of the semester discussing the solow-swan model and that was great. However, he rushed through the remaining 8 chapters in the second half of the semester and I still feel like I barely understand the part about tax and budget constraint. \nAlso this class is very disorganized. Dont expect the TAs to respond to questions on Piazza promptly. Dont expect psets to match what was taught in class. \nWorkload:\n7/8 pset\n1 Midterm (relatively easy if you study the pset)\n1 Final (takes forever to review the material so start early)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 06, 2020",
            "review_content": "\nI would recommend taking Xavier for intermediate macro if you need to fulfill your econ requirement because his grading is very generous. With that being said, this isn't a great class. Lectures move incredibly slowly the first half of the semester, and then frantically speed up the second half. The lecture notes are messy and the tangential TA notes contain errors or additional information that is contradictory or presented differently. All in all, as someone who could not get themselves to pay attention in class, studying for the midterm and final was an absolute mess. The notes were just so disorganized and confusing. There were so many gaps in information. The good news, though, was that with a lot (a loooooot) of studying, the exams were pretty manageable. There's kind of a pattern to his testing. I really recommend understanding the lecture notes and basically memorizing the pset formats. That's how you succeed in this class. Overall, I learned little to nothing--I wish Xavier covered topics more widely taught in macro. Simply put, this class was messy and Xavier seemed a little too preoccupied to provide us with a comprehensive and eye-opening class. \nWorkload:\nNot bad -- PSET about every two weeks. \nGot really stress-y before midterm and final, though.\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "December 28, 2019",
            "review_content": "\nMost disorganized class I have ever taken. TAs did not know what was happening and problem sets often did not match what was being taught in lecture. 2 problem sets were assigned during reading week to ensure all material was covered before the final. The lecture notes that are given in lieu of a textbook are difficult to navigate and contain errors.\nI will say that Xavier really is a great lecturer, though. I did learn while in lecture and the exams were not incredibly difficult. I think the class is just too large to manage effectively.\nWorkload:\n7 problem sets, 1 midterm, 1 final\n"
        },
        {
            "course_name": "Economic Growth & Development",
            "review_date": "February 23, 2017",
            "review_content": "\nThis was by far my favorite class at Columbia. It was an 8:40 which was unfortunate, but Xavier's lectures were so riveting that I wouldn't actually mind going to class. And I knew I wasn't alone in this, as the lecture room was nearly full every morning. Essentially this course explores the question \"why are some countries poor?\" The class is a mix of theory, models and mathematics, and Xavier blends the three elements together as if telling a semester long economic narrative, rather than lecturing at you. The math involved isn't particularly terrifying for an upper level economics class- the most complicated it gets is Lagrangian, but it's basically applied in a manner that is no more difficult than it was in micro. I think the most compelling thing about this class was the way in which math was used to help tell the story of economic development. You don't feel like you are learning abstract and pointless graphs and equations, but rather real-life solutions. \nAlso, Xavier is basically the best human being. A funny, passionate, quirky Spanish guy, he explains complex concepts in a simplified yet elegant way. He matches his brightly colored suit jacket to his power point every day, calls Trump our \"funny orange man\" and uses the game of soccer to explain the concept of idea innovation. It really doesn't get better. And he is very approachable and loves questions. I seriously encourage all undergraduates to take this class. It makes economics relevant, inspiring and challenges you without being overwhelming you.\nNow, I am a bit biased because development economics is my area of interest. But I will say that a large reason as to why I have taken an interest to that field is because of the some of the things I was exposed to in this class. So take that for what it's worth.\nWorkload:\na long list of \"readings\" which are all optional- it's a \"read if you are interested in this topic!\" deal, not a \"read because you have to\"\n20% problem sets, only 3 for the whole semester, graded very fairly\n30% research paper, topic of your choice\n50% final (no midterm, which is a huge bonus)\n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 10, 2017",
            "review_content": "\nXavier's class was a dud to me. Even though it wasn't particularly difficult, I found that I left the class with no new knowledge or expertise about Macroeconomics. The midterm is fairly simple as long as you do the practice tests, the final is quite a bit harder overall, but not too hard. The best tactic for this class is to complete the practice tests before the midterm/final a few times so you can memorize the concepts, and to attend class the second half of the semester. The first half Xavier goes very slowly, and it is not a challenge at all, the second half compensates by going very quickly, so go to class and try to grasp the concepts for the second half/ in preparation for the final. If you do this- you will do well in the class.\nWorkload:\nHomework - 20%\nMidterm - 30%\nFinal - 50% (80% if grade higher than midterm)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 03, 2017",
            "review_content": "\nXavier is the BEST Econ professor I have had so far!!!!!!! Whereas my Micro professor was all about mathematics and proofs and trick questions, Xavier was all about FUN and learning. He explained concepts so well that I could always recall what exactly he said about specific concepts. He uses metaphors (\"cookies\" as real GDP), animated examples, and his quirky humor. At times, I felt this guy could even teach kindergarteners macroeconomics. The problem sets were usually well written as well. You get a few easy questions and the rest require slight tweaks to the models. The lecture was extremely entertaining as you saw from his famous words about children. But the one I loved the most was the Columbia students as a wicked example of the \"borrower\" lol. Also, as a non-conventional Growth Economics, Xavier taught us both the classical and Keynesian views. What a good deal for me. At the end of the day, I have learned so much with MINIMUMAL STRESS thanks to a great teacher like this.\nAlthough the class size was overwhelmingly large and occasionally someone would ask questions that I would rather ask in the recitations, I appreciated this equal opportunity for 400 people to enjoy such a good class. The Econ department should also do the same thing with CORPORATE FINANCE: provide more opportunities for non-Financial-Econ majors to explore this area and recognize that registration priority is BS, bureaucratic, and anti-intellectual.\nMy ONLY complaint to the class was the fact that the TAs, who made the final, failed to proofread questions and left us with SIX mistakes. COME ON guys. We had 10 TAs and none of them paid enough attention to proofreading. \nGrade received: A (missed a few lectures due to recruiting and never attended recitation due to my campus jobs but thanks to the good notes that Xavier posted, I was able to pull it through)\nWorkload:\n8 Problem Sets. 1 Midterm. 1 Final. If you do better in the final than in the midterm, only final counts. Make sure you review the lecture notes he posts on coursework before and after doing the PS. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 02, 2017",
            "review_content": "\n** Had him for Fall 2016. Econ major but not a fan of math. ** \nHe is not the best lecturer. He definitely seemed very interested in development, which is cool, but we end up going really slowly for the first half of the semester, which makes him cram the rest in the second half. My main complaint with Xavier is how unorganized he is. His syllabus is very minimal--it lists topics that are going to be covered without any indication of the timeline (probably because he himself doesn't know what the timeline is going to look like) and grade distribution. Anyways, studying for his cumulative final was a MESS. His \"textbook\" is essentially long word documents and pdf's that have a lot of typos. They didn't help much with my studying. The final was kind of a disaster overall // a lot of people came out of it dumbfounded (including myself). BUT the curve was very very good. So there's that. Also, rumor has it that Xavier didn't like our class because of an annoying group of people that always sat in the front of class and asked annoying questions. In summary, he's not someone I would recommend, but is also not someone I would strongly speak against. One thing for sure is that he's not worth all the hype. \nWorkload:\nweekly problem sets (20%)\nmidterm (30%; 0% if worse than final)\ncumulative final (50%; 80% if better than midterm)\n"
        },
        {
            "course_name": "Economic Growth & Development",
            "review_date": "December 12, 2016",
            "review_content": "\nI have never been so disappointed in a class. I have never felt like I was wasting my time in a class. That all changed this semester.\nXavier is an engaging and fun lecturer and he uses this trait to hide huge laziness with regard to the syllabus and intensity of the class. Basically what he's done is taken the solow-swan model from Intermediate Macro, made it slllliiiiiggghhhhtly more serious, and then added 8 weeks of anecdotal fluff. If you've taken his macro class you will remember his lecture on Pepe Guardiola. it is word for word the same here. If you've taken his macro class you may also remember Nokia. Word for fucking word.\nWhen I came into this class i had something very specific in mind as my ideal: rigorous theoretical background (in several growth models - yes, there is more than one) followed by case studies in what did and did not work in different scenarios of growth and development. Given that this was Columbia, I wasn't super hopeful for much of the practical part, but I was hoping for at least some rigorous growth models and maybe one or two half-fluff case study esque things from which we could actually learn something useful about development. I wanted no fluff followed by a little fluff. What i got was prolonged no fluff (that could have been covered in m happy to be graduating \nWorkload:\nThree homeworks, all of which are practically the same material from solow swan. They took a long time and were often badly written. (20%)\nOne literature review paper, 3 pages single spaced, which was the only practical part of the entire course (30%)\nOne final (50%)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "June 16, 2015",
            "review_content": "\nDefinitely take him for Macro. He's funny and it's not difficult to get an A. There are loads of TAs, and they're usually all great, so it's never hard to reach one if you need to. Go to a recitation near the end of the semester if you can; usually one of the TAs goes over what will be on the final. If you miss a class or don't have notes, all the TAs post their recitation notes every week and some of them have really great, comprehensive ones. Plus, he spends the beginning of each class reviewing last class, so again, not a problem if you missed a class.\nProblem sets aren't difficult, just pretty long and occasionally tedious. There's also lots of past solutions floating around and he hardly changes the questions, if you want to go down that route.\nExams are straightforward. When you study for an exam, make sure you check their notes, as they'll sometimes cover stuff that Xavier doesn't, and then shows up on the exam. Also make sure you review your problem sets--past questions will also sometimes show up. Be warned: his exams are long af. You will be scrambling till the last minute to finish. The midterm is pretty difficult, but the final is more forgiving. Plus with his grading policy, as long as you do well on the final, your midterm doesn't even matter.\nThere's pretty much no math involved, so if you suck at math (like me), that's great news.\nOverall, I enjoyed his class. I learned a lot, and he's humorous enough to keep your attention for most classes. Some of the more critical reviews below though do have some valid points, i.e. pacing, but I personally didn't have a problem. For the most case, you'll have a good time. If you don't like him, just don't go to lecture & go to recitation instead.\nWorkload:\n8 problem sets, 1 dropped, only 1 problem graded on each - 20%\nmidterm - 30%\nfinal - 50% if you do worse than your midterm, 80% if you do better (& the midterm is dropped)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 12, 2015",
            "review_content": "\nI really don't understand the hype behind Xavier. He is a funny dude at times, but I found his class and topics covered to be very boring and not engaging. It may have been the sheer size of the class, but it felt like Xavier would be rambling on-and-on forever during class. With no doubt, I can say that I never paid attention to a single lecture, and I never attended a single recitation session.\nHowever, one appeal of the class is that it is very easy. Recitation notes are online and all you need to prepare for the midterm and final. If you work hard enough, you can learn the entire course material in a day. \nIf I had to choose again, I'd probably take Xavier again, but wouldn't make the mistake of trying to go to class and pay attention again.\nWorkload:\nNot much. Near weekly problem sets, midterm, final. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 15, 2014",
            "review_content": "\nI highly recommend this class. In my opinion, Xavier is great at presenting the material and keeping the class interesting and funny. It's in a huge auditorium but there's a microphone so you can hear him from anywhere in the room. There are about 10 TA's, so if you miss the lecture you can go to a recitation any day of the week. I would recommend not going to Carlos' recitations, as those are generally packed (Carlos is the long-time head TA). If you don't understand something, there are so many recitations and office hours that you are guaranteed to get your questions answered (also, you should get the emails of the TA's just in case).\nIn terms of the material, there is not actually so much covered. He spends the beginning of each lecture reviewing the previous one. If you go to every lecture and pay attention and do all the problem sets, you will need very little studying. The tests weren't so hard, though I thought they were a huge time crunch. The class kind of slowed down after the midterm because Xavier is into growth, which is the first part of the semester. Overall, there is very little actual math and most of the material is intuitive, which means if you pay attention you'll do great in the class. Also, if you mess up the midterm the final counts instead of it (I completely failed the midterm and still got an A).\nIn summary, Xavier is hilarious and he was able to keep my focus most of the time I was there, the class is not math-based and pretty interesting, and it's not hard to get an A -- so I can't think of one reason NOT to take this class.\nWorkload:\n20% - 8 problem sets; lowest dropped (absolutely no excuses for missing one); only one question is graded on each one\n30% - Midterm\n50% - cumulative final (if better than midterm, final counts for full 80%)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 16, 2013",
            "review_content": "\n9/4 bright red\n9/9 celtic green\n9/11 royal blue\n9/16 fuchsia\n9/18 pink panther\n9/23 golden giraffe\n9/25 deep purple\n9/30 hot pink\n10/2 neon green\n10/7 shiny red\n10/9 violet\n10/14 deep pink\n10/16 taxi yellow, with smiley tie\n10/21 midterm - no xavier\n10/23 deep purple\n10/28 gold oriental\n10/30 lavender python\n11/4 holiday - no class\n11/6 no xavier :(\n11/11 christmas oriental\n11/13 serengeti\n11/18 teal and pink dots oriental\n11/20 celtic green\n11/25 columbia blue\n11/27 fuchsia\n12/2 pink lavender\n12/4 teal\n12/9 blood orange\n\nWorkload:\n20%: 8 problem sets, 1 dropped\n40%: midterm on long-term growth, dropped if lower than final\n40%: final (worth 80% if midterm dropped)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 10, 2013",
            "review_content": "\nAs everyone else has mentioned, there are a lot of great reasons to take Xavier's class. He's funny. He's an expert in long-run growth and has a pretty interesting perspective on current international development, which he discusses at length. He picks a few key points and drives them home, making it obvious what you are expected to learn and therefore obvious what you'll be tested on. And Carlos the TA is awesome, and he will spoil you like no other.\nThat said, I'd like to contest a few common claims about this class:\n1) Carlos's recitation notes aren't the best way to learn the material; the new textbook chapters are. They cover all of the material in the class extremely thoroughly -- half the time, the answers to the problem sets were literally written out in the textbook. And Carlos writes them with Xavier, so it's still the same perspective that you get at his recitation.\n2. The other TAs are actually more than just graders. After literally standing through Carlos's recitation the second week, I decided to try another section. And the TA teaching the recitation was smart. And she knew the material really well. And she could answer questions and explain interesting digressions because there were three other people in the room. It was great. \n3. This is not the best class to take as a way to fulfill the requirements of the econ major. You will come out of it with a very thorough understanding of some aspects of macroeconomics, and granted, things like long-run growth or the impact of changes in productivity are hugely important. But you will not come out of this class with a good understanding of the field of macroeconomics. You will not be able to understand an intelligent conversation about the economy because you won't have even heard of half the concepts that anyone walking out of the Principles of Econ final could explain. You will fully understand every variation of every concept that was taught, but you will not have a basic literacy in macroeconomics.\nSo take this class if you're looking to learn how Xavier sees the world. It's pretty darn interesting. But don't take it if you're looking to cover all the basics of macroeconomics. \n\nWorkload:\n8 problem sets, easy midterm, manageable final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 27, 2012",
            "review_content": "\nDespite what some previous reviews might suggest, there is really nothing out of the ordinary about this class.  The professor is renowned in long-run growth economics, and is well known for his attire, style, and attitude.  On the plus side, he's definitely a good lecturer and will generally keep you entertained, the course certainly was not too difficult, and great help was available throughout the course of the semester.  The class as a whole wasn't anything to write home about, but it wasn't terrible either, and in the end, it didn't seem like most people in the class felt very strong about it one way or another.  \nThe biggest problem with the class was the way that it was paced, and I don't think this was anything new this year.  We spent until the midterm, which was in Mid-October, on long-run economic growth. Given that the instructor is a specialist in this field, he certainly has a lot to bring to the table, particularly during this portion of the course.  This material certainly was very interesting, but material was very sparse in these lectures.  During this time we covered the Solow Model, the AK model, the Solow Residual, and poverty traps,and that was basically what was covered on the midterm.  This was certainly valuable material, nobody needed a month and a half to learn it; it could've been covered in a couple of weeks.  The reason it took so long was in part due to his tendency to spend 20 minutes at the beginning of each lecture reviewing the previous lecture.  Sometimes this was appreciated; other times he went too far and basically repeated entire lectures, wasting valuable time.  Also, he spent several lectures on topics that, albeit interesting, were completely lacking in substance; these topics might be worth 5 minute digressions, but certainly not entire lectures.  For example, we spent an entire week on the evolution of ideas.\n\nTowards the end of the course, the pace of the course picked up dramatically so that we could finish covering all the intended topics.  The post-midterm topics included Robinson-Crusoe: Consumption and Leisure Theory, theory of money demand, theory of investment, Classical vs. Keynesian macroeconomics, and government spending.  The first few topics were covered pretty slowly, but in the end it was pretty rushed.  Government spending was covered entirely during the last lecture, and this material ended up accounting for 20% of the final exam.  \nI found that Carlos's recitation notes were really the best way for me to learn the material; this was true both when I went to class and when I did not.  I unfortunately had a conflict with Carlos's recitation time, but based on my experience with his notes and review sessions, he really is as great as everyone says.  In addition to putting a ton of effort into the class, he really has a mastery of both understanding and communicating the material that is rare among TAs.  I'm sure his recitations were immensely helpful; he's really personable and entertaining, but he is also very efficient with time.  \nProblem set distribution was also uneven throughout the course of the semester.  We didn't have a first problem set until three weeks went by, and then they were either weekly or biweekly, until the last three weeks when they were weekly.  This was representative of the uneven pacing of the course, as in there were weeks that so little was covered that it didn't make sense to assign a problem set.  In the end there were a total of eight.  The problem sets were definitely doable and representative of the material that we were responsible for in the class, but at times they were unnecessarily repetitive and emphasized regurgitation of the material over thorough understanding of the concepts.  The grading on the problem sets was very harsh, but in the end, the exams are what will decide your grade.  Regardless of how many problems were assigned, only one of them was graded, and answers that didn't match the solutions were penalized heavily.  \nThe midterm exam was very predictable after doing the problem sets and the previous year's exam.  It was basically guaranteed that there would be one problem about the Solow Model and one problem about the Solow Residual.  The grading was harsh, and like the problem sets, you will lose points if your explanations do not match those in the solutions.  The final exam was twice the length and cumulative, and a bit more difficult.  It was still very doable despite demanding a lot of writing.  A lot of material was covered in the second half of the course, and all of it shows up on the exam.  I was surprised that government spending counted for 20% of the points on the exam despite only being taught on the last day of class, and no problem set was assigned for this topic. \nUltimately, this class definitely isn't the worst way to take the course if it's a requirement for your major, but it's nothing to rave about either.  Certainly not worth avoiding, but it's also not worth switching up your schedule to end up in the class.  If this class is more than a requirement to you, and you truly want to learn the material, I'd recommend taking a look at the other section of the class as well.  This class was definitely very light mathematically (a few derivatives on the homework and in lecture, but nothing more), and it took an interesting look at a few select topics.  If there is an option between a mathematical derivation and a graphical explanation, the graphical explanation will almost always be used in this class.  If you're looking for a mathematically rigorous survey of the most important topics in macroeconomics, you should look elsewhere.\n\nWorkload:\nThe grade was calculated as follows:\n20% Problem Sets, of which there were 8, and the lowest grade was dropped.  These were biweekly at the beginning of the semester and weekly by the end.\n30% Midterm, average 82 and standard deviation 19\n50% Final, and this became 80% if the grade was better than the midterm\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 24, 2012",
            "review_content": "\nYou probably know most of the most noteworthy things about Xavier, so here are some major sticking points:\n1) Yes, it's a funny class. Audit the first one or two just for fun. After the first few, the jokes get fewer and farther between, but there's almost always something good (his explanation of taxes at the end of the semester was priceless). \n2) The material that Xavier teaches, he teaches well. You won't leave the class scratching your head because there's something you didn't understand. His explanation of the difference between Keynesians and Classical economists is excellent. \n3) That said, the pace is extremely slow, as mentioned before. There was a 2-hour review session before the final, and it really did feel like it covered the whole course pretty hermetically, which shows you how little material there actually was. So I'd wager pretty much any other class in macroeconomics will teach you more. \n4) The worst part of the course: assignments and tests. Do not be surprised if your final grade does not reflect your actual capabilities (I'm saying this as someone who has not yet seen his final grade, so this isn't a personal vendetta), because there are many arbitrary issues with the grading. Problem sets are not hard (though you may need help from wikipedia and google sometimes), but only one question (out of 5-6) is graded each time, so if there's one small mistake or way in which you answered differently than what the solution is supposed to look like, it could take 10, 20 or 30 points off. One example: a problem set in which the question asked something like \"What the effects of X are\". We got an email after the PS was handed in, mentioning that of course this necessitated graphs to show the answer, though this was not mentioned in the question. I had 30 points taken off for that reason. \nOr take the final test. It wasn't too difficult, and was relatively straightforward. However, there was a rule (unfathomable to me) that you only have one A4 page for each question. On the last question, which had around 8 parts, the last 2 necessitated around 2 graphs each, after some 6 graphs earlier in the question. I had run out of space, but was allowed neither to get a new page nor extra time to re-copy my answers. So I ended up not being able to answer the questions, despite knowing the material perfectly well. \nI never went to Carlos' recitation (technical issues), but it's not hard to understand the material from lectures and even more from the book chapters posted to courseworks (most of the problem sets can be answered just by looking at those) \nSo if you want a fun class, interesting explanations and overall not a difficult experience- take this class. If you want to learn a lot and are shooting for a sure A, consider other sections. \nWorkload:\nAround 8 problem sets, rather easy, take a few hours each to thoroughly finish them- which you'll want to do, because the grading is tough (see above). \nMidterm: not difficult, and can only help you (if it would lower your grade, it isn't counted). Grading is strict, though (was deducted 8 points for two miniscule errors)\nFinal: Tougher than the midterm but manageable. Go over all the problem sets and book chapters and you should be fine. (Apart from arbitrary stuff, see above)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 02, 2012",
            "review_content": "\nXavier is a great lecturer. He is funny, clever and profoundly knowledgeable. His personal life story and numerous achievements speak for themselves. However, it would be necessary for those of you who are planning on taking this class to know what you are going to face. \nAs written in the different reviews here, Xavier's class is pretty disorganized and no textbook is assigned (although different textbooks are offered). Secondly, Professor Xavier will go through his planned material no matter what- also is that means that he will teach a 30 min material during the last 10 minutes of class. \nIn different occasions you will find yourself lost and confused. You will laugh and smile from Xavier's jokes but then leave the class and wonder. Do not feel overwhelmed. This class can often be deeply frustrating. \nAgain, do not worry. Go to the different recitations, do the problem sets and go over the practice exams and different p.s!! - then you will be ok. Most importantly- if you can, GO TO CARLOS's review sessions and classes!!! \nGood luck. \nWorkload:\n7-8-9 Problem Sets - TIME CONSUMING!!!\nMidterm- was pretty fair and relatively easy. \nFinal- in one word: long. Do not waste your time on a question you do not understand. Move to the next question and then return to the previous question. Time can be a serious issue here! \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 25, 2011",
            "review_content": "\nI wasn't planning on writing a review of this class, but after reading the review immediately below I felt a duty to save you, future macro taker, from the TRAP you will fall into if you take this class. I learned more about macroeconomics from my principles class than I did from Xavier's class. To give you a little over-view, we spent over two months discussing and REVIEWING the solow-swan model ad nauseam, something that we could have easily spent two weeks, if that, learning. Xavier dedicated a weeks worth of lectures to \"ideas\"--now I know Zara makes clothing faster than H&M;, thanks Xavier--and even spent a lecture talking about the history of money... did you know ancient civilizations used animal bones and feathers as mediums of exchange? Yup, that happened. Also, as technically the last macroeconomic requirement for econ majors we talked about government spending for 30 minutes in the final lecture of the course. Not only can Xavier NOT teach, but he is also NOT funny. Every time he simplified an equation or gathered terms he, in attempt to get some laughs, called it an \"old Japanese tradition\"...the only \"old Japanese tradition\" I wanted to commit in that class was Seppuku. \nThe only redeeming feature of this course was Carlos, our head TA. He was FANTASTIC, and everything I got out of this macro class was due to him. He put together excellent lecture and review notes with extra problems that challenged us and were great review for the midterm/ final.\nBUT, that being said, if you have the choice between this and ANY OTHER macro class, I would go for the other, it was PAINFUL sitting through Xavier's lectures, and can confidently say I learned next to nothing about macroeconomics. \nWorkload:\n8 Problem Sets, Midterm/Final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 19, 2011",
            "review_content": "\nTake this class.\nXavier is a superstar. And I don't just mean that he is incredibly famous and talented-- he dresses and acts like one too. He wears funky blazers to class and has a sense of humor that will crack up the entire hall and lighten the mood, especially during a confusing lecture (like when he is deriving the Solow-Swan model, or explaining the income and substitution effects). On top of that, he's a great economist. A lot of the reviews say that yes, he's funny and all, but he doesn't know how to lecture. I did not find this true at all. Xavier is very passionate and knowledgable about the material, and goes through everything in an orderly and gradual manner. Even if that leaves you a bit confused, he will go over the main points of the concept during the next lecture to make sure you're up to speed. He has a great way of relating everything to real world issues, and will constantly give you present-day examples or anecdotes that keep the class interesting and relevant.\nThat being said, the class is 300+ students and Xavier is a busy guy. The TAs are very helpful and extremely approachable, especially Carlos. GO TO HIS RECITATION. This guy is indispensable. He wrote notes for every topic we took (which practically became the textbook for the class, as Xavier doesn't assign one), and held weekly recitations that went over Xavier's material and helped solve the problem sets. Trust me, you will be completely lost in the class without Carlos. He is very nice, holds extra office hours, and always responds promptly to e-mails. He also held 3 hour review sessions for the midterm and the final, which were extremely helpful. Most of the questions on the exams were similar to those he did in the sessions. Seriously... make use of this guy. You will not survive the class without him. \nAll in all, I loved this class. It was challenging and the problem sets were sometimes annoying, but there were always TA sessions and office hours that helped. I came out of this class having learned so much and not regretting any of the effort I put in. If you love macro and want to have a fun, interesting, and engaging semester, take Xavier's class.\nWorkload:\n8-9 problem sets, assigned almost every week-- usually a week before they are due. The TAs will hold recitations going over the problem sets before they are due, as they can sometimes appear endless and irrelevant to Xavier's lecture.\nEasy midterm. More challenging final, but you'll be fine if you get the material. Curved to a B+ (I think). \n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 19, 2011",
            "review_content": "\nIf you want to learn macroeconomics, then find another professor.  \nIf you are easily amused by outlandish attire and sporadic vulgarities, and you are not paying for the course, then take Intermediate Macroeconomics with Martin.  \nCourse was very disorganized, no textbook and problem sets were assigned inconsistently.  TA's were amazing for the most part, and exams were generously curved.\nIf all else fails, you can claim you went to a crappy comedy club twice a week...\n \nWorkload:\nWhat everyone else listed.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 27, 2011",
            "review_content": "\nI'm siding with the more ambivalent reviews.  Xavier is an outrageously funny guy and you'll enjoy going to class most of the time.  But if you think you're going to use the material in this class one day--in another class, a job, or wherever--try another section first.  The growth theory part of the course (first 2/3) was pretty good--I'll give Xavier that much.  However the business cycle part, what people will expect you to know after taking a class like this, was too simplistic and rushed to be of much use.  I can do Xavier's problem sets and I'm happy with my grade, but I didn't learn much macroecon.\nThat said, I thought the workload was manageable and grading was very fair.  \nWorkload:\n1 midterm + 1 final + problem sets\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 18, 2011",
            "review_content": "\n9/8 turquoise\n9/13 orange\n9/15 yellow\n9/20 lime green\n9/22 neon hot pink\n9/27 lilac python print\n9/29 smurf blue\n10/4 black with red chinese characters (actually was a li bai poem)\n10/6 neon yellow + smiley face tie\n10/11 teal with shiny blue flower design\n10/13 leopard print!!\n10/18 metallic teal/green/pink flowery design\n10/20 mustard yellow\n10/15 lime green\n10/27 dark orange/coral\n11/8 lilac/fuchsia/purple with blocky design\n11/10 highlighter orange\n11/15 neon bright orange with green/yellow flower design (fruity)\n11/17 metallic gold with black circular symbols (they look like chinese fortune telling symbols)\n11/29 forest green\n12/6 tiger print!!\n12/8 gold/yellow\nYes I know I'm missing a few, but you get the idea. Xavier is awesome. \"Children are inferior goods.\" Yup.\n\nWorkload:\nweekly problem sets, midterm, final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 12, 2011",
            "review_content": "\nDid I miss something? Sure, Xavier is a smart guy. Sure, Xavier is kind of funny sometimes. Sure, he's famous. But is he a good teacher? I didn't think so. And here's why.\nThe design of the macroeconomics course is insane. There's no textbook-- meaning it's, like, impossible to have certain things directly defined in a completely go-to source. Also, Xavier sometimes repeated entire lectures. Don't get me wrong; he is a decent lecturer. But there was little sense of direction. Problem sets were indiscriminately distributed; we were given one on a Sunday night during midterms due that Wednesday. Were we ever given our problem sets back? I'm still not sure. The midterm and final were very harshly graded and needlessly nit-picked (though generously curved). This course was designed such that concern for student learning was completely absent. Oh yeah, and you're sitting in a class of 300+, so you really won't get any attention from Xavier, unless it's to ask some douchey question to pet your own ego, as many in the course were wont to do.\nThe TA that everyone came to know and love, Carlos Montez-Galdon, was absolutely indispensable. Honestly, it's unbelievable how much he cared about us learning. He singlehandedly crafted a textbook from the lectures and provide his own lectures with notes. And he was highly approachable. And helpful. Without him, I wouldn't have learned macroeconomics. And he routinely sent us e-mails apologizing for Xavier's faux pas, empathizing with us when we were expected to jump through ridiculous hoops. Why can't he create a macroeconomics course and teach us? He certainly cared more about us learning than Xavier did. \nIn short, If you have a genuine intellectual interest in economics REALLY want to learn macroeconomics-- not just scrape by, but REALLY understand it and, above all, be taught in a course designed to teach you, I don't recommend this class. If you want to be a Wall Street suit and are content scraping by with Bs and As with relatively little actual understanding of how things work, this class is decent. It's certainly not unreasonably difficult. It just wasn't created with your learning as the top priority.\n\nWorkload:\n10 problem sets; midterm; final.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 09, 2011",
            "review_content": "\nProfessor Sala-i-Martin is a great professor. Which explains his army of TAs and 300-student lectures. He gave a good framework for each kind of problem that was asked on homework. He tells lots of neat stories, and always relates the material he's covering to the real world. He also has over 350 blazers, and will soon have enough for each day of the year, and then some.\nThe class was unorganized, however. Problem sets weren't assigned in a timely manner. The material covered in recitations was sort of a crapshoot, because they could be covering material that was covered in a recent lecture, or from a week before, or a week ahead.\nThe problem sets were fair and manageable. There were few at first, but by the end of the class they were weekly. The exams were fair in terms of material, but not in how long we had to complete them. Also, the midterm graders were very harsh. The curve was good though. The final is a good 50%, which can make or break your grade.\nWorkload:\n10 problem sets (1 optional) = 20%\n1 midterm = 30%\n1 cumulative final = 50%\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 27, 2010",
            "review_content": "\nYes, Xavier is amusing. Fancy jackets, relaxed teaching style and good sense of humor. But after a while that gets stale. Humor levels, as mentioned in earlier reviews, decline over the course of the semester. \nCompared to other classes I've done in the Economics Department, this one seemed to lack substance. I guess it's more Macroeconomics' fault than Xavier's, but it's the same concepts recycled in different forms over and over again. After a while, it gets predictable, and needs X to spruce up the class atmosphere. Unfortunately he often fails.\nThere may not be many around who can match his classroom delivery, and so taking the class with him is probably the best option. But don't build the hype too much, and don't expect a riot of laughter every class. I did, and at the end of the course, was left slightly disappointed.\n\nWorkload:\n11 Assignments. Fairly sporadic, but that's probably because of the lack of organization. On an average once a week. Midterm and Final. Both Fair, but grading seemed slightly arbitrary. Use plenty of graphs in the exams, the TAs seem to love them. Overall,standard workload, and yes, you couldn't have gone through Columbia without a class with this guy. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "September 06, 2010",
            "review_content": "\nDon't buy the hype. Xavier is entertaining, but this class was a mess. The volume of people make it very easy for things to go wrong, like having your final disappear and receive an incomplete grade through no fault of your own. \nWhile Xavier is also a sharp man, the material that he must cover doesn't truly seem to excite him, and so he'll treat it flippantly. This is a problem, since you don't actually learn much about macroeconomics. \n\nWorkload:\nEasy weekly problem sets. I did well on the midterm. I can't say how I did on my final, as I've never been shown it.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 22, 2010",
            "review_content": "\nIntermediate Macroeconomics with Xavier was the best class I have taken at Columbia thus far. His lectures were engaging and was well-suited for non-quantitative economics majors. Though there was derivation and some curve drawing, the class was based on theory and intuition rather than strict mathematical modelling.\nThe course tended to cover growth theory for the majority of the class (Solow-Swan model and its limitations). This is due to Xavier's current research on economic growth and poverty levels in developing nations. I felt that the second half of the course was a bit rushed, in that he went over consumption and leisure theory, classical supply and demand, demand of money, and Keynesian economics too quickly. That said, the class is taught intuitively and as long as you understand the logic of the material, it shouldn't be difficult to do well (A or higher). \nWorkload:\n1 Problem Set per week that can range from 1 hour to 4 hours. Some require some derivation of economics principles.\n1 Midterm and 1 Final. Both fair. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "February 25, 2010",
            "review_content": "\nNothing I can write could possibly describe the utter brilliance of Xavier Sala-i-Martin. \nBest class I have ever taken - ever. Xavier has a unique way of making the most boring topics utterly hilarious. It is true that he gets progressively less funny throughout the semester, but he always surprised me with a legitimately funny joke. I don't mean dry, Columbia professor funny. I mean actually funny.\nI think one of the most important things about Xavier that tends to get neglected in his reviews is ... not only is the man hilarious and engaging, but he's a GREAT lecturer. This was the first economics class I ever took, but I still came away understanding (almost) everything he explained to me. If you simply manage to pay attention (I also highly recommend the TA sessions - take Sean's if you can, he's great), you will see the Xavier is very well organized, great at explaining confusing concepts, and he does a good job of spending enough time on the most difficult material.\nTake this class - you'll thank yourself for it.\n\nWorkload:\nOne problem set per week, takes quite a few hours. I recommend taking this course with a friend. I personally found the midterm and final to be very reasonable - nothing we hadn't done in class. Scale is generous.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 18, 2010",
            "review_content": "\nI though Xavier taught the material very well without putting anyone to sleep (although of course, a few people did sleep in class).  The classes gave basic information on the material, the TA session reinforced the material and the notes posted by the head TA on Courseworks cleared everything up and were a great study guide.  The only thing I would complain about was the organization of the class, although it was a huge class.  Midterm grades were given back about a month after the midterm was taken, final grades were given the week before second semester started and problems sets were given back at least a week (maybe more) later.  How well you did in the class was very much correlated to how hard you tried (going to class, the TA session, reading the notes, etc.).  Also, there was a pretty generous curve (10% received A+, 20% received As, etc.) so don't fret if you did poorly on the midterm or final (final was very, very hard).\nWorkload:\nWeekly problem sets (a few hours depending on the problem set), midterm, cumulative final (final grade replaces midterm grade if final grade is higher)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 01, 2010",
            "review_content": "\nXavier is a brilliant growth economist, and extremely funny lecturer. \nHe is very charming and the first couple of lectures are ridiculously entertaining. His class is definitely amusing, and he makes dull topics come to life. Professor Xavier talks openly about a wide range of subjects, with raunchy humor, and wit as well. He's rather shy when you approach him personally, but he always stays for 10, 15 minutes to answer questions. A few interesting things to note are that he often delivers very important commentaries where he explains that he believes macro is more important than micro, and that growth theory, is exceedingly more important short run business cycle disputes. We also can tell he's more of a free-marketeer libertarian, especially when he comes to making jokes of politicians, bureaucrats and governments. Xavier's class is structured into two sections: growth and business cycle theory. He's usually traveling the world, so he's not really at office hours, but he actually responds to e-mails rather promptly.\nXavier is an entertaining lecturer to listen, but he makes it difficult to follow and take notes, although he also spends 20 minutes reviewing the key points from the previous lecture. You learn a lot more from the TA's office hours and recitation, and they are usually rather good. Try to take Sean David Spielberg's TA session. After attending all the TA sessions, I confess he's the best. Detailed notes are posted on Courseworks and solution sets as well.\nThe problem sets are challenging but easy if you work in groups of two or three. If you can do them on your own, then you'll have no problem on the exam. (Its also no lie that the answers to the problems circulate everywhere) \nThe midterm and finals are extremely challenging, and the final is even more ridiculous. It usually involves a lot of intuitive reasoning and requires you to be agile and think on your feet. Many have said that the final is so explicitly difficult to weed out the true economists from the econ majors and the non-econ anybodies. Everyone walked out scared, thinking they failed so the curve is generous. I was personally a defined economics major prior to taking this class. Walking out of the final, I'm not longer certain. If you can rock this class, you're an economics major for sure. \nWorkload:\nAbout 9 or 10 problem sets, each with about four questions. Each has a couple of sub-questions. (The answers are easy to acquire...)\nMidterm is not that bad, usually four questions, and easy if you've studied intensely. (KNOW THE SOLOW SWAN Equation and the Solow Residual)\nFinal is a thousand times tougher than midterm as it is twice as long and cumulative. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "August 23, 2009",
            "review_content": "\nIf you like to go to the circus, then yes, you will enjoy Xavier's macro class.\nBe warned that the glowing reports on culpa are more about Xavier himself than the course.  Yes, Xavier is one of the most charismatic, politically incorrect, dazzling, and best dressed men on campus.  He is also a superb lecturer who understands what he is teaching and hopes to pass that clarity on to his students.\nHOWEVER, this class is literally a circus in terms of how it is run.  For starters, there is no connect between Xavier and his TA's.  Homeworks are not returned in a timely manner, the TAs do not know what is going on with the exams [perfect example: last year's head TA told her recitation that a certain concept would not be on the exam because it seemed too easy, and ended up smack in the middle of the final], and forget solving grading disputes.  No one will be there to listen.\n There is also no textbook suitable for this course as it is designed at the whim of the lecturer.  You are really left to survive a sea of mismatched topics and Xavier's vocabulary in which \"cookies\" stand for GDP and tequila shots explain 3D utilities.\nThe man himself is incredible, the course is severely lacking in transparency.  \nWorkload:\nProblem Sets [decent], 1 midterm, 1 final.  Both exams are filled with challenging questions- however the final urges you to explore more complex concepts.  You are given barely the tools you need to figure them out in class.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 29, 2009",
            "review_content": "\nI have to disagree with all the positive reviews of this professor; Xavier is a nice guy who may keep you entertained for fourteen weeks, but he will not do a good job teaching you macrecon.  \nFirst, I have a few quibbles with the way the course was organized.  Growth theory was definitely overemphasized at the expense of Business cycle theory, but I suppose that was Xavier's prerogative.  As others have said, the problem sets prepare you well for his exams since most exam questions are just like HW questions, so do the hw multiple times if you want to do well.  That said they didn't help me much in understanding how the models worked or how to apply them.  I don't know exactly what it is students typically learn in a class like this, but from glancing at other course sites Xavier's approach is pretty idiosyncratic.\nThat brings me to the real problem with this course.  Xavier's idiosyncratic models and techniques wouldn't have been so bad if he had spent more time actually teaching them instead of, say, talking about some NGO in Africa for 45 mins.  I've got nothing against the flamboyant costumes or canned humor but this man has a pathological self-indulgent streak.  As for his his infamous classroom persona, I thought it was boring and predictable but probably would have got a kick out of it if I had been a few years younger.  Take that for whatever it's worth.  Mainly I think he spent too much time trying to get his students to like him instead of just teaching the material and doing his job.  When he does get to talking about economics it's usually vague, semi-intuitive statements with a rushed derivation and some Q&A; thrown in.  \nXavier is smart guy, reputed to be a first class researcher, and obviously cares about his students but he just doesn't make it come together.  I would sit in class wondering when he was going to write definitions on the board and derive equations, and then go home and try to teach myself the material.  I can honestly say that almost everything I learned in this class came from recitation, supplementary notes from the TAs, and Barro's textbook (it's not quantitative and doesn't follow Xavier's approach but it's still good). \nIn the end, you could do worse than Xavier, but if you're majoring in econ or are seriously interested in the material you would stand to benefit from shopping other sections or even waiting until the next semester.  \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 04, 2009",
            "review_content": "\nOne thing to know is that there is a textbook on courseworks, under one of the folders, that would really be helfpul to use along the way. he claims that there is no textbook, but there is!! i realy dont understand why he didnt tell us about this explicitly. i discovered it before the final ,and wish i knew about it during the semester.\n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 18, 2008",
            "review_content": "\nGreat professor, Great Class. Huge class tho about 300 kids, but Xavier is a great professor. People talk about his jackets, which are cool, but he is a really great economics professor. Really teaches the material well especially for a macro course. Would highly, highly reccomend taking his course.\nWorkload:\nDecent. Weekly problem sets(hard, but manageable if you work in groups), midterm (30%) which was taken right from the homeworks, and a final (50% but if its higher than your midterm it counts for 80%) which was harder, but manageable.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 16, 2008",
            "review_content": "\nWhile Xavier is probably one of the best lecturers I have ever had, I would venture to say be careful before signing up for this course.  While Xavier offers excellent explanations in class of the theories we cover, he moves incredibly fast and I found that my notes could not often keep up with his logic.  This is espeically important because there is no textbook for the class, though I agree that the Problem Set solutions are practically a textbook.  The TA's are helpful enough, but in a lecture of 400 people it is difficult to nail all of the concepts before the final.  \nI also think that the material covered in the class is specifically catered to Xavier and his interests.  While this is amazing because we study theories that he himself developed, it may also make further study of economics difficult.  You cannot refer to books and materials outside of the classroom because they simply don't follow the Xavier logic of things (which is incredible and fun, but not always obvious).\nIf you are not overloaded for the semester and are able to put in a lot of time to understand the course material, then I would say take it.  If not, you might be better off taking a more streamline Macro class and perhaps Xavier's elective later.\n\nWorkload:\nWeekly Problem Sets (not difficult but incredibly time consuming), a midterm (direct copy of the problem sets), and an absolutely killer final.  Thank god for the curve!\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 07, 2008",
            "review_content": "\nXavier lives up to his name as a funny lecturer. He has some interesting things to say but a lot of it is very repetitive. I learned more probably from the TA notes but he is entertaining. \n\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 02, 2007",
            "review_content": "\nBright! You'll be blinded when he enters the room by his jackets of fuschias and tiger stripe--he wears a different one every day. Dazzled! You'll be taken aback by his amazing explanations and lectures--the man is a genius. Laugh! You'll think he should have minored in stand-up comedy; many jokes are sprinkled in part of every lecture. Awww! You'll fall in love with him on the first day--I did.\nWorkload:\nRUN AWAY!!! This part is a bit frightening (for some). There are 10 problem sets with enough time to do them. Their difficulty is give and take. Some of them came from his own graduate book. If I hadn't found the book in Uris I NEVER would have been able to do them. The material is graduate level and he never taught it in class! But yet people got 100% Either they cheated, were brilliant economists, or an idiot savant that sits in the front seat. Two tests: One really easy midterm (2 of the problems were verbatim from  the problem sets). One test at the end. Workload not too much, just kind of weird and thinking outside the box. I think the class is meant to weed out those who will not make it alive through higher econ classes.\n"
        },
        {
            "course_name": "Economic Growth & Development",
            "review_date": "March 21, 2007",
            "review_content": "\nIn terms of teaching skills, Sala-I-Martin a bit hard to follow if you don't know what he's teaching before hand. His board-work is a little messy, though not completely terrible.\nHe is extremely engaging and entertaining, so whether you understand whatÂ’s going on or not, youÂ’ll likely be tuned into the lecture. Be ready to take some of his less than politically correct comments in jest. (However, as politically incorrect as they may be, youÂ’ll laugh at how on-the-mark they really are!) Out of class, and in his hours, Sala was very approachable, and helpful.\nHe is both theoretical and pragmatic, making the course a good learning experience overall Â– in the end you end up getting the big picture better than in most classes. The class is taught at a MasterÂ’s level; itÂ’s not as easy as intermediate macro, but not as hard as a PhD Econ class. It follows that a lot of SIPA grad students take the class, some advanced undergrads, and one or two (lazy) PhD students at most.\nYouÂ’ll be expected to be on point with your multi-variable calculus, though not much beyond that. YouÂ’ll need to use basic Lagrangian optimization techniques quite often. No econometrics is used. The class deals with mostly super-long run classical economic theory, so focus on that if you want to brush up on the intuition. He developed endogenous growth-theory based on R&D;/innovation at the end of the class, a concept that he built from the ground up, starting with the Solow-Swan growth models and even their immediate precursors. YouÂ’ll be exposed to some of progression of the models and ideas that have led to more recent endogenous-growth ideas.\nThe final is difficult, mostly because you donÂ’t have a clue what will be on it (and he covers a fair amount of ground). Like another reviewer correctly mentioned, heÂ’ll throw some curve balls at you while heÂ’s at it. He didnÂ’t test very excessively on the mathematics (since most SIPA students are weak in this field), but he did push some theoretical ideas he didnÂ’t very much develop in class. A recommendation: if you want an easy A, donÂ’t take this class, since itÂ’s all-or-nothing on the not-so-easy 100% weighted and cumulative final. \nIn terms of workload, HW is optional and upgraded, but youÂ’ll be screwed come the final if you donÂ’t do it. \nI can conclude by saying that the class was an excellent experience, and I recommend it to anyone that has a true desire to learn from one of the top growth economists on the face of the planet. \n"
        },
        {
            "course_name": "Economic Growth & Development",
            "review_date": "January 18, 2007",
            "review_content": "\nThere isn't much to say about the man. He's an excellent instructor, who keeps the class engaged through vivid presentation skills, and an aptitude to say the politically incorrect things in a funny, and acceptable manner.\nHis exposition is clear, but quick paced if you didn't read before hand.\nFor being a tremendously busy man, who teaches in Barcelona, manages a charity in Africa, serves as acting president of FC Barcelona, and edits the Davos Global Competitivness Report, he is incredibly receptive during his office hours, and for post-class questions.\nAll in all, Sala is quite possible the best instructor I've ever had. Take his class if you want to learn, and while having fun doing do.\nWorkload:\nNone. The homeworks were optional.\nThe final counted for 100%, and spanned everything and anything seen in class.\nSome of the questions (an important percentage) on the exam went a step beyond the homeworks, and required an ability to apply your knowledge rather than allowing you to mechanically repeat what the notes or homeworks exposed one to. He tested stuff he never explicity taught or assigned.\nThe man tests a bit like a European instructor teaching in Europe. He expects graduate level effort from a G4000-level class, and the homeworks were pretty much of his Grad Macro course, with some slight difficulty downgrading. And he doesn't care too much if your GPA is destroyed. My advice: study very hard, and know your material inside and out, or take one of his mid-level courses for an easier ride. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 13, 2006",
            "review_content": "\nSala i Martin is a great prof. Unfortunately he is the only aspect of the course who makes this course worthwhile.  Despite my deep interest in economics, I found this course very difficult to follow.  The course was taught in an unconventional way and order, which limited student comprehension of the material. As a TA mention, without having the skill taught in later classes, we were trying to asses difficult concepts which are normally not introduced in an economics class. Confusion was futhered by the fact that there was no book to accompany the lectures. Rather the students wereleft to try to make an order of what was learned with documents formulated by the TAs. This class has enormous potential. But it seiously needs either one of two things.  Either Xavier writes a text to accompany the class, or he begins to teach it in a way that is more in line with another book he suggests.  That there are no books to accompany the class, simply indicates the bizarre nature and order of the class.  Few days from the final, I can say that the class was an amazing experience, yet I worry as to whether this sort of unconventional grounding in macro will now be enough to further my study in economics. \nWorkload:\nproblem sets nearly each week, that varied greatly in length and difficulty. Try to figure out an effective way to read Xavier's mind, and then maybe you'll have some sort of idea of what might show up on the exams. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 03, 2006",
            "review_content": "\nA lot of reviewers say that this class has a light workload because there are no reading assignments.  But in fact there is a text, written by Xavier himself:  the solutions to the problem sets.  They constitute a textbook that anyone who wants to succeed in this class should read after handing in each problem set.  They read like a textbook, and they're pretty comprehensive.\n"
        },
        {
            "course_name": "Economic Growth & Development",
            "review_date": "January 18, 2006",
            "review_content": "\nFantastic professor.  Very very entertaining.  But has a way of getting across everything he needs to.  Easily one of the best professors in the department.  \nThe one drawback was that this course was a little math-lite, and as such, became confusing at times if you used his book in conjunction.  (Sometimes, in his lite-version models, a market here or there just vanished!)  There is no textbook, by the way, so you have to attend all the lectures (and recitations).\nWorkload:\n100% FinalOptional readings\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 18, 2006",
            "review_content": "\nI must say, I have NEVER actually looked forward to going to class like I did with his class. It was a great experience, he is by far the best professor I have yet encountered at Columbia. He made it enjoyable to be in class with all of his hilarious jokes/impressions and his teaching methodology made it very easy to learn. I recommend this class A LOT. Since there is no textbook, it is VITAL to attend each and every one of his lectures- that won't be as burdensome as it sounds either, since he's such a great lecturer!\nWorkload:\nWeekly problem sets that count for 20% of the grade. Reasonable midterm and final. If you do poorly on the midterm, and do significantly better on the final, he'll drop your midterm grade and count your final 80% of the grade... \nthat seems reasonable to me!\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 18, 2006",
            "review_content": "\nProfessor Xavier is clearly brilliant in his field, and knows his\nmaterial very well (was always prepared to lecture), but his\nattitude towards the undergraduates was sometimes condescending and\ndismissive.  He seemed far more interested in grad students.  I do not\nfeel this is a good course for undergrads to take.\nThe course management of this class was ABSOLUTELY TERRIBLE.  As far\nas disorganization and disservice to the students, this was BY FAR\nTHE SINGLE WORST COURSE I HAVE EVER TAKEN, PERIOD.  Problem sets\nturned in were returned to students weeks late, disorganized, or\nnot at all.  Problem sets were often made available late, even\nthough the Professor is simply recycling old material, which means\nout lateness in getting them was due to pure laziness.  Midterm\nstarted nearly 15 minutes late due to poor organization, in spite\nof being promised we would start on time to reward students who\narrived early (and time was not extended at the end).  Complaints\nmade about these issues to the Professer were ignored (never once\nreceived a reply to any email I sent him, though he listed that as\nhis preferred method of contact), TA's were only slightly more\nhelpful.  The course being large is no excuse for such poor\nmanagement and streamlining; the environment made it extremely hard\nto learn and get good feedback, even for dedicated students.\nRIDICULOUSLY bad considering the money we are all paying for this\nclass.  A disgrace.\nWorkload:\nReasonable\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "January 01, 2006",
            "review_content": "\nVery fun professor.  He tells great jokes and I really enjoyed going to his class.  My favorite professor at Columbia by far.  I highly recommend him.  Do not pass up an opportunity to take his class.\nWorkload:\nWeekly Problem Sets, Midterm and Final, not bad at all (no textbook)\n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "December 22, 2005",
            "review_content": "\nXavier is a truly gifted professor.  He understands the material so well, and is so good at conveying the information, that he doesn't even use a textbook!  His lectures are usually very interesting, and his sense of humor hilarious.  This was one of the best classes I've taken at Columbia.  Since the instruction was so excellent, I find myself thinking about what I've learned on a frequent basis -- it \"sticks.\"  His homework and exams don't test nonsense questions -- they are interesting, real-world examples of macroeconomic concepts.  If you take this class, you will learn a lot and have great fun doing so.\nWorkload:\n10 problem sets (8 are collected, 7 are graded), midterm (35%), final (45%).  final replaces midterm if higher.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 13, 2005",
            "review_content": "\nWhat a funny guy!  His sense of humor is golden.  However, he does a great job teaching as well!  Some people get so carried away with his jokes that they don't pay attention to the serious stuff, which is dumb.  He doesn't use a textbook, so be sure to take organized and detailed notes.  Fully understanding his notes will be essential to doing well on the final.  His problem sets also help clarify concepts.  The midterm is taken DIRECTLY from problem sets.\nHe is actively involved in issues concerning poverty, esp. in Africa.  He even has a foundation that deals with that matter.  A great guy to take macro with.  You'll get quite a few good laughs, and most importantly, you'll learn some macro concepts well.  Check out his website and you'll WANT to take the class with him.\nWorkload:\nalmost weekly problem sets (all named after disney characters...you'll see), a midterm (based completely on psets) and final (very tough!)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 13, 2005",
            "review_content": "\nWhat a funny guy!  His sense of humor is golden.  However, he does a great job teaching as well!  Some people get so carried away with his jokes that they don't pay attention to the serious stuff, which is dumb.  He doesn't use a textbook, so be sure to take organized and detailed notes.  Fully understanding his notes will be essential to doing well on the final.  His problem sets also help clarify concepts.  The midterm is taken DIRECTLY from problem sets.\nHe is actively involved in issues concerning poverty, esp. in Africa.  He even has a foundation that deals with that matter.  A great guy to take macro with.  You'll get quite a few good laughs, and most importantly, you'll learn some macro concepts well.  Check out his website and you'll WANT to take the class with him.\nWorkload:\nalmost weekly problem sets (all named after disney characters...you'll see), a midterm (based completely on psets) and final (very tough!)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 24, 2005",
            "review_content": "\nATTENTION:  DO WHATEVER YOU HAVE TO TO TAKE THIS CLASS WITH XAVIER SALA-I-MARTIN!!!  THE MAN IS INCREDIBLE!!!\nAllow me to begin by saying that the majority of people who review professors on CULPA  usually either had a fabulous experience with a professor or a horrible one.  I had a great experience!\nThat being said, Professor Sala-I-Martin's class was extraordinary.  The man is a genius in the world of Macroeconomics, in particular in the areas of Economic Growth theory.  Please do not be alarmed by those who say he is \"condescending;\" although he calls us kids, he never does so in a negative or condescending way. He is of Spanish descent where teachers and professors are culturally considered to be your parents away from home and thus his calling us kids is a mere expression of care and not one of  arrogance.\nConcerning his teaching abilities: the man is an extremely avid and talented communicator.  There was never a time when I did not understand what he was talking about.  Moreover, he catered to questions throughout every lecture, so there is really no reason to not understand any aspect of the subject material.  I also appreciate his vivaciousness and flambuoyancy; economics can be exciting, especially for those of us who are Econ majors, but he makes it even more exciting through his jokes and comical personality.\nRegarding the subject material itself: I found it to be more than appropriate.  There were some students who did not appreciate the Econ Growth part, especially since a significant portion of the class was dedicated to this area, but I found it rewarding that we could learn these revolutionizing theories in economics from a leader in the field.   Econ Growth is primarily focused on eliminating poverty, particularly in Africa; it amuses me to think that so many so-called Columbia \"Socialists\" and \"Left-wingers\" would much rather have spent an entire semester focusing on Business Cycle Theory, i.e. the economics of rich nations. \nWorkload:\nWeekly problem set that is not graded, but must be turned in.  We had 1 mid-term, although I believe there are typically two in this class.  Sala-I-Martin kept his promise that they would be taken word-for-word from the problem sets, so essentially, if you understood all of the problem sets (not memorized them since the numbers were changed), you probably scored >96 on the mid-term.  The final: he said it was not going to be done in the same spirit of the problem sets, but it was.  Same kind of questions, different scenarios.  Again, if you understood all of the problem sets (about 10), you aced the final.  This worked for me and many of my collegues, ALL OF WHICH EARNED A 's and A+'s. \n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "January 17, 2005",
            "review_content": "\nThe class' \"theoretical\" lectures did not prepare you for the \"practical\" calculation based homeworks.  If you are looking for conceptual understanding, there is nothing like his \"cookies\" and \"left-side; right-side\" explanation of things.  However, his lectures did not prepare one for the homeworks and midterm-by the final you can study hw solutions, etc. You HAVE to pay attention in lecture and not miss one because everything is covered and based on the lectures -no textbook required.  I found the lack of any textbook a challenge because it was not there to refer to when I didn't understand Xavier and the TAs weren't that great, nor on the same page with Xavier. I can say -the curve is beautiful. You don't have to think too hard to do well. \"well\" being a relative term.\nWorkload:\nas much work as you choose to put in. you can BS the hw but it hurts you in the end.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 17, 2005",
            "review_content": "\nProfessor Sala-i-Martin was thoroughly mediocre.  Beyond being patronizing and demeaning to his students, he was not a particularly good teacher.  He used his own methods, which the TAs did not understand, and made things much more confusing than was necessary.   Xavier was more of a showman than a teacher, something which I appreciated the first day, but regret at the end of the semester.\nWorkload:\nProblem Sets (weekly, ungraded), Midterm (based on problem sets), Final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 22, 2004",
            "review_content": "\nI found Xavier to be decent.  He had moments of brilliance; I found some lectures to be particularly interesting.  Other lectures were entirely consumed by silly jokes and even sillier questions that followed them.  If you want a relatively low-workload macro experience and don't mind his wild outfits and crazy website (it's an experience unto itself), take his class.  If you want a serious macro class, look elsewhere.\nWorkload:\nPretty easy--10 ungraded but required problem sets, easy homework-based midterm, difficult final.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 09, 2003",
            "review_content": "\nWell I didn't think he was that great.  He wasn't all that bad, but I wouldn't put off Macro until he is teaching it because he really isn't all that spectacular. \nWorkload:\nProblem Sets, Midterm final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "April 03, 2003",
            "review_content": "\nFor kids of all types:\n-class was TONS of fun ... every 3 lectures or so\n-is he degrading?  he is currently listed as one of the top 20 economists in the world and therefore, at least at this point in our careers, better than all of us ... so what if he calls you 'kid'? \n-don't buy the book\n-if you do the problem sets, actually do them, not BS, you wont panic around reading week cause you didnt learn anything\n-as far as grades, you'll make what you make in all your other classes.  i did.\nWorkload:\nsee other reviews.  let me use this space to suggest:  make bets with friends on which color jacket he'll wear to class.  Will it be the coral?  Or, we haven't seen the royal blue one in awhile ... how bout the bright yellow pimp one, with the smiley tie?  enjoy ...\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 21, 2003",
            "review_content": "\nA 6pm class in 417 IAB (capacity 395 people) -- full?  Xavier seemed to have managed it.  His class was funny and he did a good job of teaching economics to those who have previously had no background whatsoever in finance and related fields.  Principles of Econ is suggested by the professor, but I did fine without it.  I have no complaints about the midterm or the final.  If you show up to class, don't sleep through class, take clear notes, and are responsible throughout the semester, there is no way that you could do poorly in the class.  It's not hard work, and students who have never taken economics are strongly encouraged to take this class to learn both basic to more intermediate economics and to get a really good laugh.  And yes, you don't need to buy the book; as long as you're taking good notes, you'll get the required information for the problem sets, the midterm (which comes straight from the problem sets), and the final. \nWorkload:\nWeekly/bi-weekly problem sets that are never graded but must be handed in, midterm, final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 21, 2003",
            "review_content": "\nfunny but a horrible teacher.  didnt' teach out of the book, so you had to go to every class and he taught his own version on macro.  treated students like children, gave out candy which may sound nice, but it sucked.  \nWorkload:\nnothing- but you have no control over your grade- its all luck\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 11, 2003",
            "review_content": "\nThe over-enrollment in this class ruined a potentially good class in the economics department. Yes, Xavier does spend a lot of time on jokes, etc, but considering the fact that over half the class was only there for that purpose... Its not hard to do well in this class with the enormous curve. Don't even bother getting the textbook though- you'll never use it.\nWorkload:\n(somewhat) weekly problem sets, not graded but have to turn in, midterm, final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 25, 2002",
            "review_content": "\nthis is the most over rated class. this term he was so caught up on his jokes that he ran out of time to give two midterms so he just gave a midterm and final which kicked everyone's A**. plus he never grades problem sets, so its easy to slip behind, and none of the 10 TA's were willing to hold office hours during reading week. \n"
        },
        {
            "course_name": "Macroeconomics",
            "review_date": "November 23, 2002",
            "review_content": "\nMost everything has been said at this point, but to state my experience. 1) Most engaging lecturer I've ever had. 2) Clear an concise in his explanations... and still covers the material in depth. 3) IS EXTREMELY condescending in his language towards students (we are not kids anymore, thank you); although, I really think this just reflects his happy-go-lucky persona. 4) Easy grading system. I do want to challenge the posts saying you will not learn anything from Xavier. You will!! Like any class, however, you make of it what you put into it. Yes, the grading system of the class makes it easy to slip by without learning anything while still making the grade. But, I put the effort into it (as do many people) and found that I learned more with Xavier than any of the other econ professors thus far. Highly recommended!\nWorkload:\nweekly problem sets. 2 midterms based on those sets. final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 11, 2002",
            "review_content": "\nThis is the most overrated class possible! Sure, the guy may be funny, but you get so caught up in the jokes that you realize you're not learning anything! The problem sets are ungraded and the midterms are so easy (straight from the problem sets, and the TAs even tell you which question to memorize!--the mean on the first midterm was 58/60!!!) that when it's time for the final you have no clue about anything and you just go in knowing the curve is going to have to be huge. I truly feel like I learned nothing, and he's not as fun of a guy as some of these reviews will have you think--much of the time, the class was quite boring, and he talks down to you like you're 12 years old. But if you like M&M; treats and Disney characters, this might be just the class for you.\nWorkload:\nUm, none, really. Weeklly problem sets (10 in all) that aren't graded and thus can be done in 10 mins., and the real answers are provided. 2 midterms, word for word from the problem sets and thus easy as pie. A final that will have you wishing you were dead. Fortunately, the curve is massive--I don't know of anyone who got below a B+ in the class.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 19, 2002",
            "review_content": "\nFrankly, I enjoyed this class. He made the subject matter very accessible, which was a boon to non-econ majors like me (although referring to GDP as 'cookies' gets old after about 2 lectures). Also, the occasional jokes made it far easier to stay awake in class (essential for the exams, considering that the textbook was mostly irrelevant). This has been the best lecture class that I've taken at Columbia, and I only wish he taught more undergraduate courses. The Bottom Line: YMMV (your mileage may vary), but I'd suggest going to the first lecture to check out this class. Then decide.\nWorkload:\n10 Problem Sets (based on lecture material, easy), 2 Midterms (based on problem sets, easy), Final (very very loosely based on lecture material/problem sets, hard as hell).\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 09, 2002",
            "review_content": "\nwow this guy is amazing. After having been through a number of boring econ classes, this guy finally adds some life to a very dry subject!! When you compare him to any of the other econ profs at columbia this guy is miles ahead. A text book is really not required and the mid term is exactly like the psets. A possible A+ class.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "January 09, 2002",
            "review_content": "\nAll past, present, and future students of Xavier's macroeconomics class shall not doubt that this review speaks the truth. The good: Despite claims of a classical bias, Xavier's conservative stance is quite rare among prominent economists and he effectively balances classical and Keynesian theory. For a class of 350+ students, Xavier effectively engages students with questions and the M&M; peanut board/ceremony are creative ideas. The bad: It's odd to see a teacher respond seriously to student questions/comments and yet still treat the class like children, just moved up from \"kindergarten\". Occasionally amusing anecdotes, but there was this long stretch of lectures where Xavier could not avoid take that single moment to interrupt himself to say f-ck this or f-ck that, which had very little to do with macro and wasn't even funny (no comment on the people who actually found that stuff amusing). To be blunt, the disney themes (of the problem sets) are stupid, but that reflects the weirdness of his webpage, which also contains an attack against an unnamed economist (turn off meta-refresh in your browser, load www.columbia.edu/~xs23/) . Perhaps these are just results of Xavier's paying too much alcohol tax (Morris, Nat, this is NOT libel! Xavier even joked he pays no tobacco tax, but a lot of alcohol tax). The major reason Barro's Macroeconomics is on the syllabus is because Xavier's co-written a book with Barro and Barro was his PhD advisor at Harvard. Just go to class and use other macro texts as necessary. Verdict: Yes, it is overrated. Some of these overwhelmingly positive reviews seem to suggest that if you have strong enthusiasm for econ or are an econ major you'll suddenly want to specialize in macro because of Xavier's class, or major in econ if you weren't that interested in the first place. The course is too inconsistent. It is possible to be annoyed by Xavier's attempt to be too much of a showman (a condescending one at that) instead of a teacher.\nWorkload:\n10 problem sets (quite comprehensive of lecture material, thus straighforward if you pay attention), two regular exams (based directly on selected problem set questions, but not exactly verbatim as some have claimed; if you look at the distribution of scores, some students do unusually poorly, perhaps 'memorizing' or expecting the wrong questions to appear). final (not surprisingly, more difficult and meant to be more challenging in order to set the curve)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 21, 2001",
            "review_content": "\nokay, but final was tough because midterms were so easy and students were taken by surprise.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 18, 2001",
            "review_content": "\nThis class is tremendously overrated. Do not expect to learn truly serious economics. Xavier is a renowned economist and he knows his material, but most of the time he tends to treat the class like children. This might be because of the class' makeup: lots of jocks and lots of people uninterested in economics. Thus, the 300+ class size played a problem. Take advantage of the 6 or 7 TA's and get to know them. Also, arrive in class 5-10 minutes early so that you have a seat. Content wise, we focused on certain areas way too much and altogether neglected topics such as internation trade and exchange rates. If you are a serious economics student, take macro with someone else other than Xavier.\nWorkload:\nWeekly problem sets (with annoying Disney themes), 2 midterms (VERBATIM from problem sets), and final (quite difficult).\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 13, 2001",
            "review_content": "\nWhat can I say about Xavier that hasn't already been said... well, you should know that he's a monster in international economic theory, is on the NBER and IMF boards, etc... he knows his stuff cold, and his exams are quite easy. At times his classical bias shows through but all in all he is fair to both Classical and Keynesian economics. A wonderful, funny man who makes his class as much a stand-up comedy routine as a lecture. Don't need to buy the book - go to class (it's not difficult) and do the problem sets and you'll be fine.\nWorkload:\nWeekly problem sets, Two midterms (easy), Final (medium)\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "October 17, 2001",
            "review_content": "\nI reserve my highest praise for professors such as Sala-i-Martin: I simply would not miss a class. Immensely entertaining, yet he also imparts a thorough understanding of the material. Top-notch!\nWorkload:\nWeekly problem sets, Midterms, Final Exam\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "August 14, 2001",
            "review_content": "\nEven if you're not interested in econ (like me), it's worth taking Macro just for the chance to enjoy Xavier. In fact, even if you don't register for the class, it's worth going just to watch the stand up comedy. I know of at least one person who went to the class regularly even though he wasn't registered because it was so much fun. Xavier is a riot, is by far the best professor at Columbia, and most definitely deserves his spot in the M&M; Hall of Fame\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nFlamboyant and witty lecturer. He explains concepts so that people not only remember them, but understand them. Good jokes and flashy threads. Grading is very generous. Be sure to bring plenty of M&M;'s on his birthday -- he deserves them.\nWorkload:\nweekly problem sets, 2 exams based on problems, final exam.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nThis guy is great-he's brilliant and even more amazingly when you consider this department, he loves to teach! Be prepared to entertain and learn. A great course in macroeconomics-even for the non-economics major. A very generous grader. No other professor offers M&M; questions of the day, dress in hot pink suits, and hold office hours at 1 in the morning.\nWorkload:\nweekly problem sets, 2 midterms, final exam.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nNo one will doubt that he is one of the most entertaining and exciting professors in Columbia. He explains concepts very well and it is obvious that he cares about what students think of him. This is one of the few classes where you must attend class in order to do his problem sets. I found the class textbook to be of little use and I relied mostly on his lecture notes. There are weekly problem sets that are due, including two midterms and one final exam.\nWorkload:\nweekly problem sets, 2 midterms, final exam.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nThough Xavier is dearly beloved among Economics students for making his Intermediate Macroeconomics class as lively as possible, students looking for incisive economic analysis should know that he is also a sometime advisor for the IMF and a hardcore free trade advocate with little comprehension of opposing views.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nI agree with all the positive lectures above. I just want to add that you DO NOT need to buy the book. Don't buy the book because it will only confuse you. The only reason why Prof Xavier orders the book is to calm down the anal econ majors who need the security of holding a textbook and because his good buddy Robert Barro over at MIT can make some extra $$$ by redistributing wealth from Columbia student's pockets to Mr. Barro's pocket. I would also like to add that I petition that Xavier (Sha B A) teach more undergraduate classes. Screw the grad students, let's improve undergraduate economics!\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nYou will learn nothing in this class, since there is almost no thinking involved. If you are really interested in economics, Xavier's class is not for you, as he tends to believe that his students have the intellectual prowess of kindergarteners. If you want to challenge yourself, and if you do not intend to work for Goldman Sachs (like every other moron at this school), then find another section. All of the work is graded by the TA's, so get to know them, they might be able to fudge some of the grades for you. I will admit, it was one of the easiest A's I have ever earned at Columbia.\nWorkload:\nProblem Sets (they are exactly the same every year, so get copies of the solutions from someone who has taken the course previously). Midterms (a joke if you can memorize). Final (a little bit harder, but if you can't figure it out, then I guess you are an investment banker).\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "December 31, 1999",
            "review_content": "\nYou must be living in a cave if you haven't heard about this guy yet. He's the best teacher in the economics department, and quite possibly one of the best teachers on campus period. He really seems to love to teach macro, and could very well influence you to love macro as well. He only teaches in the fall so you should rearrange your schedule to ensure that you get him. He's the best macro prof, hands down.\nWorkload:\nproblem sets, two midterms, and a final. while the midterms are straight out of the problem sets, the final is the killer. it basically sets the curve for the class.\n"
        }
    ]
}