{
    "prof_info": [
        {
            "prof_name": "Alberto Malinverno",
            "prof_id": 6660,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Solid Earth System (V2200)",
            "review_date": "January 07, 2011",
            "review_content": "\nA miserable experience. The professors simply read from the lecture slides and labs are a disaster. The TAs who run the lab are ill-prepared and it takes up an insane amount of time. The text (Earth: Portrait of a Planet) is helpful and dumbed down but tests are based on the lecture slides. It is important to STUDY THE LABS for the final, which mostly consists of the questions from three labs. If you attend class religiously and get the labs down, you *might* have a shot at doing well. Also, the field trip will be boring and useless--be prepared.\nWorkload:\nAbout 2-3 chapters of text for each lecture, one long and time-consuming lab per week, one midterm and one cumulative final.\n"
        },
        {
            "course_name": "Solid Earth System (V2200)",
            "review_date": "December 30, 2009",
            "review_content": "\nThis class is dry, boring, and poorly organized....seriously. Let's get real here, it takes a pretty stellar professor to make the study of rocks and plate tectonics interesting; however, don't come into this class expecting that. \nWhile both profs who teach the class are very sweet and seem to care very much about the students, the lectures are painful. The lecture format is about 50-80 slides a class with pictures and diagrams copied from the text book and bullet points taken directly out of the text. I suppose this is nice because it gives you the option since you can succeed either by reading the text or attending the lectures, both is completely unnecessary. However, the class size is small enough that by about the second week they know who each student is and who does/does not attend lecture. Problem set were more like mind puzzles to figure out the answer, once you got it you couldn't believe how simple the answer was. \nThe mandatory lab which is associate with the class is HORRIBLE. Every week attendance is taken even though its all done on the computer, generally it's typing number into excel and making graphs or searching for the answers online using google. This wouldn't be all that bad except for the fact that the directions go in circles so what is expected is very unclear. Consequently, everyone in the entire lab gets a horrible grade, I think most of my labs were in the low 70s which is frustrating to see week after week when you're spending 6 hours on a dumb worksheet. The two TAs are PhD students at Lamont who are forced to TA an undergraduate class and while they were both very knowledgeable they oftentimes did not understand the lab directions themselves which was frustrating. Both were very helpful outside of class when they could meet one on one but in the circus which was commonly referred to as lab, you had to wait behind 5 other confused classmates to have one question answered. I usually signed into lab and left about 20 minutes in. \nWorkload:\n5 problem sets, 1 lab report due per week, midterm, final, mandatory day long field trip\n"
        }
    ]
}