{
    "prof_info": [
        {
            "prof_name": "Sally Chapman",
            "prof_id": 545,
            "total_reviews": 30
        }
    ],
    "reviews": [
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "January 07, 2011",
            "review_content": "\nA piece of cake--as long as you do the Practice Problems every week and make sure you know how to do them all, you will be fine. The three midterms are all based on the practice exams she gives you so study those and make sure you know how to do all the problems. The final has a lot from lab so make sure you know the important reactions and titrations. The final is also full of redox, so learn that well! The weekly hand-in problem sets don't affect your grade very much, and neither does your weekly lab report grade. My lab average was between a B- and a B and I still got an A in the course because I rocked the midterms and final. Just make sure to do the Practice Problems, and of course, practice all available problems, and this class will be a GPA booster, guaranteed.\nWorkload:\nWeekly problem sets that don't count much, weekly lab report that is confusing, try office hours for help, Practice Problem sets that arent graded, but do them anyway! Three midterms, one cumulative final.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "January 15, 2010",
            "review_content": "\nA lot of people write reviews after seeing they didn't quite get the grade they \"deserved\" and subsequently blame Chapman. And on the other side are the geniuses who just GET IT and don't understand why everyone else couldn't understand. Personally, I thought Chapman was GREAT. She's this really spunky older woman and will NOT coddle you or give you the answers AT ALL (which is what some people expect). She'll lead you in the right direction but leaves the rest up to you. Utilize her office hours and don't be afraid to ask questions! I learned a lot and spent a lot of time on my work and barely received a \"decent\" grade. It's hard work but if you're dedicated and ready to work it's manageable. \nWorkload:\nProblem sets every week. Hard. Several exams and a hard ass final. Use OFFICE HOURS and you'll do well. But it's a DEFINITE GPA killer, so beware.\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "January 05, 2010",
            "review_content": "\nOne thing that should have become very clear from all of these reviews is that Chapman is not very warm and friendly. Even if you know what you're doing, she can be very intimidating. Nevertheless, I don't think that this makes her a bad instructor.\nShe is not the type of professor that will coddle you, but she's fair. She's extremely clear about all of the grading, has almost ridiculous amounts of office hours, and she gives you practice tests for all of the midterms that are extremely similar to the exams. \nThat having been said, this is still a very difficult course, especially if you don't have a strong background in Chem. I took AP Chem in high school and got a 5 on the exam, so this class was very little new material for me and was relatively straightforward. If you have a strong background in chem, this class will be fine. However, I had several friends who, while very intelligent and hardworking, had a very difficult time in this class because they hadn't taken much chem before, which made this class a struggle for them. \nOverall, I enjoyed the class and thought that it was taught as well as any chem lecture course could be. I didn't think that it was an unreasonable amount of work, especially since it's a 5 unit class (with the lab). Also, the information you need to know for exams is never outrageous, and it always seems like Chapman is more interested in seeing that you know the material than trying to trick you. Also, she curves pretty decently, which is a plus. \nWorkload:\nWeekly problem sets that usually took me 2-3 hours, 3 midterms, final.\n"
        },
        {
            "course_name": "General Chemistry 2001",
            "review_date": "December 22, 2009",
            "review_content": "\nShe is a fair, reasonable professor.\nAs the previous reviews say, she is not nice if you don't keep the rules and not do the work.\nBut she has the most office hours for help in all the professors I saw, \nAnd if you try on your own and come find her during office hours, she will help you.\nWeekly PS:\nTry over the weekend and go to weekly help session held by the professor.\nYou will see how much you can learn by doing this!\nHandouts given;\nMost information is on the handouts that she gives out.\nThey are very crucial for the tests! (tables, rules)\nPlus, I wanna say, NEVER procrastinate!\nThe final test will not be manageable if you procrastinate.\n\nWorkload:\nas said\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "December 02, 2009",
            "review_content": "\nOkay, so I think that most of the people who wrote these reviews have been overly harsh.\nChapman is a stickler for rules and sort of a bitch when it comes to enforcing them. Yes she's not the nicest of people, BUT she's a good professor.\nHer lectures are clear and organized and she explains things well in class.\nOne thing to know is that sometimes her problem sets ask questions that only the kids who took AP Chem in high school know the answer to because she didn't go over them. Find a friend and ask for help. Her office hours are sort of useless because she works so hard to avoid giving you the answer. Her idea of \"help\" is useless, but a friend (as forbidden as that is) can often explain it simply and quickly and you'll manage. I know some of the girls who work in the help room though, and they're great. The help room is most definitely worth it.\nThe real reason why you should suffer through Chapman: you get to take Orgo at Barnard which is either taught by Rojas or Merrer--both INCREDIBLE professors. Once you start taking Chem at Columbia you're stuck there, and the Chem Department at Barnard is incredible.\nIf you did well in AP Chem this class is completely fine, don't worry about it.\nIf you didn't take AP Chem, be prepared to work your butt off. Either find a friend asap or learn to suffer through office hours.\nWorkload:\nA weekly, graded problem set. 3 midterms and a final. Lab.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "April 29, 2009",
            "review_content": "\nSally Chapman is the meanest professor I have ever encountered in my three years of college experience. While her ability to convey the rather dull information associated with Gen Chem is acceptable (although she does seem to like to make a LOT of mistakes in her presentations, which also lead to immense amounts of confusion in a subject that is so confusing as it is), she lacked an understanding for social interactions completely. This woman is such a horrible representative of my gender, I am embarrassed to call her a woman, especially a Barnard woman. She is MEAN, BITTER, INTOLERANT, RUDE, DISCOURAGING, INSENSITIVE, and all of the other adjectives you can think of that describe impossible human beings you should avoid at any cost. This woman made me cry so many times, in my room, in class, in front of her, at which she did not even blink an eye. I cannot express the emotional turmoil she put me through and how horribly she affected my academic performance. I have never felt so uneasy about a college course and the presence of a professor as I did with her and this god forsaken gen chem class. PLEASE, if you have the choice of taking gen chem ANYWHERE ELSE, DO SO!!!!! This woman will fuck you up for good.\nWorkload:\nIMPOSSIBLE!!!!!!!!!!\n"
        },
        {
            "course_name": "General Chemistry 2001",
            "review_date": "March 10, 2009",
            "review_content": "\nChapman is the devil- there is just no way around that. The weekly problem sets are difficult and she does not let you ask questions about them during office hours. There are dozens of office hours a week but they are all general unhelpful because she spends the majority of the time making you feel badly for not understanding the material you are asking about. She ripped up a girl's first exam because she was writing her name on all the pages- she said she had called time. It was the first exam of the semester and that was 12% of the poor girl's grade. People cried during the final exam. Exam 2 had an entire page that was not covered in the book or on any practice problem set, only on a single page handout given one day in class. A large portion of the final was on an acid base titration with NH3 as the base- something never discussed... we had ALWAYS been given something that had OH- so you could calculate pOH and then pH. The woman delights in being difficult and is generally a royal bitch during the day- if you arrived at office hours a few minutes early she would refuse to answer your questions until the hour began. \nWorkload:\nvery heavy- lab is also included in the course\n"
        },
        {
            "course_name": "General Chemistry 2001",
            "review_date": "January 13, 2009",
            "review_content": "\nProfessor Chapman can be cold but she is not nearly as bad as the other reviews portray. She is really an excellent teacher who knows and cares if you've been putting in effort. She explains the material really well-chemistry made a lot more sense this year than it did in my previous two years of chemistry.\nThis class has the most office hours of any class offered at Barnard- 50 hours a week; they are helpful,if you don't understand the material but don't expect her to do the problem sets for you. Lab office hours are great- Professor Holtz is really helpful.\n\nWorkload:\nIt is a lot: a lab and a hand-in problem set each week. Three midterms and a final. All very reasonable and fair.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "January 11, 2009",
            "review_content": "\nThis class was incredibly boring. If you've taken AP Chemistry and did well, you'll just feel like it's review the entire time. Sometimes she'll do mini-experiments in class which can be interesting, but overall I barely paid attention in class and did fine. The weekly problem sets are pretty easy, the weekly practice problems are NOT, and the tests are somewhere in between, so I suggest you do some of the practice problems to be well prepared. Her office hours are generally useless and she is not very helpful. I've received the following answer several times when I've asked a question: \"We reviewed this in class. Think harder.\" I'm not kidding. I don't know how Chemistry is at Columbia, but the overall consensus seems to be to take it there.\nWorkload:\nWeekly hand-in problem sets, weekly practice problem sets (DO THESE), 3 exams and a final. Pretty decent curve.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "December 23, 2008",
            "review_content": "\nBy far one of the WORST professors I have ever had. She is short tempered, unfriendly, and very unforgiving. She doesn't actually seem to know what she is doing/teaching which makes the class extremely difficult. Her office hours are many, but very unhelpful and a royal waste of time. I liked chemistry coming into the course, but now I absolutely hate it. Chapman made chemistry boring, tedious, frustrating, and pretty much retarded. I wish I had never taken this course because not only did I waste most of my time doing the impossible amount of work given in this class, I had the displeasure of having this old cow as my professor for an entire semester. She asks for a evaluation at the end of the course but I doubt she actually reads them and tries to improve because she just sucks. In every way. Take chemistry at Columbia. Don't even risk it here. \nWorkload:\nextremely heavy.\n"
        },
        {
            "course_name": "quantum chemistry, thermodynamics and kinetics, general chemistry",
            "review_date": "May 25, 2008",
            "review_content": "\nchapman expects quite a bit from her students.  although she's really demanding, her expectations are not at all unreasonable.  in general chem, she holds an incredible number of office hours which are really very helpful.  during my year of pchem, i gradually realized that once you have chapman figured out, it's really very easy to get an A in her classes.  her tests are VERY similar to the problem sets.  buying the book is never necessary in any of her courses.  problem sets are a significant amount of work (especially in quantum-- oh my lord) but doable if you work with others and/or go to office hours.  seriously, she's a really nice person and is willing to work very hard for her students as long as you work hard for her.  also, the powerpoints: SO helpful.  i barely took notes and instead just listened.\nWorkload:\nheavy.\n"
        },
        {
            "course_name": "Quantum Chemistry",
            "review_date": "April 11, 2008",
            "review_content": "\nI'd like to start by pointing out that unless you're a chemistry or biochem major who needs to take this class as a requirement, you should just steer clear of it. Quantum chemistry is NO joke!!! That said, to those who HAVE to take it, this is what you're in for: \nMy compliments to Prof. Chapman. I think she's an all-around great professor. She's very knowledgeable of the material and genuinely cares about making students understand. The subject matter was ridiculously tough and pretty abstract but I think she handled it well, and was always available for help. There's no way you can even survive this course unless you go regularly for help anyway. Plus there are weekly graded problem sets, worth  24% of your grade. Those p-sets are killers!! They require A LOT of thinking and calculations; and you should start them as soon as you get them. Also, I must say that this course has very little qualitative chem material. It's almost entirely calculus and belongs more in the math department. Do yourself a favor, and take this class in one of your light semesters. DO NOT ATTEMPT TO PAIR THIS CLASS UP WITH ANY OTHER CHALLENGING COURSE. Also the lectures are all powerpoint slides. Some ppl say thats not efficient because you can't teach math on powerpoint but the advantage is that the slides are on courseworks and you can return to them anytime. \nWorkload:\ntedious weekly problem sets(24% of grade).You should do them all or else you'll just fall behind and never recover. 2 exams (each worth 16%), Final (32%), and a 10pg fairly graded computer project (12%)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 11, 2007",
            "review_content": "\nI used to like chemistry. I took Chem AP in high school and did fine. I come here, all eager in my pre-medness and I get Sally Chapman. Oh boy. Let's start off with this. She has succeeded where no other professor has-She was able to put me to sleep EVERY lecture. Every single one. No joke. Second of all, her problem sets are ridiculous and she is of no help during office hours. Her exams are HARD. So many people dropped pre-med because of this class. This is an extremely challenging class and anyone taking chem for pre-med should just take it at Columbia...the curve is so much better and seriously, your GPA is what matters here so do yourself a favor and don't throw it away by taking Chapman's class. \nWorkload:\nWeekly problem sets that are difficult. Hard tests with little to no curve. Guaranteed to make you cry or even weep hopelessly. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 17, 2007",
            "review_content": "\nDefinitely a difficult class, but Chapman is a very good professor. She is absolutely knowledgeable about the subject and is extremely organized. She offers many office hours which are helpful, unless you're looking for her to solve the problem sets for you. During office hours she will answer any question as long as it does not directly solve the problem from the problem set of that week. Ignore the textbook (we used Chang this year); it's useless. For exams (which are definitely tough), go through every handout she gives, study your notes, and do many practice problems.\nWorkload:\nweekly problem sets; two midterms & final \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 26, 2006",
            "review_content": "\nFirst of all, let me warn you: this is an extremely hard and demanding class, and you're going to end up hating the professor.\nThe problem sets were hard and took up too much time- Chapman seems unable to comprehend that we have OTHER classes besides Chem.  It's impossible to complete the problem sets without help, and during office hours, Chapman doesn't even answer questions directly (ugh).  I heard about other students taking Chem at Columbia...and I wish I did too.  The lab wasn't bad- it was possible to do very well BUT some of the lab write-ups took me 3+ HOURS. \nThe exams: the first one wasn't bad, so the grading was extremely HARSH.  The second one was a KILLER- the practice exam had absolutely NOTHING to do with the second exam, and so it turned out that the majority of the class failed- thus, the grading was very lenient.  The final--another KILLER.  There was no practice exam posted so I had no idea what the heck to study for in particular.  The grading was too harsh for the final.\nThe powerpoints and lectures were pretty useless, in my opinion.  She is a very organized lecturer but I think the book was better.  But then let me add that the book was absolutely USELESS.  USELESS!  I paid a lot of money for a useless book.  The only thing that I would recommend purchasing is the study workbook that correlates with the text.\nMy summary of this course:  an extremely challenging class that will DEFINITELY bring down your GPA.  It would be a lot better if the professor learned how to prepare the students for the exams better--I'd recommend that prospective students for this class should ask about Columbia's chem class if they want to save their GPA and also avoid a horrible professor.\nWorkload:\nHEAVY HEAVY HEAVYProblem sets that take hours and are impossible to complete individually.First exam- easy but hard gradingSecond exam- CRAZY, DIFFICULT, IMPOSSIBLE! Final- impossibleLAB- not bad, but takes wayyyyyyyyyy too much time.\n"
        },
        {
            "course_name": "General Chemistry 2001",
            "review_date": "December 22, 2006",
            "review_content": "\nProfessor Chapman is one of the best professors I have had while at Barnard. She is very professional and exceptionally knowledgable about the material. Her lectures are clear and well-prepared. She works hard for her students, and it shows. She makes herself very available for help (holding more office hours than any 10 teachers I know combined) and will sometimes stay after she is supposed to stop to help out. It is by no means an easy class, but if you work hard and utilize her as a resource, you will undoubtedly succeed. Yes, she gives quite a bit of work (but no more than any other science teacher... the sciences are work-intensive fields) and sometimes her tests are rather surprising (it seems kind of ridiculous to have a class mean on a test be a 58%...) but she is an exceptional teacher and I would reccomend this class to anyone even vaguely interested in Chemsitry.\nWorkload:\nRather heavy - difficult weekly problem sets, long readings, 2 midterms and a final\n"
        },
        {
            "course_name": "General Chemistry 2001",
            "review_date": "December 18, 2006",
            "review_content": "\nI have no problem with Chapman as a professor.  I think she is a great lecturer.  It seems like a lot of people thinks she moves quickly and her problem sets are difficult.  But, I think there's an equal balance of difficult and not so difficult material.  I think the department really tries to balance it for people with chemistry background (AP chem) and without background.  Students without a strong background may have to work a little bit harder, but it isn't that bad.  \nWorkload:\nWeekly problem sets, 2 midterms and a final.  all are fair and to be expected.\n"
        },
        {
            "course_name": "Themodynamics and Kinetics",
            "review_date": "September 07, 2006",
            "review_content": "\nHonestly, this class was pretty terrible. Chapman seemed to think teaching involved outlining the complicated derivatives and concepts solely by relying on powerpoints, for god's sake.\nShe's not very objective in treating her students equally. If she doesn't like you, for whatever reason, it'll make for an uncomfortable time. \nThat said, her office hours are helpful as she runs them like problem-solving sessions.\nAs a major requirement, this class was boring, un-engaging, and not nearly as fascinating as chemistry can be.\nWorkload:\nRelatively tough. One arduous problem set each week (go to office hours or you won't survive!), one take-home exam, one \"easy\" in-class midterm, the horrible final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 03, 2006",
            "review_content": "\nShe is very organized and doesn't really take nonsense. If you're having a hard time, she's pretty easy to talk to and willing to help you... if she likes you. Stay on top of problem sets and keep up with the material or you'll be sure to drown.\nWorkload:\nWeekly problem sets, two midterms, pretty tough final. \nthere is a curve.\n"
        },
        {
            "course_name": "BC2001 General Chem ",
            "review_date": "January 18, 2006",
            "review_content": "\nChapman is a really great lecturer, extremely clear and organized while being willing to take questions during class. She is very stern and not so warm unless you make a true effort, going often to office hours (of which she has about a million, which is so great) with good questions. Overall, this was an amazing class and it totally turned me into a chem major. And it's not nearly as hard and scary as it's made out to be, especially with Chapman there to answer your questions. \nWorkload:\nNormal-- weekly problem sets (challenging, but completely doable), two midterms (hard but fair) and a final. Lab also should be factored in there somewhere.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 07, 2003",
            "review_content": "\nProfessor Chapman is an excellent professor, and her lectures are extremely clear. I especially liked the fact that she actually did some experiments during class to show us how what we were learning connected to more practical uses in the lab. While she may not seem approachable, she is actually very nice and always willing to answer questions (and trust me, you will need office hours for those weekly problem sets). Her exams were difficult, but manageable, especially if you keep up with the weekly problem sets. The problem sets are extremely hard, but nothing you can't figure out if you go to her office hours (so make sure to add the office hours to your schedule)! The exams were very similar to the problem sets. The final was really hard but actually didn't turn out bad, and she gives a good curve at the end. In general, this is a tough class, but Professor Chapman is extremely intelligent and knowledgeable and if you are willing to put in the effort, you should definitely take this class, you will learn a lot. Oh yes, as a random aside, the textbook is totally useless. I'm dead serious...nothing from the textbook will ever help you, so you might as well not bother. \nWorkload:\nVERY heavy, but doable. Office hours are a necessity so make sure you have time in your schedule (she has lots of available times, very accomodating). Weekly problem sets are very tough and time consuming, but doable, as are the exams. \n"
        },
        {
            "course_name": "G Chem 1 Fall 2002",
            "review_date": "April 09, 2003",
            "review_content": "\nDo not take this class unless you are prepared to work and keep up.  If you put the time in then you'll do ok.  The material can be difficult and the pace is quick.  This combined with a really huge class size can spell disaster.  It's really important that you keep up with the work.  Once you fall behind it's pretty much all over.  I know this first hand. Despite all of this Chapman is a good professor.  She's really organized and obviously puts a ton of time into teaching the class.  She has office hours almost every day, so if you need the help, you can get it.  While she may seem unapproachable, when you actually talk to her she can be very understanding and kind.  If you are willing to work really hard and want to learn, take the class.  Otherwise run the other way.\nWorkload:\nHEAVY!! \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 09, 2003",
            "review_content": "\nI highly recommend Prof. Chapman and this class. If you are interested in Chemistry and are prepared to really learn it, Chapman will teach you very thoroughly. The class is difficult, but if you go to lecture, take good notes (she writes everything down in a very organized way that is easy to understand), and take advantage of her office hours, you will be fine. I am not saying it is easy, but then again, there is nothing about the subject of Chemistry that is easy. Chapman is a wonderful teacher who really knows and understands Chemistry, and if you ask her a question, she can explain it in many different ways until you understand. Although the lecture is big, if you put the time in for her, she will help you. For all pre-meds, this intro class really prepares you with the base knowledge for organic 1. Strongly recommended.\nWorkload:\n2 midterms, a cumulative final, and weekly problem sets.\n"
        },
        {
            "course_name": "BC1601 and BC3252",
            "review_date": "March 27, 2003",
            "review_content": "\nQuite honestly, Chapman scared the crap out of me in freshman chem, but she's an excellent lecturer who is super-organized.  Also, she holds her office hours like problem solving sessions and is always happy to help you if you don't understand something, even if you won't get homework answers from her.  The problem sets are difficult, but good indications of upcoming exams.  She does get more personable in the smaller Thermodynamics (BC3252) class, but I doubt you'll take that unless you have to.\nWorkload:\nWeekly problem sets and suggested textbook problems, midterms, final, (thermo has 1 take-home midterm).\n"
        },
        {
            "course_name": "Gchem I",
            "review_date": "March 26, 2003",
            "review_content": "\nAlthought Professor Chapman knows her materials very well, but is not a very understanding professor.  She gave me and my friends a grade that is lower than we deserved and all of us found it no point and hopeless to go and talk to her about it because we know that she is not going to do anything to change it anyway, but just to humiliate you.   Agree with this other review on the web:  This class is HIGHLY UN-recommended!  Sally Chapman is a very quick-moving professor who expects all students to put her class at first and only priority among other classes.  She is VERY strict on non-academic aspects of the class, which really takes away from the material in itself. PREMED STUDENTS AT BARNARD: Take Chemistry at Columbia!!! This class was my worst experience at Barnard and I strongly do not suggest it. She may know her material, but I felt that it really impeded my learning of the subject because I disliked her as a professor so much. \nWorkload:\nVERY HEAVY  Weekly problem sets that is almost impossible to finish, lab reports that could make you stay up all night just to finish it, two horrible horrible exam and one scary scary final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "February 24, 2003",
            "review_content": "\nThis class is HIGHLY UN-recommended.  Sally Chapman is a very quick-moving professor who expects all students to put her class at first and only priority among other classes.  She is VERY strict on non-academic aspects of the class, which really takes away from the material in itself.  PREMED STUDENTS AT BARNARD: Take Chemistry at Columbia!!!  This class was my worst experience at Barnard and I strongly do not suggest it.  She may know her material, but I felt that it really impeded my learning of the subject because I disliked her as a professor so much.  \nWorkload:\nHEAVY: Weekly problem sets, midterms, final.\n"
        },
        {
            "course_name": "General Chemistry II",
            "review_date": "February 22, 2003",
            "review_content": "\nDo not take this class unless you have to!!!! While Chapman is a very good teacher, the material is HARD. It is absolutely impossible to do the problem sets on your own. The exams are impossible as well. The 9:00 lecture with 150 students puts you to sleep. Do not take this class unless it's necessary!\nWorkload:\nWeekly impossible problem sets and lab reports, 2 midterms and a final. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 23, 2002",
            "review_content": "\nChapman is tough, one of the toughest around. Only take this class if you are prepared to work your ass off and not see it pay off.  Don't forget that the class is 5 credits, so it really weighs on your GPA. She is a good lecturer, but chemistry is chemistry and that means boring. Avoid this class at all costs! Take Chem at Columbia!\nWorkload:\nweekly problem sets that are killer, two ridiculous midterms and one horrible final\n"
        },
        {
            "course_name": "BC1601-BC1602 General Chemistry",
            "review_date": "April 21, 2001",
            "review_content": "\nChapman is certainly on my list of top ten teachers ever. She gives a formal and professional lecture, but welcomes any and all questions in class, no matter how seemingly stupid. I really felt like she wanted us to understand the material, and since she is a walking genious of the subject, she did a great job explaining it, slowly and clearly. She was especially helpful during her office hours - the weekly problem sets are tough, but she is more than willing to help you figure it out, without actually feeding you the answers. The exams are hard, but what do you expect - it's chemistry! They hold no surprises if you study and keep up with prob. sets. True, you will hear that she is not a particularly loving, sweet-talking, motherly figure, but what does that matter? She know her stuff damn well, and she, unlike many who are also experts in their fields, know how to teach it.\nWorkload:\nWeekly problem sets, three midterms, one final.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Chapman is a straight forward, businesslike lecturer who is thorough and knows her Chemistry. Professor Chapman will answer questions during lectures and will try to explain as best as she can. She gives weekly problem sets that are difficult and mandatory. Her exams are thorough and difficult.\nWorkload:\nWeekly Problem Sets, 2 Midterms, and a Final\n"
        }
    ]
}