{
    "prof_info": [
        {
            "prof_name": "Elizabeth Murphy",
            "prof_id": 10569,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Latin I",
            "review_date": "July 07, 2011",
            "review_content": "\nMs. Murphy is very knowledgeable about the subject matter in which she teaches, but understanding the information is not distributing the information - which is where this particular instructor is lacking. I quickly came to understand that she has absolutely no background in linguistics or philosophy of linguistics, so her understanding of Latin is more a matter of memorizing charts than having a deep understanding of the language.  The textbook used in her class was not too bad, however, I believe the format of the book is ambitious in a way that is inappropriate for people picking up the language for the very first time.  Other foreign language instructors and commercial foreign language textbook editors I have shown Learn To Read Latin to have laughed it off as one of particularly poor quality.  The problem with Ms. Murphy in that regard is that she is bound to teach from a poor textbook, and without the education in linguistics, she is incapable at this time in her career of bridging the gap between pedantic instruction and the potential for dynamism found in other language courses.  Having taken her class as an adult, and having come from working in academia for many years, I know that there are seasoned professors with the ability to make any subject accessible to the student, Ms. Murphy is just not there yet.  Her youth counts against her here, as she has been prone to over-emotional and highly unprofessional emotional outbursts in class.  Her tests are tough but fair, she even grades fairly, but the amount of very uncomfortable moments in the classroom were highly unrepresentative of the Columbia experience.  If you have the opportunity to take Latin with another instructor, I highly suggest you do.\nWorkload:\nHigh but not unreasonable\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "May 22, 2011",
            "review_content": "\nI am somewhat in agreement with the review below. However,  I am not sure why a student would say that Elizabeth is strict and demanding.  We were not only taking a language at a college level; it was a language class at Columbia University.  Languages move at a break neck pace at this place.  In order to succeed, you need to study your vocab everyday, review for the weekly exam, do your homework, and participate in class.  Elizabeth expected all of that and I believe that it was perfectly reasonable.  Her expectations were not any different than any other language professor on campus.  She was very caring and was always available before and after class to meet individually.  I emailed her all the time with questions and she always responded thoughtfully within a day.  Towards the end of the semester, she formed a weekly study group so that we could successfully pass the final exam.  In addition, I thought she was a really fair grader.  If you are sincere about a desire to learn Latin, sign up for a class with Elizabeth.  \nWorkload:\nHomework for each class, weekly quiz, two exams, one final, study your vocab every day.\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "May 16, 2011",
            "review_content": "\nElizabeth is extremely strict and demanding. The workload for this class is quite heavy to the point that it can seem excessive. Yet, I do not regret taking this class whatsoever. After a mere 3 months of Latin, I am now able to translate short excerpts from various poems, such as the Metamorphoses and the Aeneid. This would not have been possible had it not been for Elizabeth's strict disposition and the heavy workload. Looking back I doubt I've ever learned so much in a class. Elizabeth is also extremely helpful and is willing to help you out whenever you're stuck or need extra practice. She is also quite good at explaining difficult grammatical concepts.\nThis class is not for everyone, as you need to be willing to work very hard in order to keep up and succeed. However, as long as you're willing to put in the effort, you'll do fine and appreciate everything you learned.\n\nWorkload:\nWeekly quizzes, 2 midterms and a final. A LOT of homework.\n"
        }
    ]
}