{
    "prof_info": [
        {
            "prof_name": "Aileen Forbes",
            "prof_id": 9680,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 06, 2012",
            "review_content": "\nProf. Forbes should definitely not be counted among the easier Lit Hum teachers. She can be demanding, and it's true: she *will* eventually lead the class towards her own conclusions, and you as a student towards writing the paper she wants you to write. More often than not, you'll come to the individual writing conferences with her and find yourself leaving with a completely new essay and an argument that she has basically laid out for you. Most of the times, all I had to do was find quotes that demonstrated her own argument, write in my own words and expand/analyze a bit, and my essay was done.\nHaving said that though, I think I definitely appreciate all she did for me as a student. I think it a bit arrogant to call a teacher \"horrible\" because she gives her own input or treats you somewhat \"condescendingly\". It's true, sometimes I felt a bit uncomfortable, and she would quite openly dismiss our interpretations/ comments with an \"okay...\" or, even sometimes: \"or maybe not\"; discussions eventually gravitated towards what she wanted them to, and at one point she *did* admit that she was being a bit harsh in our individual writing conferences. BUT I think in the end she had a good plan and I got a good taste for all the works. More importantly, I left the class with a genuine interest in literature, and a much better approach towards analyzing works. In the end, pretty much every single Lit Hum teacher has a plan they must all stick by; it's part of the class itself. So do not in any way feel discouraged because she doesn't consider your comments extremely valuable or important. She will *always* give you the chance to speak no matter how many stupid comments you've made. In the end, we're all here to learn, not to have our opinions validated or applauded every single time. Sometimes we'll be right, sometimes not. If I knew everything about literature before Columbia I wouldn't be here, and I think in the end Prof. Forbes gave me a great new perspective on all these classic works. In the end, what may seem as condescending attitudes or forced discussions are part of the learning process. It might be a bit unconventional, but at the end of the day, I'm sure I'll look back and miss Prof. Forbes. She always gave helpful comments, was interested in seeing us learn and grow, was *always* available to write recommendations and help out with any applications, baked us sweets and brought food for us sometimes, etc. \nSo to sum up: \na. I won't sugar coat it: sometimes you'll feel frustrated with her class, sometimes you'll feel embarrassed or even dumb. She's tough and sometimes you'll consider changing sections.\nBut:\nb. we're all here to learn and grow, and though she may be a bit rougher or less nurturing than one would like, that's part of the college learning process every new student should quickly get used to.\nProf. Forbes is definitely not suited for everyone. If you like to hear your thoughts validated, feel like you're the smartest person in the world who knows how to interpret all of these works already, then you're better off steering away from this class, and--if I may-- steering away from Columbia, period. No one here's going to make you feel adored or particularly intelligent; if you *were* actually that smart, there's no need for you to even be here. However, if you're willing to stand up to the challenge, face this class like any real, dedicated student should face any college class, and come into every discussion with an open mind and an attitude to learn, you'll really grow a lot as a student and as a person with Prof. Forbes. It may be tough love sometimes, but at the end of the day you'll appreciate her work, and the hug you give her when you turn in your final will be genuine.\nWorkload:\nMidterm (15%), 5 page paper (15%), 8-10 page paper (25%), Final (25%), Participation (20%, includes a \"discussion facilitator\" assignment)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 30, 2011",
            "review_content": "\nProfesor Forbes wins the award for the most discouraging professor at Columbia. The discussions she \"led\" in class were dry and non-engaging. As far as meeting with her during office hours she was 20-30 minutes late in each of my sessions and then proceeded to rip everything I had worked on to pieces without suppling a reason as to why my work was faulty. If she doesn't personally agree with your interpretations or opinions don't expect to succeed in her class. Professor Forbes takes sick pleasure embarrassing students during discussions. The only thing I learned in this class was how to stress out in more ways. \nProfessor Forbes has quite possibly ruined my experience with the Core at Columbia. Obviously I would NEVER recommend her to any students. In fact, if you are enrolled in her class get out as soon as possible. Do not expect to have a fulfilling experience or enjoy Lit Hum (as much as that may be possible).  I feel fortunate to have survived this class with Professor Forbes. \n\nWorkload:\n2-3 papers (1 practices, 1 midterm, 1 final) 5-7 pages, 1 midterm test, 1 final test\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 13, 2011",
            "review_content": "\nProf. Forbes is an unpleasant teacher to work with. Her discussions seem forced, as if she must arrive at her own conclusion if we are to move on. If a student contributes an opinion that she disagrees with, she will often answer with a condescending, \"Ok...\".  I find it very demoting and rude. You will often find yourself trying to find that magic sweet point that she deems is \"correct\" analysis.\nMeeting with her during office hours can be a hit or miss. If you can somehow please her with your essay ideas, she will usually agree but then alter it to fit her agenda. If she doesn't like it, however, she will ruthlessly tear it apart. You'll have to come back and give it another shot in a meeting. The best way to learn from Ms. Forbes is to simply let her change your ideas. It is not worth it to risk a paper that she doesn't find satisfying.\nI honestly would not recommend Prof. Forbes. She is not an inspiring teacher that really wants you to become engaged in the texts. Rather, she likes to adjust things to her own personal agenda without any room for the incorporation of other people's ideas.\nTake notes about the passages in class and incorporate her analysis, not the one the class you and your peers discussed about, if you want to do well.\nWorkload:\nClose Reading Analysis, Midterm (Identification, Essay), 5-7 page Paper, Final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 02, 2010",
            "review_content": "\nThis was definitely not an easy class and Prof Forbes certainly demands a lot from her students. But she is more than willing to put in extra time to help you improve and overall I think I learnt more from her class than I have from many of my other professors. I also really enjoyed it.\nI would certainly agree with her statement that you should expect to improve over the semester. My first essay came back with the lowest grade of my academic career so far, but having met with Prof Forbes and discussed her comments I think it was probably a fair reflection of the paper I handed in. And when I asked for help to improve she put in significant amounts of extra time to help me, culminating in two much better essays in the second half of the semester. And the disappointing first grade didn't stop me getting an A overall in the class. \nClasses themselves are a little more structured than some other lit hum sections, but Prof Forbes knows her stuff and does a good job of pulling out common themes and threads between the different books. The class atmosphere was usually relaxed and for someone who really isn't that confident speaking in public it felt both supportive and encouraging. \nOverall, if you're looking for an easy A this probably isn't the class for you. But if you're actually interested in the books and want to improve your academic writing style I think you would be lucky to get Prof Forbes.\n\nWorkload:\nUsual Lit Hum stuff. A fair amount of reading. Graded participation in class. Three 4-5 page essays, with plenty of freedom in terms of topics. In-class midterm and departmental final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 01, 2010",
            "review_content": "\nWow, I also had Prof. Forbes last fall (2009), and I am really surprised at the below review she received.  I thought most of the class was as sad as I was when Prof. Forbes was moved to a GS section of Lit Hum in the spring, but I guess her grading rubbed some students the wrong way.  In my opinion, even though she was literally called at the last minute to teach this course in the fall and spring, she did an excellent job leading interesting and stimulating class discussions.  \nWhat I most liked about her class was that the discussions were guided half by her and half by the students.  She had an outline of what she wanted to discuss, so the discussions were definitely organized.  However, she liked listening to different opinions that didn't always correspond with her initial interpretations of the literature, so she always welcomed tangential discussions on concepts that weren't on her outline.  Whereas my spring semester professor asked us questions until he heard the answer he wanted and then moved on, she encouraged everyone to continue discussing what details made them agree or disagree with various ideas.  My only complaint is that I wish she was a little more willingly to dismiss the occasional absurd ideas that held practically no validity, but I'm glad that everyone's opinions were heard. \nWith regard to the essays, she told us what she wanted before the first essay was due and repeated it before the second one.  In brief, she wanted focused thoughts based on a few key quotes from small portions of the text, and she wanted each paragraph to build on the prior one until a conclusion was reached in which something new was learned beyond what was presented in the introductory paragraph and the thesis statement.   This \"building\" was the hard part for me and most other students: she did not want a middle school essay where we present a thesis and then a few supporting examples and then a conclusion that reiterates the intro; she wanted each thought to build on the one before it in a ladderlike progression.  \nProf. Forbes also went over other details on writing and editing essays for about half of a class period, so we were definitely given more guidance on what to write than most other Lit Hum classes.  Moreover, Prof. Forbes made every student schedule a one-on-one meeting with her some time during the two weeks before the essay was due.  Although all we \"needed\" to know was what book(s) we were writing about and a potential thesis, she recommended that we come with an outline of ideas, so that we could discuss where we were going with the essay.  During both of my meetings with her, she saw that I gave serious thought to my unique papers, and she, in turn, spent a lot of time telling me which parts of my paper were strong and which ideas needed improvement.  Before the second paper was due, she even scheduled an extra meeting with me because I had a lot of great ideas but problems choosing which to include and how to organize them.  \nAs a result, I think that \"she [is] the model of caring and support\" as both an adviser and a professor.  She has high expectations, one of which is improvement, but she contributes a lot of her time and energy helping us meet them.  If you put in the time and energy to critically read the books, write interesting papers with ideas that go beyond what was said in class, and listen to the advise she gives in class, in the one-on-one meetings, and in office hours, you will emerge as a much better reader and writer (and you will do well in the class too).  I really did not find her cryptic or Nazi-esque at all, so do not be afraid to take this class; you won't regret it.  \nWorkload:\nA 4-6 page paper on one work from the first half of the semester, a 7-10 page paper on two works from the second half of the semester, a midterm, a departmental final, and a few 10 minute work sheets with quote IDs or sample essay prompts to help us know what to expect on the exams.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 04, 2010",
            "review_content": "\nProfessor Forbes had good intentions, certainly. A student advisor by day, she was the mdel of caring and support at the start of the semester. I remember, in her opening spiel, that she casually mentioned that students should expect to improve in her class. That perhaps, they wouldn't be happy with their initial grades, but that they should hope to do much better as the course progressed.\nThis of course was an understatement.\nProfessor Forbes only prescribed two assignments for the entire semester - one 4 page paper due around the time of the midterm, and one 8 page paper due at the end of the semester. At first, you'd think this was great. The problem was, Forbes took a Nazi-esque approach to the grading process. Without any precedent at all, she would grade cryptically and word for word, leaving all of us in her seminar more than a little dazed. To say she was misleading would be an understatement - I myself remember putting points I had discussed to her enthrallment in class in my paper only to have her rip them apart when submitted. \nI honestly would not recommend Forbes. At all. Her class was frustrating at best, and she left her true opinion to the worst possible times: when grades were at stake. \nWorkload:\nLots of in-class discussion (like any other Lit Hum class), a few meager identification worksheets \"to be discussed in class\", one 4 page paper, one midterm, one 8 page paper and one standardized final. \n"
        }
    ]
}