{
    "prof_info": [
        {
            "prof_name": "Todd Berzon",
            "prof_id": 12537,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2013",
            "review_content": "\nTodd was so great and I miss him dearly. He was constantly concerned about our opinions of him and maybe tried to influence them with baked goods. Many a 9am class I was greeted with homemade cookies or muffins with giant chocolate chunks, not chips. The man knew what he was doing. We were even treated to absolute one morning! He had the perfect combination of lecture and class discussion. I was always excited about class, because he made it obvious that he really cared about the readings and I wanted to share that excitement with him. He was always interested in our thoughts on the way he was teaching, which allowed us to get more from the readings. He had us very well-prepared for the exams and was always a very fair grader. I'm sad he found work elsewhere as I would have hounded the core office until he became my CC professor. Cheers, Todd!\nWorkload:\nTwo 6-8 papers per semester. Mid term and final first semester, then just a final second semester. The man knew how to avoid bullshit. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 13, 2012",
            "review_content": "\nTodd is an extremely friendly and approachable professor. The classroom discussion ran surprisingly well despite the fact that the class was at 9 a.m., and he made interesting and relevant points that encouraged conversation. He was willing to acknowledge when texts are uninspiring or lacked deep meaning, and tell you which parts of the reading to do carefully. Papers and midterms were graded on a very reasonable curve with the majority of the class in the B+/A- range and no one (to my knowledge) got below a B-. I'd strongly recommend Todd as a professor. I did learn a lot in his class, and he tried not to make it unnecessarily stressful. \nWorkload:\nVery reasonable. Short response question due every class, but not graded. One two paper paper, one 5 page paper, one 6-8 page paper which could be replaced with an oral examination on the same prompts given for the paper. One midterm and of course a final.\n"
        }
    ]
}