{
    "prof_info": [
        {
            "prof_name": "Peter Read",
            "prof_id": 200,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Criminology",
            "review_date": "August 29, 2007",
            "review_content": "\nI thouroughly enjoyed this class!!! Professor Read is laid-back with a sense of humor.  He does not try to over complicate the theories and other concepts covered in the course.  The reading seemed like a lot, but he tests you on the major concepts, nothing picky.  The mid-term paper  is on a book of your choice and allows you to pick an area of interest. Very fair professor.  Some days the lectures seem dry, but he really is a good guy and I highly recommend his class.\nWorkload:\nMid-term and final based on notes and major points from class. One 10page paper, topic of your choice. Very fair grader.\n"
        },
        {
            "course_name": "Criminology",
            "review_date": "May 15, 2007",
            "review_content": "\nQuite possibly the worst class I've taken at Columbia with the exception of Frontiers. Everything about this class was unclear and ridiculous. This man is utterly unprofessional. He has 8:30am office hours once a week and takes forever to return emails and phone calls. He gives ridiculous exams based on your ability to recall (i.e. memorize a huge mass of information) rather than actually applying theories. He doesn't return midterms which consisted of 105 multiple choice, true/false, and fill-in questions. The midterm was so difficult that he had to make a curve and even then a lot of people still did poorly. On top of that, our midterms had soda stains on them from when Read graded the exams...how disguisting! Oh and the TA is an incompetent nervous wreck. I would say to avoid this course at all costs! \nWorkload:\n5-6 books (that will cost you close to $160). Midterm, 10 page paper applying theories to a criminal's life or a criminal justice issue, final. He's a very unfair grader. \n"
        },
        {
            "course_name": "Criminology",
            "review_date": "December 16, 2005",
            "review_content": "\n The course isn't very challenging..... Read is a nice guy and an easy grader.... The course may not thrill you... but it won't stress you out either.  Some of the material was a bit dated.  I think the course would be fine for a first year... but anyone else may be bored....\nWorkload:\nReadings....a few papers....pretty light\n"
        },
        {
            "course_name": "Criminology Summer 2002",
            "review_date": "August 10, 2003",
            "review_content": "\nProfessor Read is an extremely nice man and wonderfully involved professor. He treats his students with respect and looks forward to class discusions where students will debate. We had a small class..maybe 14 people and he said he wished he could keep us for the semester. It was very personal and interesting. I will admit the discussions and readings did not go as deep as I expected. Afterall it was a summer course. Overall he is a wonderful professor, extremely detailed, gives good lectures - precise-clear-clean cut, if you read and take notes you can't go wrong in this class. Be aware that he likes DETAIL in everything.\nWorkload:\nIn class 10 presentatrion about some criminal act in the news, midterm and final where both take home essay. Final was on Changing Lanes - applying theories learned.\n"
        },
        {
            "course_name": "Deviance and Social control",
            "review_date": "October 29, 2002",
            "review_content": "\nI agree wholeheartedly with the negative reviews. Pop psychology approach, extremely shallow and simple discussions, absolutely no serious theoretical discussion or anything else that might make you think somewhat critically... Seems to be a nice man, but answers any insightful and interesting question with, \"Well, thats really very complicated\". Period. Isnt the complicated stuff the reason we're here?\nWorkload:\nLight textbook and some generalized 'case studies'. One paper, confusing midterm & final. Nitpicky usually means a teacher wants you to know many, many important details. What THESE tests were looking for is beyond me. \n"
        },
        {
            "course_name": "W3221 Deviance and Social Control",
            "review_date": "September 09, 2002",
            "review_content": "\nThis is Sesame Street sociology... you'd learn more watching Dr. Phil on Oprah. The man forces you to memorize the tiniest details of pop psychology theories -- worst of all, he assigned _Who Moved My Cheese?_, a horrid condescending book which was basically written to make workers accept getting laid off. That alone should get him banned for life from this campus. This is a poor excuse for social theory. You want to explore the history and motives of prejudice? You want to talk about whose interests are served by isolating and scapegoating particular \"deviant\" groups? Well keep looking, cause you won't find that here.\nWorkload:\nthe reading is easy but obnoxious. tests are basically ditto sheets.. fill in the blanks. be ready to memorize lots and lots of terms.\n"
        },
        {
            "course_name": "Criminology",
            "review_date": "May 27, 2002",
            "review_content": "\nThis class was possibly the most disappointing class I've taken at Columbia. While Prof. Read is undoubtedly a very nice guy and tries to make lectures interesting, I walked away from the class learning nothing. Lectures lacked substance and gave bare-bones outlines of theories and theorists. Read seemed to only cover the theories he liked and left the others to be learned on your own in readings. The midterm and final were also huge jokes. The midterm tested nothing regarding criminology and consisted of a miscellaneous mix of T/F, multiple choice, and fill in the blank questions on nitpicky statistics and random keywords. The final was a three page paper on the movie \"Changing Lanes.\" The only assignment that had any merit was the 10-page paper applying theories to real-life cases. If you're really interested in the subject and hope to learn more, this class won't help you. Stay in bed and catch an extra hour of sleep instead. but if you just need another class to fill your schedule and want a funny laidback prof, maybe this is the right class.\n"
        },
        {
            "course_name": "W3222 Criminology",
            "review_date": "July 07, 2001",
            "review_content": "\nI love Peter Read! Fantastic lecturer, one of the best I've had. He manages to be opinionated and respectful of students' opinions at the same time. You don't need to go to class to do well in the course, but I actually wanted to go... Be forewarned, his tests are pretty nitpicky, but if you're good at multiple-choice, matching, and fill-in-the-blank exams that require some memorization, you'll do fine. My class gave him a rousing ovation on the last day of class. He deserved it absolutely. How many professors have you had that you would clap for?\nWorkload:\nMidterm, final (non-cumulative), one 10-page paper.\n"
        },
        {
            "course_name": "W3221 Deviance and Social Control; W3222 Criminology",
            "review_date": "December 31, 1999",
            "review_content": "\nEasy, fun and interesting. Read moonlights as a therapist, so he tells lots of entertaining stories about his patients. Workload is light, but you do have to read what is assigned because test questions are very specific. Generous grader.\n"
        },
        {
            "course_name": "W3222 Criminology",
            "review_date": "December 31, 1999",
            "review_content": "\nI tend to disagree with the other reviews of Professor Read. The workload is generally light and the paper topic is a little restrictive. However, expect the tests to be extremely nitpicky to the level of a high school history class where you have to memorize every little fact and term in the textbook. This is a pretty large class so don't expect thorough discussions.\n"
        }
    ]
}