{
    "prof_info": [
        {
            "prof_name": "Gerardo Hernandez-Del-Valle",
            "prof_id": 1973,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Stochastic Processes: Applications I",
            "review_date": "May 17, 2011",
            "review_content": "\nProfessor Gerardo is a very organized teacher and knows in advance what and how he is going to cover in each day's lecture.  I thought his style of teaching was very satisfying as a student seeking structure and clarity.  However, I did sometimes find that he would be driven too much by his lesson plans and thus proceed in a much faster pace than the students' ability to understand his material.  To be fair, he did stop every now and then to explain and clarify certain areas, but I remember many instances where he just seemed to speed through materials.  Also, as we got to the later part of the semester, what we were being taught in class, and what was being given as homework were diverging in a very obvious and annoying way.  We were able to finish the homeworks through TA sessions and office hours, but expect to study many many hours using multiple texts.\n\nOverall, I have to say that his class was a very good one.  I thoroughly enjoyed his easy going and friendly temperament, and the entire class experience was that of learning from your \"older sibling\" if you will.  Very informal, yet effective and interactive.  \nA caveat to this review should be to note that our particular class happened to be small (15 students) with all of us being \"serious\" students.  So in many ways the class experience was unique and enjoyable in ways that a larger class could not emulate.  \nAs for the exams, we had practice exams for the midterm and final which were much easier than the actual tests.\n\nWorkload:\n7-8 HWs, 1 midterm, 1 final.\n"
        },
        {
            "course_name": "Statistical Inference",
            "review_date": "September 08, 2009",
            "review_content": "\nProfessor Hernandez is a really nice professor.  He truly cares whether you understand the material or not.  He tries to make the classes interactive.  If you tell him that he's going too fast, he will slow down.  He listens to his students' needs.  Yes, he is a little disorganized sometimes but that doesn't affect his teaching ability.  If you don't understand something, he'll try his best to help you understand.\nWhat is said about his accent is ridiculous.  While he has an accent, he's fluent and his accent is mild.  \nI would highly recommend that anyone take this class with him.  I'm taking another class with him next semester.  \nWorkload:\nWeekly homeworks, midterm, final.  All very reasonable.  Homeworks may have a couple of very hard questions but if it's too hard he does it in class even.  Otherwise, office hours and TA office hours are enough.  Midterm and final are like the medium difficulty homeworks.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 29, 2007",
            "review_content": "\nBetter then average professor. He makes sure the students understand all the examples covered in class. Very straightforward while answering questions and will spend a good amount of time during office hours to make sure the concepts are fully understood.  Take his class if you want to get a general idea of the concepts without diving into hard derivations of the formulas etc. He makes it a point on his exams to not have any complicated computations. Tries to ensure everyone has a good chance to get an A. \nWorkload:\nStandard intro math/stats load. 2 exams (fairly simple) and weekly homework assignments (about 2 hours long)\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "May 06, 2007",
            "review_content": "\nThis is the worst class I have ever taken in my entire life. The professor is completely inept and does not speak English. The homework has absolutely nothing to do with the lectures, and her lectures were filled with mistakes (both gramatically and mathematically). I cannot stress this enough-- do not take this class as an easy way to fulfill the math requirement-- you will get screwed over. Basically this course is designed to confuse and irritate. \nWorkload:\nSignificant. Homework in the textbook doesn't relate to midterm or final and the textbook itself is irrelevant. \n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "January 18, 2007",
            "review_content": "\nThis class was adequate. Not bad, not great. Gerardo spent a lot of time at the beginning of the semester going over very basic stuff at length -- really, did anyone need the 30-minute review of PIE CHARTS??? His explanations of more complex topics could be a little confusing, but he was always willing to answer questions at any time. This was both good and bad, because there was an incredibly annoying girl in the front row who asked a lot of inane or irrelevant questions. I have sympathy for those who don't pick up material as fast as the rest of the class, but Gerardo would have better served the 79 other students if he'd asked her to see him after class instead of monopolizing class time. Tests and quizzes were pretty easy -- two pages of notes, sometimes open book, no trick questions. Problem sets weren't too bad, although sometimes he would assign stuff he hadn't really covered in class. My biggest annoyance: at the beginning of the semester he told us we would need graphing calculators. This was not true; unless he's changed the curriculum, save your money.\nWorkload:\nFairly light. I hadn't taken a math class in ten years, but I didn't find anything too hard.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "September 16, 2006",
            "review_content": "\nThis class was relatively easy.  Straightforward problems sets and you can use cheat sheets on the midterm and final.  I would highly recommend reading the book before lecture otherwise his lectures can be difficult to follow.  Also, even though Calc 2 is the only math prerequisite for the class, you will be doing Calc that is not presented in Calc 1 or 2 (double integrals) and not only will he expected you to know it, he won't understand why you don't.  I would recommend this class if you are taking it by itself and not as a prerequisite for anything, particularly if you are need it for Econometrics.  Since he allows cheat sheets and teaches in an all-together confusing fashion you will come away with an A but not really knowing much, which hurt you greatly when it comes to Econometrics.\nWorkload:\nNot too bad.About one problem set per week.You can use a cheat sheet on the midterm and final.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 19, 2006",
            "review_content": "\nNice guy, but I had no idea what was going on in the lectures.  I and all of the people I know learned everything from the book after class and doing the homework.  I don't know what he could really do differently, but nobody wanted to stop and say \"what are you doing?\" because we were all beyond the point of having a clue what he was even discussing that day.  A few people seemed to know what was going on though.  The TA was available for help, but Gerardo's assistance out of class varried.  Many people are terrified that we're going to die in Econometrics because we have no idea what the hell we just covered in this class.  Nice guy, but I would take the course with someone else if you're really interested/need to know the material in the course.  People looking for an easy grade would do well to pick him though.\nWorkload:\n8 homework assignments (35%), easy mid-term (with a 2-page cheat sheet 30%), and hard final (with a 2-page cheat sheat 35%)\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 15, 2006",
            "review_content": "\nI thought Gerardo was very good in this class.  He speaks good English, gives clear lectures, and is highly available on office hours to answer questions.  The textbook for this class was a real negative since some of the problem set questions from it were poorly worded, but I thought he did a good job of resolving those difficulties.  Best of all, on exams he allows you to have two double-sided sheets of notes!  I would highly recommend Gerardo to anyone needing or wanting to take Intro Stat (B).\nWorkload:\nNot bad...8 problem sets, midterm and final (all about one-third of the grade each).  Problem set questions were sometimes confusing but this was the book's fault, not the professor's.  Midterm and final are not hard and made even easier by having the note sheets.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 12, 2006",
            "review_content": "\nProf. Hernandez was very knowledgeable in his subject, willing to make himself available during office hours to discuss material, and was honestly an all-around good guy.  Homework was paced very fairly, exams were more than fair and actually quite easy.\nHowever, two issues.  His lectures are not very good.  I'm a fairly good math student, and I've taken stats before, yet I was often lost.  He explains much of stats by way of doing the math behind it, which lost me and didn't help me solve the problems.  After the midterm, a good third of the class stopped going to his lectures; I often had people who recognized me from class come up and ask me if I knew what was going on (I told them no, I didn't either).\nAlso, he's disorganized when it comes to course management.  Homework was assigned in a very haphazard manner, and some of the study materials he promised us for the final were posted late or not at all.\nAlthough he is a good guy, if you can take this course with someone else, I'd recommend doing so.\nWorkload:\nReasonable, homework problems from the book due every 10 days or so, 1 midterm, 1 final.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 06, 2006",
            "review_content": "\nGerardo is really nice and understanding. He moves relatively quickly but you learn a lot in the class. He's a really fair grader as well. \nWorkload:\nWeekly problem sets, midterm, final, group project\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "July 27, 2005",
            "review_content": "\n     Prof. Hernandez, as a person, is remarkably approachable and friendly (but don't expect him to shoot the breeze with you--he keeps the relationship very student-teacher-esque).  I have yet to see him turn down a student that needs help, from a simple question to a problem that might take longer to complete.  He posts reasonable office hours (about 2x a week), and will usually stay longer to answer every students questions--although at times few people, if anyone, comes to his office hours.       As an Instructor, Prof. Hernandez teaches Intro to Statistical Reasoning in the same fashion--approachable and friendly.  He thoroughly teaches basic concepts, and welcomes questions from students at all times of his lecture (which can be a double-edged sword--if you are a vocal student, this is the class   for you.  If you are annoyed by the same 5 people who keep raising their hands...you should take this class anyway).  He will not hesitate to explain homework problems that people have trouble with in class.  During finals, he is more than willing to schedule a review session that he personally heads, not a TA.\n       In general, the people who take this class do not have a great interest in statistics or mathematics, and Prof. Hernandez can see that, but nonetheless he approaches teaching as thought the opposite were true.  He is somewhat by-the-book, but at times will include an interesting statistical anecdote or two.\nWorkload:\nWeekly problem sets that are graded by the TA (who is an obscure presence at best); two midterms (open book! open notes!), final (open book! open notes!); a final project which can be about anything , really, as long as it has some statistical association.\n"
        },
        {
            "course_name": "Introduction to Statistical Reasoning",
            "review_date": "April 17, 2005",
            "review_content": "\nIt seems like the policy of Gerardo's Stats class is to make the class as non-mathematical as possible.  That being said, yes, there was a lot of math (for a non-math person), but he actually made it doable.  His lectures are clear and understandable, he greatly encourages questions/suggestions and is always more than willing to help no matter how simple the concept.  For a non-math person, it was a great class.  Also, if you are having problems turning things in on time, just go and talk to him and he's quite understanding.  Almost no one went to his office hours, so going and even just chatting with him is a great idea.  Overall, very nice guy and really tries to help everyone in the class understand the material.  He's also quite enthusiastic about statistics and applying to the real world, and that makes all the difference.\nWorkload:\nweekly homework (doable), 2 midterms (both open-notes and open-book, unfortunately not open-classmates), project w/ 2 other classmates (10% of grade), and final (open-note/open-book also).  just do the homework (unlike i did) and you'll be more than fine.  otherwise, you're cramming to get everything in order and don't finish the tests on time, resulting in a bad grade\n"
        },
        {
            "course_name": "S1111Q - Intro - Summer 2003",
            "review_date": "January 21, 2004",
            "review_content": "\nGerardo is a solid and straight-forward instructor.  I had never taken stats before and left his class with a general understanding of the basic principles and, to my surprise, an interest in further study - exactly what you'd want from an intro class.  It was a summer course so everything was pretty compressed but as long as you went to class and did the homework it was fine.  I don't imagine you could do any better, it's not terribly exciting but at least it's clear and well-presented.\n\nWorkload:\nHomework assignments every week, a few quizzes, midterm and final.  \n"
        }
    ]
}