{
    "prof_info": [
        {
            "prof_name": "Eric Anderson",
            "prof_id": 1905,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 23, 2007",
            "review_content": "\nEric is a really good teacher.  He spends a good amount of time on each unit so you really get a good overview of art and architecture.  Things are explained clearly and he encourages a great deal of discussion which I think made the class less boring.  As other reviewers mentioned, he does grade the papers quite tough but I feel in the end most people end up doing well in the course and I definitely left the course with a much greater appreciation of art.\nWorkload:\n3 short (2-3 page) papers analyzing a specific work of architecture, sculpture, and painting.  Standard midterm but the essay portion of our final was given as a 5-7 page take-home paper (our actual \"final\" was only 15 minutes of IDs).  Very little reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 12, 2006",
            "review_content": "\nEric Anderson does a great job of teaching art hum. He can be a harsh grader, but he is really fair. He motivates each student to take the class seriously and really apply themselves. I saw a significant improvement throughout the course in my art history writing based on his input and feedback, but it did take more work than I thought the class would. The ID's on the midterm were pretty easy as long as you memorize anything you've seen in the class. The midterm also had three twenty minute comparative essays which were not easy, but if you apply the concepts learned in class you can do fine. Instead of giving a final and fourth paper (as per the syllabus), Eric gave a final project because he felt the class did pretty well on the midterm. This is just an example of Eric's dynamic and flexible approach to the class. If you're looking for an art hum class that challenges you and engages your writing skills, Eric is the prof for you. \nWorkload:\nThree 3-page papers, 1 midterm, 1 final project. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 18, 2004",
            "review_content": "\nEric Anderson makes Art Hum completely painless. You get a good overview, you don't have to do any of the reading, and the papers are graded fairly easily. If you're really interested in art history, you probably shouldn't take this class with Anderson. The classes are not incredibly exciting or informative. But, if you're just looking to get the requirement out of the way, Anderson is the guy for you! He's also REALLY nice. The only annoying thing is that the students speak in class more than he does. \nWorkload:\nlots of 3 page papers and an easy midterm/final. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 29, 2003",
            "review_content": "\nEric is a really nice guy who likes to take his students on field trips to the Met and buys them lunch with the core office money. He also gives a pretty good introduction to art, sculpture, and architecture, which is really the point of art hum. However, if you're looking for an easy A, this is not it. The midterm and final required a lot of memorization (including dates to the nearest 10 years) and as far as I know, there was no curve at all. Also, the papers are graded very harshly: giving an overview of simple observations is not enough for him; he expects you to go above and beyond what you see to describe the painting or sculpture in formal terminology (which I felt was a bit too much for an intro level art class). Overall, a nice young grad student, but not as kind with the grading as he looks. In addition, participation is important, helps your grade, and generally makes you appreciate the works much more, so do yourself a favor and come up with some remarks or comments, even if they seem overly simple or stupid.\nWorkload:\nMidterm, cumulative final, both of which have 90 second ID's and longer 10-20 minute comparative essays. As mentioned before, papers based on nearby architecture and visits to the Met, Whitney, or Guggenheim which are graded tough; you must do four 3 page papers, the first of which is ungraded. Also, reading that is completely  unnecessary (unless you simply have plenty of time and interest in reading background information and primary source-type stuff from the Reader). \n"
        }
    ]
}