{
    "prof_info": [
        {
            "prof_name": "Jessica Goldstein",
            "prof_id": 2296,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Intro Lab to Organismal and Evolutionary Biology",
            "review_date": "May 06, 2012",
            "review_content": "\nWhen I was first looking at classes I read the below reviews, and was freaking out about taking Dr. Goldstein's class.  Thank goodness they were all flat out wrong.  I was with her for the Biology Journal Club as well as both lab sections, and I can't explain how nice she was.  People think lab was so easy because the material is stupidly simple, but in reality, it was because Dr. Goldstein made everything so abundantly clear that we could grasp what would otherwise be more complex material.  She was wonderful at helping us understand the nuances, and really understanding the material.  That being said, I missed on lecture for some reason and found the material quite difficult to learn on my own.  I wished I had been in lecture that day.  That being said, she doesn't yell at you if you leave in the middle of lab.  At the review session at the end of the year she specifically told us to leave if we wanted or had other work to do.\nThe lab is easy because she is efficient in teaching, and though the labs themselves were tedious or a bit boring and simplistic, just be thankful they seem that way.  Things could be much worse.  \nWorkload:\nNot at all bad.  Random quizzes that are easy to ace (if you go to recitation), a midterm, and two lab reports.\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "April 12, 2009",
            "review_content": "\nNot only is this recitation pointless since we learn the same material in lab right before we do the actual lab, the entire bio lab is a joke. People wonder if they can take bio as their second or even third lab and the answer is yes. This curriculum is really an insult to our intelligence and they baby you so much that lab is essentially easier than any high school lab I ever took. That said, if you are not a science person this is the lab for you. It is interesting enough, despite the repetition, and it is ridiculously easy. You do have to put some effort into it, especially for the midterm and final, but overall it's a really pointless lab. More specifically about Goldstein, she means well but she is really annoying. First of all she takes her class, and herself, way too seriously considering the class is such a joke. Second of all, she yells at the entire class if you leave in the middle of recitation, even though recitation is a clear waste of your time. Either go or don't. Don't leave in the middle, it just creates drama. I'd actually recommend going, bring other work though, just because then you don't have to study before each class since there's a short quiz at the beginning of each class. Goldstein is not a bad teacher, she just teaches boring material that's either way too easy or involves bigger concepts we don't know yet. And her voice is really annoying. Overall if the labs were better her recitation wouldn't be that bad.\nWorkload:\nRandom quizzes (grade doesn't matter) in recitation for attendance, quizzes every week in lab (out of 5 points), minor lab reports generally every week and two big formal lab reports per semester, a midterm (not that hard if you know your stuff), and a final (which I haven't taken yet)\n"
        },
        {
            "course_name": "Intro Lab to Organismal and Evolutionary Biology",
            "review_date": "December 19, 2008",
            "review_content": "\nRecitation is boring, and generally unhelpful, but you should attend for participation points (on random classes, she will ask you to answer some question from the packet and hand in the page so she can count up who attends). Lab is an easy course, and depending on who you have, you will get out about an hour early (I would suggest Rafalski if you can get her). The quizzes are easy as long as you review the info a bit before taking it, and the worksheets are also not graded very hard. Most labs are pointless, tedious, and boring, and have nothing to do with Hertz's class. Lab reports are graded much harder, and you will get marked down for pointless things. That being said, the midterm and final are pretty fair, and the class is generally a breeze. Goldstein is nice enough, and the instructors are pretty accommodating. \nWorkload:\nAttend recitation, quizzes before each lab, worksheets, a practical midterm, a cumulative final, and one lab trip to the Museum of Natural History.\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "September 06, 2008",
            "review_content": "\nWell, where to start...? So, first semester she seemed fine except for her high-pitched, whiny  voice that was painful to listen to...I would have advised you to not attend recitation saying it was a waste of time, UNTIL...second semester, people begin to get up in the middle of her lecture to leave for various reasons in which she screams at them about that this is a requirement. Like they already did not know. We are not children, they make their own decisions when leaving class early. Then came the vicious emails stating that she was implementing quizzies and certain things to get our attendance records. Most people still did not care. But in the end she knew what she was doing, a lot of people took a hit especially when at a cusp of a higher letter grade.\nGo to recitation, do other homework, go on facebook, apply for research and internship positions that matter more than her teaching ever will, sleep through it, and get your little brownie points. You will thank yourself in the end.   \nWorkload:\nshow up for her stupid recitation, the lab is the only important thing. \n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "September 06, 2008",
            "review_content": "\nWell, where to start...? So, first semester she seemed fine except for her high-pitched, whiny  voice that was painful to listen to...I would have advised you to not attend recitation saying it was a waste of time, UNTIL...second semester, people begin to get up in the middle of her lecture to leave for various reasons in which she screams at them about that this is a requirement. Like they already did not know. We are not children, they make their own decisions when leaving class early. Then came the vicious emails stating that she was implementing quizzies and certain things to get our attendance records. Most people still did not care. But in the end she knew what she was doing, a lot of people took a hit especially when at a cusp of a higher letter grade.\nGo to recitation, do other homework, go on facebook, apply for research and internship positions that matter more than her teaching ever will, sleep through it, and get your little brownie points. You will thank yourself in the end.   \nWorkload:\nshow up for her stupid recitation, the lab is the only important thing. \n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "August 09, 2007",
            "review_content": "\nThis class is a joke.  The recitations are worthless, and Goldstein couldn't keep a fly awake during her lectures.  The lab manual is a work of art, the instructions are totally clear and amazing.  Skip the recitation, ignore your lab instructor, but sleep with the lab manuals under your pillow.  They'll get you through.\nWorkload:\nok\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "July 15, 2006",
            "review_content": "\nI didn't actually have Jessica for my lab instructor, but she always gave the recitation to go over what would happen in lab that week. She's very enthusiastic and clearly quite intelligent. In fact, she would correct Professor Wallenfang, who taught the Molecular and Cellular Biology course associated with the lab, in almost every class on some matter or another. She's very clear about her expectations and the lab exams were straightforward and fair.\nWorkload:\nA handwritten outline every week for lab based on a lab manual and recitation notes. A midterm and a final (cumulative).\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "May 06, 2006",
            "review_content": "\nIf you are taking the 2000level bio lab...don't even bother going to recitations. You'll soon figure out why...the first day she started out by saying \"This week in lab you will compare different organisms. Uhhh, what does compare mean?\" WHAT.\nTo make it fair the workload isn't that bad, especially in the fall. Spring semester can be a bit of a pain just because there's a few full length lab reports required, but very comprehesive and thorough guidelines are given out (a bit too comprehensive it seems at times) so just make sure to follow directions carefully and you'll probably get full credit or close to full credit on every assignment. \nI don't exactly hate this professor. She surely seems to care about her students and is genuinely engaged in the material she's teaching. However her lecture style needs VAST improvement. She's the only one I know who can make 50 minutes seem longer than those 2 hour lectures.\nSo go ahead and take the 2000level bio with no fear...just save yourself time and sleep and don't go to recitation.\nWorkload:\napproximately 1 assignment a week, few full-length lab reports, 1 midterm, 1 non-cumulative final. attendance at lab required, attendance at recitation...dont do it.\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "May 05, 2006",
            "review_content": "\nJessica Goldstein is a friendly, knowledgable professor who is interested in the material and student questions.  Yes, lab recitation can be a pointless and uninteresting class but she makes it easy with handouts and detailed explinations.\nWorkload:\nMultiple choice/ short-answer midterm and final (for BC2003, the midterm is lab based with only a minute per question, but it is not hard)\n"
        },
        {
            "course_name": "Biological Experimentation Lab",
            "review_date": "February 21, 2006",
            "review_content": "\nDr. Goldstein rocks. Some people pick on her word pronunciation, but cut her some slack because she's got a PhD in developmental genetics or something equally impressive. She's also one of the only teachers that's ON YOUR SIDE. She's also a big part of the intro bio lab (i.e. GRADING and test-y stuff), she teaches a few lab sections each semester and best of all, she's a person who can actually TEACH! she's not that old either, so she's totally chilled out and reasonable. That being said, she does give a pretty comprehesive final, albeit straighforward and fair. Go for the Gold(stein), hehe. \n"
        },
        {
            "course_name": "Revolutionary Concepts in Biology (Lab)",
            "review_date": "April 21, 2005",
            "review_content": "\n\nWorkload:\nThe textbook is Anatomy and Physiology for Dummies.  FOR DUMMIES?  \nI am ashamed that the Bio department allows this non-textbook to be \nused.\n"
        },
        {
            "course_name": "Cells and Tissues: Cell Biology",
            "review_date": "December 24, 2004",
            "review_content": "\nDefinitely take a class with Goldstein while she's still here. She's very young and innovative and engaging in the way she teaches. What she says will stick and you have to do very little studying outside of lecture. Reading the text is a pleasure because she chooses wisely but not necessary at all for retaining what she's taught. She also does journal club reviews which, although a pain in the ass sometimes,  make you feel very connected to the scientific process. This was the first class I've taken that I've actually felt like a biologist and not just a stupid undergrad puddling my way through scientific jargon. She's leaving at the end of this year, so definitely definitely take a class with her in the spring if you can. \nWorkload:\n2 midterms, journal club article reviews about once every two weeks, one group presentation on a journal article, a technique paper that's 3 pages long and a final, (sounds like a lot but is very manageable).\n"
        },
        {
            "course_name": "Cell Biology",
            "review_date": "December 22, 2004",
            "review_content": "\nProfessor Goldstein is an awesome professor.  Her lectures were clear cut, and to the point.  It really simplified the heavy readings in our very heavy textbook.  Her way of teaching differed from many of the previous professors I had.  She teaches through powerpoint and gives you handouts of the slides before she presents.  The blurbs are written on the powerpoint, so basically throughout class you are just trying to copy everything down as quickly as possible.  Sometimes I wish she would just have the blurbs printed out onto the pages she gives us, then I can spend more time to listen to what she has to say and not be distracted by the words on the screen.  Her exams consist of 10-12 easy multiple choice and 10 short answer questions.  The short answers always stumped me, because it does require you to really think out your answer and provide sufficent support for it.  If you study her powerpoints closely it should be no problem.  She is super nice and is always available during her officehours or she can set up an appointment with you.  Considering this is her first time teaching, I think she did an excellent job.  I highly recommend her and I wish she could stay with the Barnard bio department.  Note this is all said before receiving final grades.  I just didn't want to be bias if I saw an A or a C.\nWorkload:\nFair to heavy.  Every two weeks there is a journal article to read from pubmed along with a worksheet to complete. Presentation of one of the articles are done by students in groups.  The grades are separate from the other memebers of your group.   There are two exams and one final.  All worth approximately the same, around 20% of your grade.\n"
        }
    ]
}