{
    "prof_info": [
        {
            "prof_name": "Monica de la Torre",
            "prof_id": 1120,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Spanish 1202",
            "review_date": "April 21, 2006",
            "review_content": "\nSo, I really love Monica as a person.  She is liberal, open-minded, vibrant, interesting, funny.  That's great.  Her Spanish is also very easy to understand.  She was very ontop of things at the beginning of the semester and then things slid.  We would have a paper due, a quiz, and a book to read -- all for the same class day.  Then some days, there would be no work.  So, I am struggling in the class.  She really means best, but I think in terms of preparing you well for the important tests like the midterm and final which are departmental, this may not be the best idea.  If you're taking Spanish to get it over with, she's pretty good.  If you really want to ENJOY getting spanish over with -- if you're taking it not only to fulfill the requirement but because you care -- this is really NOT the way to go.  I used to love Spanish, and now find it exhaustive and do not look forward to class.  \nWorkload:\nShe does this is bursts.  No homework for 2 weeks, then all the sudden a quiz every week and 2 papers, and then another lull, and then the midterm and a paper.  It is very sporatic and if the bursts coincide with other big test for you -- it's total hell.\n"
        },
        {
            "course_name": "Grammar and Composition I",
            "review_date": "February 09, 2006",
            "review_content": "\nMonica is probably my favorite instructor out of all the ones I have had at Columbia. Classes are well-organized and the syllabus clearly laid out everything for the semester. She has a beautiful voice and accent and I loved going to class just to listen to her speak. Monica would always answer all of the questions we had, even if they were really difficult or specific or... well, even if they were really stupid. Everyone in the class loved her. She is very easy to talk to and she will make sure that you do well in the class as long as you bring up any issues you may have. I definitely recommend taking a class with her if you can! \nWorkload:\nweekly compositions on various topics, sometimes twice a week. also exercises from the workbook that would be corrected in class (not collected)\n"
        },
        {
            "course_name": "Spanish for Spanish-Speaking Students",
            "review_date": "August 25, 2005",
            "review_content": "\nThis lady is amazing!!!! Very cool woman who is interested in teaching what people need to learn.  Ask and you shall receive.  I am not a native spanish speaker but am fluent.  This course helped me learn alot of things that I never knew before - lots of technical stuff that should be boring except for some reason it wasn't.  Don't take this class if you aren't reasonably fluent, alot of kids dropped it when they realized that.  \nWorkload:\npretty light.  we had alot of exercises and two presentations - nothing time consuming though.  Midterm and final were very reasonable.\n"
        },
        {
            "course_name": "Spanish 1201",
            "review_date": "December 16, 2004",
            "review_content": "\nMonica is a great teacher. She is always energetic and willing to help with any questions you have. I definitely reccomend taking a class with her. \nWorkload:\n4 Compositions, worksheets, midterm, final \n"
        },
        {
            "course_name": "Advanced Grammar and Composition",
            "review_date": "January 07, 2004",
            "review_content": "\nMonica is great.  She is very energetic in class and always lets the students have fun.  She jokes around with us and relates well to the class because she's young.  Every day, we would usually work from the book, going over grammar, and do some handouts all together.  If she couldn't answer a question, she would go home and figure out the answer and let you know next class.  She is active in the hispanic academic world in nyc and let come with her to nyu to a poetry reading that she worked on with a famous poetry translator.  Grading was consistent, though the ability level from student to student varied greatly, meaning grades did too.  She is negotiable on deadlines and stuff like that.  She calls on you in class to answer worksheet questions but doesn't mind if you get them wrong.  Overall, she's very nice and cool; I recommend this class.   \nWorkload:\nEXTREMELY REASONABLE.  We had weekly or biweekly 1.5page compositions on various (easy) topics.  She definitely rewards you grade-wise if you put time and creativity into your comps.  Quick worksheets just about every class.  4 big tests, which she will say are \"nothing to worry about\", but you need to study a good deal to get an A.  No midterm, and the 4th big test was our final.    \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "May 17, 2002",
            "review_content": "\nShe's a great person, enthusiastic,helpful.. gives good handouts. easy-ish tests- if i actually knew spanish i would have gotten an easy A. not too much hwk at all, mostly stuff you can do in the 30 mins before class, during lunch.\nWorkload:\nmidterm, final, a few composicions that are abt 200 words in spanish each, some annoying little worksheets that turn out to be xtra credit if u do them, cuz nobody does!\n"
        }
    ]
}