{
    "prof_info": [
        {
            "prof_name": "Asher Hecht",
            "prof_id": 11202,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "November 14, 2011",
            "review_content": "\nProfessor Arkonac is a friendly, regal lady who is certainly not the worst option you could pick for your Intermediate Macroeconomics class. I thought her lectures in general were quite useful as she does lots of drawings on the board and calculates examples. The lectures slides were always uploaded to courseworks though she doesn't use them at all; basically she puts up the first slide, then talks for half an hours using only the black board and then just skips past the next 5 slides, the contents of which she already explained on the board.\nIn this course I thought that it seemed quite important to actually attend the lecture, and most people did. It's very helpful because the questions on Homework and exams are usually similar to the ones she goes over in lecture, and some of them are examples that you won't find in the textbook, so you'll have a hard time figuring them out on your own. If you do go to lectures and pay attention however, then few work outside the classroom will be required. I thought this class was definitely quite quantitative, with no discussion or deliberation of the effects of the economic concepts we discussed; instead we mostly just went through examples with numbers. I'm not sure if this is any different in the other sections of this class though.\nOverall, I'd recommend you take this class with Professor Arkonac. It's a very relaxed section to take because paying attention in lecture is quite easy, as she makes the material quite interesting and occasionally shows off her cute sense of humour. My one quip with the class is that she somewhat frequently gets tangled up in her own calculations and does mistakes, which then take her a while to correct. \nWorkload:\nWeekly problem sets with 6-8 questions; take a bit of time but not incredibly difficult (usually about 3 or 4 hours of work). Cheating (that is, working in groups) is explicitly allowed.\nOne decent midterm which you'll be able to finish in time (our mean was ~75). She posts a practice midterm with solutions of about the same difficulty as the real thing.\nSame goes for the final. \n\n"
        }
    ]
}