{
    "prof_info": [
        {
            "prof_name": "Janna Levin",
            "prof_id": 2225,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Electricity & Magnetism",
            "review_date": "August 26, 2014",
            "review_content": "\nWoah. \nThis professor is what college is all about. She absolutely dominates lectures -- by far the best lecturer I've ever had. If you want a taste of her lecture style, you can check out her various Ted talks or interviews with NPR or Radiolab because she's ~*famous*~. If you watch these, however, be warned that there is a very large possibility of exhibiting fan girl syndrome. \nNot only is she a powerful presence, but she also puts things in context, uses examples, starts from scratch, answers questions, interacts, makes jokes... One way to convey her teaching style is her disdain for memorization -- if you're work is grounded in reason, there is no need to memorize equations. You will be able to derive them all from scratch. You will fall in love with Physics just as quickly as you fall in love with her. \nIt doesn't stop at her lectures -- she goes above and beyond to make Physics not only an area of study, but an ardent passion of her students. For the first ten minutes of every class, she lets students ask any question about the universe... ANYTHING AT ALL!! AND SHE ANSWERS IT!!! Her specialty is theoretical physics, and these conversations get so mind-blowing and philosophical, you will want to march straight to the registrar and change your major to this beautiful subject. These little sessions are what taught me that Physics is the language of the entire universe, which is sometimes hard to see when you're poring over tedious problem sets... they served as quick introductions to topics such as quantum physics, black holes (her specialty), space time, inflation theory and the multiverse... the list goes on.\nDespite all the wonderful things I have said, this is what I appreciated most about Professor Levin: after each class, she held office hours which you could go to and stumble through homework problems with her watching and guiding and explaining your mistakes away. Despite the fact that I didn't have any problems with the class, I went to these office hours religiously because of her thorough explanations, and interesting tangents. I'm not sure if there was a curve, but I certainly didn't need one because of how well I understood the material by the end of the semester. \nThis class is a pinnacle example of how awesome Barnard is. Here is this famous and successful physicist that knows your name and takes time out of her day to help you GET THINGS. At the risk of sounding like a self-help book... getting an A is not the goal, learning is. \nHere's a little about me, so you can see how your experience might relate to mine. Barnard was my first exposure to Physics -- somehow I missed out on that in high school. Despite my newfound love for the subject, I am not a Physics major. I am, however, quite fond of quantitative subjects, and have an excellent Calculus background (took calc 1, 2, and 3), which was extremely relevant to the class... especially Calc 3. I got an A in this class, but I by no means thought this class was easy; I invested a lot of time into problem sets. That being said, largely due to Professor Levin's inspiring lectures, I ended up loving the material and (dare I say?) enjoying doing the problem sets. Something I should also mention is that not everyone I talked to felt as enchanted by this class as I do (and admittedly, I set a high enchantment threshold), but I think complaints mostly had to do with workload. \nWorkload:\nOne problem set a week that concerns the topics discussed in class (going to recitation will answer a few of these problems for you) with 10-15 problems.. quite difficult but manageable. Doing these make other components of the class easier.\nOne midterm.. pretty manageable assuming you are keeping up with material\nA couple of quizzes.. also pretty manageable if you keep up with material\nA final.. study for a couple days and this will be manageable too \n\n"
        },
        {
            "course_name": "Electricity & Magnetism",
            "review_date": "May 15, 2011",
            "review_content": "\nThis semester was so much harder than the first semester (Mechanics). It also involves a lot more calculus (last semester was mostly easy derivatives, this semester we had to do legit integrations). I know a lot of people have written that Janna Levin seems arrogant, but I didn't feel like that was the case. I felt that she was just a person who enjoyed talked about her work and experiences (and happened to do a lot of really cool things). While she isn't the best at explaining things in lecture, she's more than happy to go over anything during office hours over and over until you understand.\nWorkload:\nWeekly problem sets (7-8 questions), 2 quizzes, midterm and final\n"
        },
        {
            "course_name": "General Relativity, Black Holes, and Cosmology",
            "review_date": "December 26, 2009",
            "review_content": "\nGood class and great professor. If you want an in depth perspective of General Relativity and all its implications this is the course for you. That being said, if you are looking for an easy going class that takes a very general and qualitative approach to GR and black holes, this class may be a bit more than you would bargain for. The class is deceptively difficult. The course is very math intensive and relies heavily linear algebra, differential geometry and topology. If you are like me and don't have a strong background in any of these subjects, you might find the course to be a bit overwhelming at first... in fact, about a third of my the class didn't return after the second week. Still, if you are really interested in learning general relativity, I would encourage you stick with it because after a while you will realize that the course gets very repetitive and once you look back, everything will start to make sense.\nDespite the dense and often times inaccessible course work Janna Levin manages to make her class an enjoyable experience. She is very approachable and shows genuine interest in ensuring that her students learn the material. She does have the tendency to speed through the material but she was always more than happy to review obscure topics.\nWorkload:\nThe problems sets range from difficult to impossible. She assigns about 10 problems from the text book every week or so. I should note that the problem sets are really intended for your own practice. They are graded but if you ace the exams, that's grade you'll get for the class... though she might change this policy.\nThe midterm and final were very reasonable. They were nowhere near the difficulty of the problem sets and were very straight forward.\n"
        },
        {
            "course_name": "General Relativity, Black Holes, and Cosmology",
            "review_date": "December 20, 2008",
            "review_content": "\nI took General Relativity, Black Holes, and Cosmology with her.. She is absolutely fantastic. While she may not always be able to help you with specific examples during class unless time is specifically set out for that (and it sometimes is), she will always help in office hours. and she is so nice! and has been on the Colbert report!! Overall, an incredible fantastic, inspiring, wonderful physics professor. Take a class with her if you do get a chance. it is soo worth it.\nWorkload:\nnot bad at all. she is always willing to potentially reschedule problem sets if something conflicts or some other reason. one midterm, one final, and ~8 (when there should have been ~10 probably) problem sets. \n"
        },
        {
            "course_name": "Electricty and Magnetism",
            "review_date": "September 06, 2007",
            "review_content": "\ni really, strongly dislike janna levin.  yes, she's brilliant, and yes, many people think she deserves to be as arrogant as she is, but honestly, i think her personality is absolutely intolerable.  in my opinion, she's only okay as a professor, so it's not like her exceptional powers of explaining physics make up for how annoying she is.  overall, the class is not actually as hard as everyone makes it out to be... the problem sets are definitely obnoxious, but she basically does them for you in office hours, and she makes it pretty clear what you can expect from her on tests.  \nWorkload:\nweekly (hard) problem sets, one midterm, one final, a few quizzes.\n"
        },
        {
            "course_name": "e&m;",
            "review_date": "June 09, 2006",
            "review_content": "\nI liked the course and the professor. The professor makes lectures interesting (although sometimes she does tend to spend too much time on one topic) and always encourages student participation. Her office hours are usually helpful, if you can get a chance to ask your question (she sometimes spends half the time on one pretty easy hw problem, leaving little room for other questions). In terms of material, it is not as difficult as the previous reviewer makes it out to be -- there are few scary proofs, if any. The problems on the exams and quizes are usually basic and ones that we've seen before (especially on the quizes). I don't mean to say that the class is a breeze -- I definitely spent a lot of time studying and doing hw for this class, but not as much as for others that I've taken.\nWorkload:\nFair. There are 8 problem sets of 7-8 medium difficulty problems each. You can do them yourself or you can go to recitation and office hours and have them done on the board for you (I don't recommend the latter method). There are 3 quizes (easy) and a fair midterm and final.\n"
        },
        {
            "course_name": "Optics, Electricity and Magnetism",
            "review_date": "November 18, 2004",
            "review_content": "\nWhile Janna Levin is funny, interesting, and cool, she is also a very difficult teacher. There are long homeworks with seven questions (usually each question has four to six parts) that a merciless TA grades. There are long involved proofs in class and slightly shorter proofs that she expects you to know for tests. Her tests are also difficult (expect long involved problems with 4-8 parts) and she doesn't budget time very well. Basically she expects students to be dedicated physics lovers and always seems suprised that we can't immediately see the solution to a proof. If you are looking for a easy A do not take this class because there are a handful of physics majors that mess up the curve (there are only thirty-five or less in a class). If you are looking for a challenging proof driven course, then take this class.\nWorkload:\nVery long weekly homeworks (around three hrs solo work and three hrs of group work=6hrs total).  Of course there are some people who manage to do it in 2 hrs (usually physics majors). 3 quizzes (study like hell for them and know ALL the concepts).  midterm + final (hard and very conceptual, get ready to do proofs with differential equations). She does however curve--somehow a 50 average was computed to a B, but the class average was pretty low. . . . well except for the 5 or so physic majors that had 90 averages. \n"
        }
    ]
}