{
    "prof_info": [
        {
            "prof_name": "Martin Chalfie",
            "prof_id": 734,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Genetics",
            "review_date": "January 31, 2008",
            "review_content": "\nThis was one of the best classes, if not the best, class I have taken at Columbia. I found Professor Chalfie's class to be very organized, his TA's were superb (he picks the best graduate students from the previous year), and his lecture style to be engaging and relatively well organized. He does not use power point, which in this day and age I feel is a crutch not an asset used by lecturers. The lectures flowed very well- and I in fact did record the lectures (as did many other students in the class) and they were helpful. To reiterate the advice from previous posts- download the exams and answers, they will take them down, buy the Griffiths book (I bought mine for discount from amazon uk and it was much cheaper than the bookstore), and BORROW Ptashne for the lambda lecture. I loved this class. \nWorkload:\nModerate to heavy, you need to stay on top of the problem sets. Memorization and a thorough understanding of his lectures is the key- use Griffiths to supplement what you don't understand, but take good notes and use the TA's like its going out of style.\n3 exams and a final (the final is optional, if you did well on the first three exams you don't need to sit the final). \n"
        },
        {
            "course_name": "Genetics",
            "review_date": "December 28, 2006",
            "review_content": "\nAs the other reviewers have mentioned, this class requires effort. Chalfie is really a terrific lecturer, but do not expect to be spoon fed genetics. Much of the learning in this class will be done on your own or with the TAs. For your own sake, save every electronic copy of old exams, and if you want answers to current semester exams print them immediately because he asks the TAs to remove all the exams prior to the final so you will be out of luck if you dont print or save them immediately. I got an A- in the class and this is what I did:\n1. I did the problems before the exams- every frigging problem twice b/c the dude recycles questions like its going out of style- there are a shitload of problems but just do them and reap the benefits.\n2. I read the textbooks when he lost me in lecture- Do yourself a favor and buy Griffiths, borrow Ptashne for the lambda lecture and read the books. His lectures are riveting but not always organized\n3. I went to the TAs- who were wonderful\nDo damage to the mean on the first exam- I scored two standard deviations above the mean on that exam- and had mediocre perfomances on the next two. If you do well on the first exam you may not have to take the final!!!\nWorkload:\nmoderate to heavy- depending on the problem sets for that week. problem sets can range from 4 questions to 13 questions with multiple parts. 3 exams, 1 final- all counted equally- you can drop the final. The dude is a generous grader and will round up.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "January 17, 2006",
            "review_content": "\nChalfie's lectures are truly amazing, it is a pity I didn't record them. He did occasionally have some good jokes and generally you can have a very good glimpse at the real life behind science. He does not require you to use the textbook and indeed you need it only for background. The problem with grades of course is you cannot easily figure out what he wants from you. Doing the problems is probably a very good idea, but even just understanding them is quite enough. Most important is good notes from lecture cause often problems would refer to particular examples he used. This is the frustrating part - often you will have to just memorize what is the experiment you need to do in a particular situation. Simply knowing the general principles and thinking on your own on the test won't work always, unless you are a genius or already have significant experience in the field. \nWorkload:\nDepends on what you are striving for. You can easily get slightly above average without even doing the homeworks, but if you do them it would take plenty of time. Still, this does not guarantee you success. Curve is on individual tests, a bit harsh, since average is set at the C+/B- border. However, you can drop one of the 4 units (3 midterms and final) and even don't go to final if you like the grade you get just from midterms. \n"
        },
        {
            "course_name": "Genetics",
            "review_date": "January 02, 2006",
            "review_content": "\nIn contrast to the last reviewer, I very much liked Chalfie's lecturing style. I didn't think they were disorganized. It is true that he doesn't use powerpoint, but in my humble opinion, I think that science professors in general should use powerpoint very sparingly, because it makes lectures boring as hell. All you have to do in a powerpoint is follow the slides with the prof, without making sure you actually understand the stuff, and this would be especially detrimental in a genetics course, as genetics is a problem-solving-oriented discipline, and you wouldn't really learn anything from memorization. When you're actually taking notes, you are more likely to engage the material and learn it as you go. All in all if you put in however much effort you need to put in to do well (which will vary from person to person), you gain a very good understanding of basic genetics.\nSame comments about the problem sets and Chalfie's large intelligence, enthusiasm and question-answering.\nWorkload:\nLots of material covered in class (class often ends 5 min. \nlate), but if you keep up, take good notes and make sure you understand the notes you are taking and the problem sets, you should be fine. Memorization won't get you anywhere. You actually have to understand the stuff to do well, which is in marked contrast to most of the other columbia bio courses. Perhaps this is why the previous reviewers notice a greater workload. If you are used to cramming your brain with facts as your major study method (hey, it works just fine for molec bio, biochem, both neuro courses and probably a lot of the other bio courses), be prepared for something else.\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "March 11, 2005",
            "review_content": "\nI don't particularly agree with the last viewer.  The class was certainly very difficult.  I also felt like there was a diconnect between the lecture material and the homework material.  Some exams resembled the homework and some would focus on your comprehension of the lecture material.  To do well in this class, a student must be particularly motivated and fill in the details missing from the lecture (which are rushed and  always seemed to run out of time).  Prof Chalfie lectures spontaneously and extremely fast--so no powerpoint, which would really help his organization.  I couldn't believe that some people actually fell asleep in this class as I thought they were all so interesting.  Plus, you can miss a lot of material by dozing.  I definitely wish that I had started tape recording the classes before the end of the term (there are generally 5 recording devices in front of the chalk board each class).  Printing out outlines from the website doesn't really help one keep up with the speed of the lecture.  \nThe problems were difficult--and the answers provided were sometimes wrong--but the TAs during optional recitations and review sessions were very bright and capable of answering your questions.  Prof Chalfie is exceptionally intelligent (I believe he was recently accepted as a fellow to the National Academy of Science and from what I understand, he invented GFP).  His lectures are full of really interesting and often funny anecdotes (many about worm research--his specialty) that really take you through the most important genetic experiments and humble you, thinking about the brilliance of these scientists.  Prof Chalfie is very enthusiastic in answering questions outside of class.  He has an office hour everyday and two on Friday.    This class was very hard but it also makes me want to drop pre-med and study genetics.  It was probably the most challenging course I've taken at Columbia, and it's definitely rewarding.  I recommend it.\nWorkload:\n4 exams (including final)--drop the lowest midterm.  Optional problem set on every lecture.  These vary in length, but if you can understand them before the exams, you'll be fine (TA review session and office  hours are key).  Many test questions are slight variations (sometimes identical to) the homework problems.  Memorizing answers may get you a B or even a little better, but to get an A- you probably need to study really hard and understand most of the material.  There is far too much material and little time to get it all.  The grading is difficult as the mean is set to a B- (one standard deviation above the mean gets an A-)\n"
        },
        {
            "course_name": "Genetics",
            "review_date": "December 29, 2004",
            "review_content": "\nIf you can help it, don't take this class. It was absolutely ridiculous. To be fair, the material was understandable and the professor would help you if asked (and if you can get a hold of him), but that's where the good parts of the class ends. The problem sets were very very hard and the answer keys often had mistakes which made doing the problem sets even more frustrating. And the exams were impossible; they were too long and the questions were worded in such ridiculous ways that I often felt like I was being tested on if I could understand what he was asking rather than the material being tested. To give an example of how impossible his exams were the mean on one of the exams was a 42. I worked my butt off, and at the end I was relieved to get a B-. If you can take genetics with another professor I strongly advise doing so.\nWorkload:\n4 exams, including the final, and he drops the lowest grade. Problem sets on every lecture, but none of them are ever due, so you can do them or not ,as you see fit. But, if you don't do them you're pretty much screwed.\n"
        }
    ]
}