{
    "prof_info": [
        {
            "prof_name": "Dana Fields",
            "prof_id": 9647,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Comedy Past and Present",
            "review_date": "December 21, 2011",
            "review_content": "\nI took this class just for kicks because it fit in my schedule and had an interesting syllabus (in other words, I came for Tom Stoppard and stayed for Aristophanes). It was easily my favorite class this semester! It seemed to me as though Prof Fields chose to teach this class because the topic was a sort of \"pet project\" for her; we weren't working from a canon of knowledge that she expected us to regurgitate back to her, but together we were discussing these great comedic texts and having a ton of fun looking at ancient and contemporary comedy through an academic lens. I'll admit that I didn't come to class all the time, but the class periods that I did attend were informative, fascinating, and fun. I also took this class while I was taking LitHum and I found that the wealth of knowledge on classics that Professor Fields shares was immensely helpful for helping me understand and contribute to LitHum.\nAll in all, this was a fascinating class that wasn't too demanding. A great choice for a fun elective if you're looking for something interesting, engaging, and that will let you read tons of great texts you probably never would have read otherwise. I definitely recommend it!\nWorkload:\nLOTS of reading; most of the time we were expected to read a full play and a few secondary sources for each class period. However, this is all comedy, so the reading was fun and went by very quickly. Many of the secondary source readings are optional, and even the required ones aren't completely necessary to follow class discussion.\nOne 5-6 page paper and one 8-9 page paper. She gives a list of recommended topics, but she's very open to hearing other ideas if you come to her early. She's a very reasonable grader. As long as you show a consistent thesis and argument, you'll do well on your essays.\nTake-home midterm and take-home cumulative final. The midterm is two short essays; the final is some passage IDs and a short essay. These are very, very reasonable. She lets you pick which texts to write about, so you don't have to have complete mastery over everything you've read. Again, as long as you show that you have a thesis and your argument is well-organized, you should do well on these. She gives more than enough time for them to be completed and grades them fairly.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 12, 2011",
            "review_content": "\nProfessor Fields really ought to have a gold nugget. She is likely the best Lit Hum professor you'll get since she knows the Classics so well. But more than being a Classics scholar, her understanding of the Lit Hum texts overall and her clever, interesting ways of interpreting them means that you get a solid basis in the not just understanding these particular works, but in literary interpretation in general. She does a great job of balancing between lecturing to give the appropriate amount of information and anecdotes and possible interpretations and fostering student discussion. I only have two somewhat negative things to say. First, her grading/notes on the papers can be somewhat frustrating since she doesn't give very lengthy responses as to why you got the grade you did or how you could improve, but after taking an English class this semester I learned that she gives a lot more feedback than some Humanities professor here. And second, she can come off as somewhat standoff-ish and aloof initially. She does seem to have a sense of humor and is nice, but it takes her a long time to warm up to you/for you not to be worried that she finds you really tedious and obnoxious.  If you do get Prof Fields, consider yourself lucky. She is one of the best!\nWorkload:\nStandard Lit Hum workload plus one or two things that she chooses to add to the reading list\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 15, 2009",
            "review_content": "\nDr. Fields is extraordinary. She's young, engaging, and quirky. Her dry wit is hilarious when she employs it talking about the classic works. Lit hum can suck, or it can be life changing, or it can be \"not so bad.\" While I confess it wasn't my favorite class, I did enjoy our four hours a week in the bowels of Pupin. She consistently brought her background as a classics scholar to the work to give us a fully rounded idea of the culture into which the works we read were received. Although she may seem a bit stiff for the first few classes (also possibly due to the fact that this is her first year teaching lit hum), she does warm up as the semester goes on. She's very accessible and a very fair grader on papers. We even had class outside in September, one of those quintessential college scenes of the group of engaged students sitting in a large circle on the lawn discussing Gilgamesh. She simply said to us that day, \"Remember this when you write your CULPA reviews.\" I can't wait for the spring semester! \nWorkload:\nthree papers, graded fairly, appropriately difficult midterm, course wide final\n"
        }
    ]
}