{
    "prof_info": [
        {
            "prof_name": "Harald Kisiedu",
            "prof_id": 3393,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "June 09, 2010",
            "review_content": "\nPlain and simple, this guy is just not a good professor. He comes across as a decent enough guy during the first couple of classes, but once the semester gets into full swing he makes it clear that he neither wants to be there nor cares what people get out of the class. The exams cover what could charitably be described as musical trivia, and th music recognition is designed to be intentionally ambiguous. Also, he will refuse to tell you what to study, just telling you to \"study whats on the syllabus\". He does not apply any type of curve at all, so his lack of teaching ability becomes the students problem.\nIt is really a shame that I took this class with him, and if you make the same mistake I did, you will feel the same way. This professor takes what could be a fun, exciting, and rewarding class and turns it into a miserable semester long obstacle course.\nWorkload:\n1 midterm, 2 papers (a concert report and a research paper, each graded very harshly), and a final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 11, 2010",
            "review_content": "\nCould not have agreed more with the previous reviews. I had read these reviews before and decided to give him the benefit of the doubt since he looked like a nice person from first class. However, a nice person does not equate to a good instructor. I very much regret not taking their advice - avoid at all costs. His criticism of my essay did not make sense to me whatsoever, and I received from him my first-ever B on a paper since college (I'm in my third year). My friends who had taken Music Hum ended up with professors that gave them A+'s despite the fact that they had zero music background. I took 3 years of music history and 3 years of music theory as part of my piano training during elementary/high school. As this fact demonstrates - the exams are basically testing your knowledge of music historical trivia, and the listening identification requires you to know pieces from the MIDDLE of the piece (you have to identify Composer, Name of piece, and Period), not just from the beginning. I've played plenty of piano, but I really do not know stuff like Modernism well enough to just tell from the middle because guess what, there is virtually no pattern in some of them and they all sound far too alike.\nAs stated above, if he doesn't think the class is participating, he will start to give pop quizzes to force people to do the reading and participate - this is by far the most ridiculous way of teaching I have ever hear of in the Western world - it sounds like something a very backward educator would do. Pop quizzes don't scare me, but the action itself is just pedagogically WRONG. As Music Hum is a required course, I strongly urge you to wait until you have a good instructor to take the course and not rush into it like I did. This will be one of the lowest grades I have ever received in college and will definitely drop down my GPA.\nWorkload:\nmidterm, final. one concert report and paper which are both graded harshly with no sign of \"hey this is a required class so i'll cut you some slacks\" - something that most professors do and really there is nothing wrong with doing that for required classes that are irrelevant to one's major.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "March 07, 2010",
            "review_content": "\nI wouldn't say that he's a bad guy, but he takes himself and this class ENTIRELY too seriously. He comes across as though he is bitter and angry that this class isn't given the same attention that, say, an Econ class would be given by an econ major. He expects everyone in the class to have lots to say every day, and if he is unsatisfied with class participation he will start handing out pop quizzes. Also, he refuses to give you any clue what will be on the exams and tells you to \"study what's on the syllabus\". I would not recommend him at all.\nWorkload:\n1 3-4 page concert report, 1 3-4 page paper, midterm, and final. He also assigns extra reading that he finds on his own, and if you miss a class he makes you write a 1 page paper. Trust me don't take this class.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 16, 2008",
            "review_content": "\nSteer clear of this instructor and petition if you must. He repeats word for word (and without inflection) what is written in the book, and pretends to know what he's talking about. Worst of all, he takes himself very seriously and has little sense of humor. Don't try to correct him, even if he is wrong. Music Hum isn't a great class to begin with, but its required--if you want to at least learn something and even enjoy the class a tiny bit, look elsewhere because Instr. Kisiedu is worthless.\nWorkload:\nTwo concert reports, an 8 pg research paper, final exam (for which you will not be prepared and for which he will refuse to give you a list of works to study)\n"
        }
    ]
}