{
    "prof_info": [
        {
            "prof_name": "Chad Kia",
            "prof_id": 2998,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 03, 2007",
            "review_content": "\nI have no idea how he got a silver nugget!\nEveryone I talked to wanted to switch out of the class for the second half.  While Chad is great one on one- he is really helpful when it comes to working on papers and preparing for the mid-term and the final- the class leaves much to be desired.  He often seems unprepared and does not lead the conversation in any direction.  He would begin to attempt to make a point and the minute someone raised their hand he would call on them and NEVER finish his point.  \n\nWorkload:\nposts on courseworks, eight responses, mid-term (harder than most but just like the final), final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 14, 2006",
            "review_content": "\nLet me strongly disagree with the other review. This guy is great. No, he's not like other LitHum preceptors who will allow you to go off on random tangents that speculatively posit the meaning of life. Rather, he will teach you to delve into the text, and pull out the strains of thought essential to the work.\nClass discussion is fairly laid back. Chad is not one to stand up and lecture. Rather, he will try to guide you towards the key points in the text, and let the class debate the validity of these points.\nIf you want to sit back and do nothing in LitHum, this is a great class cause Chad won't insist on you talking.\nIf you want to talk however, this class will challenge and provoke you, and force you to defend your ideas and beliefs.\nWorkload:\n2 Papers, midterm, final, weekly written response (first semester was 250 words on discussion questions, second semester was a weekly 500 word essay). With the papers, he is very open to reading drafts, or allowing revisions after he has graded the papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 14, 2006",
            "review_content": "\nI really like Chad!  I don't know how he is in Mealac, but for LitHum he was personable though not exactly chatty.  There were a lot of silent spots in discussion, but on the whole he really tried to help us understand the material.  His grading is completely fair, and his midterms are directed at discussions in class.\nWorkload:\nweekly responses to reading, 2 papers per semester (5-6 pgs) , midterm, and final  all manageable  Less work than some classes I know of\n"
        }
    ]
}