{
    "prof_info": [
        {
            "prof_name": "Mary Robb",
            "prof_id": 12666,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2013",
            "review_content": "\nShe's adorably awkward, passionate, energetic, and really wants to help every student do the best they can. I thoroughly enjoyed all my interactions with her. Also she doesn't use the silly textbook most other sections require you to purchase, and I loved her for that. (instead she assigned First Nights by Kelly, a really good read that I'm glad I own now)\nThat being said, her section isn't exactly the \"chill\" experience that every one tells you music hum will be. She doesn't inflate grades, and expects you to really prepare for the exams. The weekly workload is light, but the exams are hard to prepare for and hard to do well on. So if you are paranoid about grades, this might be stressful. (it was for me)\nAll in all, solid section and great teacher. Just not the easier choice.\nWorkload:\nweekly (light) reading and listening, two short concert papers, difficult midterm and final. also preparing discussion questions for the class once in the semester. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 14, 2013",
            "review_content": "\nThis was a great class! Prof. Robb was always organized, helpful and enthusiastic. Taking Music Humanities with her was a pleasure. The course load wasn't too heavy but thanks to her the class felt together rigorous and entertaining. The textbook covered five musical \"first nights\" and it was well written and interesting; we needed to read about 30 pages a week. We also had live performances three times! You also pick one of the five musical works and lead the discussion at the end of that chapter together with other students. Again, really a good class.\nWorkload:\nTwo essays (one on a concert, one on opera), one midterm and one final. The exams have a listening identification part and an essay part. For the midterm you have the essay titles in advance, and 20 score tracks to prepare on (the exam will contain 10 of them). There is also a multiple choice questionnaire on music terms. For the final you always have the essay titles; the listening part is broader, and you need to study three whole musical works, but the track selected are always straightforward.\n"
        }
    ]
}