{
    "prof_info": [
        {
            "prof_name": "Nicole Horejsi",
            "prof_id": 3371,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2014",
            "review_content": "\nHorejsi definitely has both her pros and cons. For pros, this was an easy class. She had 2 essays throughout the semester with rewrites, and the rewrites were worth more. Essays had to be only explication essays, and she gave you usually 4 passages to choose from. She had 4 quizzes, 3 of which were take-home and on reading comprehension, meaning you could just quote the book verbatim and you were fine. Pretty sure that she didn't even look at the answers and just gave everyone a check mark. The midterm was also take home for some bizarre reason (not that I minded), and thus way easier since the time limit wasn't actually enforced. The midterm essays also had a rewrite option. She doesn't count participation in your grade, so you can go through the whole semester without talking. As long as you know what she wants (and she's VERY specific about what she wants), it's not hard to get an A. She also came in at least 15 minutes late every class without fail (again, not that anyone minded). She gives a ton of feedback on essays which is great, and she's also really helpful when you're able to talk to her one-on-one. \nAs for how knowledgeable she is, she does know her stuff. I learned a lot from her and classes were usually pretty insightful. However, the following things below really made me enjoy the class less.\nCons: She is a very disorganized teacher. Case in point: for most of the take home quizzes, she would email them to us a day or two before it was due, and these quizzes were ~30 questions long, and each question had 3-5 parts on average, resulting in an actual total of 100+ questions (I'm not joking). While she gave the class an extension, it was still an unnecessary source of stress. It takes her forever to hand back papers and what not. She is very unresponsive to emails, and it usually takes weeks to hear back from her. Her office hour appointments always run overtime, and so they always start way later than they're supposed to: expect to wait a lot outside her office. She also likes to talk a lot, which isn't necessarily a bad thing, but I felt as though it took away from the seminar experience; often her comments would overshadow what my classmates would have to say. I think she'd be great for a lecture course, not so much seminar. She never exactly figured out the grade break-down either, which was confusing.\nWe also never got those damn cookies.\nSPARKNOTES VER: Knows what she's talking about, really disorganized, but an easy class if you can write super-specific (like within a 14-line passage specific) explication essays.\nWorkload:\n2 essays, both with rewrites.\n4 quizzes, 1 explication in class, 3 take home reading comprehension\nTake-home midterm w/essay rewrite, no IDs.\nMidterm & final essays: 1 explication, 1 synthesis (also have to use books from 3 different genres).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 28, 2014",
            "review_content": "\nDr. Horejsi is, in short, a legend and completely inspiring.  I started off the semester not reading the first three books and it was only one day in class when she was going into a tangent about the use of genre in ancient Greek culture that I realized that with a teacher this knowledgeable, I had to be doing my end of the work.  From there, the class was really great although a good deal of time was wasted when we split up into little groups.  Nonetheless, she provided us with so many supporting materials that I felt I was gaining a good understanding of the material.  Also, best essays policy ever.  2 essays, with rewrites! And when I would email her questions in advance of a meeting, I would come and she would have printed out my email and have it fully annotated (!!!).  Her work ethic and knowledge are truly phenomenal. \nWorkload:\nTwo essays (with rewrites), take home midterm, final.  Only one quiz.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 02, 2012",
            "review_content": "\nI know this is an unpopular opinion, but I didn't like Professor Horejsi's teaching style. Classroom discussions, at least in my class, never got particularly deep; Horejsi often rewarded students for comments that were banal (as in \"Don Quixote is a quixotic character\"), and didn't do much to push us towards deep or thought-provoking conclusions. She had a tendency to ramble and spent a lot of time summarizing or stating the obvious, which I found frustrating. We focused a lot on content at the expense of talking about themes in a meaningful way. She was also very strict about policy/grading, to an extent that I personally felt interfered with the quality of the class. If you get on her good side by participating a lot - even if you don't have anything intelligent to say - you'll probably enjoy the class. If not, it's still not a terrible class to be in; she's competent, you'll cover everything that needs to be covered, and sometimes she brings cookies. I just didn't find her as inspiring a professor as some others have.\nWorkload:\nFairly standard for a LitHum class, though you should note that she expects everyone to do all of the reading and will quiz on content.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 03, 2012",
            "review_content": "\nShe was my favorite professor for my first semester; I absolutely loved her. She was thoroughly enthusiastic and seemed to care about her students.  A large part of your grade is three papers that you have to write in the class, which are all limited to three pages in length.  She grades them fairly, and they each are progressively worth more (with a revision being worth typically 60% of your paper grade, which is helpful).  She responds to email very quickly, and has an \"email deadline\" for contacting her before each paper is due.  When I took advantage of this, she sent absurdly detailed and helpful feedback.  Additionally, she often extends her office hours during weeks where papers are due, and she is encouraging and clear about what she's looking for there.\nThe quizzes are either explication (close reading of a text) quizzes or factual quizzes (or a combination of both).  The first fact-based quiz of the semester tripped me up a bit because I was iffy-er on factual parts of the reading, although I had done all of it.  I recommend doing all of the reading for the class, but also reading through the SparkNotes summaries of texts in order to cement the factual points that you might have missed.  The nice thing is that she drops your lowest quiz grade, and is a fair grader.  \nThe midterm doesn't involve any passage identification, which is a plus.  There were at least two extra credit opportunities in the class, and they were based around going to an event and then responding with a 3 page paper.  Finally, I'm unsure how academically relevant this is, but she often brought delicious cookies to class.\nWorkload:\nVery reasonable--no extra readings, 3 papers, ~3 quizzes, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 20, 2011",
            "review_content": "\nThere are already many accurate, good reviews of Professor Horejsi below. I personally recommend taking her class if given the choice.\nHere are a few more specifics and tips on the coursework for the first semester of Literature Humanities with Professor Horejsi:\nParticipation: 10%\n- Basic stuff: bring your books, come to class, raise your hand and talk once in a while\nPapers: 1st 5% (3 pages), 2nd 15% (3 pages), 3rd 20% (3 pages)\n- All focused on close-reading/explication (changes for second semester)\n- For the first two papers, you submit two drafts. The first is weighted at 40% your total essay grade and the second (you get about a week to revise) at 60% your total grade.\n- Before writing a paper, try to meet with Professor Horejsi at least once to discuss your topic. This is both helpful for developing your topic and improving your grade.\n- You must do 2-3 required peer revisions. These can get kind of annoying, but it's more than survivable. She provides a questionnaire online to do the peer revision.\n- Be careful, especially on your first paper. Professor Horejsi has a pretty specific style and structure that she looks for, so pay attention to how she says to format/write your essays.\nQuizzes: 5% (you get to drop lowest score)\n- 3 quizzes this first semester\n- 2 had basic reading comprehension questions. Be sure to read or at least sparknote text beforehand. All 3 had some sort of explication. They are graded fairly.\nMidterm: 20%\n- No identifications (IDs) and two essays (one close-reading/explication and one cross-genre essay)\n- Grading is only about average (most people had B's), but she allowed us to revise one essay and write another essay to earn back up to 10 point (out of 100) on the midterm.\nFinal: 25%\n- 10 or 11 identifications, 2 essays (standard)\n- The final is not really worth cramming for. The best preparation is just to keep up with all the reading as the semester proceeds.\nExtra Credit Opportunities: ?%\n- There were a few times that Professor Horejsi presented extra credit opportunities. Be warned that she does not disclose how much they are worth and that you usually need to write about 3 pages.\nWorkload:\nAs listed above:\nReadings/text - no extra ones!\n3 Papers\n3 Quizzes\n1 Midterm\n1 Final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 07, 2010",
            "review_content": "\nHorejsi has been, by far, my favorite teacher here at Columbia.\nRemember the \"Blue Notes\"- that information guide to the university that spoke of brilliant professors with great experience and a driving force to instruct \"the new citizens of the world\"? Prof. Nicole Horejsi is the embodiment of that kind of professor.\nShe is fully immersed in the readings of the curriculum and is totally knowledgeable in pretty much every aspect of the texts (it's ridiculous). From Homer to Virginia Woolfe, she will draw out themes and develop interesting points regarding sexuality, societal pressures, heroic values, familial relationships, etc. \nShe is strict in the policies of the core and expects you to be reading what you are reading, so she is no 'easy A' instructor; however, if you really want to take a LitHum class that will make you appreciate literature and make your writing much more effective (the amount of feedback she gives you is far beyond what any of my peers have received from their professors), stay in Horejsi's section.\nP.S. She bakes wicked treats. \nWorkload:\nThe Usual\n-Texts (unlike other professors, she didn't add any extra texts)\n-Quizzes  \n-Participation (she values discussions)\n-Class-wide Midterm and Final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 20, 2009",
            "review_content": "\nProfessor Horejsi is one of the nicest sweetest human beings I have ever had as a teacher.  She makes everyone in the class feel smart, whether you did the reading or not.  You can just go to class and listen and take notes and still be fine in the class. I read a grand total of 0 pages in one semester and still got a B for the course (ID's on the exam killed me as expected).  However she counts ID's as little as she can, she is big on explication, and her essays are fair.  You do 2 drafts of each essay and she takes the average of them.  Email her and she will email you back with any help you can imagine.  fair grader. Pay attention in class and you will be fine\nWorkload:\nheavy reading (as expected), 2 or 3 papers a semester (2 drafts for each essay with feedback), few reading and explication quizzes per semester and midterm/final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 26, 2009",
            "review_content": "\nSo I definately agree with the reviewer below: we spent a lot of time on each text discussing gender (i dont know if this is actually a significant part of Greek civilization or what the class is just focused on) as well as heroism. But i think she is a great professor! The way the class is set up, the 2 hours feel more like 1, and you learn so much about the texts. We had study questions assigned for every book, and in class we'd either have group discussions or several small groups assigned questions to answer (afterwards we'd reconvene and talk about all the questions as a class). You need to read the texts to feel comfortable in class, especially because there are about 5 quizes on the books throughout the year (although they only counted for 5% of the class). There was a lot of focus on explication essays and comparison essays b/t genres/books. It was great prep for the final, and usually the topics could be drawn straight from class discussions. So, unlike a lot of other classes, generating an essay wasn't hard at all. The essay process was time consuming though, w/ peer reviews b/t students. But, she is always there to help edit your thesis, so if you just put in a little bit of time beforehand so you can get her help, its really easy to get an A. Plus, after the first draft we get to make revisions based off her comments, which also is a major advantage over other classes. I felt like this class was a writing workshop just as much as a lit class, and I definitely feel like a stronger writer. \nThe workload isn't intense at all, just the typical lit hum reading(which is pretty intense in itself). We had to write journal entries every week, which were a huge pain and took a while to write, but they got erased from the syllabus because of so many complaints. I think this shows how willing she is to work with the students and wants to make the class as easy, but also effective, as possible. People have complained about her being a really mean teacher and expecting so much work from the students, but I didnt feel that way. The only thing you have to do is actually read (it's much harder to get away with not reading, but not impossible, people did it but a lot of people also did the reading). But, it pays off in the end because mostly all the ID's on the final we discussed in class. Oh, and the midterm had no ID's, which is AMAZING. That said, she is a really approachable professor and is always willing to meet with the students. If you need any convincing, she brought us cookies that she baked on the first day of class, and had a mini-party on the last day of class. \nWorkload:\nOutside of assigned reading = 3 essays\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 23, 2008",
            "review_content": "\nI had Professor Horejsi for my first semester of Lit Hum, and it was clear to me the entire time that I had to switch sections.  While I recognize that, having so little time to discuss each text, it is difficult to come to a really deep understanding of any of those texts, I felt that I had really learned very little after each and every class.  While I came to the class with a small bit of background in Greek lit, I had never read the Bible before, and I was still disappointed by those classes.  The lectures were dry and unengaging, and the discussions were often dead or forced and usually not in any way conclusive.  Also, it seemed like part of almost every class was about women's studies; while obviously this is a hugely important topic in history/literature, sometimes I really wanted to just discuss something else.\nI do feel that my writing got better, and Prof. Horejsi was always willing to comment on my thesis.  She leaves a lot of the work up to you (which is a good thing), but sometimes this is counterproductive; for instance, the model thesis sentences she provided at the beginning of the semester were 3-4 lines long, but with her comments my theses grew and grew until they might be half a page+ and she'd still be asking for more detail.  \nProf. Horejsi is very nice, and I do believe that she knows her stuff, but, at least until she has a bit more teaching experience, I wouldn't recommend taking a class with her. \nWorkload:\n3 3 page (no more, no less, it's a lot harder than it sounds) explication papers, a few small quizzes in class, midterm and final\n"
        },
        {
            "course_name": "Henry Fielding Seminar",
            "review_date": "January 15, 2008",
            "review_content": "\nBrilliant! Prof. Horejsi is amiable, approachable, fair, and incredibly engaging.  She directs lectures in an informative yet spellbinding manner while also leading discussion so that they flow easily and effectively.  Definately one of the best English courses I have taken at Columbia. I wish there was a year long study in Fielding!\nWorkload:\nweekly responses, one explication 3 page paper and rewrite, take home midterm and final, 10 page final paper.  Tons of enjoyable reading. Trust me you will look forward to it. \n"
        }
    ]
}