{
    "prof_info": [
        {
            "prof_name": "Brigitte Nacos",
            "prof_id": 268,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Terrorism and Counter-Terrorism",
            "review_date": "May 04, 2012",
            "review_content": "\nThis seminar is a solid pickup for anyone who has a mild interest in this stuff. It's easy to get away with not doing any of the readings and you only have to participate once or twice (like any other seminar) to get a good participation grade. The discussions are sometimes interesting because who doesn't love talking about hypotheticals that involve national security? Make sure you hand in a draft/outline/something written of your term paper early because just discussing your ideas with her does not mean you actually understand what she wants and could result in a shockingly bad grade. Trust me, I know.\nWorkload:\nReadings that you never have to do as long as someone else in the class does them. A small presentation about a terrorist group mid-semester, but that's not a big deal. Classic 25-page term paper on something related to terrorism. \n"
        },
        {
            "course_name": "Terrorism and Counter-Terrorism",
            "review_date": "December 22, 2010",
            "review_content": "\nThis is one of the best and most manageable Seminars in the department. Professor Nacos is absolutely great in sending e-mails about real-time situations and apply the concepts to them. Even if you have not done the readings through application of the concepts you can learn a lot about this whatever is being discussed. \nWith that said, the readings are really interesting, specially if you are interested in the subject and are very much manageable compared to other classes. \nProfessor Nacos is one of the nicest people you'll encounter in your academic career. She is caring and wants to help you better understand the material. She is willing to read over your paper before its due and gives you insightful comments that can help you write a better paper which will make your final grade better.\nOverall a great experience to have her as a professor. I would take whatever else class she teaches because she is just amazing.\nWorkload:\none 25-page paper due at the end of the semester. readings are manageable and interesting. \n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "January 23, 2007",
            "review_content": "\nThis class is PERFECT for those who 1) know nothing (or very little) about the relationship between the media and the government and 2) are the \"go to class and take notes\" type (as described by another reviewer). If you go to class, sit near the front, and take notes,  this class is truly enjoyable. \nWarning, however, Nacos does not put up with those who like to hear their own voices- she will shut you down quickly if she can tell you are an uninformed participant. She really knows her stuff (her book relating terrorism and the media is great...easy read and interesting). I know many students who worshiped her this past semester and loved going to class, myself included. \nWorkload:\nReading is really not necessary. Go to class, and you guys will get a take home midterm and final. (we didn't, but that's because our attendance was low). \n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "December 22, 2006",
            "review_content": "\nThis class was basically a giant waste of time. Admittedly part of my dislike was with the course time, late evening Thursday nights, but Nacos' rambling lectures didn't help either. She handed out lecture outlines during every class but often side tracked herself with useless trajectories, then upon realizing she hadn't finished her outline would just continue lecturing past the end of class, sometimes up to 10-15 minutes past.  The material is mostly common sense stuff with obvious conclusions. Readings are unnecessary, most stuff is lecture based. But be careful, the TAs grade arbitrarily. If you are unhappy with your grade I would fight it. \nOverall, boring class with no new information if you follow the news, and random grading.  \nWorkload:\nIn class midterm, 10 page research paper, Take Home final.\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "November 14, 2006",
            "review_content": "\nThe good news is that this class is easy. The bad news is that this class is a waste of time. \nI too was excited about the course after reading such good CULPA reviews, but I quickly realized my error. For one, Prof. Nacos simply doesn't seem to know much about how American media organizations actually work. She's a consumate outsider, and it shows. A quick example: She says that television news sets the national news agenda. \nWrong. I've worked in TV news and I can tell you that they all get their news from the New York Times and the Wall Street Journal and the like. This is a simple, basic fact obvious to anyone who's worked in TV news. \nWhile Prof. Nacos doesn't, in my opinion, offer much insight into the realities of American journalism, she is adept at prescribing how things should be and/or used to be. My friendsÂ–Â–who have since stopped coming to classÂ–Â–and I had a little game where we would predict exactly when she would say \"that's not how things used to be!\" \nThis class is a biweekly armchair quarterbacking session for Prof. Nacos to both bloviate on the decrepid state of the American media and reminisce on her time as a German newspaper reporter. The depth of her analysis is closer to what you would expect from a high school blogger than a tenured Columbia professor. \nI'd say you could take all of the interesting and insightful material in this course and compress it into a single 3 hour lecture. \nThe question remains: Why such glowing CULPA reviews? My guess is that my fellow reviewers are: a) naive to how the American media reallly works and thus have no idea how much bullshit they are hearing; b) sympathetic to Prof. Nacos' take on \"how things should be\" and let that emotional satisfaction cloud or override the fact that they aren't learning anything. She preaches to the choir, and if you're into that sort of shared ignorance, then this is the class for you. But otherwise, look elsewhere my friends.\nWorkload:\nEASY with a capital E. One midterm. One paper. One take-\nhome final. Reading is optional.\n"
        },
        {
            "course_name": "Terrorism and Counter-Terrorism",
            "review_date": "July 01, 2006",
            "review_content": "\nI couldn't believe this was a seminar. It was definitely the easiest class I've taken at Columbia. Reading is NOT required for an A. You just have to show up to class (Prof. Nacos doesn't take roll frequently) and nod your head at class discussions. Some discussions were interesting and Prof. Nacos is a good moderator. Very balanced. But some overly eager students who watch CNN or Fox News too much say such ill-conceived things that you want to barf. \nIn short: the class is super easy. The professor is nice. What else do you want?\nWorkload:\nOne 25pp research paper on topic of your choice. That's all, folks.\n"
        },
        {
            "course_name": "Colloquium: Political Violence and Terrorism",
            "review_date": "January 24, 2006",
            "review_content": "\nProfessor Nacos is a very approachable and warm instructor. The seminar discusses the issues of terrorism in various locales. The class is a really easy seminar. Reading her book and a bit from the reserve can be enough if you know anything about current events. If you work hard on the paper you can get an A without doing much during the semester and its always fun to talk about current events with a terrorist specialist.\nWorkload:\nOne long paper (25-30) and a related proposal of 6 pages. Reading thats not needed.\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "January 02, 2005",
            "review_content": "\nProf. Nacos is totally awesome, as is this class, particularly for anyone interested in the relationship between media and American politics (obviously) as well as anyone interested in journalism in general.  You can really tell that she's had a lot of experiences with everything she talks about, particularly the symbiotic relationship between terrorism and the media (which is what her book is about).  All the classes were informative and worthwhile, and Prof. Nacos clearly aimed the course at people who were curious about the subject, not just people trying to fill space on their program.  (This was also clear based on the large number of grad students who took the class as well.)  The reading list is great, although because reading the books isn't really necessary to do any of the assignments, I wound up putting them into my 'fun reading' category, which always gets looked at last.  I do plan on reading them eventually, though, because they contain info relating to the media that's worth knowing.     \nWorkload:\ntake-home midterm (she changed it, usually it's in-class), 10p research paper, take-home final (also changed, I think, from the usual)\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "December 16, 2004",
            "review_content": "\nNacos knows her material extremely well and is a great lecturer.  Even though the class bored me sometimes, I still enjoyed coming to class if only  to hear her opinions on current events, especially on the media and terrorism (which she wrote the book on).  \nWorkload:\nShe assigned a take-home midterm and a take-home final (both of which will have you saying Danke) and a ten page paper that she is glad to help you with. \n\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "December 06, 2004",
            "review_content": "\nI'm not surprised by the negative feedback for Professor Nacos--  as the time slot for this class (6-8) may have contributed to the dwindling attendance.  As other students have pointed out, her midterm and final are based almost exclusively on her lectures; you may think of the assigned readings as secondary  material.  She makes this very clear from the first day of class, and reminds the class throughout the semester.  She prepares outlines for each lecture, and follows them extremely closely.  She speaks from experience, and includes relevant and timely examples.  I suspect that the more negative reviews are from students who did not attend class regularly.\nI'll admit that at first Professor Nacos' accent took some getting used to-- go to class, it gets easier to understand.  She really knows her subject, and is wonderful to speak with during office hours.  Being an election year, I think this added tremendously to the class, and what I took away with me.  \nWorkload:\nThe class was quite large, and she was pleased with the attendance overall, so she gave a TAKE HOME MIDTERM. (answer 2/3 questions 2 pages max. per question, super easy if you use her lecture outlines and your notes, received an A on both questions) There is an open-subject paper (~10 pages for undergrads, ~15 for grads if you take the midterm, ~22-25 if you do not,)  Final is the same format as the midterm, and she also decided on take home.  We have from Thursday to Monday to complete it. \n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "February 03, 2004",
            "review_content": "\ninteresting class, good readings (especially the book nacos wrote), good lectures (her accent is cool). the annoying thing is that most of the readings are on reserve, so you have to xerox most of it yourself. the grading is fair, although the TAs aren't particularly helpful during the semester. graded work comes directly from lecture notes (which are tied in very closely and carefully to assigned readings).\nWorkload:\nmidterm and final, both 100% essay-based. final was take home, midterm was in class. 10-pg paper on anything related to the course topic. lots of reading, but it's interesting and isn't excessive for an upper-level poli sci class. grading and course requirements are slightly different for grad students.\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "December 31, 2003",
            "review_content": "\nI really enjoyed this class, it was one of my favorites this semester. Professor Nacos knew a great deal about the subject and came prepared for class every day. The material included a lot about present day relations between the media, public, and government. I would recommend this class.\nWorkload:\nlong reading assignments (which were not essential), midterm, final exam (take home if class attendance was good), and a 10 page paper on the topic of your choice within the subject\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "April 25, 2003",
            "review_content": "\na truly awful class.  nacos's lectures are plodding and rambly.  ta's grade arbitrarily on both papers and the midterms.  discussions are so crowded that they render the discussion pointless.\nWorkload:\nlight reading, midterm, final, paper, discussion sections.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "January 21, 2003",
            "review_content": "\nAWFUL!  This woman's lectures are inpenetrable.  She has a horrific accent, which coupled with her monotone and robotic delivery makes for snooze time.\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "December 10, 2002",
            "review_content": "\nIf you're a polisci major looking for an easy elective, this is a great class. The time slot sucks, but the midterm and final were pretty easy, and were graded generously. She lets you choose your own topic for your 8-10 page essay, as long as it's related to some topic covered in class. Overall, she is a pretty good lecturer, but has a tendency to let the class fall apart into an oversized discussion section after the first fifteen minutes. She gets pissed when people don't show up to lecture. Also, she's really great to talk to in office hours. She was more than happy to talk to me about my paper and guide me through it.\nWorkload:\ntwo 5 page papers for midterm (take home). Same for final (not cummulative). 8-10 page paper.\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "November 16, 2002",
            "review_content": "\nShe seems incapable of staying on topic. Lectures were a waste of time. Her views about media are very European at best and fascist at worst. Save time in your schedule and take another class.\nWorkload:\nEasy, but not very interesting if you have any background in the subject / live in America.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 20, 2002",
            "review_content": "\nIt's no wonder that the people who didn't like her class had stopped going to her lectures. Since her exams rely heavily on lecture material, they probably weren't too happy with their grades. Attend, take good notes, and you will do well. She is a well-spring of both american and international politics. She is a clear, organized lecturer and she provides lecture notes. She makes it very clear just what she wants to cover, will stop to reiterate if she has wandered from the main subject of if it's just taking a long time to get through, and will sum up the main points at the end. Her depth of knowledge is perceptible on almost every subject; no matter how seemingly mundane, she knows the history, the controversy, the cases all almost up-to-the-minute basis. She takes class participation very seriously and will give you more in info., both in breadth and depth, than you ever imaged existed on a given subject if you ask a question in class or post on the board. She draws primarily on famous or controversial authors, and what they have to say about a given subject, and on relevant legal cases (their history, outcome, and ramifications) - none of which you will find in the book. So if you want someone who simply outlines the book, then take a correspondance course. This woman has decades of experience in journalism, law, and political science and it shows. And to top it all off, her exams are really straight-forward. If you attend class and section you will get an A.\nWorkload:\nFairly light. A chapter from the text-book (sometimes two) and a few articles a week. Go over with the TA what they expect you to know so don't end up focusing on one when they are on the other but otherwise, it's pretty straightforward.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "September 09, 2001",
            "review_content": "\nIf you enjoy counting \"uh\"s and writing down everything your prof says because you have no clue what's relevant and what isn't, this class is for you. I'd like to second another reviewer who said this class really isn't about American Politics, but about extremist groups and the media, her area of expertise which she manages to work into every class. Discussion sections were absolutely all that kept the subject matter of this class together, but lectures were thoroughly incomprehensible. I did none of the reading (except for the soul-crushing book for the paper) and stopped going to lectures after two weeks, and was none the worse for it. Maybe try her for a class in her expertise.\n"
        },
        {
            "course_name": "Introduction to American Politics",
            "review_date": "May 06, 2001",
            "review_content": "\nAn ill-advised choice. Nacos' tests are almost completely based on her lectures, which are boring and essentially unendurable. She is not interested in teaching an Intro course to american politics - instead she enjoys talking about her specialty of the media, and asking test questions that are too difficult for an intro course and are more related to sociology than political science. All the grading is done by the TA's, who, like all TA's, are unaccountable and seem to enjoy it.\nWorkload:\nNot much. Reading is light (especially for a poly sci class). Midterm, Final, 8 page paper.\n"
        },
        {
            "course_name": "Mass Media and American Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nExcellent, excellent, excellent. That is, she's a goddess if you're the go-to-class-and-take-notes type. Her lectures are intersting, full of anecdotes and examples, and she is extremely well-spoken. I didn't do a single reading and I got an A because I attended every lecture and took extensive notes. However, if you're the sleep through class type, then you're screwed - her exams are based almost entirely on her lectures.\n"
        }
    ]
}