{
    "prof_info": [
        {
            "prof_name": "Christopher Blattman",
            "prof_id": 12610,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Political Economy of Development",
            "review_date": "March 23, 2015",
            "review_content": "\nThis was an excellent course. Blattman managed convey exactly why development is so interesting by demonstrating how it's at the intersection of many, many fascinating subfields. The scope of the course is enormous, but the readings are well-chosen and I felt as though I'd ultimaetly read at least a bit of the key literature in every he discussed. Blattman's lectures were engaging, he was always well-prepared for class, and he clearly knows the material incredibly well. Perhaps most importantly, he did an effective job of connecting niche research projects to broader trends in the field and deep philosophical questions about development.  \nThat said, this class could be way, way better if Intermediate Macroeconomics or even just Principles of Econ were required as prerequisites. Watching Blattman -- who has a PhD in economics -- explain simple macro concepts to people who just haven't taken any econ was painful. If you know some econ beforehand, you will get significantly more out of this class.\nThe TA's for this class were terrible across the board, through no fault of Blattman's. They did not know the material and at times they took months to return assignments. My TA in particular would regularly cancel section because she overslept -- but that's okay, because section was pretty useless anyway. \nBut forget about the TAs. Take this course! I've used what I learned there in every econ and political science class I've taken since. \nWorkload:\nLots of reading, but all worthwhile if you're interested in the topic. About six short papers which everyone puts less and less into as the semester wears on. \n"
        },
        {
            "course_name": "Political Economy of African Development",
            "review_date": "February 04, 2013",
            "review_content": "\nDefinitely one of the best classes I've ever taken at Columbia, and I had the feeling most people thoroughly enjoyed it too. I wish I had the time to write a more comprehensive review praising the content of the course, as well as Blattman's ability to teach and engage students.\nBlattman's lectures are brilliant, engaging and entertaining. They are a thorough and unbiased introduction to recent African political and economic development, and the relation between development and violence, international institutions, foreign aid, domestic politics, geography, among other factors.\nThe course assumes for the most part no previous background in economics, statistics or political science for that matter. Nevertheless, I found it to be a better introduction to international development than my Development Economics course.\nThis is one of those classes you walk out of every day and realize how much you've just learned. The readings are also fascinating. I highly recommend it to anyone mildly interested in politics, development economics, developing countries, sub-Saharan Africa or any intersection of these topics.\nWorkload:\nManageable. Weekly readings (probably the heaviest part of the course), weekly 2-page assignments (but you were only required to complete 6/11 of them, so every other week in effect). One Excel economics-focused assignment on the second week that scared a few students away but was relatively easy if you have some econ or sustainable development background. The most challenging part of the class was the final exam, simply because of the way it was structured. Blattman gave us ~14 prompts in advance and said 3-4 of them would be on the final. We did have the right to bring a cheatsheet to the final, but that inevitably led to some really intense cramming and summarizing the few nights before the exam.\n"
        }
    ]
}