{
    "prof_info": [
        {
            "prof_name": "Obayemi Onafuwa",
            "prof_id": 1803,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 08, 2007",
            "review_content": "\nYemi was awesome. He was smart, engaging, and made sure that the whole class participated in the discussion of an artwork. Although he would cold call sometimes, this made the class fun, because he would guide you in the direction of critiquing a piece, and from that you learned how to comment on art. The class was always fun to go to -- rarely did people skip. One of the best parts was the workload--\nactually there was none, just some recommended readings, which I did, because there was no other work. His museum tours were additionally enlightening and fun (where else would you get this opportunity?). He had a great sense of humor, and connected with most people in the class. All in all we learned a lot of information in a genial atmosphere with no pressure. Take him!!\nWorkload:\nNONE! midterm, final. easy to study for.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 08, 2007",
            "review_content": "\nYemi was awesome. He was smart, engaging, and made sure that the whole class participated in the discussion of an artwork. Although he would cold call sometimes, this made the class fun, because he would guide you in the direction of critiquing a piece, and from that you learned how to comment on art. The class was always fun to go to -- rarely did people skip. One of the best parts was the workload--\nactually there was none, just some recommended readings, which I did, because there was no other work. His museum tours were additionally enlightening and fun (where else would you get this opportunity?). He had a great sense of humor, and connected with most people in the class. All in all we learned a lot of information in a genial atmosphere with no pressure. Take him!!\nWorkload:\nNONE! midterm, final. easy to study for.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 14, 2004",
            "review_content": "\nOne of my favorite classes at Columbia.  He was engaging, well spoken, and helped us learn about and enjoy an amazing collection of works.  Although some previous reviewers have shelled him for being condescending in class, I found his conduct to be quite the opposite.  For example, there was one student in my class who was consistently (even agressively) wrong, and yet had a penchant for hearing his own voice.  Instead of hanging him out to dry, Mr. Onafuwa corrected this student and others as gently as he could.  Whereas I might have snapped at this guy, Yemi was always patient.  Another aspect of his teaching for which he has been wrongly harangued is a heavy workload and unnecessary amount of reading.  Though the reading is suggested, one was never evaluated on having done it.  Class discussion was based on the slides in front of us, the professor's presentation, and any additional outside input from students (usually not from the reading).  Also, seeing as the only other grades in class were a participation, midterm, and final,  there was no way I can possibly find a way to complain about the workload.  If you come in ready to learn and to participate, having spent at least a little time with the works before class, this will be a great class for you.\nMy class seems to have had a much more enjoyable time with Mr. Onafuwa than some of the previous ones.  All other things being equal, I feel like he has gone from a knowledgeable but unaproachable professor to one of the best instructors you could hope to land in this course.\nP.S.  Never refer to Picasso simply as \"Pablo\" in class.  People like you deserve to be made fun of.\nWorkload:\nSuggested but optional reading outside of class,  Midterm, optional paper, five minute presentation on a particular work, Final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 29, 2004",
            "review_content": "\nI would definately skip this professor if possible.  In my opinion, He is basically a snob who looks down on all of his students.  He gets great joy out of trying to make you feel stupid.  Even if you go to all of the classes and study a lot, you will not do well unless you have an art background.  He will tell you that the tests will be a reflection of classwork... its a lie.  He will find some obscure detail you merely brushed over and then have you write an essay on it.  Find a kinder way to complete this requirement if at all possible!\nWorkload:\nZero.  One midterm. One final.  No readings.  No papers.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 13, 2004",
            "review_content": "\nI cannot figure out the reviews below. Perhaps Onafuwa had a life changing experience, because his class was easy and fun. No papers, no reading. midterm, final that are simply ids and comparisons. he actually made art hum quite good. take him if you get a chance\nWorkload:\nNONE! No papers, no reading! just a midterm and final which require a day or two of studying\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2004",
            "review_content": "\nMr Onafuwa is an engaging and brilliant instructor. He obviously knows his stuff, and he expects a lot from his students. You will learn a lot from his class, but  don't expect to get an easy A. If you want an easy class where you don't have to participate or do any reading THIS IS NOT  THE SECTION FOR YOU!\nWorkload:\nFair - Moderate to  heavy. Do the reading. Midterm and Final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 13, 2004",
            "review_content": "\nIf you get into his section, DROP IT OR SWITCH TO ANOTHER SECTION. Don't get me wrong he explains the material VERY well and you will learn alot, but he has to be the most condescending instructor I have ever had in any subject ever. He will pick on everyone in class and call on you for answers or interpretation whether you like it or not. If you look like you haven't done the reading, he will DEFINITELY pick on you.  He constantly makes , in my opinion, defamatory comments to people he does not like and that usually means everyone (unless you declare that you are an art history major and show it, then you will get the red carpet treatment). Mr. Onafuwa has absolutely no regard for the feelings of his students or for views that conflict with his own. DONT EVER BE ABSENT because you have to call his house and present a logical excuse that he will follow up on and your grade will suffer if you do not attend. You have to do all of the readings when he says to do them because he questions everyone in class and if you don't know the answer you will be ridiculed and penalized for it. It is like being in junior high school again with his constant babying and criticizing of everyone. Ever need an extension on work or a paper? TOO BAD, you will not get one here even if one of your parents died, if by some stroke of magic you do, it will come with the appropriate lecture and belittling. If by some crazy turn of events that you have to take his section or want to take it, you had better hope you step in dog s**t because ur gonna need good luck to live through his pompous personality. \nWorkload:\nHEAVY! More reading than any other art hum section that I have encountered. DO THE READING because he asks about it in class and it WILL BE ON THE MIDTERM AND THE FINAL. Midterm and Final Exams are of medium difficulty, he will test any slide he has ever shown you, so make sure you write them down because there will over a hundred to choose from for each exam (the final is not cumulative). Two 5-page papers, decent topics, not graded too harshly. 1-2 response papers on LONG readings. HAVE FUN! And one thing, don't ever insult Bruegel in front of him\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 07, 2003",
            "review_content": "\nMr. Onafuwa is young and puts on airs of worldliness (he is \"worldly\" in the traditional sense--he's Nigerian and lived in Europe for a good part of his life--but he's also very condescending) that definitely turn some students off. But he is a very good art hum lecturer. All you really need to do for the class is memorize, and he can definitely make you do that. The papers are the only place where you have to be insightful, even the long-answer test questions are just memorization of the symbollism he points out to you, but he grades those pretty easily.\nSometimes a very nice side shines through but don't be fooled because all throughout class he will try to \"keep you in line\" by catching you off-guard and putting you on the spot. So be sure to do the readings and LOOK AT THE WEBSITE so you don't look like an idiot in class.\nWorkload:\nreadings, two 5-page papers, one or two short response (1 page) papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 19, 2003",
            "review_content": "\nAhhhh, what can I say about Mr. Onafuwa....he's not great. The man apparently knows his s**t, but he can be very condescending. When I was in his class, I sometimes felt like I was in junior high school, where the teacher would baby us as far as homework and readings. Maybe if he'd lighten up a bit, his students would actually care. The assignments and tests were very fair, but his sometimes arrogant, haughty attitude made me just get up and leave the class. His behavior may be because this is his first year teaching a class, but he needs to learn how to loosen up a bit. All in all, he's not bad, but pick another teacher if you have the chance.\nWorkload:\nLight written responses, two 5-page papers, readings (which most people DON'T do, but I suggest that you do b/c it will appear SOMEWHERE on the test), midterm & final\n"
        }
    ]
}