{
    "prof_info": [
        {
            "prof_name": "Sheldon Weinig",
            "prof_id": 913,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Manufacturing Enterprise",
            "review_date": "May 01, 2005",
            "review_content": "\nWonderful. Professor Weinig is a retired businessman and an ex-VP of Sony America. He will guide you through the manufacturing business, and how it's like to be an entrepreneur in the material industry. You'll learn a lot of random yet valuable lessons you cannot find in textbooks. \nIf you seriously want to learn about manufacturing enterprise, this is the course to take. If you just want to get an A and get a nice job at Goldman, maybe not. \nWorkload:\nQuite light. But grading is tough\n"
        },
        {
            "course_name": "Manufacturing Enterprise",
            "review_date": "December 15, 2004",
            "review_content": "\nA wonderful professor, with a lot of interesting experiences/lessons. If you are in interested in any type of business/management, you should definitely consider taking a class with prof Weinig. The grading is tough, but I have learned from this course much more than any other courses in IEOR department. \nWorkload:\nFair: Weekly Reading/Summary, midterm, final paper. (10 pages)\n"
        },
        {
            "course_name": "Manufacturing Enterprise",
            "review_date": "January 19, 2002",
            "review_content": "\nDon't be mislead by reviews that were done before final grades came out! The class is great, but grading is quite tough. I personally thought the class was the best management/business class I have had-- the professor is quite knowledge, witty, no bullshit. Fantastic, enjoyable class. But, even if you know everything and the class isn't hard-- the grading is ridiculous. He doesn't give Columbia Students credit. Student feedback is nill till you get your low final grades. I worked, participated in class, had the right answers-- but got a B.\nWorkload:\nNot bad at all. Quite an easy, interesting class.\n"
        }
    ]
}