{
    "prof_info": [
        {
            "prof_name": "Geoffrey Jehle",
            "prof_id": 3474,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "June 12, 2008",
            "review_content": "\nProf. Jehle is a visiting professor from Vassar.  He has a bit of a dry demeanor, for instance: he has a horrible habit of writing really small on the chalkboard, and when asked to write larger by members of the class, he just acts flabbergasted and offended and refuses to change his writing.  But at the same time, during lectures he does make an effort to crack some jokes and make microeconomics relevant to real life, so he deserves some credit for trying to liven up material that, unless you're a microeconomics geek, is dreadfully boring.\nHis use of Courseworks is brilliant too, definitely the best I've had at Columbia in terms of offering online study resources.  He provides online multiple choice reviews that practically mirror the homework questions and midterm/final, which was great for studying.  It was to my detriment that I didn't take advantage of them until the last few weeks of class: I got a 60% on the midterm because I was a real slacker, but I aced the final after studying properly.  In his lectures he does use different methods from the textbook, so if you skip many lectures like I did, your ability to do problem sets and perform on tests will be degraded accordingly.  The textbook by Nicholson/Snyder was pretty useless for tests and problem sets due to being so topic-based and theoretical rather than quantitative, but it does a decent job of explaining the ideas behind micro.\nHe has a somewhat generous grading system, where if you show improvement and overperform on the final, he weights it more than indicated on the syllabus.  I was given a B final grade despite turning in miserable/incomplete problem sets and a horrible midterm, because I studied my ass off and aced the final.\nWorkload:\nSix problem sets (15%), midterm (40%), final (45%).  Percentages may be curved if you show improvement on the final.\n"
        }
    ]
}