{
    "prof_info": [
        {
            "prof_name": "Xiangwen Zhang",
            "prof_id": 11930,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "June 16, 2015",
            "review_content": "\nXiangwen Zhang is a decent professor. Yes, his accent sometimes makes it difficult to understand his words. However, I don't think that really detracts from his actual teaching abilities. He's very clear & thorough with his explanations. Of course, since this is a math class you can get by without going to class and just reading the textbook, but I often found his lectures were more helpful than the textbook.\nProblem sets every week, usually assigned weeks before they're actually due. No WebAssign (thank goodness). Usually not that long & not a lot of work.\nHis exams are very straightforward. He has practice exams on his website, and almost identical problems show up on the actual exam. Also, if you only go to one class per exam, go to the review sessions. He'll give answers to the practice exams, but he DOES NOT put them up online. If you don't go to the review, you're not going to have answers. As long as you go over your problem sets and the practice exam, the exams shouldn't even register as a problem. \nHe really does want his students to do well. The class bombed the first midterm, avg 21/40 (which made absolutely no sense to me since it was literally the practice exam with different numbers). He adjusted the second midterm so it was much easier and everyone did much better.\nThis isn't a hard class, and again, you can always teach yourself from the book. Would definitely recommend.\nWorkload:\nProblem sets - 15%\nMidterm 1 - 20%\nMidterm 2 - 25%\nFinal - 40%\nCurves to B+\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "May 17, 2015",
            "review_content": "\nI had a great time in analysis with Zhang- for an 8:40 upper-level math class, this is really saying something! Although the material had the potential to be hard, Xiangwen was really clear and made following his proofs as easy as possible. Especially in analysis II, where the topics are used regularly in other fields, he did a great job of motivating the material. \nPerhaps because the quality of the textbook (Rudin) deteriorates in the second half, Zhang did things his own way a lot in the second semester, giving different and often better proofs and instruction than Rudin. Accordingly, he also wrote a lot of the problem sets in analysis II instead of assigning book problems. For this reason, I liked the second semester better than the first since Zhang's mathematical personality started shining through.\nThe main problem with the class was pacing. In the first semester, we were supposed to get through chapters 1-7 in Rudin, but got only through 6. A chapter behind going into the second semester, there was a real time crunch towards the end and Zhang had to rush through the last two chapters. We spent but a single day on differential forms, which was the topic I was most excited about. It was a shame that the treatment of measure/Lebesgue theory was so light because a lot of the work we did for the Riemann integral (function spaces, Holder inequality, etc.) was obviously leading up to the idea of the L^p space.\nThe exams were very fair. The first few questions were True/False with justification, which were normally pretty straightforward. Zhang also always put a couple of questions that were either identical or very similar to HW/practice exam problems, so you are definitely rewarded for doing the work on your own. The averages were quite low, generating a large curve, so one could do quite well on the exams just by doing these easiest problems well, though no questions were impossibly difficult.\nWorkload:\nVery Manageable. The weekly problem sets have 4-5 mandatory questions but generally only 1 or 2 require substantial effort. He also provides optional practice problems on every problem set that are great for studying from (Hint Hint).\n"
        },
        {
            "course_name": "Calculus IIIS/IVA",
            "review_date": "April 27, 2015",
            "review_content": "\noh. my. god. by any means do not take this dudes class. I just....i can't even explain to you the degree of...oh my god just no. \nListen, i have no idea what any of these other reviews are talking about, Xiangwen sucks at teaching. You will learn zero. Nada.  Objectively speaking, as diplomatic as I can say this...you will not understand anything that is said or written.  If the words spoken from his mouth could be written into words it would be the sloppiest most incoherent handwriting ever conceived. Highly unorganized in every matter there is.  The board is an absolute mess 3 minutes into class and he will take no time to elaborate. \nHe also does a lot of *writes really long equation on the board* says \"okay this is the type of problem that will be on the midterm.\" *writes the answer right below it* \"This is the answer but uhhh im not gonna show you guys how to do it you can figure it out yourselves\" \nYou won't learn shit.\nWorkload:\nProblem set every week.  I literally copy it number for number off line and it has never taken me less than an hour and a half to do so...imagine if i actually tried to figure it out. Crazy amount of work\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "May 01, 2014",
            "review_content": "\nOverall Xiangwen is one of the best professors I've had at Columbia so far. This was his first year teaching the course (and any course I believe) and this seemed to affect his pacing of the course material at times (we spent way too much time on chapter 1 in Analysis I and had to rush at the end), but otherwise he did a great job.\nXiangwen's lectures are clear and easy to follow and he tries to both explain the motivation/significance for the theorems he proves as well as make sure students understand the argument itself. He is also nice and easy to talk to during office hours and usually responds within ~12 hours to emails. \nFor homework he assigned 3-4 problems to be graded each week and typically 2-4 more as practice. I personally rarely did the practice problems when they were assigned, but instead used them as study problems before exams. The exams themselves were moderate. He bases them a lot on the practice exams he posts and the homework problems so if you study those carefully and really understand them you should do well. \nWorkload:\n3-4 graded problems a week. Difficulty varies, but typically 2-5 hours of work. 2 midterms for Analysis I, 1 for Analysis 2. \n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "December 31, 2013",
            "review_content": "\nExcellent professor. Excellent and thorough teaching. Prof Zhang deserves many plaudits for managing to make an inherently difficult subject much more accessible without diluting any of its content.\nThe course material follows Rudin (standard intro to modern analysis textbook). It helps tremendously to attend each and every lecture. It is much easier to learn from Prof Zhang's lectures (and also his office hours) than by spending hours deciphering the enigma that is Rudin. You will be grateful for that.\nWorkload:\nQuite reasonable. 3 problems a week.\nExams are reasonable. The practice exams are very helpful for preparing.\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "December 01, 2013",
            "review_content": "\nModern Analysis I is hard as balls, and you're going to struggle regardless of who's teaching it. Study hard and learn to forget about your grades during the time you're taking it.\nThat being said, Xiangwen Zhang is fresh out of his PhD program at McGill, and someone thought it would be a fantastic idea to have a newbie teach one of the harder upper-division courses in the Math department. \nI don't say this to put down Zhang, as he is one of the nicest, most approachable profs I've seen at Columbia so far. He WILL take the time to teach you something again during office hours if you let him know you're struggling. However, his freshness showed and I think it seriously hurt a few people who decided to take the Analysis sequence before the Algebra sequence (read, people who've taken Calc I-IV, Linear Algebra, and ODE and figured Analysis was the next logical step in the major).\nA major problem with this course lies with the nature of the material and the students themselves: HW assignments tend to be 3 questions long, all including fairly involved proofs. WITHOUT FAIL, people COPIED these proofs off the internet and tried to wing it during exams, which WILL NOT WORK.\nExams however, followed practice exams closely. A good way to prepare for exams is to figure out the practice exam thoroughly, and proceed to manipulate the premises of each question to see how answers differ as a result. Do this, and you should have an A- (like I do so far, and trust me, I am not all that good compared to other people in the major).\nNote, Zhang will bump the class average to a B+/A-, so heed his advice and study to LEARN, not racking up perfect problem sets, or you will surely SUFFER.\n\nWorkload:\nWeekly, very challenging, 3-question problem sets with 3 optional questions (no credit for those, but they help)\n3 exams, all challenging, all follow practice exam closely\n"
        }
    ]
}