{
    "prof_info": [
        {
            "prof_name": "Roberta Casagrande-Kim",
            "prof_id": 2575,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "June 07, 2005",
            "review_content": "\nI don't like 9am classes.  I don't like memorizing things.  I'm pretty sure that I may not even like art all that much.  But I really enjoyed this class.\nCasagrande's teaching style is ideal for ArtHum---she works very hard not to be boring, not to lecture for extended periods of time, and tries to engage the class.  Even though the class is mostly spent in the dark, I never fell asleep (a huge achievement for me).\nShe may initially seem a bit crazy and demanding (an email before the semester began announcing presentations on the second day of class was a bit frightening), but she grows on you very quickly.  While her accent may take some getting used to, you soon come to expect certain not-quite-English phrases, and she doesn't take herself or her mistakes too seriously.  \nThe courseload is a bit more demanding than what seems to be the norm in ArtHum, but the reading is always pretty helpful, and you definitely don't have to do all of it.  It's useful for the three papers, which are all interesting and open-ended, but you won't be tested on it.  She really makes you  take advantage of the NYC resources and is especially good at helping you tie very different artistic pieces and ideas together.  \nOverall, I'd say that RCK puts a lot of work into this class, and you'll probably get a lot out of it.  You can't get much better than this.\nWorkload:\n3 papers (5-6 pages each), midterm, and final.  Weekly reading if you so desire.  Be careful with the tests though, it's a lot to remember...while most teachers go in depth on about a dozen pieces per artist, RCK requires you to know about twice as much...but it's still definitely reasonable, even for someone who procrastinates and then crams the night before....\n"
        }
    ]
}