{
    "prof_info": [
        {
            "prof_name": "Elizabeth Castelli",
            "prof_id": 272,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "History of Early Christianity",
            "review_date": "May 26, 2015",
            "review_content": "\nProfessor Castelli is one of the best professors I have encountered at Columbia University. I think I am not alone in this opinion given the number of students who have taken her more than once.\nAs a person and a Professor, Castelli is more interested in teaching and you learning then getting caught up the minutia of you knowing every text and detail by heart. She understands that we have a significant workload and wants to help her students succeed in the class. This does not mean she lets us off or out of work, but that throughout the semester she works with us and is flexible. She expects a lot out of her students, however none of it is unreasonable and I probably learned more efficiently in her class than any other. \nI came to this class with ZERO knowledge of Christianity or religion, of the history of the period we were looking at or the cultures. In that way I was way behind my classmates, however Castelli made the subject approachable and engaging. She focused on a very palatable cross section of the period that was not overwhelming and then asked thought provoking questions that really encouraged us to bring these ideas together in a way that made sense to us.\nIn addition Prof. Castelli is kind and very generous with her time – eager to know her students and help them. Her classes are enjoyable. The end result is that even those texts that I did not get to read entirely during the semester I will read on my own because she sparked my interest.\nI have read some less then favorable reviews of Prof. Castelli and I am somewhat baffled. Yes she has strong opinions on some topics but none of them were alienating and she really encouraged students to bring their own ideas and experiences to the table. Our class was made up of Jews and Christians of various strains. We went through some very touchy and at times difficulty materials and at no time did anyone get offended or ostracized.\nI think Castelli is the sort of teacher who attracts rather than promotes and highly recommend her.\nFor full transparency I received an A- in this course.\n\nWorkload:\nLots of reading and weekly responses (about 500 words)\nTwo papers (1500-2000 words)\nFinal exam\n"
        },
        {
            "course_name": "History of Early Christianity",
            "review_date": "May 26, 2015",
            "review_content": "\nProfessor Castelli is one of the best professors I have encountered at Columbia University. I think I am not alone in this opinion given the number of students who have taken her more than once.\nAs a person and a Professor, Castelli is more interested in teaching and you learning then getting caught up the minutia of you knowing every text and detail by heart. She understands that we have a significant workload and wants to help her students succeed in the class. This does not mean she lets us off or out of work, but that throughout the semester she works with us and is flexible. She expects a lot out of her students, however none of it is unreasonable and I probably learned more efficiently in her class than any other. \nI came to this class with ZERO knowledge of Christianity or religion, of the history of the period we were looking at or the cultures. In that way I was way behind my classmates, however Castelli made the subject approachable and engaging. She focused on a very palatable cross section of the period that was not overwhelming and then asked thought provoking questions that really encouraged us to bring these ideas together in a way that made sense to us.\nIn addition Prof. Castelli is kind and very generous with her time – eager to know her students and help them. Her classes are enjoyable. The end result is that even those texts that I did not get to read entirely during the semester I will read on my own because she sparked my interest.\nI have read some less then favorable reviews of Prof. Castelli and I am somewhat baffled. Yes she has strong opinions on some topics but none of them were alienating and she really encouraged students to bring their own ideas and experiences to the table. Our class was made up of Jews and Christians of various strains. We went through some very touchy and at times difficulty materials and at no time did anyone get offended or ostracized.\nI think Castelli is the sort of teacher who attracts rather than promotes and highly recommend her.\nFor full transparency I received an A- in this course.\n\nWorkload:\nLots of reading and weekly responses (about 500 words)\nTwo papers (1500-2000 words)\nFinal exam\n"
        },
        {
            "course_name": "Early Christianity",
            "review_date": "December 17, 2007",
            "review_content": "\nThroughout the course of every class meeting I slowly felt the will to live drain out of my body. The readings were terribly dull, the lectures never ending. A few classmates who thought they knew everything tended to take  over the class every once in a while and yap for what felt like hours, which the professor seemed to encourahe. Not at all worth the $3000+ I paid for it. If I wanted to hear the opinions of a bunch of clueless kids trying to seem smart I'd sit in Lerner Hall at lunchtime. \nWorkload:\nWeekly response papers, never ending readings, two insanely difficult short essays, and a final \n"
        },
        {
            "course_name": "Gender in Ancient Christianity and New Testament Introduction",
            "review_date": "May 10, 2005",
            "review_content": "\nProfessor Castelli is an asset to the Columbia University community and she is one of the many reminders why we are so privledged to be at this institution.  She is very knowledgable in a range of different fields such as Early Christianity and Women, Feminist and Gender Studies and expects her students to give 100%.  I advise anyone who is not willing to put a 100% effort into any of her classes, to avoid taking a class with professor Castelli, because it will reflect in your grade. She is a tough (but fair)grader but like I said before, if you do the work, show a sincere interest in the topic, and have enough respect to show up to class everyday and participate, you'll appreciate Professor Castelli for the great instructor she is. \nWorkload:\nNew Testament Introduction: 2 papers, weekly response papers and a final.  Gender and Ancient Christianity: weekly response papers, a presentation, and one final project\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "December 27, 2004",
            "review_content": "\nI have to disagree with some of  these negative reviews here. I came into this class with almost no background in Christianity other than random knowledge picked up from literature, art history, and popular culture. This was pretty much the first time I had ever read the Bible, and not only did I understand what was going on, I also found myself more and more fascinated by a text I'd always thought was irrelevant to my intellectual life. \nThe previous poster seems to see Prof. Castelli's emphasis on historical context as some sort of a \"debunking\" project that works against theological interpretation. I, however, do not think her approach is nearly that reductive or simple. This culture is very much steeped in the intellectual traditions of different Christian theologies, so any reader will come to the Bible with countless unspoken assumptions about what the text is and how it is \"supposed\" to be interpreted. But a lot of these interpretive strategies are fairly modern inventions (like, for example, the Lutheran idea of \"plain sense\") and don't reflect how early Christian communities viewed these texts or how the writers of the New Testament interpreted the Hebrew Bible. I got the impression that Prof. Castelli's emphasis on historical context was not an attempt to discount the various theological readings that hold sway right now, but more of an attempt to get students to see that those readings are not the only possibilities that the text allows. And in a political context in which the Bible is so rhetorically influential, questioning the assumptions surrounding it is pretty important work. \nIn the end, this class felt like the most politically relevant class I've taken in a long time. Some lectures, admittedly, were more interesting than others, but the New Testament actually makes for surprisingly exciting and interesting reading, and I do feel like I now have a fairly solid background in New Testament interpretation and the roots of Christian theologies. Prof. Castelli was fabulous to talk to in her office hours and really a very nice, friendly, approachable professor. So look- if you are a Christian, this class may very well challenge views that you might have thought were a given. But challenging is not at all the same as seeking to discredit, and isn't intellectual challenge what college is supposed to be about?\nWorkload:\nA lot of reading. Weekly response papers, two essays, and final exam.\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "December 22, 2004",
            "review_content": "\nI came into the class expecting a focus on the New Testament as both a historical and a theological document & got only the former -- so was disappointed right from the start.  That said, the historical focus itself was problematic.  First, the scope was far too broad and anyone who didn't already know a lot about early Christianity was completely lost by the third class.  Second, there was no coherent theme whatsoever throughout our reading of the New Testament except maybe the constant desire to prove the text not historically accurate.  To add to this, Castelli had no control over the class and about half way through each session her lecture would be entirely derailed by some completely off-topic question.  As a professor, Castelli is very nice & very boring and, above all, well-intentioned.  Overall, I felt like I learned very little & was entirely baffled by a professor -- and a group of students, apparently -- who would rather talk about the ancient Greek derivatives of words than the theological significance of the New Testament, especially at a time when those theological ideas are of such influence in the country at large.\nWorkload:\nLots of reading, most of which will never be mentioned in class, two ~2000 word papers of average difficulty, an extensive final.\n"
        },
        {
            "course_name": "History of Early Christianity",
            "review_date": "May 09, 2003",
            "review_content": "\nI think she is an amazing professor and this is the best class i have taken so far at Columbia or Barnard. I actually looked forward to going to each class because her lectures and our discussions were so interesting and fun. You do a lot of reading, but it is definitely worth it and I learned a lot. She is very approachable and nice. Take this class!\nWorkload:\nLots of reading, response papers each week, two long papers and a final\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "December 31, 2002",
            "review_content": "\nThe above students are mistaken and idiotic. This is a gem of a professor. Intrigued, not partial! knowlegdeable, very approachable, and interested. I learned a great deal. At the very least, you read all of the New Testament with guidance, the Gospel of Thomas, the \"Q,\" and parts of the Mishnah and Old Testament. \nWorkload:\nA lot of reading, though well worth it. A tough midterm of recognizing passages (graded by overachieving TA's) and  a less harsh final + ~15 page paper.\n"
        },
        {
            "course_name": "History of Early Christianity",
            "review_date": "December 17, 2002",
            "review_content": "\nInteresting exposure to early Christian texts, but when I say exposure I mean only that. Lecture had very little structure, and while that meant a lot of time for discussion, it also meant feeling like I didn't learn very much and being pretty bored in class most of the time. Professor Castelli is very accomodating and kind but it was hard to get into her class because a lot of the readings were deathly boring and she gave them little historical or social context which may have made them more exciting. If you don't know anything about Christianity, this class will probably only confuse you since the whole point of early Christianity is that it is diverse and multi-faceted and not-yet canonized. Luckily, the course was not too demanding aside from doing the reading.\nWorkload:\nWeekly reading response papers, 2 longer papers, final exam. Lots of reading but you don't have to do it all, especially the secondary source materials.\n"
        },
        {
            "course_name": "Intro to New Testament",
            "review_date": "December 05, 2002",
            "review_content": "\nLet me just start by saying that she is one of the worst lecturers I have had at Columbia. I decided to take this class because I thought it would be good to learn more about Christianity but instead learned that it is possible for someone to hate and dread going to class(especially at 9am). I should have known from the first day and dropped the class but I thought she still had hope. If you want a class that you will learn and benefit from - stay away from Castelli. It was worthless going to class and I feel that I learned nothing except on my own. PS. She can be a tough grader which made the class even worse.\nWorkload:\nMidterm, Final and a Research paper \n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "November 22, 2002",
            "review_content": "\nOhhhhh man, biggest mistake not dropping this class the first day. Class is UNBEARABLE with idiotic commentary. Castelli is so obvious in asserting her feminist ideology that it's EMBARRASSING. There is no attempt at a straightforward reading. Classes are attended minimally. The room fills up for midterm and final which, out of the blue in such a joke-class, are very very difficult. No kidding, worst class I've taken in three years. DON'T DO IT!\nWorkload:\nmidterm, final, term paper on topic of choice (kind of)\n"
        },
        {
            "course_name": "New Testament",
            "review_date": "November 15, 2002",
            "review_content": "\nProf. Castelli is an awesome professor! I don't understand what others who have posted reviews of her are talking about. Her lectures are incredibly well organized and exciting. I already knew alot about the New Testament, but she really helped me understand the history behind it and how people use the Bible in different situations to make their points. She read our papers herself and gave alot of comments, not just a grade with a generic note at the end (unlike alot of professors). I recommend her to anyone who really wants to be challenged and to learn.\nWorkload:\n2 exams and a paper\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "October 30, 2002",
            "review_content": "\nI was unfortunate to have this woman teach me about Christianity and the New Testament. Not only was the class at 9 in the morning but Castelli is just not one of the best lecturers there is. I agree with the comment made - do bring a pillow to class because at least that way you will be comfortable while you sleep, that's if you make it to class. I dont feel that I learned anything and it wasnt because I didnt try. If you want to learn about Christianity try another professor. \nWorkload:\nThere was a considerate amount of weekly readings. A midterm, final, and a research paper.\n"
        },
        {
            "course_name": "Intro to the New Testament",
            "review_date": "September 30, 2002",
            "review_content": "\nPathetically disappointing after a semester with the god also known as Robert Somerville. If you're so unfortunate as to miss the drop date, I recommend passing class time trying to decern Castelli's personal religious beliefs. You'll be as entertained as you're ever going to be. Don't forget that pillow!\n"
        },
        {
            "course_name": "Millenium",
            "review_date": "December 31, 1999",
            "review_content": "\nThank god this class is not offered anymore. Run for cover. She has a cult following, God knows why, of eager Barnard students who essentially run the class and discussion for her, because she comes to class with nothing of relevance to say. Readings are dense, irrelevant, and boring beyond comprehension. Bring a pillow, forget your notebook, and in fact, don't even both showing up at all.\n"
        }
    ]
}