{
    "prof_info": [
        {
            "prof_name": "Shinji Sato",
            "prof_id": 3318,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 12, 2008",
            "review_content": "\n\nThe best teacher I had this year.\nI would recommend Satou-sensei to anyone.\nFrom the first day, he kept the class upbeat and interesting with his quirky teaching style and boundless energy.\nSatou sensei is willing to meet with students anytime to help them out, even outside of office hours, and he increases his office hours before tests so that students feel free to contact him, and don't feel like they're imposing.\nThe workload can be pretty tough (it is a five-credit course), but the amount you'll learn in one semester will blow you away, and you'll leave this class feeling wonderful about how much you know.\nIf it is in any way possible, try to get into Satou sensei's class.\n \n\n\nWorkload:\nPretty tough. Worksheets and quizzes every day, a test every few weeks, a large group project due at the end of the semester, weekly blog entries in japanese, two different writing systems learned in the first month, and lots of vocabulary. Basically, what you'd expect of a five-credit language course. Don't be intimidated; it's well worth it.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 04, 2007",
            "review_content": "\n\nSato-sensei is one of the most enthusiastic teachers I have ever had. Every day of class is fun and inventive, and Sato-sensei is always willing to answer off-topic questions and has even supplied sushi on occasion! Sato-sensei is the kind of language teacher you hope for because he has a way of making you want to know more about Japanese culture and the Japanese language. Everyone I have spoken to in my class  has tried to get into Sato-sensei's class next semester, and it is obvious why.\n\n\nWorkload:\nFirst-Year Japanese 1 is a 5 credit course, and they aren't kidding when they say it requires two hours of outside work a night. But the content is really interesting, so it feels like it goes pretty fast most nights. The classes make the homework worth it.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 04, 2007",
            "review_content": "\n\nSato-sensei is one of the most enthusiastic teachers I have ever had. Every day of class is fun and inventive, and Sato-sensei is always willing to answer off-topic questions and has even supplied sushi on occasion! Sato-sensei is the kind of language teacher you hope for because he has a way of making you want to know more about Japanese culture and the Japanese language. Everyone I have spoken to in my class  has tried to get into Sato-sensei's class next semester, and it is obvious why.\n\n\nWorkload:\nFirst-Year Japanese 1 is a 5 credit course, and they aren't kidding when they say it requires two hours of outside work a night. But the content is really interesting, so it feels like it goes pretty fast most nights. The classes make the homework worth it.\n\n"
        },
        {
            "course_name": "Second Year Japanese II",
            "review_date": "April 18, 2006",
            "review_content": "\n\nIf you can take Sato-sensei's class, DO IT.  He is by far one of the most energetic and engaging teachers of a foreign language I've ever had the pleasure of learning from.  He's quite good at teaching kanji- something which, sadly, others neglect- and is always happy to explain something a little further to make sure you get it. I honestly don't understand how we managed to get in as much as we did; we went over everything so thoroughly! At least in the semester I spent with him, Sato was interested in reading different types of material in order to develop our flexibility; we read Japanese stories, answered advice columns, and went over a couple of pages of photocopied manga.  He's big on mnemonic devices (dog meat over a fire!) and employs some.. interesting methods of helping us figure out what he wants- for example, if we're supposed to use 'walk' in a sentence, he'll march around the room with exagerrated motions.  As fantastic as the experiences I've had with EVERYONE in the Japanese department... Sato-sensei takes the cake.\n\n\nWorkload:\nStandard for a Japanese class, but Sato's pretty lenient- he made some of our assignments optional. Tests every other week, midterm/final, so on and so forth.\n\n"
        },
        {
            "course_name": "First Year Japanese II",
            "review_date": "January 19, 2006",
            "review_content": "\n\nSato-sensei was a great teacher.  He always explained things well and didn't mind using English to make sure the class understood.  Questions were always answered, either in class or he was willing to stay after and explain things. Also, before tests and especially the final and oral interviews he reviewed with us rather than ignoring them. And his kanji stories were hilarious! He was very approachable and had many office hours if you were looking for help.  He also made the stressful experience of Japanese II a little better by bringing fun things like manga and japanese movies and dramas into class.  \n\n\nWorkload:\nthe usual for japanese-daily quizzes, tests every other week, a midterm, final, and two oral interviews\n\n"
        },
        {
            "course_name": "Elementary Japanese A",
            "review_date": "June 01, 2002",
            "review_content": "\n\nSato-sensee is such a great teacher. He's really nice and funny and very helpful. I've never had a class that was more fun than his! I think everyone in the class loved him. One thing to note, though: Sato-sensee, as are most other Asian language teachers, are strict about grading criteria and policies.\n\n\nWorkload:\nNothing much. Memorizing the hiragana (the katakana is not taught in Elementary A) was practicaly the only challenge. I quite honestly spent no more than 10 hours on the course outside the classroom in the entire semester (not because I didn't like Japanese but because I had other work to do) and managed a B+, which was nothing great but definitely a lot better than what I'd get in another class if I put that ridiculously little amount of effort.\n\n"
        },
        {
            "course_name": "Elementary Japanese A",
            "review_date": "February 04, 2002",
            "review_content": "\n\nGREAT. Sato-sensee is such a great language teacher. He's one of the few teachers here who maintains my faith in classroom education... His classes are very interactive, with a lot of stupid jokes, and very easy to understand. To be honest a class with Sato-sensee doesn't feel like a class--it's like an hour of fun.\n\n\nWorkload:\nvery reasonable. quite easy if you do the work.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 12, 2001",
            "review_content": "\n\nI have to agree with the first reviewer. If you're thinking about taking this course, then Sato-sensei is the way to go. He's incredibly friendly--one of those teachers who truly enjoys interacting with students or is a really good actor. Somehow, this ominous-looking 5 point course turned out to be surprisingly easy while the seemingly insignificant L&R; turned out to be the bane of my existence. All you have to do to get a high grade in this class is take a bit of interest in what's going on. Sato-sensei will do most of the rest. His method of teaching is by far the most effective I've ever come across. This is no language class where you'll learn two vocab items one minute and forget three the next. First, you'll learn 8, maybe 10 verbs, nouns, adjectives etc. for a tiny quiz at the beginning of class. Then you'll go through the grammar involved in whatever you're doing. The rest of the class is devoted to drills - over and over, tweaking the sentences and the situations until everything is perfect. You'll probably use those 8 verbs you learned hundreds of times by the time you're done. You'll never forget them and your Japanese will be fluent at best and coherent at worst. The hardest part of the course is the writing system, but you'll do it because you have to. Otherwise you can't take any of the exams. And after a couple of weeks, the characters come surprisingly naturally.\n\n\nWorkload:\nA little heavy if you endeavour to do it all, but can usually be danced around without having much of an effect on your grade. The homework assignments take about two hours each week. Preparation for the language lab is maybe half an hour per week. You can usually learn the material for the quizzes in about an hour. The alphabets and the at-home drills will be the most time-consuming things, and they're not that bad. There's an exam every two weeks on the everything done that semester, but since you constantly use everything you learn, the exams aren't usually a problem.\n\n"
        },
        {
            "course_name": "First Year Japanese I",
            "review_date": "November 09, 2001",
            "review_content": "\n\nSato-san is God. The man manages to take a very difficult class and make it fun. Although you do have to to do the two hours of studying a day, you WANT to because the man is such an incredible teacher. He's one of those teachers that actually makes you want to learn. If you don't do the work, it's painfully obvious in class, but Sato-san doesn't make you feel bad, rather he actually tries to do the review in such a way that you don't totally fail the class. One note: If you aren't serious about Japanese, don't take this class! It has by far the biggest workload and although the work is easy, it's just so much that you have to do that if you lack dedication, you will not do well. On the other hand, provided that you're not a complete idiot, if you do all the work, you'll get excellent grades. By the end of your first semester, you should be having basic conversations in Japanese.\n\n\nWorkload:\n2 hours of studying a day, 1 language lab a week, 4 tests, 1 midterm, 1 final, a number of written assignments due over the course of the semester, various oral presentations.\n\n"
        }
    ]
}