{
    "prof_info": [
        {
            "prof_name": "Janet Jakobsen",
            "prof_id": 1970,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Thinking Sexualities: Queer Theories and Histories",
            "review_date": "January 24, 2007",
            "review_content": "\nIt may sound cliche, but this class made me question how to look at the world.  Basically, not only did we discuss queer theory and history, but also examined why things are considered 'normal' and how we come to accept these things.  I learned so much from this class, that I think its a must for everyone who has ever questioned normativity.\nAmazing reading list, instead of entire books, Prof. Jakobsen picks and chooses important works by seminal writers in the field.  You really get a sampling, so that you can go and read more on your own.  Incredibly interesting topics ranging from religion, economic/ market, politics, etc.\nProf. Jakobsen is a great professor who is incredibly well-versed in the material and who facilitates interesting discussions.  She takes student feedback seriously. (Although my only criticism would be that she allowed some people did ramble on too long.)  Overall, she provokes thought and will blow your mind.  \nI worked harder in her class, read every last word, so that I could get more out of it.\nWorkload:\nFair amount of very interesting reading, 2 5-7 pp paper, and final 12-15pp paper.  (graded pretty fairly more or less)\n"
        },
        {
            "course_name": "Thinking Sexualities: Queer Theories and Histories",
            "review_date": "December 11, 2006",
            "review_content": "\nShe should teach this class every single semester. I wish I could take it again. As the previous reviewer noted, she is adept at synthesizing complex ideas without oversimplifying them. She's also adept at maximizing student participation while making students feel that their ideas are welcomed and valuable.\nShe practices feminist pedagogy and creates a classroom environment that brings out the best in everybody. \nStudents feel empowered and everybody makes valuable contributions. There was nary an uninformed or uninteresting comment to be heard--and the class was big.\nShe's brilliant and funny and she's assembled a list of readings that will blow your mind. It's an incredibly well-\norganized class.\nI've taken MANY classes at Columbia, and I think this one may have been the best.\nWorkload:\n2 short papers (5-7pp) and one longer paper (10-15pp)\n"
        },
        {
            "course_name": "Religion, Gender and Violence",
            "review_date": "January 06, 2006",
            "review_content": "\nProf. Jakobsen is HANDS DOWN the best professor I have had in my 3.5 years at CU.  If you have any interest in social movements, theories of justice, human rights, gender issues...this class is well worth taking.  I found myself putting off all my other classes because I found the reading Prof. J assigned so facinating...and how often do you hear that about a class on this campus?!  Like other reviewers, I loved Prof. J's dry and witty sense of humor...she is such a busy woman but totally approachable...she even let me design my own (eclectic) topic for our final paper!  I worked ten times harder on that paper because I wanted to do justice to her amazing class.  \nBottom line: Human Rights/Religion/Women and Gender Issues/Poli Sci ppl...take this class...you won't regret it.\nWorkload:\n2 5-7 page papers on the readings (not that bad if you go to class), class participation, final 15-20 page paper (but she gives you A LOT of flexibility on the topic)\n"
        },
        {
            "course_name": "Theorizing Women's Activism",
            "review_date": "May 18, 2005",
            "review_content": "\nWow!  Janet Jakobsen is a great professor.  I might just have to say that she is one of the best professors I have had at Columbia.  This particular class requires that you have an internship, if it is feminist based, great.  If not do not worry.  My internship was not exactly feminist but I was still able to write my papers.\nThe best part about Janet's class is that she is understanding.  She won't make you feel bad if you do not understand a specific topic rather she will go over the issue more in detail until you get it.  Most likely you probably will not be the only person in class that was a little confused about the text.\nJanet is also very caring and approachable.  I left the class not only enlightened but satisfied.  I did not feel the void I often feel with other classes.  She really explained women's activism.\nWorkload:\nTwo 5-7 page papers, final paper 10-15 pages, a class presentation that occurs at the end of class and can be focused on your final paper and of course the internship.\n"
        },
        {
            "course_name": "Colloquium on Feminist Theory",
            "review_date": "December 30, 2004",
            "review_content": "\nThe best part of this class and the professor would be that no matter how difficult the reading was for that week 1) it was never unreasonably long and 2) she would always spend class time discussing and reviewing the difficult theory (especially background which was not required to read).  Because of this, I learned so much from the class on different case studies that I ended up being shocked.  With a different professor, this may not have been the case.  \nWorkload:\nread about three essays per week, one research paper (15+pgs), three presentations\n"
        },
        {
            "course_name": "Theorizing Women's Activism, Colloquium on Feminist Theory",
            "review_date": "January 20, 2004",
            "review_content": "\nJanet Jakobsen really is a fantastic professor, and if you're interested in feminist theory, ethics, or social movements, there are really few better or more qualified people on this campus to take class with.  \nPerhaps the best facet of taking a class with Janet is that she has an amazing ability to take extremely complex theoretical concepts and break them down into very palatable language.  She continually emphasizes the importance of doing the reading, but she will not fault you if you have problems understanding it; rather she'll take as much time as you need to get it clear.\nAdditionally, she's fantastically dry and sarcastic, and her humor really keeps the class environment light and enjoyable, although you're always dealing with some heavy concepts.  I've rarely had a class that I looked forward to every week, but class with Janet just made me want to learn, which is something I really appreciate.\nWorkload:\nTWA: Short (5-7 page) paper, in-class presentation, short take-home final.  Additionally, you have to hold an internship for the duration of the semester.\nColloquium: 5 page paper, 2 in-class presentations (about your papers, essentially), 15-20 page term paper.\n"
        }
    ]
}