{
    "prof_info": [
        {
            "prof_name": "Vincent Racaniello",
            "prof_id": 5567,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Virology",
            "review_date": "June 12, 2015",
            "review_content": "\nHere's to those of y'all who will sign up for this class, don't attend (or watch) lectures, and expect an easy A: Vincent will crush your hopes and dreams worse than raisins left in the fucking sun. \nThe reviewer below me has done a good job delineating the grading scale...note that a 94 is the hard-cutoff for an A. The Spring 2015 class was curved to a B. The last time I took a class that was straight up curved to a B (ahem, Mowsh bio), less than 30% of students ended up with an A- or higher. \nThat being said, this class is a hell of a lot more straightforward than Mowsh bio, though the information presented in his lecture slides can be overwhelming, especially now that the exams have gotten more difficult and any small detail can be tested. I remember exam 2 straight up had a vocab quiz of words such as \"iatrogenic\" and \"nosocomial\"...if you memorized that particular slide or had a knowledge of Greco-Latin roots or remembered your SAT flash cards, you'd ace that section. If not, it's gg. Your best bet to ace-ing this class? Don't skip lectures and tell yourself that you'd re-watch them; it doesn't work, and then you'd end up further behind. Also, flash card the fuck out of every little detail. Start with the lecture questions and then come up with your own. Don't do what I did and start studying the night before/morning of the exam...there are only 3 exams, no drops, so each exam covers roughly 8 lectures, of almost 60+ slides per lecture (and boy, does Vince love putting text on slides!). My grades improved with every exam since I started studying even a day or a weekend earlier, but my only oh-so-slightly-above-median performance on Exam 1 wasn't enough to offset the 97 I got on the final, and I ended up with an A-, even with the extra credit. Unless you want to feel butthurt (like me), I'd take every exam seriously. I can guarantee that if you put in the effort, there's no reason why you won't be able to get at least a B+ in the class. The question is: is this class worth the effort?\nAlso, Vince does deserve some accolades. He's a pretty darn good lecturer, possibly one of the best in the department (up there with Mowsh XX, Mowsh XY, and Liz Miller). He's super passionate about his field, entertaining, and clear in the presentation of material. If you're awake enough in his lectures, you'll be sure to pick up some neat stuff.  \nWorkload:\n3 exams, each 30%. Lecture quizzes that are worth 10% that can be postponed until the last day of class (I wouldn't recommend it). We also had an optional extra credit assignment that was worth up to an additional 2% of your grade. Since everyone is doing it, it's probably in your best interest to do it as well. So much for optional.\n\n"
        },
        {
            "course_name": "Virology",
            "review_date": "May 16, 2015",
            "review_content": "\nBeyond the complaints we've seen about how Vincent Racaniello's class being too easy, it's very much worth taking this class because the man is one hell of an educator. It's clear that he does it because he just wants to share his love of his study to the world, and his passion for the subject really rubs off on you and makes the course a pleasure to take- especially considering that there are a few requisite boring patches during the semester.\nThis being said, I think the takeaway from this semester is that Racaniello isn't f'ing around anymore with his curve. Either due to rumored departmental pressure, or because of rude buttheads like the 2014 reviewer, he has made getting an A range grade something of a challenge. Averages on exams fell consistently in the mid 70s, and he curved the overall mean grade (mid 80s- 84 I think?) to a straight B. The hard A cutoff was a 94, and A- started at 89. Our midterm exams were slightly harder than the exams used in previous years because he started testing finer details. Our final was notably less pleasant to write than the 2014 final because he shifted to the paragraph-question testing style that most of the upper level Columbia bio department seems to like. (In fact, the 2014 final was widely considered a joke compared to our final). I will leave the editorializing for others, but I don't really think that he will get a lot of complaints about course difficulty from here on out. \nThe thing about Virology is that the course material that you can introduce in an undergraduate class really isn't hard. The first half of the course is essentially variations on the central dogma, and then the second half focuses more on macro level: infection, spread, and application of virology principles.\nRacaniello, I think, has made a conscious decision to cover the study in broader strokes, so you won't be able to get as much detail in some of the subjects he covers. This is as opposed to other upper level Columbia bio classes, that perhaps will spend a lot more time on the particular cascades and mechanisms of one specific physiological phenomenon through a research paper, but not be able to cover as many general principles. This is neither good nor bad- it's how he decided to teach the course. The practical outcome of this decision though, is that the margin of error you are allowed, especially with his new curve, is slimmer. He provides study questions to accompany every exam, and studying those is pretty helpful because they cover what he considers good takeaways from the courses. Many of the principles on the study questions showed up on exams.\nI believe that a good comparison in terms of course difficulty is Stockwell's Biochemistry lecture. None of the stuff tested is exceedingly challenging, but the grade cutoffs ensure a distribution of final grades that keeps you honest in terms of the course work.\nI think that it really gives Racaniello no joy to do this, because he just wants to teach.\nAs a result, he gave the class a bonus question that could increase your final average by 2% maximum, which was pretty nice, but I also believe was sorely needed considered how poorly people were doing on the midterms (likely due to underestimating his course.)\nOverall, this course is very much worth taking. Racaniello is a great teacher and very likeable. But do not underestimate his course anymore. You need to actually work to get an A.\n\nWorkload:\n2 midterms & 1 final, all worth 30%.\nWeekly homeworks that added up to 10%.\nNot too bad if you just keep up.\nI scored in the low to mid 90s on each exam and got an A. But it definitely wasn't like you can just look over your notes 3 hours before the exam and get an A like the previous reviews suggested. I studied as much as I did for any other upper level bio class to get the grade.\n"
        },
        {
            "course_name": "Virology",
            "review_date": "May 26, 2014",
            "review_content": "\nThis class is a disgrace to have at Columbia, and certainly the worst biology class I've taken so far.\nRather than teach about viruses, professor Racaniello reduces any important topic beyond recognition to simplistic summaries that hardly actually apply. Admittedly, viruses are extremely diverse, but instead of going into any detail he chooses to gloss right over anything of interest.\nInterested in learning about molecular biology and viral mechanisms? Look elsewhere. Any topic that can't fit into one bullet point is something that you ultimately don't need to know as well as something that's too complicated for him to teach.\nIt's also discouraging that professor Racaniello thinks so highly of himself as a professor. He espouses how great of a lecturer he is on his blog, and while it's nice that he posts his lecturers online so you don't have to sit for an entire god-awful 75 minutes in front of him, it doesn't help that the content is so miserable. His course is also one of the ones on Coursera since he already records his lectures, and there the multiple-choice questions asked are actually a little bit more challenging. His love of technology also encouraged him to delay the class 4-5 times each day for easy in-class multiple-choice questions that everyone that wasn't asleep knew the answer. \nHis textbook, if you look at it, is equally confusing and unorganized. There's more detail in it than what you need to know and trying to learn more will only hurt you.\nThis is the first upper-level biology class that I've taken that doesn't have any real journal articles to read, so if you won't miss that and you're looking for an easy A and a class that reminds you of high school, feel free to waste your semester by taking Virology.\nWorkload:\nThere's a reason 150+ students take this class to fulfill biology requirements: this class is ridiculously easy. There are only 3 exams (including the final), and each is non-cumulative. Each exam contains exactly the material that's on the study questions and is hardly any different from the questions on the previous exam, which he provides. Study these for a couple of hours before each final and you'll be sure to get an 80 or 90 on the exam, just like everyone else in the class.\nIf not, don't worry: there's lots of extra credit, too.\n"
        },
        {
            "course_name": "Virology",
            "review_date": "May 12, 2014",
            "review_content": "\nWe are very lucky to have professor Racaniello at Columbia.  He is passionate about viruses and wants you to know about them.  I've learned more in this class than any other i've taken at Columbia so far and his passion for this subject will rub off on you.  \n... However, I took the final this afternoon and went out to dinner. I'm usually fast to decide what to eat I had a very difficult time choosing. Chicken..hmm.. H1N1, I don't think so .. Flank Steak.. Prions ... maybe not.. and finally Fish, but then I remembered Norovirus... But I also remembered that Viruses are everywhere, in everything we eat, including retroviral DNA in our genome, and ordered a cheeseburger, hoping there won't be an misfolding going on when i'm sleeping.  \nI found this class to be challenging, because the last time I took Biology was in high school in 1995..Professor Racaniello presents the material in an organized and clear fashion and helps you narrow down the main points about viruses. Along the way I learned a tremendous amount of Biology and a tiny bit of Biochemistry, immunology, and pharmacology, but much more than I knew before this class. This professor is nothing but helpful and really cares about your understanding of the material, I encourage you to engage him and visit his office hours whenever you are able because he really cares about your understanding of the subject. He gives you everything you need to succeed: HW questions (not mandatory), practice exams, and uploads lectures to youtube. \nWorkload:\nThis from the perspective of Someone with NO BIOLOGY experience. If you haven't had it in a while, you can do it but you're going to have to work a little, here's what I did:\n-Get familiar with basic DNA/RNA terminology, know roughly what a protein is, a polymerase is, the difference between transcription and translation as these will be extremely important. I used the link to a Kimball Bio Text online at Professor Mowshowitz's page, but there are many other sources online. \n-I found his text to be an excellent resource when I had trouble understanding the lecture, allot of the pictures from the slides can be found in the text with captions explaining allot of the concepts in the slide in details. The textbook chapters as well as the slides seem to be organized in such a  way that the general principles are laid out first and then examples are discussed. \n-Answer the Homework questions and go to office hours, discuss your answers with him. \n-Always be sure to go to office hours/TA REVIEW before the test, they will help you focus on what to study. \n-Take the online quizzes early, and take them seriously. \nOverall, even with no previous Bio Background you can take this class and do well, you're just going to have to spend more time on it than the other students but you're going to leave it with a wealth of knowledge an appreciation of subject.\n"
        },
        {
            "course_name": "Virology",
            "review_date": "December 14, 2013",
            "review_content": "\nI have mixed feelings about this class.\nOn one hand, Dr. Racaniello is a terrific lecturer. As the reviews below suggest, he is very enthusiastic about virology and is extremely well spoken. He has clearly had a lot of experience in teaching.\nOn the other hand, Racaniello's virology class was a bit of a letdown because it was way too easy. (I think my AP biology class was harder than this one.) Since Racaniello gives out more than half of his test questions in advance, most people I know studied for virology by memorizing the answer key to Racaniello's study problems.  Evidenced by the class mean being in the 90s regularly, Racaniello's exams and study problems present little of an intellectual challenge, and his course's coverage of basic virology principles is remarkably superficial. With that being said, I left this class with not a deep understanding of virology principles but a loose smattering of miscellaneous virology \"fun facts\" that I had crammed into my head in the 24 hours before the final. In light of the fact that I have forgotten most of what I learned in virology, I don't think I deserved the A that I received in this class.\nOverall, virology isn't a bad class. As I said, Dr. Racaniello is a very good teacher...perhaps one of the finest lecturers in the biology department. In light of his teaching talent, this class could have been much more stimulating than it was. \n\nWorkload:\nLightest of all science classes that I have taken at Columbia. \n"
        },
        {
            "course_name": "Virology",
            "review_date": "September 20, 2012",
            "review_content": "\nThis was my absolute favorite class out of all the biology classes I've taken! I went to the first lecture just for fun to see what it'd be like, with no intention of actually taking this class. But Professor Racaniello was so engaging and the material was so interesting that I just had to take it. It was pretty overwhelming at first - especially when you realize just how much material and how much detail he manages to cram into one lecture - but eventually you get the hang of it. He covers a LOT of detail but he doesn't necessary test on it all. What he will test on, however, is something that he has mentioned multiple times - which is completely fair. The material, despite how overwhelming it may seem, is really interesting!!! At some point during the semester I realized that it was actually all starting to make sense and come together and was less memorization than it had initially seemed - which, as most people know, rarely happens in a biology class. Oh, and he's also really accessible and willing you help you/answer questions after class, which is always nice. Basically, Prof. Racaniello and his class are both absolutely awesome and you'd be missing out if you didn't take it! Stick it out through the first few lectures and you'll be glad you did at the end of it all. The last 1/3rd of the course are especially interesting.\nWorkload:\n3 midterms (non-cumulative), 1 final + ECs.\n"
        },
        {
            "course_name": "Virology",
            "review_date": "April 27, 2012",
            "review_content": "\nI took this class a year ago.\nI think many others already said enough about how great he and his lectures were. I agree to all the positive reviews already out here in culpa. Racaniello is great as a lecturer, teacher, researcher, and a person.\nI graduated as a biology major and took A LOT of biology classes in Columbia, and this class was my FAVORITE.\nTake this class. You won't regret it. I LOVED it. And my friends did too.\nWorkload:\n3 midterms, 1 final, and extra credit assignments.\nAll the lecture podcasts are posted online, which are very very helpful when you didn't go to class.\n"
        },
        {
            "course_name": "Virology",
            "review_date": "August 27, 2011",
            "review_content": "\nI loved this class. While there were quite a bit of material to cover in every lecture, meaning come time for the midterm or final you will be cramming for hours because you probably have not been keeping up, the material was engaging and interesting. It was a great refresher course for DNA/RNA transcription, and believe it or not, the lessons actually come in handy in medical school (I can attest to that! I saved all their podcasts on my harddrive for later use).\nSo interesting material, fast paced, and organized. (I have had classmates who did not like the organization of the lectures, but I didn't mind it.) I really appreciated the good quality podcasts Racaniello would upload immediately after each lecture. No one would ever show up to class because they had those podcasts, but I really liked being there for his lectures. That being said, the class is not hard. If you go over all the lectures and podcasts in detail, you will be fine. While I read the books in the beginning of the semester, by the middle of it all, I don't even remember where I'd chucked my textbooks. Hence, textbooks were not necessary. \nHe gave out two extra credits, and there were always extra credits at the end of the exams. Max exam scores were 110, but they will still be ranked under the 100 scale, meaning a 98 is still a 98 (A+) even if it was 88 before the extra credits. \nRacaniello was also very approachable and technologically proficient (HAHA!). He's got a twiv site that gets 1000+ hits a day where he and colleagues post up podcasts about the latest topics in virology. He really just wants to teach a few more people in this world about viruses. I still follow him on twitter.    \nWorkload:\n3 midterms, 1 final. 2 extra credits. \n"
        },
        {
            "course_name": "Virology",
            "review_date": "July 07, 2011",
            "review_content": "\nI really enjoyed this class.  I think this is primarily because Professor Racaniello thinks viruses are supercool and awesome and gradually by extension you do too!  In fact, you could say his passion for science is INFECTIOUS.The powerpoints are very well organized and it is very helpful/necessary to be able to listen to them over again online so you can go through the material at a slower pace because there is A LOT of info crammed into each lecture. I also appreciate that the class is structured by stages of the viral life cycle, using specific viruses as examples, as opposed to merely a laundry list of viruses. He is also constantly updating the information to reflect the most current research. It makes a huge difference to one's perceptions of a class when you can tell that a professor really loves teaching. \n\nWorkload:\nLots of memorization, weekly online quizzes to make sure keeping up with material, 2 midterms and a final.  Emphasized that he believes fostering a genuine appreciation and understanding of science is more important to him than a grade so he isn't out to destroy you on the tests and provides extra credit opportunities as well.\n"
        },
        {
            "course_name": "Virology",
            "review_date": "May 17, 2011",
            "review_content": "\nVirology was interesting and a very cut-and-dry class.  Racaniello is really into students learning the material and applying it into the real world, but this is still very much a biology class.  You'll need to know how a cell manages transcription, translation, metabolism in order to know how a virion takes over that machinery to replicate.  Lectures are available online, and he notes that people who don't go to class do just as well.  Oh, and he wrote the book for this class.  You won't need the book, but it was helpful for some of the more complicated lectures.  \n2 mid terms (30% each), weekly quizzes in courseworks (10%).\nWorkload:\nGo to lecture or watch the lectures and learn the material.  Similar to every other 3000-level bio class.  \n"
        },
        {
            "course_name": "Virology",
            "review_date": "June 01, 2010",
            "review_content": "\nAll lectures are posted online so I never went to class, but did very well regardless. The material is fascinating and, although somewhat superficial, you do learn a lot about viruses, including their replication cycles, as well as the general methods of infection and some introductory epidemiology. Prof Racaniello worked extensively on poliovirus, so he's extremely knowledgeable and humorous, and does his best to answer student questions. The first midterm was much more difficult than the second as there were more specific terms and ideas to memorize. \nWorkload:\nVery light. One midterm, one final, each worth 100 pts, lots of extra credit points offered, no curve. \n"
        }
    ]
}