{
    "prof_info": [
        {
            "prof_name": "Philip Pechukas",
            "prof_id": 2288,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "February 21, 2005",
            "review_content": "\nThis class was a nightmare. Pechukas knows his stuff alright, and can teach it relatively coherently during lecture, but the problem set/test system was whack. It seems like he was too lazy to write two sets of problems, so our homework was the test, which might sound nice, but really means that you don't get homework answers and never know if you are doing things right. This makes working on problem sets EXTREMELY time consuming. You must collaborate with other people, but whenever people come up with different answers, it is a big pain to figure out who was right. And as other reviewers have said, recitations are really more lecture, on a completely different subject. However, it is possible to completely ignore the recitation material and still do alright in the class if you REALLY nail everything else, because the tests are made to be too long and curved around 50%. Take this class only if you really have to and love chemistry.\nWorkload:\nCrazy problem sets, 3 midterms, 1 final (last midterm is simultaneous with final)\n"
        },
        {
            "course_name": "Intensive G. Chem Lab",
            "review_date": "January 24, 2005",
            "review_content": "\nI've heard this said before, but Pechukas is a chem god.  For a chemistry class, the lectures were interesting, well organized, and well explained.  Morgan Mihok was a decent TA although her  section of the course was a little haphazard at times.   The problem sets are tough, but once you get them, you are set for the test.  Pechukas and Mihok won't help you very much with them but  most of the problems are possible if you work in a good group and everyone puts in some time.  Also, this is really a physical chem course and not a general chem course, so the math can be tricky at times.  All in all, a worthwile class, especially with its amazing curve (B+/A-) and with its ability to get you out of a second semester of chem.\nWorkload:\n9 Problem Sets(not graded but essential for studying), 2 midterms, 1 final with emphasis on the third part.\n"
        },
        {
            "course_name": "Intensive Chem C2409",
            "review_date": "January 09, 2005",
            "review_content": "\nPechukas is brilliant and a great lecturer.  His classes always managed to be interesting and entertaining, despite the often dull subject matter.  He clearly knows his subject, and knows that he's working on a compressed time-line, but he always leaves time to tell us about the gruesome ways famous chemists committed suicide.\nRecitations are a different story, as everyone else has said.  Go to them, try to pay attention.  When you can't, don't worry, because most of the material is in the book.  I highly recommend reading all of the chapters they assign and doing not just assigned problems but the odd problems mentioned in each section.  This helped me A LOT with recitation material, and with in class stuff.\nAlso, don't let the problem sets pile up.  They are VERY difficult, and relate directly to material discussed in class.  3 problems can take a very long time.  Find people to study with.  Do not attempt alone.\nWorkload:\n2 midterms and a final, which is half midterm on the last third of class and half cumulative.  3 problem sets per midterm, and no answers given before exams.\n"
        },
        {
            "course_name": "Intensive Chem C2409",
            "review_date": "December 29, 2004",
            "review_content": "\nA very nice professor, but the class lacks a lot. Topics are random and a lot of information is not the book so its hard to study if you didnt go to class or if he moves too fast for you. Also, the worst TA ever, Morgan, lead a rushed and confusing and BORING reciation where she'd teach information that was also going to be on the exam. Its a rough course, but if you can work wtih other people to figure out the problem sets that the TA and prof wont help you on or give you answers, you be ok.\nWorkload:\nThe Key: find people that know how to do the problem set problems, and memorize how to do them so you can breeze though them on test. YOU WILL RUN OUT OF TIME ON THE EXAMS.\n"
        },
        {
            "course_name": "Chemistry C2407",
            "review_date": "December 24, 2004",
            "review_content": "\nPhillip Pechukas has a very likable demeanor as a lecturer.  His style of teaching is such that he gives you the problem sets the first class day of every week.  He doesn't grade the problem sets and he won't tell you the answers to them, and doesn't hold any office hours to help people with concepts on the problem sets. You're expected to figure out the problem sets on your own/ with your study group. \nThe TA is not allowed to give you any really HELPFUL hints on the problem sets.  In C2407, he had the TA, TA Morgen, during the recitation period, teach additional material he wasn't covering in his lectures.  Her, rushed and lacking teaching ability is fodder for being severly flamed.  I think Pechukas' rave reviews of TA Morgen has to deal with her apparent aptitude as a graduate researcher and how quickly she is able to grade tests, because her lecturing ability is severly lacking.  A random pick of the problem set problems, all of which you have no answers for,will be all that is on the tests. The problem set problems are not easy, and they take a very long time to solve. You have to do them because there is no other way you are given to prepare for the exams. Pechukas shoots for a median grade on his exams of 50%.  He likes to be able to curve to this score because he finds it extremely fair.  Indeed with the reasoning he gives, I think everyone finds it fair.  It was extremely hard to gain fluency, and gain concrete understanding of the material when there was never anything that you were absolutely sure was right.  The concepts in this class are not hard, it is just that the problems on the problem sets and tests are ridiculous because they are very hypothetical, you don't get any help from the TA or Pechukas, and they take a scouring of the concepts learned in class to complete them.\nWorkload:\nPlan on losing sleep towards midterm and final time.\n"
        },
        {
            "course_name": "C2407",
            "review_date": "December 24, 2004",
            "review_content": "\nIntensive general chemistry is not a fun course.  Professor Pechukas does not teach conceptually but places emphasis on mathematics and formulas.  While this works to an extent, it doesn't help when you are not learning chemistry.  Pechukas's lectures seemed fine if you can follow (things move pretty quickly).  Recitation is another story however.   The TA for this course was Morgan M. (sorry dont remember her last name).   During recitation, she spoke on topics not covered during Pechukas's lectures.  Recitations are 50 min so Morgan is extremely rushed... and she can't teach.   Also, she doesn't help with the extremely difficult problem sets.   This class was extremely difficult and I kind of regret taking it.\nWorkload:\nProblem sets each week - Given without answers.  (difficult)\n3 Midterms, 1 Final\nProblems on the exams are taken straight from the problem sets (sometimes certain values are changed).  Memorizing calculations/solutions from the problem sets usually works for studying for the exams.\n"
        },
        {
            "course_name": "Intensive General Chemistry C2407",
            "review_date": "December 21, 2004",
            "review_content": "\nPechukas is a brilliant man and and his lectures were interesting and entertaining.  The course covers a lot of material and it's easy to get lost, especially since you never need to hand in the problem sets.  Despite how hard this course is, and it is very hard, it's a great class and I recommend it for anyone who can handle it.  The TA, is always there to help when you get lost so take advantage!\nWorkload:\nProblem sets every week that don't need to be handed in and that you never get answers to.  Test questions are taken directly off of the problem sets.  Don't be fooled, some of the questions are very hard.\n"
        }
    ]
}