{
    "prof_info": [
        {
            "prof_name": "Erica Siegel",
            "prof_id": 3336,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 04, 2011",
            "review_content": "\nAll in all, I would describe Erica as a great teacher. During the first semester, I sometimes felt that she was TOO nice - basically accepting what everyone said in class and not contributing as much of her own interesting insight as I would have liked. But during the second semester, it seemed like she stepped her game up and we really dug into the books in a more stimulating way. As other reviewers have said, she is certainly a very kind woman who is eager to guide you towards a deeper understanding of the texts; at the same time, she is open-minded to the extent that the class seems to be just as much an exploration and process of discovery for her as it is for the students. All around a great class, fun to be in, and stimulating in all the ways that LitHum should be. Personally, I didn't love the addition of Chekhov, but I suppose that's a matter of taste; other people seemed to like it very much.\nHighly recommended.\nWorkload:\nTypical LitHum workload. Some assignments are ridiculously long (~450 pages of Don Quixote over spring break), while others seem inexplicably short. That's just how LitHum goes. The essays are fairly simple to conceptualize and compose (her prompts are often so long and detailed that they basically do all the work of forming an argument (and sometimes even citing specific textual examples) for you), but I agree with other reviewers who said that she is a tough grader. Yet she is clear about how she expects you to improve your essays and if you are open to her criticism, it should be easy to achieve consistent A grades by the middle of first semester. The pre-class discussion posts are truly a breeze and can take ten minutes or less.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 26, 2011",
            "review_content": "\nProf. Siegel (who asks that we call her Erica) is good teacher. She has a lot of passion for her class and you can tell she cares about your learning and your success. The tone of the class is reasonably lighthearted, with moments of humor and short anecdotes.\nDiscussion in the class is decent, though it did fall a bit flat at times. Essay prompts were for the most part interesting, and you're given many to choose from.\nAll in all, if you're placed in her class, you'll have a good time. Also, her dad is Robert Siegel from NPR. Coolness +1.\n\nWorkload:\nVery reasonable. \nAn ungraded paragraph on the reading assignment due 11:59pm the day before class, 3 shorter papers Fall Semester and two 5-7 page papers Spring Semester. She is flexible if you go slightly over the page limit, and I believe she gave some other students in the class extensions on their papers.\nChekov short stories were assigned as additional reading 2nd semester.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 25, 2011",
            "review_content": "\nIf you end up in Erica's class, consider yourself blessed and one of the luckiest freshmen at Columbia!!!! Although I am not a humanities major, and literature by no stretch of the imagination is not my forte, I loved this class!!! The readings are dense and sometimes make no sense (Beware of Thucydides), but Erica has a way of clarifying anything we read which made studying for the midterm and final a breeze. Her discussions are really relevant to both the individual works as well as the course in general (Look for kleos in every book). She really enjoys teaching, leading discussions, and pushing her students academically. While the discussions can sometimes drag (that's just the nature of a two hour long class), it is so worth it to attend every class session. \nShe's not the easiest of graders. In fact, it is rather difficult to get an A for the semester (especially first semester); however, it's the core, and it is not supposed to be a stroll through the park. Her class is well worth it. A bunch of my friends had teachers who were easy graders or treated the class as a joke. I feel I got my money's worth with this class!!!\nWorkload:\n- Discussion question due midnight before every class (3 can be skipped without affecting participation grade)\n- 2-3 papers per semester worth about 20% of total grade\n- one midterm\n- one course wide final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2011",
            "review_content": "\nShe is kind of amazing...get her if you can. She doesn't lecture too much but she guides the discussion expertly. Doesn't force you to talk but always encourages your thoughts, and she is very fair and flexible. Always available to talk, answers emails quickly, and very approachable. She's serious but lets you joke a bit, so her class is not high stress. In general, Erica's class was quite fun and you learn a ton from her. She deserves a gold nugget!\nWorkload:\nNormal lit hum reading, 2 or 3 papers a semester, 1 midterm per semester in the style of the course-wide final. Can be very picky about elaborating thoroughly on the IDs. \nHave to post a short discussion (a small paragraph) on a section of the reading, and though it was sometimes annoying, it definitely seemed to encourage people to read with more attention, and the class discussions were better because of it. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 01, 2011",
            "review_content": "\ngive this woman a gold nugget!!!!! best ever. \nwarm, knowledgeable, flexible, forgiving, interesting. \nour entire class loves her, and the feeling is pretty mutual.\nshe's a pleasure to spend 2 hours with every tuesday and thursday.\nshe concentrates in russian literature, so crime and punishment is obviously fantastic for 2nd semester.\nerica likes to keep a lively discussion going, but never forces you to talk.\npast reviews have mentioned that she gives out a heavy workload, but that's not really true.. it's typical lit hum stuff: a lot of reading, the occasional essay and a midterm and final. besides that, we have to post one discussion question in the class wiki every night before class. it literally takes like 5 minutes total. easy. \nWorkload:\nhearts stars and rainbows\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 04, 2010",
            "review_content": "\nErica is FANTASTIC. She is warm, eager to hear your thoughts, and genuinely fair and approachable. She almost always keeps a lively class discussion going in lit hum. She is clearly interested and excited about the material that she's teaching, and makes it even more enjoyable for her students (especially for dense texts that might not seem so stellar upon first glance). \nHer lit hum class isn't a breeze by any means, but it's really not killer at all. If you put in a decent amount of work, you will do well. Readings are long and can be pretty rough (that applies to almost all lit hum classes i assume...), but discussion in class makes struggling through the texts very worth your while. \nA wiki post about that night's reading is mandatory before every class, which is a bit of a pain, but really nbd. It's like 5 sentences total, and it's not even for a real grade. Her essay topic choices (there are usually 5-6 options) are good prompts and genuinely not too hard to handle. In grading papers, she expects you to put real, developed, complex thought into your work, but she's not looking to shoot you down by any means. If you work hard on your essay, you'll do fine.\nWorkload:\n-a wiki post about that night's reading, due 12 midnight before class the next day, every day\n-about 3 papers\n-in class midterm she created (ID's, essay question)\n-course-wide final (ID's, close textual analysis, essay question)\n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 17, 2008",
            "review_content": "\nErica was wonderful.  I found a majority of the class sessions engaging and worthwhile.  She has a talent for directing her students in a constructive direction while allowing them to drive the discussion.  As far as I'm concerned, the majority of my classmates loved her as much as I did!\nShe is young but very intelligent, and her excitement for the texts (even Thucydides, Wolfe) is refreshing.  I was surprised how I would do the readings and not really have any idea why I was supposed to read it, then go to class and discuss it, and leave feeling like I hadn't wasted a few hours the night before.\nClass aside, she is incredibly nice and very approachable.  I highly recommend Erica!\nWorkload:\nHer class was by no means a breeze but I found the workload to be manageable.  In order to get a good grade in class participation (which constitutes a sizeable part of your grade), you have to keep up with the Courseworks/wiki postings (close reading exercises) due by midnight before each class.  First semester, we had three 5-pg. papers, a midterm, and a final.  Second semester, we had two 7-pg. papers, a midterm, and a final.  The midterms are formatted similarly to the (district-wide) final: passage IDs, passage analysis, and essay.  She grades fairly, which means As aren't handed out but certainly possible.  Readings can be very long (and sometimes brain-cramping) but it's nearly always worth it to have the reading done. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2007",
            "review_content": "\nErica's Lit-Hum class was really great.  The conversations are always deep and she lets the students discuss things relevant/interesting to them.  The class is pretty informal and she is pretty easy going.  She does have a HEAVY workload though.  You need to post two half pg discussion questions before every class and you will have three papers.  The readings are the normal Lit-Hum readings and she does not add anything extra like some of the other professors.  Basically if you're willing to put up with the work than it is worth taking Erica's class.  The class itself is very enjoyable and you will really get a lot out of it. The grading is strict but fair.\nWorkload:\nHEAVY workload-need to post 2 half pg discussion questions before each class, 3 papers, midterm and final.  \n"
        }
    ]
}