{
    "prof_info": [
        {
            "prof_name": "Mahir Cetiz",
            "prof_id": 11953,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "April 11, 2016",
            "review_content": "\nTAKE IT!! He’s awesome.  Gives you 5 quizzes, two papers, and a final.  He posts the quizzes (a \"studyguide for the quiz\" which usually has at least half of the questions that will actually appear on the quiz) online before giving them to you in class. He does a pre-read on the papers for you.  The final is basically a longer quiz with an added essay and a bit longer listening section, but also an ass load of extra credit opportunity. You do have to go to an Opera which is kind of inconvenient because it was during the middle of the week, but that could be different in different years.\nWorkload:\n5 quizzes which are uploaded on courseworks before class, two papers, final, Opera\n"
        },
        {
            "course_name": "Masterpieces of Western Music",
            "review_date": "August 20, 2015",
            "review_content": "\nThis guy is so likable! Music Hum was pretty challenging for me as I had trouble recognizing things by ear. However, Mahir is so fun and clearly enjoys his job which always makes a class more enjoyable. He doesn't allow computers in class which is totally fine for what we're doing. The material was never dry and many of our assignments were fun and interesting (like seeing live symphonies and writing about them). We were assigned a fair amount of work but not everything was graded and handed back, likely counted more towards participation. \nWhen I was struggling with some assignments and clarity of terms I reached out to Mahir and he was incredibly helpful. He really does want everyone to do well and he spent a lot of time going over my study guides. I sent about three to him and he would correct where I was mistaken, tell me if I was missing anything and re-explain concepts in a new way. \nFor the midterm and final he gave VERY clear expectations and provided a list (not too long) of songs/symphonies/operas/etc for us to study and then choose about 75% from that list. It made the whole thing so much less stressful. \nHighly recommend! \nWorkload:\nGraded: 2 quizzes, 2 papers, midterm and final \nNot graded but make sure you do them as we discuss them in class and hand back: weekly readings and short questions \n"
        }
    ]
}