{
    "prof_info": [
        {
            "prof_name": "Stuart Gottlieb",
            "prof_id": 2219,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "American Foreign Policy",
            "review_date": "June 06, 2006",
            "review_content": "\nProfessor Gottlieb is hands down the best professor I have had at Columbia!!  If you ever have a chance to take a class with this man you must not pass it up!!  Although a little heavy on the reading, his classes are always stimulating and allow you to discuss current events as they unfold. He incorporates movies, guest lectures, debates and short-memos into the syllabus to keep the course interesting and is an incredibly engaging speaker.  He is the reason why I chose to remain a political science major, as most of my other polisci courses were dry and monotonous.  It is Columbia's extreme loss that he will be splitting his time with Yale in the future.   \nWorkload:\nHeavy reading but able to tell which articles are really the important ones to analyze. Take home midterm paper and in class final both not too bad.  Policy memo is short and a lot of fun. It tries to put you in a real life situation and really makes you think about the subject in real terms.  In general not much more work than most other non-intro classes. \n"
        },
        {
            "course_name": "Terrorism and Counter-Terrorism",
            "review_date": "May 21, 2006",
            "review_content": "\nGottlieb's lectures are fun and easy to follow. The lengthy list of readings should not turn you away, because most of them are not long (and I personally think you can do quite well just skimming them). That said, expect a better grade if your essays are informed by the arguments in those readings. Going to class is also rewarded (by 10 rather interesting T/F questions in the final).\nWorkload:\nA somewhat lengthy take-home midterm (10 IDs and 6-7 page essay), a backgrounder memorandum on a terrorist group, and a final (10 IDs, 10 T/F, 2 essays).\n"
        },
        {
            "course_name": "Terrorism and Counter-Terrorism",
            "review_date": "April 25, 2006",
            "review_content": "\nIf you think that maybe just maybe the U.S. has done something wrong with its foreign policy do not take this class, it will be disturbing. Gottlieb truly excels at congratulating himself for his insight and the U.S. for its impecable role in international relations throughout the semester. In short only take this class if you want to understand why republicans believe it is valid to trample on the rest of the world with the inextinguishable excuse of national security.\nWorkload:\npiles of reading that do not teach more much than watching CNN or FOX. A take away midterm, memo and final. \n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "January 24, 2006",
            "review_content": "\nYes, Gottlieb is handsome and a charmer. His intelectual acumen,\nhowever is far from impressive.  The lectures although broad,\nlacked any depth or critical analysis.  It was dicursive.\nHe largely described events as they turned out,and loved quoting\nhimself.\n\nWorkload:\nrandom NYT articles, nothing heavy weight, some good historical reading. Midterm and Final.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 15, 2006",
            "review_content": "\nGreat teacher, great lecturer, funny guy with a lot of experience in Washington.  He will shoot you down in class so be prepared when you speak.  His lateness policy is a so called 2 minute actually at least 5 minute grace period before shutting the door and then freaking out for 5 minutes when someone tries to come into the class.  There is a lot of short articles and a few easy to read books.  Much less dense then other poli sci classes.  \nWorkload:\nAverage political science class but less difficult readings. 2 short papers and an EASY final exam\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 13, 2006",
            "review_content": "\nThis is a class that every student at Columbia MUST ABSOLUTELY TAKE before graduating! It was by far the best class IÂ’ve taken at Columbia! I've never come across a professor who is more charismatic, inspirational and knowledgeable in his field! I didnÂ’t miss a single class (and that has never happened to me before), because I absolutely loved it! He is dynamic and engaging, and he adds humor and interesting anecdotes to his lectures. He is also very approachable both outside and inside the classroom. His lectures encompass readings from the Founding Fathers up to articles written during the summer of 2005, and although there are a lot of materials to cover, he takes the time to discuss complex arguments surrounding controversial issues (they are also in the readings). I knew bits of US foreign policy history, but this class really helped me see the whole picture and understand the forces that shape US foreign policymaking. As a former Washington insider, he also offers students insights on how Washington really works (as November 2004 reviewer had mentioned). After taking this class, I feel like I finally have the mastery of American foreign policy that IÂ’ve been seeking!! Education is difficult to appreciate sometimes, but professors like him really make me realize how lucky I am to be studying under such extraordinary professors at Columbia! I urge all students to take this class! \t\n\nWorkload:\nModerate reading (150-250 pages each week)! This is not an easy class, but if you work hard, you will get the grade you deserve! Moderate midterm, fun crisis memorandum, and a final that really requires you to think!\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "January 01, 2006",
            "review_content": "\nProf. Gottlieb is one of the best professors I have had at Columbia.  Though his lectures begin with a lot of American history, the class gets much more interesting as the semester progresses.  Although he may seem tough at first--he kicks out all freshman, sophomores, and auditors--he's really a nice, friendly guy.  He always responds promptly to emails, and he leaves time at the end of the lecture for people to ask questions.  The readings may be heavy, but you don't have to do all of them to do well.  His lectures are always engaging and exciting, and the material becomes current after the first third of the semester.  Take any class he offers.\nWorkload:\nA lot of reading, but you don't have to do it all.  Two papers and a comprehensive final--it sounds intimidating, but if you study you'll be fine.\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "December 06, 2005",
            "review_content": "\nLike a runner up in America's Next Top Model, this class just didn't pop for me.  Yes, Gottlieb is very organized and lectures were both entertaining and interesting, but I found I just didn't care.  I think this stems primarily from the fact that I expected a much more nuanced approach to American Foreign Policy from this class.  Instead, I basically got a rehash of the Intro course with some annoying historical information about Puritans in it.  Most of the information you get from the class is pretty obvious if you read the New York Times.\nIn addition, Gottlieb's analness drove me insane.  If I get one more email about the lateness policy I'm going to throw myself off a bridge.  Although I thought the assignments were somewhat interesting, it was sort of a crap shoot as to whether you would do a good job on them.  However, this could have been attributed to my personal lack of interest in the course.  Also, the reading list is absurd and the final does test your knowledge of it.\nAlso, I've never met a professor who is so bad at addressing students' comments.  I'd say Gottlieb misinterpreted what a student said about 75% of the time.  It was remarkable really.  I could see why people thought this was a good class due to its organization and entertainment value, it just didn't really enhance my knowledge of anything by the end of it. \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "November 14, 2005",
            "review_content": "\nRegardless of whether you are a poli sci major/grad student or not, you are CRAZY if you do not take a class with Gottlieb while you are at Columbia. He is the kind of professor that really draws you in from the very first day and gives you an unbelievable experience as a student, but he is also the kind of guy that you would have a blast just hanging out with outside of class.  Gottlieb is young, full of energy, brilliant without putting on airs, has really applicable knowledge and experience in the subjects he teaches, and always keeps you hooked.  His classes are just the right combination of really interesting factual info, discussion of current events, balance of varying viewpoints (the man can adeptly argue any side of an issue and never lets one opinion on politics, policies, people, or events dominate without keeping everyone on their toes by throwing a solid counter argument out) and, when you are lucky, his famously hilarious and subtly sarcastic side commentary (think John Stewart).  He is quite simply unforgettable, and everyone I know who took a class with him in the Fall semester couldn't wait to be in his class again in the Spring semester.  I have never learned as much or had my perspectives as opened up in a class, and it was all so painless and exciting.  It is a shame that he only teaches 2 classes here, because now after taking them both and really being changed and inspired by them, all my other classes pale in comparison.  Don't miss out on this one...\nWorkload:\nReally not bad, especially for a SIPA class.  There is a lot of reading, but it is all fascinating.  I still have my coursebooks and I am always digging them out to make people read various articles!  You definitely have to study for his final exams- some of the questions are pretty challenging.  But don't fret!  He gives you possible essay topics and a list of key terms in advance so you are totally able to prepare.  He never tries to trick you, and is always available to answer questions.\n"
        },
        {
            "course_name": "Terrorism and Counter-Terrorism",
            "review_date": "September 18, 2005",
            "review_content": "\nThis class was really rewarding. The arguments and the counter arguments presented really elaborated on current issues in U.S. terrorism policy, such as the torture issue and the deliberate intelligence organization that failed to piece together the 9/11 class.  Coming into the course, I had no idea what the 9/11 commission had said, nor the real nature of the threat of Al-Qaeda or other organizations.  Leaving the class, I felt like I knew about the structure of both the primary terrorist organizations and their developments AND our abilities to counter them. \nGottlieb as a professor makes the class very entertaining.  he constantly takes questions from the class and the course turns into more of an informed discussion than a pure lecture. By the end of the class, an extremely collegial atmosphere had been established. It's also entertaining because he responds in  a humourous manner to dumb questions that ensures future interrgators think more carefully about what they say.  I totally agree with the review of the Central issues in Amer. \nForeign Policy course.  \nOne more thing: the exams questions are some of the best I have had at Columbia: instead of asking the writer to recap information, in the essays you are rewarded for knowing the arguments, but then synthesizing them and coming up with cool ideas.  I do not like taking exams, but I actually enjoyed writing these in class essays.  \nThe one drawback during the course was that during the group presentations (about terrorist organizations), a lot of the kids had poor presentation skills, so it was difficult to hear and understand their points and made a few presentations tedious.  \nOverall, a really rewarding Poli Sci course that actually provides substance behind what you hear in the news.\nWorkload:\nNot too heavy, few hundred pages of reading a week that is really interesting.  Midterm, Final, and a big group presentation about a pertinent terrorist group.  \n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "March 10, 2005",
            "review_content": "\nHis name says it all: Gott (German for GOD) and lieb (German for lovely)...He is the funniest; wittiest and most entertaining lecturer I have ever had in PoliSci. And he is extremely eloquent and smart--in short: I wanted to have his babies...trust me you want to go to class every week and you get upset if you have to miss one..!!!! (and I will definitely try to take his Terrorism class next year)\nWorkload:\nIt is a GRADUATE level course--be prepared to be in class with SIPA students, though it seemed like they were graded seperately and they had slightly modified requirements..heavy in reading but grading is moderate and the memo exercise is really fun--contrary to the other reviewer I found the final really hard--even though you have the questions in advance it asks you to write two essays that cover the ENTIRE course in three hours---fairly impossible to do and it counts 50 per cent of your final grade...But: an A-/B+ is totally doable and NO extra DISCUSSION section--GOTT holds those discussions in every class....\n"
        },
        {
            "course_name": "American Foreign Policy",
            "review_date": "November 17, 2004",
            "review_content": "\nGottlieb is a very entertaining professor.  As a former speechwriter for Senator Dodd (D-Conn.), Gottlieb brings a knowledge of how Washington really works into the classroom.  He spends at least 10 minutes every class fielding a wide range of questions about current political events, and his time as an insider gives a fresh perspective.  The one pitfall of this is the questions asked by the students in the class.  The questions are often uninformed and not well thought out.  However, this means that Gottlieb, who has a quick wit and a propensity to use it, often responds quickly and in a way that embarrasses the unintelligent questioner.     In terms of the class itself, it is not particularly difficult.  There is a decent amount of reading, but most of it is extremely fascinating.  If you are interested in the history of U.S. foreign policy and how that history informs current viewpoints, then take this class.  Lecture is interesting, but if you are well-informed about international political theory, you will probably find it elementary and, at times, frustrating.  I wonder why it is considered a graduate level class.  My one gripe about the class is the lack of discussion session; the readings are good enough that discussion would be interesting, and it might prevent students from asking dumb questions during lecture.    Generally, if you want an entertaining professor who is not too difficult and offers an interesting perspective, I recommend this class. \nWorkload:\nlight-moderate: 175 avg. of reading a week, but mostly interesting stuff.  One midterm, which, if you put in some time and know a decent amount about American foreign policy and history, is easy.  One policy memorandum paper: 2-3 pages, but a fun exercise\nIn-class Final,  \n"
        }
    ]
}