{
    "prof_info": [
        {
            "prof_name": "Robert Krauss",
            "prof_id": 1118,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Human Communication",
            "review_date": "February 18, 2007",
            "review_content": "\nI could write about how this is the worst class offered at Columbia for hours. It is a shame that Columbia offers such a course. If you are a SEAS student, avoid this class at all costs. In the beginning of the semester Krauss goes through powerpoints of sound graphs with the wavelength labeled as the frequency and when I tried to explain to him the difference between the frequency and wavelength he tried to play it off like I didn't know what I was talking about, which was an insult in front of the class. The material is totally subjective BS and has seemingly no scientific basis. Before the midterm I attended every lecture and studied for the test for hours. Confident in my abilities I took the test and thought I aced it. When I received a 50% I stopped going to class. My friend who is a psych major studied with me for the same amount of time and he got a 48%. Attending this class eliminated the minimal respect I had for psychology and actually made me dumber. Even psychology majors know this, or they have been brainwashed by the course or are just plain idiots. Krauss is unapproachable and seems to know very little science, even statistics. That's why all the experiments they discuss are biased in some way. The TAs are terrible as well. If you are full of BS and don't know science, you'll like this class and probably do well. Do the extra credit project. The paper was fairly graded and I got a 95 on it. As for the technical jargon, it isn't technical at all. It really doesn't mean anything scientific. These are all controlled observations that may influence you to think about a certain group under certain circumstances in a particular way. You will lose intelligence by taking this course and respect from your peers, especially me. I am ashamed I ever took this class. Nuff said.\n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "May 18, 2006",
            "review_content": "\nI was nervous to take a class with Professor Krauss after reading such scathing reviews here, but it was a lot more low-key than these reviews would lead you to\nbelieve. Krauss tells you exactly what he expects of you straight up and you have a website that outlines\neverything- just in case. He's most definitely NOT a\nbrutal grader, though I do echo everyone in that you should do the optional project. I liked Krauss and\npersonally, I get the sense that he likes his students,\nbut he's stubborn about things like punctuality and deadlines. Class can be a bit dull sometimes, but I think he'd be a lot better for a seminar.\nWorkload:\nMidterm exam, term paper, optional project, final\n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "September 12, 2004",
            "review_content": "\nI cant stress enough, how benificial it is to do the extra credit assignment.  I made a pathetic grade of a 38% on my midterm, and still managed to make a B+ in the class.  In regards to the midterm, make sure to ask the TA's what information they are looking for on the tests, cite the experiments.  Before the midterm the TA's claimed they were looking for \"overall concepts\" which is crap because the tests often ask for very specific details from the readings and the lectures.  Memorize the charts, there will undoubtedly be one on the test, and you can stop reading the Pinker book after the midterm.  Despite Krauss's claims, the PInker book will not have you laughing outloud on the subway.  As far as Krauss, he will surprise you with some unexpected sarcastic comment and he gets a big kick out of playing his sound files.  \nWorkload:\nA lot of readings.  One paper, midterm, final.  \n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "August 02, 2004",
            "review_content": "\nWhile his lectures are usually entertaining & interesting, don't be fooled by this kind looking man.  He is one of the most brutal graders I have ever come across.  His TAs didn't really help much either.  At a review session for the final, they answered every question with \"We don't know\" or \"We can't tell you that\", and it was an absolute waste of time.  Professor Krauss says that he'll curve grades, but the curve really does nothing for your grade.  He doesn't assign a set of books--instead, he assigns one book on a list of recommended books and says that the other ones are boring on the first day.  So, naturally, students don't read them.  Then when you start questioning where the random material on his exams are coming from, he asks you how come you weren't doing the readings.  He also assigns lengthy articles online to read.  \nWorkload:\nA bit overwhelming--it's not REQUIRED, but he recommends that you read the articles that he posts online as well extra subject material, AND the texts that he assigns.  The midterm and final exams are very tough--I recommend that you don't miss a single lecture if you really want to do well on them.  He pays much attention to detail, and this can include how a diagram looked in class lecture, to the wording of one of the sentences in one of the texts.\n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "May 13, 2004",
            "review_content": "\nI took this class to complete my science sequence requirement, which I understand they just got rid of (bastards!). Overall, I thought it was pretty good. The material ranges from blandish terms to pop science-y stuff, with the material getting better in the second half of the semester. The lectures are super-organized, with him whipping through power point. it's hard to keep up with sometimes, but he provides old lecture notes online that help come test time. My real problem with the class is that he was kind of a jerk. He didn't do anything that overtly mean, other than give stupid answers to stupid questions, but I didn't get the sense he liked students that much. He just gives off that vibe. He's also completely inflexible and horrifically anal, so don;t bother asking for extensions.\nWorkload:\nNot a whole lot of reading, just go to all the lectures. Midterm, Final, fairly interesting paper and an \"optional project.\" I put it in quotes because you're an idiot if you don't do it. For one or two days' work, you can add up to 15 points to your FINAL grade. I went from a B- to an A- cause of it, and I almost didn't do it. Phew.\n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "May 15, 2003",
            "review_content": "\nThe professor is a very nice person.  Thats about the only good thing I can say about this class.  Professor Krauss is not very eloquent, which can make attending the lectures boring and painful.  Most of the readings are filled with ridiculous academic jargon, the tests ask for really nit-picky bits of information and the TAs are hard graders.  A word of warning: this is not a good class to take to fulfill the psych sequence.  The first half of the semester has almost nothing to do with psychology and everything to do with linguistics.  So if memorizing the area of the vocal tract in which each consonant is formed doesnt appeal to you, you will be in for a rough time. \nWorkload:\n2 short papers, midterm, final, theoretically optional project.   It doesnt seem like a huge amount of work, but everything is graded very harshly, and the class is curved so the optional project is really a necessity.  \n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "April 29, 2003",
            "review_content": "\nI'd like to put in a good word for Professor Krauss and for this course. While it may not be the stuff of epiphany, I found it a painless and often pleasant way for a humanities student to fulfill the science requirement. It's entirely qualitative, and I didn't find the material as dry or banal as the other reviewers. Human communication is such a nacent field -- it's kind of exciting to analyze competing theories rather than memorize \"accepted fact.\" \nAs for Krauss, he's sweet and careful in a grandpa sort of way, and he clearly puts a lot of effort into preparing his lectures and making them as interesting as possible. Having suffered through a different intro psych professor with virtually zero sense of humor, I appreciate playing guessing games based on the accents of people who phone in to \"car talk.\" I also don't find it particularly self-indulgent or boring when he presents his own findings to the class. I would rather he be interested in his subject matter and want to share it with us than treat the course with an indifference that boarders on scorn (again, I'm thinking of my previous psych experience). Overall, a decent class, and as an anthrophile, i'm thrilled to have taken it for my science requirement rather than something with numbers, say, or even (shudder) electrons. \nWorkload:\nThe reading is much heavier for the first half of the semester than the second, but it's not like you have to do all of it. Midterm (not that hard if you study, especially given that he provides two exams from prior years with practically identical questions), final, two short papers\n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "December 25, 2002",
            "review_content": "\n1 of the worst classes i've taken at Columbia. boring lecturer. Organized and has you scribbling notes from his slides, but information is often useless and uninformational (ie \"speech is a series of sounds that form letters that form words...\" Spends inordinate amounts of time detailing his own studies and the methods he used, every tiny conclusion he reached, without realizing that he's the only one interested in them.\nWorkload:\nhard midterm, final, and an extra credit project that isn't really extra credit since everyone does it and the grading is curved.\n"
        },
        {
            "course_name": "Human Communication",
            "review_date": "May 17, 2002",
            "review_content": "\nThe art of navel gazing has been perfected in this incredibly banal course. You learn less, if anything at all, about how humans communicate than you do about how psychologists have perfected academic lard: i.e., Post-postive turns;sequential implicativeness; heuristic based referents, are just examples of the constipated clutter in the neural paths of certain, if not all, psychologists who deem it their calling to write papers and texts. The intensity of boredom that this (and the class) generates is only matched by waiting for the number 3 Express train after midnight. Krauss can be funny and charming - - I liked the man - - but the course is pathetic. He missed his real calling - - The Borscht Belt. \nWorkload:\nAcademic lard makes the workload egregiusly noxious. The T.A.s , often confused, disagreed in review sessions, and were always promising to get back to us. We're stil waiting.....\n"
        }
    ]
}