{
    "prof_info": [
        {
            "prof_name": "Ana Mendez-Oliver",
            "prof_id": 6343,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "July 15, 2011",
            "review_content": "\nI find the other review really off- base.  Ana is a really intelligent, pleasant, funny young woman.  Who ever wrote the last review just has sour grapes over their grade, or over their life, or maybe is a misogynist or has issues with their mother and is projecting a whole load off boloney on what the class and Ana was like.  Really, don't hesitant to take any class with Ana, she's fine.  And, if you're lucky, she might even teach you some Puerto Rican slang, or some Puerto Rican sass, as she's brimming with it.  (FYI kind of a character, dresses, heels every day like she were going to a Caribbean debutante ball.. .haha. .My only warning as regards the class is that you might learn a bit more about floral patterns and synthetic fabrics than you'd like...:) )  \nWorkload:\nFine.\n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "May 09, 2010",
            "review_content": "\nThis class failed so hard. She didn't show up to the first class. I should have taken the hint. Not terribly difficult, but the workload was excessive. She obviously didn't care about the class at all, considering all of the awkward discussions and questions/answers we had. I took this to practice my Spanish, but that did not happen. I don't regret having taken the course, but I wish I would have had a more enthusiastic professor. I do get my AP credit, whatever that means. The class began with about 12 students but there were only 8 of us at the end of the semester. She always complained about how \"the same people are always talking.\" OBVIOUSLY. THERE ARE ONLY 8 PEOPLE IN THIS CLASS. The same people will ALWAYS be talking. Aside from her lack of care, I don't have much to say about this class.\nAvoid if possible. You really have nothing to gain from this class, other than excessive assignments and apathy/monotony. \nWorkload:\n1-2 page paper due every week, plus revisions. I believe other sections only have to do this every other week so it's a bit excessive. Reading. 2 research presentations, final research paper. Participation. \n"
        }
    ]
}