{
    "prof_info": [
        {
            "prof_name": "Pierre-David Letourneau",
            "prof_id": 12739,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "January 15, 2014",
            "review_content": "\nDO NOT TAKE THIS CLASS WITH LETOURNEAU. it seems like a really cool subject, and maybe letourneau would have been good at teaching something else, or with a few more years under his belt; but for now, do not take functions of a complex variable with letourneau. i got an A in the class, so i say this without any spite: this was the worst-taught class i have ever taken. before i give my opinion on why the class did not suit me, i can offer 2 concrete reasons why it is a class that you should avoid at all costs:\n1. the class does not cover all of the material that you need to learn in the subject, and the topics that were left out were the most important ones in the course (fourier, laplace, and schwarz-christoffel). the bottom line is, you will either need to go learn these topics on your own or take another class in complex analysis if you actually want to use any of the most important applications of the subject.\n2. the professor will not match the amount of work you put in (unless, of course, you put in little to no work). letourneau was completely unprepared in lecture. he had very few office hours and frequently cancelled or rescheduled them. there were significant errors on every posted homework assignment, and they often went uncorrected until just 2 or 3 days before the assignment was due. there were frequent errors on the posted solutions. homeworks were not returned until over 2 weeks after they were handed in, and there were frequent grading errors. there were errors on the exams as well, and there were often crucial errors in the lecture notes.\non a more subjective note, i found it unacceptable the way he handled the lectures. for one, the lectures didn't prepare you for the exams. in fact, in lectures, he deliberately misled you about the exams when asked specific questions about their content. the exams were hard, but they would have been much more manageable with the exact same questions if we had been prepared in class for those problem types. even if the exams had been closely related to what was in the lecture notes, i still would have been very upset with the way the lectures were conducted. i'm sure there are plenty of professors who don't care enough to prepare thoroughly, but i would hope that they at least follow the book, or use the notes of a previous instructor. i don't know if it was foolishness, arrogance, or complete incompetence, but letourneau seemed to think he could grab a few theorems from book sections and then structure a 2.5 hour lecture around them, on the fly, from his own subject knowledge. he would often start an example, spend a few minutes struggling through it, and then say: \"oh wait, this actually won't work,\" and then cross it all out and think of a new example. another laughable element was his \"proof sketch\" method, which consisted of a bunch of disjointed mathematical phrases, with inconsistent notation, scattered across 3 or 4 blackboards and connected by a tangle of long, squiggly arrows intended to reorganize his out-of-order thought train. it was as if we were the guinea pigs for a mock, live-action improv textbook that will never be written. in retrospect, i highly regret attending the lectures. \nalso, the ta (jeff) was even less prepared than the professor. i went to 2 of his office hours over the course of the semester, one at the beginning and one near the end. both times, every question that was asked, directly from the homework, struck jeff as the first time he had ever seen, heard, or considered it, and the students sat around while he tried (and often failed), for an inordinate amount of time, to figure out how to approach the problem. the only difference between the 2 sessions i attended was that the first one, which was the first or second meeting of the semester, was well-attended, whereas the second one was almost empty. the only other people there by the end of the semester were a few students who clearly went every week just to exchange answers and work through difficult problems together (without the ta's help). \nthis class was an abomination, and i'm horribly disappointed that columbia allows this kind of thing to happen. while it stood apart as the worst class i've ever taken, it wasn't alone in the realm of terribly conducted columbia math courses, and this pattern clearly reflects a lack of oversight on the department's part. at least when it comes to math, there seem to be no resources whatsoever devoted to ensuring teacher quality, and especially ta quality. it is understandable for an elite university to place greater importance on the research contributions of faculty than on their teaching contributions, but not all professors have to teach! isn't that what adjuncts and tenures are for? why do they give assistant professors and professorship fellows any classes at all? they've got plenty of veterans who've been doing this for ages, and plenty of money to fill in the gaps by bringing in adjuncts who can be hired specifically for their teaching ability. i'm not saying columbia should get rid of letourneau, because i'm sure whatever scholarly contributions he makes are worth his salary and office space, but that doesn't mean the university needs to plague students with his horrible teaching and neglectful class management. poor form, columbia, poor form.\n\nWorkload:\nweekly (absurdly long and unhelpful) problem sets. 1 midterm. 1 final.\n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "January 10, 2014",
            "review_content": "\nI agree with the other reviews that the class was a bit disorganized. However, Professor Letourneau was overall not too bad. His lectures could sometimes be confusing and hard to follow, but I don't think it is his fault that the material he teaches takes time to absorb and understand. He always responded to our questions on Piaza, and was very helpful during office hours. I ended up not doing as well in this class as I hoped, but I wouldn't say it's his fault. If anything, I think the undergrads just get unlucky that the class is filled with graduate students, many of whom have already taken the class. \nWorkload:\n10 problem sets (each takes a few hours, some are easier/shorter than others)\n1 midterm and final \n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "December 17, 2013",
            "review_content": "\nSo, I thought this class started off as a train wreck. It was his first semester teaching and it showed. However, he was extremely responsive throughout the semester. He usually replied to questions on piazza within an hour. He told us to let him know if there's anything we want to do to improve the course. He started off with it being very proof heavy and with long homeworks. He responded to student concerns and while the theoretical base for the class never really changed, he did less proofs and shorter homeworks as time went along. Unfortunately, while I found the course incredibly tedious at first (and agreed with some of the concerns), I found it highly inappropriate that people just completely crapped on him on piazza. I feel that can't be a great morale booster for a first time professor who is NOT THAT BAD.\nHis lectures are fairly decent. His handwriting takes a bit to get used to, but I now know what to expect (but he still writes super tiny so sit up close). I think it is more worthwhile for you to listen intently and try to understand than take notes. He teaches pretty much from the textbook and tells you whenever what he is writing isn't in the text. I used to take notes and not understand, but felt like it got better when I tried to just listen. He does do his own examples and notes, however, so sometimes in the middle of a proof or example he'll just stand and think for a minute to see if what he is saying is right. Sometimes, he'll decide to scrap the example and move on. I never really saw him phased by a question, he could almost always explain it, but he sometimes asked students to come to discuss it during the break (he gives a very generous 15-30 minute break in the 2.5 hour lecture).\nHe splits the homework and exams up for undergrads and grad students. Homework started off with 17 questions, then 7, then 5, usually 3 for both grad and undergrad, then 2 \"practical\" (computation) for undergrads and 2 \"theoretical\" (proof) for grad. Exams work the same way, except 2 are for both grad and undergrad, then 1 of each kind.\nBottom line: There will be people who bitch who didn't put time into this class. Yes, you'll need to put time in. A lot of it. I highly recommend reading Complex Variables by Flanigan in addition to the quite good assigned book. It took a while for everything to click for me, but when it did, the course became much easier. I did well on (most) of the homeworks and I think I did very well on the final. Completely bombed the midterm. Due to his grading scheme, though, it won't hurt me. Most importantly, I came out feeling like I understood the material very well, though a lot of it was due to my own work.\nWould I take him again? Yeah, probably. The only thing holding me back was the exams and the final definitely tested to see if you knew the concepts more than how to compute hard math, while the midterm didn't (so he learned).\nAlso, his TAs need to be on the same level. My homework grades varied wildly based on who graded it. I would work on it with 2 different people, we'd all hand in the same exact homework and all get different grades.\nWorkload:\nI thought it was pretty rough, especially in the beginning. It got easier as time went along. 10 problem sets. He drops one if you do a \"bonus\" HW at the end of the year (which was the length of like 3 problem sets, but was good review for the final. His homeworks are NOT easy. He takes problems from the book, then makes them 5 times more difficult. He ended up dropping the midterm for people if you did poorly on it. Usually 30% midterm, 30% hw, 40% final, or 45% hw and 55% final. I thought the midterm was pretty tough, quite computationally difficult (didn't test concepts, but how well you can do math), 3 questions with a few parts each. Final was not too bad! Graded in 4 parts, 2 of which were integrals that were easy if you studied the material. Third was doable, but more tricky, last question was very difficult. \"Cumulative\", but covered nothing directly from the first half.\n"
        },
        {
            "course_name": "Functions of a Complex Variable",
            "review_date": "December 12, 2013",
            "review_content": "\nDO NOT TAKE THIS CLASS. WORST PROFESSOR EVER. I can't believe I'm taking time out during reading week to write a review for this class. This is probably how upset I am in this class.\nProfessor Letourneau is a young guy. Just got his phD from Stanford and probably only a few years older than most of us. Whereas most of the younger professors are easy to get along with, he is NOT. First of all, he is a horrible instructor. He began the class by teaching complex analysis (as composed to complex variables) and promised not to anymore. Did he keep his promise? Not necessarily. His lectures became even more theoretical throughout the semester to the point that a lot of the students in the class stopped showing up. We would have taken Complex Analysis, offered by the Math Department, if we knew that he was going to teach it like that.\nThe homework, however, was completely practical. Actually, it was very computational and you get the ugliest answers ever. You never have to look back at your notes to do the homework. Thus, going to class is indeed completely unnecessarily. You should save yourself from going to this class Monday evening and just teach yourself. Oh yeah, there is a lot of typo on the homework assignments and even in the solutions that it doesn't help. \nThe exam is brutally hard. The average was a 70% on the mid-term. Is there are curve? NO. He offered to be \"lenient\" and do it so that our final exam grade will override our midterm exam grade if we do better on the former. Oh, he also mentioned in the last class that the final exam will be significantly more difficult than the midterm exam. So thanks for the leniency.\nA couple of things now regarding grading. Homework is not easy, but doable. Most kids get a 90%+. You have 10 homework assignments, but you can only drop an assignment if you do a bonus homework assignment (I know that there isn't a written rule in this, but don't most professors drop an assignment regardless?) But the work you had to do on the bonus homework was x5 the amount on your regular homework, so it was essentially impossible to complete. The class made rational and earnest pleas to extend the deadline for the never-to-be-returned bonus homework (there were 15+ students asking for extensions at 5am), and Professor Letourneau completely shut everybody down. In fact, he commented that we shouldn't \"rant\" (we were making earnest requests Professor) and erased all of the comments later on. Talk about communication with the Professor!\nI have an exam in this class in 4 days and I don't know how I'm going to do. I'll probably end up with an A-, but this was the most annoying class I have ever taken at Columbia. I heard he's teaching numerical methods next semester.. for any sophomores/juniors considering to take it Spring 2014, DO NOT TAKE IT. I can guarantee you that he will make you hate that class.\nWorkload:\n10 Homework Assignments (Take 3 hours per week)\nDifficult Midterm (Avg 70%)\nTold to be an even more difficult final exam\n"
        }
    ]
}