{
    "prof_info": [
        {
            "prof_name": "Songtao Jia",
            "prof_id": 4017,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular Biology",
            "review_date": "June 04, 2019",
            "review_content": "\nJia teaches the first half of Molecular Bio, and it's generally regarded as the crappy half. It's not totally his fault; you spend more time learning about chromatin than anyone should ever have to. But it's mostly his fault, because he's a really dry, hard-to-understand lecturer. He'll often inadequately explain a concept, get a question about it, and then give the same poor explanation. His slides are also remarkably unhelpful, even if you take notes on them.\nHis midterms are a pain - you have to be super specific in your answers or you'll get tons of points off. He asks lots of \"design an experiment\" questions, and since he always looks for one specific answer it's hard to get these right. Oh, and don't bother trying to argue for points back in office hours, because he won't budge. He curves pretty generously though, so stay a couple of points above average and you'll probably end up with an A-range grade.\nWorkload:\n3 midterms (2 Jia, 1 Manley) and a final (Manley). Midterms are non-cumulative, final is cumulative only for Manley's section.\n"
        },
        {
            "course_name": "Molecular Biology",
            "review_date": "April 19, 2012",
            "review_content": "\nj This is for the Molecular Biologreview_contents review_content.\nSongtao taught 1/2 of Molecular Biology while Ron Prywes taught the second half.\nTo be honest, Songtao was an okay teacher, nothing great, but not bad either. He has a VERY SLIGHT accent and tends to speak very softly (kind of similar to Tong for Biochemistry), but he's better at enunciating than Tong but maybe because the Molecular Biology classroom size is much smaller than the Pupin huge lecture hall.\nAnyway, to be honest, 95% of Songtao says is from the book, which does a better job of condensing everything than his lectures, which can go off in some unnecessary information directions.\nHis exams, along with Prywes, are DESIGN AN EXPERIMENT BASED heavy. Generally 60% of the points are memorization based while the other 40% are design an experiment. Of course people usually get the same grade on the memorization part so it's the design an experiment questions that determine your grade in the end.\nHere's an example question: something like: You have discovered a polymerase that binds specifically to the college gene. This polymerase is similar to polymerase II but not quite, as there are several different factors required for binding to the DNA/gene. How would you find out what these factors are? How would you check to see whether the polymerase dissociates immediately after transcription ends? \nSongtao does go through methods of doing experiments so it might be useful to attend lecture, but then again, if you work in a lab, you could probably read about these methods online.\nfor Songtao's half, HEAVILY recommend you read/memorize the 4-5 scientific articles per exam, because sometimes the design an experiment will be 90% similar to one of the experiments, with just a slight twist/variation.\n\nWorkload:\nYou have 5 problem sets....most of them you get 100%, but one of them was pretty difficult with people getting like 70%...in the end the problem sets account for about 1/2 a midterm.....you have 4 midterms, none dropped. 2 for songtao, 2 for prywes \n"
        }
    ]
}