{
    "prof_info": [
        {
            "prof_name": "Caleb Dance",
            "prof_id": 9761,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 04, 2013",
            "review_content": "\nCaleb is a fantastic teacher. He brings enthusiasm and passion to the class rain, hail or shine which really helps when you're trying to get through something as dull as \"To The Lighthouse\". His classes are a great mix of discussion and lecture and he provides historical context for each text, which is super helpful. Since he's also in the Classics department, he gives you a lot of great insight into the Greek texts in the first semester. Caleb is quirky and relatable and just one of those teachers that no one can dislike. He will also go out of his way to help you if you ask for it and is very reasonable with grading. Basically his class is great and you should definitely take it or you'd be missing out.\nWorkload:\nStandard - two essays (one 5-6 page and one 7-8), one midterm and one final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2013",
            "review_content": "\nCaleb was awesome as a Lit Hum professor! He's very upbeat and was always excited to teach, it made it hard to tell that it was his first time teaching the class. He's in the classics department, so that's definitely his area of expertise, but he was still very knowledgeable and engaging well into second semester as well. He's one of those people who doesn't really believe in tests (but still gives them out and grades them because he has to), and he really just wants you to get something out of each work that we read. I think it's saying something that nobody switched out after first semester! Stay in this class!\nWe also had a a pizza party and watched Big Trouble in Little China. You should ask him about it. \nWorkload:\nMidterm and department final, 2 5-6 page essays per semester, and thesis paragraphs every 2 or 3 weeks. \n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "December 09, 2009",
            "review_content": "\nCaleb really cares about how his students do, and I could tell he likes the language a lot. His grading is very fair, and he doesn't want you to do badly. He is always available to answer any questions. He's really enthusiastic, and this makes the course better. However, it seems like it's his first year teaching, and this means that he doesn't really have his own style yet, and mostly talks straight from the book during class. If you go to class expecting to hear a different perspective on the material you've just read, you'll be sorely disappointed. \nThe class also moves extremely fast. If you've taken Latin before, you'll probably have no issue with this, but since I was one of the few in the class with no prior Latin experience, I found it difficult to keep up with the pace.\nDespite these two complaints, I still feel that I have learned quite a bit in this class, and I would recommend the course to anyone who doesn't mind a LOT of work and is very interested in the language.\n\nWorkload:\nweekly quizzes, memorization of ~45 vocab words per week, twice weekly translation assignments of ~20 sentences each, two midterms, one final\n\n"
        }
    ]
}