{
    "prof_info": [
        {
            "prof_name": "Paul Richards",
            "prof_id": 2429,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "February 08, 2011",
            "review_content": "\nThis class was one of the first classes I took at Columbia, and I loved every single second of it.  Richards is the greatest nutty professor crossed with Sean Connery that there is.  Take his class, and giggle every single time he says \"dirty bombs.\"  \nIn all seriousness, though, the class is great, there are about 8 take-home problem sets that give you a good idea of where he's going with things (midterm and final wise), pretty light reading that is absolutely fascinating, and a powerpoint presentation on the nuclear subject of your choosing.  His lectures are a bit disjointed and rambly, but all of his powerpoints are posted online, and he's incredibly accessible (email, office hours, after class, etc) in case you have questions and to just talk about the subject matter.  While sometimes absentminded, Richards does care about his students, and definitely cares about the material he teaches.  Completely brilliant, I found his lectures to be mesmerizing and very thought provoking.  \nUltimately he grades very easily.  I pretty much failed the midterm (yes the averages are around 60%), struggled with the problem sets, but busted tail on the presentation and final and ended up with an A in the class.  There is a curve, and if you consistently show effort and enthusiasm, it will be taken into account.\nIf you have any interest in nuclear weapons, policy, physics or any combination of those, you will find the class and Richards' deep understanding incredibly fulfilling.  \nWorkload:\nTotally reasonable.  You have a month to work on your power point presentation, some light reading throughout the semester, and several problem sets throughout the semester with about a week's time allowance for each.  He posts all of his power points online, so compiling study material for the tests is straightforward.\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "May 15, 2010",
            "review_content": "\nI signed up for this class, excited and looking forward to the material.\nAs it turns out, I hated it. The material is good and straightforward but Paul Richards is one of the most boring lecturers ever. He is very long-winded, and sometimes pauses so much in what he's saying that it's difficult to mentally string what the hell he's trying to convey. The worst part about this class, however, are the TAs. Barely showing up to class, and when they do, only to hand back quizzes, the two TAs - Maxine Paul and some other guy whose name I don't even remember - were very inaccessible, and ridiculously hard graders. Moreover, the midterm was overkill - I reviewed all my notes, and we were allowed to use a cheat sheet but some of the questions were ridiculously unimportant, i.e. what was the location of where the Manhattan Project was developed? Like, who cares? I focused more about how these nuclear weapons actually worked, and then the TAs (who actually designed the exam - that goes to show how little Professor Richards is actually involved in the grading) decided to be spotty and pick and chose what they wanted to test us on, not on what was actually important.\nMoreover, the TA, Maxine Paul - terrible, terrible. One day, she came in to return our quizzes, boredly sat in a chair twiddling with her hair. And then another, when there were student power point presentations, she was obviously recovering from an all-nighter or something because she was exceedingly high-strung with the students. Worst of all, the final exam - before the exams were passed out, a student was chatting somewhat loudly with another one, and she rudely told him, \"Hey there, I'd like you to be quiet, because I'm trying to study here, okay?\" On the board, she wrote, \"Turn in all cheat sheets at the end of the class. k thx bai.\" Very immature, and unprofessional, if you ask me.\nThe workload wasn't toooo bad, but very harshly graded. Back to the midterm - 69% average. Thing is, you didn't even have to go to class. I went to every class, and got 64. Turns out, it's less about actually showing up and paying attention and more about what you put on your cheat sheet - this time, for the final, I made it 8 point font, 0.1 margins, and even then there were nitpicky little details I was asked. One of my fellow classmates even stopped going after class after a while, got 97% on the midterm, and ultimately realized all he had to do was look at the class notes online thtat Professor Richards placed. \nOverall, although he gave important information out, it was much too much, and the TAs were very strange about what they decided to put on the exams. The class presentation was perhaps the best part of the workload - however, somehow Professor decided it was better for us students to give each other comments rather than ask the TAs to actually give us more knowledgeable comments. I received excellent comments from others, whereas Professor had much more discerning reviews. I received a B for content, B+ for style, which wasn't too bad.\nI ended up receiving a B+ in the class, which probably goes to show that perhaps there was a curve. Was there? Who cares. Take this class if you have a photographic memory, or can read 8pt font a cheat sheet. Other than that, this is the biggest joke of a science class, especially when you're expected to list and describe nuclear accidents on a question in the final.\nWorkload:\nQuizzes periodically handed out (about 6 or 7 we were handed out, and for some reason the first one was worth 17 points - but afterwards, they went up to about 100 points. Not sure how that worked out. Mostly, they never said how many points they were worth until the TAs started doing it towards the end). \nMidterm - will burn you up. Make an 8pt font cheat sheet with the smallest margins you can get.\nFinal - Ditto.\nPresentation on something to do with Weapons of Mass Destruction.\nPeriodical readings about current events, sometimes explaining more in-depth concepts that Professor Richards brushes by in class.\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "May 12, 2009",
            "review_content": "\neveryone else is spot on. phenomenally intelligent and clearly an expert on the subject. his level of expertise coupled with the interesting nature of the material gives this class the potential to be one of the best i've ever had. unfortunately, due to his complete lack of organization and inability to ever functionally stay on point... it was one of, if not absolutely, the worst class i have ever taken. as others said, he says you need minimal science background, but that simply isn't true. furthermore, you can take answers directly out of HIS notes that he posts on courseworks for the quizzes and you still won't get full credit... even further, the seemingly beneficial point of being able to have a one page cheat sheet on the midterm and final is entirely irrelevant due to the fact that exam questions are based on the most minutely obscure details of the material, despite the fact that he says he only tests you on general concepts, not details. false, completely so. just for reference, the average on the midterm was a 128/210. yes, a 61%... though the lowest grade was a 29/210. seriously. someone actually got as low as a 14%. absurd.\nWorkload:\n4 Quizzes/Problem Sets. Midterm that will ruin your life. Final that will ruin your semester.\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "March 11, 2009",
            "review_content": "\nWhatever you do, do not take this course. While clearly an intelligent man, Paul Richards has absolutely no clue how to design and stick to a curriculum that makes any sense. He prefaces the class by declaring that only a basic background of physics and chemistry is needed for his lesson plan, and then proceeds to delve into every possible detail he can remember about a particular reaction or process. It's nearly impossible to tell what information he is simply rattling off the top of his head and what information is necessary for an exam or problem set. About halfway through a given lecture, nobody has taken down more than a single line of notes due to his unintelligible onslaught of random and useless facts. Worse yet, the TAs grade the work expecting 100% precision in terms of exact terminology. They look for what you did wrong rather than what you did right. \nUntil this man learns how to teach a class in a fair and focused way,  this class will remain a stress-inducing waste of time.\nWorkload:\nbi-weekly problem sets, midterm, final, presentation\n"
        },
        {
            "course_name": "weapons of mass destruction",
            "review_date": "May 24, 2007",
            "review_content": "\nthis class was god-awful. richards is a very clever man but a rubbish teacher. he has no patience for questions and zero interest in meeting with you to discuss the material. his lectures are utterly soperific. please, don't take this class - you will regret it. \nWorkload:\nharder than you'd expect! damn hard midterm will knock you out cold. presentation. medium-hard final.\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "April 09, 2007",
            "review_content": "\nThis is the worst class and the worst professor at Columbia that I've taken so far.  Not only is the class structured in a ridiculous way, but the tests are the most preposterous and unreasonable thing IÂ’ve ever seen during my four years at Columbia.  This professor expects you to memorize and regurgitate details like the ratios and raw numbers for countryÂ’s nuclear weapons arsenals and refuses to test you on what you should actually learn, like how the weapons work, etc.  If you want to learn absolutely nothing and be forced to sleep through 3 hours of this extremely boring class, I strongly recommend you take it.\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "January 18, 2005",
            "review_content": "\n(Class co-taught with Peter Bower)\nAbout the profs:\nThis was a fantastic class.  Professor Bower gave great lectures and really engaged the class well.  It was interesting to hear about his experience as an environmental consultant, as well as his work/visits to various sites, like Chernobyl. I know people find him pompous in Intro classes, but this was not my experience in this class at all.\n Professor Richards was less engaging, and had a tendency to remain aloof, especially during classes when he was not instructing.  A few times he fell asleep during class or otherwise zoned out, so when students asked pertinent questions and Bower asked for Richards' input, Richards had no idea what the question was.  To cover up his embarassment, he just gabbed about something totally unrelated . . . it was infuriating.  I also found his lectures rather boring, although it was apparent that he was very interested in the subject and wanted the class to ask questions, etc.  I hear he's teaching the class himself now, so I will let you all know that he does have redeeming qualities, too. (All is not lost!) \nFirst, Richards is a brilliant scientist and works on cutting-edge seismology research.  I attended one of his lectures about his own research at the Earth Institute last semester which was fascinating.  Also, if you ask questions or talk to him, he really cares about what you say and remembers who you are-- he even sometimes brings articles to class for individual students relevant to their independent projects, etc.  So, I'd say he's a very kind and capable professor, just a bit uncomfortable at first, and not used to teaching. (Last semester, I believe, was his first time teaching in a long time, if not the first time ever).\nAbout the class:\nThis class was nearly entirely dedicated to nuclear weapons, proliferation, and policy.  We did discuss biological weapons and chemical weapons, but my memory was that this was only 1-2 classes during the whole semester.  That said, the class content is great-- it provides 1. a crash course in particle physics (atomic structure, particle decay, etc., basically no math/formulas); 2. a critical understanding of the nuclear fuel cycle; 3. historical context, e.g. Hiroshima, Chernobyl,terrorist risks to power plants, etc.; 4. policy angle- knowledge of political climate and proliferation; and 5. places the issue on the front burner-- good preparation for students pursuing further study or who plan to become involved in policy or leadership positions in the future.\nI went into this class with nothing more than curiosity (and high school envi sci and physics) and came away with a great appreciation for the severity of the current nuclear situation and the fragility of our existence.  I even declared a specialization in envi sci after taking this class.\nThe workload is lengthy at times, but entirely fair.  I would say it is an easy B+/A- and for conscientious students, you will earn a solid--if not high--A.  \nAttendance: Not taken. Also, FYI: I am one of those people who does not attend meetings of bad lecture classes. So it does mean something when I say I went to every one of these.\nWorkload:\nproblem sets, fair and from class notes. in-class mid term and final, also utterly fair and I think we were allowed to use notes or a cheat sheet on both; powerpoint presentation on nuclear topic; readings include Hersey's Hiroshima, and tons of interesting articles from the NY Times and other sources. Buy the Nuclides and Isotopes book-- it's cool and pretty to look at, and useful to have as an educated human being.\nTake this class. You will not regret it. \n"
        }
    ]
}