{
    "prof_info": [
        {
            "prof_name": "Vangelis Calotychos",
            "prof_id": 2940,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 17, 2010",
            "review_content": "\nVangelis is an awesome guy; he's entertaining, has a deep British voice, and his fashion choices are...interesting. He's Greek, so he often gives unique insight into the etymology of characters' names and book titles.  However, his teaching style leaves much to be desired.   His lectures have a soporific effect on everyone in the class, and not much that he says is worth remembering.  We all felt pretty unprepared for the final and the midterm, but he seems to be a fair grader. The biggest problem one might have is, since he mostly just lectures, one could easily get away without reading, but not doing the reading will screw you for the exams.\nWorkload:\nLight, with the standard two papers and the midterm and final.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 21, 2009",
            "review_content": "\nVangelis is a funny man. Usually very professional at first, he'll always warm up about 20 minutes into class and doesn't mind digressing into entertaining anecdotes that may or may not relate to the text. Also, he is Greek himself, so he has some interesting inside information for the first semester (which is the only semester he teaches). Personally, I like him and he seems to understand the curriculum very well. \nHowever, this does not mean that his knowledge will diffuse over to you so easily. He spends equal time on every point he wants to make, whether it's a grand theme or an arguable subtlety. This means it will not be obvious when you should or should not be paying attention. At the same time, he's not going to get on your case for dozing off, in any sense of the word. There have been many front row sleepers but he doesn't seem to mind. \nThe only thing he really can't stand is computers so I suggest you buy a real notebook. \nGrades: there's no curve, but he grades as if there is one. It's basically a normal distribution: a few As, a lot of Bs, and a few Cs. \nWorkload:\nLittle to none. There will be the minimal two papers, a midterm, and a final but the midterm is completely fair and the final is universal to all lit hum courses. Just make sure you do the readings even if you didn't completely understand them. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2006",
            "review_content": "\nVangelis helped make Lit Hum very enjoyable. Being a classics professor, he had unique outside knowledge about the Greek literature of the class, explaining such things as the meaning of the name \"Oedipus.\" He expects a lot out of his students in terms of content on essays and exams, but he is not an extremely harsh grader.\nWorkload:\nStandard Lit Hum reading, two essays (5 pages and 7 pages), midterm which he models exactly like the final for preparation, and the department-created final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2006",
            "review_content": "\nVangelis helped make Lit Hum very enjoyable. Being a classics professor, he had unique outside knowledge about the Greek literature of the class, explaining such things as the meaning of the name \"Oedipus.\" He expects a lot out of his students in terms of content on essays and exams, but he is not an extremely harsh grader.\nWorkload:\nStandard Lit Hum reading, two essays (5 pages and 7 pages), midterm which he models exactly like the final for preparation, and the department-created final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2006",
            "review_content": "\nVangelis helped make Lit Hum very enjoyable. Being a classics professor, he had unique outside knowledge about the Greek literature of the class, explaining such things as the meaning of the name \"Oedipus.\" He expects a lot out of his students in terms of content on essays and exams, but he is not an extremely harsh grader.\nWorkload:\nStandard Lit Hum reading, two essays (5 pages and 7 pages), midterm which he models exactly like the final for preparation, and the department-created final.\n"
        }
    ]
}