{
    "prof_info": [
        {
            "prof_name": "Ralph Ghoche",
            "prof_id": 13122,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "May 01, 2015",
            "review_content": "\nI have mixed feelings about this course. Firstly, there is the whole three professors thing. Ralph taught Monday lectures and then the class was split into three sections for Wednesday seminar. The professors rotated the sections as the semester progressed, so you got each one for several weeks. At first, I hated this chaotic organization but I came to appreciate the fact that, unlike most classes with discussion sections, the seminars weren’t in addition to the M/W periods.\nThe workload is fairly heavy and attendance is required. There are approximately 60-80 pages of reading a week and “reading response questions” due every Sunday night at 7PM. The majority of your grade, however, is determined by two short writing assignments and a term paper. The two writing assignments require off-campus visits on your own time (one to an exhibit at the MoMA; the other to the Seagram Building). The term paper is due progressively over the second half of the semester. The first draft represents the first half of your paper; the final draft represents your entire paper. Finally, you are twice required to co-lead the Wednesday seminar along with another student in your section. Each of you must present one of the readings for that week. \nArguably the most annoying thing about this course is the due date for written assignments. Hard copies of all written assignments are due Friday mornings by 10AM on the fifth floor of the Diana Center. Submission deadlines at the end of the week take some adjusting to, not to mention that it’s difficult to drag yourself out of bed after staying up until 4 in the morning finishing said assignment. \nThe course also entails two site visits, one to the Lower East Side (led by Todd) and one to New Haven (led by Ralph). Both excursions were incredibly informative and fairly well organized. My only complaint was the unfortunate weather conditions on both occasions. The Lower East Side visit was on a cloudy day in late February, so the cold was to be expected. The New Haven trip occurred in the middle of a late-winter snow storm. It is difficult to appreciate New Haven's architecture with snow blowing in your eyes.\nThe professors themselves each have their own quirks. Ralph is pretty straightforward, always attempting to present as much material as possible in lecture. He is amicable and genuinely interested in the material, wishing to instill this same interest in his students. Leah is a bit more abrasive and will not hesitate to correct you in seminar. That being said, she knows her stuff and truly cares about her students. Todd...well, Todd is Todd (do read his CULPA reviews). He is approachable, light-hearted, and just so sassy.  He always wears a smile and rarely speaks without even the slightest comical intent (dry humor to say the least).\nWorkload:\nYour grade is broken down as follows:\nparticipation in the 12 Wednesday Seminars\t\t12%\n     (you must speak at least once each week!)\nweekly reading response questions\t\t\t12%\nseminar presentations \t\t\t\t\t16%\nwritten assignment 1 (400-500 words)\t\t\t10%\nwritten assignment 2 (400-500 words)\t\t\t10%\nterm paper outline\t\t\t\t\t5%\nterm paper drafts \t\t\t\t\t15%\nterm paper final submission (2500-3000 words)\t\t20%\n\n"
        }
    ]
}