{
    "prof_info": [
        {
            "prof_name": "Lindsay Koval",
            "prof_id": 2208,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 20, 2004",
            "review_content": "\nSimply amazing...nothing else to describe this class and this professor.  Easily, the best and most refreshing class I've taken at Columbia.  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 16, 2004",
            "review_content": "\nThis was honestly the easiest class I have ever taken. Like evry one else in Art Hum, I was simly hoping to learn a little bit about Art HIstory and how it all fit together, write a few papers, and get one step closer to finishing up the Core. Lindsey Koval was a pleasant surprise. She has the energy and enthusiasm of an undergraduate, and, not once, in a dark classroom at 7 o'clock at night did I fall asleep or get even close to falling asleep. Her passion and understanding of art and art history makes the class interesting, plus, she makes allusions to pop-culture that are a welcome break from dark brrooding Rembrandts. I have to say, that other than two papers a mid term and a final, I never thought about this class until I was sitting looking at slides. There is absolutely no outside reading, though she will recommend passages and texts to you if you are interested. \n    Her only drawback is that she can seem a bit flakey, canceling class at the last minute. It is obvious that this class is not her first priority, but why should it be? (Plus, a cancelled class is a must need break / celebration)\n   I would very much stress getting Lindsey Koval for a prof. She is interesting and very understanding and willing to help, extend deadlines. Furthermore, just because she talks quickly and has obviously read the latest edition of US Weekly does not mean she is stupid. She knows each piece of Art quite well, especially the sculpture, and is able to tie them together into one fluid course. \nWorkload:\nTwo papers and a midterm (which she gives you to prepare before hand but you must do in class) and a final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 14, 2004",
            "review_content": "\nSimply AMAZING! Seriously, truuuuuust me... you will love her class! \nWorkload:\nHonestly, almost none.\n"
        }
    ]
}