{
    "prof_info": [
        {
            "prof_name": "Steve Baker",
            "prof_id": 3204,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2016",
            "review_content": "\nHonestly one of the best and most thoughtful teachers I have ever had in my life, not simply Columbia. If you have the ability to switch into his class for Lit Hum — DO!!!!!! Best decision I ever made. \nThe man is a genius yet also insanely kind. A rare breed at this institution indeed. \nWorkload:\ntypical LitHum reading, a few pop quizzes, a night at the theatre etc. \nHe grades incredibly generously. If that's an incentive for you. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 16, 2016",
            "review_content": "\nHonestly one of the best and most thoughtful teachers I have ever had in my life, not simply Columbia. If you have the ability to switch into his class for Lit Hum — DO!!!!!! Best decision I ever made. \nThe man is a genius yet also insanely kind. A rare breed at this institution indeed. \nWorkload:\ntypical LitHum reading, a few pop quizzes, a night at the theatre etc. \nHe grades incredibly generously. If that's an incentive for you. \n"
        },
        {
            "course_name": "Lit Hum and British Lit. 1832-1900",
            "review_date": "August 24, 2015",
            "review_content": "\nSteve was the best thing that ever happened to me my freshman year. Coming from not a very strong background in literature and being haunted by lithum since receiving my acceptance to Columbia, lithum ended up being my favorite class both semester.\nSteve is the most understanding and kind professor, while not being a push over. His students respect him and you don't mess around and screws off/dont do the readings because you know you can get away without doing it. \nI went to steve for everything. office hours are great and make the most of them. even if you don;t have questions about the readings or and essay he loves when students just come by to chat. He is a great person to just chat with when things around school can get really crazy and overwhelming and he is always happy to do so. \n\nWorkload:\n3 papers a semester. Awesome essay topics-some of my fav essays to write in college. \noccasional pop quiz. if you participate in class and put effort into essays you will do fine in his class. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 24, 2015",
            "review_content": "\nI really have little to say about Professor Baker than that he is as close as you will get to an IDEAL LitHum professor.\nDoes he know what he is talking about? \nYes\nIs he passionate in class?\nAbsolutely\nIs he the kindest professor on campus? \nSurely\nAnd does he give fair grades?\nNO (he gives everybody much BETTER grades than we really deserve)\nIf you have professor Baker as your Lithum professor, you are blessed indeed.\n\nWorkload:\nAverage for Lithum.\n3 essays (use in depth analysis and you will do fine)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 03, 2014",
            "review_content": "\nBaker's silver nugget is very well-deserved. I have had Baker for two semesters of Lit Hum, and it has been a great experience.\nPersonality-wise, Baker is extremely friendly and helpful. He's really good at making everyone feel comfortable and part of the class. Last semester, he invited the class to eat dinner (prepared by his girlfriend) at his apartment. Because I told him that I was part of the wind ensemble, he showed up to our spring concert with his girlfriend to listen.\nIn class, Baker is very knowledgeable of the different works and facilitates discussions well. He frequently goes above and beyond by giving extensive background information on the texts and providing useful guides for understanding the works (for example, Baker created a useful list that summarizes the different events in The Histories). He also cracks some jokes that people usually don't get, but people laugh anyway since he's a fun guy. \n(important: Baker does not allow the use of computers in class unless you are presenting. He also requires the physical copy of the text)\nIn office hours, he is very helpful. He usually requires students to sign up to discuss the direction of their essays. His opinions and suggestions are very helpful for writing the essay. It's a good idea to discuss the paper before writing it, since he usually provides helpful guidance.\nAs for the grading, I think Baker is fairly lenient without being a total pushover. Most students in the class do well. \ntl;dr If you get into his class, consider yourself very fortunate!\nWorkload:\nEssays - there were two in the first semester and three in the second semester. They can range from 3 pages to 6 pages (4-5 on the average). You usually have at least two weeks to finish an essay.\nPresentations - he started this in the second semester in which each member of the class presents on a topic related to the book of that week. He gives more specific details to the presenters.\nPop quizzes - these range from passage IDs to comprehension questions. Not terribly hard, unless you didn't do the readings. He can be quite lenient on these quizzes (for example, only requiring answers for two of three passage ID questions)\nMidterms - not difficult if you did the reading. \nFinal - same as midterm. \n"
        },
        {
            "course_name": "Elementary I",
            "review_date": "April 14, 2008",
            "review_content": "\nSteve Baker is one of my favorite people in the world --- forget about professors.  He is very enthusiastic and funny.  He is a great teacher!  Take his section!\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "November 14, 2007",
            "review_content": "\nSTEVE BAKER IS AMAZING!!!! Oh my god I went into italian knowing absoloutely nothing but somehow he managed to actually teach me italian! He met with me whenever I needed to and reviewed whatever I needed to. He's always in a good mood...always bene bene bene...and he is one of the funniest people period. He makes funny sounds in class and he is so engaging and he just wants to be your friend!!! He is absolutely amazing if you have a chance to have him get him but it become pretty difficult just because everyone always wants him but if you have a chance take him!!!!! He's brilliant!!!\nWorkload:\nLab, workbook, compositions every other week, quiz every week, one midtem, one final, a presentation. This is for every italian I class so you're going to be doing tihs with every professor but with Steve it's amazing!!!!!!\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "November 11, 2007",
            "review_content": "\nSteve was fantastic! He is really nice and always wants to help you.  I had him for two semesters and did well without too much effort. He is not from Italy but makes up for it by engaging his class.  Take Italian with Steve! \nWorkload:\nStandard departmental work, but he is a very fair grader and will help with everything (even a quiz)\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "November 03, 2007",
            "review_content": "\nTake Steve Baker's class if you can. \nPlease, do it. He is amazing. He makes class enjoyable, efficient, and just awesome. He is extremely approachable and accomodating and creates a great classroom environment. Because he is a native English speaker, it is very easy for him to follow his students' train of thought if there is confusion about translation, and he is generally very good at presenting new material in an understandable way. We begged him to ascend to the ranks of Intermediate with us, but alas, he braves Elementary still, and has amazing patience even with those who are not so gifted with foreign language. I will take it personally if you don't appreciate him as much as our class did. The casual conversational excercises, along with Steve's open and helpful demeanor, ensure that you'll be speaking fluent Italian at parties in no time (not to mention bragging to your friends how cute he is!)\nWorkload:\nRegular Italian, workbook/lab chapter per week, 1 quiz per week, midterm/final, and bi-weekly compositions. Pain in the butt, but definitely manageable. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "October 31, 2007",
            "review_content": "\nI literally cannot think of a complaint about Steve Baker.  He is charming, enthusiastic, and throughly knowledgable.  It is evident that he truly wants all of his students to succeed and will do whatever is necessary to make sure everyone understands.  I looked forward to Italian with Steve because he makes every class entertaining and engaging, and I have never picked up the basics of a language so quickly.\nWorkload:\nTurn in workbook excersizes once a week (completely managable), one quiz a week , four short (100 - 150 words) compositions, midterm, final.  Steve is really understanding if people cannot get it done or have problems.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "October 31, 2007",
            "review_content": "\nI literally cannot think of a complaint about Steve Baker.  He is charming, enthusiastic, and throughly knowledgable.  It is evident that he truly wants all of his students to succeed and will do whatever is necessary to make sure everyone understands.  I looked forward to Italian with Steve because he makes every class entertaining and engaging, and I have never picked up the basics of a language so quickly.\nWorkload:\nTurn in workbook excersizes once a week (completely managable), one quiz a week , four short (100 - 150 words) compositions, midterm, final.  Steve is really understanding if people cannot get it done or have problems.\n"
        }
    ]
}