{
    "prof_info": [
        {
            "prof_name": "David Albert",
            "prof_id": 787,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "May 17, 2016",
            "review_content": "\nI absolutely hated this class. Not that I didn't find the material somewhat interesting, I did. But Albert was awful. He has a background in quantum mechanics, so if you don't know much about physics, a lot of stuff in his lectures won't make sense. Also, he's just not great at explaining things clearly to a group of undergrads. The lectures are not great. He presents a single problem, asks the class for possible responses, tears their answers apart, and eventually moves on without providing an answer at all. Each problem would take about 4 classes to get through. This got boring and frustrating. I realize that the problems he presents don't have perfect answers, but it would have been nice to at least look at what modern philosophers have to say about them. There were 3 essays. He only counted 2 of them for the final grade. The grading was VERY arbitrary with the TAs grading some, Albert grading some, there was no consistency. Also, he let you write about anything from the course, which was sort of annoying because he pretty much had already demolished all of the class' ideas on the subjects in class.\nWould not recommend.\nWorkload:\nweekly readings\n3 essays (2 of which counted to the final grade)\ngrading was very inconsistent\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "April 14, 2015",
            "review_content": "\nDavid Albert is a fantastic teacher. He really gets you into the mode of philosophical thinking. I took the Barnard equivalent of Methods and Problems, and while it was good, I appreciated that Albert took a less structured approach. Instead of reading out of a text book, it felt more like we were getting the chance to discuss philosophical issues with a really, really intelligent man. I would highly recommend taking the course with him, and YouTubing some of his talks because he always has something interesting to say. That said, if you have thin skin or aren't used to being criticized, exercise caution! I didn't find Albert unfriendly, but I know that some people in our class were a little offended by his mannerisms. \nWorkload:\nPretty typical of an introductory course--4 papers\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 18, 2014",
            "review_content": "\nVery challenging, thought-provoking, fun class. Should be called \"Intro to Philosophy of Science.\"\nProfessor Albert is a world-renowned physicist, who basically sauntered into a philosophy department at some point and has no reservations about slipping into quantum and statistical mechanics at a brisk pace, nearly every class. That said, the guy is incredibly smart and funny, approachable, and seems to genuinely care about \"doing philosophy,\" rather than simply memorizing thinkers and their own ideas. So you can expect each class to be introduced to a very complex philosophic problem, then get pointed toward readings in order to supplement and expand the discussion. So, if you miss a lecture, you better go to office hours, or have a good friend in the class to bring you up to speed. The Professor has office hours regularly, and is very good about breaking problems down and re-explaining material. As well, he'll give you more sources to scour, or topic ideas for assignments. And if you're bored, you can check him out on YouTube, or in the New York Times. Word of caution: if you think you're well-versed in philosophy and are looking for an easy A, this is NOT the class. Professor Albert has no reservations about the Socratic method, and you will leave each class stunned by the material. Topics covered include Causal Closure Physicalism, Aesthetics, Time Travel (awesome), Probability, Laws of Nature, Philosophy of Mind, Ontology, Poetry, Ethics, and Physics. \nWorkload:\nThree short papers, lots of fun reading. Fair grading. \n"
        },
        {
            "course_name": "Direction of Time",
            "review_date": "December 17, 2013",
            "review_content": "\nRegardless of whether you are majoring in philosophy or not, taking a class with this man should be on your before-you-graduate bucket list. For non-philosophy majors, I especially recommend methods & problems. \nProfessor Albert is the epitome of what a philosophy professor should be, namely, deeply disillusioning. If you let him, he will leave you more puzzled than when you began. His lecture style is very Socratic. He is not interested in giving you answers for free and will make you work for them. Maybe this is what rubs people the wrong way, but isn't this why we came to Columbia in the first place? To be forced to critically examine our worldview and, if necessary, uproots those pieces that do not stand up against such examination? And when he finally does offer his two cents, he does so in the clearest, most colloquial way, so as to make the typical philosopher blush. His ability to translate extremely complex and abstract issues into layman's terms is a rare gift in this field. In so doing, he is able to make philosophy extremely accessible, which is why I, again, recommend methods & problems to all non-philosophy majors. \nWorkload:\nMethods and Problems: 3 papers on a topic of your choice\nDirection of Time: His book, Time and Chance, which serves as the sort of textbook for the course, a few supplementary readings, and a final exam.\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "May 03, 2013",
            "review_content": "\nThis course does not have any pre-requisites, which it desperately needs. Professor Albert teaches as though the whole room has already taken linear algebra and basic quantum mechanics, and only 5 people really seem to understand consistently what's going on in the class. The lack of syllabus and sporatic readings make it very difficult to prepare for the class (short of reading his whole book, which is really just a typed-out version of his lectures). This class would be greatly improved if there were pre-requisites, or if Professor Albert spent the first three weeks, instead of jumping into the linear algebra and quantum mechanics, teaching linear algebra. \nThis is not a class for run-of-the-mill philosophy students--it's for science majors and astrophysicists.\nWorkload:\nVirtually none, except in the first few weeks there are two short homeworks that make no sense and everyone gets help. The midterm is a regurgitation of the homeworks, but, because everyone got help/googled/begged someone to do the hw for them, 1/3 of the class got between a 15-20/20, 1/3 of the class got between 10-15, and the last THIRD of the class got below a 10. \n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 17, 2012",
            "review_content": "\nI think David Albert is a wonderful professor. I understand why people might get annoyed with him - he is a strange man with an odd style of speaking and, yes, sometimes a \"goofy grin\" on his face, lopes around the room with a similarly goofy slouch and sits with his feet up on his desk (if he's not sitting cross-legged on top of his desk). But I came to understand these things not as an indication of carelessness, or not wanting to be teaching, as another reviewer suggested, but of a truly free spirited teacher who cares not so much about the presentation of his ideas as much as the consistency of the ideas themselves. This could have been a problem in a more-lecture based class in which we had a limited time to learn certain points, but the format of our class was an open-ended one in which this attitude was ultimately very effective. Often times it took a long time - an entire class period or more - for even a basic bit of clarity to emerge, but when it did, I often found myself marveling at the incredible reasoning powers of Professor Albert. His method, in which he basically fields questions and suggestions from the class and systematically rejects almost all of them, can be extremely grueling and exasperating, but at the end of the day, I always found that my exasperation arose not from dissatisfaction with him but with a dissatisfaction in my own ability to reason things out in a logically consistent way. Looking back now, I recognize that I was in the throes of some real - and quite wonderful - intellectual bewilderment, which, in fact, was one of Albert's stated goals for the class. He wants to create a confusion in which students find their beliefs and reasoning skills deeply undermined; a confusion out of which we had to climb on our own, piecing bits of logic together for ourselves rather than having them told to us. I think that if people are patient, they will find that his class discussions lead to profound and extremely rigorous conclusions--or, if not conclusions per se, highly honest evaluations of our current state of understanding of a topic. \nThere were certainly times when his incessant interruptions became frustrating - especially when our T.A. would try to join the discussion. But he would often recognize that he was being too harsh and apologize for it. \nSome parts of the semester were presented more clearly than others - I personally found Albert's statements in our discussions of Philosophy of Mind to be especially puzzling and unsatisfying. \nBut this was the first time he had taught Methods and Problems, and when, on the last day of class he let us voice our overall opinions of the class and his teaching, I think he took our feedback to heart.\nSomething else I noticed about Albert is that he is a somewhat rigid thinker. I don't mean this in the sense that he is closed-minded; rather, it seems to me that he has found certain ways of explaining things and largely sticks to those ways of explaining them. I watched a video interview of him, in which his arguments, statements, metaphors, etc. were often word-for-word identical to things he had said in class. But this isn't a complaint- I think that he uses these certain explanations because they really work and communicate his ideas in a clean and direct way. Many of the points he made in class, and indeed his style of speaking and reasoning as a whole, has had a powerful and lasting impact on me. \nOverall, my opinion of Albert is that he is an extremely genuine man and a brilliant thinker who will turn you into a more rational person if you let him.\nWorkload:\nTwo medium-length papers and a 10 page final paper. Fairly graded, on the easy side I'd say. Final grade entirely determined by the essays.\nDoing the few readings helped for class discussions and essay writing.\nThe most important thing is to focus during class and follow the logic of the arguments being made. If you don't, you will have a hard time making a good argument in your paper.\n\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "December 11, 2010",
            "review_content": "\nProf. Albert approaches teaching with a loose and fluid style that more resembles storytelling than lecturing. I did not want to take philosophy of science and had no interest in the topic, but it was a requirement for my major. Nevertheless, I left Albert's class with a completely different view of science and a profound appreciation for the subject. At the beginning of the semester, Prof. Albert told the class, \"You know you are in a good philosophy class if you leave the class more confused than when you came in.\" I left Albert's class absolutely more confused than I had come in, but the reason for my confusion was due to a radical confrontation of previously unexamined ideas I had about science and the way we experience the world. If you are the type of person who doesn't like going to class. If you want to be spoon-fed equations and procedures and take plug-n'-chug style exams, don't take Albert's class. You won't get anything out of it. On the other hand, if you are willing to take new material seriously and aren't afraid of a real philosophy class, jump on this opportunity. Prof. Albert's teaching style is unconventional. He is less concerned about participation points, homework, and exams than he is about the material itself. He is an expert in his field, and if you approach this class with due respect, you won't regret taking it. Appreciate the time you get to spend in the presence of genius. \nWorkload:\nReading that I was not tested on. Midterm exam. Final 15 page paper.\n"
        },
        {
            "course_name": "Direction of Time",
            "review_date": "August 12, 2007",
            "review_content": "\nI would have once said that I am \"amazed\" that a professor like Alberts is still allowed to \"teach,\" but for any Columbian who's finished more than two years of education knows, the quality of instruction can varying across orders of magnitude from horrifically bad to exceptionally terrific.  While Alberts does not fall in the former, he is definitely below mediocre and subpar.  Bottom line: He simply doesn't care about teaching.  It is obvious that this is a chore for him, and one which he does with the greatest detachment from his students.  He didn't create a syllabi, stick to any coherent plan of lecture, rambled while seated well over 95% of the time without ever writing on the board, and used a horribly written, largely unreadable text, which he himself authored: Time and Chance.  In addition, as if this were not bad enough, he would never give details about grading, announcing late into the semester that either a single final exam or a 25 page paper would be the sole determination of grading.  He never ever responded to any emails, and would become visibly irritated with any questions after class, instructing people to email him, which again he never would respond to and use the common excuse to all of never having received any email.  I am not impressed by this so-call \"professor's\" brillance.  Where is it?  What has he done to genuinely earn this distinction?  Has he solved any outstanding problem in either physics or philosophy?  No.  Has he achieved an academic performance and excellence in teaching that would be the envy of his peers?  No.  People have mistaken confusion with the notion that somehow Alberts is on a level beyond ordinary men and women--a notion that was held by those majoring in the soft-sceinces like philosophy.  No science major thought this, as Alberts routinely failed to convey simply what were often very simple concepts.  Not once did Alberts even write a single equation on the board!  How can you discuss the philosophy of science without the language of science?: Math!  This was among one of only two regretable classes I ever took as an undergrad, the second being a mandatory English class that was turned into the soap box of a ranting, pretentous, jaded, so-called \"feminist\" English lecturer who saw misogyny in ever passage of male-written literature.  How I would love to have them both dungeoned together, lecturing to one another until both have gone totally mad.  Apparently, however, if one is only partially mad, that is still acceptable for the purposes of worthless lecturing to undergraduate, so long as tuition is fully paid that is.\nAvoid this charlaton parading as an academic.  He is fraud and slacker.\nWorkload:\nJust Alberts Time and Chance book and either a final 100% exam or 25 page paper.\n"
        },
        {
            "course_name": "Direction of Time",
            "review_date": "November 24, 2006",
            "review_content": "\nMany claim this man is supposedly \"brilliant.\"  How brilliant, however, can he truly be if he cannot get in his own head right the concepts he so struggles in conveying to his audience?  The man is a total pompus ass without reason or cause for his arrogance, which is totally unjustified.  I got a B+ in this BS course, and I counted my lucky stars that I got that grade.  This was the course that made me swtich from philosophy to physics, for the former is a total pursuit of nonsense by nonsensical little minds dressing up as something more than vacant post-modern retardation.\nLastly, the man needs to take lessons in basic grammar, for he can't write worth a damn.\nAs far as I and many others are concern, he is a total embarrassment to the Columbia faculty.\n\nWorkload:\nRead his dumb, unreadable book, Time and Chance, and either write a 25 page research paper or take his one final exam.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "June 03, 2006",
            "review_content": "\nDavid Albert is a horrible professor. His lectures are discombobulated and he wastes an incredible amount of time in class  re-explaining the same material over and over and over, leaving you with a sense that even Albert doesn't know where he is going with the material. If you have questions, don't bother e-mailing him, visitng his office hours, or trying to catch him after class. He will not respond to a single e-mail you send him, frequently does not show up to his office hours, and will immediately dart out of the classroom after lecture, shooing people off, directing them to e-mail him. It took Albert nearly 4 months to grade my final paper, during which time he did not respond to any of my inquiries as to what was going on. I took this class in the Fall and he did not submit my grade until the summer. Simply put, Albert is absolutely awful.\nWorkload:\nOne final paper, 100% of the grade. ~15 pages. Don't expect your grade back anytime soon.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 16, 2006",
            "review_content": "\nDavid Albert is a wonderful man.  In no other Lit Hum sections that my friends were in did they ever spend hours talking about \"why this passage is beautiful\" and nothing else.  If this type of discussion sounds interesting to you, I highly recommend getting into Albert's class.  Although the structure is very loose and the attendance seemingly inconsequential to your grade, if you go and listen to this man, the world just gets a little bit prettier. He does tend to interrupt students incessantly, but this is countered by his tendency to support your ideas and encourage your thinking like few other professors i've had here.  You may find yourself dozing off once in a while, since he can sound a bit droning, but it usually has more to do with the two hours of sleep you got last night and less to do with the content of his lecture.  As for office hours, Albert was there when I needed him, encouraging, excited, and happy. I mean the man didn't even know the drinking age was 21 in New York until we clarified it for him.  He just thought everyone should be allowed to drink a little wine and talk about love. there's a mind untainted.\nWorkload:\npretty light: two or three one page written assignments, a midterm that consisted of two three-page papers, and the standard Lit Hum final.\n"
        },
        {
            "course_name": "Direction of Time",
            "review_date": "March 12, 2006",
            "review_content": "\nThis guy just makes me laugh.  I mean he is such a spas.  He has this dumb grin on his face when he talks, kind of like a smart-ass smirk that makes you think he is just playing a fast one on you and trying to not to laugh in not believing how people are buying what he is saying.\nHis teaching style is quite original.  He just sits all through the lecture and talks to himself.  He just talks and talks and talks often ignoring his students except for what I understood were a few of his grad students, who really asked the most lamest questions that proved more brown-nosing in nature than genuine.\nOften after a straight fifteen minute monlogue with himself, Albert will then stop and pause in dead silence for a couple of seconds with this priceless lost expression and lost look on his face and go \"I totally forgot where all that was going.  Oh well...\"\nHe would do this constantly and never gave us any assignments.  About half way into the semester he announced that our entire grade would depend on one final exam or a final term paper no less than 25 pages long.  He genuinely expected us to produce an original scholarly article worthy of publication.\nWhat is more infuriating is that the man used his own written text book, which was so incredibly poorly written that one rightly concluded that Albert should be the last person to judge the scholarly merit of any writing when he himself is in serious need of learning basic writing skills.\nSo after thousands of dollars sent and an entire semester sitting in his course, all I got out of his class was that some people in some profession get paid for literally sitting on their duff talking nonsense.  There is a famous well known saying: \"Those that can do; those that can't teach.\"  Apparently Albert cannot do either.\nAvoid this man and his courses.  It will rob you of your time and money and leave you quite frustrated and angry as to how a professor with such a lack of conern and committment to teaching can be allowed to the Columbia faculty.  It is genuinely inexcusable.\n\nWorkload:\nNone unless you opt to write a 25 page research paper.  Otherwise all you have to do is read his unreadable book \"Time and Chance\" and take a final exam, which determines your entire final grade.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "January 18, 2006",
            "review_content": "\nAre you kidding me? This class was a joke. I learned absolutely nothing from this obviously very knowledgeable man. The subject matter is very interesting, but won't stay with you. It just isn't the kind of topic you can gloss over, which he did. This doesn't even translate into a consolatory easy grade, as it all hangs on a final paper that he will hold up to very high standards. My advice: don't bother.\nWorkload:\nA 15 page final paper.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "January 18, 2006",
            "review_content": "\nAre you kidding me? This class was a joke. I learned absolutely nothing from this obviously very knowledgeable man. The subject matter is very interesting, but won't stay with you. It just isn't the kind of topic you can gloss over, which he did. This doesn't even translate into a consolatory easy grade, as it all hangs on a final paper that he will hold up to very high standards. My advice: don't bother.\nWorkload:\nA 15 page final paper.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "December 24, 2005",
            "review_content": "\nI agree with what previous reviewers said about this class.  One warning: if you are the type of person who won't do the reading or go to lecture unless you have to then you may as well not take this class.  There's no midterm or final (he does threaten a midterm but I'm not sure if he's ever actually given one) and the paper can be on anything you want, so you could potentially go to the first week or two of class, pick a topic from those discussions, and never go back.  And not having any tests means that you never have to study the material, which means you never really learn it.  If you are relatively self-motivated, and the topic interests you, then Albret's class is definitely worth taking.  But if you're lazy then you will end up knowing a bit about one very small subtopic of the philosophy of science, and not much else.  Know thy self...\nWorkload:\n1 paper, 15-20 pages, on any topic from the course that interests you.\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "August 22, 2005",
            "review_content": "\nA lot of people seem to be put off by Albert's teaching style, but I thought he was great  - definitely one of the best professors I had at Columbia.  I'll grant that it takes a little while to get used to the way he runs class discussions.  Essentially, he presents a problem to the class, asks for ideas or responses, and then argues vehemently against anything a student says.  The trick is not to take this personally.  That's just the way he discusses things - by debating them.  If the student has a valid point and sticks up for it, he'll acknowledge that it's interesting and continue to explore it by arguing against it.  If the student doesn't have a valid point, then he'll explain why in the course of shooting it down.\nPhilosophy of Science requires little or no background in either philosophy or science.  The readings are mainly from an anthology of papers; their relevance to the class discussion varies.  \nPhysics and Philosophy, strictly speaking, doesn't require a background in philosophy or science either.  However, it is necessary in the course of the class to learn a fair bit of linear algebra; the course will probably not appeal to those phobic of math.  The text is Albert's book.  His writing is a bit unusual; he has a tendency toward very long, very complex sentences.  This makes the book difficult to skim, but it also rewards a careful reading with great clarity and precision.\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "December 28, 2004",
            "review_content": "\n i hope this review helps people like myself  (non-Philsophy/Physics majors) who look for enrichment in courses beyond their skill range and don't consider a \"B\" a shameful grade. \nAlbert is brilliant, pretentious, and a horrible teacher. 17 students were left in this class by December, the majority of them were grad students in Albert's grad program. Atleast 8-10 had called it quits before then. \nAlbert doesn't really teach you anything about the philosophy of quantum mechanics until you can master the linear algebra necessary to \"talk competently\" about it. We never \"talked competently\" about quantum mechanics because we never broached any philosophical arguments about quantum mechanics until late November. \nLectures are infuriating, ill-managed discussions dominated by grad students with undergrad backgrounds in Physics  who are desperately concerned with minutiae of the course material that few others care about or understand. But Albert entertains all of their questions. Every last one of them. \nHere's the kick in the behind: write a 15-20 page paper about a philosophical problem that interests you. Wonderful assignment, if discussion about philosophical problems took place before November 29th. But it didn't. \nText Book: Albert's own. An abstruse, grammatically flawed introduction to quantum mechanics that had students scratching their heads all semester. \nAt the end of the day, you will learn about quantum mechanics, philosophy, but it'll be up to you if you want to sweat blood doing it.\n\nWorkload:\n15 page paper. Fair grader.\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "December 27, 2004",
            "review_content": "\nProf Albert is incredibly brilliant; definitely knows his stuff.  He was always very supportive/encouraging and kept telling me I could do the math involved when I visited his office hours whining about how I couldn't understand the formalism.  His high level of support, so rare in CU professors (especially the brilliant, well-known ones), was what kept me in the class, despite it probably having been a better decision to drop it.  That said, I was at a complete disadvantage as far as background prep goes (there's a reason the vast majority of students were either math or physics grads or undergrads), but nevertheless, I'm very happy, now that the semester is over, that I took the course because I feel like I now finally have a reasonable understanding of quantum mechanics and it'll help me tremendously in future studies (whether on my own or in a class).  Besides his sincere support, Albert's teaching style was extremely refreshing.  He was always very relaxed and he displayed no pretentious, better-than-thou attitude.  He treated us more like colleagues than his students.  He would sit with his feet on the desk or wander around the classroom sitting on the deskchairs.  He wanted us to voice our opinions or questions, and even though he mostly shot down everything we came up with, he did it in a tactful, explanatory way which made sense later when we learned more--although at the end of the semester, it was more his opinion (instead of fact) versus ours on certain topics but of course, he's studied the stuff for eons so he naturally has a better supporting argument than we do but nevertheless, I'd encourage any student to pursue studying your own ideas that you find more interesting than Albert's conclusions.   If you plan on or are taking the class, please note the following:  I really didn't understand what the objective of the course was until towards the middle of the semester, so here's the scoop on what happens:  First, the only book required is his book and he lectures almost word for word from it in the exact same sequence as the book.  Hence the reason that he says the syllabus is the chapters of the book.  Second, the only thing you discuss is quantum mechanics so the course should really be called QM and Philosophy instead of Physics and Philosophy.  Third, if you haven't had a minimum of high school physics and calculus, you'll probably find the course much more challenging (at least I did anyway; Albert says you only need a high school background to understand the course, that it's self-contained, but stupid me, I took it anyway, forgetting that I had never taken physics and calc in high school and had done very poorly on the intro classes I took in college).  Last, if you're having difficulty understanding stuff from Albert's book, get some books that explain QM theory in more elementary layman's terms.  It helps a ton; I wish I would've done that from the very beginning instead of waiting until the end of the semester.  \nWorkload:\n1 in-class midterm (depending on how well Albert thinks the class understands the mathematical formalism; if he gives a midterm, it'll only be 1 or 2 problem sets).  1 final 15-20 page paper (believe me, you'll need more pages than that to write a really good paper).\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "December 20, 2004",
            "review_content": "\nThe subject matter is fascinating, although the course title is misleading: we didn't get to the philosophy until the last class and the physics is all quantum mechanics. Tough for someone like myself who knows little physics or math, but not impossible. I was totally lost during most of class yet I aced the extremely easy midterm (that most others somehow failed) and I had plenty to write about on the final paper.\nAlbert might be a worldwide-expert philosopher of physics, but that has its drawbacks. He puts no time into teaching except for the class period itself (for which he was generally five to ten minutes late) and the office hours--not even enough time to make a syllabus, assign homework, or type up a description of the final paper. Albert has no interest in you personally, what your name is, or how you're doing in the class.\nAs for his lecturing, Albert seems to think that if he is just pedantic and repetitive enough, anyone will be able to understand every advanced detail about a field of science that couldn't even be conceived of until the twentieth century and that still makes no sense. You won't feel prepared to write the final paper and he won't give you much help, but it will be the only way that you really learn anything from the class.\nWorkload:\nYou have to read a short book that Albert wrote and recites almost verbatim in class; extremely easy midterm on technical stuff that most people somehow failed (they were assigned a make-up take-home exam); a 15-20 page research paper\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "November 15, 2004",
            "review_content": "\nUnder no circumstances should you take this course. None. Professor Albert is a terrible lecturer who lets questions from students, valid or not, drive the entire lecture. This and the repetetive nature of the class made it a daily fight not to skip. He also focuses on details of little or no importance and skates right over those that are critical.\nThe midterm is completely unrepresentative of the substance of the class, and his examples are exactly out of the book (which he wrote) so you never get a clearer picture by asking him to explain. Unless you are extremely well versed in Physics, Philosophy, or both, you will get below a B- in this class. There is no homework to prepare you for the math-based take home midterm, and recitation is at a time that made it impossible (at least when I took it) for an observant Jew to attend.\nI learned more in researching for the final paper than I did from the entire class. I also felt like Professor Albert focused almost entirely on the Physics aspect and not at all on the Philosophy. I would have liked to see more exploration of what the discoveries meant for contemporary Philosophy, rather than just seeing the experiments and learning that they caused questions.\nWorkload:\nA take-home midterm based on the first half of the class, which nominally explains the math involved, and a 15-page final paper.\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "April 02, 2004",
            "review_content": "\nThis from the philosophy department's website.  \"One reason why he is in ColumbiaÂ’s Philosophy Department is that he is a philosopher; but another is that his work in physics is so highly theoretical that he can pursue it without the experimental resources of a physics department.\"  Believe that if you'd like.  \nHis TA butchered my midterm, which was regraded to a number twice the original score, he lost my final paper and I didn't get my grade until well into the next term.  He's an engaging lecturer, but his writing style is rough (and he uses his own book as the course's text) and he is pretty dismissive of any philosophical stance that is not copacetic with his tacit scientific realism.  Nice guy, but his uncommon blend --  too technical for a philosopher, too hands-off for a scientist -- can make him a frustration to both camps.  \nWorkload:\nOne midterm take home short answer test and one final paper (~15 pages).\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "May 25, 2003",
            "review_content": "\nThis class is somewhat interesting.  Actually, I found the subject matter to be extremely intriguing, though the way Prof. Albert presents it is a little rough.  There were several topics that we spent a copious amount of time on and on others we barely skimmed the surface.  Prof. Albert can get a class discussion (which in my class consisted of abut 8 out of 40 people) started pretty well, however he cannot adequately lead the class in the right direction and we often got off on tangents.  To Prof. Albert's credit however, the topics of philosophy of science are in many cases inextricably connected, which makes it very difficult to confine discussion to only the philosophical problem at hand.  But, nonetheless, that is his job, is it not?  Overall, I would say this class is worth taking, but don't expect it to be your favorite.\nWorkload:\nA considerable amount of reading each week (which honestly you do not have to do at all).  The final paper (17-20 pages) is the only grade that you have, though he very timidly threatened to give a midterm.  An obvious, though extremely useful, bit of advice:  start early!  You will be kicking yourself big time if you do not.  In order to write a paper that will give you a decent grade you are going to have to do a fair amount of outside reading on your chosen subject and put some real thought into your arguments.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 22, 2003",
            "review_content": "\nDavid Albert's work is actually somewhere between philosophy and theoretical physics, but he was an excellent Lit Hum teacher. Unfortunately, I was in the 6th grade section, the one that sets the clock ahead ten minutes when he's not looking, so the class didn't work as well as it should have. He has a really extensive knowledge of all the books and is a genuinely nice guy. He won't make you talk if you don't want to, and he doesn't give a participation grade, so if you're quiet or don't read, no worries. He's a really interesting person and has an unusual way of speaking, and likes the expression \"Bananas!\" Also, he says \"dat\" instead of \"that\" and his hair is a fiasco every single class period. He's entertaining at the very least. I wish people would be nicer to him because he's great and he's always nice to us, even when we're shitty.\nWorkload:\n1-page analysis of 2 passages of your choosing for each book, one midterm (a bitch---this is where his philosophy background shines through, leaving us in the dust), one 7-page paper (he'll probably do more once he gets more organized) and the standard final. Manageable.\n"
        },
        {
            "course_name": "Direction of Time",
            "review_date": "January 27, 2003",
            "review_content": "\n        As you can tell from the amount of courses I've taken with him, I like Professor Albert.  However, of the three I consider only Physics and Philosophy to be exceptional.  Philosophy of Science is very good too but Direction of Time is disorganized, confused, and very weak overall....\n       Physics and Philosophy deals with various interpretations of quantum mechanics, some of their mind-boggling consequences, and how they bear on certain metaphysical doctrines, e.g., determinism and indeterminism, materialism.  In addition to the fascinating subject matter, the appeal of the course lies largely in its accessibility: no background in physics or math is presupposed in lectures or in Albert's book--the only text for the course.  As you long as youÂ’re willing to work a bit on the necessary technical/formal stuff, even if  you are a non-science major (I am), you will be able to understand quantum mechanics in a general but sophisticated way.  It's one of the best classes I've taken.  The only assignment was a paper, due at the end of the semester, of approximately 20 pages.  You can get away with something a bit shorter....\n        Philosophy of Science also had only one requirement, a 15 pager.  The course is a good introduction to the field and you explore interesting issues, e.g., how to interpret scientific theories, realism, scientific explanation, objectivity.  Albert was irresponsible about putting photocopies on reserve.  In fact, the syllabus was generally vague and you did not have to do any reading because he didn't talk about the readings in class nor did he test us on them.  He sort of just lectured on the subjects--if you were interested you could do the reading.  Despite his sometimes surprising nonchalance learned a lot in the course and found his lectures interesting.....\n        Direction of Time is a different story.  The only text used was Albert's own book about the conflict between the time asymmetry of thermodynamics (and our everyday lives) and fundamental physical theories.  It is a confusing book and, unlike his book on quantum mechanics, poorly written.  For one thing, he goes parenthesis crazy.  In addition to his stylistic unclearness, the structure is awkward.  He makes the problems more complicated than they have to be and the class mirrors the confusing progression of the book.  I don't know if there are better, non-overly-technical books/articles on the subject, but if there are I wish he had assigned them.  Further, after I finally deciphered his main points I wondered why there was a whole course devoted to them: they're few and simple once the decoding of his insane style is through.  It seemed that he had stretched his book into a semesterÂ’s worth of material by being so confusing.  I left the class annoyed that I hadn't learned more about this problem or about the philosophy of time in general.  There was a choice between a final exam and a final paper.  I took the test, which I found shockingly easy.\n\n"
        },
        {
            "course_name": "The Philosophy of Space and Time",
            "review_date": "December 08, 2002",
            "review_content": "\nI suspect that Prof Albert is a bit challenged to the needs of his students. He never truly answers their questions and never ever replies back to their emails. He is often quite condescending and arrogant in class, less so during his office hours, which he frequently does not show up for. His lectures too were a bit random and not as organized as the booklets.\nWorkload:\nFinal or research paper.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "May 28, 2002",
            "review_content": "\nTakes a hard subject and makes it come close to earth. But not close enough to help you prepare for your paper. For the paper you are on your own, and don't think that Albert's laid back teaching style means he gives laid back grades. You will be rocked. Start on the paper early, but even then there is no telling how badly he will come down.\nWorkload:\n1 Paper-length 15-20 pages\n"
        },
        {
            "course_name": "Physics and Philosophy",
            "review_date": "December 03, 2001",
            "review_content": "\n This class should really be called the Philosophy of Quantum Mechanics because this is all that is covered. I highly recommend this class and any other class Prof. Albert teaches. He really cares about the student's understanding of the material and takes much of the classes answering questions about the difficult subject matter. My only complaint is that sometimes he would not know when to cut questions off because they often became repetitive or ridiculous, and this hindered him covering all of the material intended. Albert presents the material in a dynamic and entertaining manner and is an excellent lecturer. The various explanations for the central problems in QM are covered and changes the way I view the physical world as well as the nature of my own perceptions. The class requires learning about 3 weeks worth of mathematical formulism, but once you get through this it is well worth it. Also, the math isn't bad for even people who haven't taken any of it since high school.\nWorkload:\n20-25 page Final Paper, one short problem set mid-semester, but that's all the work you will get for this class\n"
        }
    ]
}