{
    "prof_info": [
        {
            "prof_name": "Gregory Amenoff",
            "prof_id": 1167,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Painting III",
            "review_date": "April 20, 2016",
            "review_content": "\nAmenoff was an excellent professor. The class allowed me to open my mind to different techniques and types of painting, and it DEFINITELY got me painting much faster. If you want to be artistically challenged in the best way possible, take this class. I learned so much and if I would take it again ANY DAY.\nBeing in the studio for 6 hours straight is tiring, but it also goes by faster than being in any other 1 hour lecture class (surprising, right?).\nNot sure how the grade distribution works, I got an A. He never gives out any grades, just the final grade at the end of the semester that you see on SSOL. \nWorkload:\nIn the beginning, around 2-5 small paintings a week (depending). At the end, the average is one painting per week, but they are larger. You are given three weeks to complete the final project (if I remember correctly), which is independent and you are allowed to design your own ambitious project. Outside of class, I average anywhere from 5 to 15 hours of work per week.\n"
        },
        {
            "course_name": "Relief I",
            "review_date": "December 18, 2007",
            "review_content": "\nAmazing class and professor. My relief classes were the highlight of my week, very friendly laidback atmosphere. The TAs Martin and Arlen were really cool as well. Gregory is quite fascinating, sometimes you just want to sit there and stare at him as he bounces around the class, talking at the speed of light, going from one joke to another. He obviously really cares about his students, and will do his best to help you realize whatever project you have in mind. He manages to give his honest opinion while still being always positive. Overall highly recommended class.\nWorkload:\nquite heavy towards the end, especially for the final project. Be prepared to spend a lot of time in the printshop outside of class, but it's worth it!\n"
        },
        {
            "course_name": "Relief I",
            "review_date": "December 18, 2007",
            "review_content": "\nAmazing class and professor. My relief classes were the highlight of my week, very friendly laidback atmosphere. The TAs Martin and Arlen were really cool as well. Gregory is quite fascinating, sometimes you just want to sit there and stare at him as he bounces around the class, talking at the speed of light, going from one joke to another. He obviously really cares about his students, and will do his best to help you realize whatever project you have in mind. He manages to give his honest opinion while still being always positive. Overall highly recommended class.\nWorkload:\nquite heavy towards the end, especially for the final project. Be prepared to spend a lot of time in the printshop outside of class, but it's worth it!\n"
        },
        {
            "course_name": "Painting 2",
            "review_date": "April 28, 2006",
            "review_content": "\nGregory is a wonderful teacher.  He is charismatic and energetic, which makes the class a joy to be in.  More importantly, he is insightful and engaged.  He will look at your paintings and tell you exactly what he thinks, which, in the context of a short semester, is a very efficient method of instruction.  If you think hard and work hard, you will not only reap the benefits of Gregory's instruction, you may also gain his respect, which is a pretty nice deal.  If you slack-off, you will miss out on a great semester of guidance and feedback.   Gregory also has a great sense of which artists will be relevant and interesting to individual students, depending on the paintings each makes as the semester progresses.    \nWorkload:\nAbout one painting per week, some degree of ambition expected.\n"
        },
        {
            "course_name": "PAINTING I R3201",
            "review_date": "June 15, 2002",
            "review_content": "\nAmenoff is really quite a fascinating professor who I feel has helped me take my painting to the next level. He really pushed me to break out of some of my long-standing habits, and while I like to think I was already a pretty decent painter, it is undeniable that pre-Amenoff I only thought I knew color-mixing. You will also be exposed through books and the web to lots of other artists and their famous works. Our TA was also pretty good and showed us his graduate studio. Bottom line; Amenoff's assignments will challenge you and you'll be very happy if you put in a few extra hours on your pieces. \nWorkload:\nUsually one or two paintings per week; I heard that Rand's class was turning in 4 or 5 paintings per week, but I think that's a maddening pace that is not doable for everyone in the class, esp. when you are taking other classes. And Rand's pacing forced almost everyone to use acrylics because of the cost of paint. I'll take quality over quantity.\n"
        },
        {
            "course_name": "Painting",
            "review_date": "December 31, 1999",
            "review_content": "\nI took his Painting 1 class and I basically found it to be like a high school painting class -- that is, still life in the middle of the room, which the class paints for six hours in silence. His teaching style does not foster class taking interest in one another's work, and the class was little more than an opportunity to \"keep one's chops up,\" which (don't get me wrong) is valuable. His method is to put up a still life and then show the class paintings by masters from this century -- Matisse, Max Beckman, Edward Hopper--and talk to us about utilizing flat planes and patterns one week, using value and light to create space the next, etc.  Nothing i hadn't heard before, but useful... I do mean \"useful,\" though, and not \"revelation-inducing.\"  He does have one lecture, however, that he gives every semester  which is very eye-opening.  I think it is the method he uses in his own paintings (which are decently respected, even famous in certain circles).  The idea has to do with time of day in a painting.  He talks about how we are taught to organize color in terms of complimentary, primary, secondary, etc.  He organizes them in terms of whether they are \"natural\", \"pastel\", \"artificial,\" and demonstrates how certain combinations create a certain time of day.  I had never heard anything like this before, it is his \"thing,\" and gave me a lot to think about.  He is a nice, charismatic guy, but nothing too spectacular (in other words, he's  no Archie Rand!)\n"
        }
    ]
}