{
    "prof_info": [
        {
            "prof_name": "Nicholas De Genova",
            "prof_id": 821,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Latino History",
            "review_date": "December 10, 2006",
            "review_content": "\nAWESOME Professor!!!!  I enjoyed the majority of the lectures.  The professor is very understanding and makes time for his students.  Due to health issues I was out sick and still got a \"A\".  He really is passionate about what he knows and encourages class particpation.\nWorkload:\nMidterm and Final\n"
        },
        {
            "course_name": "Mexican Migration",
            "review_date": "January 22, 2006",
            "review_content": "\nI really enjoyed this class. It had a slow start (the first half of the semester is spent reading and critiquing poorly done works about Mexican migrants). Nick also doesn't say much but in the end you read a lot of his stuff and realize he really knows what he's talking about. Then the class finally all starts to make sense and you realize that you've learned a lot along the way. The requirements aren't bad and overall I learned a great deal about America's history with Mexican migration and was forced to think about things in an entirely different light. I would surely recommend this class to anyone who want a good, critical introduction to Latino studies. \nWorkload:\nLots of reading each week (200-300 pages) which you need to do most of. One presentation on a reading from class. One final 12 page paper. \n"
        },
        {
            "course_name": "Latino History and Culture",
            "review_date": "January 07, 2005",
            "review_content": "\nAlthough some may say he is bland and bit boring, Prof. De Genova is really a learned and interesting person. He really knows his stuff but his major point he tries to convey is to pass on his knowledge to his students. Yes, many students didn't attend since there is both a take home midterm and final, but he does give brownie points for attendance since he familarizes with the faces that do attend class. Also, you don't have to read for every class period in order to get a good grade. Prof. De Genova attempts to go through a large chunk of Latino History, but all in all, a great introductory class! \nWorkload:\nReadings on various topics; but read thouroughly for the take home midterm and final. Midterm (5-8 pgs) and Final (10pgs). If you convey in your papers that you've done the readings for the topic of the papers you will get an A. \n"
        },
        {
            "course_name": "Latino History",
            "review_date": "January 03, 2005",
            "review_content": "\nReally nice professor and very well read, but did not convey material in an interesting factor. He was very long winded at times and tried his best to have student particupation, but that never worked. Definitely a class you can miss and while they might notice, the majority of the class misses. If you honestly do want to learn A LOT about Latino history/ your committed to the readings, then you will most definitely with this course. If you want an easy course then this is it too.\nWorkload:\nHeavy reading that isn't necessary to do (even if you do want to participate, you can usually get away with comments on what you believe) 2 take home exams (one 4-6 pg, another 10 pg)\n"
        },
        {
            "course_name": "Latino History",
            "review_date": "December 29, 2004",
            "review_content": "\nThis is extremely boring.   Prof. DeGenova's voice is soo mellow you'd wanna fall asleep or not make an effort in going to class. 1/3 of the class attended every session, the other 2/3 never showed up only the day before the take home midterm and final.  The TA's were informative.  Reading was heavy but you never have to do it, unless you want to participate.  The Professor is realllly nice, he put all the reading in coursewoks, therefore no one bought the coursepack which saved everyone 65  bucks.  \nWorkload:\nHeavy reading load, a take home midterm and a take home final.  Both were annoying and paper, the questions were tooooo wordy therefore you'd be wonder what the real question was that you need to answer. \n"
        }
    ]
}