{
    "prof_info": [
        {
            "prof_name": "Shaw-Hwa Lo",
            "prof_id": 6365,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Probability Theory",
            "review_date": "December 23, 2016",
            "review_content": "\nFirst let me start off by saying that this class is largely dependent on who you TA is, if you get Andrew Davison, I wish you all the luck in the world. The material covered in this class can be pretty confusing mostly due to the awkward wording and multiple ways of interpreting various questions. On tests it really comes down to trying to figure out what the TA was trying to ask, and building your answer around that assumption. \nProfessor Lo, has his quirks, and isn't exactly the best professor I've ever encountered. Most of his lectures are quite confusing and are often a waste of time. Every once in awhile there are a few gems in there so best to show up at least 50% of the time. Without a doubt he cares a lot about the subject, but just can't seem to get a point across unless on the rare occasion he decides to talk about a real world example from research he has done. What he lacks in teaching skills though, he makes up for in understanding, as long as you are willing to honestly let him know how the class and tests are going for you. Otherwise, because of his incredibly hands off approach to this class you are going to get crushed. To illustrate this, I emailed him on a number of occasions and never heard back. Everything, including the tests, are left up to his TA. Why is that so important? Because when you get a super probability genius TA PhD candidate from Cambridge, you are in for a world of hurt on the tests. For both our midterms the class average hovered around a median of 50%. About 2/3 of the class scored a little below that mark, but there were some outliers. Many people had around a 30% - 40% on both midterms. Not a single person finished either midterm, and many only finished about a half of it or a little more in the 75 minute time span. Because professor Lo is so understanding though, he took our pain to heart and created a drastic curve, and the final ended up being slightly easier, but still low (or should I say Lo...) grades overall. \nMakes sure you know who your TA is for this class before committing. Ultimately, you should be ok though, if not a bit demoralized. Wikipedia and Chegg Study will be your friend, because the textbook isn't the best in helping fill the gaps in knowledge from the class. \nWorkload:\nOne set of problems each week to week and a half, not terribly difficult but can be time consuming. \n2 midterms\n1 final\n"
        },
        {
            "course_name": "Probability Theory",
            "review_date": "December 16, 2016",
            "review_content": "\nI am sorry to say so but Prof. Lo is not really approachable. If you sent him emails, it would be a miracle that he replied.\nHe never designed or graded the mid-terms himself, separating himself with his students, only to be told the mid-terms were not even related to what he expected us to know.\nI really see no point of spending more than 200 dollars per class listening to him reading the textbook, let alone the fact that he could not even read his own notes clearly.\nMaybe the only good thing about Prof. Lo's class is that he did do something after the exam to make you feel better, yet I am not sure whether he has well thought through his ideas before presenting it to the class.\nIn sum, it may be a good idea to save some money and time, and learn this course by yourself. However, the Department of Statistics has made this one a compulsory course for anyone whose major has something to do with statistics; and Prof. Lo happened to be the only one who is teaching this course.\nSo be prepared. Don't have too much expectation from this course. Or maybe, it is going to overturn your perception of what a Columbia education is like.\nIf given a chance, I wish I had never taken this course.\nBest luck!\nWorkload:\nNot very much.\nIt is worth mentioning though that you may not want to trust the review sessions, exams and sheets (which is at least true for the fall term of 2016), since it turns out the mid-terms were nothing similar.\nStudy hard by yourself and you will nail it!\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "December 19, 2014",
            "review_content": "\nShaw-Hwa Lo is not a very good professor. \nPros:\n- There is supposedly a large curve. The average grades on the midterms (69 and 62, respectively) are to be curved to a B/B+, apparently. \n- He posts lecture notes on CourseWorks\nCons:\n- His English is not the greatest, so it's hard to understand him sometimes. He can be hard of hearing too.\n- When he writes on the blackboard, the writing is nearly illegible and extremely tiny.\n- He breezed through the last few chapters in the last week, which was bad because they are the most challenging ones. \n- He is not that great at explaining concepts. Sometimes he'll delve into theory and proofs even though there won't be any on the exams. That will take up time that could've been spent on working through additional problems.\nMake sure you do your homework (try to do them without resorting to answer keys unless you've done your best already). The exams are very problem-oriented, so drill and kill on homework problems and examples, not on the theory. \nAlso, the prerequisite for this course is \"Elementary Calculus,\" but be absolutely sure you know how to do double integrals (not covered in Calculus III) and find the determinant (basic matrices, Linear Algebra). They play a key role in the final chapters of the course.\nWorkload:\nHomework - 20%\nHe drops the lowest 2, out of 10 assignments. If you can handle the homework without consulting the solutions manual first, you should be fine.\nMidterms - 20%\nThe biggest challenge was perhaps the time constraint. Focus on working through textbook examples and homework to do well. You get to have a one-sided cheat sheet with formulae, but it won't help unless you know when to use the formula.\nFinal - 40%\nYou will have more time to do the final than you will for the midterms. Again, very problem-oriented. Be sure to work through examples. You get a two-sided cheat sheet, but again, it's no use unless you actually know when to use the formula. \n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "January 15, 2014",
            "review_content": "\nDon't take this class unless you have to, in which case there is only one section (unless you want to take the grad school one, which is probably terrible too).\nProf. Lo is a horrendous teacher on several levels.\n1. He does not speak English well.\n2. He speaks very quietly. You have to sit in the first two rows if you want to hear anything.\n3. Even if he was great at speaking, he's still terrible at explaining things.\n4. Asking questions is equivalent to pressing an instant replay button: he's just going to repeat the last thing he said in exactly the same words. You will soon learn not to bother.\nThe only reason the class isn't so hard is that everyone is on equal footing here. Seriously, don't even bother going to the lectures (most people did not show up after Day 1). It is so boring I can't even explain. Also it's like a mile from my other classes. The textbook is okay, so you can teach yourself from there. I would recommend going to the TA's office hours because no one went and he's actually a great teacher (his name is Jonathan, though he might switch to a different class next semester). Don't save the textbook reading for right before the exams though because the textbook spends it's sweet time explaining every concept in tons of examples, and you never know what you can skip and what you can't.\nThe tests tended to reward those who actually did the homeworks, so definitely go over those before the tests. Also, put tons of examples on your cheat sheet. And, if you don't know how to do a test question at all, just put on some formulas and make it up. You will most likely get 3/4 credit anyway. Do NOT leave anything blank: you are just screwing yourself big time.\nAnyway, I am warning you now: this is probably the worst class you will ever take at Columbia. But, if you gotta take it, you gotta take it.\nWorkload:\nAbout 10-12 problem sets (don't remember exactly). Lowest 2 dropped. (Everyone cheated because there are several online answer guides.)\n2 midterms and a final. (The 2nd midterm and the final were cumulative.)\nOn the exams, you get to bring a 4-function calculator and a cheat sheet (one-sided for midterms, two-sided for final -- you can put whatever you want on it).\nAlso, if you \"show improvement\" he will drop the first midterm grade apparently, though he didn't tell us that until the last class (super pissed about that one).\nGraded to a B. Out of 62 kids, top 10 were given an A. I was 16 and got an A-.\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "January 10, 2014",
            "review_content": "\nVery mixed about this class. The two previous reviews make it look as it's quite easy to get an A. It's not. Let me give you the pros and cons:\nPros\n- Prof.Lo is a very nice guy.\n- Generous grading.\n- Big curve at the end.\n- No proofs.\nCons\n- The lectures are not very helpful. Prof. Lo reads through his handwritten slides, full of formulas, but then post the slides only one or two weeks after the lecture (or later), because he wants to \"finish the whole chapter first\".\n- The book is at times incomprehensible.\n- The exams questions are not very straightforward, in particular in the final.\n- There is a lot of cheating and this tends to inflate the curve.\n\nWorkload:\nWeekly HW, not very easy. Two midterms and a final. You are allowed one single cheat sheet (one side for the midterms and two-sided for the final). The first midterm is pretty easy, the second one more difficult, the final is quite difficult. To prepare for the exams don't focus on the theory but on the problems. Solve as many as you can, write them up on the cheat sheet, or memorize them.\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "January 08, 2013",
            "review_content": "\nYes, he is hard to understand, but his discussions are based on powerpoint notes that he has projected the entire class (Sometimes they are hard to follow, but the problems are usually similar to example problems in the textbook).  Yes, sometimes it's hard to follow him in class, but either a) you probably don't need to know that stuff or b) you can follow along in the textbook.  All you really need to take away from his lectures are the helpful example problems.  After all, the exams are completely problem based, not proof or theoretical based.  \nAs long as you get the textbook (I usually followed along with a PDF in class, its a very small book), you will bereview_content  review_content homework problems and other practice problems in textbook for exams.  I ended up with an A.  Not a bad class at all, really.\n\nWorkload:\n2 midterms, first is PRETTY EASY, try to do well on that.  Second and final are of average difficulty. Homework problems are the best - super helpful for exams.\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "January 27, 2011",
            "review_content": "\nI took this course last semester as an auditor. The class is very straight forward if you are able to follow along with the textbook in front of you. The professor is not extremely helpful during lectures since he does not really understand the needs of undergraduate students; he solely teaches PhD students. Knowing this, he does not actually realize when he has lost his class when lecturing, therefore following at his own pace. However, it is also stupid to consider the reviews of students who do not seem to have adequate knowledge of basic algebra or common sense. Of course the professor would be irritated by simple stupid questions posed by students who do not invest their own time at home with their books. To me, this class is very easy, especially since the professor gives a RIDICULOUS curve at the end....\nWorkload:\nWeekly Homeworks\n2 midterms\n1 final\ncurved to NO END\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "January 12, 2011",
            "review_content": "\nIt's extremely unfortunate that he was the only professor to teach this course because Shaw-Hwa Lo is undoubtedly one of the worst professors one will ever encounter at Columbia. He doesn't know how to explain concepts to his students,and thus makes going to class utterly useless. I personally would know because I actually went to about 90% of his classes, and ended up with about 10 pages of notes for an entire semester, all of which were useless upon studying. \nOn the bright side, Michael Agne, the TA, is very responsive to e-mails, always willing to answer questions regarding homework or exam topics, and his review sessions are rather helpful and should definitely be something you attend before each exam. Also, it is still possible to get a good grade in the class if you can read the book and learn on your own.\n\nWorkload:\nWeekly HW's of moderate difficulty: 20%, lowest 2 dropped\nMT1: 20%, very easy, average was 90/100\nMT2: 20%, average around 70/100\nFinal Exam: 40%\n"
        },
        {
            "course_name": "Introduction to Probability",
            "review_date": "December 10, 2010",
            "review_content": "\nHe is the worst instructor I have ever encountered at Columbia. Here's why:\n1. He cannot speak English to save his life. Every time he opens his mouth, I think of the Samuel L Jackson scene in Pulp Fiction: \"English ------------, DO YOU SPEAK IT?\" Hardly anybody understands him. \n2. He is a poor communicator. This is distinct from his poor language skills. Even if his English were perfect, the way he explains concepts is so convoluted that you probably wouldn't understand the material any better. As the other reviewer said, any questions posed to him are met with exactly the same explanation as before. \n3. He is condescending. Loves to declare \"this is a trivial result\" while half the class is still scratching their heads regarding how he got there. Also asks, \"are you with me?\" *no response, confused silence* \"Ok, next problem!\" Seems to be very amused by the class' inability to grasp concepts that he deems trivial. \n4. Completely rushed through 2 of the most difficult chapters in the entire semester in the last 2 classes, just so he could put them on the final. Need I say more?\nThe sole saving grace of this class was that we had a great TA (Michael Agne), who filled in for 2 classes while Prof Lo was away. I strongly recommend that the Statistics department allow the TA to teach the entire class instead. \nWorkload:\nOn the heavy side but still reasonable. Problem sets (10+ problems) every week, 2 midterms, final. \n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 30, 2009",
            "review_content": "\nI took this guys Intro to Statistics. Easy class... HORRIBLE TEACHER! He's a nice guy, but not only can you not understand him, he can not teach intro classes. He seems like a very brilliant guy, but he can't put anything into simpler terms for students to understand. When you don't understand he sometimes gets mad and explains it just as he had before (without trying to help you understand it in a different way).\nWhen you ask questions he has absolutely no idea how to answer you because he just doesn't understand (which gets very frustrating when you are stumped on something).\n\nWorkload:\nHomework due every week... 2 exams and a final... not bad...\n"
        }
    ]
}