{
    "prof_info": [
        {
            "prof_name": "Stephanie Schmitt-Grohe",
            "prof_id": 4458,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "International Macroeconomics",
            "review_date": "May 19, 2016",
            "review_content": "\nThis class is definitely not an easy economics elective. Unless you're really passionate about international macro (and a lot of the subject material is really interesting), you probably should not take this class. \nThe only \"textbook\" is the manuscript for the one she is currently writing and it is filled with typos and mistakes. Homework and exam problems range from moderate to impossible. And the only way to practice for exams is to do the problems and there are NO SOLUTIONS. \nAfter the second midterm, we learned three pretty difficult models. NONE of them showed up on the final. It was so incredibly unfair that we slaved away at memorizing those models for the final and the entire final was just stuff before the second midterm. \nThere seemed to be little communication between the professor and TAs, so then even less communication between the TAs and students. \nWorkload:\nDoable-hard problem sets. Hard midterm and final. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "July 29, 2015",
            "review_content": "\nProfessor Schmitt Grohe delivers a rigorously mathematical approach to macroeconomics--she certainly does not make economics seem as easy to chew as does Professor Gulati.  However, if you have appreciation for the mathematics of things, you will find this class extremely inspiring.  She is not as skilled with the more tangible elements of economic thinking--she won't delve into the human nature or the intuition of things all too often.  Instead, she assumes that you already understand the intuition behind, say, why inflation increases the interest rate, and thus she does not take the time to explain it.  Instead she will prove the mechanism using strict variables.  \nPersonally, I loved this class.  But it is certainly not for everyone, particularly people who intend to take a more humanities or even historical approach to macroeconomics.  Each unit centers around models, and the models build in complexity throughout the semester.\nExams will test you on simplified versions of the models presented in class.  If you do not have a solid intuitive and mathematical understanding of the models, the exams can be very difficult.  I believe it is this reason that exam results for our class were often bimodal.\nWorkload:\nWeekly homeworks are tedious and not well written and can take anywhere from 1-5 hours, typically in the 2 hour range.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 29, 2015",
            "review_content": "\nThis class is by far my favorite this semester (and maybe at Columbia). Prof. Schmitt-Grohe picked very carefully the materials she would like to convey to us and then went really deep into the models and its variations. Her pace is relatively slower compared to the other professors but I find her method instrumental in improving my understanding. I also appreciate the fact that she always makes an effort to make the materials come to life by bringing in data, her research, and current events. She does her best to make the class interactive to various degrees of success and in doing so engages you to think if you decide to participate. At the end of the day, the course exposes you to how great macroeconomists think and frame a problem, not just provide you with intellectual bonbons to whip out during dinner conversations - although her graphs and data helps with that too. This framework is super valuable if you are thinking of majoring in Econ or studying at graduate level since a lot of emphasis is on the logic. \nAs previous reviewers noted, exams are not so straightforward, which seems to be most people's complaints. She doesn't really drop hints about what will be in the exams, but if you pay careful attention to the intuition behind her methods, read the slides carefully (these are super dense and rather tangential - most people give up on them but I find they really help you prepare for exams), and go to the TA review sessions, you will be OK. She spends the majority of her lectures doing the math, but the exams test you on intuition so be sure to understand where the math is going/coming from. The head TA comes up with practice questions in my section and most of the class will go crazy trying to figure out the answers, but you'll be better off understanding the methods and logic behind it rather than getting the right numbers. \nHer problem sets are weekly which could be a blessing or a curse. They are not super time-consuming but a little tricky at times. You can get away with copying down answers from a buddy, but if you want to feel prepared for the exams, don't do this. As previous reviewers noted, she doesn't let the TAs post answers for the problem sets, so either do them really well or go to recitations. \nThe one thing that most of us seem to have troubles with is that she expects you to understand the material at a really deep level, since the amount of the material is not that overwhelming. Unlike the previous reviewer, I'm not bothered by the talk-and-chalk method (probably because this semester she started giving slides) but you will have to review both the slides and your notes on a regular basis to not fall behind. She devotes approximately 4-8 lectures per topic so it's in your best interest to keep up with the class and the slides - missing a class and not catching up will mean that the next lecture is torturous. \nShe is also super helpful during office hours especially if you come prepared with specific questions - she is happy to go through some concepts again and listens to suggestions about how the class could be improved. \nAll in all, really excellent class. You just can't cut corners - do all the work you are supposed to, be prepared to think a little deeper, and you will get a lot out of this class. \n\nWorkload:\nWeekly problem sets - hard but not super long\nTwo midterms - seems like she changes the questions from year to year. Generally people do well in either the first or the second. \nOne final - two hours, hard and quite long, cumulative. \n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 03, 2012",
            "review_content": "\nI loved this class. The material was hard, but I think it was a great class to take and I love that it was catered to current events. However, I would change 2 things. 1) I don't like the 'talk and chalk' method. I came to class everyday and often Professor Schmitt-Grohe would say the most important things in a quick second without writing them down. I think that those moments when she stops to say \"Okay class, before we start the model I'm going to explain where it's going\" are HUGELY important moments that don't ever get noticed because they happen so quickly. That said, the only way to improve that would be to talk slower. 2) Those rhetorical(?) questions she would ask the class would often just result in silence. Maybe she was trying to show us we could've come up with this stuff on our own, but I don't know if it was super effective. I often knew the answers to those questions but was too intimidated to speak up. I also think that she expects you to know a lot about the current markets or at least financial ideas (not that it's super necessary, just as a background) so maybe there could be a suggested pre-requisite for this class for Financial Econ majors.\nWorkload:\nProblem Sets (not too hard but with real Econ data), Midterm (HARD AS BALLS), Final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 18, 2011",
            "review_content": "\noverall the course was actually pretty good. most of the people who take it want to go to wall st., and im sure the modeling that stephanie taught us will be useful for that. on that note, the actual usefulness of the topics that she taught was somewhat low. the growth theory stuff was ok, but then she spent what seemed like half the semester on cagan model, which is (at least what i thought) useful for hyperinflation only. the conclusions were that hyperinflation occurs only when the gov't prints money to finance its spending. \nreally? did we need 6 weeks to get to that concept? sure, the mathematical modeling was ok but conceptually, not too much substance. the midterm was sort of weird, b/c the focus of the class seemed to be mathematical modelling yet the questions required 'intuition,' not math (for which you were supposed to attend the lectures for; example, if half a country gets invaded, what happens to money supply?). \nthe final made up for the midterm as it was pretty much strictly math-based. the questions were a little.. weird (the combination of concepts, that is) which made it somewhat difficult. a frustration was, for example, she spend ~2-3 weeks on intl trade/macro (for which she wrote her own notes for), yet there wasn't even a single question about it. \noverall, a good professor. she's really nice and does take into account what the students want, but i think the main frustration is the coverage of topics (I don't remember hearing AS or AD even once in the class, plus 1 day of labor markets in a model). also, she taught the IS-LM model but I don't think people in the class actually realized that's what they learned. \nas a side note, Carlos has got to be the most incredible TA at Columbia. i'm sure he put in more work into the class than maybe half the students combined. i hope someone in the economics dept has enough common sense to give him his PhD immediately and tenure him with the condition that he stays at Columbia forever\nWorkload:\na pset per week, takes anywhere from half an hour to four hours. midterm and a final that, if i didn't study for either, i would have received the same grade (which is not necessarily a good or bad thing). got an A for the course, but that's only b/c the psets made up for my exams which i did pretty poorly on\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 10, 2011",
            "review_content": "\nStephanie's class is very difficult and very unusual.  She spends around 1/2 of the lectures going over the intuition behind the economics theories, and the other 1/2 in the derivation.  She teaches topics like seignorage but then totally ignores unemployment until the last lecture and tells you it's not going to be examed. Her homeworks are rather straightforward, but her exams are VERY different.  The midterm was largely based on intuition. More writing than math.  People in class complained about the midterm, and the final was largely math.  However, she exams you on very unexpected topics.  Topics that she spent 2+ weeks on are surprisingly not covered at all...  It doesn't help that she does not post solutions to the homework and does not give any practice exams. \nCarlos, the TA, is ABSOLUTELY AMAZING.  I think it's worth taking a class just to have him as the TA. he attends every lecture and takes meticulous notes for the class. He's able to explain everything in a really clear and concise fashion.  He even took almost five hours out of his own time to write practice exams for the class of what he thought could be on the exam.  He's enthusiastic, knowledgeable, helpful, and better than any econ professor i've previously had, even gulati, and i loved gulati \nWorkload:\n9 problemsets, 1 difficult midterm.  1 impossible final.\n"
        }
    ]
}