{
    "prof_info": [
        {
            "prof_name": "Lesley Sharp",
            "prof_id": 15,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Absent Bodies",
            "review_date": "May 11, 2015",
            "review_content": "\nI've known Sharp for 3 years and she was my adviser until recently. I used to like her quite a bit -- she is undoubtedly smart and an accomplished anthropologist. At her best, she teaches you how to be systematic in your writing and to meet unreasonable standards. The most you'll get out of her course is a real life experience of Horrible Bosses or The Devil Wears Prada translated to academia.\nOnly take a class with Sharp if you the kind of person who can put up with bullshit. The most successful route dealing with her is to sit down, and shut up. Participate enough to get credit and look like you read the material, but just say what she wants to hear. She consistently picks a \"favorite\" in the class, along with a person to shit on and make an example of regardless of your knowledge or effort. I've been in both roles. I was the favorite when I was a first year because I kissed her ass. When she became my adviser and we got to know each other better, the tables turned. Despite every effort to engage with the reading material, it seemed the more 'myself' I acted, the more she just hated me. I watched her do the same thing as a first year to a senior major in EFR in NYC. Sharp gave her a C even though that student seemingly did all that was required on the syllabus. \nAll in all, she has an incredibly limited view of anthropology and what a student/teacher relationship should look like. Don't push that in any way... (and you'll know that you've offended her - she'll start to be really dismissive of anything and everything you say in class and she'll fuck you on grades)\nReally, just avoid her at all costs. I've talked shit about Sharp to two other anthropology professors in the Barnard department, and they both talked shit about her right back. She's just an unpleasant person. Anyone who says differently was one of the favorites. \nWorkload:\n3 papers, 6-8 pages, 20% each\nLead 1 class discussion\nWeekly 2 page reading responses\nKiss a dinosaur's bumhole\n\n"
        },
        {
            "course_name": "Ethnographic Fieldwork in New York City",
            "review_date": "January 18, 2011",
            "review_content": "\nAs earlier reviews have stressed, Professor Sharp is a HARSH grader.  I don't think that anyone got an A the semester I took this class.  She expects you to be extremely scrupulous about punctuality, citations, formatting, the length of your final presentation: all the details, down to what kind of binder you hand your final project in in.  She has extremely high standards on everything from your actual intellectual work to how you format your bibliography.  Do not count on her excusing some tardiness and a late assignment because your project is great.  She won't.\nDespite all that and as much as it pains me to admit it, Professor Sharp is actually a really good professor.  You will learn a lot about how fieldwork is done if you take this class and she will push you to make your project something you can really be proud of.  This class is great preparation for doing a thesis and I'd highly recommend it to anyone who plans to go on to study anthro on a graduate level.  It was one of the most intense and demanding academic experiences I've had.   Despite my disappointment over my grade, I'm glad I took this class.  \nWorkload:\n13 page final paper, a project proposal, 4 short writing assignments (under three pages), a 10 minute (no more and no less and she means it) class presentation.  This class requires a substantial amount of work outside of class.\n"
        },
        {
            "course_name": "Anthropological Theory I",
            "review_date": "December 24, 2009",
            "review_content": "\ni wrote Professor Sharp a nice review at the beginning of the semester. During the class, I enjoyed discussions and readings. \nHowever, I am astounded by the result of the class. Her grading is HARSH. I am one to do every single reading, put effort into every assignment and turn them in on time. I am also not one to complain about grades, but seriously! I am a senior major and an excellent student. I have spoken to others who are also frustrated; the grades are not reflecting the amount of effort invested. \nI also feel that what she expects from students in their writing limits creativity. Innovative thinking, provocative writing is unacceptable in this class.\nProfessor Sharp, you need to chill.\nWorkload:\nweekly 2 page writes, a midterm and a final. Tedious and frustrating when you do all this crap and then feel like your effort is not recognized. Unfair.\n"
        },
        {
            "course_name": "Anthropological Theory I",
            "review_date": "December 10, 2009",
            "review_content": "\nall in all, a good course. you have to take it for the major, but still it isn't bad. sharp is a very clear lecturer, moves at a nice pace, stimulates conversation well, and is a fair grader (so is her TA todd, who always works with her i think). she's also very patient, and pleasant in office hours. i think that she genuinely cares about her students, which is evident because she says she always wants to teach this class (usually i feel like professors aim to graduate beyond courses like this and teach only on the areas of interest). because she is a seasoned instructor, the syllabus is tight; nothing unexpected happened, and she was very transparent about assignments and readings. this can be very refreshing, when everything is straightforward and you know what is expected of you. \nWorkload:\n2 page weekly responses, which sounds tough in the beginning, but feels routine once you get into the habit. i didn't mind them, because they made me read closer and i felt like i learned a lot. take home midterm and final, both 6-8 page papers on topics that we all come up with in class. moderate but very manageable.\n"
        },
        {
            "course_name": "Anthropological Theory I",
            "review_date": "October 29, 2009",
            "review_content": "\nLesley Sharp is an extremely nice woman and a thoughtful lecturer. Her pace is always in response to the class- not pushing us or pulling teeth in discussion. Class discussion flows freely and is always relevant to the readings. Take this class and really learn your theory.\nWorkload:\nNot bad. 1-2 page responses a week, a 6-8 page midterm and a slightly bigger final.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 10, 2007",
            "review_content": "\nProfessor Sharp is boring, anal, and wears alot of purple and her class is a serious waste of time. Shes strict about attendance and going to class is usually painful. I usually felt like shoving my pen into my side. It is clear that she belonged to the guilded age of social anthropology and refuses to move forward. She doesnt engage with the test in class and by the looks of her opinions and attitudes never did engage with the texts. Shes a dinosaur when it comes to critical theory but not friendly like Barney. She seems to have a soft spot for flakey spacey girls, and by soft spot I mean...\nWorkload:\nThe reading is itneresting but actually doing it seems futile becuase seh never discusses it. Tedious and anal exams. \n"
        },
        {
            "course_name": "Body and Society",
            "review_date": "March 15, 2007",
            "review_content": "\nYou should really consider taking a class with Prof. Sharp. You can tell from the first class that she loves medical anthropology and I was never once bored in her class. The syllabus is very interesting.I loved the class overall and felt like I actually learned something from it rather than just having to make the grade. What i didn't like was that she would have us read entire books and only spend one or two classes discussing small portions of the readings. Although I thoroughly enjoyed the books, it's best to skim through them, get the general idea and then focus on what she brings up in class. I actually had fun writing my final 10-15pg paper. You can chose whatever interests you and if you are a little lost and confused, dont hesitate to go to her office hours. \nWorkload:\n2-3pg personal ethnography, 10-15pg final paper, midterm and final. she gives you an outline of the exam beforehand and there are no surprizes\n"
        },
        {
            "course_name": "Body and Society",
            "review_date": "June 06, 2005",
            "review_content": "\nGreat class. Professor Sharp picks out a fantastic syllabus and she really knows her stuff. The only problem is that she doesn't lecture as much as she should, although this is technically a lecture class. Instead, sometimes it ends up being dumb people engaged in inane cross-talking about really great texts/articles. But that shouldn't stop you from taking this class. It's really informative and really changed some of my perspectives on (life)? Is that a too bold a statement? \n\nWorkload:\nA lot of work for a lecture. There's one short 3 page paper to start, a midterm, a final, AS WELL AS a final 10-12 page paper. Sharp comes off as extremely tight-assed about rules and details ...and she sort of is. Wwhen it comes to grading, she's definitely \"fair\" and not an inflator. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 18, 2005",
            "review_content": "\nYes. I came to barnard and I had no idea what I wanted to major in, and then i took this class and decided that my major would be anthropology. I give credit to professor Sharp. She made the class feel like a really big happy family, and was very clear in all the lectures.  There was a lot of reading, but hey, articles about omens and witch babies and rooster fights are worth it. You get to learn about worlds that are not your own - what can be cooler? Professor Sharp is a wonderful lady...go to her office hours and get to know her. If you have an open mind and love exotic people and things, take this course!\nWorkload:\nA Midterm, Final, and three pretty easy projects increasing in work.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 04, 2005",
            "review_content": "\nProfessor Sharp's class is a great one to take if you absolutely must get the requirement out of the way, are great at pulling assignments out of your behind, and if she decides that she likes you. If not, you're screwed. I read every book for that class, worked hard on all the assignments, attended and spoke up in class everyday, and did not get an A. The quality of the class is insulting; you can spend six hours a week reading a 200 page book to only have her actually discuss the material for 20 minutes. The lack of depth with which she approached the material was insulting, as though you had nothing better to do than put your other work on hold to do the reading. Sharp's lectures are unorganized and have absolutely no focus. She plays serious favorites, and if she doesn't like you, forget it. She thinks she's a cultured anthropologist, when in my opinion she is completely insensitive and has little respect for her students. Sharp is condescending, and clearly thinks that her enlightening experience studying in Madagascar makes her opinion superior to yours in every regard. Grading was completely arbitrary, and if you have a terrible TA (as in my case), drop the class. It simply is not worth your time. \nWorkload:\napproximately 150-200 pages of reading a week (sometimes interesting), plus three time-consuming projects and an obnoxious midterm and final that do not test your knowledge of the material whatsoever. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 30, 2004",
            "review_content": "\nSome parts of the class are extremely interesting while others are extremely tedious. Sharp makes the material connect to you and is an excellent teacher. She is also very picky about what you need to know for tests. The assignments were fun to do but time consuming.\nWorkload:\nBooks take a long time to read. Assignments time-consuming. Mid-term and Final difficult but if you study a lot you can do fine\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 29, 2004",
            "review_content": "\nI really enjoyed this class as an introduction to anthropology. Readings were heavy but generally really interesting, and I looked forward to going to class. There were some really great discussions that I felt welcome to contribute to. Mandatory discussion groups were for the most part unhelpful, but nice for last minute questions around the time papers were due. There's a lot of work involved in this class, but I found it less painful than a lot of the busy work I've done for other classes. It's possible to get a good grade with a reasonable amount of effort, although I will admit she threw in some random info on some of the tests. Overall she's very likable and class time was much more enjoyable than most classes I've been in.  \nWorkload:\nheavy reading every week, kinship chart project/paper, observation project/paper, field research project/paper, midterm and final. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 20, 2004",
            "review_content": "\nI feel cheated and angry that I had to take Interpretation of Culture with Prof. \nSharp and not with Prof. Taussig.  Class, after boring and unnecessay class, Prof. Sharp manages to talk about absolutely nothing.  Instead of actually teaching any of the concepts from the reading, Prof. Sharp would rather allow every student in the class give a personal example of something related to the most superficial aspect of the reading.  It blew me away how I could sit through an entire hour of class without once hearing Prof. Sharp say anything even tangentially related to the subject of anthropology.  After a semester of listening to the life stories of everyone in the class, Prof. Sharp found it appropriate to give a final exam comprised of questions about random and discrete words and phrases from the readings we never discussed.  Furthermore, she is extremely antagonistic and picks favorites.  In conclusion, take Interpretation of Culture with Taussig if at all possible, and if his class is full.....wait till the next semester.\nWorkload:\nmoderate amounts of reading, two papers- one that requires 10, one hour interviews\n"
        },
        {
            "course_name": "Africa: African Youth and Identity Politics",
            "review_date": "October 28, 2003",
            "review_content": "\n If you are interested in Africa, then this is a fantastic course. If you don't know much about Africa, but care about youth and culture and education (especially in post-colonial contexts), then also take this class. Sharp is terrific, she knows the material, can lead class discussions, lots of participation . The level of the class is, obviously, dependent on the students, but Sharp knows how to bring up controversial topics and ideas from students and stimulate you intellectually. This class is not about BS, and papers are graded accordingly. Be creative in how you present your ideas and think about anthropology/historical contexts/politics. Probably the best class I took at Columbia, reinvigorated me. \nWorkload:\nusual seminar work - A lot of reading, presentation, take home final and midterm papers. great readings. \n"
        },
        {
            "course_name": "Madness and Civilization",
            "review_date": "May 01, 2002",
            "review_content": "\nThis class rocked! Also, there are a lot of people who wrote that her grading schemes are inexplicable, which is entirely not my experience. She gives a detailed rubric to how she grades and follows it if you ask her for an explanation. She is super approachable in my experience and really interesting. From the previous comments, I get the impression that everyone simply wasn't prepared to do anywork. \nWorkload:\nReasonable, less than some seminars more than others. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "February 12, 2002",
            "review_content": "\nShe assigns a lot of reading which is ok since they are kinda interesting anyway. Her, tests, however, are like nothing I've ever seen. She deliberately sets out to confuse students by mispelling words and asking vague questions. Nearly the entire class came close to flunking the midterm. She actually had to add like 15pts. to everyone's grades. The real horrible tragedy was that she repeated this technique on the final. She seems nice, but she lets it all hang out on the exams. Pray for a nice TA!!!\nWorkload:\n2 easy papers based upon your very own ethnographic studies. A few smaller projects like drawing a family tree. Nothing too bad besides the exams.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 22, 2001",
            "review_content": "\nSharp is serious about the class, but the atmosphere is fun, light, and open. She herself is hysterical. A bit too much reading, although I admit that I have benefitted from it; it was culturally enriching. In testing, Sharp expects a little too much - you have to remember the slightlest, most insignificant details. Papers are graded too harshly, that's for sure. But she's a nice woman who shares her passion with the class in a fun and exciting way.\nWorkload:\n2 papers, a few quizzes, 1 midterm, 1 final, and tons and tons of reading that no one ever finishes.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 05, 2001",
            "review_content": "\nIf you are looking for a pass/fail class, this is it. While the reading is interesting, there is a lot of it. Her quizzes and tests are based on trivial information that bears no resemblance to anything important. She picks favorites and her paper grades are biased. She is personally antagonistical, but teaches a decent course.\nWorkload:\nStupid stupid memorization of stupid facts. Busy work.\n"
        },
        {
            "course_name": "Ethnographic Fieldwork in New York City",
            "review_date": "December 31, 1999",
            "review_content": "\nBears an uncanny physical resemblence to Margaret Mead -- long hair, short woman -- but that's about it. Her fieldwork on things like medical anthropology and spirit possesion in Madagascar are surprisingly bland. Unbelievably anal about things like paper formatting and footnoting protocol. Grading policy is tough and inexplicable, at least for papers.\n"
        },
        {
            "course_name": "Colloquium in Anthropology of Religion",
            "review_date": "December 31, 1999",
            "review_content": "\nHeavy reading list Good introduction to anthropological techniques / classics (Weber, Durkheim etc.) Very progressive view of the role of the modern anthropologists. Good class discussions, everyone leads one per semester. Good if you like to read and discuss. No prior anthro experience required.\nWorkload:\nBig final research paper and two essay tests (relatively heavy workload).\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 31, 1999",
            "review_content": "\nMy biggest gripe with the class was that I had no clue as to what the point of it was . . . which is alright, except that I got the distinct impression that she didn't know either (I even took the long walk to her Millbank office hours to ask). This would explain why she keeps asking about this point on the midterm and the final. Yeah, paper grading seemed kinda wacked out. However, it really was an interesting class, despite having no point. Mostly random bits of anthropology theory and case studies. But, where else do you get to read books about Balinese cockfighting AND the people who live in the subway tunnels?\nWorkload:\nreadings can get heavy, and are, unfortunately, nescesary for the midterms and finals, which are mostly based on trivia you'll pick up. a couple of papers, including a field paper that only sounds like fun.\n"
        }
    ]
}