{
    "prof_info": [
        {
            "prof_name": "Prajit Dutta",
            "prof_id": 1097,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Economics",
            "review_date": "January 03, 2017",
            "review_content": "\nLecture-based class with a discussion section, which for the most part reviews the problem set and occasionally review what was discussed in the lecture.\nHis lectures are okay, not stellar nor terrible. He knows what he is talking about, and you can learn most of the information from just reading the textbook. The only thing he changes are the examples he uses, i.e. Joe's Coffee. \nThe first half of the class is dedicated to Micro, the latter to Macro. Macro definitely the most challenging of the two.\nThis was his first year teaching Principles, so maybe next year he might do better. The TAs are pretty friendly, although most people did not go to the discussion section that I had. As a result, they're not mandatory and not much use.\nWorkload:\n6 Problem Sets (the lowest is dropped, these can be a huge pain)\nMidterm, not so difficult if you've been paying attention in class. 100% Micro\nFinal, the difficulty is what you would expect. 80% Macro, 20% Micro\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 22, 2014",
            "review_content": "\nDutta is no Elmes... and/but (depending on how you fall on her) I really enjoyed his class. I was going to take Elmes having heard what a good prof she is, but couldn't fit it in my schedule, so I signed up for Dutta, and I'm so glad I did!\nHe's a funny guy, with a bunch of quirks. Overall, very nice -- always willing to answer questions during and after class. He would always walk in 5-10 minutes late (he came in 10 minutes late on the last day of class, then ended class early), he lectures and then pauses really deliberately to sip his coffee... he's just a funny guy. We didn't have any class after Thanksgiving because we had a few makeup classes in September. Not sure what the point of that was... but it was pretty funny. You can kind of tell he doesn't give that much of a shit about the class. \nBut, he's very clear about the material, very straightforward. It's an easy class -- there's not a whole ton of complex math involved, it's pretty much just solving systems of equations and taking derivatives and such. If you do the problem sets and pay attention in class (supplement lecture material w/ book chapters on the same material if you want to understand it better) you should be fine on the exams. Midterm and final were easy. I rarely went to OH/recitation but the TAs were very friendly.\nI think it's a good foundation in Micro in that you learn all the basics, plus Dutta is a master at game theory so I think he does a good job going over that stuff and we actually learned similar stuff that you might learn in the actual game theory or industrial organization courses, but you definitely don't go as in depth into other topics of Micro, which Elmes definitely does. \nWorkload:\nstandard work for econ, except less stressful and less time-consuming than your average class\nproblem set every week, generally\nmidterm\nfinal that's cumulative but skewed to latter half of the semester, if I remember correctly\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "November 21, 2013",
            "review_content": "\nProfessor Dutta is an amazing professor. I came into the class with a  terrible experience in both Principles and Macro, and was thinking of switching majors. However, the way Professor Dutta taught this class made econ easy - or even fun from time to time. He uses very little calc, a lot of intuition and real life examples. Anyone who attends lecture can do really well even without reading the textbook (I barely ever read anything and got a 96 on the midterm). \nThe workload is extremely light. 1 problem set per week, more or less. Very easy midterm. A final that shouldn't be too bad either.\nIf you want an easy micro class that still teaches you all the concepts you need to know, take Professor Dutta. He is also just such a nice person.\nWorkload:\n1 pset/week.\nVery easy midterm.\nFinal.\n\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 04, 2011",
            "review_content": "\nIf you're somewhat of a logical  person, know your basic calc, and remember most of what you've learn in Principles, then this class will be a piece of cake.  Dutta tries hard to be detailed and let every single student understand every concept, but sometimes the few students who are not as bright really hold back the class.  Because of that, it's really not worth the time to go to class if you're willing to skim the textbook for 20 minutes every week.  If you do the homework and study the past exams that Dutta posts on courseworks, you'll get a decent grade.\nWorkload:\nweekly homework assignments.  easy midterm and final.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 26, 2008",
            "review_content": "\nGenerally a pretty easy class. Based on past reviews, Dutta seemed to have put in a little more preparation for classes with examples and (bad) humor. Lectures were not interactive at all, but also very simple. Everything came straight from the book, and most of the class only showed up for the midterm and final since it's at 9 am. You can easily do well by just reading the textbook and doing the weekly HW's. He skips a lot of subjects/details in the book that other professors probably cover, so your Micro knowledge from this class probably won't be very in-depth. On the flip side, his HW and tests are generally easy. It's possible that a fair number of students get perfect or near-perfect scores on the exams. Went to 1 TA session, wasn't helpful at all. They just go over past HW's to make sure everyone knows what's going on. Take Dutta if you want a good grade, not if you want a good foundation in Micro.\nWorkload:\n15% - Weekly HW's (First few were really easy, got a little tougher in the middle of the semester. Recommend checking answers with classmates).\n35% - Midterm (Heard it was really easy, but I accidentally slept through it. He was nice enough to shift my midterm percentage to the final).\n50% - Final (Fairly easy, only 1 or 2 parts of a question that were a little tricky. Very probable to get a 100%).\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "March 26, 2008",
            "review_content": "\nIn all honesty, this class was Principles Part 2, where we learned virtually nothing new from what I had learned with Professor Gulati in Principles of Economics. Dutta moves incredibly slowly, we spent way too long on simple supply and demand problems that were already reviewed in Principles. \nFurthermore, Dutta is extremely boring and  dull as a lecturer. While his notes are clear, he fails to command the class' interest; his occasional attempt to get the class to participate are utter failures -- his comments are met, for good reason, with the same lack of enthusiasm that he brings to class. \nIf you want to learn something in Microeconomics that is interesting and new, PLEASE take this class with Elmes. Yes she is harder and gives a lot more work, but you develop a much greater passion for Economics and appreciation of the subject. Also, don't be afraid of the timing of Elmes' class, even if it's later in the day, you get used to it. Elmes' class talks about interesting applications of Micro, such as determining insurance premiums, while Dutta stays on the very basic topics: Supply and Demand, Perfectly Competitive/Monopolistic markets, etc...\nThis class is not a challenge and doesn't encourage thinking or learning. If that's what you're looking for than by all means take it, but if you are genuinely interested in Economics, please take Micro with Elmes. \nWorkload:\nWeekly problem sets which are usually easy with the one or two problems that make no sense. Mostly taken from the textbook. These problem sets don't take long.\nAlso, midterm and final which are VERY straightforward. All the calculations are very simple, no tricks, pulls the questions from the basic examples we did in class and on the homeworks. \n\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 19, 2006",
            "review_content": "\nOverall a good boring class. The class lectures are extremely easy and the HWs are ok. Beware however that the midterm was hard and the average was in the low 50s. And there is a very very BIG but to the class. Honestly, it felt as if he didn't care about us at all. Everything, from choosing the HWs, grading them, explaining them and the midterm/final were done by the TAs. This was evident since the class notes were completely useless when doing the midterm or most PS. Everything was based on the book. So... if you take this class: lectures are unnecessary and keep up to date with all the readings which are much more important.\nWorkload:\nWeekly PS. Around 5 Qus. Fairly graded but with random points taken off. Midterm/Final hard.\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "May 19, 2005",
            "review_content": "\nThis class was interesting, but the professor comes late everyday and does not seem to care about us.  The exams are easy, as is the homework, but there is practically no curve...unlike in physics.  Definitely less than 50 percent of the class got an A or A- being that the average average was a 75 and for a B+ one needed an 80.\nWorkload:\nbarely any...weekly problem sets\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 10, 2005",
            "review_content": "\nA decent professor, although he was ten minutes late to nearly every lecture.  Lectures are straightforward and easy to understand; homework and tests are not very hard.  However, getting help in this class if you don't understand a certain aspect of the material is very hard.  His TAs could barely speak English and only held office hours at highly inconvenient times (some on Thursday and Friday evenings).  If you want a low-intensity micro class, Dutta  will give it to you, but you won't get a class that's  very intellectually stimulating or user-friendly.\nWorkload:\n11 weekly problem sets, midterm and final of moderate difficulty.\n"
        },
        {
            "course_name": "Game Theory",
            "review_date": "September 06, 2004",
            "review_content": "\nProfessor Dutta uses his own book and he follows it to the word literally. This is actually wonderful for a class that could get confusing at times.  His class is very organized and tests are fairly easy if you read the book, especially sections in the book that do not work out full solutions.\nWorkload:\nProblems sets, midterm, final\n"
        },
        {
            "course_name": "Intermediate Macroeconomics ",
            "review_date": "June 28, 2004",
            "review_content": "\nThis is the best economics class I've taken at Columbia yet.  The man really knows the subject well, and has the ability to make it interesting at times.  The classes are open for discussion and a sense of humor.\nWorkload:\nOne chapter of the textbook per week.  As long as you read the chapter, the 4 assigned questions will be a breeze.  Relatively short midterm and final, which is great, because you get some time to remember the material.\nOverall, very straight to the point:  Read the book, get an A.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 22, 2004",
            "review_content": "\nLet me start off by saying that due to schedule conflicts, I had to take this class at 9am and I am not what you'd call a \"morning person\". That being said, I thought this class was okay. His lecturing style is a little boring, but I'd be lying if I said that he didn't cover all of the material because Professor Dutta thoroughly goes over every bit of every chapter. Most of the time, I didn't have to read chapters to answer the problem set because he gave me all of the information I needed in class. If you show up to the lectures, you'll definitely be fine for the exams.\nHis problem sets consist of 4 - 5 problems in the book that are usually extremely easy to answer. This means two things: 1. Easy A+ for the homework grade 2. You don't really learn as much as the other micro class. He definitely repeats some of the stuff you learned in Principles and doesn't go in-depth at all. This is definitely something to consider, especially if you're going to be an economics major. I had O'Flaherty last term for Principles and I am extremely scared to take Econometrics and Macroeconomics next year due to my poor foundation of econ knowledge. Then again, this was his first time teaching Micro in a long time, so he could get better.\nWorkload:\nExtremely easy problem sets given out once a week that take about 1 hour to do\nOne midterm that had a curveball question, but not too bad overall\nOne final exam that was pretty easy\nOverall a fairly easy A\n"
        },
        {
            "course_name": "Economics of the Internet",
            "review_date": "May 10, 2002",
            "review_content": "\nThis is the most unstructured class ever. The Internet may be new and experimental, but the class doesn't have to be. If nothing else, there should have at least been a computer in the classroom in order to navigate the net and demonstrate and illustrated points better. The professor chose to try something new, and so half the semester was wasted as students had to make worthless group presentations that caused each class to run an hour longer than it was scheduled to. The first half of the semester was micro-intensive, but Iron Dutta failed to teach those concepts and focused on game theory. The midterm then had NO GAME THEORY. The most prepared students suffered while those who were taking micro concurrently did well based on that outside knowledge. In addition, the lack of a text and failure to provide examples for problems further illustrated Dutta's lack of interest in helping the students to learn the subject. While an interesting person, he failed to provide the support the students need to succeed in that class. Finally, aside from the group presentations, he never actually discussed the Internet. WHERE WAS THE INTERNET? It is supposed to be an class about the Internet! All that was taught was models for competition, and poorly taught at that, and game theory, which seemed the focus of the course and the problem sets but excluded from the midterm. And with the second half of the semester devoted to presentations, not a single student could fathom what the content of the final would be and not a student had done any work for anything that would be on the final. The class essentially stopped the day after the midterm, and yet we were supposed to learn more concepts like network externalities and vertical differentiation and to apply them to the final. Frankly, Professor Dutta wasted our semesters, and since the midterm is after the drop date, there was nothing we could do about it. The TA's are unsure of what they are teaching us in the review sessions, frequently making mistakes or disagreeing with what the Professor taught, and the head TA doesn't speak english well enough to be understood half the time, although to his credit, he does his best. Professor Dutta has yet to apply the class to the Internet and thus has attempted, failingly on the whole, to teach us non-applicable skills. \nWorkload:\nWeekly problem sets with insufficient teaching to go off of, and only 3-5 hours of individual effort for the entire second half of the semester.\n"
        }
    ]
}