{
    "prof_info": [
        {
            "prof_name": "Stephen Massimilla",
            "prof_id": 640,
            "total_reviews": 39
        }
    ],
    "reviews": [
        {
            "course_name": "Modernist British Fiction",
            "review_date": "May 21, 2012",
            "review_content": "\nProfessor Mass is a nice guy and his lectures are interesting, but his classes are a crap shoot.  Each week, our seminar ran an hour over, and he talked nearly the entire time.  He asked for response papers on most of the books.  The essay questions for the two papers ran two pages single spaced.  This is just his way; he complicates the course to make it much harder than it has to be.  He grades response papers, as an example, \"B/B-\" and says that grade really means \"A- or maybe even an A in some cases.\"  Response papers are said to be \"optional...if you want to be sure to get an A,\" but Prof. Mass grades by check marks and half check marks It's not clear how professor Mass grades, but if you're looking for the easy A or a certain opportunity to earn an A, avoid his classes because you'll be guessing till the end.\nWorkload:\nA classic novel, as \"Heart of Darkness,\" \"Ulysses,\" and \"Women in Love,\" every two weeks.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "August 18, 2011",
            "review_content": "\nI had Prof. Mass (yes, an endearing nickname) for Modern Poetry in my senior fall. Awesome class. He is a wealth of information and ideas, eccentric, knowledgable. Be prepared to listen carefully when you get to class though. He throws knowledge at you (often a hodge podge of literature and philosophy- but don't worry, CC covers enough of the philosophy you need- and also, his own theories and interpretation.)\nHe is friendly, kind, fun, and interesting. Likes it when you participate in class. Take the class! \nA note: If you enjoyed CC or philosophy, you will enjoy the modernist literature, since it is often about the search for meaning. \nWorkload:\nStandard workload for an English class. Interesting reading. \n"
        },
        {
            "course_name": "Modernist British Fiction",
            "review_date": "July 08, 2011",
            "review_content": "\nI am a Freshman and this was my second class with Professor Massimilla. \nNot only is the syllabus incredible (You can look forward to reading: Ulysses, Heart of Darkness, the Good Soldier, Mrs. Dalloway, Women in Love, and A Passage to India), but Professor Massimilla is astonishingly well-versed in Modern(ist) Fiction, Modern(ist) Poetry, and a broad spectrum of other topics. The best part about this class is his passion: he loves what he is teaching, he knows a lot about it, and he truly desires to make these dense works accessible to his students. He is funny, erudite, willing to work with his students on deadlines, consistently available, and genuinely kind. He is exactly what you want/imagine in the perfect professor. I took this class because I wanted to read Ulysses in an academic setting-- Massimilla recognized the daunting intricacy of the work and endeavored to make it easier for his students. If all of this information weren't enough to persuade you to take a one-day-a-week-class on amazing works of literature, Professor Massimilla held one session at a restaurant near campus and paid for everyone's dinner! He PAID for dinner while we discussed James Joyce.\nIf he lectures at all, it is only because the class is really not long enough for the material it covers. And his lectures are always insightful and worthwhile. The workload is completely manageable for a class covering these books: 1 short essay on each work (essentially free response and not a lot to ask for a class that meets once a week) and 2 longer papers. \nThis class is amazing. The professor is amazing. I would take it again a hundred times.\nWorkload:\nReading, 1 weekly short response (1.5-2 pages), and 2 longer papers (~7 pages). \n"
        },
        {
            "course_name": "Modern Poetry II",
            "review_date": "June 14, 2011",
            "review_content": "\nI just graduated from CC and thinking back on my college experience, I can say with full confidence that not only was this the best course I've taken in my entire Columbia career, but also that Prof Mass is one of the most intelligent and inspiring professors I encountered. The only complaint I have is that my hand was sore after taking notes each class, because every word out of his mouth was so valuable I did not want to risk forgetting a word of his lectures by not writing everything down.  Not that it is at all necessary to take frantic notes.  His workload is more than manageable, and the final exam was more than fair.  He is extremely approachable and his enthusiasm is contagious.  He is not only an incredibly valuable source of information, but he is always more than willing to help with anything from a paper topic to a simple question after class. I'm not sure where the negative reviews are coming from, but everyone I took the course with loved the class as much as I did. \nTAKE THIS CLASS!!!!\nWorkload:\nManageable, 2 papers and a final exam\n"
        },
        {
            "course_name": "Modernist British Fiction",
            "review_date": "June 01, 2011",
            "review_content": "\nI have to say that I disagree with the previous reviewer. I'm also a senior who took this seminar this past semester and I loved it. It's true that he does like to talk a lot (I always end up with my wrist spazzing out from all the notes I take), but he does allow students to interject with their opinions and whatnot, and he works at making it into a discussion. That was, at least for me, what those group projects were all about. Personally, it helped me focus and analyze whatever one theme our group decided on and get a sort of deeper understanding of the text, because we usually try to simultaneously cover depth and breadth which is a difficult task.\nThe extra thirty minutes thing wasn't really a problem for me... And I had to leave every week, without fail, exactly at 8:00 because I had somewhere else to run to. I just made a friend in the class, and we'd exchange notes if either one of us were absent, and when I would borrow her notebook, I would just make a copy of whatever bit I missed in the extra thirty minutes. It's just difficult because the texts we read are really dense (as all modernist texts are), and we do go through a fair share of books, so two hours a week really isn't enough. I certainly felt like time flew by when I was in class.\nI did miss a few classes, but I don't think he gave us any shit about it. He'd make a passing remark or something every now and then but that's just his sense of humor. I was never really offended by anything he'd said; maybe I'm just not as sensitive, I don't know. \nHe's never been slow with email responses with me, and really, if you take the time to talk to him after class or drop him an email asking for an extension with a valid kind of excuse, he's really nice about it. I know from previous classes with him also that he'd happily send you a really long email bouncing off ideas on a paper topic that you'd want to write about, if you take initiative.\nI can see how the sort of seeming \"structurelessness\" of his lecturing style (yes, he *does* lecture, but as I mentioned, he also opens up room for discussion) can be frustrating for some people, but when you read through your notes again carefully, it does actually make a lot of sense. It may not be chapter-for-chapter, but you slowly start to understand the structures that we're trying to cover. Which is, well, a great first step for modernist literature.\nIf there was one thing that I struggled with, it was containing three modernist texts into five pages for our papers! My second one, after endless edits, was finally cut down from it's original 12 page length to 7 pages...\nAnyways, the course syllabus is amazing, and there is a lot of reading (of course, it's a seminar after all) but all of it's interesting! You really get back as much as you put in in this seminar, and it was actually one of my favorite classes this semester, and I would recommend it to anyone -- don't be intimidated even if you aren't an English major! Really. Take this class. You won't regret it.\nWorkload:\nTwo five-page papers. A few one page responses to the text (he gives you a few guiding questions if you are absolutely stuck as to what to write). We go through one novel every two weeks (except for Ulysses, which we dedicated about three, four classes to). Group presentations (usually ~5 mins) are really stress-free. You just hang out with your group members/talk with them over email to figure out what you want to say for about 20 minutes.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 31, 2011",
            "review_content": "\nprof mass. you either love him or hate him. i took \"modern poetry\" my sophomore year, and it remains one of the best english classes i've taken at columbia. he's funny, witty, and extremely passionate. one of his readings of t.s eliot made a girl faint in class. yes, his lectures can be rambling and go on many tangents, so if you're the bullet-point type of note taker, then steer clear. but if performative lectures, free wheeling narratives and multiple allusions are up your alley, take a course with him while you can. \nWorkload:\nonce a week discussion sections, midterm, final and papers\n"
        },
        {
            "course_name": "Modernist British Fiction",
            "review_date": "May 21, 2011",
            "review_content": "\nI am a Senior, and this was my second class with Prof Mass. I enjoyed both classes with him. He is incredibly knowledgeable and passionate about modernist fiction and poetry. The syllabus was great, and those group presentations often lend to interesting discussions. Prof Mass does have a tendency to fall into rambling lecture mode, but what he is saying is always worthwhile. I will say that he really should mention on the bulletin that he intends the class to be 6-8:30 instead of 6-8. Also, I think part of the reason he started lecturing so much is because he kind of overloaded his syllabus. Ulysses took up 4 classes and people started to lose focus by the end of it. He would do better to substitute it with one or two shorter, challenging works. I have found him to respond to emails within a day, which is not unusual for professors. As for the Passover/Jewish remarks situation--his remarks were not offensive at all.\nWorkload:\na few responses, 2 5-6 page papers\n"
        },
        {
            "course_name": "Modernist British Fiction",
            "review_date": "May 01, 2011",
            "review_content": "\nLet me just say that this is my first CULPA review, and I'm a senior.  I had such a horrible time in this class that I had to review him, and I'm honestly not sure how or why this professor is silver-starred.  And as a side-note, this review has nothing to do with the grade I've received in the course, as I did well throughout the semester.\nAs a disclaimer, this course is supposed to be a seminar, but for all intents and purposes, it's just 2 hours of Prof Mass (as he will have you call him) lecturing, and disorganized-ly at that.  He also failed to mention in his course description that he keeps his class 30 minutes extra after class, saying \"it's just optional,\" but really expecting you to stay.  And this class was on a Monday night from 6 to 8.  \nTo be fair, the syllabus was great (Ulysses, Heart of Darkness, the Good Soldier, Mrs. Dalloway, Women in Love, A Passage to India), and Prof Mass clearly knows his stuff.  However, he often rambled without providing us with any information, and he never facilitated class discussion.  When students would try to contribute, he would often interrupt them immediately and not let them finish a thought.  He would also then have us to these weird little group exercises during class in which we would divide into small groups for 10 minutes, discuss a topic of his choosing, and present to the rest of the class.  These were ultimately unhelpful and a waste of time.  \nAdditionally, he is not amenable to students missing class.  If you do miss a class, he requires you to write a response paper on the week's reading anyway, and if you miss handouts from a week you've missed and then ask for the missing handouts, he puts up a stink about you having missed that class.  He is also VERY slow to respond to emails, which I always think is frustrating.  On a completely different note, the course fell during Passover week, and Prof Mass made some rather offensive and insulting comments to some students who explained that they had to miss a week because they were observing the holiday.  \nOverall, one of the worst English classes I've taken in college, and one of the worst professors I've had at Columbia.  If you don't want to leave class angry every week, steer clear of this professor.  \nWorkload:\nLots of reading (around 150-200 pages a week), but it's good stuff.  Two 7-page papers.  Weird group presentations.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "December 22, 2010",
            "review_content": "\nRambling, but thoroughly likable and approachable, like a Keebler elf with flyaway hair. And definitely always interesting, even if you think poetry should have ended with the dirty limerick. The best thing about Prof Mass, besides the crap Irish accent he puts on for Yeats classes, is that it's fine if you can't find a sensible narrative thread through his lectures, because you will never be asked to throw up his ideas or theories in a paper or on an exam. Every assignment is totally in the moment - it's all about your reading of this single poem. Handy for those of us with short memories. Just make sure that you set aside the week leading up to the due date of a Prof Mass paper, because that's about all the advance notice you'll get about the actual topic. Dude is not so much into preparedness or deadlines.\nWorkload:\nThree page-long informal (optionally creative!) responses scattered throughout the semester, one five-ish page midterm paper, one regular paper, a final comprised mostly of passage IDs.\n"
        },
        {
            "course_name": "Modern Poetry II",
            "review_date": "May 16, 2010",
            "review_content": "\nHow do I even begin to describe my love for Prof Mass? I agree with some of the previous comments that, as far as learning about poetic syntax and whatnot goes, this class will not be satisfying. A previous reviewer said it's like a Poetry Appreciation course - quite right, too! I mean, I'd read some poems here and there, whether they were for class or just for kicks, but it wasn't until I'd taken this class that I fell in love with poetry. Prof. Mass is such a smart guy - I just want a look inside his mind because he will just throw anything at you, from Heraclitean flux to the Lotus Sutra, and then even throw in some references to 17th Century Japanese history in reference to that one John Ashbery poem we did. His lecture style is only very loosely structured - we stuck to the syllabus more or less, and we would have gotten through all of the works that Prof Mass wanted to go over had we not had that snow day (which he did keep referring back to... That damn snow...!) - and it broke down with an introduction to the poet, and then Prof. Mass jumping back and forth between poems and sparking discussion about it. The discussions were usually more thematic than anything - like I said, it's more of an appreciation class. He can also speak Spanish, French and Italian (maybe more?) well so he would read the poems in the original language every now and then, which was really lovely. He's a bit kooky, seems to really care about his students (you have to set up appointments, despite office hours, to talk to him, but he's pretty accessible via email), and I personally found his sense of humor really funny, so if you're looking for a class that you'll look forward to going to, I'd definitely recommend Prof. Mass's!\nWorkload:\n2 Responses (they could be close readings of any poem from the syllabus that we've discussed, or you can write a poem imitating the style of a poet that we've covered - 1 page), 3 papers (5 pages), and 1 final.\nThe final really wasn't as bad as previous reviewers made it seem - it was 15 IDs (identify the poet from a short passage from a poem, and explain briefly why you know it's that poet that wrote it), 10 passages (they're the same as IDs more or less but in more detail - the poet, the name of the poem, about the style, theme of the poem and how the passage reflects that, etc etc), and one essay.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "April 16, 2010",
            "review_content": "\nIn light of the comments that Professor Massimilla (or Prof Mass, as you will be sure to call him) is condescending to Barnard women, I have to say that I did not find this at all. I don't think I heard him make a derogatory comment about Barnard throughout the entire semester.\nWith that cleared up, I enjoyed the class. He does tend to ramble on a bit, but what he has to say is usually quite interesting. His background with languages adds to the discussion, as he often talked about the differences in the connotations of language between the original text and the English translation. He definitely loves teaching this class. He does ask for people's opinions and encourage class discussion, but there will be times when he talks for an extended period of time about the book. You WILL need to do your reading; your essay grades will not hold up if you do not. You probably don't need to do all of it, but definitely enough to keep up in the discussions and be able to write knowledgeably about the book. \nI think the best thing about this class, as someone not enamored with literature, is the feedback on your papers. Prof Mass actually does read your papers, and he is not afraid to mark them up quite a bit. It will definitely not be easy to get an A on a paper, but it is doable. He wants to make you into a better writer, and you will definitely learn a lot by the end of the semester.\nEspecially in light of what I have heard about some other FYE professors, I would recommend that you take Legacy of the Mediterranean with Prof Mass!\nWorkload:\nTwo analytical essays and one research paper. Manageable reading. \n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "January 05, 2010",
            "review_content": "\nProf. Mass is an excellent professor. His class was extremely valuable to me, because his perspectives on each of the poets is a great combination of the official critical consensus and his own observations and crazy, quirky readings of the poems. He does occasionally get into weird topics (bringing in Kant's thing-in-itself, Heraclitean flux, etc.), but, hey, this is Columbia, and if you can follow him, his observations are almost always germane to the poem. The best thing I can say about this class is that there are about a half-dozen poems, maybe more, that I didn't know before I came into this class that have had a profound impact on me the way poetry (and literature in general) ought to.\nI understand why some reviewers have considered Prof. Mass overrated, and I consider some of the objections valid. For instance, Prof. Mass' lecture style is fairly disorganized; the first time you encounter a poet he'll usually give a biographical sketch, but after that, he'll just sort of find a poem he likes and ramble about it, bringing in ideas from philosophy, finding political/cultural references, explaining subtle (and not so subtle) allusions, connecting the poem to the poet's career as a whole, and occasionally asking questions. This would be unpleasant if his rambling wasn't 100% full of valuable observations about the poem at hand. Nevertheless, I can see where this style might irritate some students. The other thing about Prof Mass is that he doesn't generally go into many technical nuances of syntax or devices, or do line-by-line analysis of the poems. It's not that he can't (he does, every now and then); it's just that he tends to stay more general, making specific observations and dealing with how one thing connects to another, etc. I actually agree with the person that said this class was Modern Poetry Appreciation, and honestly, I feel that it should be. I'm sure there are more technically intensive classes out there, but going to class and getting Prof Mass' readings of some interesting poems, is, if nothing else, a great way to spend and hour and a half every monday and wednesday.\nAlso, fyi, he may or may not bring it up in the first couple of classes, but there are discussion sections that you will have to fit into your schedule. They're not technically mandatory, but they deal with a lot of the poems you don't get to in class, and they help the participation part of your grade.\nWorkload:\nTwo long essays, three short responses. A final which is medium difficulty (lots of passage IDs, which range from extremely easy to pretty hard). There's an expectation to participate either in class or in discussion sections which is part of your grade. Overall, not very difficult.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "December 15, 2009",
            "review_content": "\nA little bit crazy but pretty effective at presenting a wide variety of modern poets, raises lots of weird existential questions and sometimes is hard to follow but definitely appreciates and loves what he does.  He is a poet first and a professor next, sometimes I felt like I was in a performance instead of a class and got lost and had no idea what poem we were originally talking about.  It's a good class to fulfill the English poetry requirement though.  When you actually go to his office hours, you definitely get the sense that he is always thinking about what the subject of his next poem will be and one-on-one time often complicates your understanding of the poems more.   \nWorkload:\n3 short (1 page) response papers, 2 longer (3-5 page) papers, 1 medium-difficulty final, and poems for class each day\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "November 01, 2009",
            "review_content": "\nProf. Mass is awesome!! He is so enthusiastic, dynamic, and energetic. He is very excited about the material, and his excitement is absolutely contagious! Modern Poetry was a fulfilling class to take with him--a great introduction to American and British modernist poets. Prof. Mass is very knowledgeable about his material--he knows many of these poems by heart, and reads into them with great depth. He puts a lot of effort into his class, and in response, you want to do the work and put in your share of the effort. He comments on papers meticulosuly, giving you a plenitude of constructive criticism and feedback. The only drawback about Modern Poetry is that class should be a bit longer! Prof. Mass always has more to say, and you always want to hear what it is. I highly recommend him--but see for yourself, go to the first class and get blown away by his energy!\nWorkload:\nReadings, 2 papers, 2 responses, Final\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "October 07, 2009",
            "review_content": "\nDisappointing. This course should really be called \"Modern Poetry Appreciation.\" Massimilla's sole intent is seemingly just to get you to like modern poetry. He does that--or I should say that the poems do that. They're wonderful. But this is hardly sufficient for a 3000-level course at Columbia. The source of the problem, I think, is that Massimilla isn't an academic; he's a poet. He's a pretty good one but his perspective makes this a very limited class in my opinion. He doesn't  sustain coherent arguments. Like a connoisseur that will taste something and tell you how great it is and how it reminds him of that dish he had in Napa, Massimilla will spend a lot of time talking about how this poem is like another poem, or how lovely it is, or what category it belongs in, or how he once met the poet and what a funny man he was, etc. This is why I say it seemed more like a poetry appreciation class. There's much enthusiasm but not a whole lot of insight. The (rather obvious) assertion of the course as a whole was that there are multiple modernisms. I recall a very funny gourmet, lovely guy he was, who once waxed poetic on the world's varieties of salt: there's smoked and flaked and rock and...I nodded off after he started his classifying but before he ended it...which reminds me of a certain class that I once took.\n\nWorkload:\nNot much. Couple papers, final, informal responses.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "August 22, 2009",
            "review_content": "\nProf. Mass. is incredibly well-read, and this class has been one of my favorites at Columbia. You will learn so, so much about modern poetry and its roots, but you will also love the reading, which just consists of beautiful poetry. Prof. Mass. himself is charming and quirky and wonderful as well; he hosts dinners for former students and always comes in bouncing around and throwing up notes. The class is a lecture, but it was never boring. I often found myself writing down his words verbatim in my notebook, since he has such insightful and beautifully phrased remarks about each poet. \nYou really delve into the poems themselves, too, and he loves class participation, so speak up. He is such an incredible professor that he made a large lecture feel like an intimate discussion section. If you're interested in poetry, you will absolutely love getting to class, madly copying down the notes, and doing the reading. Everything I did for this class was a pleasure.\nWorkload:\nA few papers, 2 (short) creative responses, midterm, final - mostly all IDs\n"
        },
        {
            "course_name": "BC1201 First Year English",
            "review_date": "July 17, 2009",
            "review_content": "\nI had prof Mass for my Barnard First Year English class and the previous comment could not be more untrue (they may be tripping on sumthin). (incoming first years-- do not fear--you're lucky to be in his seminar) Prof Mass was always enthusiastic and knowledgeable and is one of the professors i tell all my friends about. He can speak many languages, and was able to spout off our reading in italian and ancient greek, among others---adding an interesting twist of comp lit and 'reading in translation' and helping us read into deeper meaning and word play. He encouraged class discussion and was especially conscientious of making sure that everyone (even the shy) spoke up in class. He does mention that he teaches at other schools, including columbia and nyu, but never mentioned barnard in a derogatory light. He's really understanding about papers etc, and tries to help you figure out just what you're really trying to say. It was a great intro into english and i look forward to future classes with him. Most importantly, he cares about his students--at the end of the year he invited all of his former students out to dinner to casually get together and bond. He's really an amazing professor and have fun with him. \nWorkload:\nModerate. DO THE READING. you'll feel better about yourself and it tends to ya know, help with the essays. Also, if there is something really serious, prof mass may be understanding about reading your essay a day or two late. \n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "July 17, 2009",
            "review_content": "\nHere's why all his Columbia students love him and write rave reviews whereas Barnard students do NOT feel the same: he thinks Barnard is INFERIOR, and treats us as such. During class he constantly sang praises about the Lit Hum curriculum and his brilliant students \"across the street,\" and would tear us apart and offend us whenever we finally spoke up about whatever we were discussing. Not that he gave us much of a chance; even though Legacy of the Mediterranean is supposed to be a discussion-driven seminar, he literally rambled 90% of the class time and would never stick to one \"discussion point\" for more than a second. He seemed more interested in showing off his knowledge of literature as opposed to encouraging us to speak our minds and offer our own opinions on the text. Every class was torture, and I don't speak for myself when I say we literally dreaded every Monday and Wednesday afternoon. \nWorkload:\nTwo 4-5 pg papers and one 8-10 pg research paper. We had to turn in revisions for each one, and if you did not italicize or underline or somehow mark your changes, hell froze over.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "June 15, 2009",
            "review_content": "\nI had Prof Mass for First Year Writing at Barnard and I absolutely do not recommend it.  Without a doubt he will make a comment about Barnard being inferior to Columbia in every single class.  I am not easily offended but by the end of the semester his comments became out of control.  If he has such a problem with Barnard he shouldn't be teaching here! The only good part about the class is that he loves to hear himself speak so you never have to do any of the reading for class since he'll do all the talking anyway.  Overall, I highly recommend avoiding him at all costs.\nWorkload:\nBare minimum for a FYE course.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "May 17, 2009",
            "review_content": "\nAs a senior I just have to say that I'm really glad I took this class. The work was moderate... maybe a little bit much if you do all the readings, but you don't really have to read all the poems just the ones he highlights in class. If you have time go to the first lecture, and check it out yourself... the decision will be easy. \nWorkload:\nmanageable  \n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "February 23, 2009",
            "review_content": "\nProf Mass, as he likes to be called, is the best professor I've had at Columbia so far. Not only does he know his stuff through and through (he often quotes extensive lines of poetry by memory, sometimes in the original language), he also has the vibrant personality to infuse every poem and poet with energy and make you equally interested and passionate in the subject matter as he is. To top it all off, Prof Mass is also HILARIOUS, and had us in stitches several times per class. Although he is a really sweet guy, Mass can sometimes seem arrogant (he once replied \"Who cares?\" to a particularly long winded and irrelevant question raised by a know-it-all in class), but this arrogance to me is endearing, because he has the intelligence and credibility to back it up. He packs plenty of information into each lecture, but you're not required to remember (or understand) everything. He exams are more of a test of analytical skills and application rather than memorization and rote regurgitation. \nIf you like whip-smart, slightly sassy, extremely intelligent professors, don't hesitate to take a class with him! \nWorkload:\nLight to Medium. Don't have to read every poem he assigns, just the important ones, which he goes over in class anyway. A few in-class responses, short papers, and an easy final at the end. \n"
        },
        {
            "course_name": "Modernist British Fiction",
            "review_date": "January 25, 2009",
            "review_content": "\nTake this class!\nProf Mass has the passion and the dedication that you came to Columbia for. Personally, I took this class to fulfill a core requirement. I'm no lit major and English isn't my first language, BUT this class was the perfect jump into the deep end that I needed.\nJames Joyce and H.D Lawrence may be a tough pill to swallow on any other day (for me anyway), but prof mass made me look forward to reading it and the discussions in class were thoroughly engaging, fruitful and frankly, mindblowing at times.\nAs for the syllabus, the books that you'll read in this class will be a major part of your education. I couldn't see myself going on about my life without ever reading Mrs Dalloway and Heart of Darkness. But to get a chance to discuss it in depth and listen to Prof Mass' brilliant take on it is an opportunity you must take.\nIn short, tuition well spent ;)\n\nWorkload:\nRead the books and you'll be just fine. Massimilla gave us just enough time to read each book (we had about a month to read Ulysses), and then we had to write a page-length's comments for each week. Besides that there was a 5 page midterm paper and a 10 page final paper in which we explored different topics in our favorite books.\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "January 08, 2009",
            "review_content": "\nOnce in a while, whether by accident or luck, you find one of those classes that confirms that you are paying forty grand a year for something meaningful after all. Not because twenty years from now you'll go to some cocktail party where the host will oh so casually ask you what you think of the classics or because that blue & white seal of approval will look good on that piece of paper you are handed after four years of slaving away as your student loans reach astronomical proportions, but because the class actually helped you become a better writer and thinker. Modern poetry with Prof Mass is one of those classes. While the syllabus is definitely ambitious, I thought it very fair given the inclusive survey nature of the course and the time span covered (early to mid 20th century - a busy time for poets on both sides of the Atlantic). Prof Mass is a wonderful lecturer and always manages to make daunting material approachable. He never claims that his own reading of a text is the ONLY reading, as certain others poetry profs in this department love to do, which is refreshing. Rather, he provides a way of looking at a poem and encourages you to think about what you have read and take it a step further. His comments are informative and layered, paralleling the texts nicely. Like the poems we read, Prof Mass' lectures can be taken on a number of levels. If you love anecdotes, you will get great anecdotes. If you want an analysis of structure and language, he does an amazing job with that. If you're interested in biographical connections, you will get a ton of facts. If you would like to know more about the allusions, he will point out how the poem echoes other poems. Regardless, his readings are always thought-provoking and original. The nice thing with Prof Mass is that tries to provide a bit of everything, something both for the freshmen and the seniors. And he can actually do it. It's not as if he knows a lot about a small range of material, rather he knows a lot about almost everything. He's so well read, you might think he spent a couple of previous lives in Butler. However, he never lords it over you. \nHe seems to know almost instinctively what is appropriate and not appropriate material for a survey course. I don't know why some of the other reviewers thought he was full of himself. To me he seemed very down to earth in his own way, helpful with paper topics, willing to discuss extensions, a great resource for questions regarding secondary material, careful and deliberate in the manner he presented material, and (a miracle!) he actually reads your paper, unlike some of the people who teach surveys. Having taken classes with almost all the faculty in the English department, I can honestly say he's a wonderful professor and not just your average â€˜intellectual entertainer.â€™ Hands down, this class was one of the best I've taken at Columbia. Do yourself a favor and register for it.\n\nWorkload:\nVery fair - two papers, three responses, final \n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "January 01, 2009",
            "review_content": "\nI think this is a great class. Prof Mass is a very knowledgeable guy and he's funny and entertaining. He's pretty full of himself, but he can be because he knows a lot. The T.A's, Lytton Smith and Hiie ___, were equally talented. You read a large survey of poetry so you don't really delve into depth. There is a large focus on Yeats and Eliot. I'd advise this class if you like poetry or want a good intro to English class. \nWorkload:\ntwo papers, three responses, final\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "December 29, 2008",
            "review_content": "\nI took Modern Poetry with high hopes after reading all the glowing CULPA reviews. While my hopes weren't exactly dashed against the rocks, they weren't quite fulfilled either. Prof Mass is quite the character and can be entertaining, but his treatment of the poems was often less than satisfactory. He crammed a ton of poets onto the syllabus. He did acknowledge several times that he was trying to tackle too much but that didn't deter him from trying - to the detriment of the quality of the class. We skimmed over several less well-known poets, but the time probably would've been better spent delving more deeply into major poets. His lectures were also disorganized; he went on a lot of tangents and would sometimes jump from poet to poet (trying to make connections but not always succeeding). Perhaps this style works for some people, but in general, it made it hard for me to appreciate the poems. Of course, his solution to the overly ambitious syllabus was to speak super fast during each lecture, but that ended up being counterproductive because it was then even harder to process the information and take notes. \nTo be fair, Prof Mass did repeat a lot of the major points, and those were what you needed to know for the final, but if you want to get anything more than a boiled-down, bulleted list of characteristics for each poet, then this class probably won't benefit you much (except for the fact that you get to read a ton of pretty cool poetry, but you can do that on your own). Yes, he is intelligent and enthusiastic, and he definitely knows his stuff, but at times, it seems to be more about how much he knows (and who he knows) than about teaching the material. \nWorkload:\nTwo 4-5 page papers (with pretty broad topics), three 1-2 page responses, easy final (IDs all came from poems discussed in class).\n"
        },
        {
            "course_name": "Modern Poetry I",
            "review_date": "December 16, 2008",
            "review_content": "\nDissenting opinion here. Look, Massimilla's a great guy but to say he's a great teacher one must not have taken many courses in the department. He's enthusiastic, multi-lingual, and has vast stocks of poetry memorized. He'll tell a funny anecdote from time to time, and does a respectable Brando impersonation. That's all very lovable, as his groupies will attest. But his treatments of the modernist poets are very superficial. This is a lecture/survey course, so a degree of generality is to be expected, but Massimilla will either give you the sparknotes reading of a poem or delve into esoterica about it that's occasionally interesting but not very useful. At the end of the course, looking over my notes, I realized that I didn't jot much down, and not for a lack of attention--he just didn't say much worth remembering. That I think sums it up. This is fine for a low-pressure class, but it's very frustrating if you have genuine curiosity about the material. There are far better classes and professors than this in the department. In other words, he's the poetry version of Bruce Robbins, if you know what I mean (pedagogic reputation far exceeds actual worth).\nWorkload:\nTwo short essays, three responses, final.\n"
        },
        {
            "course_name": "20th Century American and British Poetry",
            "review_date": "January 22, 2007",
            "review_content": "\nProf Mass infused this class with so much fun and genuine insight. I came in hating poetry and left with an obsession. He quotes Dante in Italian, personally knew Kenneth Koch and Louise Gluck, and offers insight into your own work. And on occasion he even brings in organic treats. He writes more commentary on your essays than you originally wrote and almost all of it ends up being helpful. The classes focus on specific poems with general notes on the author. \nIf you're an English major, or just dabbling in the realm of poetry, take this class. \nWorkload:\ndecent amount of reading (but its all poetry), 2 papers (5-8), and a quiz/final exam, also occasional responses to the reading but these can be creative.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2006",
            "review_content": "\nWhat can I say about Prof Mass? He's goofy, he's a genius, he's a little full of himself--though that's totally deserved. \nLit Hum with Prof Mass was so much fun--he really knows his stuff, and he always has something insightful to say about the literature, the history, the language, or any other number of facets of the great works of Western Lit. \nThe cool thing about taking the class with Prof Mass is that you don't really have one certain thing to focus on; with many other professors you'll only get pieces of the whole: one will focus on the language, another on the form, another on the history. Prof Mass, despite the fact that he specializes in 20th century poetry, can tell you about everything from the entire chronology of the Roman empire to the specifics on the form of the Petrarchan sonnet. (In fact, on the fall Met tour, he was correcting the tour guide!)\nThe class itself is great. You write 2 papers a semester, plus the midterm and the final, but most of the work hinges on your actually having read the books and participating in the discussion. The discussion is fun too. \nProf Mass is big on group work and on meandering class discussions/debates, where the suggestion of a topic (ie is Dido guilty?) can spark an hour and a half of spirited argument on both sides. \nOkay, long story short: Prof Mass is great. Take a class with him if you get the chance. \n\nWorkload:\ntwo 5-6 page papers, midterm, & final. Nothing you can't handle :)! \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2005",
            "review_content": "\nMassimilla is a great choice for Lit-Hum. He knows his stuff, speaks several langauges, and is extremely creative. HE's a bit on the crazy side, but that makes class all the more interesting. Just make sure to let him know that you are keeping up with the reading and that you like him, and it won't be too difficult to end up with an A/A-, especially when he begins to try to do math with the curving (I'm actually not quite sure that there is very  much math involved...) \nWorkload:\nfirst semester- response questions in addition to the usual lithum workload. second semester- much fewer response questions\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 24, 2005",
            "review_content": "\nAwesome professor! Professor Massimilla or Mr. Steve, as he told us to call him on the first day, is fun and very enthusiastic. He is incredibly knowledgable and gives a really in-depth analysis on each book we read. His extensive  knowledge of Latin, French, Italian, and Spanish will come in handy in the second semester when you read Dante, Montaigne, and Cervantes\n His teaching style is a slightly erm...off the beaten track (in a good way). Often he'd try to relate certain things in the books to modern situations (ie St Augustine stealing pears in his youth to... little kids, today, who throw milk cartoons at the lunch lady). Often he'd approach a topic from different perspectives, which is very insightful. His midterm and essay topics are much more difficult then the ones other Lit Hum professors give, so if you're looking for slacker class, this is not it.  However, if you make an effort in class and read all the books you'll do fine.\nOn top of all the aforementioned postive things about his class, he brings organic cookies and brownies to class everyday!  So if you're a fan of baked goods and actually wanna get something out of Lit Hum, this is the class for you. \nWorkload:\ntwo papers each semester, with the option of rewriting one at the end of the semester, study guide questions, one midterm which he makes up,  and the Lit Hum final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 05, 2005",
            "review_content": "\nMassimilla is one of my favorite professors. I admit that if you are philosophically opposed to reading and putting effort into the questions he asks you to write about, you will not like his class. The guy makes you do your work, but he is so knowledgeable in the classics and so clearly loves what he's teaching that the class becomes a pleasure. \nHe gives you insight into each work that you could not have arrived at by yourself and discusses about ten different approaches you can take with it. Also, he really prepared the class for the Lit Hum final. He, in great detail, touched upon all the essay topics that appeared on the test. \nTrue, the class is not without its faults. It could have far more discussion and far less lecture, and the questions he does ask are usually to test if you read the book and not what you think about it. The pace is crazy, which is not really his fault; there's a lot to cover. We're usually half a class behind but he still expects you to stick with the syllabus, which is really annoying when you're already reading the bible and he still expects you to remember every detail of Symposium.\nAll in all though, he's great. (If not for his passion and charisma, than for the fact that he brings organic baked goods to almost every class!) \nWorkload:\na lot of reading, he lets you do three out of the four essay topics he gives, one midterm that's decent if you did all the reading (or at least sparknoted it) and of course the final which was much easier than his midterm\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 10, 2004",
            "review_content": "\nWe weren't exactly sure whether he was a professor, a grad student, or somewhere in between until the TA strike (he's somewhere in between, probably will be an Assistant Professor by the time someone else checks this) and we're not exactly sure what his specialty is and we don't know why he always brings organic cookies and brownies to class and we don't know why he starts enthusiastically yelling about certain passages. \nTo clarify: he's GOOD. And a lot of fun. \nHe's a bit goofy, and his approach to teaching is somewhat scattershot--he can get REALLY out there--but this year was his first so it will probably be tightened up by next year. He's extremely accessible and will talk to you for hours after class, if his schedule permits (at this time, he teaches at other schools in the area). Sometimes you're unsure if he knows what he's talking about (mainly when he starts going on historical tangents) but he usually ends up making a point, and, plus, its always entertaining. \nHe has read the books through and through and will be able to pick up any reference you make in class and let you run with it, but will kindly stop you if you're being a jackass. \nFor some reason, he was much better first semester (although he caught steam again after spring break)...it was unclear because the class was structured in a circle (instead of mini-lecture when we switched for 2nd sem), because the class changed, because he pop-quizzed us on the readings every class 1st semester so we followed the class better, or just because St. Augustine sucks.\nHe's definitely worth it. Both semesters. Don't be worried if he seems weird the first day. Its part of his charm.\nWorkload:\nNot bad, especially  if you do the reading. \n Pulling an flat A is hard. Pulling a B- is even harder. Showing up, following the class, and doing the work should guarantee you at least a B+. You'd be surprised how many people don't do that.\nA series of short papers (detailed below, he'll often order \"NO MORE THAN THREE PAGES\") and a midterm (feels hard but most do well) and final. He's relatively lenient about extensions if you're honest, and will let you retool papers if you feel like you didn't do your best. HIS COMMENTS ARE INCREDIBLE. He spends about an hour on each paper, and picks apart every bit of your prose and argument, and still grades lightly. To second the other reviewers I wish we had drafts in the class.\nhe'll probably change the requirements next year, but...\nFirst semester: a (very easy) 2 page paper on  the Iliad, a 3-5 page paper on the Odyssey, a 3-5 page paper on the rest of the greek stuff, a 3-5 pager on the books of the bible\nSecond semester: two 5-7 page papers, each looking at a specific theme in three books. Not hard, although the topics are a bit overwrought and the papers can be a pain to cobble together. But they're really not that bad (especially compared with the crap other classes get) and the comments are worth it.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 10, 2004",
            "review_content": "\nWe weren't exactly sure whether he was a professor, a grad student, or somewhere in between until the TA strike (he's somewhere in between, probably will be an Assistant Professor by the time someone else checks this) and we're not exactly sure what his specialty is and we don't know why he always brings organic cookies and brownies to class and we don't know why he starts enthusiastically yelling about certain passages. \nTo clarify: he's GOOD. And a lot of fun. \nHe's a bit goofy, and his approach to teaching is somewhat scattershot--he can get REALLY out there--but this year was his first so it will probably be tightened up by next year. He's extremely accessible and will talk to you for hours after class, if his schedule permits (at this time, he teaches at other schools in the area). Sometimes you're unsure if he knows what he's talking about (mainly when he starts going on historical tangents) but he usually ends up making a point, and, plus, its always entertaining. \nHe has read the books through and through and will be able to pick up any reference you make in class and let you run with it, but will kindly stop you if you're being a jackass. \nFor some reason, he was much better first semester (although he caught steam again after spring break)...it was unclear because the class was structured in a circle (instead of mini-lecture when we switched for 2nd sem), because the class changed, because he pop-quizzed us on the readings every class 1st semester so we followed the class better, or just because St. Augustine sucks.\nHe's definitely worth it. Both semesters. Don't be worried if he seems weird the first day. Its part of his charm.\nWorkload:\nNot bad, especially  if you do the reading. \n Pulling an flat A is hard. Pulling a B- is even harder. Showing up, following the class, and doing the work should guarantee you at least a B+. You'd be surprised how many people don't do that.\nA series of short papers (detailed below, he'll often order \"NO MORE THAN THREE PAGES\") and a midterm (feels hard but most do well) and final. He's relatively lenient about extensions if you're honest, and will let you retool papers if you feel like you didn't do your best. HIS COMMENTS ARE INCREDIBLE. He spends about an hour on each paper, and picks apart every bit of your prose and argument, and still grades lightly. To second the other reviewers I wish we had drafts in the class.\nhe'll probably change the requirements next year, but...\nFirst semester: a (very easy) 2 page paper on  the Iliad, a 3-5 page paper on the Odyssey, a 3-5 page paper on the rest of the greek stuff, a 3-5 pager on the books of the bible\nSecond semester: two 5-7 page papers, each looking at a specific theme in three books. Not hard, although the topics are a bit overwrought and the papers can be a pain to cobble together. But they're really not that bad (especially compared with the crap other classes get) and the comments are worth it.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 09, 2002",
            "review_content": "\nTake L and R with this professor. Massimilla is a fair grader and his discussions are truly interesting. I am not one who typically gets excited to go to class or is engaged with class discussion; however, with 'Stemass' I actually thought I was learning something. He is very weird but that only helps his students to think outside the box. He can't zip his pants up and he can't button a shirt but otherwise is a great professor. \nWorkload:\nTwo papers a week. The mid-week paper is 1-2 pages while the weekend assignment is 2-3 pages. Midterm doesn't count and final is take-home.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 29, 2002",
            "review_content": "\nI was dreading taking Logic and Rhetoric, but Massimilla really made it worthwhile. He tried to make class discussion interesting, often by incorporating some really cool outside readings, and he varied class activities so that he didn't simply talk for an hour and fifteen minutes. Even though I consider myself to be a good writer, his comments and the little conferences we had were helpful. The frequent grammar quizzes were annoying though, and, yes, there was a lot of work (but that comes with any L&R;) class.\nWorkload:\n1-2 page papers due every class, in class mid-term, take-home final, grammar readings/quizzes\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 07, 2001",
            "review_content": "\nOkay, so he might be a bit unorganized and be utterly unable to dress himself (my favorite was the XXL green shirt not tucked into XXL black pants), but he was still tons of fun to work with. Don't argue with him too frequently or you will learn to dislike him, because he will occasionally shoot people down...but always with a smile. He is quite hysterical, pointing out the foibles of society. You lucked out if you got this teacher--there are essays to write, but if you hand them in late, it doesn't matter all that much. Notes would come in handy at the end of the year, but most of the material will come in bulky packets. ENJOY!\nWorkload:\nAverage number of papers, frequent at the beginning of the year and slowly winding down. Two conferences (no pain), and grammar quizzes (you definitely should study, but it IS grammar so...) Our midterm was a brief in-class essay, and our final was a short take-home quiz.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 12, 2001",
            "review_content": "\nOk, nobody understands why he can't zip his pants up. He always rushes into class a few minutes to many minutes late, so I suppose he just can't find time to completely hoist his trousers. He also has three very distracting wads of spit perpetually perched at the corners and center of his mouth. As a teacher, however, he is quite capable, and very entertaining; class discussions and activities are almost always thought-provoking, and his occasionally stinging responses to student comments keep the class conscious most of the time. \"Stemass\" is extraordinarily helpful in guiding a student to a comprehensive review of their writing styles, and is quick to offer encouragement in both the many conferences he insists on holding with students, as well as in his paper comments.\nWorkload:\nPapers due generally once a week, with an occasional small assignment in addition. Midterm and final are given, but not heavily weighted. In fact, while grading of papers reflects his opinion of your progress, overall grading seems fairly arbitrary--engage him in a few after-class discussions, and put some effort into your work, and you should be able to pull a good grade.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 11, 2001",
            "review_content": "\nThis man is an absolutely dedicated and sweet teacher who focuses on the logic part of the course just as much as the rhetoric. He arranges frequent meetings with students to review work and chat, invites students to his readings and reads work for outside class. His classes are really interesting and we all still keep in touch with him. He does have a little pants zipping problem though so be prepared to stifle your giggles. Try to get him for this course!\nWorkload:\nReasonable and flexible. He lets you do the writing sample at home and his midterm questions were really pretty fun and interesting. His paper topics are random and actually intriguing. I liked doing the work and he gave good feedback. He was also flexible with deadlines!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 06, 2001",
            "review_content": "\nWell he's most certainly not the worst L&R; teacher you could get. Once you get over his inability to dress himself (count how many times his fly is at least partially open or he shirt is so badly tucked in that his underwear hangs out), occasional unpleasant odor, and comments such as, \"Christianity is the only religion that talks about a messiah\" (my personal fav) you'll be okay. In all honesty he creates an interesting class most days. Passes out lots of good readings and sometimes has thought provoking in class exercises. He tends to try to talk about things he really does not know so much about. If you know anything about his topics you'll likely find errors in his lectures, but he still knows a good deal about a wide range of subjects. My only real academic complaint is that he won't tell you what big things you're doing wrong in your essays, or rather what in your essays is not to his taste, until the class is over and it's too late to fix it. Definitely a mixed bag.\nWorkload:\nTypical.\n"
        }
    ]
}