{
    "prof_info": [
        {
            "prof_name": "Laura Ciolkowski",
            "prof_id": 2347,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "April 21, 2016",
            "review_content": "\nI really liked Professor Ciolkowski—she was so helpful, nice and bubbly, and I loved hearing her thoughts about the texts we read.  A lot of people, for whatever reason, don't love her lectures, but I do.\nThis class is the hardest class I have taken, by far.  The reading for this class is unreasonably heavy—at least 200 pages per week, and you must read closely or else you won't be able to do the weekly writing assignment, which is also super lengthy.  The midterm is fairly hard, but as long as you read the texts carefully and can summarize the arguments, you'll be fine.  Also, the class is a pain because you have to do event reports twice a week.  \nOverall, the workload shouldn't deter you from taking this class, but be prepared for an insane workload, and maybe take one less class that semester (i.e. 4 instead of 5).  I learned so much from this class, and I feel infinitely more informed about women and gender issues, as well as race.  This class really opened my eyes to the issues in the world.\nWorkload:\nExtreme.\n-200 pages of reading per week (maybe more)\n-Write 3 Discussion Questions or 2 Answers (alternate week by week) every week (you do get to skip 2 assignments—one of each)\n-Midterm (6 analyses of readings)\n-Final (6 analyses of readings + an essay)\n-Event Report 2x per semester\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "June 15, 2014",
            "review_content": "\nI think the course was pretty good. This was the first time I ever interacted or even read academic feminist texts. I was familiar with a lot of the ideas presented -- intersectionality (probably the biggest one emphasized) -- but being able to read what the authors said in their own words was refreshing. \nHowever, I'm not sure how to actually *feel* about the course itself. Women's and gender studies is a very broad topic, of course, and there is a lot you can say about it, and I feel that Professor Ciolkowski and Professor Nelson really did try to cover the breadth of what they thought their primary audience would find interesting. I'll get back to this later. \nA lot of the people in the lecture and discussion were very financially well-off white women, also presumably cisgender and heterosexual (though I may totally be wrong). While this isn't necessarily a bad thing, I agree with the May 23 reviewer, that it was rather sad to sit in a room with white women and discuss the issues in Push, a book that deals very intimately with the experiences of a Black woman. \nThough my group seemed to have more diversity, there was *still* whiteness that came through. I remember very clearly hearing a white woman use the term \"colored people\" in the 11th or 12th week -- seriously!? Thankfully someone called her out right away (though that person was not white) but I was very surprised my TA did not pick up on that. \nGetting back to the material -- most of it was related to women and women of color. While that doesn't sound bad for a Women's studies course, I would have appreciated to see discussion on trans or non-binary issues (we read one article and a book chapter that dealt with this in depth, the rest usually did not even mention trans or non-binary) especially considering that this course is \"Intro to Women's and GENDER studies\". \nTo highlight the cis woman centric approach taken, we had a week called \"Women's health\". In no part did it mention trans women and the health issues they face. Instead, it was focused on the fight for abortion or the paternalism women faced while making choices about their own bodies. I repeat --- YES, these are important, but there really is no \"Intro to Gender Studies\" in this course at all. \nIn addition, I'd have liked to see more stuff relating to queer theory. Although I know that this course is not for sexuality/queer studies, the department is now called \"The Institute for Women's, Gender and Sexuality Studies,\" and I think their intro course should reflect that. We had one week (which I thought was absolutely fabulous) dedicated to queer theory, but ideally I'd like to see the course take on more sexuality and gender studies, and less women's studies. \nDon't get me wrong. Women's issues ARE important. But the way this course is set up, we read a ton of stuff about intersectionality/double jeopardy/etc. While this is great, it only created an **illusion** of depth. Thinking back, hardly any of the articles really expanded on another. Instead, they repeated gave the same superficial (I thought) view of what Black/Latina women's issues are. This was especially prominent in the first few weeks, where we would read several articles on the same topic. While I could forgive this if each one took a different approach, or revealed something different, but what we got was a lot of the same material repeated over and over. \nThus, I would propose to the professor that she sacrifice some of this artificial depth for actual breadth. Even if it was just one week talking about trans women/non-binary genders, I'd be delighted. Though really it should be more. Don't get me wrong, there were some fabulous readings (the ones about visual culture, and Discipline and Punish were great) and if you've never encountered any of the topics presented, the syllabus will be elucidating. \nNow, about the professors. Professor Ciolkowski is a nice woman. She is very enthusiastic and this is clear in her lectures. However, like they syllabus, she always tries to cover too much, sacrificing deep analysis for superficial summary and a few nuggets here and there. If she slowed down and tried to cover less -- seriously, the class is the exact same amount of time every time! -- then she'd be a fantastic lecturer. She obviously loves lecturing and always has a smile, but her lectures are just too fast and there is no way we could ask her to slow down, unless we want to miss half the lecture she planned!! \nProfessor Nelson on the other hand, is a great lecturer. Her powerpoints are clear and follow her lecture, and give us a way to take in the information visually. She doesn't speak obscenely fast, and she almost always finishes the material planned. Her voice doesn't come across as enthusiastic, and (from what I gathered from her section and lecture) she is often out or not lecturing, but she is a fabulous lecturer when she DOES lecture. I also appreciated that she would often deliver the lectures about Black women's issues. \nMy TA, Mina Khanlazardeh, was so sweet. She is a very easy grader but facilitates discussion very well. She often picks an issue she likes (though I think in the future she'll base her discussion choices off of the response analysis) and usually tries to not dominate the conversation. However, there are the times where she does. I remember she spent half of discussion reading something about Foucault and his discourses. But, aside from a few duds, I often looked forward to her discussion leading. She's obviously a very smart woman and it was pleasure to learn from her. She also has a lot of book recommendations, so try to write them down (if you can!). \nAll in all, this course was pretty good. Would I take it again? Maybe. Depends on the syllabus. However, I would really recommend you re-consider taking this if you want an easy A, or even if you've read a decent amount of academic feminist texts. That being said, if you're interested in reading these feminist texts and interacting with them, the course isn't bad. Just be aware there are a lot of them. \nWorkload:\nA lot of reading (at least 100 pages per week). Often we were assigned multiple chapters from print books, and in one case, an entire book. I usually got to most of it, but since a LOT of the reading repeats, you can usually get away with reading the shorter works. My advice -- if you skip a reading, pay close attention to when it's discussed in lecture. The key ideas will usually come out. \n10% is attendance, class participation and attendance in campus events. You write a 1-page event report. \n15% is 5 response analysis. These are 2-page reports where you critically analyze two texts together. These were really vague, but I think the TA's have a lot of discretion too. Ask your TA what they're looking for, or take a chance if you think your TA is nice enough. \n20% is a midterm. Passage ID/Analysis of 6 of 8 passages. Took place one third in (6th week, I think). \n25% is a 'media file'. Involved collecting three different sources to analyze critically (note, they have to be from different mediums, so you can't analyze three TV shows or whatever). You turn in annotations for two of them (basically notes on what you want to write about) and then a 5 page essay about 10 days later. \n30% is the final exam. Similar to the midterm, it was Passage ID/Analysis of 6 of 8 passages. There was also a short essay where you have to analyze two images from visual media. You got a handwritten cheat sheet. \n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "May 23, 2014",
            "review_content": "\nI'm a bit conflicted on how to review this course. On the one hand, this class more or less accomplished what its title suggests in introducing students to the major concepts and ideas within women's and gender studies. However, it all felt a bit shallow and artificial. \nWe were forcefed buzzwords but never really dissected what they meant, and told half a billion times that intersectionality is the most important thing to ever happen to us but spent too little time thinking about why most of the people in our lecture hall were white, financially-privileged cisgender women (while I'm channelling my frustration, there was also very little talk of trans issues... in a gender studies class? what?). \nReadings were certainly informative, but they felt a bit long and excessive for an introductory level class. Further, it felt a bit like all the things I've been reading on social media (twitter and tumblr in particular) related to feminism were put in an academic package via 100 page articles and lectures. We sped through the material and just didn't really dig that deep into things I've learned from snippets I've read on the internet. \nThe focus on intersectionality felt a little forced, ingenuine, and defensive. By this I mean that it seemed like this emphasis was more out of a fear of being branded as racist than a legitimate, honest care for antiracist politics. It was extremely ironic and tragic, I thought, to be sitting in a room filled entirely with white women on Columbia's campus discussing the major issues in Sapphire's PUSH. \nThe course is certainly shortsighted in many ways which I'm certain are unpacked in higher-level WGS courses, but the majority of students who take this class won't go on to those classes so I am left disappointed and frustrated.\nOverall, I don't think I'd recommend this course unless you have to take it for the major or really just have not had any exposure whatsoever to feminism from your friends, which is certainly possible. Alternatively, I'd recommend spending time on tumblr and twitter to learn the basics of feminism and then taking Critical Approaches with Professor Tadiar.\nWorkload:\nExcessive. 10% attendance, class participation, and attendance of two WGS-related events and 1-page event reports. 15% on 5 \"response-analysis\" papers (2 pages) done whenever you want throughout the semester on the readings from that week. Instructions for this were frustratingly ambiguous. 20% midterm early in the semester. 8 passages from readings in the semester - pick 6, identify which reading the passage is from and then write a short paragraph about it. 25% media file essay: pick three pieces of media (visual, audio...), do annotations for two of them, then write a 5-ish page critical essay about it with a thesis. 30% final exam which is basically a combination of the midterm and the media file (6 passage IDs in the same style, then write a short essay analyzing two images). Cheat sheet allowed for the final. Tons of reading every week - I seldom got to all of it. Estimated at least 100 pages per week probably.\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "May 01, 2014",
            "review_content": "\ntake this class, it'll make you a much better critical thinker and make you see the world in a really different way. the readings are all interesting and rewarding, i felt like i was learning things that were important to life in this class. one day a week it's lecture (in which no one really pays attention, to be honest...) and the other day is discussion section, which is really fascinating. we had a lot of really great (sometimes tense) discussions in my section.\nWorkload:\nabout 100 pages of (interesting!) reading a week, 6 2-page papers, one bigger project on the subject of your choice, midterm, final\n"
        },
        {
            "course_name": "Intro to Women and Gender Studies",
            "review_date": "January 30, 2014",
            "review_content": "\nI personally didn't like Professor Ciolkowski at all when I had her for Introduction to Women and Gender Studies. Professor Ciolkowski spends very little time addressing student questions in lecture and disregards students when they question her logic. Keep in mind that I'm a WGSS major, so I typically enjoy discussion and the subject matter of WGSS courses. She has a very erratic teaching style as well. Instead of taking the intro class I highly recommend taking Sociology of Gender. \nWorkload:\nThe readings are good, but you have to write these 5th grade book report-like responses each week. About two 5-6 page papers I believe \n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "December 22, 2011",
            "review_content": "\nProfessor Ciolkowski is fantastic!!! She has so much energy and passion for teaching, and she really cares about her students. I really liked the way she lectured. While she could have just summarized the readings for us, she instead added a level of depth to the readings by giving the class the context of each piece and then asking thought-provoking questions about the text and what sorts of structures of inequality it raises. I appreciated how much time, thought, and research she put into her lectures. \nI would highly recommend attending her office hours too. Professor Ciolkowski is very personable, and she loves getting to know her students. If you are struggling with writing a paper, she will take the time to help you sort out and clarify your ideas. \nAs for Intro to Women's and Gender Studies, this was a great course. I definitely find myself thinking about gender, race, class, etc. in a different way then I did before. This is not simply a class about gender; Professors Ciolkowski and Jordan-Young make it very clear in the first lecture that the course is about intersectionality, or the merging of gender, racial, religious, socio-economic, etc. identities. This makes for a much more interesting course than a course that gives the general overview of famous feminist works and whatnot.  \nWorkload:\nWeekly readings and scholarly notes (depending on how much reading you have, this can be a lot of work or not much at all. The scholarly notes usually take about an hour or two to complete), two media file essays (7-8 pages each), a final exam that is open note. Do the readings, because if you wait until the last minute, you will be cramming for the final. \n"
        },
        {
            "course_name": "First-Year Seminar",
            "review_date": "October 06, 2010",
            "review_content": "\nI had Professor Ciolkowski for both Intro to Women and Gender Studies (Fall 2009) and for Women and Culture II FYS (Spring 2010). \nIn the lecture format for the intro course, she taught with Professor Valenze as well. I'm not a bra-burning feminist in any sense of the word, but that's not what this class was about. It was a great intro course that covered not only women's rights, but also other ethnic, social, and cultural norms that are extremely problematic. Professor Ciolkowski is very intelligent and her train of thought is sometimes difficult to follow, but if you can extrapolate her main point you'll learn to really enjoy her lectures. I definitely learned a lot, and I learned to question everything around me. The class is extremely informative to say the least, and Professor Ciolkowski is very kind and understanding to her students, always willing to coordinate your schedule with hers if her office hours do not coincide with your availability. \nFor FYS, it was obviously a smaller format, and the discussion was to be mainly held by the students. However, Professor Ciolkowski definitely had an idea of where she wanted the class to go with our discussion and tried to keep us on track. She does tend to talk a lot, but that's because she's obviously very passionate about the subject matter. Needless to say, I would recommend her to anyone!\nWorkload:\nFor FYS, it was a couple of papers with a few drafts, and a final creative project. For Intro to Women and Gender Studies, it was a paper, a midterm, and a take home final with a creative project/paper. Not bad, actually really enjoyed the readings that I had time to read. \n"
        },
        {
            "course_name": "Fem Texts I",
            "review_date": "January 22, 2009",
            "review_content": "\nProf. Ciolkowski is perhaps the best professor I ve had at Columbia Barnard thus far. She s energetic intelligent fair and supportive of all students. She makes the material interesting and her enthusiasm engages the entire class. Her ability to relate modern experiences to the material encourages students to arrive prepared and ready to participate. \n"
        },
        {
            "course_name": "Fem Texts I",
            "review_date": "January 18, 2009",
            "review_content": "\nMany discussion classes descend into either chaos or rote repetition this one in contrast always felt like an intensely interesting conversation among friends. Prof. Ciolkowski encouraged everyone--especially devil s advocates--to speak but did a good job of keeping us on track and intellectually rigorous. She was responsive to our questions graded papers carefully and helped foster a sense of camaraderie among those enrolled. Easily my favorite class this semester. \n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture II",
            "review_date": "May 27, 2007",
            "review_content": "\nThe readings were much more than I had anticipated because I had taken W&C;:I and thought it was going to be like that..not exactly. now, my review of prof. c. may be biased because she reminds me of a teacher from h.s. who is like her doppleganger, but bipolar. while prof. c. is on the manic/happy side, the other teacher swung from manic to depression within a matter of minutes. so i am going to cut prof. c. a lot of slack. she does try very hard to bring the material to life (which is difficult considering the material). she has enthusiasm for material that i honestly dont know how anyone could. a very loud enthusiasm. she will force a discussion, she will not pick on the person who always raises her hand. she will force you to do a presentation on a book (with a partner), save yourself and pick a book you have already read. she is approachable (she really wants you to speak with her), and she will grade down on your revisions if you only do what she tells you to do. work hard, and then some. read the texts, learn to speak up if you aren't the type to speak up, and go to her for help on essays.\nWorkload:\n2 essays with a revision each (which she counts more, and harder), one big research essay (which could have a creative part to it) in the end, one presentation with a partner (basically, you act like the professor of the class for the class time).\n"
        },
        {
            "course_name": "Fem Texts I",
            "review_date": "April 06, 2007",
            "review_content": "\nLaura wants to be liked (she even baked us brownies), but she was certainly not my favorite professor at Columbia. \nHonestly, her class has turned me off taking any more Women's Studies classes. In a mad dash to finish getting through too much material she often ran overtime and she basically wanted students to agree with her in class discussion. I don't want to be too harsh because she does make an effort but, apart from a few historically interesting (albeit heavy heavy!) readings, her class did not make me feel changed me for the better.\nWorkload:\n2 papers (5-7 pages each), a final project, an oral presentation, A LOT of reading.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "November 08, 2006",
            "review_content": "\nLaura was one of the worst professors I have had at Barnard.  She constantly forced discussion into women and gender even though that was not the class we were taking.  She seemed nice at first, but by the end of the semester, I had grown to hate her.  Writing papers for her class was extremely difficult.  Her suggestions for papers were always vague, and when I fixed the things she had told me were wrong with my paper, she gave me a lower grade.  I found this class extremely frustrating; it made me want to be a science major.\nWorkload:\n2 papers and a research project and paper rewrites\n"
        },
        {
            "course_name": "Fem Texts I",
            "review_date": "November 03, 2006",
            "review_content": "\nI love prof. Ciolkowski.  She's truly one of the best professors I've had at Columbia and I don't know why she sometimes gets a bad rap.  She makes class discussions really interesting and she's not intimidating at all (esp. for people who are shy about talking in class -- she makes everyone want to contribute to class discussion!) In terms of paper writing, she's a strict grader but will give you an opportunity to revise your paper for a better grade.  She encourages students to go to her office hours and if you bring your paper, she will tell you exactly what needs fixing.  She's also a very nice person.  I can't say enough good things about her.\nWorkload:\n2 papers (5-7 pages each), a final project, an oral presentation, lots of reading (but its really interesting).  Not too bad for a 4 credit course.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "December 29, 2004",
            "review_content": "\nThis class made me want to kill myself.  I don't know who designed the syllabus for First Year English, but it's awful.  They ask you to read a million things, and you barely get to discuss them before you have to move onto the next.  I barely read most of the books, except for the things I had to write papers on.  At first, Professor Ciolkowski seemed like a nice person, but then she kind of wasn't.  When meeting with her about papers, most of her suggestions were very vague, and it was like pulling teeth to get something further out of her.  The paper writing was hell.  Sometimes I found her condescending too.\nWorkload:\nWaaaaaaaaay too much reading, and you can totally get by without reading most of it, unless you're writing a paper on it.  There are always choices for the papers, so that's nice.  A whole lot of little assignments, 2 papers, and the big research paper.  Each paper has a rough draft and a final draft.  \n"
        }
    ]
}