{
    "prof_info": [
        {
            "prof_name": "Jacob Alexander",
            "prof_id": 4153,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Lab Recitation for General Chemistry",
            "review_date": "December 08, 2016",
            "review_content": "\nDr. J, as he prefers you call him, is a bit of an enigma in the Barnard chemistry department. While a lot of people have a strong aversion to him, I have grown to be \"okay\" with him. \nHe is the director of the BC2001 gen chem lab, meaning he teaches pre-lab (recitation) and some of the actual lab classes (I had him as one of my instructors). I really appreciated his concision and knowledgeability in pre-lab lectures. He knows what he is trying to say, he says it very well, and he answers questions, albeit in a smart ass way, vey well. He isn't a lovely dovey guy in lab and won't tell you exactly what to do or answer any basic questions that you should already know before entering lab, but he will help you if something goes completely wrong in your experiment and he will answer small questions here and there. His demonstrations of the lab are very concise and make perfect sense, which I couldn't say for the other lab instructor in my class.\nMost people dislike the guy because of the grading though (he doesn't directly grade your lab reports, but he is in charge of the rubrics the reports are graded off of). I found that the quality of your actual lab report (you record data in your lab and then write the report at home and the report is due at the beginning of recitation the next week) doesn't matter much; the grading is mainly focused on the quality of your data. It can really suck if you aren't good at procedure, but if you try your best it will mostly all even out. There are lab office hours every day which are extremely helpful and I am surprised more people don't attend. \nThis class is hard as hell in some aspects, but it really won't be the worst experience of you college career. I would recommend taking this course over Columbia chem just because of all the resources available to you in the Barnard chem department and the better quality of teaching (they will really help you understand the material if you put in the work to do so, even if you are not a super chem student ((like me)) ). \nWorkload:\nOne lab report is due each week on the day of your lab. It can take anywhere from 2-6 hours to write the reports (at least for me) so it is moderate amount of work, but not too bad. \n"
        },
        {
            "course_name": "BC1601-BC1602 General Chemistry",
            "review_date": "December 08, 2016",
            "review_content": "\nI had Prof. Alexander for Gen Chem lab, and he is wonderful!  He is passionate and funny and eager to answer any questions his students may have.  He is knowledgable and kind.  He is a very tough grader, but anyone in this course will learn a lot!\n\nWorkload:\nWeekly lab report\n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "June 18, 2014",
            "review_content": "\nI've had Dr. J for 3 different classes over the course of three years. He is quite literally perhaps the least efficient professor I've ever met. His lectures are boring and unclear and he has a tendency to ramble because he is obsessed with the sound of his own voice. When comparing him to the rest of the chemistry department at Barnard, it makes no sense why he ends up teaching perhaps one of the most important chemistry classes in the pre-med health track when he is so utterly incompetent. \nNow if Dr. J was just a poor lecturer or boring or ineffective at communicating class material, that would be one thing. But this man should literally not be allowed to be a professor at such a prestigious competitive school, and in one of the most difficult and competitive departments, when he absolutely biased. Dr. J will give grades to certain students based on his opinion of them, a fact that has been confirmed by MULTIPLE students who have served as his teaching assistants over the years. He is also completely inconsistent with his grading standards, and will adjust them depending on how easy a test was. It seriously felt like he was just withholding good grades, regardless of how well a student performed on an exam. Unless, of course, they were one of the chosen ones. This is absolutely unacceptable, and I, undoubtedly among many others, demand that Barnard reconsider their choice to place such an important thing as a student's future in the hands of this man. \nIf anyone has ever been in his class when he has thrown an actual tantrum - yes, a TANTRUM - when someone's phone goes off, or when he has answered a question in the absolute LEAST helpful way possible, or when he has reprimanded an entire class full of 50 smart, beautiful, bold pre-med women for not doing well on HIS impossible and unfair exam, they will be able to attest to the fact that Dr. J should honestly not be a teacher here any longer. His presence in the chemistry department and at Barnard in general lowers the standard that we, as students, were promised when we chose to attend this school. Frankly, it's insulting that Barnard thinks we deserve to tolerate such a horrible and repulsive little man as our professor. \nBTW, he is LYING when he says you can only take intermediate gen chem to complete your pre-med requirements. HE'S A LIAR. ASK DEAN STARKS. \nSTEER CLEAR AT ALL COSTS. \nWorkload:\n4 midterm exams (all with completely varied levels of difficulty), one online problem set a week, and a final that can be worth to up to 50% of your grade if you do better on that then on one of the 4 midterm examinations. IS THIS NOT COMPLETELY RIDICULOUS?\n"
        },
        {
            "course_name": "Intermediate General Chemistry BC3232",
            "review_date": "May 17, 2014",
            "review_content": "\nIn no way am I good at chem. I'd gotten grades in the B-range all through Gen Chem I and Orgo I and II, so I went into this class thinking I'd be lucky to get a B/ or B+.\nIntermediate Gen Chem is a small class (around 50 students?) in comparison to the previous 3 chem courses in the chem pre-med sequence at Barnard, and apparently a lot of people dropped this course and elected to take gen chem II at Columbia because they didn't want to deal with Dr. J. Then again, most of them were probably the grade-grubbing types who didn't want to swallow a possible B... BUT if you're not one of those people and you're not completely hopeless, you should be fine.\nI can understand why many people would want to avoid Dr. J. His lectures can be a bit difficult to follow (he tends to use \"this\" or \"that\" very liberally, without referring to a specific thing and he whizzes through the material at times), his office hours are not very personal AT ALL (imagine 15 very eager pre-meds trying to cram into his tiny office), and he can be condescending. He sent out an e-mail out to the class after a dismal first exam, expressing his disappointment, but it discouraged a lot of us and made us feel terrible. The Sapling problems are also very useless, and are a waste of time. \nThat being said, his exams are very straightforward and that's what I appreciated the most. While you are expected to think up of unique mechanisms on the spot for questions on orgo exams, Dr. J doesn't throw very many curveballs. There are many people who may not finish the 50-minute exams on time (myself included), so make note of things he says can be solved using \"shortcuts\" he mentions in class.\nI came into this class expecting no higher than a B, a B+ if I was lucky. I was taking 18 credits and was generally unmotivated for everything, so it's not like I was even putting in much time into this class. Surprisingly, I learned a decent amount (enough to pull myself through MCATS) and got a grade a bit higher than expected. \nAll in all, not as terrible a class as others have made it out to be.\nWorkload:\n4 in-class exams (50%), final (40%), and weekly problem sets due every Monday (10%). No problem set on weeks of exams.\nExam 1 - Thermodynamics, calorimetry \nExam 2 - Electrochemistry, kinetics, colligative properties\nExam 3 - Ionic equilibria, acid/base chemistry \nExam 4 - Nuclear chemistry, inorganic chemistry\nFinal - Cumulative (covers material from exams 1 - 4, +MO theory)\nSapling problem sets took anywhere between 1 and 4 hours in one sitting. They were pretty useless - the \"extra\" problem sets he posts on courseworks are a much better representation of exam material.\n"
        },
        {
            "course_name": "BC1601 General Chemistry I",
            "review_date": "April 09, 2014",
            "review_content": "\nIf I could say one thing I regret about my time at Barnard I would say that I sincerely regret taking Gen Chem I and II at Barnard. Dr J is one of the worst professors I have ever had. Although he probably isn't, the way he acts towards his students and the grades he gives seems to suggest that he does not care about his students at all. Gen chem Lab was one of the worst experiences I have had in college and I came out of that lab crying at least once. Grading on these labs is completely unfair. If you measure .004 g more of a compound than you are supposed to, and your accuracy and precision are off, you are severely penalized. It makes no sense. A lab is supposed to be a time where you learn the background and the concept behind the experiment, not how well you know how to weight sodium chloride on a scale. Grades as low as an F were given out to students and unless you are the very top of the class in the lab it really brings down your confidence as a student. Gen Chem lab severely lowered my overall Gen Chem grade. It was really disappointing and I know that had I taken it at columbia I would have done much better. \nI could say the exact same for Gen Chem II (intermediate chem) with Dr. J. He would wiz through material, assuming we knew it all and did not explain anything clearly. His jokes do not make up for the fact that he does not know how to teach. He would give us problem sets that were literally impossible to figure out sometimes unless you hired a tutor that happened to be a grader for the problem sets. Otherwise you are screwed. His tests (especially his first test) did not reflect the problem sets or the lecture material. It was just a terrible experience studying for those tests and taking them because the amount of time and effort you put in to studying for these tests did not at all reflect the grade you would get. \nDr J has a rule that if you do better on the final than you did on your lowest midterm grade, he would drop that midterm and replace it with the final score. For the final, I studied his notes, and focused on his problem sets and past exams (as most people do while studying for a final). However, his final exam did not reflect his problem sets or his exams at all, rather he focused on the subtle things he had never tested us on before. This basically prevented anyone from actually boosting their grade with the final. The final exam definitely lowered my grade.\nIf you havent taken chem already and need it for some sort of requirement, TAKE IT AT COLUMBIA. \nWorkload:\n3 midterms, weekly problem sets (sometimes could take up to 4 days to complete because they were impossible) and a terribly harsh final exam. \n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "April 11, 2012",
            "review_content": "\nDr. J is a great professor for chemistry labs. While at first you might find it frustrating that he does not give you the direct answer when you ask, especially with regard to lab reports, you will learn to interpret what he does tell you as somewhat helpful. However, the reason he does this because he wants to show you that you do have the tools to know the answer yourself. \nDr. J wants students to gain confidence in their own ability throughout the course and does not want them to use instructors as a crutch. While they are more than happy to help you, they choose to treat you as more of a mature student rather than always giving you the answer.\nBe prepared for lab. It will make things run much more smoothly and since a large portion of your grade comes from your actual ability to perform an experiment precisely and accurately, be prepared to do that. Also, do not entertain Dr. J with quesitons of grades on reports. He is not interested in hearing you complain about their very tough grading system. I think this is often because students complain because they feel their grade is arbitary but Dr. J and the other instructors feel they try very hard to make sure this is not the case.\nOverall, he is a very knowlegable and kind professor who cares a lot about the students (he will know your name after week one). \nWorkload:\n1 lab report a week due a few days after performing the lab. The labs are fairly extensive at first but you get the hang of it after awhile, but be prepared for it to take a large portion of time\n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "January 31, 2012",
            "review_content": "\nI'm writing this in response to the review before mine... Which I completely disagree with. I absolutely loved GenChem lab. It was my favorite class this past semester and coming from a high school that did not take science labs very seriously, my confidence and abilities in lab drastically increased.  Yes, the labs take a pretty long time and yes there's math involved but they're far from impossible.  Office hours are very helpful and the lab manual gives excellent instructions.\nOn to Dr. J. Sure, the man might have a bit of a superiority complex but there's a reason for it. He's brilliant. If you ask him a question in lab, he won't just give you the answer - he makes you think about the chemistry that is happening in front of you and gives you enough information to really figure it out yourself.  Basically, if you want someone to coddle you and feed you answers then this isn't for you. However, if you actually care about learning the subject and approach lab optimistically and well prepared it's so so incredibly rewarding.  \nOverall, I thoroughly enjoyed my lab experience.  I think Dr. J is hilarious, intelligent, and awesome and really wonderfully guides you through some difficult experiments.\nWorkload:\nDepending on the day of the week, you get several days to work on the lab report - people who have lab the last days of the week get the benefit of also having the weekend to do them. However, the labs are NOT something you can do at the last minute.  The manual gives very detailed and helpful instructions and if those aren't enough office hours are great and I highly recommend going to them! You should know the procedure of the lab before you in on your day, but the lab instructors always do a demonstration before letting students work, so if there's a step you're confused about, it'll be explained there.\n"
        },
        {
            "course_name": "General Chemistry Lab",
            "review_date": "December 22, 2011",
            "review_content": "\nI took my Gen Chem final this morning. I don't know how I fared, but personally, I think it was better for me than the midterms. That being said, let me outline the relationship between Gen Chem and Gen Chem Lab: there is none. Or if there is, it is something along the lines of post-violent divorce or something of the sort.\nDr. J (as he prefers to be called) - he is quite possibly the worst person I've met in my life. Now, in reading reviews for future chem labs at Barnard, I realize that some of the things he does are reflected in the entire department, but that doesn't make him any more likeable. He usually does the pre-lab lectures, which are rather wonderfully useless. They waste an hour of your time and you get nothing out of them - but sadly, you have to go. He is also who all the other lab people send you to if you ever have a question about a lab writeup you got back, regardless of who they are.\nThe write-ups are hard. There's a ton of math involved and a lot of it is quite confusing. Effort doesn't parallel your grade - in fact, the lab write-ups I spent the longest on (upwards of SIX HOURS) were the ones on which I received the worst grades. Your first write-up will come back with friendly comments and no grade. DON'T BE MISTAKEN. If that lab were actually graded, you're looking at a C. You could do 99% of everything perfectly and still only get a B. The grades are very, very arbitrary and the sole intent of the mysterious graders (you never find out who graded your lab report that week) is to give you misery. You are graded on \"accuracy\" and \"precision\" as well as useless other things like on which side of the page's margin you wrote the date (no joke, got a B for that once). On one particularly lovely lab report, I finally managed to get the titrations to the half drop, and the lab instructors were impressed, since everyone else was having huge problems (this was a fluke...) The comments on the precision page read \"very good precision\" over each of the three sections and \"excellent precision\" on the third. On the last page of the lab, there was one single comment\" Problems with precision. B.\nNaturally, I asked Dr. J about this, and was told with a satisfied smile, \"Well, \"very good\" is a few steps down from perfect, isn't it?\"\nThere were actually two other occasions of this - a C- \"you could have gotten anywhere from a D+ to a B+ for these problems, actually\" and no grade change, and a B- \"I'm not entirely sure what the grader meant with this comment, it's quite cryptic\" and no grade change.\nI'll rest my case there. Just don't bother. You won't enjoy this class, but if you're a pre-med and have to take it, just be ready.\nThe lecture instructor doesn't like the lab people and the lab people (Dr J) doesn't like the lecture instructor (Bruce Bursten for this semester) and each try to one-up each other with harder questions.\nBursten is nice and you cannot bring yourself to dislike him, but his tests are horrific. The single lab question on each is written by Dr J - on the final it was something that we looked up when we did it in lab, rather than learn it. But we had to magically remember it for the final. WHOO.\nWorkload:\nOne lab write-up a week. Just a warning, DO NOT SIGN UP FOR MONDAY LAB. Each day of the week gets a different amount of time to hand it in. Friday got five days, Monday got two. They take about 3 hours each on a good day, 6-8 hours for the harder ones.\nOne question at least on each of three midterms on a final. It will be a surprise and you can't study for it. It will also be difficult.\n"
        }
    ]
}