{
    "prof_info": [
        {
            "prof_name": "Carol Lin",
            "prof_id": 957,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Drugs and Disease",
            "review_date": "May 08, 2014",
            "review_content": "\nDr. Lin is a good professor who cares about her students. Sometimes her expectations are not fully clear and it can feel as though she is grading you subjectively, but if you simply follow all of her instructions and do everything she asks of you she will give you an A. In both of her classes she hands out a comprehensive syllabus outlining her expectations of you for the course and the assignments you are to do. She expects that you read the syllabus and come to her with any questions. SHE WILL NEVER TELL YOU WHEN ASSIGNMENTS ARE COMING UP OR REMIND YOU TO SUBMIT YOUR WORK! If you forget do so something or don't keep up with the syllabus that is your fault. This is the only reason you will get a bad grade in either of her courses. Sometimes it can be difficult to keep track of all the small things she wants you to do each week, but all I have to say about that is you are an adult who can presumably read and write so be responsible and write it in your planner. \nPeople seem to have mixed feelings about her, but I don't think liking her as a person is required to get an A in the course. I happen to find her likeable and endearing but some people I know disliked her. In either case I do not know anyone who did not get an A if they did all of the assignments exactly how she asked them to be done. \nAs a program director I think she is really good. She is extremely easy to get a hold of and is happy to meet with students whenever they want. Yes her instructions for things are crazy long and hard to remember or follow sometimes but then just go to her office she is happy to meet and speak with you to clarify and questions or concerns. \nI think these reviews give her a bad wrap but I have only good things to say about her. \nWorkload:\nAverage. Various small assignments each week and some large assignment or paper due at the end of the semester. Hand in all your assignments on time, do not plagiarize, write simply and clearly and you will get an A. \n"
        },
        {
            "course_name": "D&D;",
            "review_date": "February 01, 2014",
            "review_content": "\nShe is an absolute BITHC!!.....\nshe teaches the most useless courses and as is the worst program director in university history\nsomehow she gives students final grades without grading and putting up individual assignments....\nand mind you these assignments take up 5 to 10  hours to do.......written assginments....according to me shes doesnt even freaking read it....\nand i swear that just skimming the surface....she screwed me for my phd applications too. she appeared to have no motive...i would say shes did it so she can sleep happy whore!!\nWorkload:\nSTUPID!\n"
        },
        {
            "course_name": "Stem Cells: Biology, Ethics, and Applications",
            "review_date": "May 17, 2011",
            "review_content": "\nThis is a paper-based biology class.  This was the first year, so everything was a bit chaotic.  We never really knew what we should be reading, skimming, or just noting.  Class was a frustrating mix between a lecture and a seminar, and 4 professors and 4 TAs in a class with 16 people can be a bit much.  All of that said, I'd still recommend this class to students interested in stem cells and the ethics of science and medicine.  It's one of the few science classes that is more than academic bulimia.  Way less knowing facts and way more emphasis on reading papers and trying to answer more complicated questions about how stem cells work. \nWorkload:\nA rather large problem set every 2 weeks, in class midterm, take home final.  There's also a weekly recitation.\n"
        },
        {
            "course_name": "Drugs and Disease",
            "review_date": "April 21, 2009",
            "review_content": "\nI'm going to review this prof as not just a teacher but as the coordinator of the biotechnology masters program at Columbia University. \nSHE IS THE MOST HORRIBLE PROGRAM COORDINATOR IN THE WORLD and THE MOST INEFFICIENT TEACHER. She doesn't tell you the standards of the your thesis until it's almost the end of the second semester. She has no standards for grading and teaching. She grades on her own subjective opinion and scale that she keeps in secret. She spends more time fixing up the biotech website than preparing speakers for the seminar course (this part I'll say im exaggerating since it's difficult to find speakers in general). For the fist five seminars she presented on her own material that had no core topic and sometimes made no connection to biotech. \nUnless you're in the biotech MA program don't EVER take drugs and disease. It's a freakin waste of your tuition. \n"
        },
        {
            "course_name": "Seminar in Biotechnology",
            "review_date": "January 13, 2005",
            "review_content": "\nI have overall enjoyed this class because it allowed me to hear from people in different fields connected to Biotechnology. Some lectures were really interesting and some just OK. \nProfessor Lin's involvement in this class was minimal. She didn't even provide feedback on student's paperwork. She generally struck me as a very bitter woman that tries to overcompensate for her insecurity and incompetency by being arrogant, condescending and attempting to put students down. \nWorkload:\nNeed to write a short essay every week about visiting speaker's talk. \nThere is a final paper on Biotechnology.\n"
        },
        {
            "course_name": "Molecular Biology",
            "review_date": "February 27, 2004",
            "review_content": "\nPretty much anyone can teach a molecular biology class.  Just look at the textbook, make some PPslides, and regurgitate.  But to be a good MB professor takes something extra - a unique insight into the field, an ability to introduce details as part of broader concepts, or maybe just enthusiasm.   One thing is for sure, Mrs. Lin does not have that \"something extra.\"  She has managed to turn lecture into nothing more than a pointless formality.   I have yet to learn one thing, to be given one insight, that I could not have read directly out of a textbook.  Beyond this, she is just ANNOYING.  She's smug, she has no sense of humor, and she tries to show that she has some kind of expertise by making horrendously banal comments about biology and the nature of research.  If you have any sort of intellectual interest in molecular biology, this is not the teacher for you.  \nWorkload:\nPoorly worded problem sets every week, midterm and final.  \n"
        },
        {
            "course_name": "Drugs and Disease",
            "review_date": "February 26, 2003",
            "review_content": "\nDr. Lin is a very nice woman however\nI feel like the class was a waste of time. Anyone can pick up a bunch of scientific papers and read it on their own. I cannot believe i actually paid for a class that reads scientific papers that one can probably get off the internet. I learned more from the presentations that actually reading a variety of papers that briefly pick up topics from all aspects of biology and give you a general overview that does not really help one tryin to specialize in a particular area.\n\nWorkload:\nMidterm and FinalClass participation which i think was unfair\n"
        },
        {
            "course_name": "Drugs and Disease",
            "review_date": "February 26, 2003",
            "review_content": "\nDr. Lin is a sweet woman who does not quite seem to understand the inherent problems with making 20% of your grade participation.  She knows enough about each subject to get by in her short lectures of the class, however, there often were instances where one of the students (mainly grad/ bio-tech students) who were more knowledgable about the topic at hand than she was.  On the whole, I feel that I know somewhat more about critiqueing papers and the issues with trying to cure certain diseases.  However, if you think that this class will give you an overview or an in depth view of the major diseases and the pathways that drugs are used to combat them, forget this class.  Go to the medical school.  That being said, you can't say that I am bitter about this because I didn't do well.  I did, I got an \"A.\"\nWorkload:\nvery doable.  You have to read 2-3 scientific papers for each class, and this took me about an hour and a half and I'm a slow reader.  Midterm, half-a-class-long presntation on a drug of your choosing with a group of four of your choosing and a final.  The midterm and final were almost entirely made up of subjective questions that required little prior knowledge especially because it was open notes/papers(tehre was no text book).\n"
        },
        {
            "course_name": "Biotechnology Seminar",
            "review_date": "May 07, 2002",
            "review_content": "\nThe most pointless class I've ever paid for. The seminar was open to the public. I paid along with a number of other suckers and the class was an extraordinary disappointment. Carol Lin never lectured or taught a thing to the students. In addition, the coursework was structured to satisfy the professor, with zero feedback, and no attempt was made to foster learning or enjoyment. Worst class I have ever taken.\nWorkload:\nWeekly paper about anything. Term paper about anything. Plus two extra papers about anything.\n"
        },
        {
            "course_name": "Drugs and Disease",
            "review_date": "April 04, 2002",
            "review_content": "\nI took this class as an undergrad in the School of General Studies, but with a bachelor's in Biology from UC Berkeley. I was astonished at the poor quality of education offered by this course and professor. Carol Lin had no regard for student concerns, giving virtually no feedback after papers or the midterm. I had to solicit a response for three papers that I wrote, and even then she was curt and unhelpful in her reply. The format of the class consisted of reading journal articles and student presentations based on those readings. Lin did not lecture, nor did she help out students who were having difficulty presenting the material. It is one thing for professors to encourage interactive learning, but another to slack off and not invest in the students. Lin has no respect for her students or for the amount of time and money students spend on their education. She does not understand the concept of teaching. I am appauled that a university such as Columbia (though the graduate program for bio is not the university's forte) allows this course to remain in the course catalogue. It is a disgrace to the reputation of the school. I basically wasted $2500 for a reading list that I could have gotten online and for hours of painful presentations by nervous peers.\nWorkload:\nThe workload is what you make it out to be. Since Carol Lin does not give you structure in the course, you can learn as much or as little as you want. Just be warned that you will be teaching yourself.\n"
        },
        {
            "course_name": "Drugs and Disease",
            "review_date": "January 29, 2002",
            "review_content": "\nThis class consists of reading 40 - (10 pages average) papers on different drugs and diseases. The papers are usually from nature and science magazine, and are pretty intense in difficulty. Classes are all student presentations which are good to give you the gist of the paper. You think you can skip class and read the papers on your own, but this can be hard.\nWorkload:\nThe average is a B or B+ but don't let that fool you because most of the class are masters students who work hard and read the papers, unlike lazy undergrads. There is a closed book midterm essay style. There is an open book final There are 4 section evalutions that consist of a mix of either 4 class presentations or 4 one page papers. There is an open book final in class but it isn't that easy.\n"
        }
    ]
}