{
    "prof_info": [
        {
            "prof_name": "Mary Cochran",
            "prof_id": 1838,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Improv Dance",
            "review_date": "April 23, 2006",
            "review_content": "\nMary's improv dance class was one of the most amazing classes I've taken here. Not a dancer myself, I was hesitant going into it--most of the other students had been dancing for years--but Mary helped me to become both more comfortable in my own body and to feel more free in all movements. The mirror was covered for the duration of the class so that we would not look at our bodies but rather feel what they are capable of. \nGreat class for actors who'd like to be more comfortable in their own skin. This is not a contact improv course, but an actual improv dance class (much like an improv acting course). Speech is used if the spirit should move you, noises are always acceptable. Some of the most interesting work we did was site-specific: we danced on the Columbia steps, in Butler, on Lehman Lawn, by that rotating statue, in an unsuspecting classroom... Mary's motto for the class was \"It is easier to get forgiveness than permission.\"\nWorkload:\nOne short paper on your ideal dance--no restrictions. \n"
        },
        {
            "course_name": "Modern V",
            "review_date": "March 05, 2004",
            "review_content": "\nMary is SO amazing.  She has a real gift, and if you're a dancer you should definitely take her class ASAP!  The material she gives is quite hard, but she has such an upbeat personality that the class never seems like a chore.  I always look forward to her class at the end of a hard day.  Her warmups are generally set, but she continually adds new material to keep it interesting.  She also does a good job of intergrating the things we do across the floor into a longer phrase.  She will make you work your butt off, but you will be glad she does!\nWorkload:\nNone.  Unless you need to makeup a class - she has a different attendance policy than most dance profs.  She'll have you write a paper or attend a live performance, etc...\n"
        },
        {
            "course_name": "Dance Composition: Form",
            "review_date": "January 18, 2004",
            "review_content": "\nThis is one of the best courses I have taken in any department.  Mary has an impressive resume and understands choreography as an art on a higher level than anyone else I have encountered, but she is truly a great professor because she cares about her students and understands what she needs to do to help them reach their potential.  She worked with each student in class in a different way, pushing each of us when we needed to be pushed and letting us discover our own style and methods when we were headed in an exciting direction.  In a class of varying skill levels and experience, each student developed a unique style, created intruiging compositions, and I think we all surpassed our own expectations and learned a lot about ourselves.   \nWorkload:\none composition based on specific choreographic exercises, one composition to a randomly assigned piece of music.  this class is as hard or easy as you make it, and you get out what you put in.\n"
        },
        {
            "course_name": "Dance Composition: Form",
            "review_date": "December 07, 2003",
            "review_content": "\nMary is a newcomer to the dance department, and what a find she is. She is bright, imaginative, encouraging, and inspiring. She will help you to think far more deeply about dance and choreography. I only wish she were teaching more courses in the department, but give her time. Take her class. She is a phenomenal professor and person.\nWorkload:\nTwo dance compositions were the bulk of the material, but we also had to keep a journal with a minimum of 28 entries throughout the semester. We had one paper that was easy and fun to write, and we were required to show our work at one of the department showcases during the semester. It's not hard work in the usual read-the-chapters, study-your-notes sense, but it's incredibly challenging trying to push yourself to new levels of creativity. However, it is worth your sweat and tears.\n"
        }
    ]
}