{
    "prof_info": [
        {
            "prof_name": "Bruce Berne",
            "prof_id": 2832,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Physical Chemistry I",
            "review_date": "January 17, 2015",
            "review_content": "\nProfessor Berne and TA Matt made a great team and made Physical Chemistry a relatively painless experience.  I really enjoyed learning the material for this class, but be warned, the textbook (though necessary to read) is riddled with errors.  Also, make sure to review the basic techniques of differentiation and integration.  You will need calculus for this class!\nProfessor Berne is hilarious and does not deserve the poor reviews he has received.  He truly loves the subject matter, makes himself available after class and during office hours for questions, and really does respond to student feedback.  Sure, he makes some mistakes on the board but he corrects them when someone informs him and as long as you are proactive and paying attention, the occasional mistake shouldn't be detrimental to your understanding of the material.\nPlease, please go to class.  There was a contingent of students who showed up to the final and I swear I had never seen some of them before.  Even though Matt posted his notes online, Berne is entertaining and his explanations are often very good.\nWorkload:\nAssigned Work: Biweekly problem sets (not collected)\nWhat you should do: \n1. Read the assigned reading BEFORE class (easier said than done).  I understood the lectures better when I did this.  \n2.Study for weekly quizzes but do not fall behind on new material.  \n3. Ask questions right away as concepts build of one another.\nIf you do all this and stay on top of the material, PChem can be an enjoyable experience.  \n"
        },
        {
            "course_name": "Physical Chemistry I",
            "review_date": "December 18, 2014",
            "review_content": "\nI've been fortunate enough to have a series of great professors in the Chemistry Department. I'm happy to say I can add Professor Berne to this list. I thought by the end of it that I had a solid introduction to the discipline that is Physical Chemistry.\nPre-requisites: General Chemistry (of course). Although the course requires Physics I and II as pre-reqs, I don't feel as though we went beyond using F=ma. Calculus I,II,III are needed. There aren't many difficult integrations (except in Stat Mech) in the course however you should feel comfortable with partial derivatives as they are used frequently throughout the course. \nCourse: Physical Chemistry I covers Thermodynamics, Kinetics, and some statistical mechanics. It begins by exploring whether or not a reaction will occur spontaneously and then moves into how fast a reaction will occur. Some of this is very reminiscent of general chemistry, only taken a step further and thus more in depth. The class concludes with statistical mechanics (partition functions, the canonical ensemble, etc.) and used to derive the equations used throughout the course. Overall, it was an enjoyable subject mater. I found myself saying \"this is cool\" and \"I love pchem\" throughout this course. \nClass (Professor Berne): Class was very useful to attend. Professor Berne was always enthusiastic about the material he was teaching and as a result I never really lost interest in the subject matter (he throws in humor periodically which i genuinely found funny). He is very clear with his notes on the board and goes at a reasonable pace. Furthermore, he would always make sure to answer any questions before moving on to the following topic. The only time I was at a complete loss was around Statistical Mechanics. It's more of a fault of the subject matter itself than Professor Berne as you really need to work out the math and derivations on your own to really understand it. This is when attending class is indispensable as I found that the lecture did a better job than the textbook when handling the subject. In regard to the reviews below, professor Berne only used power point maybe once in our class (understandably as the diagrams used would be heard to re-create by hand). He makes them available on coursework as a supplement rather than a required reading. Overall, Professor Berne is funny, concise, and excellent lecturer. \nRecitation (TA Matt Mayers): Best TA at Columbia, but I'll be brief. Matt took the time to type out ALL of the class notes and made them available to the students. His recitations were helpful in clearing up any confusion and as a result were worth attending. Definitely made PCHEM less painful than it probably should have been.\nMidterm: Actually a Mid-Term. It covers all of thermodynamics (minus electrochem). The questions were related to assigned HW problems and topics covered in depth in lecture. Overall they were reasonable albeit a bit lengthy. \nNo formula sheet. Probably one of the few things I disliked only because effort was put into memorizing them rather than being able to apply them. \nFinal Exam: The final exam was split into two tests. Test 1 spanned the whole course. Test 2 covered material after the midterm only. Pretty long so you may want to focus on one test first rather than jumping from one to the other. See Workload for more info.\nWorkload:\nHW: Professor Berne told us to take our book to lunch with us...he meant it. The assigned readings supplemented the material covered in lecture. If you read the chapters as he assigned them, you will get more out of the lecture. The assigned HW problems were useful and a great indicator of what was expected of you on exams.\nWeekly HW problem sets and reading (10-15 problems, 1 chapter-ish)\n25% Quiz at end of each chapter (similar to HW problems)\nOriginally the midterm was 25% and final 50%, however, professor Berne changed it to the following \nThree tests, 37.5% each, lowest test dropped\n1 midterm (Thermodynamics)\nFinal Test 1 (Thermodynamics, Kinetics, Stat Mech)\nFinal Test 2 (Kinetics, Stat Mech)\n"
        },
        {
            "course_name": "Physical Chemistry I",
            "review_date": "December 18, 2014",
            "review_content": "\nI've been fortunate enough to have a series of great professors in the Chemistry Department. I'm happy to say I can add Professor Berne to this list. I thought by the end of it that I had a solid introduction to the discipline that is Physical Chemistry.\nPre-requisites: General Chemistry (of course). Although the course requires Physics I and II as pre-reqs, I don't feel as though we went beyond using F=ma. Calculus I,II,III are needed. There aren't many difficult integrations (except in Stat Mech) in the course however you should feel comfortable with partial derivatives as they are used frequently throughout the course. \nCourse: Physical Chemistry I covers Thermodynamics, Kinetics, and some statistical mechanics. It begins by exploring whether or not a reaction will occur spontaneously and then moves into how fast a reaction will occur. Some of this is very reminiscent of general chemistry, only taken a step further and thus more in depth. The class concludes with statistical mechanics (partition functions, the canonical ensemble, etc.) and used to derive the equations used throughout the course. Overall, it was an enjoyable subject mater. I found myself saying \"this is cool\" and \"I love pchem\" throughout this course. \nClass (Professor Berne): Class was very useful to attend. Professor Berne was always enthusiastic about the material he was teaching and as a result I never really lost interest in the subject matter (he throws in humor periodically which i genuinely found funny). He is very clear with his notes on the board and goes at a reasonable pace. Furthermore, he would always make sure to answer any questions before moving on to the following topic. The only time I was at a complete loss was around Statistical Mechanics. It's more of a fault of the subject matter itself than Professor Berne as you really need to work out the math and derivations on your own to really understand it. This is when attending class is indispensable as I found that the lecture did a better job than the textbook when handling the subject. In regard to the reviews below, professor Berne only used power point maybe once in our class (understandably as the diagrams used would be heard to re-create by hand). He makes them available on coursework as a supplement rather than a required reading. Overall, Professor Berne is funny, concise, and excellent lecturer. \nRecitation (TA Matt Mayers): Best TA at Columbia, but I'll be brief. Matt took the time to type out ALL of the class notes and made them available to the students. His recitations were helpful in clearing up any confusion and as a result were worth attending. Definitely made PCHEM less painful than it probably should have been.\nMidterm: Actually a Mid-Term. It covers all of thermodynamics (minus electrochem). The questions were related to assigned HW problems and topics covered in depth in lecture. Overall they were reasonable albeit a bit lengthy. \nNo formula sheet. Probably one of the few things I disliked only because effort was put into memorizing them rather than being able to apply them. \nFinal Exam: The final exam was split into two tests. Test 1 spanned the whole course. Test 2 covered material after the midterm only. Pretty long so you may want to focus on one test first rather than jumping from one to the other. See Workload for more info.\nWorkload:\nHW: Professor Berne told us to take our book to lunch with us...he meant it. The assigned readings supplemented the material covered in lecture. If you read the chapters as he assigned them, you will get more out of the lecture. The assigned HW problems were useful and a great indicator of what was expected of you on exams.\nWeekly HW problem sets and reading (10-15 problems, 1 chapter-ish)\n25% Quiz at end of each chapter (similar to HW problems)\nOriginally the midterm was 25% and final 50%, however, professor Berne changed it to the following \nThree tests, 37.5% each, lowest test dropped\n1 midterm (Thermodynamics)\nFinal Test 1 (Thermodynamics, Kinetics, Stat Mech)\nFinal Test 2 (Kinetics, Stat Mech)\n"
        },
        {
            "course_name": "Physical Chemistry I",
            "review_date": "January 18, 2013",
            "review_content": "\nIts unfortunate that the Chemistry department let Bruce Berne teach a higher level chemistry course like Physical Chemistry again after so long. I apologize to Profesoor Berne, but he definitely wasn't ready to teach Physical Chemistry again, and probably won't be at another point later in his career. \nYou can tell that Prof. Berne at one point was a fairly good lecturer and professor, but he has definitely passed his prime. Most lectures were given via powerpoint, and were lamentable at best. Most information from the powerpoints was repeated two or three times over the span of two lectures and could be found in the book in a more understandable format. Frankly, attending class was mostly superfluous and only necessary for the last week of the course when he attempted to tackle Statistical Thermodynamics. During the sections on phase changes and chemical potential, Berne switched to lecturing using the blackboard; these were his only redeeming lectures, bearable and sometimes informative. \nHomework wise, Berne never knew what he was assigning nor did he keep to a regular homework schedule. About a third of the way through the semester, he realized that the problems he was giving out of the book had a solutions guide sold with the book in the bookstore. After that point, he started writing his own atrocious problem sets riddled with grammar, spelling, and content errors. These problem sets were often not complete, and the TA had trouble answering many of the problems in a logical manner in the solution guides. The homework was similar to the exams once he started writing his own homeworks. Often, however, I wouldn't finish the problem sets since it had no additional benefit to learning the material and the TA wouldn't care if you finished or not.\nFor the exams, you were expected to memorize how to derive ALL of the formulas given in the class. The midterm was relentless and lasted 2 hours and 20 minutes forcing other students to reschedule other exams. The final was a little nicer, where he said we should memorize all equations but gave us an equation sheet on the back in the end (with errors no doubt). Overall, I thought the exams were fair yet repetitive. \nUnfortunately, the fate of Berne's next class is up to the Chemistry department; however, if possible, I would avoid taking his class.\nWorkload:\nIrregular homeworks that varied in length from 6 problems to 36. About 9 homeworks total. Homework - 20%, Midterm - 30%, Final - 50%.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "August 31, 2008",
            "review_content": "\nOverall I liked the class, though it was definitely hardcore and I doubt some of the topics covered will ever come up again. Berne and the lecture itself can be very boring and too in-depth/technical sometimes for how much brain you'd think freshmen would have. I had failed attempts to take notes, mostly consisting of humongously long formulas, which must be memorized for the exams(though to be fair he doesn't usually test you on the most horrific ones). My work ethic for this class was basically nonexistent until a midterm or final, when I skimmed all the chapters and did all the problems during an all nighter. Like I said, you have to memorize the formulas so doing things last minute worked well for me. Even if you understand the theory, the formulas don't always come easily. The curve is really good though, since Berne usually aims to have a class average of 50-60%. One standard deviation above the average is usually an A.\nWorkload:\na set of problems per chapter; 3 midterms (one dropped) and 1 final\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "February 25, 2008",
            "review_content": "\nThis is pretty much a physical chemistry class. Be prepared for some pretty deep derivations and equations. His lectures are based off of his powerpoints so some choose not to attend lectures. Midterms and final were rough. Means on the exams ran anywhere from low 40's to low 60's. However, there was a VERY generous curve at the end. You won't know your grade though as you go through the class since you don't really know how he's going to curve. Overall, you do learn quite a bit in this class and it's definitely a class to take if you have a love for Chemistry or just want to get Gen. Chem out of the way in 1 semester. \nWorkload:\nWeekly Problem Sets that are not graded or handed in. 3 Quizzes and 3 Midterms. 3rd midterm taken during same period as the final. \n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 23, 2007",
            "review_content": "\nBerne is a really nice guy, and he's pretty enthusiastic about the material, but the problem is being enthusiastic about the material yourself. Many of the lectures are derivation-based, which can be intimidating, but you don't have to understand the derivations to do well on tests. It's much more important knowing what the formula is and how to use it.\nThe exam content was pretty fair. They were  all problem-based with very few conceptual questions. Sometimes the problems were simply plug-and-chug if you knew the right formulas. \nHe always stops lecture to answer questions, but he often misunderstands or answers them by repeating what he said three second earlier during lecture. Occasionally digresses about famous chemists who've done work at Columbia. Starts class 5-10 minutes and usually ends 5 minutes late. No office hours but approachable after lecture.\nI found the recitations useless. If TAs were clearing up material covered in lecture, they always chose to explain stuff you already knew. Then there were times when they had to cover chapters not taught in lecture, but if you took AP Chem in high school, then you pretty much knew everything already.\nSome people can probably pull off just cramming for this class the night before, but I found it really helpful to keep up with the lectures by reading the chapters beforehand (he posts assignments before he starts lecturing on the assigned chapters in class).\nWorkload:\nUngraded problem sets assigned almost weekly. Sometimes he makes up his own problems, which are considerably harder. Exam problems are somewhere between the two in difficulty (but definitely closer to book problems). Do them, even though they're optional. Also occasional quizzes (usually before midterms).\nThree lengthy midterms and one final (last midterm taken in same time slot as final). \n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 22, 2007",
            "review_content": "\nIf you want to put your love of chemistry to the test, this is the class for you. Prepare to fall asleep every class, become boggled by incredible equations, and leave tests wondering if you even answered parts of a majority of the questions correctly.  Despite a relatively generous curve, Bruce Berne succeeds in making you thoroughly despise the work you're doing; even though you may understand the concepts backwards and forwards, if you can't memorize the vast number of equations for the exams you'll end up with an unappealling grade. The lecture material does not correspond with anything the TAs teach, and even they were often confused about the subjects presented in lecture. And however enthusiastic or friendly Professor Berne may be, he only succeeds in complicating easy topics with slides upon fast-moving slides of equations you may or may not need to know. This class was a decidedly unpleasant experience, no matter the final grade.\nWorkload:\nHeavy, primarily because it's up to you to learn the material on your own.  Assignments consist of reading and a problem set that is never due, but extremely useful for the exams.  There were a a handful of quizzes, a final, and three midterms, the lowest of which was dropped. Students are required to attend a recitation with the TAs weekly, which are necessary because they teach material never covered in lecture that shows up on the exams.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 20, 2007",
            "review_content": "\nI get the impression that Professor Berne is one of those professors who is at the university for research rather than for teaching.  All of his lectures are done by powerpoint presentation, most of which he says that he hasn't updated in a few years.  The lectures are posted online, and it can be useful to look over some of them when studying.  Some students print them off and take their notes directly onto the lecture notes--that's probably a good idea.  Don't make the mistake of thinking that because the lectures are online you can skip class--there is a lot that he will talk about that isn't written directly into the presentations.  On the other hand, he also tends to go off on tangents about different people who have done different things for the field of chemistry (particularly when they've got some connection to Columbia).  He doesn't seem to be very good at answering students' questions, and sometimes I got the impression he didn't even understand what they were asking.  Reading the book is definitely helpful in this class.  Only take this class if you're prepared to take an intensive class, because that's what it is (you get through all of gen chem in 1 semester instead of 2).  On the exams, he aims for the mean to be about 60%, and at the end of the semester he will curve it so that the number grades correspond to a letter grade--grades aren't calculated before you take the final.  The homework isn't collected, but that doesn't mean you shouldn't do it.  However, it seems like the homework problems aren't always consistent with the exam problems.  The day before a midterm definitely go to class, because he will tell you what to study for the midterm.\nWorkload:\nweekly problem sets that are talked about in recitation, but not collected, a few take home quizzes, 3 midterms (lowest one is dropped), and a final\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "April 09, 2007",
            "review_content": "\nWhat no one has told you so far is that this class is basically a very advanced (for first-years) physical chemistry course. If you have not taken physics, I would not recommend this course. Prof Berne derived one of the gas laws on the first day with a proof that involved partial integrals. We also learned how to solve - not just the theory behind - the Schrodinger wave equation. There is a lot of theory in this course, but what can you expect - he's a theoretical chemist. It's a very fast-paced, difficult course if you don't have the proper foundation, so make sure you know your calculus (at LEAST up to Calc. 2), physics and at least something about physical chemistry before taking this. You need to know your stuff forwards and backwards for the exams. However, the prof is VERY nice and extremely approachable - you just have to take initiative to ask him. \nWorkload:\nProblem sets that are rather useful but very difficult, but don't have to be turned in; grueling midterms and 3-part final. Averages in the 50s-60s.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "January 18, 2007",
            "review_content": "\nMy impression of Professor Berne is an amalgam of the other reviews thus far.  He is extremely smart and knows what he is teaching, no doubts there.  Furthermore, he is also interested in what he teachers, and tries very hard to add spice to his lectures and keep students interested.  I noticed many had a difficult time paying attention, even to the point of falling asleep.  This may be due to the fact that the class was in the morning and he often dims the lights for his power point presentations.  Although he moves fast, you can get by without bringing the slides to class, which he posts online.  However, there is no denying this class is challenging.  I coasted through AP Chem no problem, but had to work to maintain a good grade in this class.  Your homework is not collected; the only grades are the midterms and finals. Test averages were often in the 50-65% range, but with a fair curve. My only other complaint was that the class could have been better in sync with the recitations, which are set up to teach completely different material, and sometimes the TA's said something different than Berne.  All in all, a good class if you are really interested in chemistry or are intent on getting a head start, but be prepared to study.\nWorkload:\nSeveral very long problem sets, not mandatory but I highly encourage doing them as practice.  3 midterms and a final, all are quite difficult, although he curves a fair deal and even drops your lowest grade.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "December 26, 2006",
            "review_content": "\nBruce Berne knows his stuff. He always comes to class with his briefcase and a Powerpoint slide ready to go. His lectures are always a little too indepth--covering in much more detail the topics you only need to know on a casual basis. For example, he spent maybe two whole weeks on Schrodinger's equation, which wasn't even a question on the final exam. All in all, if you know the material from AP Chem, you should do fine. I skimmed by this class without even really attending lecture. Whenever I did, I was probably asleep or playing online poker in the back. Oh yeah, lecture slides are all posted online too.\nWorkload:\n7-10 problem sets which are intended to be weekly, but in reality, up to the professor's discretion. None of them are collected or graded so it's completely for the benefit of you, the student.\n2 Midterms, straightforward.Long, tough final (3 parts--each part counts as 1 midterm)\nLowest midterm droppedGenerous curve.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "April 18, 2006",
            "review_content": "\nI'm going to go out on a limb here and tell you that I loved this class.  It was engaging and by far the most challenging thing I've ever done, and I LEARNED chemistry by the time I was through with it.  Professor Berne reminds me of Sean Connery, and clearly loves what he does, which makes the class interesting.  Lectures were a bit fast-paced in the beginning but gradually became more understandable.  A bit of advice: if the lecture slides are posted online, do NOT use that as an excuse to skip class, but print them out and take notes on them; the slides go by too fast to write everything down in a notebook.  Professor Berne requires a thorough understanding of the material for his tests - don't expect to get by simply by memorizing formulas in this class.  That said, the problem sets are helpful in learning to apply the concepts, although test problems are always harder.  Think long and hard about whether or not you want to take this class - it will not be easy, and if you don't love chemistry then you will be miserable, but if you're willing to work and want to learn from a ridiculously smart and extremely approachable professor, this may be your favorite class of the semester.\nWorkload:\nHeavy - problem sets for every chapter (optional but necessary if you want to succeed), two midterms, and a final.  Very generous curve.\n"
        },
        {
            "course_name": "Intensive General Chemistry",
            "review_date": "January 17, 2006",
            "review_content": "\nA nice guy who is definitely one of the smartest in the world at what he does.  However, he oftern forgets he is teaching undergraduates and doesn't take enough time to explain difficult concepts or calculations.  The exams don't accurately reflect what is given in the homework and the lectures don't accurately reflect what is on the homework.\nWorkload:\nHomework problems and reading assignments are approximately weekly, but often take 3-5 hours or more to complete.  However, they are not collected, so there is flexibility in how long it takes you to complete the assignment.  Three midterms and a final, all of which are overly lengthy and nearly all students struggle to finish.\n"
        }
    ]
}