{
    "prof_info": [
        {
            "prof_name": "Virginia Page Fortna",
            "prof_id": 306,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "International Politics Seminar: Ending Wars, Keeping Peace",
            "review_date": "January 15, 2006",
            "review_content": "\nShe is very smart and will respond to what you say with difficult questions.  Its a pitty she doesn't speak more in class.  The class is only as good as the students in it since disc. is based on prior knowledge and a few readings. The readings tended to be very technical, dealing with a lot of charts and numbers.  The research paper in the end is difficult, start early.\n \nWorkload:\nAverage seminar but shorter paper (15p) that you hand in twice, less reading but more technical stuff\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "May 06, 2001",
            "review_content": "\nFortna knows her stuff... if you're serious about IR, take this class... the reading is excessive, but, in my opinion, totally necessary. This class will give you a great foundation for your IR studies. Unfortunately, Fortna doesn't exactly spice up her lectures. There is no extra effort on her part to add a bit of excitement to the class.. it is cut and dry. This class still pales in comparison to punching the clown.\nWorkload:\nTons o' reading... 4 short papers and mandatory sections.. mid term and enormous take home final\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nShe's a fantastic lecturer - organized, understandable, good speed, good examples. However, it's extremely difficult to get an A from her unless you do almost all of the extensive and dense reading. By attending virtually every one of her classes, taking extensive notes and doing almost no reading (that's right!), I was able to get an A-. If you're a non-reader, be warned: I found out after the class was over that much of her final was based on info from the readings NOT touched on in class.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nFortna really is a good lecturer...sometimes a little boring, but she's warm, has a good sense of humor, and is very straight forward and clear, if a little fast sometimes. The reading is a little much and can get boring as hell, but the midterm at least could be taken straight out of the lecture notes. Harder to do with the papers, because you have to have something to cite.\nWorkload:\nMandatory discussion section, a ton of reading but you don't have to do all of it, 4 papers (3-4 pages), midterm and final. The midterm wasn't hard if you knew your stuff, but the grading on the papers can be random. It's basically at the discretion of the TA, and it can get erratic.\n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Fortna provides a good basis for the foundations of interntional relations. Her lectures are easy to follow and interesting, although at times (during topics she does not like much) the lectures can be boring. She encourages class participation and is extremely approachable. She is easy going. The reading, like any poli sci class, is substantial, but much less then other int'l politics classes.\nWorkload:\n4 papers (3-4 pgs), one midterm, final is a 5 pg paper. mandatory discussion sections.\n"
        }
    ]
}