{
    "prof_info": [
        {
            "prof_name": "Martin Lindquist",
            "prof_id": 1628,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 03, 2010",
            "review_content": "\nAs for the course itself, of the two Intro to Stats courses, 1111 is the baby one. While 1211 requires calculus - which you should know if you are taking a quantitative science anyway - 1111 only requires a high school level of math according to its own description. If you happen to have dealt with any statistics before, or have a background in research science, this class is an easy A.\nAnd that is even made easier by Professor Lindquist. The material was made astoundingly clear by him. I am not kidding, even the lecture slides on Courseworks (posted up the day before) are clear enough that you could have not even shown up to a single class and done fine - which is probably what happened since our room was too small, but I digress. That being said, if you have time, you should show up to class since he throws in a few examples to clear up any confusion that you may have.\nHe typically assigns two chapters in the textbook each week, and a problem set to accompany it. Some people find the textbook a bit annoying with all the self-referential jokes, but I enjoyed it, so that may be a personal taste; however, you could not deny that it was still effective in teaching the material rather clearly. I plan on keeping it as a reference instead of selling it. The textbook problems take maybe an hour, but the TAs can bring down the hammer on the grading from time to time. Sometimes he attaches a STATA problem set, which involves going down the computer lab, doing a tutorial on the statistical software offered there, and then doing a problem usually from the textbook the method of which you have just been guided through.\nThere is a project during the second of the semester, which involves forming a group and conducting a study. Just make sure you don't have a deadbeat group of friends and you should be fine. He's pretty lenient on the grading of it; even if you screw up, if you can explain what went wrong, why it was wrong, and what should have been done for it to be correct, he'll give you credit for knowing how to conduct a study though you had to learn it the hard way.\nAbout 1/4 and 3/4 through the semester, he gives a quiz at the end of class. 10 multiple choice questions; mostly theory, a few calculations you could do in your head. If you paid any attention to the lectures, or the slides, or textbook, it's an easy 9-10/10. Halfway through he gives a midterm that takes an entire class session; a few multiple choice questions like on the quiz, and some homework-like multi-part problems that are usually straightforward. He allows a one-page, front and back, cheat sheet for formulas and the like. Go through the lecture slides, write down any formula that looks important, and you will walk out of the exam early. The final is a little bit longer than the midterm but the same format, and has about a 1/3 focus on the first half and 2/3 focus on the second half. You are allowed two cheat sheets for this. Same deal as the midterm: go through the lectures, take down the important looking formulas, walk out halfway through the three hours given with a smile on your face.\nNever went to office hours - never needed to.\nOn the whole, the class was easy and informative. Lindquist sometimes teaches 2110, so I plan on taking that if it fits into my schedule.\nWorkload:\nTwo chapters of textbook reading a week, goes by quickly. Weekly problem set from the textbook for 25%, two quizzes for 5%, midterm for 20%, final for 40%, and a group project for 10%. Lecture slides on Courseworks are good enough to skip going to class, but going is useful if the textbook wasn't clear enough for that topic. No more than a couple of hours of work a week outside of class.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 22, 2006",
            "review_content": "\nLindquist is a great professor - the class is pretty easy but he curves to a B-, be weary.\nWorkload:\n11 problem sets 25% (drop the lowest); 2 multiple choice quizes 5%; midterm 20%; projcet 10%; final 40%.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 21, 2006",
            "review_content": "\nStatistics as a subject is a freaking esoteric nightmare.  However, Martin makes it almost bearable.  He is the most disarming and frankly mildy goofy teacher ever, but it is hard to imagine anyone else being so enthusiastic about statistics.  Take copious notes and make sure to do well on the midterm.  It counts for like 25% of the grade.\nWorkload:\nMild.  Weekly problem sets, one midterm, one final, and a statistics project\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 11, 2006",
            "review_content": "\nWonderful Professor! Very clear and organized. He covers a lot of material, but does so in a way that you end up understanding everything. He is very approachable. Overall, he's a gem.\nWorkload:\nWeekly problem sets- simple. 2 quizes, midterm, final, and a group project. You are allowed one cheat sheet on the midterm and two on the final. The project is generously graded and the homework actually helps. Overall, worth the time.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "May 02, 2005",
            "review_content": "\nThis is how a class should be...go to class, go to recitation, do the homework...do well. I have never taken a class that is so strightforward. No surprises on the midterm or final. It was refreshing. In addition to all that, Martin Lindquist is the most amusing, engaging, and entertaining stats professors. If you take this course, take it with Lindquist. He will make it a pleasurable experience. \nWorkload:\nweekly problem sets that are pretty easy, midterm and final (both of which you are allowed a cheat sheet) \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "February 05, 2005",
            "review_content": "\nStatistics is pretty dry stuff.  I'd say fairly unbearable, despite its relative ease.  That's where Martin comes in.  This man makes what has the potential to be the most painfully uninteresting 4 hours of your week (one hour mandatory recitation) very very bearable.  His uninhibited awkwardness and sometimes self-deprecating style will make you smile and cringe in interest, his clumsiness (which he recognizes) makes him entertaining---if you walked up to him on the street after class, you'd think he had spent the last hour rolling around in a giant tub of chalk dust.  Seriously, though, Professor Lindquist is always excited about what he teaches, always approachable, and a genuinely good guy, who doesn't give you trouble if you need an extension on the problem sets or some extra help.  If you have to take Stats, take it with him, you won't regret it.  \nWorkload:\nMidterm/Final are EASY, but you need to know your stuff.  If you go to class and just copy down the notes, you'll be set.  The textbook rocks, so read it.  It'll take you 15 minutes a week.  Problem sets can be time consuming, but are graded fairly.  Quizzes in recitation are simple and straightforward.  \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "January 07, 2005",
            "review_content": "\nAwesome professor!  I would highly recommend taking this class with Professor Lindquist.  He is very clear, thorough and organized in his presentation of the material.  Literally, he writes down every single thing on the board; I never opened up the textbook once the entire term to look anything up.  Lindquist is very nice, approachable and open to questions.  He truly wants students to understand the material and do well.  He even said on the first day of class that he wanted to give out as many As as possible...which is a comforting thing to hear from a professor.  \nI agree with past reviewers who claim that the second half of the term is a lot more complex than the first half!  I remember Lindquist saying in class after the midterm one day that if we did not get this one concept, we would have trouble understanding most of the stuff that follows it - he was not kidding.  Nevertheless, Lindquist was very great when it came to reviewing and explaining things over and over again.  In general, if you need to take a math/stat class, take it with Lindquist.....he is actually understandable, fair and even entertaining (esp. when he jumps around, knocks into things and gets chalk all over his black shirts).\n\nWorkload:\n1 midterm and 1 final (both with \"cheat sheets\"), about 5 short quizzes spread throughout the term (each had 4 simple questions on it), a group project, and homework sets every week (a lot of the assignments had a STATA component - most pointless, tedious and annoying computer program thing ever). \n\n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 02, 2005",
            "review_content": "\nIf you have to take this class for a requirement, old Martin is a clear lecturer and a nice guy.  You can imagine how fun intro stats is - the book sucks, its easy to sleep through class, and recitation TA's come up short on the teaching end.  Beware the methods of calculating grades - though its really really easy to get an A on the midterm and final (open notes), the homework and quizes count for half the grade, and since the book is horrible and the TA sessions stink, its easy to pull a solid D on half the course work if you're a lazy bum.\nWorkload:\nWeekly homework that was a waste of life.  Quizes with only four questions.  Easy final and midterm.  Group project.\n"
        },
        {
            "course_name": "Intro to Statistics (B)",
            "review_date": "January 02, 2005",
            "review_content": "\nProfessor Lindquist is a great lecturer--very clear and organized.  All of the reviews about him being an extremely nice, accessible, and informative professor are true.  If you have to take Statistics, take it with Lindquist.  The material is EASY, and if you do have a little trouble with it, he'll be happy to explain it to you in a very coherent way.  Spend time reading the textbook and completing the homeworks--they are tedious but they will really help you when midterm and final times come along.  \nWorkload:\nmidterm and final (you get to bring in cheat sheets), which aren't too bad if you read the textbook, do the homeworks and review your classnotes.  The weekly homeworks do take some time (maybe 2-3 hours) but they forced me to do the readings and keep up with the class.\n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "December 24, 2004",
            "review_content": "\nMartin is one of the nicest professors that I have had at Columbia.  He responds really quickly to email and is always willing to go out of the way for a student.  He's a good teacher too - explains things very well and will take questions if someone is unclear - however, the course material is EXTREMELY BORING.  Homeworks are pretty tedious but really help when it comes to understanding the material.  TAs grade a lot of stuff, and mine was extremely nitpicky to the point that when she dropped out as a TA Lindquist had to regrade our old homeworks because of the grading disparity.\nSo, in sum - great guy, great teacher, hella boring material. (But if you take Stats I'd recommend you take it with him).\nWorkload:\nMidterm (easy), final (hard if you don't study a lot) - can bring in \"cheat sheets\" to both.  Weekly homeworks that take a while to do, every other week there's a recitation quiz that's sort of a joke.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 23, 2004",
            "review_content": "\nMartin is a blessing to the shameful \"math realm\" at Columbia! His lecture is a lot of fun, considering you can watch him jumping around (the sign of his great enthusiasm!?) and writing down every single word on the \"little\" blackboard... His lectures are well-\nstructured, and I feel I've taken away a lot from him. A very soild teacher.\nWorkload:\nWeekly homework sets consisting of 8-12 problems from the textbook. 5 quizzes (in the annoying weekly recitations that seem mandatory to attend). Midterm (fair). Final (harder than midterm since it covers the material from the whole course). And oh, occasional STATA (which, is not so helpful) and a group project.\n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 07, 2004",
            "review_content": "\nI have mixed feelings about this class.  The lectures were very organized; Martin went point by point through the text book chapters, writing out every little thing on the board.  He went over certain points probably 10-40 xs, which is great if you are confused, but if you're understanding everything, his repetition gets tedious.  He graciously takes questions during lecture but can't always answer them sufficiently.  Homeworks got progressively a little longer and harder as the semester wore on.  My TA could hardly speak English, which made recitations a bit frustrating.  Many kids only went to recitations when we had our quizzes.  Martin does his best to make the class entertaining, and he really is a cute little man, but it's still hard to get yourself to go to lecture twice a week.  Missing a lecture isn't a big deal, but missing all of them would mean a lot more studying to do around midterms and finals.  A good percent of the class came to every lecture.  Martin doesn't make himself that available outside of class and wants students to instead consult their non-english speaking TA's.  This review is sounding pretty negative, but I didn't dislike the course that much, and I took it for interest.  If it's a requirement for you, Martin is a good choice.  If you're taking it for interest, you might wanna look for something a little more lively.  \nWorkload:\n10 (?) homeworks, all of which take some work and maybe reading a little from the book, but you can do them mostly from lecture notes.  5 recitation quizzes, which each take 40sec-5min and are really easy if you've paid attention in lecture and reviewed a little.  I studied a lot for the midterm and final and thought they were both reasonably easy (a few tricky multiple choice questions).  One project toward the end of the semester, which I did with a big group, so it wasn't a big deal.  \n"
        },
        {
            "course_name": "Intro to Statistics",
            "review_date": "January 03, 2004",
            "review_content": "\nI would consider Prof. Lindquist the best professor I've ever had at Columbia if the subject were a bit more interesting.  Nonetheless, Martin was overall awesome.  The lectures were consistently detailed, thorough, and easy to follow.  The class is really not the difficult at all--that certainly helped.  But whenever something was tricky here and there, Martin was genuinely interested in making sure you understood.  He truly made me see that despite the arrogant crap you often find teaching at Columbia,  there are a few gems like him out there.  He's really enthusiastic both about the subject and about teaching, so you'll find that going to class isn't so bad.  But if felt like cutting, you're in luck because you can borrow notes from anyone in class and still understand perfectly: the man writes down every word he says.  Always ask questions in class because he'll keep explaining until you understand three times over.  If you have to take Statistics (and your major allows Stats A), Martin is your man!  A friend of mine even found him cute and sexy; eventually, I too had to admit his sweaty enthusiasm was adorable.\n\nWorkload:\nBest thing that ever happened to me: midterm and final.  On the former he allowed a cheat-sheet (front and back); on the latter he allowed two!  Weekly problem sets (not too bad, often with STATA--useless, kinda annoying), and a few ridiculously easy quizzes in recitation.  P.S. Despite the cheat sheets, the tests are not give-aways.  Martin's a tricky one--especially on the multiple choice questions--so stay alert!\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 27, 2003",
            "review_content": "\nProfessor Lindquist is a really nice guy. Everyone says Statistics is a really easy class and an easy A but it is still tricky stuff, and Prof. Lindquist was very good at explaining everything in detail. Recitations are \"required\" but the only time people would go is when he would have quizzes in them, which was about every other week. There was also a problem set assigned every week consisting of problems out of the textbook. They weren't difficult but definitely time-consuming and tedious. Also, the first half of the semester was insanely easy and then the class became tricky practically overnight. Same thing with homework problems. The midterm was incredibly easy but the final was trickier. But overall, Professor Lindquist is an excellent choice and you would do well to take his class if he's teaching it.\nWorkload:\nProblem Set every week, about 10 altogether, 5 quizzes, Midterm, Final. Not a hard class, but you can't just blow it off either. \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "December 23, 2003",
            "review_content": "\nMartin Lindquist is GREAT.  He is a great lecturer, but is this class easy??  No.  The class is pretty easy pre-Midterm, and sitting in class as he explains the \"theory\" behind means is pretty damn funny...but anyway after the Midterm, the stuff is hard.  I don't know why everyone says W1111 is so easy, maybe it's because you ask them after the midterm and not the final....the final is a killer...let's just say many many people sat there eyes big and mouths gaping when they saw the scroll.  Nonetheless, if  you have to or want to take the class, take it with MARTIN LINDQUIST.  He is truely a blessing from the Math/Stats department.  His lecturers are great and he is very passionate about the subject.  Oh and he is quite responsive to questions too!  Great prof.  but not very easy material.  \nWorkload:\ncirca 6,7 Problem SetsMidterm (easy)Final (very hard)\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "November 23, 2003",
            "review_content": "\nTwo words to say about this class: TAKE IT. Professor Lindquist is incredible - the kind of teacher I wish had taught math at my high school when I was good at math but extremely nervous. His lectures are clear and come directly from the book, so there is little confusion. There is a required 50-minute recitation on Friday where you review the week's concepts with a TA and take quizzes. Unfortunately, many of the TAs have such strong accents that it is nearly impossible to understand what they are saying, but the material is already so clear from the lectures that it makes little difference. If you have any kind of math phobia or get really stressed out about not understanding things, TAKE THIS CLASS!\nWorkload:\nWeekly problem sets and STATA (computer program) assignments, not too bad. You get a note sheet for the midterm and final. Group project in which the professor had us go to the Chocolate Show downtown and hand out surveys. VERY manageable.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "May 14, 2003",
            "review_content": "\nProfessor Lindquist is a blessing!  While many other Stats. students were complaining about not being able to understand their profs, Prof. Lindquist spoke very clearly (although a bit quickly).  He practically transcribed the entire book on the board during class, so the lessons were very thorough, and there was never any chance of missing important info during class because it was always written down.  Prof. Lindquist was also very entertaining, as he was constantly tripping over his feet, dropping chalk, or getting caught in those tricky movable blackboards in the Math building!  I definitely recommend Professor Lindquist!\nWorkload:\nWeekly problem sets that take some time, but aren't bad.  There is some STATA (computer program) homework, too, but it's a joke.  One group project at the end.  Two open book/open notes midterms and an OPEN BOOK/OPEN NOTES FINAL, too!!!  Recitations were optional.  This was a pretty easy class.\n"
        }
    ]
}