{
    "prof_info": [
        {
            "prof_name": "Julie Bleha",
            "prof_id": 1339,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 21, 2003",
            "review_content": "\nIn a discussion-based class, being able to lead a discussion is an important quality.  However, this skill usually eludes Bleha.  Discussions were choppy, disorganized and often covered as many topics as there were speakers in any given period of time.  Bleha didn't help matters by making the last 40 minutes of the class a time for her to cram all of what she feels are important ideas down your throat.  Other minuses include not giving a break and requiring the class to meet on a Sunday to make up for a missed class.  She certainly possesses a great deal of knowledge about the works, like most professors, but it would still be best to avoid Bleha.\nWorkload:\n3 papers totaling about 12 pages.  Grading on the papers tended to be fair but not generous.  Exam grades were not nearly as fair.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 13, 2002",
            "review_content": "\nFirst Semester Only: Ms. Bleha is a theatre grad student who is now in her second year of teaching. She has many ideas about the texts and is willing to share them. Perhaps too willing. Her discussions dominate the class, and she is not very tolerant of other views - she'll acknowledge that she things differently, you'll find yourself at a loss to say anything and the discussion will move on. She's a bit too absorbed with her own notes and thus she doesn't let the discussion proceed organically. To her credit, she won't pressure people to talk - if you don't want to say anything since you haven't read you can easily blend into the background and wait for Ms. Bleha to continue on her inexorable journey through the text. Opinion seems to be divided regarding her grading policies: some say that she grades harshly on papers, others that she's a pushover. She does play favorites, however, and that can seriously affect your performance on your essays. The papers (one 1-page, one 3-4, one 5-7) are considerably shorter than other classes. Her comments aren't very helpful and occasionally are quire offensive (one person I know had a paper labeled \"pedantic\"). Though the paper length are shorter than other classes, each week you have to write a short email comment and send it around - this is supposedly graded but I don't know how it factors into the final grade. First semester, no texts were added. All in all, a passable, if not inspiring way to get through Lit Hum, and if you don't talk she's pretty good.\nWorkload:\nReadings: typical, we rarely had a (comparatively) large amount due each class. Papers - as noted above, grading is really dependent on how much she likes you, and her comments wont be helpful. Weekly email comments, and once per semester you have a day where you present a short section from the current work and discuss it for a few minutes to spark discussion.\n"
        }
    ]
}