{
    "prof_info": [
        {
            "prof_name": "Akash Kumar",
            "prof_id": 3408,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Literature Humanities",
            "review_date": "November 20, 2014",
            "review_content": "\nProfessor Kumar is an awesome professor and an awesome guy. I had him last year for Lit Hum and he got about 75% of our class to actively engage in discussions, and thats saying a lot when there are usually only a couple of people talking in Lit Hum. I'd take another class with him teaching since he is very enthusiastic and prepared.\nHe was very straightforward in what he expected in essays and on tests, and he is a pretty fair grader. You can't BS your way through essays though, I highly suggest you do the reading. \nHe gave us a 5 minute break each class and we had a couple of review sessions outside of class that included pizza and some cool storytelling; like I said, awesome guy. He's great with responding to emails and making office hours upon request. I don't have any negatives about him.\nWorkload:\n1 midterm, 1 final, three papers and a few quote ID quizzes a semester. Plus the reading, but you can get away with skimming and/or sparknotes for class discussions (though I don't recommend it)\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "November 10, 2014",
            "review_content": "\nOkay, so the year is not even half way through so this might be an early remark to make but I'm pretty positive that my opinion won't change about Professor Kumar, and if it does I promise I will make another comment in the end of the year for those who just HAVE to know what their teacher will be like.\nFirst of all, for those looking to change their lit hum professors for this spring, GET IN THIS COURSE ASAP. \nSo many of my peers have been complaining about weekly quizzes and essays they have to type and all the workload of LitHum, the only thing Prof Kumar wants is a simple annotation from a website for some of the works, not even all! The annotations are about five sentences, honestly, you don't even have to read the whole paragraph to comment on a few words. \nI personally find Professor Kumar to be extremely funny and ironic. He will accept any comment (almost) and even if he doesn't agree with you he will never call you out on a comment or judge you. He is super accepting and super super nice. I went to his office hours a couple of times, i must admit he isn't the most straightforward teacher I have had. So if you're looking for a teacher who will very directly frame each and every thing you need to do, don't take his course but then again, framing is not the point of LitHum, commenting and suggesting is and that is exactly what Prof Kumar is trying to accomplish. Also, participation is about 20% of your grade but to be honest i don't think he would ever be too harsh on that. He also never calls people out to answer a question. He said that he is a \"too lenient\" grader so, I don't think anything more should be said.. But I will say, since Prof Kumar is by far my best teacher this semester.\nHe pays a lot of attention to students, personally getting to know them. By the end of the second month, the class already has many inside jokes going on. I don't think I've ever left a class bored to death even when I didn't read the works before, so no pressure on reading works on time but do know that whereas many teachers read the works in a couple of weeks, prof Kumar goes by the syllabus so you will probably have to read around 500 pages each week. (Like the odyssey in one week basically)\nHe is also very modest, I've never seen him compliment himself when he obviously is an expert on these works, quoting directly with page numbers almost in each class (impressive?!) \nFor those who don't want to read all the boring sentences above, I'll quickly summarize:\nTAKE. AKASH'S. COURSE.\nTAKE. AKASH'S. COURSE.\nTAKE. AKASH'S. COURSE.\nTAKE. AKASH'S. COURSE.\nOn a side note, for those interested in fashion, he dresses pretty interestingly, I'd say. Interesting as in I'll let you decide if that's good or bad.. \nby the way, to the comment below: I personally paid attention to the way his name was said after reading the comment and it is not \"I don't have any uh..cash\", it is actually \"a-KASH\". as in a british person saying \"Car\" with a \"sh\" instead of \"r\".\nWorkload:\nParticipation 20%, 3 papers (4 pages, 5-6 pages, 7 pages (?)), midterm, final \neach of these have almost equal percentages so no pressure on the final!\n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 21, 2013",
            "review_content": "\nI don't know if Akash still teaches Lit Hum or is even at Columbia anymore, but my rather dismal CC experience this past year has made me really appreciate having had as a Lit Hum instructor ('11-'12). So:\nAkash was pretty laid-back and ran a fairly casual classroom. He did a really good job of getting to know each of us as readers and thinkers, and while he never really forced people to participate, he did a good job of drawing people out by letting them relate the material to their own particular interests and skills. \nDiscussion for the most part stayed lively, focused, interesting, and involved. We probably could have gone deeper into the texts than we did, but the ability to keep everyone engaged book after book is not to be discounted.\nHe was very open to discussing texts/papers/whatever in or out of office hours and was, generally speaking, a very fair grader. I also felt super prepared for the course-wide final.\nMy one complaint would be that he overburdened us with extra reading during the spring semester and the quality of our discussions suffered as a result. But overall, I had a really good experience in his class.\nWorkload:\nFall: occasional reading quizzes, 3 papers (3, 4, and 5 pages), an in-class midterm, and a course-wide final. Spring: same, but the papers were something like 4, 5, and 10 pages, or something.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "November 10, 2012",
            "review_content": "\nOkay, so I had Akash for Lit Hum, and he definitely doesn't deserve a silver nugget. He wasn't very good at facilitating class discussions and for the most part everyone either made unfunny jokes about Don Quixote or stared at each other awkwardly. \nAkash was not a super hard grader but his paper topics were mostly pretty boring. He had some pop quizzes throughout the semester but typically everyone would score at least a check, which he said was \"well into an A.\" His midterms mostly looked like the Lit Hum final except scaled down. Once we had to do a communal essay for our midterm, which was creative but ultimately a failure.\nI guess it was cool that we got a five minute break halfway through each class. Also there was pizza a few times. That was pretty neat.\nBy the way, in case you think his name is pronounce A-KAAAASH, it's not. It's more like uh-cash. As in, \"I don't have any uh...cash.\"\nWorkload:\n3 papers, midterm, general Lit Hum final, general Lit Hum work load.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "August 31, 2012",
            "review_content": "\nIn terms of Lit Hum, I don't think I would give Prof Kumar a silver nugget. He is a decent teacher and knows his stuff, but I don't think he is fantastic at facilitating class discussions. Towards the end of each semester, class would get monotonous and dull --we would start talking about irrelevant things or just repeating ourselves. \nHe does give us pizza parties so that's a plus!\nI did also feel very prepared for the final and midterm. He surprises you with pop quizzes which could be sometimes brutal (especially after spring break). \nWhen it comes to papers, he's generally very accepting about what you write about. But I would not say he is an easy grader nor is he a tough grader. \nWorkload:\nReadings--could get heavy and we complained. 3 papers a semester. For papers he usually alloted enough time. Midterm, Final. We had a group midterm! That was super fun.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 03, 2010",
            "review_content": "\nAkash Kumar was probably the best instructor I had last semester!  He was engaging, lively, and had a great sense of humor to boot.  I went to class wanting to learn something new everyday!  He even set up an event where those interested went to see an opera!  The workload is very doable and the compositions are always very interesting, even for something that only involves 150 words.  He is extremely approachable and willing to work with you if anything comes up.  Overall, he is an amazing instructor who makes Columbia a memorable place to be!  I would highly recommend his class to anyone who wants to learn a new language!\nWorkload:\nWorkbook and Lab Book Assignments every week, Compositions every other week (with two drafts, the grade being the average of the two), a Midterm, and a Final with an Oral Presentation.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 10, 2008",
            "review_content": "\nI LOVED AKASH KUMAR.  It is very easy to feel uncomfortable and embarrassed in an Elementary I language class.  His age (he's only 24) and laid back Hawaiian attitude made me enjoy coming to class.  In fact I wanted to go to that class four days of the week.  He helped us learn in different ways.  He'd hand out worksheets, write on the board, have us engage in dialogue, listen to music, and show pictures of crazy celebrities and ask how they've changed or ask us to describe them (e.g., bald Britney, or Maradona in his prime vs. new, fat Maradona).  Akash speaks close to 10 languages (including Urdu, Arabic, Farsi, etc.), so he really understands what helps when learning a new language.   I was surprised at how much Italian I could understand, read, and speak at the end of one semester.  I would take his Elementary II class again next semester if I could.\nWorkload:\nWorkload is light and follows the same structure as any other class in the Italian department: weekly workbook/lab manual assignments, 150 word compositions every other week (two drafts averaged together for one grade), one 3 minute show-and-tell oral exam at the end, midterm, final\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "February 28, 2008",
            "review_content": "\nProfessor Kumar is not a joy to see four days a week. While he is not strict about attendance, his personality makes one not want to come to class. \nHe is sarcastic and, even though this is an elementary language class, he still feels free to make fun of those still learning the language. \nIn class, he makes us listen to songs for the hell of it and, come test time, the we all were the ones that had to teach ourselves the material. \nAlso, he rarely ever returns work and, when he does, there isn't any constructive criticism. \nFind someone else if you'd like to learn any Italian during the semester. \nWorkload:\nLab manual and Work book activities each week, a quiz ever Tuesday, compositions (usually every other week), a midterm, a final, and a presentation.\n"
        }
    ]
}