{
    "prof_info": [
        {
            "prof_name": "Benjamin Cook",
            "prof_id": 12916,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "The Earth's Climate System",
            "review_date": "June 08, 2014",
            "review_content": "\nProfessor Cook is very organized (he has taught this class a multiple of times previously), very responsive to emails, has excellent downloadable PowerPoint lecture slides (which obviate most needs to take notes) and is very clear in his explanations in class.  I wish there was a weekly recitation (with the TA?) to go over the lectures and ask questions as the professor introduces lots of new material each week. This is not an easy class but it is taught in a very competent manner.\nWorkload:\nThree (not easy) problem sets which one can work on in a group of up to three, one 10-page research (review) paper and one in-class final. There is no textbook assigned for the class, one is dependent on class lecture notes, the live lectures and the TA if needed (the professor is also very responsive to questions via email).  The grading seemed to be both reasonable and fair.\n"
        },
        {
            "course_name": "The Earth's Climate System",
            "review_date": "May 27, 2014",
            "review_content": "\nI took Earth's Climate Systems in the Fall of 2013. I thought the class was well taught and well structured. Professor Cook's slides were a great resource. I definitely feel like I can explain the basic mechanics of climate change to a lay person after taking this class, which was my objective. Professor Cook really cares about his students, readily answers emails, and is very open to meeting one-on-one. I would definitely recommend this class with this professor. \nNote: for someone with a math or science background, this class could have gone a bit more in depth. For someone with a liberal arts background, this class could be difficult for you, but it is still doable with extra time and effort.\nWorkload:\n3-4 problem sets, an in-class final, and a paper.\n"
        },
        {
            "course_name": "The Earth's Climate System",
            "review_date": "May 15, 2014",
            "review_content": "\nProfessor Cook is very organized (he has taught this class a multiple of times previously), very responsive to emails, has excellent downloadable PowerPoint lecture slides (which obviate most needs to take notes) and is very clear in his explanations in class.  I wish there was a weekly recitation (with the TA?) to go over the lectures and ask questions as the professor introduces lots of new material each week. This is not an easy class but it is taught in a very competent manner.\nWorkload:\nThree (not easy) problem sets which one can work on in a group of up to three, one 10-page research (review) paper and one in-class final. There is no textbook assigned for the class, one is dependent on class lecture notes, the live lectures and the TA if needed (the professor is also very responsive to questions via email).  The grading seemed reasonable / fair.\n"
        }
    ]
}