{
    "prof_info": [
        {
            "prof_name": "Maria Murillo",
            "prof_id": 10327,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Latin American Politics",
            "review_date": "January 01, 2014",
            "review_content": "\nLatin American Politics with Professor Murillo was a blast. \nDespite the fact that we were locked up in a windowless basement in Mudd, it was a great class. \nThe lectures were clearly organized and presented, and Professor Murillo was great fun to be around. She really really knows her stuff, and so every lecture was a scramble to write down as much as we possibly could while she zoomed off talking about neoliberal reforms in seven different Latin American countries at once. Every now and then we'd put on a film, all of which were interesting and entertaining. \nThe real star of the class however was the TA Giancarlo, who was really loved by everyone as far as I could tell. He ran a mandatory section once a week which really clarified all of the material. The sections were like classes in themselves, and were straightforward, clear, and really prepared us all for the tests. \nThe work load was manageable. We had something in the region of 50-100 pages of reading a week of generally very dense political science literature - it was amongst the densest I have done for any class, but it was all mostly interesting. There was one 2-page and very straightforward essay, and a midterm and a final, which were also straightforward.\nPay attention to the lectures, and do as many readings as you can. The way to ace this class is just to follow instructions. If you follow the instructions properly for the 2-page paper, you will recieve full marks. If you pay attention in section, you will be able to work out pretty much exactly what will be on the midterm and final, and will be able to prepare accordingly. \nIf you're into comparative politics and/or latin america, and you don't mind the occasional incomprehensibly dense statistical analysis of Argentinian union politics in September of 1953, then you'll be sure to enjoy this class. \nWorkload:\nNot too bad. \nOne very short and easy paper - just follow the instructions and you will get full marks. \nOne midterm with predictable questions based on what Giancarlo focuses on in section\nOne final with similarly predictable questions based on what you do in section. \nI worked moderately hard and got about a 98 which ended up being an A. My study-buddy got a 100 and an A+ for a similar amount of work. Work out what will be on the tests before you take them, and you will get full marks. \n"
        },
        {
            "course_name": "Latin American Politics",
            "review_date": "December 12, 2013",
            "review_content": "\nI noticed that Professor Murillo doesn't have a review on here, so I thought I would add one... \nProfessor Murillo is a fantastic teacher. She is very organized and extremely knowledgeable. She's also very approachable and helpful outside of class. Overall, taking her class was a great experience. \nAt the same time, I think her Latin American Politics class is the kind of class where you get out of it what you put in. I think a lot of people did not really keep up with the reading and were probably still able to do well in the class, by virtue of it generally not being that hard. At the same time, if your goal is to learn a lot about the subject matter, rather than just getting a good grade, I think you can definitely do that in her class, also. So, essentially, I wouldn't be too worried about this class whether I was looking to learn a lot or just get an A. \n\nWorkload:\nshort paper (2 pages), midterm, final, maybe 50 pages per class of readings. Also, watched a lot of really interesting documentaries during class including the Battle of Chile, Cocalero, and a film about the No campaign in Chile. \n"
        }
    ]
}