{
    "prof_info": [
        {
            "prof_name": "Marissa Ambio",
            "prof_id": 2409,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Latin American Humanities I",
            "review_date": "December 16, 2007",
            "review_content": "\nMarissa is a great professor who is extremely dedicated to her teaching, students, and subject matter. This class is not that easy, however. There is an EXTREMELY demanding reading load for this class. Expect 250-500 pages of reading a week on a light reading week.\nHowever, if you are interested in learning about Latin American history, especially the eras of discovery, colonization and independence/ national identity formation, take this class.\nThe professor is extremely kind, knowledgeable and will help you develop skills. However, you just might kill yourself with the reading. It is insane!\nWorkload:\n1 Oral Presentation, 6 Formal Discussion Board Postings (2-3 page mini essays), 2 6 page essays, Midterm and Final, Massive Readings (250-500 pages of readings a week)\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "March 28, 2007",
            "review_content": "\nMarissa is such a sweetheart. She is a wonderful teacher. She gives plenty of interactive exercises to make sure you understand all the concepts and will help you on a one-to-one basis if anything is unclear. I highly reccomend her.\nWorkload:\nHomework every night, quizzes and tests spread throughout the semester\n"
        },
        {
            "course_name": "Elementary I",
            "review_date": "January 16, 2007",
            "review_content": "\nMarissa is kind, energetic and makes learning spanish enjoyable.  iÂ´ve never seen a professor work harder to keep classes varied and entertaining.  almost weekly she involved the whole class in a game that focused either in current grammar or vocabulary.  sheÂ´s strict about make up quizzes and tests, unless you have a valid excuse, in which case sheÂ´s very accomodating.  take her, you will learn a lot and look forward to attending class.\nWorkload:\ndoing the assignments is important, about 30 minutes a night, but itÂ´s not a big issue if online work is late.  \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 08, 2007",
            "review_content": "\nProfesora Garland is great!!!! Enough said!!!!!!!!! If you want to learn spanish with a fun,vibrant, and helpful teacher!!! Look no further........\nWorkload:\nThe homework is very imortant! Do all if possible and also try out the practice tests at Arriba.com they help out immensely when it comes to taking the test.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 08, 2006",
            "review_content": "\nMarissa Garland is the absolute best! I learned more Spanish in one semester than I did in all four years in high school. We played games, held discussions, wrote skits, analyzed a play (Bodas de Sangre) and short story (El Hijo y La Madre) in essay form and class was always fun. She really cares about her students and the material she's teaching. I would suggest visting her during office hours if you don't understand a concept or you just want to reinforce a topic. Marissa makes a 9 AM class enjoyable and fun!\nWorkload:\nHomework assingments every night out of the textbook or workbook(some can seem rather long), 3 or 4 two-page essays, approximately half a dozen quizzes a miderm and a final.\n"
        },
        {
            "course_name": "Spanish 2",
            "review_date": "May 15, 2005",
            "review_content": "\ni love marissa.  she is a great teacher, kind, understanding and this semester she taught me a lot.  ill admit she is harder than most others but she is truly a nice person and really wants to help you.  i recommend this class and her as a teacher\nWorkload:\naverage\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "March 31, 2005",
            "review_content": "\nTake spanish with Marissa, she is awesome!!  I am so glad that I started a new language with such an ethusiastic teacher.  She cares a lot about her students and has their best interests at heart.  She is very patient and is always willing to meet outside of class for extra help.  \nWorkload:\nDaily excercises, 3 compositions, quizzes after each chapter (or two), midterm, and final\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 09, 2005",
            "review_content": "\nAlthough it was a 9 AM class, I absolutely loved it. Marissa kept the class varied and interesting, and I learned a lot more than I would have expected from one semester. I hated missing class because it was so much fun, and woke me up for the rest of the day. \nWorkload:\nDaily assignments online and a few short compositions. It's not too demanding but don't blow it off! \n"
        }
    ]
}