{
    "prof_info": [
        {
            "prof_name": "Robert Smith",
            "prof_id": 201,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "intro to sociology",
            "review_date": "September 01, 2004",
            "review_content": "\nI'm writing to combat the lukewarm reviews of Prof. Smith. I left his class with a great understanding of the impact race, gender and status has on our society. It was an eye-opening experience. As far as the course goes, yes, the first half is mainly theoretical, but it has to be, in order to lay the foundation for the second half: application of that theory via the life-story of the struggling individual. \nProf Smith is down to earth and approachable. He understands the student mentality. He KNOWS you aren't gonna do most of the readings and he hones in on the major points in class. What's important to Prof. Smith is not the content of his syllabus, but the ideas that can be drawn from it -- ideas that speak volumes about the human condition.\nOne more thing: to those who say he has \"chicken-scratch for handwriting\"-  that may be true, but he speaks articulately enough that you don't have to rely on his short-hand. Just pay attention and you'll be fine.\nThis class is a basic and thorough introduction to sociology. If that's what you're looking for, I reccomend you take it.  \nWorkload:\nmidtern, final and a really interesting paper assignment. - a sociological autobiography that uses ideas you learned in class to explain your own upbringing and cirumstances. Beware though. The paper is graded by a highly subjective TA. Even if you ace both exams, she can ruthlessly lower your overall grade. \n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "May 28, 2004",
            "review_content": "\nI feel really bad giving Smith a bad review, because he's such a nice guy, and his laughter is infectious. He's quite pleasant and tries to keep the class interested by cracking jokes... but unfortunately, the jokes can only go so far. Half the class stopped going around february/march (including myself) because the man just can't teach. His handwriting is horrible and he meanders around for the whole lecture, actually soliciting the class what they would like to talk about.... inappropriate!! He takes questions from the audience and tries to learn names... just teach the goddamn stuff and there would be less questions!! In any case, it's the easiest class ever. The first half really really sucks (i got a C+ on the midterm) but the end is easy and a good opportunity to up your grade. You can easily improve over the semester and be rewarded for it.\nWorkload:\nSO easy:  1 3-5 page paper, midterm and final. Study the night before and have the TA learn your name, and you'll be all set. Also, def attend the review sessions - they help a lot.\n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "May 28, 2004",
            "review_content": "\nI feel really bad giving Smith a bad review, because he's such a nice guy, and his laughter is infectious. He's quite pleasant and tries to keep the class interested by cracking jokes... but unfortunately, the jokes can only go so far. Half the class stopped going around february/march (including myself) because the man just can't teach. His handwriting is horrible and he meanders around for the whole lecture, actually soliciting the class what they would like to talk about.... inappropriate!! He takes questions from the audience and tries to learn names... just teach the goddamn stuff and there would be less questions!! In any case, it's the easiest class ever. The first half really really sucks (i got a C+ on the midterm) but the end is easy and a good opportunity to up your grade. You can easily improve over the semester and be rewarded for it.\nWorkload:\nSO easy:  1 3-5 page paper, midterm and final. Study the night before and have the TA learn your name, and you'll be all set. Also, def attend the review sessions - they help a lot.\n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "November 09, 2003",
            "review_content": "\nI found Smith to be intelligent and engaging.  He has an extraordinary nack for phrasing his ideas perfectly-- concise and clear.  I am planning on taking his Immigrant Experiences class, also.  While it is true that you have to do the readings in order to follow the class, the readings are basic texts that have been useful to me in the two years since I took his lecture.  Also, he took the time to learn my name (in a class of 250!) and answer my questions fully.\nWorkload:\n1 midterm, 1 final, 1 (10 page) paper-  absolutely managable\n"
        },
        {
            "course_name": "Immigrant Experiences, Old and New",
            "review_date": "June 09, 2003",
            "review_content": "\nGoing into this class, I'd expected a dull survey of 19th century immigration; you know the stuff:  potato famine, Ellis Island, tenements, etc.  What I found, however,  was an incredibly engaging, fresh, relevent and contemporary curriculum, taught by the most dynamic and brilliant professor I've encountered in my undergraduate career.  Rob Smith managed to make a 100 student lecture feel like a 10 student seminar, constantly engaging the class in dialogue about the readings, about the world we observed in the city around us, and about our own lives.   In addition to his dynamism at the leturn, Rob Smith is also a dedicated activitst and advocate for Latino migrants in the United States.  In other words, Rob Smith talks the talk, walks the walk, and does it all in an incredibly eloquent and engaging manner.  I'd recommend this class to ANYBODY, whether you're a social science major or just somebody looking to fulfill a few requirements (like myself)!\nWorkload:\nThere is a lot of reading, but Rob Smith was flexible about the syllabus, recalling his own days as an undergrad and adjusting and rearranging the assignments based on our communal stress level. \n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "January 24, 2003",
            "review_content": "\nAWFUL. DO NOT TAKE THIS CLASS. Smith seems to have a following of 20-30 barnard students who think he's cute and lap up his stories about his kids like he was a standup comic (and the guy really isn't funny at all).  The course essentially covers two topics - Mexican Immigration and Caribbean Immigration - and beats them into a million different possible models, with no real conclusions.  In all honesty, this class is best suited for people who are looking to learn some intersting facts and not be forced to think about them in any interesting (or, more importantly, conclusive) way.  Smith does not even remotely follow the syllabus, gives pointless exams, and tends to hand out assignments riddled with grammatical errors. Truly unprofessional.  Grading is completely random.  Unapproachable outside of class.  Big mistake.\nWorkload:\nPaper, midterm, final.  Can you memorize author's theories? Does that excite you? Because that's basically what the class boils down to. Blech.\n"
        },
        {
            "course_name": "W3247 The Immigrant Experience, Old and New",
            "review_date": "December 19, 2002",
            "review_content": "\nWhere do I start?  Well, for starters, this was a great class, and Smith is a rare gem if a little goofy (he often opens class by telling stories about what his two sons did the night before).  However, the class I took was called \"Immigrant Experience: Old and New\" but it should have been titled \"Transnationalization of Race and Ethnicity.\"  In other words, the course title is a total misnomer.  The lectures and readings were all about assimilation theory and immigrants' reactions to their own identity formation.  This would be my major complaint.  I was expecting a broader history of the immigrant experience.  My other reserved complaints concern the (dis)organization of class readings and the syllabus.  It was a little guerilla style, with Smith emailing the class the night before saying what it needs to read for the next day.  Above all: great guy, great (if pretty easy) class, and relaxed environment.  Take him in any class if you can.\nWorkload:\nIn-class midterm, 10-page paper, In-class final (so do-able)\n"
        },
        {
            "course_name": "Introduction to Sociology (Barnard)",
            "review_date": "December 16, 2002",
            "review_content": "\nWhat a piece of shit.  Sure he's personable, but he's an asshole outside of class.  There was only one paper which he never returned, and the midterm and final were jokes.  Easy as shit and I learned nothing.  I retook the class as Sociological Imagination under Polletta.  I suggest you do the same.\nWorkload:\neasy as shit midterm and final...one paper that takes one night to do...easy\n"
        },
        {
            "course_name": "intro to sociology",
            "review_date": "August 15, 2002",
            "review_content": "\ngood prof. but random and horrible chicken scratch for handwritting. mixed feelings. took his immigrant experience class and loved it. this class was not so great. he was less approachable about pre-final draft papers and helping you go over it. still talked just as fast. sometimes hard to keep up but he keeps it interesting and funny. do not be scared by the books. don't have to read. (except for ur paper)BUT KEEP IN MIND IF YOU DON'T READ IT'LL BE HARDER TO KEEP UP DURING LECTURES ! as in he slurrs readings together. so you won't know who said what. pay good attention in class for terms. drop them during the exams. instant b+\nWorkload:\none paper, midterm, final (non-cumulative)\n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "April 03, 2002",
            "review_content": "\nI want to say that my experience within professor smith's class was truly memorable. he is thoughtful and charming, committed and brilliant, and absolutely devoted to the lost art of instruction. professor smith actually gives a damn about his students. yes, he speaks lovingly about his family and yes, he can be comedic during his lectures, but that is what makes him so approachable; so passionate. he has never forgotten what it is like to be a student; to be overworked; to be half awake because you were studying late the night before or not! he is forgiving. he is always accessible to his students. that all said, if you are in his class to just get an A minus effort than drop out. for that matter drop out of columbia. a columbia education doesn't come cheap, you have to work for it and if your looking for an excellent course with an instructor who will leave you with more than a syllabus, than i recommend any class taught by professor smith. \nWorkload:\nthe course workload is heavy on readings, but combined with his lectures, witticisms and fascinating insights, it seems lighter . a midterm, short paper and a final.\n"
        },
        {
            "course_name": "W3247 The Immigrant Experience, Old and New",
            "review_date": "February 10, 2002",
            "review_content": "\nNice guy. interesting professor. cute kids. Only problem is he talks fast when he lectures. If you haven't read the reading before the class, be warned... he slurs the authors he discusses together. You'll be confused. but you'll eventually sort things out. He's a nice grader. Not necessarily an easy grader, but he'll give you some leeway if your grades improve or if you try hard. Remember key phrases he says- bring them up in the exam and you'll do fine. If you ask in advance he will read your paper and help correct it before you turn it in for the final deadline.\nWorkload:\none paper, midterm, final exam (both essays)\n"
        },
        {
            "course_name": "W3247 The Immigrant Experience, Old and New",
            "review_date": "November 15, 2001",
            "review_content": "\nWhoever said that this guy grades generously was obviously on crack. He's a really nice person- and funny too, but after a while, his obsession with his son can become extremely irritating. His grading policy sucks- or maybe its his two TAs. I don't know. That being said, Prof. Smith is always accessible and approachable. I think that if you're really in love with sociology, go ahead and take this interesting course. Just beware of his fucked up grading policy. Don't expect this to be like other easy A's sociology courses. If you take it, enjoy- because he is amusing and the course material is very...well, for lack of a better word, interesting. You will definitely learn in this class.\nWorkload:\nOne paper (which he will forget about and suddenly demand from you), a midterm, and a final, all essay based.\n"
        },
        {
            "course_name": "BC1003 Introductory Sociology",
            "review_date": "December 31, 1999",
            "review_content": "\nDon't let the phonebook thickness of the reading list scare you off; only the selections mentioned in class are musts. Class format has a little for everybody: some lecture, followed by Q & A in which you the viewer get to participate. Pedagogy can be halted entirely with strategically timed questions about his son, which can be frustrating for the well-intentioned or a dream for those seeking painless cures for distribution requirements.\nWorkload:\n2-3 midterms and a final exam, all essay-based. Generous grading.\n"
        }
    ]
}