{
    "prof_info": [
        {
            "prof_name": "Jose Sanchez",
            "prof_id": 1437,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "September 02, 2011",
            "review_content": "\nThis professor is extremely rude, has a big ego and is disrespectful to his students, impatient, and possibly worst of all, boring. He mainly teaches modeling courses and I am reviewing his teaching for the infamous Gateway. \nHis courses involve computer modeling, so most of the time he has his computer connected to a screen and then simply sits there clicking things and telling you to click things, which naturally, accomplishes nothing. The classes were extremely boring so naturally, people dozed off or left all together since he does the exact same thing in a podcast. However, when he notices that people don't come, he takes attendance and becomes very agitated and angry and starts threatening students. During midterms week, a lot of people left and he got so angry he gave zeroes for their homework assignments, something not noted in the syllabus. So he is inflexible, can't teach, and unfair. Also, when people actually do pay attention and ask him questions, he insults them and makes thinly veiled comments about their intelligence, and in one class, even their sexuality (\"Are you two holding hands down there or something? Keep bouncing and holding hands and i'll kick you out!\"- The people at fault were simply talking.)\nIn summary- avoid this guy at all costs. If you don't want to end up feeling degraded and insulted and learning nothing, avoid him like the plague and hope you don't have any requirements that he solely teaches.\nWorkload:\nNot that bad, though the podcasts are a real grind and you can't speed them up. Also if you don't have the software or a fast computer to run the modeling programs, you're going to be going into an engineering library/computer lab to do the assignments, which is a pain. Tests are not that hard though you can be squeezed for time.\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "December 25, 2010",
            "review_content": "\nI am prepared for a lot of disagrees on this. Gateway WAS NOT THAT BAD. In fact, I could go so far as to say that I liked Gateway. I do agree that this positive turn of events was almost entirely due to the fact that I had a good group. Yeah sure, we had a couple members of our group that didn't do their share, but really Gateway was way less painful that most people make it out to be. Honestly, you can make as much or as little of it as you want. You can go through Gateway bitching about how dumb it is, or you can suck it up and just do the BS. Yes, I agree that Gateway is BS, but at some level that's how the world is. Binding our reports and making them look \"professional\" may sound useless, but there is something to be said for making kids go through the motions of doing it.\nThis year, we were given the option of making a prototype. But the people so-called \"running\" gateway have no sense of communication. Thus, although at first it was required to build a prototype, they never told the mech-e lab that suddenly 200 students were going to need to use the tools and instead it was made \"optional\". \nThe Design Fundamentals Exam was stupid. The questions were either ambiguous or idiotic (Teamwork starts with who? A. your group B. your team leader C. your friends D. you E. all of the above). The modeling exam was fine, as long as you actually understood the basics behind modeling and don't just follow the videos blindly. \nThe modeling assignments were pretty useless (read: engineers don't use Maya), but fun. You don't have to listen to Jose, however. Only a small component of what he says during the modeling lecture doesn't show up on the video. Go ahead and sleep. You will not be the only one, and Jose doesn't care.\nThat is actually one thing that I appreciated about Gateway. All the instructors understood the college dynamic. The two midterm presentations were due at 1AM and the final was due at 6AM, and trust me, a lot of groups needed that time. The part I don't appreciate is that they are withholding our final grades under the excuse that we have to get them at a \"normal\" time in comparison to our other classes. \nOh and, I never saw McGourty in class. Not once. Not even for the final presentation. \nWorkload:\nA lot. But not as painful as you might think. Make sure you budget your time. The presentations are best done over a couple weekends, not the last one. But as long as you put the work in, you should get a good grade. Our presentations scored over 95 every time. \n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "December 09, 2009",
            "review_content": "\nGateway Lab is a required course for all first-year students in SEAS. Unfortunately, although the actual concept of exposing students to real community partners and having them participate in real projects is a good one, the overall execution of the class is rather poor. This is mostly due to the core components that the course is composed of. Your grade in the course depends on many factors that are beyond your own control and are based on pure luck.\nThese factors are: (1) Your group members (2) The project you are assigned (3) Your advisor\n(1)If you are in a decent group with hard-working members, then you should do pretty well on the group component of the class, which is worth 55% of your grade. If you have bad teammates, well, there's a good chance that they won't put effort into their parts of the assignments, you might submit things late, and your whole team suffers.\n(2) Even if you have a good team, though, you might still have a tough time if you have a terrible project. A terrible project could be something totally useless or an extremely complex one. However, a good team should be able to make some BS up and still do well on the assignments.\n(3) Your group advisor is the one who grades all of your team's assignments. If you're lucky your group will have an easy-grading advisor who is not picky at all and hands out high grades like nothing. But, there's a chance you can get an advisor who just likes to take off points for the smallest things even though the rest of the assignment is great. The small amount of points you lose each time will add up in the end.\nAs for Jack, he's a very interesting man. When he's giving lectures, he gives off a strong vibe that yells \"pretentious\". People seem to abhor him, but it doesn't really matter, considering he's not present 80% of the time and he determines no part of your grade. Be more worried about who your advisor is.\nJose gives all the modeling lectures. There's 7 modeling assignments worth 20 points each, and a modeling midterm worth 100 points, totaling to 24% of your grade. The modeling lectures are often fast-paced, so you should try and pay attention if you're not naturally skilled at modeling programs. In later assignments, you will not receive instructions, and are basically left on your own to figure out how to do them. There will always be people that understand everything, so if you're not one of them, just hope you have some nice classmates willing to help you.  Jose is decent; the only part of the modeling I disliked was when there was parts of assignments that were not even covered in class that he expected us to do. For the most part, though, this aspect of the class is manageable. The modeling midterm is pretty fair and tests you on the basic skills you've learned in the lectures.\nThe newest addition to Gateway this year was the Design Fundamentals Midterm, worth 100 points, which was based on the Dieter book and the Team Developer books that nobody ever read. This test is in no way an indicator of how good of an engineer you are, but rather how well you memorize silly things like the \"Four C's of Design\" and the \"Four Stages of Team Development.\" If you can memorize things easily, you should do pretty well on the test. There's no way of BSing your way through it, either. If you don't know your stuff, you'll probably end up with a 50 or worse.\nThe last 110 points are basically free points that everybody should get. Don't be an idiot and not do one of the weekly reflections, or not go to the required amount of Friday sessions. \nThese are the only points in the whole class that you're guaranteed, so take advantage of them.\nThe last part I forgot to mention, but is widely known, is that there is no curve in this class. So don't be happy if all your classmates are doing crappily, because then you'll all just get bad grades together. If you get 929/1000, you still get an A-. Tough luck, as they say. \nIf you're lucky, you'll escape the class with a good grade. Good luck!\n\nWorkload:\nManageable. Not as bad as they say. \n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "September 16, 2009",
            "review_content": "\nThe best way to approach Gateway is to think of it as a lottery. Why Columbia would choose to make a lottery the centerpiece of its engineering curriculum is a fascinating question, and the less you think about it the happier you will be. But here's the deal:\nADVISERS: This part of the lottery would actually be fun if on the first day of class, a scantily-clad Jose Sanchez picked each group's advisers, raffle-style, out of a rotating drum. Unfortunately, they are assigned in advance. None of the advisers gives a shit about your project, but this apathy manifests itself one of two ways:\n1. Your adviser doesn't care about the class, so he rubber-stamps all your design journals 30/30 and doesn't bother offering constructive criticism.\n2. Your adviser doesn't care about the class, so he has no qualms about taking five points off for every misplaced apostrophe without bothering to offer any constructive criticism.\nThis is the person that determines 50% of your grade. Nothing you do will change his opinion of your project.\nGROUP: Probably the most important part. It is very nearly a law of nature that in any Gateway group, two students will be incapable of reading English and two students (usually not the same) will be incapable of writing it. (Not, by the way, a complaint about the number of international students in SEAS, most of whom received better writing instruction than we blue-blooded Americans). This is not itself a problem as long as people are willing to work, but be prepared to spend more time copy-editing than you do designing. Thankfully...\nDESIGN: Your design does not matter. It will never be built. Nobody will ever use it. If this class were about designing new things nobody would ever be asked to create things like backpacks and tables for which perfectly good commercial solutions exist. Accordingly, the first question on your mind throughout the design process should never be \"does this design meet the customer's needs?\", but rather \"can I make this look good in Maya?\". A few really killer renderings can salvage the most hopeless of presentations.\nI'm not entirely sure why I attached Jose and Jack to this review; the truth is that there is absolutely no instruction in this course. Granted, Jack has been known to give an occasional lecture (in a dynamic, task-oriented, synergistic fashion), but these are entirely devoid of content. Your time during the modeling lectures is better spent just following the printed instruction than attempting to decipher Jose's arcane mumblings about fourth-order Bezier curves and fuselage design.\nSince you won't need all the time in lecture to do the modeling assignments, it's worth spending a little while just playing around in Maya. This, more than anything else, will help you prepare for the modeling exam and for your final report.\nJust remember -- this school has a good engineering program but some unfortunate requirements. It only gets better from here.\nWorkload:\nRanges from nonexistent to soul-destroying, depending on the day of the week, phase of the moon and your housing lottery number.\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "July 23, 2008",
            "review_content": "\nJose knows his stuff!  He is very excellent at graphic design and is very knowledgeable for current computer technology.\nHe is not that great of a professor/lecturer when it comes to Gateway Lab though!  He teaches the class like he is either really bored or he wants to show off.  He races through modelling examples so you will often rely on your own mistakes or the tutorials.  He is very helpful though as long as you are in attention during his lectures and understand his humour.\nThe modelling assignments are pretty easy in the beginning but then it just becomes difficult (and not progressively).  The later ones took hours to complete and Jose is one of the hardest professors I know to get in contact with outside of the classroom.  Major points are taken off of modelling assignments for ridiculous reasons like incorrect file names.\nHis final design for the class varies in difficult for all Gateway classes but is relatively easy if you have been doing all the modelling assignments without the tutorials.\nAll in all, I wish that SEAS hired a new instructor for the modelling portion of this class.  Jose makes modelling lectures seem like you are already familiar with all the software.\nWorkload:\nweekly modelling assignments that could take you anywhere from a hour to do to five hours; final modelling assignment with a whole class period to complete it\n"
        },
        {
            "course_name": "Engineering Graphics",
            "review_date": "January 14, 2007",
            "review_content": "\nJose is a great guy and a lot of fun to talk to. He's always willing to help and has a calmer, relaxed demeanor that reduces any kind of stress about problems you might have with the assignments. \nThe class is pretty straightforward and simple. An assignment every week that you complete during class time, a midter project, and a final project. Though it is listed as a 3-4 hour class, I would routinely finish my weekly assignment after about 2 hours. Put a good effort into the midterm and final and you'll be fine. Maybe the easiest 3 credits I've ever gotten.\nWorkload:\na weekly assignment to be done during class (~10%)a midterm modeling project (~30%)a final modeling project (~60%)\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "March 07, 2006",
            "review_content": "\nThe problem is not that Jose doesn't know Maya--because he knows more about it than anyone I've ever met--the problem is getting Jose to share his knowledge.  He does not lecture at all and usually just watches students complete the assignment (with instructions, thankfully) that he has posted online.  While most of the work is straightforward, it can be quite tedious if you have never worked with the Maya software before.  Usually, one of the TA's will walk around and patronize you for not knowing the basics of Maya, that surely EVERYONE must know.  If you are lucky, you will get the honor of receiving this smirking and condescension from Jose himself.  Most times they will rattle off some confusing directions, though they will occasionally stop to watch you struggle.\nUnfortunately, Maya plays a large part in most team's final project deliverable.  It is necessary to learn for gateway and it is fairly time consuming.  Don't blow it off (come to think of it, you will probably need Matlab as an upperclassman as well) because it is important.  When Jose actually does instruct the class, get off facebook and pay attention because it is something you will need for the assignment.  While Jose is not helpful in class, he is less smug outside of class.  In any event, Alex is definitely the one to seek for help with a project (Jack has very limited interaction, and Alex is almost as proficient as Jose in Maya).\n\nWorkload:\nWorkload: One assignment per week with multiple steps, sometimes time consuming.  Occasionally you will learn these steps in class, most times you will have to use trial and error outside of class, though it depends largely on your familiarity with computers and Maya.\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "May 03, 2005",
            "review_content": "\nJose's knowledge of Maya is rivaled only by his arrogance about it. I aced the class mostly by maintaining a pulse for the duration of his lectures. If you've never worked with computer graphics, just follow the online tutorials and don't bother listening to his endless droning. The tutorials practically tell you where each button is on the screen, so his rambling will only get in the way. If you have worked with graphics, you can think of his lectures as a gift of naptime, straight from McGourty to you. \nWorkload:\nEntirely possible to complete the 6 HWs in 3 sittings. If you're too lazy for that, just come to class and do the tutorials as he \"teaches\" them. \n"
        },
        {
            "course_name": "Engineering Graphics",
            "review_date": "November 18, 2004",
            "review_content": "\nThe class is very easy, and you can leave once you're done with the assignment. If you're good with computers, this class is a breeze. Put a few hours into the projects and you got yourself an A. \nHe does have a little bit of an accent, and he does tease people. Just don't take him too seriously and won't be offended. The TA's are always willing to help, but they get swamped the day before the project is due- if you need help, go early.\nWorkload:\nIn-class exercises (very easy, just do them and you get points), midterm project, and final project.\n"
        },
        {
            "course_name": "Engineering Graphics",
            "review_date": "November 29, 2003",
            "review_content": "\nTake this class! Especially if you need it for any reason...Jose is awesome--at first he seems a little intimidating, but he's completely harmless and if you actually talk to him he's very cool and nice. \nWorkload:\n4 hour class, once a week but you will almost always be able to leave after 2 hours---no out of class work except a midterm project and final project that you can get done the day it's due. Jose is a very nice grader so if you make a nice design and follow what he wants, he definitely won't hesitate to give you an A\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "November 17, 2003",
            "review_content": "\nHe goes through the demonstrations very quickly, and if you fall behind, god have mercy on your soul, it will be impossible to catch up.  If your good with computers and you've worked with computer graphics you'll be fine, and he'll be friendly with you.  If you dont have experience, you'll simply think  he's an ass because he'll talk to you in a very demeaning manner.\nWorkload:\nJust assignments that are done during class\n"
        },
        {
            "course_name": "Engineering Graphics",
            "review_date": "May 19, 2003",
            "review_content": "\nHis lectures are very helpful.  Make sure you go to them and take good notes because otherwise you can't learn it anywhere else. Grading is very easy so don't worry, most likely you'll get A range.  He's got some jokes at times, but no one ever understands them....\nWorkload:\n2 projects. Make sure to start early if you want the A+, it'll take longer than you thought it'd take.\n"
        },
        {
            "course_name": "Art of Engineering (Gateway Lab)",
            "review_date": "January 16, 2003",
            "review_content": "\nJose is very skillful with the graphics and design programs he teaches, but his communication abilities often leave something to be desired. He has a bit of an accent, which would be all right except he also sort of mumbles in that way that people who work with computers alot always seem to do. He also has a bad habit of refusing to answer student questions and referring them instead to online tutorials that are often confusing or incomplete. And while Jose is usually very willing to teach extra tools to students who are doing well, he can be very sarcastic towards students having a hard time.\nWorkload:\nVery minimal most of the year, however the group project due at the end starts to catch up on you the last week or two of the semester, so be prepared to spend a few late nights with your partners.\n"
        }
    ]
}