{
    "prof_info": [
        {
            "prof_name": "Alexander Tzagoloff",
            "prof_id": 3133,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Project Lab: Molecular Genetics",
            "review_date": "January 21, 2008",
            "review_content": "\nProf. Tzagoloff is a nice guy and very laid back. As the other reviewer stated, this lab is 4 hours long twice a week, but the time goes by  quickly because you are spending it doing the experiment that he assigned your specific group. Each group consists of 2 people with a total of 6 groups. The first half of the semester is spent learning basic lab technique while the second half is spent performing the experiment he assigned you. It helps if you have had previous lab experience because he takes a lot for granted. After giving a short lecture at the beginning of the class each day, he was prone to disappear for hours on end - sometimes, he didn't come back at all. If you do not understand what is going on for that day then hope your partner or another group knows because otherwise you are screwed; this lead to some entertaining times in the lab. \nAt the end of the semester, only one of the 6 groups actually finished their assigned project. It is the effort that counts. An A is easily within reach. I got an A with little chemistry lab experience. Take this class if you are a biochemistry/biology major to fulfill your lab requirement because it beats any other project lab hands down. No lab report is needed! \nWorkload:\nvery light for a 5 point class. We never actually knew how he was grading us. He wanted us to turn in a notebook with all of our lab notes at the end of the semester. Be thorough!  \n"
        },
        {
            "course_name": "Project Lab: Molecular Genetics",
            "review_date": "January 08, 2007",
            "review_content": "\nAt first an 8 hour a week lab sounds scary.  But when you realize that there is no work outside of class, it gets a lot better.  Really, no work.  You just needed to know what was going on in lab, do your experiment, take clear notes on everything you do and submit your lab notebook at the end.  The TA was also really helpful.  And Prof. Tzagoloff is a good guy.  He's chilled out and understands that people aren't perfect and will sometimes make mistakes.  That is very important for a lab instructor.\n"
        }
    ]
}