{
    "prof_info": [
        {
            "prof_name": "Tim Cross",
            "prof_id": 2702,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Science and Technology in Urban Environments",
            "review_date": "January 11, 2006",
            "review_content": "\nWhile Prof. Cross is pretty easy going, the course was very confusing. The Syllabus and agenda constantly changed. We didn't get our papers back for a long time and the feedback was very aloof. Even the final review questions and the actual final came late. Overall, the course was very disorganized and only picked up (to the calible of C.U. courses) when Prof. McGorty or the guest speakers came in to speak. Most of the time the lectures didn't seem to go anywhere, were loaded with extraneous details and didn't have much to do with our projects or exams.\n\nWorkload:\nA bit much: a long paper, and presentation was required in addition to a midterm and final. A lot of readings were assigned, but very little of it really mattered for the midterm or final.\n"
        },
        {
            "course_name": "Science and Technology in Urban Environments",
            "review_date": "December 13, 2005",
            "review_content": "\n(Note: This class was co-taught with Jack McGourty)\nTim Cross is a nice guy. So nice, in fact, that I think he let a lot of people get away with more than other professors would. But as a teacher, I really liked him. He goes out of his way to help you out, and he's very enthusiastic about the subject matter.\nHowever, this was a new class, and there were a lot of problems with it that MUST be fixed in order for this to be a successful, CU-caliber course. The class was very disorganized and we spent way too much class time just trying to figure out what we would be doing next. The syllabus changed roughly four times throughout the semester. Also, the project with Gateway lab was confusing in that it wasn't clear what our role in it was. For a good deal of the semester not too many people showed up because they figured they could just get the lectures of Courseworks anyway.\nBut as for Tim, he's a good guy, and he knows his stuff. You can tell that he wants you to do well in his class (which, to be fair, was pretty easy). It's too bad more professors can't be as genuine and easygoing as he is. Sure, his lecture style might make you drowsy now and again, but I think Tim's a pretty good teacher.\nWorkload:\nSome easy papers, easy midterm, take-home final! Lots of reading, but you don't have to do it all.\n"
        }
    ]
}