{
    "prof_info": [
        {
            "prof_name": "Marianne Giordani",
            "prof_id": 3085,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Aethestics of the imagination 18th century poetry",
            "review_date": "June 28, 2010",
            "review_content": "\nAgreed, this is one of the best courses I've taken at Columbia so far. Prof. Giordani seems like someone who's stepped right out of the 18th century- the readings she gives are critically insightful, but also shed light on the emotional and spiritual elements of these works. she made the coursework-which could easily seem intimidating, highbrow, and inaccessible--deeply personal. \nGiordani clearly loves to lecture, and the small size of most of her classes means that she can give a lot of individual guidance to her students--helpful, as most in the class hadn't read these authors before. the material can be difficult, but she's happy to help you along the way. \nWorkload:\ntwo papers of 6-8 p, a few ungraded responses of 1-2 p through the semester, a final \n"
        },
        {
            "course_name": "Aethestics of the imagination 18th century poetry",
            "review_date": "April 15, 2010",
            "review_content": "\nThe semester's not quite over, but I feel compelled to leave a review, since it's registration time... Suffice it to say, Professor Giordani is AMAZING. She is completely brilliant, chooses great poems and background texts, and gives wonderful lectures. She is honestly one of my favorite professors at Columbia, and this course was fantastic; you get to read so many poets you would probably never find out about otherwise. You also get to talk about spleen and melancholy and, of course, imagination (three fascinating topics).\nAlso, Professor Giordani is generally a really wonderful woman. Her lectures are often genuinely funny and always insightful, and she provides great biographical anecdotes about the poets we read. Prof. Giordani makes them come to life as people--not just as revered poets, and you really gain a sense of their own philosophies and poetic choices.  \nFinally, she's a great role model for anyone interested in academia. She really cares about her students and presents an engaging and wonderful course. Definitely take a class with her if you get a chance!\nWorkload:\nCompletely worthwhile - usually a few poems OR a philosophical work on imagination for each class, a few 1 - 2 page responses during the semester, 2 papers, and a final\n"
        },
        {
            "course_name": "Aethestics of the imagination 18th century poetry",
            "review_date": "February 17, 2008",
            "review_content": "\nThis class was fascinating but not an easy ride. She is brilliant and her insights are often beyond the average grasp, but if you push you can gather a tremendous amount from her. She will help you in one on one if you want and she is a fair grader.\nProvides a good overview of the period historically.\nWorkload:\nNot too bad,some ungraded responses that let you get a sense of where you are.\n"
        },
        {
            "course_name": "William Blake",
            "review_date": "December 19, 2006",
            "review_content": "\nTERRIBLE.  There are no words to describe the pain that was this class.  A better title for this course would be \"NOT-Blake,\" since we spent the majority of class time talking about things completely unrelated to the course material for some inexplicable reason.  I was bored out of my mind and wanted to shoot myself every minute I spent in this seminar.  So did everybody else, except for one annoyingly enthusiastic sophomore.  Save yourself now and do not register for anything with this professor.  You will thank me.\nWorkload:\n1 short paper (4-5), 1 presentation, 1 long paper (10-15)\n"
        }
    ]
}