{
    "prof_info": [
        {
            "prof_name": "Andrew Cole",
            "prof_id": 13100,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanics",
            "review_date": "April 01, 2015",
            "review_content": "\nI'm aware that almost everyone who takes this course is required to do so, but if you have any choice at all, stay far away. Take the course in another department if you can. Plan your four years at Columbia so that you never have to take this course.\nThis was hands down one of the worst courses I've ever taken at Columbia, which is sad because the subject matter is important for anyone interested in physics or engineering. Cole goes through each lecture at such a ridiculous pace that it is actually impossible to follow what he's saying in class. Most professors, when covering difficult material, make it a point to repeat important points more than once or tie the end of their argument back to the beginning, but Cole doesn't do any of this. To emphasise this contrast, another professor once substituted for Cole and the material during that lecture was perfectly comprehensible. The only option you have left is to copy down what Cole writes on the board and try to decipher it later, which is extremely difficult if not impossible for most people to do.\nThis brings me to the other sources of frustration in this class, homeworks and exams. Problem sets often take days to finish in groups. They are almost impossible to do alone. Worst of all, the problem sets do not actually test your understanding of the material and instead seem to be an assessment of whether you can find which textbook or website Cole has pulled the problems from so that you can search for the solutions. (Occasionally Cole writes his own problems which are even more painful to solve.) I cannot emphasise this enough: the homeworks in no way add to your understanding of the material. Anyone who has taken a physics course knows that you can't have a good grasp of the subject unless you've solved many problems and really understood how concepts can be applied to solve problems. The problem sets achieve none of this.\nExams do not necessarily test the material that has been covered in class. Quite frankly, considering the amount of real learning that happens in this class, it would be a surprise if they did. You normally end up using whatever you remember from intro physics courses in an attempt to solve the problems.\nCole also tends to get frustrated quickly when people ask questions and do not understand his answers. This course is a waste of tuition money and Columbia would do well to refund everybody who took it.\nWorkload:\nHeavy\nLong problem sets due almost every week\nOne midterm and a final\nGrading might be fair if any of the material were taught properly\n"
        }
    ]
}