{
    "prof_info": [
        {
            "prof_name": "Melissa Schwartzberg",
            "prof_id": 3141,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 24, 2013",
            "review_content": "\nDisregard the other reviews. The first day of class she said she was \"turning over a new leaf.\" I don't know how she was before, but I have a hard time believing the claims that she was \"the worst professor\" someone ever had. Professor Schwartzberg, it is true, is tough. But she is a fair grader, and she really wants you to do well. I could have had a CC professor I could bullshit to, and consequently learn nothing. But she knows her shit, and it's worth making the effort - she was open to our own ideas, was receptive to our interests, encouraged us to come to her during office hours and was genuinely engaging in class. At the end of the semester, she invited the whole class to her apartment for breakfast. FYI the cats bite, but her kids are really cute. Very sad she couldn't take us on this semester.\nWorkload:\nDo the reading, or at least most of it. Speak in class. Three 5-7 page papers, one midterm and a final. She grades the first paper harsher than the other two, but it's weighted accordingly.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2010",
            "review_content": "\nShe's a tough grader but she has fairly consistent standards. If you engage the material with an honest effort you'll be fine.  I take exception to previous reviewers' assertion that she forces her interpretation on everything.  Students can challenge that interpretation if they have a decent understanding of the material and have read it, which let's be honest, most people do not.  Apparently people expect her to take seriously the half-assed sparknotes garbage people routinely throw around in Lit Hum or their unoriginal, poorly developed theories about race, gender and class.  She may not agree with you but she'll engage in good faith if you have actual evidence from the text to support your arguments.  \nShe does view everything in terms of political theory, which may bother some students.  But for 80% of what you read in CC I think it's appropriate and legitimate. This is not a class for you if you want an easy A, but if you're legitimately interested in the material and have an interest in theories of politics, go ahead. \nWorkload:\nThree 8 page essays, midterm and final.  She'll nitpick so make sure you only write on authors you really understand.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 26, 2010",
            "review_content": "\nAgree completely with the previous comment. Schwartzberg is one of, if not the, worst professors I've ever had at Columbia thus far. Detached from class and intensely focused on her own interpretations of the text, she makes classes a lock-in of tension and intellectual asphyxiation. She clearly takes a liking to those whose opinions chime with hers, usually calling on them and only them, and responds indifferently, if not coldly, to other opinions.  Overly and unnecessarily intense workload, which always seemed to lead to some discussion about political theory (even with the BIble?).  She seemed fair and approachable one-on=one sometimes, however her presence in the class was usually one of frenzied insistence and the need to race through the text, having to take her word as definition. Strange and rather hard grading on papers and midterms, with minimal explanation as to why. Altogether a puzzling and discouraging experience to what should be a seminal Columbia cornerstone.\nWorkload:\n3 8-10 page papers, One in class midterm (IDs and essay) and Final (IDs and essay). papers are hard to get through but her instruction makes it more so.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 16, 2010",
            "review_content": "\nProfessor Schwartzberg was easily the worst professor I have had at Columbia thus far.  My overall experience was that she is unengaged, unenthusiastic, and unhelpful.  This attitude made it next to impossible for students to motivate themselves in class.  Already a heavy course load, her attitude discouraged students to keep up with the readings to the point where class discussions towards the end of the semester became a dialogue between one lone student and Professor Schwartzberg.  She simply did not seem to care if students were understanding the material. On the few occasions when Professor Shwartzberg requested feedback on her teaching methods, upon hearing the input, she would reply in a sarcastic and condescending manner. \nWorkload:\nThree ten page papers, an in-class mid-term (IDs and essay) and an in-class final exam (IDs and two essays).  She does not include any optional reading. Workload is manageable, but she makes the coursework unbearable to get through. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 18, 2007",
            "review_content": "\nProfessor Schwartzberg is a tough, no-nonsense type who is truly passionate about the material she teaches. Many people find her unnecessarily intense probably because they don't expect it from a tiny, quirky, redhead. That said, those who cruised through Lit Hum and used Thucydides and Woolf as coffee coasters or door stops, wisen up fast, because Schwartzberg is young enough to remember what the face of a slacker looks like,  but old enough to know better than to go easy on you. I don't doubt that CC was one of my most challenging and enjoyable classes at Columbia because I was in Schwartzberg's class. \nWorkload:\nPretty standard: three or four papers (depending on whether you post on courseworks), 100-200 pages a week (about 1-2 major texts per week), midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 09, 2007",
            "review_content": "\nI write this review first because other reviews of her may be overly rough.  I had expected the worst from CC but what I got was a competent instructor, a fair work load, decent grading, and student driven morning discussions; what else are you to expect from a CC section?  Students might complain that she lectures too much, but at nine in the morning, she did a great job of filling in the gaps when students were tired and not motivated (many classes), so they really shouldn't complain.  She was always perky as long as she had her coffee, and the one time she didn't, she went out and brought back coffee and doughnuts for the whole class.  She was prepared 99% of the time and was very fair.  I liked how she kept a very objective view on the matertial.  She is a bit annoying with keeping strictly to the attendence policy and with being on time, but it was her first semester.  So honestly, I was disappointed that I had to switch out of her section because it's really a gamble when choosing another intructor for CC.  If you are willing to do the work, there's nothing wrong with her section.  She became very flexible towards the end of the semester and will work with the students to make the class easier, in terms of administration.\nWorkload:\nTwo 5-7 page essays, not so easy, she was not terrible flexible with the topics, and she's a decently tough grader, though fair.  Her comments aren't too helpful.  She didn't add any readings, but we read everything assigned, she will stress her specialties and favorites.  The midterm and final were similar in format and very very doable if you did the reading and attended class; she will tell you what you need to know.  There are IDs and essays.  There is also the weekly courseworks post, but that may change in future sections.\n"
        }
    ]
}