{
    "prof_info": [
        {
            "prof_name": "Timothy Youker",
            "prof_id": 3443,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "May 09, 2012",
            "review_content": "\n*NOTE* Tim will not be teaching University Writing anymore (or at least that is what he told us at the end of our last class). But in case one wanted to know who Tim Youker was though...\nTim was a genial yet incredibly awkward guy. In the beginning, I was incredibly unsure of his constant shaking and seemingly nervous state. However, as time went on, his awkwardness grew on me (as well as most of my classmates). I will miss him like you miss your awkward older cousin when you realize you probably won't see them again. He was dedicated to his teaching to a good degree and typically gave good feedback on essays and other submitted material. As for his grading policy, he said himself that he was \"easy to satisfy, and hard to please.\" Basically, a B+/A- was achievable with moderate effort, and an A with significant effort (or natural writing talent).\nI wish Tim the best for wherever he ends up next year.\nWorkload:\nNormal ungraded UW work\n4 Essays with a little above average word count\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 04, 2009",
            "review_content": "\nTim is funny, really funny.  He's got a great sense of humor which really helps get you through the classes and assignments.  Tim is also quite helpful with his comments on your essays with the goal of helping you obtain a high grade for the semester.\nThe classroom assignments really do seem inane at times but they actually do work.  One of the assignments was to take your essay, slice it up in sections, and have a classmate put it into the order they thought it should go.  Yeah, I thought it was stupid at the time but when I was having a difficult time with one of my papers, I cut it up as well.  By rearranging the order, the damn paper finally made sense and I got a fantastic grade.\nWhen former classmates run into each other and we reminisce about our courses, we always say, \"Oh, Tim...wasn't he great, and really funny and nice too!\"  I heard other TAs don't assign as much work but I'm in a much better place right now with writing papers for other classes because of him.\nWorkload:\nI heard he assigns an extra essay to write but it's pretty easy and can help elevate your grade for the semester.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 19, 2008",
            "review_content": "\nTim is a nice and understanding guy and I definitely believe my writing improved with this couse. That being said, I also feel as though much of the classtime was a waste of time, just sitting and listening to what he had to say. But Tim has enough eccentricities (like drinking diet lime coca-cola every morning at 10am,...) that it could also make class amusing. \nWorkload:\naverage compared to other classes\n"
        }
    ]
}