{
    "prof_info": [
        {
            "prof_name": "Daniel Callahan",
            "prof_id": 3482,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 26, 2010",
            "review_content": "\nI'm writing this not because DC needs any more praise in this underground forum, but because he deserves to know how deeply his students appreciate his pedagogy. \nFirst of all, Daniel Callahan has become a household name amongst my friends, because he always leaves me with ample anecdotes to use in response to the inevitable question, \"how was your day?\".  How was it? Was today the day Callahan brought in a four part choir to perform Josquin's Ave Maria? Or was it the day that he stood on a table in order to emphasize the inhuman feel of Stravinsky's not-so-primal Dance of the Adolescents?  What I particularly appreciate about him, and have not seen in a professor (although he resents that title) outside of him, is that he incorporates pop culture into his lessons without seeming like he is trying to prove how hip he is. I think a lot of professors will swear, or make a pop culture reference in order to 'relate' to students, without having any pedagogical value.  Callahan shows videos of Beyonce singing the national anthem, and you learn something as a result.\nThank you DC, for reviving my faith in the core, and giving me something from my undergraduate education that will stay with me for many years \nWorkload:\nMy advice is to take good notes, and to then regurgitate your notes during listening quizzes.  He's not trying to surprise or trick you.  He wants you to know a lot of material, but you'll feel like your education was worth something becuase of it.\n\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 24, 2010",
            "review_content": "\nDaniel made my day every class.  He had a bottomless well of enthusiasm and I couldn't wait to see what was coming next.  An instructor that expects you to take the class as seriously as he does, and certainly never for granted.  If you waste his time with being late or unprepared as a class, he will guilt you.  Expect this.\nAs for the class, he is a marvelous instructor and exceptionally adept at involving the class in the technics and historical contexts of the material.  The latter is not to be taken for granted and will carry you a long way on exam essays as these works have been determined to be so as much by their place in history as for their acknowledgement as \"masterpieces\".\nThe listening guides in Listen are tons useful, the extra readings that he assigns tend to have a gender studies (this is a focus of his academically) tone or approach, and watching for his finger in the air during lectures will net you a minimum of an A-.  Most of my classmates that made A's made less of an effort than I.  I am clearly a bit behind the power curve but I loved this class.\nP.S. Don't feel silly if you attempt to make some profound contribution during class and he seems like he could care less - his freight train of thought runs over these.  The right answer to a question will endear you to him and IS ALWAYS IN THE READING!!\nWorkload:\nReading assignments every class, couple of listening quizzes (with lots of emphasis on the essays and historical/musical relevance of those pieces that are to be identified), and a concert report.  This was the load for summer term which was obviously truncated significantly.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 13, 2010",
            "review_content": "\nOne of the best professors I have had at Columbia.  Enthisuastic, fun, enjoyable, funny.  He can be a bit bitchy, depending on his mood but an utterly entertaining class, and for a person completely non-musically inclined, he has provoked a depth of respect for music especially for the \"canon\".  2 years after the class, I still have the \"Listen\" CD on my ipod and listen to it with joy.\nTake this professor and this professor only.\nWorkload:\nNot a lot. Not a little.  Listen to the music, and listen to the lectures.  I got an A+ in this class.  Pay attention and you will do fine.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 17, 2010",
            "review_content": "\nDaniel=a god among men.  Daniel is knowledgeable, articulate, and enthusiastic.  While your first listening quiz may be lower than you had hoped, your grades will improve exponentially on subsequent assignments.  Daniel wants his students to not only succeed, but also to learn and appreciate the evolution of Western music.\n*Pay close attention to the concept of \"work versus performance\" throughout the course of the class.\n*When you write your opera and concert reports be sure to analyze the technical aspects of the performance with the vocabulary used in class/in the textbook.\n*Arrive to class on time!  Does not like late-comers...\n*Enjoy singing along to Beyonce and dancing to Stravinsky's \"The Rite of Spring\"!\n*Read the assigned texts (not in the textbook).  They might show up on a listening quiz or two.\nWorkload:\nListen, listen, listen!  Go to class and take good notes.  Workload is manageable.  Received an \"A\" in the class.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 13, 2010",
            "review_content": "\nDaniel deserves the gold.  As a person, he's really nice, tremendously funny.  As an instructor, he cares a lot.  Daniel makes that known right up front.  You can easily take another Music Hum class with much less work, but Daniel doesn't believe that a Music Hum class should just exist for us to coast through.  We're at Columbia and should learn something along the way.  You get to watch him dance on the desk and in turn he gets to watch us sing and dance as well.  I remember he had a review class at 9 pm prior to an exam because it was convenient for the class.  I still have that music on my mp3 player and listen to it.  \nWorkload:\nIt's totally manageable.  There is a reading prior to each class for the purpose of students being able to participate and not just sit there taking notes.  He had a few listening quizzes, midterm, final exam, and two short papers that were based on concerts we attended.  One was an opera attended by the entire class and one was a classical concert of our own choosing.  If you do your weekly reading assignments, two short papers, and study your music prior to the exams, you are definitely set for an A.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 20, 2009",
            "review_content": "\nsimply: just do it!\ni couldn't have ever ever ever asked for a better music hum prof. i learned so much.  i agree with all the other reviews here.  too funny. too smart. you learn. you like.\nWorkload:\nyou have to work, but just stay up on it week by week.  he's great at covering most of the details in the lectures, but review the textbook too.  for the tests- you know what to expect. as long as you prepare info for each of the listening examples and understand the general musical timeline/what each genre is about, you'll be in A+ shape.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 22, 2009",
            "review_content": "\nDaniel is amazing!  I quit piano in 8th grade for a reason, and I really thought Music Hum would be a drag...but somehow, he made it interesting. His deadpan sense of humor definitely has something to do with it.  He seems to make everything sexual; I spent a lot of effort trying not to laugh, because I wasn't sure at first if he was deliberately making everything sound wrong.  He also genuinely cares about the material and tries to get students to be aware of the biases and general snootiness of the Core.\nTake the class.  It's worth it just to hear him sing Destiny's Child.  (Daniel, I only wrote this review, because I knew you'd read this)\nWorkload:\nDon't get worked up by bad scores at first (the first reading quiz).  He grades easier as the semester progresses.  The class is pretty easy, since he makes it super obvious what you need to know (but don't expect it to be a joke).\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 07, 2009",
            "review_content": "\nDaniel is an amazing music hum instructor.  While he adheres to the core and does require: daily homework, 2 short concert/opera reports, 2 listening quizzes, a mid-term and a final, it is well worth it to take his class.  He is very much into class involvement and having the class very involved...and he keeps things fresh.  Who else has us \"dance\" to M.I.A.'s \"World Town\" or sing \"Row, Row, Row Your Boat\"?  He was very easy to approach and his number one priority is to make sure that you understand (for the most part) what you are doing.\nSome advice: At least browse the reading...if it seems like too much, just let him know.  Definitely participate in class!  Listen to the music on the repertoire that he gives before each evaluation at least a couple of times _all the way through_.  I am not saying it is an easy A, but if you put in some effort, you will do well, and Daniel is well worth it.\nWorkload:\nDaily homework, 2 listening quizzes (from a repertoire of ~20 songs that he gives you the info on...about 5 or 6 will be on the quiz), 1 midterm (with a few songs and 1 or 2 short essays), 1 final (10 songs and 1 essay--THIS IS CUMULATIVE!), an opera report (3-4pages), and lastly, a concert report (3-4pages)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 22, 2008",
            "review_content": "\nI have never written a Culpa review before.  However, Daniel was such a blessing that I felt compelled to do so here.  I can't imagine a better Music Hum teacher than Daniel.  I have heard some stories of Music Hum teachers who give no midterms, finals, work, etc., and treat the class as a passing requirement.  Daniel is passionate about this class.  His teaching style is engaging and fun.  You don't need to know anything about music going into this, but you will come out appreciating Western Music and feeling like you've gained tremendous knowledge about the subject.  One thing though: Daniel does expect you to work.  He will personally make sure that you do work.  This class definitely requires more focus than other Music Hum classes, but in the end it's rewarding and well worth it.  Just to give you a general idea - this class was harder than any Music Hum class I have heard about.   But since you have to do the work and actually learn the pieces, you will undoubtedly do well.  The final was rough - cumulative with 12 listening/IDs and a long essay, but the class received an average of a 98%.  He forces you to learn, and you will enjoy it.\nWorkload:\n2 papers, 2 listening quizzes, 1 midterm, 1 final (cumulative), participation.  Seems rough, but it's all worth it in the end.  Do the work and engage yourself and you will get a solid A while learning a tremendous amount.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 07, 2008",
            "review_content": "\nOnly a grad student but one of the best teachers I've had.  Only music class I've ever taken and learned an unbelievable amount.  Nevver bored in class and always prepared for the tests.  You will have to work hard and be ready for class, but it is definately a class in which it is possible to do well.  If you are into it, you will be rewarded, both with the grade and with the experience. Definately pick Dan when youre signing up for music hum\n"
        }
    ]
}