{
    "prof_info": [
        {
            "prof_name": "George El-Hage",
            "prof_id": 756,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "April 05, 2006",
            "review_content": "\nSwitching into El-Hage's section is probably the best thing I did this semester.  I've spent tons of time on the class, gotten a worse grade than I would have in any other section, and commensurately compromised my grades in my other classes.  But I don't regret a thing; El-Hage is one of those teachers who makes a significant hit to the GPA entirely worth it.  He embodies the educational philosophy that love is a better teacher than fear.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "March 27, 2006",
            "review_content": "\nI hate to be redundant, but I must reiterate the admiration that many reviewers have already expressed for El-Hage.  He is as near to achieving the perfect combination of being demanding and yet kind as any teacher I have ever had.  As far as language teachers go, it seems that many get into the field because speaking another language is their only skill; El-Hage certainly breaks that trend, as he truly loves to teach.\nI came to this class from a less demanding Arabic section, and I began so far behind that I was terrified to go to class every day for the first month.  After I went to his office hours, however, my attitude completely changed.  El-Hage was willing to spend as long as necessary with me to make sure I understood the material, and though I made many mistakes, he always made sure to say so when I got something right.  His kindness, in turn, made me much more eager to learn.\nBe aware, however, that El-Hage's class focuses on a highly literary use of Arabic and translation of texts, rather than conversation or practical usage.\nWorkload:\nVery, very hard.  But so worth it.\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "July 25, 2005",
            "review_content": "\nProfessor El-Hage, in addition to being one of the most dedicated teachers I have ever had, is the nicest teacher in Columbia. He creates a familial atmosphere in class that makes it so fun. He is really an exceptional teacher. I have learned so much in one year and can't wait to continue this fall. I recommend El-Hage to anyone who is willing to work. If so, you will abosolutely love this class.\nWorkload:\nLots of work, but manageable\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 22, 2004",
            "review_content": "\nProfessor El-Hage is simply incredible.  He is a fantastic linguist, well versed in Arabic poetry, an outstanding teacher, but best of all has a kind heart.  He expects a lot, but gives a lot in return.  You will improve your listening, speaking, reading, and writing skills astronomically through his teaching methods and supplemental material.  He assigns a lot of homework -- which will take you 2-3 hours a night to do -- so be prepared to put in a good amount of time.  If you fall behind, he will be hard on you.  Conversely, if you keep up with your work and participate in class, it will be the most enjoyable 2 hours of your day.  If you take Arabic, you MUST take Ustedh El-Hage.\nWorkload:\n2-3 hours a night of listening exercises, reading, writing, comprehension drills.  1 presentation, 1 class-wide debate, weekly quizzes, 1 interview, 1 final.  A LOT of work, but well worth it.\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "August 22, 2004",
            "review_content": "\nThere is no limit to the praise this man deserves- El Hage is more than a caring professor with a wonderful sense of humor; he is a devoted mentor and remarkable teacher who stops at nothing to ensure that students will get the most out of this class. Never have I had a teacher who is genuinely disappointed not to give you that A- he wishes you could have achieved. El Hage makes every effort to make this experience into one large and warm family, rather than an intensive language class.  \nWorkload:\nLearning Arabic will eat up your time and stress you out beyond belief (at times)- but no one said this was a breeze. The more effort and work you put in, the more you will achieve. What you gain from the effort is remarkable, and not one minute with El Hage isn't mumtaz. \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "July 13, 2004",
            "review_content": "\nI could write a book on why El-Hage is the best language teacher I've ever had (and arabic marked my third set of language teachers), but suffice it to say that if you have the opportunity to take his class - whether you've been dying to learn arabic, you have the slightest interest, or you want an interesting way to fufill the language requirement - DO IT.  If you're willing to work harder than you've ever imagined (and learn an unbelievable amount and have fun at the same time), this class will be one of your best experiences at Columbia.  El-Hage is the most caring, involved, and kind professor I've met, and will go miles out of his way to make sure you are completely comfortable with the material, adding new office hours daily and even handing out his home phone number to students concerned about a quiz.  Our class not only learned together, but became great friends though lunches at his apartment, dinners at faculty house, and classes that zipped by with laughter and Middle Eastern techno from the internet. \nThe bottom line is that he really loves teaching and truly loves his students - and it shows.\nWorkload:\nUnbelievable amounts of work - quizes every other week, homework every night, and class participation counts . . . but, amazingly, you'll _want_ to do the work and more - if only to make El-Hage smile at you.\n"
        },
        {
            "course_name": "elementary arabic2 , intermediate arabic 1",
            "review_date": "January 07, 2004",
            "review_content": "\nKind, professional, and dedicated, El-Hage is the best teacher I've had at Columbia. You can stop by his office for homework help practically any time, and he might offer to make you tea. He is genuinely interested in his students,  and he is aware of each student's progress in reading, listening, speaking, and writing. He invited us to his house for dinner. He never misses class and rarely comes late, and single-handedly made an amazing workbook that assists in understanding the complex grammar. El-Hage expects the same dedication from you, so no late homework, and avoid missing class (3 absences and your grade goes down). Time flies by because class is really fun and relaxed (you can eat, call out, etc.). He also sometimes shows cool movies, but only if you bug him a lot. \nEl-Hage is great at knowing what non-Arabic speakers can realistically know and learn, and although he is fond of teaching us useful words that are not in the book, they will almost never show up on the quiz, so don't stress out if he's throwing words at you. El-Hage is very professional, and one of  the first MEALAC professsors I've had that does not let his political views seep into class discussion. El Hage most of all loves Arabic and teaching Arabic, and can explain the often beautiful etymologies of certain words. He is also a wonderful poet in both Arabic and English, and began publishing his poetry at age 17!  If you're starting Arabic, both Taoufik and El- Hage are great options. The rest of the Arabic teachers are not worth your tuition.\nWorkload:\nhomework every night (marked more or less whether you did or not- except if you really screw it up). quizzes, oral presentations (they're fun to watch), final. Bit of advice on the quizzes and final- People often try to make complex sentences with difficult words, and hope that despite the fact that it may have some minor errors, they will be rewarded for there courage and creativity. DON\"T DO IT. HE WILL NOT REWARD YOU FOR IT.   In El- Hage's class, you can and should write simple sentences on the quizzes, and make sure that everything is spelled correctly and makes sense. You will not be penalized for correct, simplistic sentences, no matter how stupid you think they sound. \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "August 27, 2003",
            "review_content": "\nEl-Hage is a sweetheart.  He has a fantastic sense of humor, and makes the 2 hours of class fly by.  He is probably the MOST DEDICATED professor I've ever encountered.  He gives so much supplementary material and it is all really helpful.  He TRULY TRULY CARES about how you do in his class, and about you as a person.  He WANTS EVERYONE to get an A, and will work with anyone who needs help.  He is a great teacher of Arabic.  His only flaw is that sometimes he doesn't answer people's questions well cause I don't think he understands why we don't udnerstand something - but not in the nasty, abnoxious way.  And he will continue to discuss the issue ad nauseum until he understands the problem and is able to answer the question.  Therefore, this is a minor flaw and you should take this class.  Oh, one other minor flaw - his handwriting is pretty shitty, but oh well.\nWorkload:\nA lot of work, but nothing really excessive.  I'd say you spend 2-3 hours 3 days a week doing homework, varying based on your skill level.  But honestly, if you're not willing to put that effort into studying Arabic, you shouldn't be studying Arabic.  It's the hardest language I've ever had to learn, and I speak 10 already!\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "April 28, 2003",
            "review_content": "\na wonderful teacher. he is a skilled linguist and is very capable. made learning adifficult language so easy and fun!\n\nWorkload:\ngenerous, but he is very helpful and makes the hw seem like fun\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "April 28, 2003",
            "review_content": "\na wonderful teacher. he is a skilled linguist and is very capable. made learning adifficult language so easy and fun!\n\nWorkload:\ngenerous, but he is very helpful and makes the hw seem like fun\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "January 20, 2003",
            "review_content": "\nintimidating at first, you soon realize that prof. el-hage is simply a lebanese grandpa in disguise.  he is one of the few profs i've had who genuinely tries to connect with each student (although, like a real grandfather, he'll be hard on you if he thinks you're slacking).  in addition, he is always striving to make the class more challenging and relevant: on a weekly basis, he'd use the overhead to read online arabic newspapers with us.  an excellent teacher and an excellent man.\nWorkload:\nsame as all the other arabic classes\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "November 12, 2001",
            "review_content": "\nHe was intimidating during the first week or two of classes, as we had to learn the alphabet almost immediately and he repeatedly told us how we must spend three hours on arabic a night. But the semester slowed down quickly and it turns out he's really a nice guy. He barks at you if you're behind, but if you're caught up he lavishes you with praise.\n"
        }
    ]
}