{
    "prof_info": [
        {
            "prof_name": "Lynn Cooper",
            "prof_id": 832,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Attention and Perception",
            "review_date": "February 04, 2003",
            "review_content": "\nreading the other reviews of this prof, i find that i couldn't agree more. yes, this is the worst class i have taken at columbia. and yes, cooper is a PERFECT example of a researcher stuck teaching. the tests are insane. the text is interesting, but you have to teach yourself everything because cooper just begins to touch on the material. and do't think that just because she doesn't mention most of the information that you won't be tested on it. she is unprepared and does not want to be there, and her bungling, while amusing at first, became deeply disappointing as the course progressed. the only reason i would suggest this class is if you already have an extensive background in biology and psychology. otherwise, cooper is just another example of a gifted researcher forced to waste her time teaching.\nWorkload:\n3 extremely difficult tests(even the ta's said they were unfair) and several labs that were graded by the ta's and proved both pointless and timeconsuming\n"
        },
        {
            "course_name": "Experimental Psychology: Perception and Attention",
            "review_date": "January 12, 2003",
            "review_content": "\nThis class is probably the worst I have taken at Columbia.  The lectures were long and dry (even the TAs fell asleep) and the tests were impossible!  While the textbook may be the best one on the subject, it is difficult to read because it VERY long and because of the author's pretentious verbosity. The amount of material covered on the tests were unreasonable and listening to Professor Cooper's raspy voice over the body mic she repeatedly dropped was excruciatingly painful.  Although she may be a brilliant researcher, Lynn Cooper has no place teaching a class.  \nWorkload:\n3 cumulative HARD tests (approx. 500 pages of reading for only a few detailed-oriented questions).  There were 4 lab reports (not so bad but time consuming)\n"
        },
        {
            "course_name": "Experimental Psychology: Perception and Attention",
            "review_date": "December 16, 2001",
            "review_content": "\nProfessor Cooper is the perfect example of the great researcher who comes to Columbia for research but gets stuck doing teaching. She is the worst teacher I have ever had in my life. She was never prepared for the class. She would try to use power point or the projector sometimes and they never ever worked! Cooper has a horrible and condescending attitude and doesnt even pretend to care about the students. I dont know what I would have done if I didnt have such a great TA for this class. The lab portion was fine...nothing too interesting.\nWorkload:\nLots of reading, 3 exams, and a about 3 or 4 lab write-ups. If she allows the TA's to give a review session before the exam, the exams are fair, if not, they are a bit difficult.\n"
        }
    ]
}