{
    "prof_info": [
        {
            "prof_name": "Jay Topkis",
            "prof_id": 2560,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Constitutional Law Workshop",
            "review_date": "January 23, 2006",
            "review_content": "\nProfessor Topkis is a professor at the law school who teaches an undergraduate 2 point class. The class is someone disorganized, but it is a lot of fun. He provides you all of the readings and leads discussion of key cases in American history, from civil rights to privacy laws to the commerce clause. The class is basically a 2 hour discussion of 2 or 3 cases, which is quite fun. The class also went to Washington DC to hear oral argument before the Supreme Court and we met with Justice Ginsburg, his friend, afterwards. It is not a time consuming class and worth the time if you can get in.\nWorkload:\n(1) 7 Page Paper and 75 pages of reading per week\n"
        },
        {
            "course_name": "Constitutional Law Workshop",
            "review_date": "May 24, 2005",
            "review_content": "\nI had a lot of fun in this class.  You basically just show up once a week and talk about Supreme Court cases for two hours.  If you don't mind talking, and are interested in the Supreme Court, you'll probably have a good experience. It's only two points, and it's really not that hard a class.\nTopkis himself is a sweet old man.  He was also a partner at Paul, Weiss for 40 years, a bigwig in the NAACP Legal Defense Fund, etc etc.  (Watch for when he starts namechecking his friend Ruth, as in Bader Ginsburg). He knows his stuff, and knows it cold.  Me, I'd say the class is worth taking just to hear some of his stories (the one about the creationism case he argued before the Supreme Court comes to mind); and if that doesn't do it, the trip to hear a day of oral argument at the Supreme Court certainly should. Yeah, it's only two points.  But, seniors especially, if you're looking for just that little bit more to fill out your schedule, definitely consider taking this class.\n"
        }
    ]
}