{
    "prof_info": [
        {
            "prof_name": "Zane Mackin",
            "prof_id": 2138,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2010",
            "review_content": "\nZane Mackin is a pretty cool teacher. He's not the best Lit hum teacher but he's DEFINITELY not the worst. The class is based on very casual, moslty student led discussion, which is great because you can participate as much or little as you want. My only word of caution is that he is a Dante scholar and therefore tends to go overboard in discussion for the Divine Comedies. We spent 3 weeks on them and then had to rush through the rest of the syllabus without time at the end for review. Other than that, the class was definitely easy going. The quality of each class definitely depends on student input.\nWorkload:\ntwo 7-page papers a midterm and a final. Short online discussions (once or twice weekly) for each book we read.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2010",
            "review_content": "\nThis review is likely utterly unnecessary, since Professor Mackin will likely have finished his dissertation and left by autumn, but I want nonetheless to leave it here for posterity's sake. \nThe peevish commenters below mistake themselves. Professor Mackin is a very fine Literature Humanities instructor, whose jovial and easy-going manner, which makes coming to class a constant joy, matches the seriousness of his scholarship and his dedication to the texts we study. Classes move forward by common deliberation and discussion, not by his lecturing. His loyalty lies not in any interpretation of a text to which he is partial, but rather to the text itself and to our discussions around it. He is a fair grader, detects bullshit when he hears or reads it, prefers papers to exams, exacts the best of every student, and understands the inadequacy of grading in communicating all that has been learnt. His expertise is in Dante and Medieval literature, but leads every class discussion with insight and a flexible mind. I found literature humanities an excellent experience under his instruction, and, should any future students be so lucky as to have him as a professor, then I would be envious of them.\nMoreover, he has a very fine moustache.\nWorkload:\nWeekly 100-200 word discussion posts on CourseWorks; three short or two long papers per semester; midterm and final exam.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 05, 2009",
            "review_content": "\nBoy, was I relieved when this class came to an end. Although ZDRM could be kind of cool sometimes, he usually tried too hard to seem worldly and intimidating. He would ask \"deep\" questions during class discussions that I suspected didn't mean anything at all, and would look piqued when no one wanted to answer. I did my best to avoid going to his office hours, but the times I couldn't  they were horrible. \nWorkload:\nMidterm, two papers, an almost unreasonable amount of reading\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 09, 2009",
            "review_content": "\nOkay, how does ZDRM (as he signs all his emails - Zane Dean River Mackin) have such great reviews? I guess he wasn't the worst LitHum professor in the world, but I can't say the experience was at all great either. He comes across as extremely pretentious, and not just in the way he dresses.\nExcept him to fall behind in the syllabus very, very quickly. I'm not sure why. We rarely seemed to talk about anything important or interesting. But, it happens. For example, we had 3 class days on the syllabus devoted to the entire Divine Comedy. By halfway through the third class, we were still on Canto X of the Inferno. We hadn't even touched the other two books. I understand that Dante is his specialty, but seriously? You can manage your time better than that!\nAnd I'm not sure how to phrase this next one, but he just comes across as a bit... insensitive? It's a hard thing to put your finger on, but he'll oftentimes make statements like 'Eh, why not just read the whole thing for next class anyway' when changing the assignment from reading a book over two days to reading it over one class day. In other words, he never actually says 'it's not like you have anything better to do anyway', but he comes pretty close to it.\nOh, and how could I forget the midterms? The IDs were terribly obscure. By that, I mean that no amount of studying would have helped you beyond a point. He literally will pick the most obscure line in a play that exemplifies a theme that's common to five different works you've read, and then expect you to figure out which of the five works it is, and who's speaking it. He did end up curving this section, but not much. Honestly, even if you read all of the books, the IDs are a total roll of the dice anyway, and you might as well just put your books under your pillow the night before and pray that you'll absorb it through osmosis or something.\nTo give you an idea of how bad ZDRM is at figuring out what is a good or a bad ID, he warned us that the IDs on the final would be very difficult. They ended up being a complete joke. One of them even used the name of one of the characters!\nLastly, an earlier reviewer got it right that Zane flirts with some of his students. He definitely plays favorites. And those favorites are the people who get the top grades. I know I'm not the only one who noticed that.\nWhat surprises me is that only one other person has reviewed him so far from my class, and it's been positive. (Or maybe it was Zane himself? I don't know...). All I know is that I talked to  many other people and nobody I knew actually liked the class. (And taking it 9 on M/W was just adding insult to injury). \nOverall, Zane's not the worst you can do for LitHum. But he's not the best. He prides himself on giving out very few As (I think there were two each semester? And I'm pretty sure they were both the same two students who got them each semester, too.). But it's not that hard to get, say, a B+ in his class without doing any work at all. You can decide for yourself whether it's worth the misery of sitting through almost 4 hours per week of this class.\nWorkload:\n3 papers in the fall (progressively longer, last is 8-10 pages). 2 papers in the spring (both 8-10 pages). The IDs on both midterms are brutal, but the final exams are the same for all sections.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2009",
            "review_content": "\nZDRM takes his class seriously and that's enough to forgive his faults. His dress humorously varies from class to class, he has his favorites and can be odd and/or snarky at times. However, he really cares about his students, wants them to do well, and is eager to do the best he can at teaching. His class was definitely a worthwhile, pleasant core experience.\nWorkload:\nin the fall, 2 3-page papers and 1 7-page paper, midterm, final, courseworks postings, in the spring, 2 7-page papers, midterm, final, courseworks postings, he is not as hard a grader as one might expect, but he's not easy either\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "February 02, 2006",
            "review_content": "\nI had Dolcino last semester for Italian. The best part of the class was probably following his wardrobe. And he totally played favorites with a few of the girls, which sometimes seemed to me to get a little sexual. The class would titter with nervous laughter. But as far as the actual teaching went, he was very dedicated and made sure we knew what was going on. He also really pushed people to come see him in his office hours, though I never went. He graded a little harshly compared to other teachers, which he knows and appears to almost revel in. I guess it's his way of pushing everyone to try their best. I wonder if it works... didn't for me.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 31, 2006",
            "review_content": "\nI admit it: IÂ’m a fan of Â“Dolcino.Â” He dresses as if heÂ’s a really cool guy, but I donÂ’t really have a problem with that, because hey, he /is/ a cool guy. But should that matter, anyway? No, I donÂ’t think so. HeÂ’s always enthusiastic in classÂ—he encouraged us (and once required us) to see Italian films throughout the semester, and taught us some interesting things about the way Italians live. You certainly should NOT take this class if youÂ’re a slacker, because you wonÂ’t do well; on the other hand, if youÂ’re willing to do the work (itÂ’s the same amount required of all of the rest of the classes), you will do just fineÂ… never would I have called the way he graded our quizzes and tests harsh, but heÂ’s also not particularly lenient.\nSoÂ… yeah. This guyÂ’s 100% American, but it really comes across that heÂ’s dedicated to every aspect of Italy. HeÂ’s got the accent, a completely fluent grasp of the nuanced language, a great understanding of the culture and history, etcÂ… just take the class with him if you can. HeÂ’s a great guy.\n\nWorkload:\nWeekly (except maybe the first and last weeks) compositions, workbook and lab exercises. A midterm, an oral presentation and a final exam. (The same as other classes at this level)\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 12, 2005",
            "review_content": "\nTotally pompous, but he does the job.  He tries very hard to come across as a cool bohemian, which is totally annoying.  He speaks too much Enlglish in class--quite often, rather than taking the pains to explain things in Italian, he quickly switched to English.  Take Stephen Twilley instead, if he's around (though, I guess grad students only get stuck doing this once anyway).  He follows the syllabus well, teaches you everything you need to know, etc...like, I said he does the job, but his blatant pompousness really irked me.\nWorkload:\nsame as every other Columbia Elementary II course.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 22, 2004",
            "review_content": "\nHe's cool. At first it may seem to be a lot of work but once you get used to it it's not bad at all. He doesn't just use the boring examples from the book and tries to talk about everyday real life things. He can pack so much into a 50 minute class-period, I was amazed. I felt very comfortable in the class and felt no apprehension about making mistakes because it is elementary I and that's how we best learned.\nWorkload:\nLanguage Lab every weekWorkbook every weekquiz every week, midterm and a finalA couple take-home essays\n\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 22, 2004",
            "review_content": "\nZane is fantastic. He is a little intimidating at first because he's pretty intense, but once you get to know him and the class starts to loosen up a bit, you will all have a great time. He is an excellent instructor, and won't hesitate to spend as much time as you need helping you understand something. He loves to have people come to his office hours, and is always willing to help via e-mail any time. He grades the quizes pretty toughly, but it's worth it in the end. The class is difficult, but nothing you'll freak out about. If you have to opportunity to take any class with Zane, do it! He's a great teacher, and a great guy.\nWorkload:\nweekly quizes, 3 or 4 really short compositions, 1 midterm, 1 presenation, 1 final\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "July 05, 2004",
            "review_content": "\nZane is amazing! You totally forget he's not italian...he knows sooo much about the culture. Once you're inside the classroom it's like traveling right into the heart of Italy.  He has so much to say about the way of life there.  His italian is great and will move the world to be available for you.  Zane truly cares about his students learning the language well.  His students feel no intimidation to speak italian and make as many mistakes as one possibly can.  He gives equal amount of time dedicated to grammar and conversational skills for an elementary/intermediate level.  He's funny and makes the class a relaxing and fun environment with ramdom activities and assignments.  Overall, I recommend this class enthusiastically!!!\nWorkload:\nWorkbook every week, Labwork every two weeks, Weekly Quizzes, 1 page essays every two or three weeks, 1 midterm, 1 final\n"
        }
    ]
}