{
    "prof_info": [
        {
            "prof_name": "Tiffany  Floyd",
            "prof_id": 13583,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 06, 2018",
            "review_content": "\nI have taken the summer section of Ms.Floyd's Art hum. \nI am an electrical engineer who was never really interested in the subject. I wanted an easy A. \nLet me just say that I really LOVED LOVED her section. \nMs. Floyd is kind,generous and exciting. Her slides are on point. Her devilry is flawless. She gave us everything required from the first day in class, and she gave us ample time to get everything done. She responds quickly to emails and questions. \nThis was a fresh breath of air from my old engineering professors.\nHer section is on the easier side. She was really realistic with that given that it was the summer. It was a bit unfortunate though because at the end she realized most of us were not that interested in the material. The last few classes ended pretty quickly.\nI think most of us got between an A+ and a B+. \nAnyways, she is a goddess of kindness. I was pretty sick the last two weeks of class, and I needed more time to finish the essays. She gave me more than I wanted by 2 days, and She didn't mind that I submitted things a little bit late/over the deadline. Other professors would have straight out failed me, but she was really supportive. \nShe even brought us bagels for our final. She brought her own toaster as well. \nMy main criticism would be that \n* only a few students talked in my sections\n* This was more of a case by case study of different pieces than a hsitroical overview. I would recommend watching Khan academy Art's section as it made me appreciate the different period. \n\nWorkload:\n* Material Analysis paper 5 to 7 pages. 20%\n* Contextual Analysis paper 5 to 7 pages.  20%\n* Final. In class, but she gave us major hints on what to prepare for. 40%\n* Group + Participation. If you do the min effort you will get a full grade.  20% \nI would say 4 hours of reading for each class. Papers took me 3 days each. \nWorkload is on the easier side. \n"
        }
    ]
}