{
    "prof_info": [
        {
            "prof_name": "Anna Catarina Musatti",
            "prof_id": 3181,
            "total_reviews": 40
        }
    ],
    "reviews": [
        {
            "course_name": "Principles of Economics",
            "review_date": "June 16, 2015",
            "review_content": "\nMusatti's a really sweet person, with an Italian accent that you'll either find endearing or annoying, but alright as a professor. Just alright. This is one of those classes that if you just study the textbook and not go to class, you won't miss a thing (except stories of her personal life).\nLecture is pretty straightforward. However, most classes she'll only cover half of what she says she'll cover in the beginning of class.\nShe does have some pop quizzes in lecture, but they're all more or less \"collaborative\" (aka you take them with the entire class, including her) and she drops the lowest one.\nProblem sets are easy, sometimes badly-worded.\nThe midterm is easy. Final's definitely tougher though. This is partially because Musatti's good with Micro (the second class she teaches), but pretty bad at teaching Macro, which composes more of the final. Don't think just because you did really well on the midterm that the final will be as easy.\nRecitation is helpful, but not necessary. I didn't attend a single recitation (except to pick up the midterm) and didn't feel like I missed anything.\nI had never taken a single Econ class in high school before this, so I worked harder in this class than most people probably did. If you know any Econ beforehand, you'll be so set.\nI agree with previous reviews that say if you want a good grade with little work/stress, take Musatti. If you actually want to learn (and also struggle with your grade), take Gulati.\nWorkload:\nPop quizzes that she tells you the answers to\nEasy problem sets\nDecent midterm\nTougher final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 06, 2015",
            "review_content": "\nInsomniacs, rejoice! Fuck Ambien - Musatti is the best sleep inducing medication out there on the market: her tedious, uninspiring, and convoluted lectures - especially her macro lectures - will help you fall asleep within five minutes of her opening her mouth.\nStill, you should beware of side effects. Everything on and about the planet pisses off Musatti, and she will scream at students who (unsurprisingly) do fall asleep in her class, show up late to lectures, or even try to leave the room to take a piss.\nYet, Musatti unconscionably still boasts to her students that she's one of the few professors at Columbia who actually care about teaching, as made evident by her typo-ridden and terribly worded problem sets that teach students more about proofreading than about economics.\nIf you're dumb enough to take Musatti's class, you should attend the lectures, not to take notes but just in case she takes attendance - oh, sorry - I meant just in case she gives a pop quiz. (FYI: She'll tell you all the answers to the quiz anyway.)\nExams are easy. Midterm is slightly harder than the final, but the final covers more shit, so make sure you at least skim the book.\nIn sum, I learned more about economics from Khan Academy than I did from Musatti. I guess I'm the kind of guy Will Hunting would call dumb for dropping Gs for an education I could've gotten for free on YouTube. \nTake Gulati.\nWorkload:\nSix \"problem\" \"sets\" - the worse your English is, the better you'll do on them.\nThree \"pop\" \"quizzes\" - sometimes she'll let you know that you will have a quiz next lecture, but take it with a grain of salt: her sense of time is as broken as her computer and projector.\nOne \"midterm\" - very easy AP style multiple choice questions plus some bullshit free response questions she pulls out of her ass.\nOne \"final\" - even easier multiple choice questions except they're typo-ridden like her problem sets, and the TA who can't speak English will waste 15 minutes of the already abridged exam time you're given (2.5 hrs, not 3) trying to clarify Musatti's mistakes. More bullshit free response questions she pulls out of her ass.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 16, 2014",
            "review_content": "\nMusatti is a very polarizing professor. Very many absolutely love her, think she is just the cutest, funniest professor. I am not in this camp by any means.\nYes, Musatti sprinkles her lectures with personal anecdotes, jokes, and all-around hilarity, but at the end of the day I know more about her personal life than Economics - for instance I recently learned in class that her family has 3 iPads, and her kids really enjoy them (!!!!!). Later that day I spent multiple hours talking over the book with a friend in Gulati's class, trying to learn all the terms that were on the homework but not covered in class. \nIf you've taken econ in high school then this is absolutely the class for you. Musatti will provide a basic enough understanding to remind you of most of the terms, and the book can fill in any blanks. If, however, you are relatively inexperienced in the field, you will gain next to nothing from her lectures, and find yourself struggling to understand the book, which, although very comprehensive, is dense and sometimes difficult to parse.\nSome of the material she doesn't get to is supposedly covered in recitation. Unfortunately this material tends to be some of the most important, and is not actually covered. Stay away from the TA MeeRoo - his grasp of English is barely 6th grade level, and is completely unable to answer questions.\nDon't take this as a review from someone given poor grades either! The workload is not terrible, and most can reasonably expect a relatively easy A or A-. If, however, you want your A to represent an understanding of the material, stay away.\nOn a final note, if I still have not persuaded you, I must say that, if you are prone to headaches, I would recommend wearing earplugs to class. Musatti's accent is not kind to the ears.\nWorkload:\nSuper easy, I sometimes forget I'm even taking this class. A problem set every couple weeks that should take an hour tops, except for the occasions when Musatti does an exceptionally bad job teaching, in which case you'll spend some extra time looking through the book and some Google search results.\nShe has \"pop\" quizzes every now and then, but you can discuss them with other in the class while taking them, and she will tell you about half the answers during the quiz anyway. If you notice extra low attendance one class, expect a quiz the next.\nThe midterm was fair, and very simple. 3 hours of studying the day of gave me an A-, and any amount more should guarantee even the most humanities of humanities majors a near-perfect score.\nHaven't taken the final yet, but I cannot imagine anything different.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 10, 2014",
            "review_content": "\nHer lectures are tedious and her obsession with class-etiquette is annoying. That being said, the textbook is informative and covers the information more in depth than her rambling lectures. She also releases a bunch of practice materials for the midterm and final exam, so even though her lectures are pretty bad, there's definitely plenty of material you can use to study.\nShe released detailed statistics on the midterm, but I still have no idea what statistics for the final look like. I guess everyone takes this class if they have to, and I'd say Musatti is easier than Gulati (at least from what I've heard). Gulati is probably a better teacher, though, so if you actually care about learning a lot of economics, I'd take it with him instead. If you're just more interested in getting a good grade and doing minimal work, Musatti is the way to go. \nWorkload:\nPretty light, 6 short problem sets, midterm and final. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 10, 2013",
            "review_content": "\nComing from a student that had never taken any form of economics before, I actually loved Musatti's class. I didn't know what to expect from econ before the class started but walked away fascinated. This was in part the work of Professor Mussati, whose lectures I thought were very interesting. The lectures could be frustrating because she would start out going slowly and explaining everything, which was wonderful, but she inevitably would begin to run out of time and rush through the last part of the lecture, which was usually the most applicable. Still though, I sat near the front and actually payed attention and it really payed off. I never had to read the book other than to look up definitions, and did great on the homeworks and tests.\nYou could tell which parts of econ Professor Musatti liked most because those lectures were more engaging, but that did not mean that she did not give fair attention to the other topics of economics as well, rather it just ment that we got to learn more about the topics that she knew more about. It was quite interesting to observe the ways that she clashed with the author of our textbook, because he is an obvious Republican, while Professor Mussati has a more liberal point of view.\nI would definitely recommend this class if you are simply interested in economics and want a lecturer who is engaging and interesting. Professor Mussati connected theory to reality while at the same time making sure we were aware of how little Principles of Economics can really cover regarding real-wold problems.\nWorkload:\nEasy homeworks about once a week\nReasonable midterm and more difficult final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "July 07, 2013",
            "review_content": "\nOkay I'll preface this by saying that I'm not an econ major and I took this class to give econ another chance, and uh, I still don't like it.\nOverall, I think I'd say that Musatti is an okay teacher but not great. If you've taken an AP  Econ class before, or if you're willing to read the textbook to learn, then you'll do fine in this class. But if you are actually curious about econ, I'd suggest trying Gulati instead.\nClasses are basically just her lecturing and writing some of the notes on the board. She likes to make jokes, so it's funny sometimes, but in the end, I feel like the lectures were pretty uninteresting.  I actually feel like my high school teacher taught me econ better, and Musatti kind of made it more confusing.  Recitation didn't help much either, but you should still go to those because they often cover different material than what is covered in class.\nThere's pop quizzes from time to time and she usually announces when there will be one, but not always. Don't put it past her to do two pop quizzes two classes in a row (she did this once purposely because she knew there would be a lot of people skipping that class thinking that she wouldn't do this). The pop quizzes are open book and you can work with everyone else in the class, so they aren't really that hard. \nLooking back, my two regrets are 1) I should have pass/fail'd this class and 2) I should have tried Gulati. I still think that the best lecture of my semester was the one that Gulati substituted for when Musatti wasn't there. I hear the workload is heavier and the tests for Gulati are tougher though, so watch out for that.\nWorkload:\nPretty light. About 1 hour of HW a week. HW isn't graded harshly at all (I never got lower than 5/5 even though my answers were wrong sometimes).  Roughly 8 quizzes the semester. A midterm and a final.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 25, 2013",
            "review_content": "\nMusatti is not a good lecturer. I learned little to nothing from going to class, and she spends a lot of time off-topic or focused on trivial concepts. Because of this, she goes over time by 5-10 minutes every class, and though this doesn't seem like much, it gets pretty frustrating over the course of 25 lectures.\nHowever, the class itself is not overly difficult- you can learn everything from reading the textbook.The problem sets are pretty straightforward and most of the answers are in the book. The quizzes are open-book and you can talk to anyone you want. And even though she says they're pop quizzes, she'll announce if you have a quiz for the next lecture. I felt the midterm was not difficult, but the final was much harder.\nOverall, not a great experience. I'd recommend having a more responsible friend tell you when the quizzes are and just show up for those lectures. Recitation/review sessions are fairly useful because the TAs focus on the important concepts. Just read the book before the midterm and final and you'll be fine.\nWorkload:\n7 problem sets, 5 quizzes, midterm and final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 23, 2013",
            "review_content": "\nPretty bad class, but because it's a frequently required course, many people are stuck with it (like me.) There's no point in coming to lectures unless you want to listen to her babble on about whatever comes to her mind. The book will teach you everything you need to know except random vocabulary, but if you go to her review sessions before the exams she'll teach them all anyways.\nAll in all, not great. If you have to take it, just read the book and you'll be fine. \nWorkload:\nVery little--weekly problem sets that take maximum an hour, \"pop\" quizzes that she warns you about, and one midterm, one final.  Study for those and you're fine. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 26, 2013",
            "review_content": "\nKind of awful. Unfunny, rude, and unhelpful during office hours. Wish I had taken it with Gulati instead. I know that some of the reviews claim that her being nice is her only saving grace, but I found her tepid and personally off-putting when she was trying too hard to be funny and edgy. In short, sort of bland, not an extraordinarily good lecturer and doesn't seem to care about what she's doing. Yes, it might be slightly easier but I came away feeling distinctly unsatisfied with the quality of the lectures and the amount I had learned. \nWorkload:\nAverage, okay curve\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 01, 2013",
            "review_content": "\nI echo many of the sentiments in the reviews below. Principles with Musatti is a relatively easy class (NOT an easy A, or even B+). It has a few interesting concepts, and you'll feel more versed in WSJ and policy lingo, but Musatti's lectures were pretty bland save for the occasional joke about the differences between Europe and America, and they don't cover all the book's information that will be tested, either, largely due to their slow pacing. As a result, anyone who wasn't already interested in economic theory (and not just that finance internship) probably won't be after this class. Most people who weren't in sweatpants texting and doing online shopping just stopped coming to class or took turns with a group of friends, which is a fair strategy, considering that it was took over half the semester before people started getting caught handing in multiple quiz cards.\nThe psets were short and pretty easy (1-2 hrs). Hopefully you have the aforementioned group of friends to do them with. Really, the only points I ever had taken off were due to awkward phrasing in the questions that changed their meaning. This also became a problem on the MC questions on the exams, and the grad student TAs didn't clarify much, as their English skills were significantly worse than hers. Ironically, the most helpful TA by far was a College senior who'd taken Musatti's classes before and understood that the wording of her questions and explanations for things such as \"transmission channels\" were pretty cryptic.\nGrading was meh. I don't know what the mean was curved to (probably a B?) And don't be given false hope by the large course size, thinking that there will be a few to round out the bottom of the curve; since so many people have taken this course, there are answer keys floating around, which means that even one or two checks on psets will tank your average. The exams were mostly multiple choice questions that tested both obscure information in the book and minor concepts covered in lecture, so unless you religiously follow both, you won't get above a B+ even if you do all of one. Note: 25-30% score in the A range. \nOne disadvantage to this class (not sure if it's specific to Musatti) is that it seemed unrepresentative of most higher-level classes in the econ dept. It felt more like a humanities class with much of the emphasis on reading and memorization, so if you're taking this for the SEAS requirement, pick the third professor. Even during the more quantitative micro unit, curves were described as just \"shifting right/left,\" and the most complex calculations were for slope. There was next to no math on the psets or tests, and many of the concepts were based on \"intuition\" rather than the derivations one would find in int. micro. I once had points taken off on a pset for misunderstanding a question asking how money supply changes and using the money multiplier, rather than just stating that it increases. Overall, this is great for non-econ students who are taking this as preparation for an internship, but if you plan on continuing further with professors like Elmes and Arkonac who take no BS, you may find yourself unprepared.\n\nWorkload:\n8 problem sets, lowest dropped (I think? Courseworks says otherwise...), 5 \"pop\" quizzes announced at the start of the class, midterm - 30%, final - 50%. Final ended up being the basis for most grades. Minimal curve, but hey, it's better than Gulati's.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "June 15, 2012",
            "review_content": "\nI really do not understand why people love Musatti.  People generally take her because they say Gulati has a harsher curve and the third Principles professor always sucks, so although she's not as good as a lecturer you get a better grade in the class.  I'm not sure how true this is, but I have many really smart friends who got bad grades in her class (bad as in B's).  Less than 30% of people get in the A range, and this can be very challenging to do depending on how smart your section is- my section had a really high average (like 10% higher than the section from the semester before) so there was less of a curve.\nI knew she was a bad lecturer but I didn't realize how bad until the first few classes.  The first day she spent literally 45 minutes talking about opportunity cost (an extremely basic concept), using excessively long and detailed examples and stories.  She feels that it is necessary to use these absurdly long anecdotes to illustrate every point she makes.  The most important thing to do is to read the textbook.  It is very dense and long and complicated and you need to memorize everything in it.  Every graph, definition, explanation, etc.  Her lectures provide a disorganized and confusing way of explaining the basic concepts from each chapter, and she jumps around different topics, never really going into the confusing material.  I brought the textbook to class and read each chapter during lecture (you need to go to class to take random quizzes), occasionally taking down something I didn't see in the text.  My actual lecture notes took up maybe two pages and besides the definition of two terms not in the book I didn't use them to study.  After the first few classes most people didn't show up and had friends text them if she announced a quiz.  The people who did show up usually did other work or played games on laptops during lecture.  It's understandable that she doesn't go over everything in the book, but she barely goes over anything important.\nSo her lectures are awful and unhelpful, which is a shame since she seems like a pretty nice woman.  Then again, during my final she ignored people telling her that most of the lights were turned off and that it was too dark, talked to the TA for the first 20 minutes of the test and ignored our questions, and had her phone ring twice.  She's also very picky with grading- on the midterm we had to define MRS, and I did so exactly as the book defines it word for word, but she took off a point for not including that MRS includes both public and private.  Little things like that add up.  Problem sets are generally straight from the textbook so they're not bad, but my TA graded very harshly- if you got anything slightly wrong you get a check instead of a check plus (3/5 vs. 5/5).  The biggest problem with the homework, quizzes, and tests is the wording of the questions.  Oftentimes I would have to reword her questions to make much sense of them.  She tries to trick you sort of SAT test style, like she'll include a small word that many would overlook due to time pressure that completely changes your answer or she'll use very poor syntax and diction when asking a simple question.  So ontop of all the stuff you need to know, you also need to watch out for tricks because here questions are not straightforward at all.  The TA's grade her tests and are open about how poorly they do so- Musatti sent out an email telling the class to bring in a typed explanation of why they deserve points back- I got like 6 points back on the midterm because a few of the multiple choice questions I got right were marked wrong.  I can only imagine how much they messed up our finals.  My TA was especially bad.  He told us in recitation that we didn't need to know the midpoint formula for elasticity, and there were at least 2 questions about that on the midterm.  It's hard to know which TA to take, but know that it makes a big difference.\nI ended with a B+ in the class which is okay since my section had a harsh curve and I never took AP Macro/Micro in high school (this helps a ton), but that grade came 100% from trying to memorize the textbook and memorizing questions from the study book you should buy and from her practice tests (some questions asked about nobel prize winners in economics from the past few years??).  Literally the only thing I learned from Musatti was pareto efficiency.  My TA explained some graphs pretty well and did a good job going over the financial crisis (the text does an awful job), but in the end the textbook is your teacher.\nTake Gulati if possible.  This class really turned me off from economics.  \nWorkload:\n7 Problem sets, not bad but annoying\nRandom quizzes in class that are open notes and used as a way to keep people coming to lecture\nLong and difficult midterm\nHard final but not too long\nFuckton of reading- actually read every chapter (7 is important even though its not on the syllabus) and know everything in it.  You need to be able to define every term and use pretty much every formula and draw every graph.  \nIf you do the reading you'll get at least a B-.  But take Gulati.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 27, 2012",
            "review_content": "\nI am honestly in love with Musatti.\nNo, seriously. I may have a problem.\nEither way, take her class. The Gulati folks are too busy jerking themselves off for being with a \"superstar\" in the field (read, no one fucking cares about Sunil outside of FIFA) to realize that they're acquiring the mere foundations of the field, for which a much more amiable and personable lecturer proves more apt. Surely, the additional material they supposedly glean can be just as easily absorbed by reading one or two books on economics outside of class.\nAnd if you actually care about the field and future of political economy, you inevitably will.\nWorkload:\nSeven problem sets assigned every two weeks; a very straightforward midterm; a slightly less challenging final.\nReading roughly consists of a chapter of the textbook per class.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 29, 2012",
            "review_content": "\nGreat Professor! She is very personable and cares a lot about her students. It is crucial for the introductory course. She tends to rush by the end of the class and holds students over time, so do not schedule your classes back to back. Obviously, you have to read the book and do 10 problem sets, but with the generous curve it is possible to earn a good grade, learn something and not to fall asleep on every single lecture. \nWorkload:\n10 HWs, 5 easy quizzes (lowest dropped), a hard midterm and a fair final. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 07, 2012",
            "review_content": "\nTook this class to fulfill my engineering requirement.  She's an enthusiastic woman, but I still found myself falling asleep in every class.  Her anecdotes can be quite long-winded and confusing, even though she seems to think that they will engage us better.  Some of them are interesting/funny, but most just made me space out.\nHer lectures are not well-organized.  Myself and others were never quite sure when to write notes and when not to.  Sometimes her accent made it hard to understand certain words that were key to a concept. She doesn't really like answering questions in class, esp. because she always seems to run out of time.  This also caused her to speed up towards the end of lecture so that it's hard to catch everything.  Also she really hated students showing up late to class/not sitting in the middle to maximize space.  I never went to office hours, but my friends who did said that she was hit-or-miss on helpfulness.  Go to the TA office hours, they really help a lot.  Recitations are \"required\" but not really.\nFor this class, you're gonna have to read the book from cover-to-cover.  The curve is not as generous as previous reviews made it out to be.  \nWorkload:\nWeekly problem sets.  Should be easy, but you need to get used to how she phrases questions and expects them to be approached.  One midterm, one final.  Midterm is hard, final is fair.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "June 20, 2011",
            "review_content": "\nMusatti is a pretty good professor. Principles of Econ with her was definitely a good experience. Indeed, Professor Gulati might keep the audience more engaged and be more concise; however, Musatti does offer a more relaxed setting where she makes it an effort to get to know her students personally. She makes sure everyone understands a concept and if their is any ambiguity about an issue, she is always willing to meet outside class to help. Very approachable and has a generous curve. If you are looking for a decent grade, this is the the class for you over Professor Gulati's!\nWorkload:\nOne midterm covering the Microeconomics units.\nOne cumulative final.\nBunch of quizzes that are extremely easy and impossible to score below 3/3!\n~12 homework problem sets that are not too long and the lowest 2 are dropped.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 23, 2011",
            "review_content": "\nThis is a great class, especially considering you'll never use anything from Principles ever again. You have to read, that's for sure, but there's not much else to it. You learn the basics and all.\nIf you've never had Economics before, I can see how she'd be frustrating. She's not a good lecturer and goes off topic a lot. When she does get down to business, though, she's great at explaining with graphs and numbers. There's no calculus in this class, so she's good at explaining without the actual mathematical background.\nWhile everyone says to take Gulati, I think you should save that for a higher level economics course. This class is definitely an easy \"A\" and a great way to pad your GPA before applying to internships after freshman year. I wouldn't fall into the Gulati trap and pass up this good grade.\nWorkload:\nA couple problems sets\nA midterm and final - couple tricky questions but nothing unmanageable \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 19, 2011",
            "review_content": "\nThis class was okay. I knew very little about econ coming in, some I'm glad I took it because I feel like I do understand a bit more of what I read in the newspaper. Lectures were pretty boring, though. The midterm was difficult, the final was pretty easy, and the curve was generous. It's possible to get an A, but that means you have to read the textbook. The whole textbook - all 1000+ pages. If you don't think that's worth your time, then pass/fail the class if you want to take it anyway. \nWith Musatti, quizzes were really chill. If you're looking for a comfortable environment with a professor who remembers your face and name - and loves to teach and get to know her students - then this is the right class for you. I sat in on Gulati's for the first week and had to change sections; you certainly won't get that from him. However, he's incredibly entertaining. As with everything, there are trade-offs. If I had the choice to do it over, though, I don't think I would have taken this class. I used this as my elective for the semester, and it wasn't the kind of class I'd hoped for. \nWorkload:\nIf you do the reading, it can seem like a lot - about 4 chapters a week. 6 problem sets (graded in part based on hand-writing, so type them!). Midterm (hard). Final (fair). 5 pop quizzes (really easy and meant to be that way).\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 18, 2011",
            "review_content": "\nReally nice lady, as everyone else mentions.  She belabors the point often times, and rarely goes in depth or adds interesting tid-bits of information.  She will throw in a couple facts from the book on Midterm and Final, so if you are shooting for A or A+ you must do the reading.  Other than that, quite fair and I enjoyed the course.\nSit towards the front of the classroom as she remembers your faces, you hear certain things better, and you can see much easier the work she does on the board.\nWorkload:\nWeekly problem set, 6 pop quizzes that you can work on in groups, 1 midterm, 1 Finale\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 19, 2010",
            "review_content": "\nThis class extinguished my desire to be an econ major. Economics is an incredibly fascinating field, and rather than explore that we spent a semester listening to circular lectures and bizarre anecdotes. It really was a drag. I sat in the front and never missed a lecture at the cost of my will to live. Musatti is a very, very nice woman and she means well, but this lecture is as uninspiring as it gets. She gets excited about the randomest things, which is an amusing break from her lecturing. I wish I had taken Gulati despite it being a \"harder\" section. This was not a difficult class, but it was difficult to do well. There was only one helpful TA, and that section met at 9 am. If you can avoid this class, do it. If you want to be an econ major, don't take this class. But if you're just fulfilling a requirement and don't really care for economics, go for it. Be aware that you will always be reading the textbook. \nWorkload:\nWeekly problem sets with ridiculous typos and senseless multiple choice questions. Quizzes that do absolutely nothing for you. Midterm with a terrible curve. Final that will make you want to gouge your eyes out in sheer frustration/boredom. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "January 13, 2010",
            "review_content": "\nI learned a lot in this class and I enjoyed the lectures. Professor Musatti is a very approachable woman who is clearly passionate about teaching. Sometimes the lectures got confusing when she rushed through models whose variables I could not keep track off, but she usually went over it again the next class when she had more time. The problem sets were generally time-consuming, but not impossible. It is very important to work in a group for these. The first midterm was ridiculously long, very few people finished it. The second midterm was more manageable. The final was absolutely fine. She drops the lowest 2 problem sets and generally tries to weigh your averages in a way to give you the highest grade possible. \nThe TAs meant well in recitations but were not generally that helpful. They were also very strict about grading. If you skipped a step or worked a problem in your own way you got very little credit. They seem to not know the definition of partial credit or error carried forward. \nWhile this class was time consuming, I am of the opinion that it was worth it. \n\nWorkload:\nThe problem sets generally took me about 3 hours, except for 1 problem set that took me about 10 and another that took me about 5. It is very helpful to work in a big group. The recitations were. . . sort of helpful. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 12, 2010",
            "review_content": "\nJust not a very inspiring class. The course was often a drag even though she is engaged in the material and sounds like she is excited about it. Beware that on some days she will come into class and you can tell she is not as engaged as she was last week, which as a result, produces a very boring class with very little substance.\nYou can get by on reading the textbook, but like the poster below me, if you aren't in lecture and ACTIVELY paying attention you will miss a good deal of questions on the exams that test specifically for random tidbits she brings up in class. I found her TAs to be pretty much useless.\n\nWorkload:\nOne midterm, one 50% final (better study up or it will really drop your grade). You should study the test questions she gives you from past years of teaching. A lot of these problems you won't be able to know how to understand just by going to lecture or reading the book. There is a strange, somewhat esoteric style to how she asks these questions that you will get used to if you read old tests. Just because you know the material doesnt mean you know how to answer her questions. Problem set every week, often vague.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 01, 2010",
            "review_content": "\nThis woman has the best of intentions when it comes to providing the best lecture experience for her students. She tries as hard as she can to provide analogous anecdotes to clarify the material at hand. Most of the time,however, she completely confuses the issue and ends up sounding crazed. This often makes for an...interesting...lecture but makes it necessary to filter out and distinguish the relevant material. \nI stopped going to lectures about mid-way through the semester which proved very unwise. While it sounds impressive to highlight how little effort you put into a class yet how well you turned out, and while this trend seems ubiquitous at competitive schools like Columbia, I can honestly say that this could not have been the case for anyone in her Principles class. If you did not attend lecture, you risked missing material that was not covered in the textbook or in the recitation sessions. She even had the notion to put a definition question on the midterm that wasn't mentioned in the textbook and that she had very briefly covered only once in lecture. That being said, attending her lectures is essential. \nThe problem sets are straight forward but the midterm is extremely tricky and convoluted with no sufficient curve to compensate for its difficulty. Having excelled in economics in high school, I can confidently say that her tests require study time. I shirked studying and it came back to bite me in the ass. \nHer TA's are terrible. Ter-Ri-Ble. They provided little assistance when needed and only two spoke coherent English. \n\nWorkload:\nWeekly problem sets, The occasional \"pop\" quiz, Midterm, Final\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "December 18, 2009",
            "review_content": "\nMusatti is clearly interested in the material, and seems pretty excited to present every topic in the class. I think her style works for some people, such as those who like bad jokes and weird voices. There were ~5 separate lectures where she \"chastised\" the class for daydreaming/not participating. Each time, she followed this by saying she understood that the material might be \"dry,\" but that it was \"nothing compared to econometrics.\" OK, it might be, but did you ever think that your method might be flawed for the audience? It wasn't the material that was not interesting, but the delivery that lost me and a lot of others (3/5 class showed up per lecture, I'd say). \nAlong those lines, she more or less criticized the class for not working hard enough after the first midterm when the mean/median was around 60%. Well, isn't the whole point of a distribution to get the normal scores of everyone? It doesn't mean we didn't try hard, it's just that, well, your test was geared for the average to be about 60!!! (2nd midterm mean was ~60 as well, I believe)\nOther negative: Class rarely (never?) ended on time, sometimes going 10 minutes overboard.\nWhile the negatives outweighed the pros for me, it WASN'T the WORST class ever...  \n-For one, it's not that difficult to be realistic and get the grade you hope for. The curve going into the final exam is:\n88 and above     A\n80-87          A-\n72-79          B+\n65-72          B\n60-64          B-\n55-59          C+\n50-54          C\n45-49          C-\n35-44          D\nless than 35   F\n\nWorkload:\n10 Problem Sets (2 lowest dropped), 2 midterm (2nd one non-cum.), Cumulative Final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "June 26, 2009",
            "review_content": "\nAs the other reviewers have already mentioned, Musatti is a really, really nice woman who tries very, very hard to make lectures interesting. That being said, the class can be a real drag at times and its very hard to pay attention.\nSure, it is easier than Gulati's class but it can get very annoying, as the weekly problem sets have vague wording, typos and just random options to multiple choice questions.\nIf you want a good grade, take this class, read the textbook and her notes well and you'll do great. But if you want to be engages and be actually interested in the material, I wouldn't recommend this class.\nAs hard as she tries, she can go overboard and off track and the economics aspect is lost sometimes. \nEconomics has been my favorite subject for years but I still found it tough to make myself go to class and try to concentrate.\n\nWorkload:\nWeekly problem sets that take an hour or so to do and TAs go over similar problems in weekly recitation sections.\nOne midterm, one comprehensive final and six in class quizzes where you can use your notes and consult your friends. \nThe reading is quite a bit, but overall Musatti doesnt try to trick you on the exams and they are pretty straight forward and easy.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 31, 2009",
            "review_content": "\nMusatti is a nice woman but she is SOOOOO boring.  I went to class but I could not pay attention.  I should have skipped lecture and just read the book because she is such an uninteresting lecturer.  After this course I really dislike economics and I hope to never take another econ class.\nWorkload:\nweekly homeworks that take about an hour or less.  pop quizzes that are easy.  sort of tricky midterm and final.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 19, 2009",
            "review_content": "\nMusatti tried really hard to be a good teacher, she really did. Too hard sometimes, and the class was often boring because of it. Maybe half the class comes to lecture, and its not really necessary to come to lectures, you don't really learn much. Recitations are required and should definitely be attended, but overall, Musatti is a much easier alternative to Elmes.\nWorkload:\nMedium. Weekly homework sets which took a few hours, but normally one of the recitation teachers went over them. Midterm (Easy but people did poorly) and final, harder, but still manageable. \n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "May 16, 2009",
            "review_content": "\nI was in Gulati's for two weeks, and then I transferred into Musatti's because of a schedule conflict. I honestly can say she's better.\nMusatti is charismatic, and she is funny. She litters the lectures with international wisecracks and sexual puns. When her phone rings, she blames her son's soccer coach. She throws a lot of effort into bringing out the principle concepts to the student. She helps a lot in office hours, and if you have dissenting opinions, she always is up for a brief discussion of views in her office. She brings up dissenting and alternative views of the economy often.\nHer accent is not a bother and is if anything, pleasing to the ears.\nThat having been said, she sometimes wanders away from the main points in the middle of lectures. This can become annoying, but it often leads to other points, which can be a very positive moment in the class.\nWorkload:\nThe problem sets consist of 4 to 6 multiple choice questions, 2-3 definitions and a few short answer questions.\nWeekly problem sets, which are basically smaller scale versions of the midterm and final. \n\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 26, 2009",
            "review_content": "\nMusatti tries so hard to be a good professor, you can really see it. She stays for more than an hour after class answering everyone's random questions and should really be credited for trying to connect with students. This being said, I feel the best comparison for Professor Musatti is with Robin Williams. The crazy, high-energy lecture style is engaging, however, it sometimes goes over the top while losing where it was headed in the first place. If effort was all that mattered, Musatti would be hands down the best professor at Columbia. I still think she's a good professor, but she's straining herself trying so hard.\nRegarding course material, it's pretty generic. It's economics without some of the frills and thrills that others (read: Gulati) throw in, but she does a solid job of getting it all through. The recitation sections are fairly mundane. The tests are not easy, the recommendation is to attend her review sessions which help a lot. The class curve is mild, you're not getting bumped up a huge amount.\nWorkload:\nWeekly homework problems averaging about three pages in length (moderate difficulty, erratic grading), one midterm (difficult), and one final (not easy either). Homework isn't bad, but the tests will really challenge you if you're not prepared. The multiple choice in particular is a killer.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "December 10, 2008",
            "review_content": "\nThe accent is not the problem--I personally feel that her lectures are kind of all over the place, or you don't really see where she is going till the very end. I'm actually taking this class pass/d/fail and I have a d (without any curving)---I have NO idea what I'm doing wrong but I think this is a complete oddity in the system; the course is supposed to be pretty easy, I'm just not really interested at all which has probably helped to bring my grade down. Musatti is nice though and she sometimes makes us laugh which is definitely appreciated. \nWorkload:\nweekly problem sets (12 in total), 5 quizzes (she says 6 at the beginning though) that you can use your notes and your neighbors, midterm, and final\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "April 28, 2008",
            "review_content": "\nMusatti is very good, much better than some of her reviews make out.  She tries to engage the class and is quite charming.  She also does a very good job of explaining concepts, especially in conjunction with the textbook (Hubbard and Obrien), which is excellent.  (I found it helpful to read the chapters after the lectures, everything was pretty clear.)\nDefinitely take her.\nWorkload:\nweekly problem sets that take a little over an hour with a partner.  Graded pretty easily, and helps to reinforce the concepts and give you an idea of what the exams will be like.  (For the midterm, she also gave us a sample midterm with solutions and last semester's midterm.)  Six quizzes sprinkled throughout the semester.  They are unannounced and you can work with the people sitting next to you--again, the purpose is to make sure you come to class and to reinforce the concepts.  Generally pretty easy. Midterm and final.  She gives a great 2 hour review session for each that is very helpful.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 28, 2008",
            "review_content": "\nAnna Caterina Musatti is a good Econ. teacher. Her homeworks do take time and effort, but they really help you understand the material. Recitations are also really helpful for this class; don't skip them! Anna Caterina herself really knows Econ. and is a clear lecturer. But never do a crossword, play hangman, or watch a movie on your laptop in this class! She'll point it out and the rest of the class will stare at you.\nOverall, recommended.\nWorkload:\n1 problem set a week, which took about an hour or 90 minutes to do. Occasional quizzes which consist of one or two questions and are open-notes and open-neighbors. Midterm and Final, challenging but certainly not impossible and very similar to the homework sets.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 26, 2008",
            "review_content": "\nWell, at least the grading was pretty generous. The only positive I really can take from this class was the generous curve that with a great deal of studying was pretty easy to land on top of.\nAs for everything else: thumbs down. The lectures are brutal - although she speaks English well, it gets pretty tough to follow along after a while - especially when she introduces new material. After the 3rd lecture I didn't pay attention at all and only went to a few recitation classes - I read the book throughout the semester on my own and was able to get a good grade. Only thing that kept me in class were those 6 quizzes that she gave us.\nGranted, a fair amount of material is covered in class, and it probably wouldn't hurt to pay attention. If you want to get anything out of the lectures, sit up front. 99% of students in the back A.) couldn't understand her and B.) fell asleep.\nSo it all depends on what you want. I know that Musatti's class is easier than Gulati's, but that Gulati's is much better and far more interesting. All depends on what you're looking for.\nWorkload:\n1 Problem Set every week, takes about an hour and isn't too difficult. A lot of answers are in the book. 6 quizzes given throughout the semester that are jokes. You can do them w/ as many partners as you'd like and use the book/notes too. Midterm and Final follow the same guidelines as her practice exams, so study up on those. Exams are of medium difficulty, and again, enjoy the curve.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 21, 2008",
            "review_content": "\nGreat teacher!  She has a bit of an accent, but you get used to it fairly quickly.  Her lectures are fairly dry, but informative.  You will have weekly homework assignments that take about two hours each, but they definitely help you understand the material.  The midterm and final are challenging but fair.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "January 20, 2008",
            "review_content": "\nProfessor Musatti is probably the most consistently up-\nbeat lecturer I've had at Columbia. She always tries really hard to stay energetic about the topic each day and she does a really good job at breaking things down in very understandable terms. She is funny a lot of the times in class and she is an extremely pleasant person. There can be a lot of typos on her problem sets, which got a little frustrating, especially because the wording of some questions makes all the difference. This could be easily fixed though, even if it just means having someone else proof-read for her. The text book for the class is very good also, so if you consistently read the chapters assigned for each week and actually listen to what she says in lecture, you can do well in this class. Her midterm and exam were very fair, no tricks, and she gives practice exams (which you should definitely go through because the real exam follows the practice very closely). \nDiscussion sessions for this class turned out to be somewhat of a joke, just because a lot of the more technical things that we went over in discussion weren't on the problem sets. This was a very good thing, especially because my TA wasn't nearly as good at explaining the concepts as Musatti is. Overall, I think Musatti is as good as they come, and I think with time she will get even better.\nWorkload:\nWeekly problem sets, quizzes in lecture (you could work with other people and they were a breeze), midterm and final. Definitely recommended to read everything in the textbook.\n"
        },
        {
            "course_name": "Principles of Economics",
            "review_date": "September 04, 2007",
            "review_content": "\nI really liked Prof. Musatti. She has a quirky sense of humor but seemed to make most of the class laugh. She goes through the material on a basic level, but it is definately very useful to read the book. I would recommend reading the chapter(s) before attending her class. That way, her teaching just affirms what you will already know. Principles is a very straight forward class and shouldn't be too hard for someone that puts in a decent amount of time. She is very approachable and helpful at office hours as well.\nWorkload:\nWeekly problem sets that are not too chalenging and you can drop one. A mid term that isn't too bad, a few small tricks maybe, but manageable. The final was long but fair and reflective of the material.\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "June 09, 2007",
            "review_content": "\nI chose her because all the culpas for all the other professors that were teaching micro said avoid at all costs. She was just as bad. She was kind of entertaining but that did not hide the fact that her teaching skills suck. She is really nice, but cant explain anything very well. I sometimes wish I had taken micro with Elmes because although it would have been harder and more stressful, at least I would have learned. \nWorkload:\nWeekly problems sets due every friday which could get annoying. Midterm- VERY VERY FAir. she pretty much told us the exact problems that were gonna be on it. Final- much different. The problems were not hard, but she simply did not specify the types of problems that were going to be on her study sheet like she did for the midterm. \n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 14, 2007",
            "review_content": "\nOh, Anna, Anna, Anna.  Whatever shall we do with you? You are so sweet, and obviously trying so hard to be a funny, hip, approachable teacher.  And you suceed on all those points, you really do.  But there's still a missing element in your class, in your teaching style...one that makes the students care, and want to try hard to do well.  One that makes them want to come to class and learn.  With some careful thinking and editing of your lecture notes, you could have a devoted following.\nMy major frustrations with the class were mainly pertaining to the problem sets, which were only put online on tuesday or wednesday, and then due on friday.  Great if you have time during the week, hell if you don't.  Either way, you always end up rushing to get it in, sometimes accepting that you only half finished it and probably could have done the rest if only you had a bit more time.  \nMy other frustation was the typos.  Typos everywhere, in the problem sets, in the lecture notes, in the exams, in the solution sets, in the recitation notes from the TA's.  Studying for the final was a nightmare of frantically emailing TA's trying to figure out how on Earth some of the answers were reached; studying was full of wasted time wondering why you got the wrong answer, why weren't the numbers working.  \nThe last frustration was that, after coming from Gulati's fast paced yet clear and organized principles class, Musatti's teaching style was slow and scattered.  She did make sense when you re-read your lecture notes but during the lectures you would tend to forget what it is she was doing and why.  Also she would cover topics that we learnt in principles pretty extensively, and somehow skim over things we'd never seen before.  The textbook was pretty useless, given that there was little math to speak of in the book, but the course was heavily math based.  It was okay for the general concepts of micro. \nOverall, Musatti has the making of a good teacher if she gets her stuff together, but this course needs alot of refining to make it engaging and cohesive.   \nWorkload:\nweekly problem sets; a midterm, relatively easy; a final - long but not too hard, most didn't finish I think\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "May 07, 2007",
            "review_content": "\ni too took this class because both other profs had reviews that said avoid at all costs. Ladies and gents, AVOID AT ALL COSTS. at least the other teachers TEACH, even if they are difficult. Mussati is not only unorganized and incomprehensible, she is rude to students, makes mistakes constantly, and thinks she's amusing when no one is laughing. every single problem set had \"errors\" that she informed us about the night before they were due. Problem sets were impossible only because she never taught. The entire, and i mean entire semester is self-taught. oh, and the textbook sucks. good luck. \nWorkload:\nproblem set weekly (takes too long bc she doesnt teach), midterm, final (cumulative)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "April 04, 2007",
            "review_content": "\nClass can be a frustrating experience as her lectures seem to go in all directions and touch on all sorts of loosely-connected concepts (except for the ones listed on the syllabus). That being said, she is always very helpful during office hours and the Problem Sets are comprehensive enough for you to learn (with the help of the textbook) the basics of Microeconomics.\nI'm not sure how she compares with the other Micro professors but she's highly approacheable and the PSets are manageable once you read the text.\nWorkload:\n1 midterm, 1 final, weekly PSets (posted on Tuesday/Wednesday night, due on Friday afternoon)\n"
        },
        {
            "course_name": "Intermediate Microeconomics",
            "review_date": "February 28, 2007",
            "review_content": "\nShe's somewhat entertaining in class but doesn't really TEACH the material. I only chose her because reviews for the other professors said \"AVOID AT ALL COSTS!\" you definitely don't need to avoid her at all costs, but plan on being a little confused in class and referring to the book to get your problem sets done.\nWorkload:\nweekly problem sets assigned on monday, due friday\n"
        }
    ]
}