{
    "prof_info": [
        {
            "prof_name": "Amanda Springs",
            "prof_id": 4525,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 09, 2014",
            "review_content": "\nI was in the same situation as the review below - after scouring CULPA and finding horrible, horrible reviews on Prof. Springs, I tried my hardest to get out of the class, and didn't succeed. Now that it's the end of the semester, I can safely say that this was one of my favorite classes this semester. Prof. Springs is very knowledgeable and so very willing to help out students any way she can. The only time I saw that she used her iPad during class was when she was taking attendance from it. Although I may be mistaken, I do not believe she was ever disengaged because of it. She always responded promptly to my emails, and was always available during office hours. In my opinion, she was a pretty great professor!\nWorkload:\nWhat you'd expect. Two papers and a podcast, which she said was new to the syllabus. No midterm or final.\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 09, 2014",
            "review_content": "\nI was in the same situation as the review below - after scouring CULPA and finding horrible, horrible reviews on Prof. Springs, I tried my hardest to get out of the class, and didn't succeed. Now that it's the end of the semester, I can safely say that this was one of my favorite classes this semester. Prof. Springs is very knowledgeable and so very willing to help out students any way she can. The only time I saw that she used her iPad during class was when she was taking attendance from it. Although I may be mistaken, I do not believe she was ever disengaged because of it. She always responded promptly to my emails, and was always available during office hours. In my opinion, she was a pretty great professor!\nWorkload:\nWhat you'd expect. Two papers and a podcast, which she said was new to the syllabus. No midterm or final.\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 09, 2014",
            "review_content": "\nI was in the same situation as the review below - after scouring CULPA and finding horrible, horrible reviews on Prof. Springs, I tried my hardest to get out of the class, and didn't succeed. Now that it's the end of the semester, I can safely say that this was one of my favorite classes this semester. Prof. Springs is very knowledgeable and so very willing to help out students any way she can. The only time I saw that she used her iPad during class was when she was taking attendance from it. Although I may be mistaken, I do not believe she was ever disengaged because of it. She always responded promptly to my emails, and was always available during office hours. In my opinion, she was a pretty great professor!\nWorkload:\nWhat you'd expect. Two papers and a podcast, which she said was new to the syllabus. No midterm or final.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "September 22, 2014",
            "review_content": "\nAfter reading some of these reviews, I walked into my FYE on the first day feeling pretty bummed out about Prof. Springs. Although I've only been in her class for about a month, I think she's great. I don't know what changed this year, but I found her to be so approachable, witty, and intellectual. She gives us extensive background information on the texts we're reading. She really helped me develop the direction of a paper I was writing for a close-reading assignment, and overall, I really believe that she genuinely cares about her students. I had such bad expectations going into the class, but honestly, she's amazing. I really enjoy her class, her teaching style, and the fact that she is so incredibly knowledgeable about everything. I never once had a question she did not know that answer to. Thumbs up from me. \nWorkload:\nNot too bad. Some books, two essays, and a research paper. \n"
        },
        {
            "course_name": "First-Year-English The Americas II ",
            "review_date": "August 21, 2014",
            "review_content": "\nThis was probably one of the worst classes I have ever taken and by far the most incompetent teacher I have ever had. Professor Springs did nothing to control class discussion and often seemed to be totally ignorant about the texts we were reading. \nShe spent the whole class on her iPad seemingly hoping the class would teach itself. While being condescending to students and touting herself as some sort of expert on Latin American literature and culture, she was usually uninformed about the books and authors we read and unwilling to hear new information from students. She was never available outside of class and never ever replied to emails. She left assignments vague or gave a pattern of far too little and far too much reading, meaning that most students never ended up reading the texts we were assigned. While many of the texts were interesting, she seemed to have chosen them at random, once dodging the question of how they were selected with the response \"well, what do you think?\" Her grading for essays was unclear and seemingly based on nothing, and often times it was clear she had not in fact read the student's work. I chose this class because I love North and South American Literature and I have never been so disappointed with a course and its instructor. How Barnard is still employing Professor Springs is a mystery to me, because she is payed to do nothing. If you are already in this class, I am sorry and advise you to do everything you can to switch out.\nWorkload:\nVaried readings (usually absurdly long or far too short), a research paper final, 2 essays, one class where you lead a discussion (so she has even more of an excuse not to teach)\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "July 21, 2014",
            "review_content": "\nThis is the first CULPA review I've actually taken the time to write. Why? Because I'm THAT frustrated with the experience I had under the wings of Professor Amanda Springs.\nI am not at all denying that she's a very accomplished, intelligent researcher/literature enthusiast. She's mentioned that she does a lot of research/work outside of the classroom on a national level (completely unrelated to Barnard).\nAnd so begins my \"but,\"\nShe never helped direct the class discussions and seemed, overall, unprepared as a lecturer. Worst of all, she would shut down any opinion that didn't align with her own. Isn't that the opposite of what you're supposed to do in a discussion-based seminar?\nI enjoy literature. I enjoy writing. I do not, however, enjoy writing, editing, and rewriting papers for professors who have no interest in fostering the academic growth of their students.\nWhich reminds me! We were required to turn in rough drafts of each of our essays and her feedback would be very similar to this each time:\nDear [student name],\nI like where you're going with [subject]. Expand on [subject].\n-A[middle initial]S\nIt's a shame that she's teaching any FYE/FYS classes because this was an awful experience to have as a first year and really does no good representing academics at Barnard.\nWorkload:\nfirst year books and about 3 essays\nfinal research paper\n"
        },
        {
            "course_name": "The Americas",
            "review_date": "July 02, 2014",
            "review_content": "\nPlease, please do not take this class - it will cause you to hate English, hate Barnard, and, without a doubt, hate Professor Amanda Springs. She is, in every sense of the phrase, an awful educator. As many others have stated, I went into the course loving reading and enjoying intellectual conversation - two predilections Springs sought to destroy with all of her might. Springs offers virtually nothing as a professor - she arrived to class very late, she typed on her iPad the entire course while insisting we \"talk amongst ourselves\" about a theme. When we went to reconvene, she remained seated with her eyes down, looking at her iPad (texting? playing Angry Birds? writing comments about us? The world may never know). The class was student-run to the extent that the professor was absent, not even directing conversation but just seated, occasionally looking up. Springs was not unfriendly necessarily, but she was wholly inaccessible - in lieu of office hours she exclaimed we \"email her.\" For the 8 emails I sent Professor Springs I received one response in which she called me by the wrong name - Ariella, when our class only had 14 people in it and none went by that name. On the upside, the class is not hard - because Springs does legitimately nothing during class time, you don't really have to have read to be able to participate because you're only speaking to your peers. The essays are graded mercurially, but Springs will give you as many extensions or rewrites as you want. \nOverall, I sincerely hope that Springs is replaced ASAP as she offers nothing to Barnard first-years and actively detracted from my spring semester. Her attitude and lack of teaching ability or ambition, who knows, made even the classic, excellent texts we read (Marquez, Faulkner, Neruda) seem dull. She is the worst educator I have ever had as a teacher in my 14 years in school.\nWorkload:\nAbout 1 200-pg book a week, but varies depending on the week. There were about 3 main essays, 1 research paper, 1 in-class presentation, and no final exam.\n"
        },
        {
            "course_name": "First-Year-English The Americas II ",
            "review_date": "May 02, 2014",
            "review_content": "\nAmericas II was by far the most pointless class I have taken thus far. I have absolutely no idea why Professor Springs went into teaching when she obviously doesn't give two shits about her students. Every class, I would show up in hopes that I would learn something valuable about the truly phenomenal writers we read (if you like American literature, you might actually enjoy the readings), but alas, she puts no effort at all into planning classes. Each class is run exactly like this: get there right on time and sit down, wait another 5 minutes for her to show up, wait for her to turn on her iPad (you will learn to hate this thing), she tells you to get into \"groups of two or three and discus the writer's use of language\" or something equally as vague and obvious, discuss as much as you possibly can with your partner, wait another 10 minutes for her to look up from her iPad and realize that the class has been waiting for her for 5 minutes, she tells us to share what we discussed with the class, nods like she knows something really interesting that we don't know (why the hell won't she tell us ANYTHING) and repeats this three or four times until the class is over. \nAnd all the other classes are run by student presenters who have absolutely no idea what they are supposed to be doing, but hey at least they are giving us information and popular opinion about a novel/author.\nI decided to take this class because I really do love English and wanted the opportunity to read some authors I had never read, but proceeded to learn nothing about them and often didn't even read because I had no motivation.\nI realize that students reading this have already been assigned this class for freshman English and can't get out of it. My condolences. \nWorkload:\n2 essays, 1 \"Research Paper\", approx. 1 book or collection of short stories a week\n"
        }
    ]
}