{
    "prof_info": [
        {
            "prof_name": "Tim Huh",
            "prof_id": 2076,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "W4210 Supply Chain Management ",
            "review_date": "March 11, 2009",
            "review_content": "\nI'm a little bit biased since this class defines the industry which I would like to work in, but Professor Huh did a great job of presenting the overview and providing additional resources so that the class could read case studies, etc.  The homeworks and exams seem to be a bit more based on what students would learn from experience rather than in classroom situations, so the best way to prepare yourself is by reading all the supporting material that is provided.\nWorkload:\nLots of reading, but reasonable\n"
        },
        {
            "course_name": "Game Theory",
            "review_date": "October 06, 2007",
            "review_content": "\nThe reviews above that state Tim Huh's propensity for errors in his class notes are absolutely accurate. His lectures are so full of errors because he chooses to derive the formulas in class as opposed to having them done beforehand, which makes no sense since he already has a hard enough time ending class on time. He rushes through irrelevant topics during his lectures, leaving his students baffled when it comes time to do homework, since nothing on the homework even resembles the examples he gives in class. I found the TA sessions to be much more helpful since the TA actually goes over the important things, rather doing what Tim Huh does, which is deriving some obscure equation that has no use but the professor finds to be \"interesting\". Going to his class and then attempting the homework is similar to being taught how to drive a car and then being expected to know how to fly an airplane. \nWorkload:\nHomeworks that don't take too long if you go to office hours but would otherwise be impossible if you actually tried to do them using only what Tim Huh teaches in class. He expects his students to have a full masterful understanding of the subject matter when all he does in class is teach us the most obscure examples in class. Finishing his homeworks without the help of the TA is impossible unless you have already learned the material before hand.\n"
        },
        {
            "course_name": "Intro to Production Planning, Inventory Control",
            "review_date": "July 21, 2006",
            "review_content": "\nTim Huh is my advisor. Sad to say. He is wishy washy and frequently makes errors in class and then blames the students for not \"catching him\" or passes it off as \"just testing.\" He seems to like to pick on students. First he asks for volunteers, but if you don't get it right, he will be relentless in reminding you how wrong you are. If you DO answer the question right, he accuses you of have learned the material in another class. He stutters a lot and easily gets lost in deriving his equations. The text is pretty bad and not worth buying/reading.\nWorkload:\nHomework is a joke and not helpful. The two projects offer no new insight to the material, but do them because they will help your grade. Tests are difficult if you mess up a formula (no calc/cheat sheet) but the curve is good. The final was easy (with cheat sheet). Ended up with a B+ even though I hit below the mean and on the mean from the two midterms respectively.\n"
        },
        {
            "course_name": "Production-Inventory Planning and Control",
            "review_date": "March 20, 2006",
            "review_content": "\nNot such a great professor as the previous reviews suggest. \nHe makes so many mistakes during his lectures that it's hard to follow what's going on.  Class time is poorly utilized as he focuses much time on specific, irrelevant things while leaving out what is tested.  His exams are very difficult as are the homework assignments.  Most people have no idea what is going on during the class.  The text sucks too.  I'm doing well in the class only because I know most of the material from other classes (I am a graduate student) but I can see how most students are completely lost.  Stay away from this class, if you can.\nWorkload:\n2 midterms (hard), 2 projects (fun, but stupid), homework assignments (hard), final, class participation (stupid)\n"
        },
        {
            "course_name": "Production Inventory Planning, Supply Chain Management",
            "review_date": "July 26, 2005",
            "review_content": "\nProfessor Huh was truly a great professor.  I took two courses with him this past Spring, and I'm thankful that I had two courses with a energetic, knowledgeable, and passionate professor.  He was very organized in his lectures and had plenty of activities/games to keep us engaged and learning.  In Production Inventory Planning, we worked in groups to manage a simulated factory, giving us first-hand experience in the importance of a good inventory strategy.  In Supply Chain Management, we also played games to help us gain a better understanding of the topic.  Professor Huh's enthusiasm is pretty contagious, and he has a pleasant sense of humor.  He cares a great deal about what students think and how the students are doing.  Definitely try to take his courses; you won't be disappointed.\nWorkload:\nWeekly assignments, small projects, article reviews, midterm, final... All very easy and interesting.  Not bad at all.  He's pretty generous on grading too.\n"
        },
        {
            "course_name": "Production Planning",
            "review_date": "June 02, 2005",
            "review_content": "\nDespite the fact that most people I know disliked professor Huh, I thought he was a very pleasant professor: he was funny, energetic, and very approachable. Though he wasn't the most articulate instructor, he makes up for it with his enthusiasm. It's quite hard to engage a class at 9 AM! He takes a different approach with his teaching, he encourages class participation. On top of that, he makes a big effort to learn everyone's names. As time went on, I relied on his class notes more than the book. \nWorkload:\nweekly problem sets-a bit tedious but very doable. two simple mechanical midterms and one difficult conceptual final. don't underestimate!\n"
        },
        {
            "course_name": "GAME THEORIC MODELS OF OPERATIONS",
            "review_date": "December 24, 2004",
            "review_content": "\nProf Tim is a wonderful professor who cares about every single student. The materials of this course is quite tough and very mathematical oriented, but he manages to keep the lectures interesting.  Overall, I would greatly recommend this professor. But for the course itself, I would only recommend it to people that are looking for very technical materials. \nWorkload:\nFair. 8 problem sets. 2 article reviews. Midterm/Finals.  Grading very fair. \n"
        },
        {
            "course_name": "W4210 Supply Chain Management ",
            "review_date": "May 11, 2004",
            "review_content": "\nA wonderful young professor. Although he is new at Columbia and very young, you will see his passion and enthusiasm from his teaching. His lecture is extremely organized and thoroughly well prepared. If you are an IEOR major (Or non-IEOR major who is interested in business management), you must take his course to see how the stuff we learned from other IEOR classes practically implemented in the real world. \nHe absolutely has in-depth knowledge in the subject matter and clearly delivers it with details and practical examples. Since his lecture is so practical and informative, you never feel bored (I hardly see people making absence for his class even though all the lecture notes and power points slides he uses are provided through online). In addition, he is a very friendly and considerate person and concerned every student keeps up with his class. A highly recommended class.\nWorkload:\nVery fair. one assigment per week and two article review paper(2-3 pages long) If you attend the class regularly, you will have little problems with midterm and final\n"
        }
    ]
}