{
    "prof_info": [
        {
            "prof_name": "Tara Gellene",
            "prof_id": 3080,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "June 30, 2009",
            "review_content": "\nSo I took this class in the Fall but I feel I must let people know how great Tara was. \nUniversity Writing can be a real pain, but Tara almost made it fun.\nThe work was quite a bit, but she was always nice about it, even willing to move around deadlines if the class was having a hard time or had midterms looming.\nShe was clear and concise in her explanations and helped as much as one can in a writing course. And she was so much fun in class! \nWhen it comes to writing, Tara really helped me find my voice as a writer and navigate what is required in this course.\nShe was always approachable, willing to set up office hours for the entire class, work around our schedules and always willing to help us. She gave really good feedback on everything we turned in and helped shape the writing process for each of the essays.\nYou can't really expect much more from someone teaching this course. That said, she was a fair grader and you really needed to truly work hard, do revisions, and work on your essays after she critiqued them to get a good grade from her but that's not harsh as such. All in all, I really enjoyed this class, even though the writing assignments can take a toll, and I have to say Tara had a big part to play in making this course enjoyable and a good learning experience for me.\n\nWorkload:\nShort writing assignments for every class, rough drafts for essays, revisions to essays, the works\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2006",
            "review_content": "\nWhat you get back from Tara is exactly what you put in. \nShe knows when you aren't working and it reflects in your writing. She's one of the nicest, most available people on campus, but you really need to take advantage of her kindness and meet with her often and take ALL of her suggestions.\nShe holds conferences before every paper is due and you need to absolutely go to those and take advantage of everything she says. She knows what she is talking about. \nIf you drift through the class, expect to get a C.\nShe's a tough grader, and that makes the conferences all the more important. It's essential you constantly improve yourself throughout the class. Don't make your first draft a throwaway draft. When she says she wants you to revise your paper for two hours, she really wants you to revise it for a whole two hours.\nIn the end, UW is a lot of work, but it really can be useful if you actually try. The material is boring and dry, but the writing you can churn out doesn't have to be.\nWorkload:\n4 essays--1 3 page retrospective, 1 5-7 page lens, 1 5-7 page conversation, 1 10-12 page research paper\n"
        }
    ]
}