{
    "prof_info": [
        {
            "prof_name": "Bogwang Jeon",
            "prof_id": 12866,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IV",
            "review_date": "June 08, 2015",
            "review_content": "\nBogwang Jeon is an excellent professor. He doesn't only understand his material himself, he also genuinely cares about his students and the quality of his teaching. As another reviewer mentioned, if you didn't enjoy your previous Calc course, he will make you enjoy math again. His lectures follow the book closely enough that it's easy to follow along and read up on things, but are structured and presented differently enough that it's really worth going to class. In addition, he's also just a fun guy to talk to.\nWorkload:\nProblem sets every week that take a few hours, but that are really helpful; 2 midterms and a final that aren't easy, but also not unreasonably difficult.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "April 27, 2015",
            "review_content": "\nI took this class Spring 2015 with Professor Jeon and would recommend him at least for a silver nugget.\nHe is the first mathematics professor I have encountered here that uses colored chalk, and it greatly helps in gaining a visual understanding of the material. He explains most steps very clearly, and if a student does not know how to get from one step to another, he'll answer the question right there. Sometimes his handwriting can be a bit unclear, but because he writes down most of the steps, it's easy to follow his work and point out any (rare) mistakes he makes on the chalkboard.\nHe also takes the time to go through the proofs of various theorems, which I appreciated because most of them were unfamiliar to me before taking this class. He teaches well, and I think I learn better in my one hour in his lecture than in three hours with the textbook.\nAt the end of the semester he spent the last couple of lectures on complex variables.\nHe does have a Korean accent, but it is not thick enough to hurt his teaching. He makes an effort to learn the names of his students (and even recognized me outside of class and said hello), and cracks jokes every so often about his Korean-ness and about how mathematics is better than physics.\nHis tests are fair, bordering on easy for those who are mathematically gifted. There are no trick questions - it is just six questions, where usually one of them is multiple choice. I am not particularly strong in mathematics, but I have done well under his methodical teaching style.\nWorkload:\nTextbook: Stewart 7th Edition\nWorkload: 3-4 hour p-set every week, ranging in difficulty. Only a couple questions are graded from each p-set.\nMidterms: Two midterms, but he grades the midterms generously if the average is low\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "September 02, 2014",
            "review_content": "\nI took Calc III with Professor Jeon class last semester (Spring 2014) and was thoroughly impressed.\nHe always started class with a review of the previous day's material, which probably helped the class members for whom math doesn't come easily.  If you're strong in math and think this would be a bit tedious, it was.  However, mathematics is all about developing complexity from basic rules, and his teaching style definitely helped me remember the basic rules we were using each day.  This was especially helpful on the first class of the week, considering 4 days had passed between classes, sometimes without homework to keep the material fresh.\nProfessor Jeon accommodated questions well and was patient during lectures.  His English had a Korean accent, but it wasn't thick enough to obscure the material.  I could see how a student might have trouble with his accent, however.  It mainly interfered with his understanding math questions, which are often asked without being terribly organized or coherent beforehand.  However, he allowed other students to chime in if they thought they could help class move along.\nHe would always use many colors of chalk to help communicate ideas to students, particularly when graphing equations.\nHe was also funny.  He made fun of his Korean-ness by asking a student to teach him British-accented English so he would sound smarter.  He made a joke about Gangnam Style.  He pretended to be a North Korean spy, which I can neither confirm nor deny.  If a student would try to start some banter with him mid-lecture, he would usually play along and have some fun before going back to work.\nThe only reason I would not give Professor Jeon a Gold Nugget is that he did not teach me how to think creatively in mathematics to prove new theorems.  It is very hard to teach this, but if I were not initially mathematically inclined, I doubt taking his class would truly inspire me to love mathematics or teach me to think like a mathematician.\nAll in all, though, I was very satisfied with my Calculus III experience.  Professor Jeon was funny, clear, and diligent.  His minor shortcomings should be no problem to anyone with any self-motivation to do well in mathematics, and would not detract from the grade of anyone less mathematically inclined.\n9/10\nWorkload:\nAs could be expected in a mathematics class, there was homework.  I did not usually find that I had more than 3 or 4 hours a week, but that probably depends on your math proficiency and work ethic.  I found the homework helpful, though.  It was worth my time to remember the concepts the professor lectured about, and I find that real math proficiency is only gained through repetition.\nI would not call this a blow-off class, but it was no problem for me.  Reading other reviews (if there are any at the time you are reading this) will give a more balanced view of the workload.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 15, 2014",
            "review_content": "\nProfessor Jeon is honestly the best. He made me enjoy Calc again.\nDon't get me wrong - Calc III is hard. It takes effort to do well on the tests. However, going to lecture with Professor Jeon is the best. He always starts the day with a joke - and keeps making the class laugh in between his examples. He's a great dude, and he teaches well. He never uses notes in class - his whole lecture comes from him talking through definitions, examples, and drawings on the board (It's really cool and scary - he knows so much about math he can actually RECITE the textbook. I love it, because that means he already knows the information, so he always focuses on how the students are reacting instead of how he should be recopying his notes), but always goes at a great pace and always asks for questions. What's even more surprising is that if you ask a question he will actually take the time to answer you the best he can, and will be really receptive to staying after class if you have something on your mind. I would recommend supplementing his lectures with the book and his office hours if you don't understand something, and sending him an email at his math.columbia.edu account always gets a response within the day.\nAll in all, he's a great professor, who knows what he's doing and is able to communicate it to his students. He is worth taking, and a great guy to get to know. \nWorkload:\nNot too bad.\nWeekly written and webassign assignments - the lowest three dropped\n2 midterms & 1 final = both kinda hard, but if you study for them you should do fine\n"
        }
    ]
}