{
    "prof_info": [
        {
            "prof_name": "Lucius Riccio",
            "prof_id": 1226,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Production and Operations Managemen",
            "review_date": "November 19, 2009",
            "review_content": "\nRiccio is simply the sweetest and funniest teacher I have had till now (and probably will have had in Columbia). His class, Production Management is very entertaining and interesting even though it is at 9am! He tells lots of personal experience stories which are always interesting and related to the topic being covered in class; he explains the chapters in a conceptual and practical way, contrarily to the theory we get in other courses. Sometimes he leaves it to you to figure out the mathematics (which is always easy to do for this course and well presented in the book). Oh! And he also has lots of good jokes to tell :)\nThe course Production Management is easy but very interesting; Overall, it's a survey of all the production process; a nice introduction to what topics we can encounter as EMS/OR/IE students. I strongly recommend it, especially with Prof. Riccio. \nWorkload:\nVery fair.\nRather easy and not long assignments for every class (as long as students do not complain for a reason or another). \nOne midterm (Prof. Riccio is considering to do two midterms, each covering less material of course). The midterm was long but very similar to the assignments. If you work on the assignments, you will do well on the midterm.\nFinal: I'll know whenever I take it! \n\n"
        },
        {
            "course_name": "Design and Management of Production/Service Systems",
            "review_date": "September 04, 2009",
            "review_content": "\nClass consists mostly of analyzing and discussing Harvard Business School case studies, which I found pretty interesting. He also gave a broad overview of topics such as quality control, supply chain planning, capacity planning and more. There are group write-ups of the case studies that need to be submitted (usually one per week) and occasionally other additional homework. We also had to read the book, \"The Goal\" on our own, which was surprisingly not that dry and boring. He likes and encourages class participation. \nMidterm was longer than expected and thus there were a few people who didn't finish. He then adjusted the length of the final exam. If you paid attention in class, did the homework and read/analyzed the case studies, both tests were not bad. \nWorkload:\nGroup write-up of a case-study per week. Midterm & final.\n"
        },
        {
            "course_name": "Studies in Operations Research",
            "review_date": "January 01, 2006",
            "review_content": "\nRiccio is a great guy. He's extremely sociable and runs his class basically as a time for him to tell stories about his career in public policy.  He's interesting to listen to, but it is true that he never shuts up.  If you want a good grade then take a Riccio class.  If you want to learn a lot, don't take the class. \nWorkload:\nA couple of hw's that didn't count for much.  No midterm or final.  One project that most groups just do in the final 2-3 weeks of the semester.  GO TO CLASS.  He gives grades based on your attendance and how well you chat it up with him. \n"
        },
        {
            "course_name": "Design and Management of Production/Service Systems",
            "review_date": "October 18, 2002",
            "review_content": "\nRiccio is an amusing professor. His resume is impressive, and his lectures are peppered with pretty funny comments about his experiences. While his class is unstructured, and it may seem as though lectures are aimless, I didn't find it difficult to attend class at least semi-regularly. He generally keeps things pretty interesting, and if you pay attention, you may even pick up some points that are pretty useful. The structure of the class is centered around case studies (yes no midterm or final) of which half are done in groups that you can pick. The case studies are meant to apply what you pick up during his 2 1/2 hour lectures, although they are standard Harvard business school cases (read: find the solutions online). The grading is pretty generous, though it's based on the TA's grading of your cases. All in all a good elective to take if you're an IEOR major, and a friendly and english speaking (!) professor to boot.\nWorkload:\nNot bad. Weekly case studies, most of them group work. No midterm or final.\n"
        }
    ]
}