{
    "prof_info": [
        {
            "prof_name": "Lena Edlund",
            "prof_id": 1842,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Gender and Applied Economics",
            "review_date": "December 01, 2013",
            "review_content": "\nThis class is definitely one to take Pass/Fail. The material in this course is fascinating and the readings, though sometimes long, are not too hard to understand. You learn about marriage, prostitution, and the role of women in the labor force from an economic perspective, and it is fantastic if you're looking for an elective that doesn't simply deal with theoretical models.\nHowever, professor Edlund simply does not know how to write an exam, and grading will, in turn, not reflect what you know. You have three exams over the course of the semester, and they are all ~30 question multiple choice exams [the type where getting a wrong answer will get points deducted]. The average on these exams is about a 50%, and each exam is invariably followed by a class session where people argue (relatively successfully) that certain questions on the exam should be crossed out since they bear little to no relation to what was studied/discussed in class.\nFor example, one of the questions on the second midterm this semester asked whether a particular researcher differentiated fruit flies on the basis of a) an altered genetic code, or b) their chromosomal patterns, read: NOTHING TO DO WITH ECONOMICS\nOnline quizzes are pretty much in the same vein as the midterms, though you only need to get 50% of the questions right to get full marks for each quiz (gee, I wonder why).\nThankfully, I am doing well in this class, but I attribute this to mostly lucky guessing on the exams. I repeat: they do not test your knowledge of economics at all.\nWorkload:\nAssigned readings for each class: 1-2 research paper(s) \nWeekly Online Quizzes\n3 exams (final, given on the last day of class, is cumulative).\nA significant portion of your grade will come from online quizzes and participation. Attendance counts towards your grade. Exams do not test knowledge, so make sure you participate in class a lot to guard against a low exam grade.\n"
        },
        {
            "course_name": "Gender and Applied Economics",
            "review_date": "January 12, 2013",
            "review_content": "\nGreat class great prof who has actually published a lot of great papers in the field. I was really intrigued by the topics though so am biased. This is not your traditional class on how women are underrepresented in the workplace etc but looks at more interesting topics like prostitution, sex ratios, politics, marriage, divorce. This is also not your traditional feminist class where all you need to do is champion women's rights to get a good grade. I think a lot of people are frustrated with the class because it wasn't they expected from a \"gender economics\" course. I will admit that if you don't give a fux about the history of marriage and divorce laws or about sex selection in different regions, this class may seem dry and unfair to you. Why? Because that's what you will have to listen to every class, because that's you will be forced to conceptually understand on the exams. By the way, the tests are not random! We cover prostitution in class and in the readings, and online quizzes... guess what there are questions on prostition on the test!! If \"random\" means that the exam questions weren't exactly the same as the online quizzes , then yeah I guess you could make that argument. Otherwise do the readings and go to her office and you'll be fine.\nIf the above topics sound interesting to you, you will love the class as I did and you will probably come out with a good grade. \nWorkload:\nPretty light. May seem like a lot of readings but online quizzes help you keep up with them and you can get away with skimming parts. Knowing how to read an academic paper is def a plus going in but if you have never been exposed to them before, you will learn here!\n2 midterms, final\n"
        },
        {
            "course_name": "Gender and Applied Economics",
            "review_date": "December 10, 2012",
            "review_content": "\nProf Edlund was a pretty engaging lecturer.  The course material itself was very interesting as well, and I never felt bored.  I did feel that this was more of a sociology/anthropology course than economics (not a complaint, just not what I thought I had signed up for).\nHowever, the exams were a disaster.  There were 3 multiple choice question exams throughout the semester which were arbitrarily worded and assumed previous knowledge that should not have been assumed.  \nPerhaps this would be a good class to take pass/fail.\nWorkload:\nlight. Readings for every class (a paper or two), with reading quizzes to be done online (>50% meant full credit). 2 midterms, 1 in class final, all multiple choice\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "December 13, 2011",
            "review_content": "\nI took this course out of personal interest in labor econ, and I continue to be interested in the topic. Lena Edlund won't kill your interest in the topic, but she does serve a pretty big blow to student morale. Her lectures are relatively interesting, although her speech isn't riveting. Sometimes she'll spend too much time explaining one or two papers on a specific topic (ex: human capital development and education) instead of providing a broad overview of the scholarship. Some of the topics covered are expected (labor supply, monopsonies, etc) and some are unusual but interesting (ie, female labor supply and the pill). You'll come out of lecture with vague conceptions but not the entire story (or the ability to articulate it). \nWorkload:\nWeekly problem sets, which were fine until midway through the semester she forced us to start working in pairs. Not cool. Two midterms and a cumulative final. The midterms were incredibly difficult and often covered material that wasn't taught in class. In many cases the multiple choice questions were designed to trick students. She doesn't give partial credit, and she takes points off for wrong answers on multiple choice questions. Seriously removes the incentive for students to try their best. Final was quite easy by comparison (but was given Dec 7, before the semester was even over). Professor and Ta were not very receptive to criticisms about the assignments and exams.\n"
        },
        {
            "course_name": "Gender and Applied Economics",
            "review_date": "November 11, 2010",
            "review_content": "\nAgree with what the previous reviewer said - Lena is VERY smart, and her lectures show that. The workload isn't extraordinary, and it's very easy to skim the articles and then sit and soak in her lectures - no problem sets, and the exams require you to analyze arguments from the articles and justify your own opinion. \nLoved her, and loved her course. You'll emerge from this with plenty of good fodder for cocktail party chatting. \nWorkload:\nNo problem sets, 2 exams, light reading\n"
        },
        {
            "course_name": "Gender and Applied Economics",
            "review_date": "December 28, 2009",
            "review_content": "\nThe previous reviews are outdated and terribly misleading. Let me start by saying that I took Professor Edlund's Gender and Applied Economics course this past semester and it has not only been my favorite course in the department, but probably my favorite class at Columbia period! So... know that you're getting a somewhat biased review since I'm probably more fascinated with the material than most. Nonetheless, my fellow students all seemed to like the class as well; several others were noticeably engaged in lecture so please, trust me that this is an excellent class.\nThe material covered in Gender and Applied Economics is incredibly interesting. We looked at contraceptives, parental investment, marriage, labor markets, politics, sex ratios ... the list goes on. As some of you may know, most of the work on family economics has been influenced by Gary Becker's work. While we did study Becker, we also read Professor Edlund's super interesting and original research that draws upon evolutionary biologists and anthropologists. Seriously, if you're even remotely interested in gender economics read her papers on prostitution and why women became left wing even if you decide not to take the class -- so interesting!\nWhile the Professor Edlund's enthusiasm and the fascinating material should be reason enough to take this class, the workload is also totally manageable and not particularly stressful. I guess you would say the class is mostly \"conceptual\"; there are no problem sets and while the required journal articles include mathematical proofs she doesn't expect you to solve them. Her exams are NOT random! It's true that you can't just memorize what's on the slides to do well, but if you could that would be a bad test! If you go to class, pay attention/take good notes, and thoroughly read and understand conceptually what's going on in the the required readings and you will be fine. There is not a lot of partial credit on the exams so it's important to study hard, but I still thought Professor Edlund was exceedingly fair. She had two midterms each worth 15%, class participation worth 20% and a final exam worth 50% so there were plenty of opportunities to improve if you messed up.\nFinally, Professor Edlund herself was by far one of the best professors I've had in the department. She was enthusiastic and excited about the material and genuinely seemed to enjoy teaching the course. She had us all introduce ourselves on the first day of class and knew everyone's name almost immediately which made for a great classroom environment. She was also extremely open to student feedback/suggestions. Unfortunately I already took Labor Economics with Lalith Munasinghe a couple of years back, but if I hadn't I would take it with Edlund next semester. \nTo sum up: great professor, great class!\n\nWorkload:\n2 midterms 15% each, class participation 20%, final exam 50%\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "January 15, 2004",
            "review_content": "\nWho wrote that professor Edlund treats students like adults??? Her class is very boring and dull. She spends a lot of time going over obvious issues and skips all of the analytical parts of the course that actually do need explaining. But because she makes attendance mandatory and knows your name you have to suffer through her lectures. Furthermore, your performance on her tests is pure luck! They are not related to her lecture notes or the textbook so you are pretty much lost and on your own even if you do study. She ONLY grades your answers so there is NO partial credit. On the bright side, because everyone is as lost as you are, the curve is very low and you can manage an OK grade even if you learned absolutely nothing. DO NOT TAKE THIS CLASS IF: you want to learn, or if you want an easy A, or if you are actually interested in the material.\nWorkload:\nTwo midterms and a final. All random!!\n"
        },
        {
            "course_name": "Labor Economics",
            "review_date": "December 07, 2003",
            "review_content": "\nProf. Edlund is very middle-of-the-road.  On the one hand, she runs the class as though it were high school: she takes attendance, learns your name, employs (relatively) current events, and frequently has the class pair off to discuss some topic or work on a problem.  On the other hand, she realizes that her students are in fact adults, and she treats them as such.  Her teaching style is not particularly thrilling, and she won't turn you on to labor economics (will anyone?)...but she is always happy to answer questions, and she'll even look up the answer on her own if she doesn't know right away.  She's also very concerned with her performance - she gave two informal class evals in addition to the official one at the end of the semester, and she even videotaped a lecture or two (for her own personal use, of course).  Overall, if you don't mind a little discussion with your lectures or the fact that class participation counts for 10% of your grade, you won't be disappointed.\nWorkload:\n2 midterms and 1 in-class final, which aren't so bad if you know your stuff (her tests are a mix of mult-choice, math problem and essay questions).  Doing the optional problem sets certainly helps.\n"
        }
    ]
}