{
    "prof_info": [
        {
            "prof_name": "Sarah Roland",
            "prof_id": 2845,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 20, 2008",
            "review_content": "\nSarah is a great Art Hum professor!  I would definitely recommend taking her class. She makes art humanities interactive; which is key for an art history class. She is very knowledgable and can answer almost any question raised.   \nWorkload:\nReasonable: 2 papers, midterm, final and 2 field trips\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "June 29, 2008",
            "review_content": "\nSarah is a Belgian with a heart of gold. She totally understands that Art Hum is a required core class, and that most of her students will have little or no experience analyzing art. Her lectures are based on powerpoint slides that can get a little dull, but mainly she presents the required info so that it is at least mildly appealing. You take a few trips to the Met (on your own time, very manageable and even enjoyable), are assigned readings that you should NOT bother to read, and write a few easy papers, encompassing the majority of the class. There is a midterm and a final, but both are standard (ID's, comparisons, etc) and not difficult. As long as you do the assignment she asks, and put in a little bit of effort, you'll get an A on your project/paper. She's one of the nicest and most understanding professors at Columbia, so consider yourself lucky if you wind up forcefully learning about art in her presence.\nWorkload:\n3 papers (3-4 pages, then 4-5, then 5-6) that are basic and generously graded, a standard and easy midterm, plus a standard and easy final. Participation might play a small role in your grade but its not hard to say something completely obvious about a piece of art - no matter what, she'll make something of your comment. Overall, very easy.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2006",
            "review_content": "\nRoland structures the class in a very straightforward manner, so you know exactly what she wants of you. If you're looking to get through this requirement without an excessive amount of work but also desire to acquire a basic knowledge of the masterpieces of western art, Roland is a great option. She grades essays fairly, and the midterm and final weren't too difficult if you put in some study time. All in all, the class was very 'chill.' She never even addressed anyone by name (thought this was kind of strange, it really made no difference to me). The reading is almost non-existent for this class. She posts short reading assignments for each artist, but they were rarely discussed in class (so you don't need to do them if you don't want to). Just show up, take good notes, study for the exams, and you'll do great.\nWorkload:\nVery moderate. 3 fairly graded papers (about 3-4 pages each), a midterm, a final, an easy group presentation at the beginning.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 25, 2006",
            "review_content": "\nSarah is a really nice teacher and class really isn't bad at all, in fact enjoyable and moves along quite efficiently. She tries to get you to really speak up and talk about the art and is very good at taking what you have to say and connecting your somewhat simple comment to an overarching theme. \nThe papers, three of them, are quite easy and the grading is pretty easy. The midterm was fair in terms of the what was presented and what was tested. If you are an art history major with maximal interest in the subject I would suggest looking for a harder more challenging class. If you are testing your boundaries or just fulfilling the requirement this is a great class. Sarah does a good job introducing you to the field of art history.\nWorkload:\n3 papers that are quite easy, an in-class presentation part of class participation, a museum visit to the met, a midterm, final. There are readings that are \"required\" but I personally never read a single one and it didn't affect my performance in the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2006",
            "review_content": "\nI was not looking forward to taking Art Humanities, but Sarah Roland made the class a lot less painful than I had expected.\nI felt that the instructor did a great job of balancing between lecturing and facilitating discussion.  Everyone was expected to participate in discussion, as participation was 1/3 of the grade, but she would react enthusiastically toward your comments even if they were just basic observations.  She was good at connecting student comments, even if they were relatively simple, with larger themes.\nIf you are an Art History major or someone else who is already knowledgeable/passionate about the topic, you might want a more difficult section, but considering that this class is an intro., I thought the level/workload was fair.  \nDoing well in this section generally depends on willingness to participate in class, memorization of dates/works for the midterm/final, and effort/writing ability for the papers. \nWorkload:\nThere were 3 papers (fairly to leniently graded), a nongraded group presentation, and a museum visit (that about half the class attended).  The work load was relatively light as many readings were eliminated.  There was generally 5-10 pages of reading per class, but the reading was not tested on the midterm or final.  Each section generally had 1 mandatory reading and several \"optional\" readings.  This was great, because there was less work for the majority of students who were taking art hum to meet a requirement, but for those students who really liked the subject, the optional reading provided more background.  Personally I did not read any \"optional\" reading and this did not hurt my grade.  The only difficult part about this section was that for the midterm and final, she did not give us an outline of what topics/terms that would be covered so I wasted time studying many works on the Art Hum website that weren't closely covered in class, but then the exams ended up just covering stuff that was more closely discussed in class anyway.\n"
        }
    ]
}