{
    "prof_info": [
        {
            "prof_name": "Erin Aigner",
            "prof_id": 6500,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "GIS: Methods and Case Studies",
            "review_date": "October 30, 2010",
            "review_content": "\nthis class was not \"fun\" like the other reviewer said (look at all the people who disagree with the review). it is hard for people who arent really computer savvy. its not really teaching you GIS. you basically have to figure out things for yourself (within a short period of time in which an assignment is due. learning under pressure is \"fuuuun\"). she isnt like a professor= *not a good thing* when you are learning something technical. there is the assumption in this class that everything GIS is intuitive. its really not. GIS is a bit of a clunky system. the software is installed on most computers at columbia. try it out for yourself. its not very intuitive. and this approach was very annoying as several people felt it made them feel like an idiot for asking questions. \nanyways she gives you an overview and then leaves you to implement the program projects yourself during the rest of class. yes you have a book that you can follow along with but it does not tell you how to do everything. if you have done any computer programming/html its kinda like that. you mess up on one aspect or line you cant get your program to work. but instead of being something you did wrong this time it will probably be something you did not know existed and therefore did not know to click on. le grand SIGH.  \nShe does try and care though i must say that. this is just a warning to those who think its an easy \"A\". you get points off if your border is too thick, your dots are too close/too far apart, or its not aesthetically pleasing enough in general etc etc. and yes that is really annoyingly subjective and you only find out about these things after marks have been deducted. \n\nWorkload:\nyou have short homework assignments, relatively short readings every now and then, and a larger project due at the end. \n\n"
        },
        {
            "course_name": "GIS: Methods and Case Studies",
            "review_date": "March 03, 2009",
            "review_content": "\nFirst of all this class is amazing. It doesn't even seem like a class it seems more like a very fun and completely non stressful hour and a half I spend two days a week making fun maps. I can't believe I am satisfying my math requirement with this class, the work is very straight forward and Erin offers tons of help both in class and outside. This is just one of those classes that makes me smile I'm so glad I took it instead of one of a litany of sub par math courses. Erin doesn't even seem like a professor she is more like an extremely helpful classmate, the whole environment of the class it great, lots of learning, no stress and maps!\nWorkload:\nWritten exercises due weekly that are totally doable and maps that we all work on in class and a final project. Manageable and enjoyable!\n"
        }
    ]
}