{
    "prof_info": [
        {
            "prof_name": "Yoav Horesh",
            "prof_id": 2880,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Photo I (summer)",
            "review_date": "December 10, 2008",
            "review_content": "\nIf you want to learn the basics of photography, take a class with Yoav Horesh.\nI had absolutely no experience with photography, but I quickly learned the basics of exposure time and aperture (don't be intimidated if you aren't familiar with these terms), how to develop black & white film, and how to make a black & white print. After you learn how to do this you spend the rest of the semester perfecting your technique.\nYoav expects his students to come on time and to do work in the darkroom outside of class. The class is an investment of both time and money (you need a film [not digital] camera, a lens, black & white film, printing paper, sleeves for negatives, a binder, a blotter book, a can of air, a dusting cloth) but I felt it was worth it.\nHe is sarcastic and can come off as harsh. I was turned off the first couple weeks of class but then I learned to take what he said with a grain of salt and ended up having a great relationship with him (he's a funny guy and also quite compassionate [deep, deep down]).\nHe said that he rarely gives A+, but if you put in the effort you will be happy with the grade you receive.\nWorkload:\nYou have to take photographs outside of class. After the film developing lesson you are expected to develop your film on your own time. Eventually you are expected to make prints on your own time as well. There are regular critiques, and at the end of the semester my class had to do a \"what photography means to me\" project, which you could turn in as a photograph or as a written paper.\nOver the course of the semester he gave us two articles to read and we had to write 1-page responses.\n"
        },
        {
            "course_name": "Photo I (summer)",
            "review_date": "July 29, 2007",
            "review_content": "\nPerhaps it is just the stress of the summer session, but my experience in the course was totally different from the above.  \nThere is indeed something endearing about Yoav's effeminate yet overbearing manner and his love of art despite his regular (witty) misanthropic diatribes.  As a masochistic Columbia student, I admit there was something even enticing about his claim on the highest standards and largest workloads of Photo I classes.  I figured what didn't kill me would make me stronger.  \nBullshit.  \nClass discussions during reviews are incoherent and lengthy, to the exclusion of being let out even close to on time.  Here we have a professor who consistently runs class late, while not covering basics.  It's photo I.  Week three, about half the class still couldn't squeegee their prints properly to avoid fucking up their blotter books.  Without the patience and pity of darkroom monitors (who've often stayed late to help our sorry asses), we'd have stalled early on.   Oh yeah, and he's given diatribes against us rich Columbia kids who didn't work ourselves through art school...\nYoav must be commended for expecting a lot.  But, expecting a lot, he could give a lot more.  \nWorkload:\nYoav unabashedly confirms my 20-30 hour/week (pluss classtime) complaint.   Ballpark: 40-50 prints and 15 rolls of shots.\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "May 01, 2007",
            "review_content": "\nAvoid this professor. Yoav is a jerk. Flat out.  Yeah, he makes some insightful and helpful comments about your work and he's definitely a great photographer who knows his stuff, but his personality is not conducive to a class like this. He definitely has his favorites in the class and if you're not one of them (i.e. if you don't go along with EVERYTHING that he says) he totally rude to you for the rest of the semester.  Our class was supposed to meet from 2:30 to 5 mondays and wednesdays.  On wednesdays he would religiously keep us past 5...most of the time until at least 5:30. and if you had to leave early he got pissed off and would say things like \"what? you have another class?\" as if there's nothing more important than him and his class. His class probably wouldn't have to run over time like this if he didn't sit around talking to the TA for the first 20 minutes.  But of course he blamed the late start on the students.  Seriously though, stay away. His accent isn't even that cute. Get over it.\n"
        },
        {
            "course_name": "Photo I",
            "review_date": "April 07, 2006",
            "review_content": "\nI didn't know anything about either of the Photo I. teachers  (Tom Roma and Yoav Horesh) when I signed up for this class.  I chose Yoav's section because I liked his name better.  I also googled him, and liked his stuff.  While Roma is a hot-shot in the world of photography, and is basically responsible for the entire photography department at Columbia, I am so glad I took Yoav's class (but I do hope to take a Roma class later).  Yoav seems a little intimidating at first, constantly saying stuff like, \"HOW MANY TIMES HAVE WE TALKED ABOUT THIS?\" At which time he rolls his eyes and does this little clicking thing with his tongue (my mom used to make a similar noise when she saw me trying to eat Sour Patch Kids before dinner), and looks at the TAs for support.  But he's really a sweetheart--honest, supportive, and helpful in his criticisms.  I feel like I've learned volumes about all aspects of photography: the basics like developing and printing, but also some history, the best bookstores to browse photographical works, and what galleries to check out.  He's also really approachable, so talking after class about lighting techniques, best lenses to buy, etc. is never scary. He respects different students' areas of interest (i.e. protraiture, documentary photography), and gives us a lot of freedom to explore those areas.  Some people take advantage of the freedom he gives, which is to their detriment.  Too bad for them.  So, TAKE THIS CLASS, but only take it if you're willing to put as much effort in as Yoav does.  Otherwise it's a waste of time and money.  Also, the TAs know what they're talking about.  Phew!  And finally... What's not to like about a cute Israeli accent?\nWorkload:\nCritiques every week--class split into two groups, and one group shows work per week.  Bare minimum of 6 prints at each critique, but he encourages (and I think expects) more.  Final test that deals with technical issues, as well as a little bit of photo history--I'm taking the test next week, so I don't know how hard it's going to be, but... He keeps saying that the test is just a perfunctory requirement, and that if we have been \"paying attention AT ALL,\" we will do fine.  \n"
        }
    ]
}