{
    "prof_info": [
        {
            "prof_name": "Susanna Cole",
            "prof_id": 2382,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 25, 2008",
            "review_content": "\nFirst, the pros: Susanna, as other reviewers have pointed out, is pretty relaxed about deadlines. This being a summer class, we were responsible for 9 short papers - one per week, including a mandatory sketch - in lieu of a midterm, so there was more last-minute scrabbling around than is usual (at least in my case). Personally, she was also a nice change from the usual hyper-intensity that seems to be such a part of the Columbia Art History experience, both in terms of faculty and students alike. While trying pretty hard not to feed us the usual endlessly-recycled platitudes about figures like Rambrandt and Monet - she frequently worked insightful observations about the formal structures of the works we were looking at into her lectures - she was, at the same time, open to comments, seemed to genuinely appreciate differing points of view, and, sometime during the semester, realized that sitting down with us - as opposed to delivering a monologue from behind a podium in the time-honoured, hierarchy-conscious tradition of the hallowed halls of Ivy League academia -  really helped to put students at their ease and to facilitate participation, so she began doing that a lot. It was small, but telling, gesture. (Or maybe she was just tired from standing up so much.) My section benefited from a lot of students who seemed really engaged and invested in the material, so class discussion managed, most of the time, to steer clear of the soporific monotony that happens so often at this school. \nNow the cons: While allowing us quite a bit of leeway to explore personal ideas and interests, the work requirement (see above) got to be a bit much. A short paper a week may not sound like a lot, but it piles up - especially if you're taking other classes like I was. The atmosphere in the classroom also felt a little strange at times - there were strong undercurrents of competitiveness - but that sort of comes with the territory with a discussion-heavy class like this one, and not really the instructor's fault. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 11, 2005",
            "review_content": "\nSusanna was GREAT! She was knowledgable about all the art we covered in class, but most importantly, she tried to make our lessons interesting.  All classes were discussion-based, and surprisingly, we talked more than she did most days!  She is also very chill interms of extensions and the like.  She is a grad-student and  knows that most of us take this course because we have to so she teaches it that way.  She doesn't expect you to have any prior knowledge! \nWorkload:\n3 3-page papers, midterm, and final.... all graded VERY fairly\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nSusanna is an adequate Art Hum instructor. She is knowledgable about art history in general, particularly the later artists covered, and always came to class prepared. Class time itself ranged from mildly interesting to excruciatingly boring, with excruciatingly boring  being the most likely. Often, we did not see more than a few slides per class period, and she frequently allowed class discussion to get waaaaaay off-topic. \nWorkload:\nStandard art hum workload. Hardly any homework, readings are not really discussed, non-cumulative midterm and final, three three-page papers. Paper topics were fine.\n"
        }
    ]
}