{
    "prof_info": [
        {
            "prof_name": "Emily Fragos",
            "prof_id": 2555,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate poetry workshop",
            "review_date": "January 21, 2011",
            "review_content": "\nHonestly, I wasn't crazy about her. I was expecting so much more out of a workshop, but I got very little out of it. So little time was spent on each person's work that I just cannot fathom how people even felt like they were improving. I didn't find her particularly interesting or charming and she often struggled to understand very obvious things in a poem. She wasn't a bad workshop leader, just very average. \nWorkload:\nlight, a poem a week and comments\n"
        },
        {
            "course_name": "Intermediate poetry workshop",
            "review_date": "January 19, 2010",
            "review_content": "\nThis was definitely a worthwhile class. Professor Fragos did a great job of creating a productive atmosphere for discussion. She's serious enough that she won't let you get away with shitty poems, but light enough that you'll enjoy coming to class, although part of the \"enjoy coming to class\" part also depends in part on your classmates (my class had a good balance of criticism and positive feedback, but I've heard of other workshops in which that was not the case). Ms. Fragos also occasionally reads poems out loud for the class, which is just wonderful, because she's a great reader. She also knows many contemporary poets and frequently gives anecdotes about them, which is nice.\nThe only complaint I have about Ms. Fragos is that she tends to focus much more on the language of the poem in the individual lines than on the thought-content of the poem as a whole. Perhaps that's how it should be in an undergraduate intermediate workshop. But it seemed overall that Ms. Fragos (and, accordingly, the class as a whole) was more interested in just making the language of the poem the best it could be, rather than ensuring that the language best expressed the poet's perspective on the idea, topic, event, etc., being discussed. But I guess whether or not that's a good or bad thing depends on some of your beliefs about poetry.\nMs. Fragos gives excellent comments on every poem, although we only got to about half of the poems presented in any given class (each student writes a poem per class). But you got written feedback (from everyone in the class) on the poems that we didn't get to in class, so that was okay.\nOne quick warning: this class took up more time than I expected. While writing the poem honestly didn't take that long, making thorough comments on my classmates' poems did take a while.\nOverall: this was a very good class, and I benefited from both Ms. Fragos' comments and my classmates', which were consistently informed and interesting and usually very helpful.\nWorkload:\nTen poems, one per week, seven of which are about prescribed themes (a poem about another species, a poem addressing someone or something, a poem that to the poet in the third person, a minimalist poem, etc.), written comments on the poems from each week that weren't covered in class, weekly readings.\n"
        },
        {
            "course_name": "Intermediate poetry workshop",
            "review_date": "March 06, 2009",
            "review_content": "\nEmily Fragos is a wonderful person to have for workshop. She questions everything that needs to be--she usually asks what the class thinks about the end or a particular word or section before telling what she thinks. she doesn't lecture between poems but if a poem brings up what she thinks about the workings of poetry or writing, she'll sum it up quickly. \nshe's funny, you'll like her. she's good for you and a really good poet herself. \nWorkload:\na poem a week, general topics and at least three \"open mic\" poems, what she calls the poems without a prompt, edits for the final portfolio: choose ten out of the eleven or twelve you write. \n"
        },
        {
            "course_name": "Free Verse and Poetic Forms",
            "review_date": "May 22, 2005",
            "review_content": "\nI'm not really sure how to describe Emily Fragos.  She is like one of those old crazy homeless people that you are kind of freaked out by at first, but that grows on you, like a big ugly mole that you eventually call a beauty mark after trimming off the nasty hairs that are growing out of it.  She doesn't give much written feedback, but in class she is honest and blunt about her feelings.  If a poem sucks, she's not going to pretend it doesn't.  But if you're the poet of the sucky poem, she won't make you cry either, she'll just tell it as it is and make you and everyone else laugh at your shitty & cliched writing.  Also, if you have another older woman in your class, you may be graced with the old hag bickering that takes place for a good part of each class.  You won't love Emily, but you will be challenged and entertained and will want to make your poems really good so that she doesn't make fun of you in class.  Also, she manages to get to almost everyone's poem each class, which is pretty incredible.  While a no-bullshit poetry class may seem like a contradiction, Emily manages to pull it off.\nWorkload:\nOne poem every day, under a different assignment topic.  The assignments she gives are specific enough to get you out of your little writing box, but they're open enough to let you express yourself in that topic (ie: animal poem, ekphrastic poem; travel poem, etc).  Revisions of these for Final Portofolio.\n"
        }
    ]
}