{
    "prof_info": [
        {
            "prof_name": "Andrea Andersson",
            "prof_id": 1960,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Women and Culture Seminar and First Year English",
            "review_date": "December 10, 2010",
            "review_content": "\nNot only did this course totally suck, but Professor Andersson is perhaps the worst \"teacher\" I have ever had in my entire life. Every day, more than 50% of the class she was on her iphone doing god knows what having us write the stupidest \"close readings\". If you hoped to learn something from this course or from her, don't bother because you wont learn a single thing. She won't tell you what she expects as a teacher and then will go to town on your paper demanding to know \"how your argument changes our views as readers\" wtf does that even mean? I don't know because she never told us. I can't even express how bad a teacher this woman is. I didn't learn a single thing and wasted so much time and effort. \nDon't take this class and don't take any class she teaches...unless you like being miserable. \nWorkload:\n3  6 page papers and 1 research paper\n"
        },
        {
            "course_name": "Women and Culture Seminar and First Year English",
            "review_date": "December 10, 2010",
            "review_content": "\nNot only did this course totally suck, but Professor Andersson is perhaps the worst \"teacher\" I have ever had in my entire life. Every day, more than 50% of the class she was on her iphone doing god knows what having us write the stupidest \"close readings\". If you hoped to learn something from this course or from her, don't bother because you wont learn a single thing. She won't tell you what she expects as a teacher and then will go to town on your paper demanding to know \"how your argument changes our views as readers\" wtf does that even mean? I don't know because she never told us. I can't even express how bad a teacher this woman is. I didn't learn a single thing and wasted so much time and effort. \nDon't take this class and don't take any class she teaches...unless you like being miserable. \nWorkload:\n3  6 page papers and 1 research paper\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 21, 2005",
            "review_content": "\nPerhaps teaching this class over and over again, has made her jaded, but Andrea's class is nothing like the other reviewers mentioned.  It's true that  Andrea does not assign that much busy work (ie nightly essay responses), but that's the only good thing about her section. She gets kinda mad when people don't agree with her opinions. Several times, she has responded to certain student views by simply saying, \"You're wrong!\" The grades she gives out reflect her narrowmindedness. Basically, if you disagree with Andrea she'll slap you with a C. A few of my friends are actually appealing their grades, because she was so harsh. The structure of the class itself was equally awful. We'd basically get into little groups to discuss articles we've read the night before. This was not conducive to improving our writing at all. No one took the group discussions seriously. Often we'd exhaust the article in 10 minutes and spend the rest of the time chatting. \nWorkload:\nLight, Just the four required essays, and one presentation. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 26, 2004",
            "review_content": "\nUnbelievable. As the past reviewer wrote, consider yourself truly blessed if you land yourself a spot in Andrea's section. She's young, fun, brilliant, New Orleans-bred, Stanford-educated and truly a breath of fresh air on this stuffy ivy-league campus. She's humble and never takes herself too seriously and despite enormous amounts of work as a third year PhD, she was never in a bad mood and always willing to take time out of her schedule to conference with students. She KNOWS writing and more importantly, she knows how to teach writing. She made class discussions interesting despite tedious material. And last but not least, Andrea is very easy on the eyes which, among other things, made going to her class a pleasure. If there is anyway you can get in her section - do it.\nWorkload:\n4 papers - 3 cuz of the strike. Tough topics - fairly graded\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 18, 2004",
            "review_content": "\nif you end up in andrea's section of UW, consider yourself blessed. from what i heard about other sections, this new course had the potential to really bite, but in andrea's first shot she made it a pleasure. shes surprisingly brilliant (you may not think so when you see her on the first day-- youll  understand soon), very helpful, exciting and caring. as a graduate student, she knows enough about her field, and is young enough to assume the role as a friend. she's got an incredible ability to make you make your writing a hell of a lot better (as bad as that sentence was). take advantage and put in the effort-- she will make it pay off, and you will grow greatly in your writing. very, very cool person. great dresser.  i wish she taught more classes.\nWorkload:\nstandard university writing-- 4 essays avg. of about 2000 words each\n"
        }
    ]
}