{
    "prof_info": [
        {
            "prof_name": "Sylvere Lotringer",
            "prof_id": 1678,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Baudelaire and Mallarme",
            "review_date": "December 06, 2005",
            "review_content": "\nHaving class with lotringer was really an easy pleasure. All you have to do is come and hear him speak when you feel like it. He will surely captivate your interest because he is knowledgeable in really almost any subject. He has never come to class with any notes and REALLY knows his stuff. Like for the Dada and Surrealism class, he actually knew the people we were talking about personally (Dali!! baudrillard, Guy Debord, Yves, Klein, and many more) He is very understanding and very nice, like if you're not so comfortable with the french language, you can write your papers in english. \nHe is really a genius when it comes to contemporary american society, and will allow you to explore any subject of interest to you. \nWorkload:\nfor all is classes: 1 short paper (3-4pages), one oral presentation on a subject of interest (can be done in english with no penalty), and one final paper if he remembers. Lots of reading, but you really don't have to do any, read just what you find interesting!\n"
        },
        {
            "course_name": "Proust and Deleuze",
            "review_date": "March 05, 2005",
            "review_content": "\nProfessor Lotranger is one of the gems of the french department. \nAn internationally renowned theorist in his own right, taking a class with him is a totally different experience than you would have in a typical literature class. Just auditing his upper level classes (or enrolling in them if you're brave enough) is an enriching experience. Listening to him lecture is like watching someone write a book on the spur of the moment--he speaks well and is always interesting. Obviously, if you aren't interested in theory or philosophy, this class might not be for you, but if you try to take a class with him while you still have the chance!\nWorkload:\nOne long paper, and an oral presentation in class. This is a grad class, so I'm not sure what he expects for undergrad classes. I was just auditing so I didn't do any work--just read. Expect a lot of reading!\n"
        },
        {
            "course_name": "Flaubert",
            "review_date": "August 11, 2004",
            "review_content": "\nProf. Lotringer clearly knows what he's talking about.  This is both a blessing and a curse: on the positive side, you can expect any possible question you have to be answered in great detail, and lots of background information (I never saw him once bring in notes--everything came off of the top of his head).  On the negative side, he expects his students to have a graduate-level understanding of tons of different books and different literary schools of criticism (he is particularly fond of post-modernism).  Thus, most of my class struggled to keep up with him as he started jumping from book to book towards the end of the semester.  Overall, I learned alot, but I wish he had made more of an effort to engage his students and to make sure we knew what was going on.\nWorkload:\nAll over the place.  Half the semester was spent on Madame Bovary, going at what seemed a pace of two pages a day, and then we crammed the rest of the (extremely long) books into the end of the semester.  One 5 page midterm paper, one 12-15 page final \"research\" paper, no final exam.  As others have warned, his tastes in essay writing are extremely precise--MAKE SURE YOU GO OVER WHAT YOU WANT TO WRITE ABOUT WITH HIM!\n"
        },
        {
            "course_name": "Flaubert",
            "review_date": "May 20, 2004",
            "review_content": "\nProf. Lotringer is obviously an extremely intelligent man, with worthwhile things to say.  Unfortunately, this class did not showcase those features particularly well.  I had the impression early on in the semester (when I was keeping up with all the reading) that my class and I were a constant disappointment to Prof. Lotringer, b/c we had not kept up with obscure French literary criticisms of the past 100+ years, nor random French novels from all centuries.  Being thus disappointed, he then proceeded to rarely ask for any input or discussion.  The class lacked any direction or focus.  We spent probably half a semester on Madame Bovary, leaving the rest for the roughly 7 other books he had planned.  In general, I feel if Prof. Lotringer had given us some idea of what we were supposed to be getting out of the class, and what he expected from us, the class could have been greatly improved.\nWorkload:\nAbout 8 books, but since he expects no class discussion and there is no midterm or final, it is possible not to do all of them.  One short paper (about 5 pages) and one long final paper (12-15 pages).  It is EXTREMELY difficult to write the papers, because Prof. Lotringer gives no hint of what he is looking for.    One is left blindly writing a paper, hoping it will approximate what he is looking for.  Nonetheless, I felt my papers were graded fairly.\n"
        },
        {
            "course_name": "Baudelaire and Mallarme",
            "review_date": "June 17, 2003",
            "review_content": "\nProf. Lotringer's class on B+M was definitely challenging--my hand shook while taking notes for the first two weeks!  But, quite honestly, the course was one of the best I've taken at Columbia.  Sylvere is brilliant--his lectures on Mallarme's poetry make the words and the language come alive.  I've never been so impressed by a professor before.  A caveat for the lazy--this is NOT a mickey mouse course.  You are expected to read, to research, and to think at a higher level than other literature courses.  It was, by far, the most difficult french course that I've taken in my two years as a french major.  However, it was also the most rewarding.    \nWorkload:\nvaries from semester to semester; usu. one 4 page midterm essay and a longer final paper.  grading is fair, but not overly harsh\n"
        }
    ]
}