{
    "prof_info": [
        {
            "prof_name": "Seth Fabian",
            "prof_id": 2850,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 09, 2008",
            "review_content": "\nFrom reading past reviews, I got the impression that Seth was going to be a good, caring professor.  Neither of these qualities were true.  I found myself often bored in class, and dealing with a teacher who did not seem to care about making class activities interesting, did not have much energy (essential to make learning a new language doable and interesting), and was not timely in returning/grading assignments.  A disappointment. \nWorkload:\nStandard for any beginning language class. Weekly quizzes, about 5 compositions, nightly homework, midterm, final.  \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 17, 2006",
            "review_content": "\nSeth is the best Italian teacher i have ever had. HIs class made me more proficient in italain than any other class I have taken before. He clearly has an extensive grip on the Italian language and addresses the material in class with ease.  His best ability is the way he introduces discussion into the classroom.  My italian ability soared from just a few group sessions of discussion in class.  he keeps the atmosphere of the class light and even had some of the class joking with him in italian at the end.  It seems as though his goal is to have the class comfortably converse in class and he teaches best when this is achieved. If you are looking to learn alot of the italian language as well as italian culture, take his class.  The only fault of Seth Fabian is that he may be too qualified to teach beginner Italian.\nWorkload:\nSame as all entry level language courses.  Very do-able.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "February 06, 2006",
            "review_content": "\nWhen I think of Seth, I think of one word: downer. Unfortuantely, Seth sucks a little bit of life out of the Italian language. What's more is that he doesn't really seem like he wants to be teaching the class, and often reminded us, in an oddly sadistic 'I'm-a-disillusioned-grad-student-and-I-am-going-to-fully-exercise-my-position-of-menial-power-over-you' kind of way, that \"participation counts for 20 percent of your grade\" when nobody would respond to a question.\nHe often punctuates class with awkward, English-language questions or remarks, such as \"Who else in the room is a grammar nerd besides me?\". He has very little energy, and this shows when he tries to either get the class to speak or work in groups. His knowledge of the Italian language and its every grammatical rule, however, is incredible for a non-native speaker who's only 25.\nItalian with Seth is definitely an experience, but not necessarily a pleasurable one, although he does break his sullen face occasionally and laugh or make a joke. His enthusiasm for the Notre Dame football team, although understated on the surface, is, perhaps, a sign of a lively spirit hidden within a disillusioned grad student's body. \nWorkload:\nStandard within the Italian department: weekly workbook and lab assignments, weekly quiz, five compositions, midterm, final.\n"
        }
    ]
}