{
    "prof_info": [
        {
            "prof_name": "Jeffrey Wayno",
            "prof_id": 13118,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 30, 2015",
            "review_content": "\nJeffrey was a fantastic teacher. This review will undoubtedly get some downvotes as I know of some people who disagree with me (and they are probably the most likely to come to review on CULPA), but I know of some others who agree with me on this as well.\nI came into LitHum dreading it and thinking it would be the most painful class I’d take at Columbia. I end the class grateful that it was required and having learned more than I ever expected. This is largely a function of the incredible literature that we read, but is also reflective of Jeffrey’s teaching.\nWhen I saw that Jeffrey was a Grad student (and in the History Department) I was pretty disappointed that my longest class wouldn’t be taught by an expert. But honestly, if anything his being a Grad student was a plus. He was never overbearing in his knowledge of the books or the historical context and was open to any ideas the students had, while still guiding the discussions in a way that helped you look at the books differently. This was especially important given that the amount of reading in LitHum was (at least for me) very overwhelming – I had to skip a lot of the readings and skim even more. While some of our discussions were less interesting than others (Medea basically devolved into a feminist dispute; we had a baffling conversation on the semantics of “power” vs. “authority” in King Lear, which I am convinced are effectively the same word; and an odd discussion of the effects of the Napoleonic War on Pride and Prejudice), the majority of the discussions were very interesting. We had some especially great discussions about Don Quixote, Crime and Punishment, and To the Lighthouse at the end of the year.\nAll said and done, Jeffrey was a very intelligent, fair, and attentive teacher, in addition to being the nicest guy in the world. He always listened to everyone’s opinion and guided the discussion skillfully without ever being condescending. He had an awesome tendency to respond to emails within minutes (always with his signature sign-off “Cheers”) and was readily available to meet, during or outside of Office Hours.\nTl;dr Jeffrey may not be a tenured professor but he has the exact qualities you want for a class like this. Taking this class made me more appreciative of the Core (barf, that’s something I thought I’d never say) and definitely of the literature.\nWorkload:\nParticipation – 20%. There are definitely too many readings but obviously this is not teacher-specific. Sparknotes is your friend. A couple reading quizzes first semester which didn’t factor into your grade much (thankfully, as I averaged a 60), but he dropped those second semester. Posts on the CourseWorks Discussion Board before each class; all you had to do was ask a question – this was by far the easiest part of the Participation grade as long as you remembered to do them. Word of advice: To do well in LitHum, you HAVE to force yourself to participate. Not only is participation worth a hefty part of your grade but it is also vital in giving your teacher a good impression, which will factor into other parts of your grade as well.\nPapers – 40%. Three 5-page papers first semester with prompts, two 7-8 page papers second semester where you made your own prompt (these were much more interesting). All reasonably evaluated as far as I could tell.\nMidterm – 15% first semester, 10% second semester when we also had to do a “Study Guide” for one of the readings, also worth 10%. Very reasonable midterm with Passage IDs that are much longer and easier than the final.\nFinal – 20%. Same final for (almost) all LitHum classes and is much more difficult to do without reading.\n"
        }
    ]
}