{
    "prof_info": [
        {
            "prof_name": "Mariana Fraga",
            "prof_id": 9725,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 05, 2013",
            "review_content": "\nMari is the best!!! She is funny and really chill, but somehow we still manage to learn a lot of Italian. I always feel prepared for the quizzes; she tells us exactly what will be on them and always has helpful review sheets. She's really lax and understanding with due dates as well. She has great stories about her awesome life; we talk a lot about TV and pop culture too. \nIf you're interested in learning Italian, definitely take it with her! I enjoy going to class every day. She's hilarious. \nWorkload:\nTypical for a language class. Quiz every other week, hw due on days of the quizzes, a few short compositions, oral presentation, midterm, final. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 08, 2011",
            "review_content": "\nAfter I took Elementary I with Mari, I did everything I could to get into her Elementary II class. She is absolutely AMAZING. She is really chill and fun and talks about a lot of random stuff, but we still learned a lot and I felt totally prepared for the exams. She is really understanding if you need to miss a class or turn something in late. Quizzes are on the same days that homework is due, so as long as you do the homework you don't need to study for the quiz. Mari is the most incredible teacher I have ever had. Take her class!!!!\nWorkload:\nWeekly quizzes and workbook assignments, composition every couple of weeks, midterm, short presentation, final. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 18, 2011",
            "review_content": "\nAmazing teacher. So much fun. Most entertaining class I've taken at Columbia, and yet we still manage to learn all of the Italian the syllabus says we should. We spend a lot of time talking about popular culture and especially television. I would say that Mari is good as far as actually helping us learn Italian and amazing as far as keeping people interested in the class and making you want to come. ABSOLUTELY TAKE THIS CLASS even if your are only slightly interested in learning Italian!\nWorkload:\nStandard for a typical Intro Italian class. Very understanding if you need to turn in Homework or a composition late.\n"
        }
    ]
}