{
    "prof_info": [
        {
            "prof_name": "Michael Paulson",
            "prof_id": 12884,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 10, 2014",
            "review_content": "\nProfessor Paulson is a very capable and approachable University Writing Professor. I thoroughly enjoyed his classes, although some of my classmates found his classes somewhat challenging. To be fair, Professor Paulson is not the best professor out there, but he gets the job done.\nPaulson used to work as a journalist, and you can still find some of his articles online. You can get a good sense of his personality and teaching style by just reading his articles. He's a fairly articulate and straightforward lecturer. His University Writing section is very well-structured, and the information is delivered in a very organized manner. \nClass can be a little boring at times, but it really depends on your classmates. Paulson really tries to be objective and make everyone feel comfortable. Everyone was encouraged to speak and offer feedback.\nProfessor Paulson can be a little harsh with grading, but he's pretty lenient with due dates. He frequently holds office hours, and he's always quick to answer emails. I'd recommend seeing him at least twice for feedback each progression. He offered some very insightful and useful feedback on my papers, and I feel that my writing has improved. \nIn short, Michael Paulson is a solid teacher. He may not be the most exciting lecturer, and his grading may not be the most lenient. But, for the most part, he's a fair and approachable University Professor. Not the best, but certainly not bad. \nWorkload:\nStandard University Writing workload. Four essay progressions. \nGrading can be a little harsh. Paulson adheres to the standard course grading guide. About half the class got a B, while the top and bottom quarters got As and Cs respectively.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 03, 2014",
            "review_content": "\nPaulson is a fair instructor. One of the downsides is that he assigns \"Writing Exercises\" every Monday and Wednesday to be finished by the next class. These exercises include readings, summaries, outlines, peer review letters, and drafts. These can be time-consuming and taxing, especially for assignments that are assigned on Mondays and due by Wednesdays. However, some of them are quite useful in making sure that you are keeping up with the work and not procrastinating on final drafts. Depending on how you see these writing exercises, they might actually be a benefit.\nHe provides useful criticism on drafts. However, I'm not entirely sure if addressing those criticisms actually help, since my grades on the essays have remained fairly consistent (example: Paulson writes suggestions on the formal draft. I follow his suggestions and turn in the final draft. I get back my final draft with some extra criticism that he didn't mention on the formal draft). His criticisms are valid for the most part though.\nIn class, Paulson reserves some time for group discussions and peer evaluations. As a result, the actual class is not taxing - only the assignments themselves are. No computers are allowed except for the very last class of the semester.\nPaulson also requires students to meet with him to discuss certain progressions. Most of his suggestions will revolve around making your essay more focused (versus a claim that is overly broad), so keep that in mind.\nPersonality-wise, Paulson has a very even temperament. He won't make you laugh or cry, but what can you really expect from University Writing? \n\nWorkload:\nWriting exercises, as described above. \nFour progressions. The final drafts of each must be turned into his mailbox in a manila folder.\n\n"
        }
    ]
}