{
    "prof_info": [
        {
            "prof_name": "Austin Flint",
            "prof_id": 471,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Playwriting Workshop",
            "review_date": "January 01, 2007",
            "review_content": "\nIt's pretty straightforward: If you suck, Austin will let you know. In the nicest way possible and with eternal cheer and smiles. But he won't let you get away with shitty writing, which basically every other professor in the department will. The bitching below, I suspect, comes from shitty writers.\nTake Austin's class. He's an old pro, he knows his shit, and he will make a good writer a better one. Don't be afraid.\n"
        },
        {
            "course_name": "Advanced Playwriting",
            "review_date": "May 02, 2006",
            "review_content": "\nI didn't sense any of the \"negative energy\" mentioned by the previous reviewer, but there is one crucial thing you need to know about Austin Flint: He talks. A LOT. This wouldn't be so bad if he was talking about the piece being workshopped and giving helpful advice, but instead he constantly goes off on long tangents about former students. At first these anecdotes were amusing, but the act quickly got old when he just kept going ON AND ON and he was essentially saying nothing applicable to the work in front of us. There is something seriously wrong with a class when people get only 20 minutes to workshop a piece they've put a lot of effort into completing because the instructor is too busy telling stories about former students. Also, time management seems to be a problem: If you're the first person up to be workshopped on a class day, you might get an hour. If you're last, have fun with your twenty minutes.\nI mean, he's a genuinely nice guy, very warm and sweet. And he truly seems interested in your writing - his written comments were helpful. Obviously he has a lot of experience in theater. But this is not the best way a workshop can be run. If he wouldn't talk so much about his former students then we would get a lot more done.\n"
        },
        {
            "course_name": "Playwriting Workshop",
            "review_date": "December 11, 2005",
            "review_content": "\nAustin is a horrible teacher.  He allows a negative energy to permeate the classroom and students are reluctant to submit work.  When I took the class attendance was never greater than 2/3 because no one wanted to be in this classroom.  Work was only completed half of the time, leaving us with nothing to workshop and instead doing exercises.  Austin seemed only mildly interested in allowing students to comment and the slightest tangent could send him into a minutes long story about himself.\nThe biggest critique is, again, the negative energy he allows into the classroom.\nI did not improve as a writer because of anything that happened in this class.\nWorkload:\n30-40 pages due at end of semester.  Submit to workshop basically whenever you feel like it.\n"
        },
        {
            "course_name": "Playwriting",
            "review_date": "December 31, 1999",
            "review_content": "\nAustin is a wonderful teacher who maintains just the right atmosphere for a writing class. He is witty, interested, and pleasant. I found his comments on students' writing very on the ball, but also overly positive. Sometimes I wished he'd be more critical, but on the whole, this is a great class if you like writing plays.\nWorkload:\nHave your work read in class whenever you feel like handing in in. It's great because you can save you playwriting work until you have the time for it.\n"
        }
    ]
}