{
    "prof_info": [
        {
            "prof_name": "John Loike",
            "prof_id": 1561,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Ethics for Biomedical Engineers",
            "review_date": "December 11, 2016",
            "review_content": "\nProfessor Loike was great!  The class was discussion based and the workload was very manageable.  I am not sure what the issue is with the reviewer below is, but I felt the class was a blast.  The class was pretty straight forward and although he challenges you to speak up and participate in class, he acts more like a moderator steering the conversation towards some sort of conclusion.\nThere were several guests speakers who offered creative and interesting discussion points for us.  Professor Loike made the class enjoyable and helped us probe in depth some very ethical issues facing the scientific community.  The class is an easy A/A-.  Show up, do your work, and offer solid feedback every so often and you will take home an A.\nWell worth the time and a nice break from the rugged science track we take.  I wish that he had more course offerings, hopefully if I get into Physicians and Surgeons I can take one of his courses.\nWorkload:\nLight\n"
        },
        {
            "course_name": "Ethics for Biomedical Engineers",
            "review_date": "December 07, 2016",
            "review_content": "\nThis class was great.  I'm not sure what the previous post takes an issue with?  Maybe they had their feelings hurt for not getting an A.  There are no gimme A's here at Columbia, so that is what I think the problem below is; they got an A- and wanted to vent because they didn't get the slackers A they thought.  \nThe class was great, the conversations were great.  We dealt with real Bioethical issues and worked them in a variety of ways.  Dr. Loike poses the issue and essentially moderates the discussion.  Don't get your feelings hurt because he steers the conversation in another direction, there is no ego in Science.\nThe textbook is inexpensive and easy to follow.  If you read and actually have meaningful input, you will get an A.  He is not out to hurt your grades and just don't shovel garbage at him and you will do well.  The grades are not subjective, he gives you plenty of opportunities to earn the A.  So be it, you are a slacker, you pull down an A-.  I just find it hard that in the Bio world to come on here and talk poorly of a Professor who encourages you to really think and utilize critical thinking skills.  \nThe science we discussed was all cutting edge advancements and really pushed the boundaries of ethics.  Keeping in mind that this is largely a discussion class, if you are an introvert, do well on the assignments and when you do speak up-offer crisp and insightful feedback and you won't have to worry about participation being an issue.\nWorkload:\nThe workload was light and if you don't talk nonsense in class or in the papers, you will walk out with an A.  If you pull down an A-, so what? He even gave us the chance to redo our midterms if we wanted.  Don't belittle the professor because you slacked all semester.  Loike was awesome and I wish that I had the opportunity to take more courses with him before I finished.  Maybe if I'm lucky, I can have him for a class at Physicians & Surgeons someday.\n"
        },
        {
            "course_name": "Bioethics",
            "review_date": "November 16, 2016",
            "review_content": "\nThis is one of the most unique science courses I've taken as a pre-med at Columbia. Dr. Loike's style of teaching is unique to anything you'll see in your standard 300-person lecture course and frankly a fun, high-energy, breath of fresh air. Whether you are already familiar with the principles of bioethics or a new-comer to the field, Dr. Loike makes the experience educational, timely and relevant. Each week in class a new or upcoming biological technology is presented and the class is made to discuss the bioethical issues that are associated with it as well as how they may be resolved. However, instead of simply opening up the class for debate, 2-3 students begin the discussion by presenting a \"scientific theater\" presentation of sorts where they are assigned roles (ie. someone who is considering using the technology, the developer of the technology, someone who is against use of the technology, etc) and present bioethical arguments related to the technology through various lenses. The rest of the class then has the opportunity to ask each character questions, or respond to what the characters have said. It was a very unique and fun spin to put on a seminar and often made for the emergence of viewpoints that otherwise may not have even been considered. I genuinely enjoyed going to this seminar (which by the way is just once a week!) and came away with a solid grasp of the principles of bioethics as well as a basic knowledge of many biotechnologies I had been aware had existed. \nDr. Loike also brought in several guest speakers throughout the semester (ie. FBI agents specializing in contagious diseases/bioterrorism). It was super interesting to hear their direct perspectives on their given area of expertise and a nice change of pace from weekly student-led class discussions. \nOverall I would definitely recommend this course if you're looking for a nice and easy change of pace from your standard (read: hellish) premed classes. You can tell Dr. Loike is super passionate about his field. His high energy and chosen class style really did make going to class something to look forward to, (unlike that orgo lecture you're still looking for an excuse to skip). Essentially if you want to block out an hour and fifteen minutes once a week to have some intellectually stimulating discussions about bioethics and biotechnology, get an easy A, and get 2 credits out of it, I'd recommend you look no further. \nWorkload:\nThis course is also VERY easy to do well in. It's graded primarily based on participation--if you attend class and try your best to make a thoughtful comment or two at each session, you should be A OK. There are weekly courseworks posts (read: single paragraphs) due each week that basically just require you to write 4 thoughtful sentences about the technology being discussed in class that week. These posts are not graded, but marked as complete/incomplete. The midterm for this course is a choice between either a partner op-ed paper (which you have the opportunity to redact later for a higher grade), or a partner/group music video (obviously I chose the music video but either way you slice it the midterm was a breeze)! The final for the course is another partner-paper (5 pages, if I remember correctly)--if you put in some time you should be able to crank it out in a weekend! \n\n"
        },
        {
            "course_name": "Ethics for Biomedical Engineers",
            "review_date": "June 02, 2016",
            "review_content": "\nI'd first off like to point out that this class had plenty of potential. There are some very relevant bioethical issues that need attention, and discussion on these topics could have been really eye opening and engaging. Professor Loike was able to bring some of these topics to light, but handled them very poorly. During class Loike was very egocentric;  he held class by asking a question then interrupting students until he got the answer that he was looking for. \nHe did have some speakers who came into class, some of whom had nothing to do with biomedical engineering and some of whom were not knowledgable. One such person was not able to answer questions about how her work was pertinent to our studies. However, he did have a few interesting people come in, including representatives from the FBI. While these guest speakers are here, Loike leaves, is on his cell phone, or falls asleep.\nThe assigned textbook for this class is written by him, and he requires that we all purchase it. I regret dropping $40 on this text that I only read twice because I though I should give this class some effort. (This money and effort did not translate to any returns on investment.)\nThis was a fairly easy class, but I think my brain melted a little while taking it. \n*I did the same work and participated as much as other people in the class, and we received different grades. So keep in mind that the grading is largely subjective\nWorkload:\nWeekly discussion posts\nOne small written assignment due on the first day (required but ungraded)\nOne seminar response (required but ungraded)\nOne midterm partner op-ed paper\nOne final partner paper\nOne final class reflection (ungraded but required)\nA large part of the grade is based on participation \n"
        },
        {
            "course_name": "Topics in Biology: Frontiers in Bioethics",
            "review_date": "May 23, 2016",
            "review_content": "\nI'd like to bring a more positive note to this course's reviews:\nThis class is an \"experience,\" meaning there it's not about memorizing some facts and vomiting them on a page, its more about what you take from his class. A previous reviewer mentioned they didn't learn much, but thats not the only type of learning. He assigns readings, which only serve to catch you up to speed with the bio side of the ethical debate: you do have to know some facts about the scenario to truly understand what ethical questions arise. Aside from that he expects you to show up to class, once a week, and engage in a discussion about the ethical dilemmas of said issue. \nNow, it is true that Prof Loike can get curt sometimes (he'll cut you off in the middle of a point and start talking about something totally different), but that's mainly because he's trying to guide the discussion to his points of interest. It can be rough listening to someone argue a point about what might happen with biotech if the science already proves that you can control that aspect. He often mentions taking his arguments \"with a grain of salt,\" which is true because he does mention some disagreeable opinions given columbia's liberal community. The readings don't always match up with the class content but he'd catch you up to speed at the beginning of class in that case. \nTake away message: take this class with an open mind and try to participate because that's what he likes. Don't take offense to how he may respond to your comments in class and engage anyway. Overall, it can be a rewarding experience and a great way to learn about the future of biology and medicine with a focus on the ethical questions that come out of it. \nWorkload:\nWeekly readings + discussion post @ ~100 words (you can get away without doing the readings, but it helps to understand what the technology is so you don't make obvious or irrelevant comments in class)\nI think (3) paper assignments - all under 5 pages and generally not too taxing\nOne trip to a bioethical seminar\n\n"
        },
        {
            "course_name": "Topics in Biology: Frontiers in Bioethics",
            "review_date": "May 15, 2013",
            "review_content": "\nI can't say I really learned much of anything in this class.  Dr. Loike is an incredibly frustrating teacher in terms of the way he conducts his class.  This is mostly because he values his opinion more than anyone else's, so when he asks a question he only has his answer in mind.  This would work for say, a math class in which there is only 1 right answer, but for an ethics class there are multiple right answers assuming they can be supported by reason--if not, then there wouldn't be ethical issues in the first place!  As a result, Loike makes the class guess until someone (if anyone) reads his mind, all the while cutting people off. \nEqually frustrating was that he made us read his poorly written, pdf file \"textbook\" that he made us by and post on a discussion board--not too bad, but we never discussed our posts in class!  What's the point of the homework then?!\nI think the class has a lot of potential, and is definitely very easy--you don't take notes, there is a midterm and final paper and it only meets once a week for 75 min.  Just don't expect an amazing, life altering experience, or to learn much of anything.\nWorkload:\nmidterm and final papers, weekly discussion posts, have to attend 2 bioethics seminars.\n"
        },
        {
            "course_name": "Stem Cells: Biology, Ethics, and Applications",
            "review_date": "May 17, 2011",
            "review_content": "\nThis is a paper-based biology class.  This was the first year, so everything was a bit chaotic.  We never really knew what we should be reading, skimming, or just noting.  Class was a frustrating mix between a lecture and a seminar, and 4 professors and 4 TAs in a class with 16 people can be a bit much.  All of that said, I'd still recommend this class to students interested in stem cells and the ethics of science and medicine.  It's one of the few science classes that is more than academic bulimia.  Way less knowing facts and way more emphasis on reading papers and trying to answer more complicated questions about how stem cells work. \nWorkload:\nA rather large problem set every 2 weeks, in class midterm, take home final.  There's also a weekly recitation.\n"
        },
        {
            "course_name": "Topics in Biology: Frontiers in Bioethics",
            "review_date": "April 20, 2003",
            "review_content": "\nIf you're lucky enough to find a class Dr. Loike is teaching at the undergraduate level, take it! Perhaps because he normally teaches at the med school, he was gushingly enthusiastic about teaching bioethics to undergrads. He literally overflows with ideas, almost all of which are brilliant. A great resource for anyone looking to soak up wisdom from a phenomenal mind; he has much useful information to impart about the course material and the research process in general. My only complaint is that he doesn't talk enough in class; compared to his treatment of the material, student comments often seem uninteresting. Take anything he offers; this is the kind of professor that makes tuition worth all the loans. \nWorkload:\nHeavy for a 1 pt class. Two 5pg papers, but he's not that tough on grading.\n"
        }
    ]
}