{
    "prof_info": [
        {
            "prof_name": "Jean Laponce",
            "prof_id": 4252,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 23, 2010",
            "review_content": "\nJean Laponce is a great instructor for CC. He's a likable person, he's broadly knowledgable, he's well organized, and he's good at leading class discussions. He's also a fair grader (i.e. he's on your side). He's always pointing us towards books and online resources that are relevant to what we're studying. On top of that, this is a section of CC just for GS students; everyone is here voluntarily, everyone has had interesting life experiences, and everyone is interested in the material. The class discussions are of a pretty high quality. Everyone has something interesting to say.\nI would definitely disagree with whoever said this class is a \"joke\". That's just not true. CC has a heavy reading list, and Laponce expects everyone to contribute to class discussions. Your grade will reflect your contributions.\nOn the other hand, the midterm and final were pretty easy. The tests are a formality, and Laponce says as much. His priority (as it should be in a class like CC) is for you to jump into the text and figure it out for yourself, so tests and all that rigmarole are de-emphasized. Other classwork includes some short essays, and everyone is supposed to co-lead a class discussion once per semester (you get to volunteer for the book/author you would like to discuss).\nSo should you take this class? My best advice is to get a copy of the reading list, take some time looking over it, and make your decision based on how much you want to read the books. The whole point of taking a class like CC is to give yourself a chance to read these classic texts that (let's face it) you would probably never read otherwise. Keep in mind that most of the readings are long, and some of them are difficult. CC might not fit very comfortably into a busy schedule.\nIf you decide to take CC, you can't go wrong with this section. All in all, CC with Jean Laponce turned out to be the most enjoyable and rewarding class I took this semester. He deserves one of those silver nuggets.\nWorkload:\nLong, sometimes difficult readings. Class discussions about the readings, in which you are expected to participate. Not-very-difficult midterm and final. Several short essays. Lead one class discussion per semester.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2009",
            "review_content": "\nThe previous review is a bit unfair. Laponce's class is only \"a joke\" if YOU decide not to take it seriously. If you can't take a class seriously unless the professor is always grilling you, then it's true, you might not learn much, because he doesn't give heavy amounts of reading or impossible exams. On the other hand, if you decide to do the readings and think about them, then this is a good section, because it gives you the freedom to explore what you find interesting on the syllabus (for example, the essays were almost open-topic, which I thought was good). Laponce is laid-back but well-prepared for the classes--he goes over biography, important ideas from the books, and connects them to contemporary issues. In general I found most of the questions insightful and the discussions enjoyable. \nWorkload:\ntwo essays, midterm, final, response papers.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2009",
            "review_content": "\nThis class was a joke. Prof. Laponce is nice but often times the discussion was lacking. Main ideas were not easily extracted nor tied together between authors, because he lectures for awhile and asks irrelevant questions. The midterm and the final were easy and most of the questions were provided in advance, but sitting through the class was torturous. If you want an easy class, take him, otherwise, switch sections and find a class that is more tolerable and that you'll actually get something out of.\nWorkload:\n5 one pg responses, easy midterm and final, two 4-5 page papers with extensions\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 22, 2009",
            "review_content": "\nI love this man. Super nice, funny, and understanding. The workload is light compared to other CC classes, and people actually complained that the midterm and final were TOO easy. He understands that people have more important classes than CC, so he gives two due dates and he's always up for an extension, even after the second due date. If you get a chance to have him as a prof, take him! \nWorkload:\n5 one page written responses, two 4-5 page essays, an easy midterm, and an easier final. \n"
        }
    ]
}