{
    "prof_info": [
        {
            "prof_name": "Jared Calaway",
            "prof_id": 4989,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 16, 2009",
            "review_content": "\nMr. Calaway is extremely knowledgeable. If there's a question that he can't answer in class, he immediately looks it up and e-mails us the answer after. Calaway is very straightforward and organized. He also makes some amusing comments-- including, among others, hilarious Lord of the Rings references.\nThat being said, the class is often awkward. Calaway asks many \"leading\" (as opposed to \"interpretive\") questions that clearly have right or wrong answers; students, knowing this, frequently remain silent. It's sometimes difficult to sustain a discussion in the class without reaching a wall of awkward silence. Also, because the interpretive questions are few, Calaway tends to direct the discussions to a greater extent than necessary. That is to say, while the students speak a great deal in the class and have a very fair amount of time to express what they need to and ask what they need to, Calaway tries to makes sure that the discussion veers into a direction that he wants it to; because of this, heated interpretive debates--as one might expect from a class like Lit Hum-- rarely occur. For example, whenever we start to go into a direction in which we begin to discuss the text's relevance to our lives, we immediately veer back to a purely academic analysis, which I think defeats the purpose of the study of literature. Nonetheless, I think that that is more of the fault of the course itself (which demands great rapidity) than it is of the instructor. \nOverall, I'm highly pleased with Mr. Calaway's handling of the course, despite the few awkward moments.\nWorkload:\nTwo 6-8 page papers; Midterm; Final; Weekly postings on an online forum.\n"
        }
    ]
}