{
    "prof_info": [
        {
            "prof_name": "Rachel Ollivier",
            "prof_id": 10397,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Higher Mathematics",
            "review_date": "November 13, 2012",
            "review_content": "\nI took Intro to Higher Math with Ollivier in Spring 2012, per a senior's recommendation, and really loved her class. I failed to write a review at the time only because I was being lazy... but the review below needs to be ousted as the first one to appear on Ollivier's page.\nIntro to Higher Math gives a rigorous, detailed, and, most importantly, essential introduction to writing proofs. This class gives basic concepts of number theory and leads you step-by-step practice of various mathematical proofs. Again, a *step-by-step* introduction. Having moved on to more advanced math classes in the department, it is clear that professors will assume you know the basics of number theory (modular arithmetic, prime number behavior, etc.), group theory, and building a rigorous proof. There is no place to learn *how* to do a proof than Intro to Higher Math. For example, in Making, Breaking Codes (a great class---take it!), the professor will give a brief (read: 45 second) introduction to moduluar arithmetic and keep it moving. Same for groups. So, take this class if you plan to move on to higher math courses. I really don't know why the math dep't doesn't promote this class more---or maybe I'm a slow learner.\nNow for Rachel: she is, simply put, an awesome professor to have. I know CULPA is full of dramatic take-this-professor-or-die and avoid-this-professor-at-all-costs -type reviews, but this is hardly an exaggeration. Rachel was always available and eager to help during office hours and outside of them. She had even repeatedly responded to 11pm emails within an hour. You really get the feeling that Rachel wants you to 1) do well in the course grade-wise but also 2) develop sharp higher-math skills. Her cute French accent is also very endearing. \nWorkload:\nProblem sets every week. They are pretty long, and you will probably need to consult your classmates and the professor to finish them, but it's rewarding. (But this might be specific to Rachel's class? Other professors teaching may not demand so much.)\nMidterm and final exam. Do your HW well every week and these will not be a problem. \nThe class is not at all an easy A (or an easy B+/A- for that matter...) but if you give an honest effort you will do well. 'You get what you deserve' is very true for this course.\n"
        },
        {
            "course_name": "Introduction to Higher Mathematics",
            "review_date": "May 04, 2012",
            "review_content": "\n2 things:\nThe class was very good.  If you are going further past calc IV in math w/o honors math, take this.  It really prepares you for later classes\nThe professor was very so so.  So so so mediocre.  While she knows what she is talking about, I wish she would be a bit more enthusiastic.  She's also not very good at explain stuff or understanding what you are having trouble with.  She likes to go on tangent proofs in class that are over irrelevant and trivial.\nSo yeah,  Take this class, but if you can, take it with McDuff, who seems to care a bit more.\nWorkload:\nIf this is your first exposure to \"higher\" math, it will be a lot of work.  Expect 6 hrs a week at least.  Go to the help room and find a grad student tutor.\nWeekly PS, 2 midterms, final.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 01, 2012",
            "review_content": "\nOllivier is a good professor. She makes sure to go over all the material in the book in an orderly fashion, sometimes adding her own methods when it makes it easier for the class. After she's done explaining the theory, she will go over examples similar to those you will find in the homework assignments. Ollivier sometimes gets confused and flustered with herself, and she slips up in her English which embarrasses her (but it kind of endearing), but that doesn't take away from her clarity. She is also sweet and very approachable; she will stay after class to answer questions, respond promptly to e-mails, and smile when you hand her your final. Which is important.\nAs for the class material, it's boring and might seem endless. But this isn't Ollivier's fault- it's Calculus III's fault. And the midterms and final are much harder than the homework assignments or anything we did in class (except review_contente review_content problems), so don't expect to get everything right. It will be generously curved.\nIf you are like most students who are taking Calculus III as a major requirement (Econ, pre-med, something) then take it with Ollivier and pay attention. If you have an insatiable love for math then you might be disappointed. \nWorkload:\nWeekly problem sets, lowest dropped. Will take 1-2 hours.\n2 midterms and a final, all difficult but generously curved.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 28, 2011",
            "review_content": "\nOllivier is definitely not the best professor. I feel like her lectures got worse as the semester went on and I spent more and more time learning from the textbook. She really seems to know her stuff, but at times she seems to be so advanced in theoretical math that she doesn't know how to teach stuff like calc iii. She always tells us not to memorize formulas because she doesn't believe in that, which sounds good at first, except it's only because she can derive all the formulas whenever she needs to use them. Sometime during the semester she got a silver nugget which surprises me, but whatever.\nHer lectures were kind of useless and not really worth going to, except that she goes over some review sheet problems for the exams (and she doesn't put the answers to the ones she goes over in class online), and she mentions things in class that you need to know for the exams. She is really really soft-spoken and she has an accent, so it's hard to hear her if you don't sit in the front half of the room, but you don't need to be all the way in the front (although that definitely helps). She also uses some weird notation for things, which I assume is because she's foreign, that makes things harder to understand in the beginning (e.g. she does cross products really weird and doesn't explain it that well vs. doing it by matrices) but once you understand it her way is actually much easier.\nThat said, the class itself isn't awful and Ollivier herself is a pretty nice person. She's really nice during office hours and also a lot more lucid, though she can be a bit impatient with repeating herself, etc. She's also a really nice grader (i.e. she gives most credit if you \"seem to be going in the right direction\" and you explain your work). Plus, the exams themselves aren't too difficult, they're largely based on the review sheets she gives out. The class averages on the midterms were both around 16/20 which is higher than the averages for other calc iii classes, I think, and she said she would curve that to a high B or a B+. For someone who is very much a liberal arts person I did pretty well in the class, and I'm glad I blindly picked into her section.\nWorkload:\nproblem set due once per week (i was not aware that one was dropped) - every problem is checked\ntwo midterms (second one did seem much harder, but the class average was actually higher..)\nfinal (sort of cumulative but focused a lot on material not covered by first two midterms)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 11, 2011",
            "review_content": "\nVery nice woman, but not the best teacher. If you're not in the first two rows, you have no possible chance of hearing her. She talks directly to the board as she writes down problems and speaks very softly. My class was about 70 people, so if you didn't arrive 20 minutes early to snag a good seat, you were screwed.\nShe also got lost doing her own pre-prepared problems. There was a class on arc length (which isn't the most difficult concept) when she spent the entire class trying to figure out a problem. She finally asked if we would try it at home and explain it to her next class. She often said memorizing formulas was not necessary because most of the time, you can just figure them out. Unfortunately, she would take up half of our class time trying to remember simple formulas, like the cross product.\nI ended up learning mostly out the book, which didn't prepare me for the exams that well. The problems on the homework are all very simple. Exam questions are generally not reflective of the problem sets. If you're a math genius or someone who already took calculus III in high school, you'll do fine in this class. If you actually need to be taught calculus III, however, try a different professor.\nWorkload:\nOne problem set a week (lowest one dropped at the end), two midterms (the second one much more difficult than the first), and a final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 25, 2011",
            "review_content": "\nLiterally the best professor in the math department. Her lectures were clear, and she would always slow down and spend as much time as needed to make sure a concept was understood. She was great at office hours and would walk me through a lot of the homework problems and guide me to the right answer. Her tests were very fairly graded, the homework was manageable. She drops the lowest homework grade which was good. I won't take another calc class unless she is the professor.\nWorkload:\nGreat. Weekly homeworks to hand in as well as WebAssign weekly problem sets. 3 exams throughout the semester, a midterm and a final. Everything is fairly graded.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 05, 2011",
            "review_content": "\nAwesome Professor. she is for the most part very clear about the subject matter. she is easy to understand and very personable. she always starts out class by asking if anyone had any problems with the homework thereby ensuring everyone understands the material before moving on to something new. she does have a tendency to assume that the class has some basic knowledge of math so every once in a while the class had to ask what a quirky symbol meant or how she got to a certain answer because she will take short cuts so don't be afraid to ask.\nWorkload:\n2 midterms 1 Final. Hw due every Tuesday\n"
        }
    ]
}