{
    "prof_info": [
        {
            "prof_name": "Hossein Kamaly",
            "prof_id": 2088,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "October 05, 2016",
            "review_content": "\nKamaly's conversations were uninteresting and non-substantive. He is not good at directing discussion. The readings he assigns are pretty out of the blue and subject to last-minute change. They're also very inconsistent in length. There is no clear thesis or trajectory for the class. He does not write comments or grades on your essays--that's right, nothing, except maybe \"good\" or something short of that nature--which is annoying, lazy, and amazingly bad instruction considering there's no way to determine how you are doing and how you can improve. You will have no idea what your grade will be until you get it. His final is a \"conversation\" which seems sort of unstructured and strange. He is a very sensitive man, which can be a good thing, but in his case mostly inhibits him from relating to students because he seems insecure and a bit condescending.\nWorkload:\nsporadic. sometimes a lot of reading, never a lot of writing.\n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "September 04, 2011",
            "review_content": "\nI honestly think the majority of the *positive* posts are written by Kamaly himself. The man never responded to emails. I took this class in Spring 2010 and it was so horrible. Time in his class never seemed to be enough. Everything was discussed superficially. If you have no basic idea about a certain theme (say the Indian Gods, something I struggled with), you will be lost. Luckily, we had a great TA who understood how horrible Kamaly was, so that was great. People always complained from his grading, I managed to be relatively lucky.\nWorkload:\nJust don't read that stuff. At a certain point in those discussions you can use your general knowledge about life and not read the readings. \n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "May 15, 2011",
            "review_content": "\nMajor Texts with Kamaly was kind of a mixed bag. Some days were great, other days were so boring I would rather have been watching paint dry. While not the most engaging professor, Kamaly can be very encouraging when it comes to student comments and presentations. He also provides good background information on the texts. Some weekly reading assignments were way WAY too lengthy given the short amount of time we had to read them, and the superficial ways in which we discussed them. Kamaly usually sticks to broad themes and rarely delves into close reading, which can make your 200-300 pages of reading seem kind of pointless. In addition, those who would like to consider the texts as documents of their respective times and cultures might be disappointed by Kamaly's insistence on looking at things through the lens of the present, and what the contemporary implications of the texts might be. I personally found this to be somewhat condescending, as if he were pandering to us youngsters who only care/know about modern times, but I could see how others found this illuminating. We often strayed from the syllabus with little to no warning, and general expectations for the class were not made very clear at any point. For example, we were encouraged to post questions on courseworks and to give a presentation, but neither of these conditions appeared on the syllabus, nor were they uniformly practiced. Overall, Kamaly is a nice guy who cares about these texts, but whose time would probably be best spent outside the classroom.\nWorkload:\n200-300 pages of reading per week, 4 3-page papers, weekly discussion postings (optional?), presentation (optional?), midterm and a final\n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "May 13, 2011",
            "review_content": "\nMr. Kamaly is far and away the best teacher I've had at Columbia, and I've had mostly real good ones. He is absolutely brilliant. Every class he says things so novel, so remarkable, I would leave wanting to do much more than I'd done, which was already a lot. He is better read and more knowledgeable than anyone else I've had class with. He has insights into ordinary and unknown things. And he is one of the kindest people I've ever met.  \nWorkload:\nReasonable, but you can't dawdle. \n"
        },
        {
            "course_name": "Colloquium on Major Texts of the Middle East and India",
            "review_date": "May 19, 2010",
            "review_content": "\nI am not sure how the person below managed to say all those pleasant things about Kamaly. We were lucky enough to have a TA who did the majority of the grading so that isn't really my complain. However, I think its quite abnormal when the man does not respond to ANY EMAILS students send. I had him for major texts of India and the Middle East.. Most atrocious experience of all times. He went off tangent and said nothing substantial in class. Horrible. Horrible.. HORRIBLE.\nWorkload:\nA book a week.. very doable. \n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "March 29, 2010",
            "review_content": "\nProfessor Kamaly is the greatest professor I've had so far. These other reviews sound like people who were coasting by and then got suddenly upset when their grades weren't what they wanted them to be. Yeah, there's reading. We're at Columbia University! If you don't like to read, leave! Plenty will take your spot in a heartbeat! It is ridiculous to expect him to lower class expectations and standards because you can't keep up. A cop out excuse. That is not fair to him as a university professor. Also, class isn't even that freakin' hard. If you listen to what he's saying, you'll be fine. I got an A. Didn't fail the quiz like \"everybody did\" according to this other post. Maybe YOU failed? A on the midterm. A on the final. Just paid attention. I myself didn't read everything, still got an A.  One brief mid-semester quiz (which we knew about two weeks ahead of time). One midterm. One final. You may write a paper to supplement your midterm grade if you're unhappy with it. Sounds good to me. The mini-quiz that someone on this listing said was \"totally unrelated to what we had been taught\" was, frankly, exactly what we had been taught (he also told us what was going to be on it: a map, matching historical concepts, etc.). I was never able to make it to Kamaly's office hours because they conflicted with my schedule. He arranged a time and a day for us to meet that worked for me, and I had a pleasant conversation about al-Gazzali and Sufism with him, something he clarified in great detail for me. He is the type of professor I was expecting when coming to Columbia. Again, a wise man devoted to his students and his work, Professor Kamaly is an excellent teacher for the novice and the advanced student alike.   \nWorkload:\nMidterm. Final. \n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "March 29, 2010",
            "review_content": "\nProfessor Kamaly is the greatest professor I've had so far. These other reviews sound like people who were coasting by and then got suddenly upset when their grades weren't what they wanted them to be. Yeah, there's reading. We're at Columbia University! If you don't like to read, leave! Plenty will take your spot in a heartbeat! It is ridiculous to expect him to lower class expectations and standards because you can't keep up. A cop out excuse. That is not fair to him as a university professor. Also, class isn't even that freakin' hard. If you listen to what he's saying, you'll be fine. I got an A. Didn't fail the quiz like \"everybody did\" according to this other post. Maybe YOU failed? A on the midterm. A on the final. Just paid attention. I myself didn't read everything, still got an A.  One brief mid-semester quiz (which we knew about two weeks ahead of time). One midterm. One final. You may write a paper to supplement your midterm grade if you're unhappy with it. Sounds good to me. The mini-quiz that someone on this listing said was \"totally unrelated to what we had been taught\" was, frankly, exactly what we had been taught (he also told us what was going to be on it: a map, matching historical concepts, etc.). I was never able to make it to Kamaly's office hours because they conflicted with my schedule. He arranged a time and a day for us to meet that worked for me, and I had a pleasant conversation about al-Gazzali and Sufism with him, something he clarified in great detail for me. He is the type of professor I was expecting when coming to Columbia. Again, a wise man devoted to his students and his work, Professor Kamaly is an excellent teacher for the novice and the advanced student alike.   \nWorkload:\nMidterm. Final. \n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "October 31, 2006",
            "review_content": "\nI would not take a class with him again. Hossein Kamaly is an intelligent person, but not so great at teaching.  In my study group, which included a good number of people from class, we often had to rely on Wikipedia and Google in order to prepare for his exam because he was not good at conveying the information he wanted us to know.  He was more concerned with telling stories and getting the students to like him than with concentrating on teaching.  \nIn addition, his grading is not truly fair.  Though he wisely dropped the first quiz in which most people failed (what he quizzed us on was hardly covered in class or in the readings), his grading of the midterm and final exam caused me some concern.  On my midterm, he took off 8 points on one of my essays without writing what was missing or incorrect.  When I asked him about it, he acknowledged that I knew what I was talking about but assured me that I shouldn't worry because he was \"giving the final grade.\" (Whatever that means).  Those students who scored below a certain percentage on the midterm were required to write a paper in place of it, but he did not give that same option of writing a paper in place of our midterm score to those of us who scored above(the previous reviewer is incorrect in stating that everyone had that option).  Further, he kept extending the date for when the papers were due, so those who scored low on the midterm not only got to write a paper to replace their score but also got more time to do so.  \nHe was also very sensitive to any perceived criticism.  When a particularly vocal student asked him where he had found the pictures for a slideshow he had shown us, he defensively answered, \"I DO prepare for this class.\"  Although she wasn't my favorite classmate, I could tell she was just trying to give him a compliment, and yet he took it the wrong way. His sensitivity prohibited from being as effective a teacher.  \nAlso, I had to keep reminding him to hand back our midterms, which is suprising because a good professor should want to give feedback.  I repeatedly asked him for my final exam as well, but only received it halfway through the next semester.  \nMany of my classmates liked him because he wanted to be liked, and due to his full-time (non-professorial) job in the library, he was always available in his office, M-F.  However, this full-time job which made it so easy to meet with him also precluded him, I feel, from devoting the time and attention to our class that we deserved.  \nWorkload:\nweekly reading questions posted to Courseworks, midterm (or a paper as mentioned in my review) and final exam; one quiz that was dropped\n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "July 30, 2006",
            "review_content": "\nProfessor Kamaly is unmatched in his desire to make sure every one of his students is challenged and learning.  He entertains any and all questions and NEVER makes you feels stupid for asking something.  Always accessible outside of class, he's a pleasure to speak with, about Islamic History or in general.\nWorkload:\nAverage for a 3,000-level history class.  Lots of reading (to be expected) but only one midterm and a final.  Allows you to write a paper if you're unhappy with your midterm grade, or in lieu of the midterm.\n"
        },
        {
            "course_name": "History of Islamic Societies",
            "review_date": "April 03, 2006",
            "review_content": "\nA really interesting course, but fact-filled.  Kamaly wanted you to learn not just the general history, but also how to view history, and how Islamic history has been and is viewed in general.  He is a really engaging and insightful teacher and very willing to help students.  We all did really poorly on the first quiz and so the midterm and final were subsequently a lot easier.  Since it was his first semester teaching the course, he did a little bit of learning along the way, especially in the way of expectations from his students.  He is not an unreasonable man, but seems to believe we read at break-neck speed.  There is a lot of material to cover in the course so you fly through centuries, but Kamaly does a good job of giving a thorough but not too thorough overview of what's going on.He does like to call on people in class at first about the reading so having skimmed through the non-textbook pieces is important.  \nWorkload:\nLots of reading (not wholly necessary but do some, especially at the beginning) and midterm and final (both reasonable) one quiz (dropped)\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 13, 2004",
            "review_content": "\nHossein is an incredible mind, in addition to being an incredible TA.  He is always objective and concise.  He gives great context for the readings and fields all questions well.  Some people may argue that Hossein is a little stern at times, and this is true.  We have weekly discussion questions, and if you blow them off or submit questions that demonstrate you have not done the reading, he will call you out in class and make you feel like a little bit of a jackass.  But this shouldn't be a problem if you plan on doing all of the work.  Hossein's critical approach to all of the readings is helpful, if not necessary, in a class with such a one-sided view of things.\nWorkload:\nWeekly discussion Questions.  2 papers.  Final.\n"
        }
    ]
}