{
    "prof_info": [
        {
            "prof_name": "Josh Whitford",
            "prof_id": 2209,
            "total_reviews": 21
        }
    ],
    "reviews": [
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "January 19, 2011",
            "review_content": "\nWow. My first semester was a blast, thanks to Professor Whitford. He exudes and energy and classroom presence that reminds me why I came to Columbia in the first place. (Why does the man not have a gold nugget by his name yet?)\nSure, he goes on tangents and talks a little too fast. But he warns you of that on the first day of class. He truly has a passion for his work, and he just wants you to understand the concepts. Even after the class ended I still can apply the concepts he taught, and frequently bring them up at parties, much to my guests' chagrin. \nThe texts can be tedious, but he has accommodating office hours and will stay after class as well to answer questions or just chat. The grading depends on the TA, but the average grade was a B-B+ with a good percentage receiving A's. Do you readings and memos and you should easily get a B.\nI am not a sociology major, and this class counts as my QR requirement. Still, I enjoyed hearing him speak about interesting and controversial topics, make jokes, and complain about how a 10:30am class is too early. Take this class! You will be glad you did. \n\nWorkload:\nWeekly response memos, an open book midterm and final, and a research or field study project paper (8-12p) due on the last day of class.\n"
        },
        {
            "course_name": "Economy & Society",
            "review_date": "January 12, 2011",
            "review_content": "\nLoved, loved, loved this class.  I highly recommend this course to any Columbia student (I'm not a sociology major!).  Prof. Whitford has a great way of forcing his students to speak (and consequently think) carefully about the subject matter.  It was almost like he was fixing my brain, scrubbing it of the bullshit impulse I had developed for small group discussions.  The readings were pretty great, and I felt they were usually both informative and enjoyable to read (some could be considered 'pleasure reading' even).  I loved the way Prof. Whitford ensured that the class understood and internalized the concepts discussed.  Instead of being tested on tedious memorization or mindless regurgitation, we were asked to understand a few key concepts.  If you show up and pay attention, you'll pick up on everything he wants you to learn.\nBig fan.\nWorkload:\nDon't remember but I'm pretty sure midterm was open book, and the final was take-home.  Think there were weekly two-page (?) short responses too.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 30, 2010",
            "review_content": "\nBy far one of the best classes I have ever taken at Columbia. Prof. Whitford is charismatic, funny, knowledgable, and incredibly good at listening to his students. Sometimes the lectures are hard to sit through, but that's only if you haven't read the book. If you did read the book, the class is fun and fast paced, but not so fast that you can't keep up, you learn a lot about sociology very quickly. This was my first introduction to sociology, and now I'm considering switching majors. Prof. Whitford is very approachable, and his weekly memos are really forgiving (you get four re-do's on the memos). If you decide to take the class, I highly recommend you go to his office hours to ask for help on the paper!\nWorkload:\nA book a week, not too hard, plus a one to two page memo, which helps you keep up with the reading. A 5-7 page paper. A midterm and a final, both open book/open note. So basically, if you take really good notes and read the books, you'll do fine.\n"
        },
        {
            "course_name": "Economy & Society",
            "review_date": "March 15, 2010",
            "review_content": "\nIn a word- amazing. This is a brand new course that Prof. Whitford designed. The reading is extremely interesting, and really challenges the way we as a society tend to think about the economy. Every single reading was important to the total understanding of the course (this is perhaps the first time that I can truly say that none of the reading was superfluous to the thematic structuring of the course). Weekly response memos (of which you must submit 8 out of 12) really helped to cement my understanding of the week's reading. Prof. Whtiford emphasizes our understanding of economy and society as a whole, and he wants to see if we're really understanding the material and able to make connections between the readings. \nProf. Whtiford is intelligent, a good lecturer, and incorporates a lot of class dicussion (but doesn't use class discussion as a way to fill in time he should be talking, as some profs do). \nOverall, I highly recommend this class to both sociology majors and non-majors.\nWorkload:\nWeekly reading and response memos, in class midterm (essay questions, open notes), take home final\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "January 07, 2010",
            "review_content": "\nProfessor Whitford is so coool!!!! I just loved the way he teaches this class! I like the fact that he does not require us to memorize anything, but to UNDESRTAND the main concepts and to know how to approach any type of scientific evidence critically. The books were just awesome, I had difficulty finishing them because I would stop almost on every page to think about what I have just read or to discuss it with my husband. His lectures are great too. He really wants you to think about the stuff you read. You don't have to agree with him, but you should be able to argue you point while providing some evidence. Class discussions, comments, and questions are encouraged, by the way. Than you have separate discussion sessions once a week with TA's, which were great also. Yeah, I have to admit, reading a book and writing a 2 page memo on it every week, as well as writing a 10-page paper was a pain in the neck, but at least it was interesting and rewarding. The grading mostly by TA's, except for some portions of the exams. And if this is your Quan. Reasoning fullfillment choice because you can't do math, than go for it because there is NO math in this course. I got an A for the class.\nWorkload:\n2 exams, 6 2-page memos that are required and 2 optional, 1 10-page research paper closer to the end of the semester. You have to read 1 book (or a few articles sometimes) for each week (most of the books are only select pages though). The staff is not a rocket science but you have to spend some time on it.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "November 18, 2009",
            "review_content": "\nTook it last spring.  I loved the material and the way the readings were ordered, but the lectures were difficult to sit through for the most part, esp. since he tends to not finish his sentence and also reiterate the same point like 5x like you're braindead.  You will learn from his lectures for sure, but it's by no way does it keep you engaged the whole time.  As a person he's great and brilliant, but he would do better in a small class setting rather than 70+ people lecture.  As long as you keep up with the readings, do the assignments, and go to class 50%+ of the time, there won't be any problems.\nMy TA was awesome, so if you have a good TA, get a lot of help from them in learning how to analyze arguments, synthesize your own, etc.  \nWorkload:\nA book or a set of articles every 1-2 weeks; 2-3 pg paper for almost every week, midterm, final, and a empirical research paper. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "May 06, 2007",
            "review_content": "\nA good course for someone contemplating sociology as a major. This is a methodology class so you get to see the different types of research sociologists do and how they analyze their data. Don't be intimidated if you start off with Durkheim's \"Suicide\" and the giant spew of statistical data; there's some easier to read ones along the way and more contemporary stuff like race relations in the mid to late 20th century, getting jobs and social contacts within the last 20 years. \nCan get away with skipping one or two readings in the first half of the semester but must read all the second half ones for final. GO TO ALL THE LECTURES! This really helps; the professor reiterates the main points and questions at the beginning of each class and he does a good job drawing the main themes and points together. Class is half lecture half discussion; sometimes this is good but sometimes students talk off topic or gets random. Discussion section required for undergraduates; this is helpful if there are things you didn't understand in lecture.\nWorkload:\nAbout one book per week plus weekly memos; but you only have to do 6 out of 11; midterm, final, final paper where you pick a method and carry out research. Not too difficult overall since this is an into class.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 12, 2006",
            "review_content": "\nWhat I really liked about Prof. Whitford was his delivery of the lecture. I liked that he was able to present the material in a way that made things understandable. When something wasn't clear, I was always able to discuss it with my TA in the discussion section. I don't know if he handpicked TA's for this class, but mine was EXTREMELY helpful and knowledgeable. Although some people didn't like his class discussion,I really benefitted from it. He was really effective in being able to transition from lecturing into discussion and often incorporated class participation in his lectures by posing questions for students to debate. \nThis way, you really get to see different ways to think about the readings, and that will help you on the exam. I like that he doesn't try to force his opinion on you - he can accept any well argued position. \nWhat I liked most about the class is that he stayed true to the title. We were never required to remember trivial numbers or obscure concepts. What was really important was the author's main argument and how effective the methods used and information gathered were in answering the question. After all, it is a methods class, so that's what's most important.\nThis is not a BS class, but it isn't the hardest you'll ever take. You really need to do the reading, but most of it is manageable. Some of the books are a little dense (e.g. \nDurkheim's Suicide or Massey and Denton's American Apartheid), but many of them are fast reads (e.g. Mitch Dunier's Sidewalk, Granovetter's Getting a Job). It's also easier because you aren't reading for obscure detail. The big picture is way more important in this class.\nIn all, the subject matter was really interesting and, if you're not into it, you probably won't be into the class so much either. It's sociology, so we talk about things related to social issues. \nWorkload:\n9 books throughout the semester, Weekly response memos which are okay if you do the reading, 1 midterm, an 8-15 page research paper that requires (a little) fieldwork, and a final\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "January 11, 2006",
            "review_content": "\nI would definitely recommend Josh's class.  He's very intelligent, has a good sense of humor, and genuinely cares about his students, taking the time to learn everyone's names in a class of at least 50 students. He made the lecture class seem almost like a seminar by encouraging class discussions but lecturing when necessary.  The readings he chose were all very interesting, giving us an idea of the breadth of areas that sociology covers. He made his points in class very clear so that you knew what ideas about methodology in sociological research he wanted you to take from the course. The written assignments for each book were helpful because they made you read carefully, understand the author's concepts and methods, and come to class ready to discuss the readings.  Doing the research paper on suicide was a good experience that helped us learn how sociologists make causal arguments using empirical evidence. Make sure to pick a topic that has enough statistics available to back up your argument and that you'll also enjoy writing about. If you understand the main concepts of the readings, you will do very well in the class since the response memos and the midterm and final all test understanding rather than memorization of details.\nMy one complaint about the class was that sometimes the discussions would become irritating and lose focus because people in the class would talk just for the sake of talking rather than having something relevant to say.  For example, it became frustrating when members of the class argued about whether or not Duneier was involved enough in his research because he didn't actually sleep on the sidewalk, ignoring the fact that he was solely researching street vendors (many of whom were not sleeping on the streets) and that he spent years of his life working with the vendors.  Even more annoying was when some of the students complained at length about their grades on a response memo when three of the grades are dropped anyway and a single memo grade is trivial when put in perspective.  Thankfully, Josh ended the discussion by clarifying his grading standards and telling them to talk to him after class about it.  But often times, he allowed members of the class to go off on these types of tangents. I think that's the one detrimental effect of being too nice. \nWorkload:\nThe workload for this class is pretty heavy since you basically read a book per week and write a short essay for each book (aside from Durkheim). Make sure you do a thorough job on your response memos because well-written responses will set you apart from the rest of the class and are very helpful for the midterm and final, which are open-book and open-notes.  The paper was somewhere between 8-10 pages long and requires a good amount of research, so it's best not to leave it until the last minute.  \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "January 09, 2006",
            "review_content": "\nProf. Whitford is a cool guy and I enjoyed the books he chose for this class immensely. One problem I had was the way class time was spent. He doesn't lecture, though sometimes I wished he would give clearer answers. Sometimes it became a back and forth discussion between him and one student, sometimes about something that seemed completely irrelevant to the class as a whole. That said, I thought the class was okay and that as he keeps on teaching he will get better. He was open and friendly and overall the class was not a bad one.\nWorkload:\n1 paper on Durkheim's book Suicide, Midterm and final, both open bookWeekly responses to the readings\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 18, 2005",
            "review_content": "\nNot bad -- definitely not what other people are posting about him though.  I mean, he's good... but not great.  Maybe there's potential there, and he's young and new and all that, so fine, I'll give him the benefit of the doubt here, but honestly, I was uninspired and disappointed.  Disappointed because I was really excited to take the class before the semester began.  And Prof. Whitford is a really nice, fairly enthusiastic guy -- at first engaging, so that I woke up early just to get a good spot in the class. However, while he has a very good idea of what he wants to cover, he is not effective in doing so.  I often felt like the lectures were redundant (there were two per book, usually -- except for Durkheim in the beginning), and since he encouraged class discussions, a lot of people made useless comments and brought up discussions based on personal anecdotes that he endlessly entertained.  This is all well and good one in a while, but a whole class on it?  I left every single class feeling that we hadn't gotten the most out of the books.  Yes, they are excellent choices.  Yes, Prof. Whitford is genuine and interested in the class.  Yes, he's young so he relates to students well.  No, he has not yet mastered effective discussions in his lectures.  No, he does not present the material well.  Perhaps in time he will work the kinks out, but really, don't kid yourself taking this class -- it probably won't be the most enjoyable/interesting sociology class you take.  It won't be brutal, but even though the readings are interesting, they become tedious and they *are* extensive (about 150 pages a week -- to be read over the weekend and completed by the first class of the week.  Fine if you're only taking four classes, I guess).\nI don't really know what to say as far as reccommending him.  He's not a bad guy, and he's not an awful teacher, but he *is* subpar.  I've had *much* better professors at Columbia.\nWorkload:\n150-200 pages of reading a week -- usually interesting, but it can get tedious.  1-2 page response memo once a week (due the same day the reading is). An long paper based on Durkheim at the beginning of the semester -- I thought it was restrictive and uninteresting, a lot of people think it's fun though.  A midterm and a final -- both are open book.  They are easy.\n"
        },
        {
            "course_name": "Sociology & The Public",
            "review_date": "November 14, 2005",
            "review_content": "\nJosh is the shit, no kidding. He's extremely intelligent and totally lacking in any arrogance whatsoever. The course is great -- interesting readings, and the load isn't as heavy as he sometimes apologetically believes it is. He's excellent at drawing the class into discussion and he's interested in everyones opinions no matter how contrary they are to his.\nAn excellent class that everyone should take, and as easy as it may seem along the way you'll be surprised by the amount you leaarned by the end of it.\nWorkload:\nReadings: A short (easy) book or a couple of academic papers every week. You write 3 page memo responses to a choice of questions based on the reading for the week -- need to do 9 over the semester. Take home midterm and final. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "August 29, 2005",
            "review_content": "\nProfessor Whitford quite obviously knows his sociology and I did get the impression that he enjoys teaching. That said, he needs to address several problems. To begin with, unless you are sitting in the first five rows in class, you will not be able to hear or understand a good deal of what he says. At the beginning of the semester, he did say that he knows that he mumbles and is hard to hear, and to please let him know when that is the case. He did not, however, make any attempt to improve his presentation style; it just meant a lot of repitition, which gets tiring. In fact, Prof. Whitford is at his best, both in terms of audibleness and clarity, when he lectures, but he does this very rarely. The class mostly consisted of a core group of students going off into tangents about their personal experiences or feelings; be prepared for a lot of irrelevence in this class. One of the best classes was a lecture given by a TA, which came as an all too brief relief from the usual intellectual meanderings of the class members. Finally, Prof. Whitford is often supportive of students' ideas/comments, but also could be very dismissive.\nGrading depends greatly on which TA or if Prof. Whitford has marked your work.\nWorkload:\nOne paper; 8 memos; open-book midterm and final.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "May 28, 2005",
            "review_content": "\nwhat can i say?  i loved prof  whitford.  i will add one more thumbs up.  he is caring, thorough and involved in the course.  i enjoyed the reading immensely.  i thought the course was well structured.  and i also believe prof whitford will be one of columbia's best.  \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "May 21, 2005",
            "review_content": "\nProfessor Whitford is a wonderful teacher.  He is engaging and truely interstead in the material.  He makes himself available to students for discussion in and outside of class.  I was especially impressed that he learned the names of all the students in our lecture so he was able to call on us by name.  The class has a fairly large amount of reading, but Prof Whitford has thoughtfully selected intersting works that he is excited to share (and you too will be excited to come to class and discuss).  Although on occasion Prof Whitford becomes tied up in summarizing materials, on a whole the class is eye-opening to the study of sociology as well as to various social and economic conditions in society.  I left the class with a different outlook on the people around me.  Class contributions by other students become enlightening under Whitford's instruction.  People from all different backgrounds are able to voice their opinions with equal oppurtunity.  This is a great Prof and a great class!\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "January 03, 2005",
            "review_content": "\nI truly enjoyed this class.  Professor Whitford was genuinely passionate with the material and his students.  He formed the class around the students and was open to suggestions regarding the way the he structured the class.  This was an interesting class, not only because of the information covered, but because Professor Whitford didn't emphasize grades as much as he did the material.  It sounds cliche when professors say that grades don't matter as much as students think they do, but he truly believes it.  If you do good work, you'll get a good grade.  This is his first year teaching, so he's still working out the kinks, but it was still a very good class and one I would definitely recommend taking.\nWorkload:\n6-8 page paper at the beginning of the semester (it's nice to get it out of the way early), 1-2 page reaction memos which are easy to get good grades on, and a straight forward midterm and final.  There is a fair amount of reading, but it helps that he assigns the reading to be completed by the beginning of the week, resulting in less work during the week.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 31, 2004",
            "review_content": "\nJosh Whitford is a great professor.  He's this young guy who knows how to get the class engaged in great discussions.  He tries to get participation from everybody, and if he notices that the class is uninterested or that a specific text was generally uninteresting (though most of them weren't), he tries to move on as quickly as possible.  He's a fair grader (and so is the TA); the only way to fail the class is to not show up or to not hand in any of the work.  Otherwise, most people do fine in the class.\nWorkload:\n1 8-page paper in the first half of class, 1 open-book midterm and final, 100-150 pages of reading each week and 9 1-2 page reaction memos (reaction memos are handed in weekly AND only 6 have to be done.  If you do all 9, the 3 lowest grades are dropped)\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 29, 2004",
            "review_content": "\nI agree very much with the reviews below.  I found this class to be very interesting and also think that Josh Whitford has the markings of a great professor.  The criticisms mentioned ( his occasional tendency to mumble, sometimes not answering questions clearly enough) are warranted but are indicitive of his lack of previous classroom experience (this was his first class taught) rather then his ability to teach.  I thought he made the material engaging and did his best to get to the point of the works he assigned while translating any jargony words or phrases.  The reading load seems a bit large at first but the books truly are interesting.  I've taken enough sociology to know that some of the stuff out there is difficult to digest but I feel that Prof. Whitford's choice of readings makes this class worthwhile even for  non-social science folks.  The works assigned run from sociological classics (Suicide and Obedience to Authority) to recent works (Sidewalk) which help to give an overview of sociology as a whole.  He does try to turn the class into a discussion but I think any teacher who truly wants to teach effectively should make students talk about the material 9am or not.  Bottomline: if you're looking for a good starter class for sociology with a professor young and passionate enough to make you care about what you're learning, take Whitford's class.\n\nWorkload:\n a 6-8 page paper very early in the semester which is not as daunting as it sounds and is even pretty interesting to do (as far as papers go of course). A 1 to 2 page reaction memo for every work read after Durkheim but they aren't very difficult and actually helped me truly grasp the readings.  Open book midterm and final but don't be fooled the exams are still a challenge and open book is only an advantage if you've already read the books and been to the lectures.  Overall, the load is manageable and he is a very fair grader \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 23, 2004",
            "review_content": "\nWow, this course blew my mind!  If youÂ’re fulfilling this course as a requirement, skip down to my analysis of Prof. Whitfordv  If youÂ’re browsing for an interesting course then read on:\nLet me begin by discussing what this class is: a survey of sociological methods and their faults.   I consider myself a hard-science person and this was my first introduction to the social sciences.  I found it fascinating and I hope I can convey my enthusiasm (and convince you to take this amazing course):\nThe best thing about this course is the reading list:  first, DurkheimÂ’s Suicide Â– a fascinating look at how science and the scientific method can be applied to society. By viewing suicides as a broad occurrence (rather than individual phenomena), Durkheim finds that the rate of suicide varies across different categories. Suicides rates are higher in the summertime, higher at nighttime, higher in urban settings, higher among males etc.  Durkheim then introduces social theory to try to explain these findings.\nThe other readings were just as interesting Â– one about the problems with getting reliable data about peopleÂ’s sexual practices.  We read MilgramÂ’s classic experiment about test subjects doing horrific things to each other (in the name of science) Â– a book which is very relevant to the holocaust.  We read a book about social networks (in the context of finding jobs), a study that numerically measures racism in the job market (by sending out thousands of resumes with an applicantÂ’s name suggesting a certain race).  The second half of the course was less numerical but just as interesting.  We read a work about book/magazine vendors and homeless in Greenwich Village (written by a professor who spends 5 years on the streets with them).  We read a largely-historical book about urban segregation, a book about attitudes of working-class men towards other classes and races, and finally a book about the manipulation of gender roles in Mexican sweatshops.  There was a lot of reading and much was hard to read (especially durkheim) but the content was interesting.\nOk, ABOUT THE PROFESSOR:\nProf. Whitford knows the material well but heÂ’s not the most exciting lecturer...especially at 9am.  It was hard to drag myself to class, but the chance to discuss the interesting material with intelligent students was good motivation.  He usually introduces the books and the methods, frequently giving us related stats and then he tries to turn class into a discussion, although there were about 40 students.  This was only partly successful Â– maybe it was the 9am thing, but only about 10 students regularly participated.\nIn generally, Prof. Whitford explained the concepts and the books well.  But a few times, he seemed unable to clearly explain concepts when asked by students (to quote one student Â“I feel like youÂ’ve given 4 different definitions for...Â”)  In general, he asked good questions which stimulated class discussion.  But sometimes he failed to control the class sufficiently and weÂ’d get frustratingly off topic.   He also isnÂ’t the best public speaker Â– he sometimes has to start sentences three times before he gets them out.  But these are all minor problems and will only get better with time and experience.  I also didnÂ’t feel like he was involved enough with the gradingÂ– it was mostly left up to the grad student TA.  More comments on the tests, research paper and responses would have been helpful.  Sorry this review is so long!\nCourse Content: 5/5:\nProfessor: 4/5\nWorkload:\nA lot of reading (100-150pg a weekend but itÂ’s a pleasure), 1 research paper in the style of Durkheim (you get to collect your own real data about suicides and analyze it!), eight 1-2 page reading responses which let you choose from 3 or 4 thought provoking questions (also to be done over the weekend, graded fairly easily).\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "December 22, 2004",
            "review_content": "\nWhitford has the potential to be one of Columbia's best. He is passionate about the material, assigns engaging texts, and facilitates good discussion in his lectures. Perhaps a function of his youth, he seems genuinely concerned with the progress of his students, and tries to make sure that everybody understands the material before moving on. He goes out of his way to make sure that all of his students do well , and consistently makes himself available after class. He is definately not just there to present a lecture, he wants to make sure that everyone gets the point. He is very flexible in all areas, and is a fair grader IF you come to class and do the assigned readings. Dont be fooled by his easy demeanour, if you dont go to class and fail to prepare the readings, you will not get over.\n\nWorkload:\nThere is one 6-8 page paper within the first month or so of the class, and then one response memo each week to make sure that you are doing the assigned readings. The average reading is around 150 pages per week. The mid term and final are open book, but dont be fooled - his exams are difficult. If you dont know the material you will be lost. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "November 14, 2004",
            "review_content": "\nHe is a very good teacher for an introduction to sociology. He is young and genuinely interested in the material and allows for good discussion in his classes with good texts. When students find a text boring he summarizes it and tries to help the class move on as quickly as possible while retaining the necessary information. The readings are almost all interesting with one or two exceptions and quite manageable. He is a very fair grader and if you do the reading, go to class most of the time and hand in the assignments you will do well in the class.\nWorkload:\n6-8 page resarch paper (not too  much research) at the beginning of the class, one-two page reaction memos to the reading almost every week (very easy and graded easily--and only have to do 6 out of 8), about 100-150 pages of reading every weekend, midterm (open book and not too hard) and final\n"
        }
    ]
}