{
    "prof_info": [
        {
            "prof_name": "Edward Shortliffe",
            "prof_id": 2140,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Biomedical Informatics",
            "review_date": "July 19, 2004",
            "review_content": "\n(Note: my opinion is from the perspective of a CS major, not a premed / BME / BINF student.)\nThis course is a valid CS technical elective, but it's about as \"technical\" as Music Hum. The only use of a computer for this course is to type the weekly homework assignments, which are all essay questions. The course introduces you the various applications of IT to medicine, especially the hospital environment. Topics include electronic patient record systems, biomedical imaging, electronic order form, and disease classification standards. Each topic is covered by a different professor from Columbia's uptown campus; Shortliffe himself handles 5 lectures or so.\nThe material is quite interesting in a hands-on way--you get to see how the CS stuff you learn gets applied. As such, it often involves brief, simplifying revisits the traditional CS classes, e.g. Database and NLP and Computability. On the other hand, it also involves a lot of medical jargon unknown to CS students, which make up half the class. Although Shortliffe said that the course does not assume any prior exposure to medicine, the lecturers (again, med school profs) tend to forget that. But perhaps this is only fair, since the medicine people tend to find the CS stuff hard to grasp.\nThe class also touches upon social and political issues like privacy issues and Medicare, as well as the theory and history behind Biomedical Informatics as a distinct academic field. Overall, a palatable salad of things and a nice escape from programming.\nWorkload:\nWeekly written HWs, about 2/3 pages each, check or no check. A comprehensive OPEN BOOK written final. Not terribly difficult, but the CS student may find giving opinions (as opposed to right/wrong answers) and the whole medical nomenclature vague and unfamiliar. Also, the BINF graduate students take the class very seriously, thereby screwing up the curve. You need to work towards a good grade, but this class is suitable if you like writing, if you like to see some real-life applications of your CS knowledge, or if you don't care about your grades (this is the only CS class in which you can b.s. your way to a pass).\n"
        }
    ]
}