{
    "prof_info": [
        {
            "prof_name": "Corbett Bazler",
            "prof_id": 2386,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "July 20, 2007",
            "review_content": "\nThe Baz is a great instructor.  First, he knows his material.  While you were rocking out to Weezer, he was digging the classical.  He was playing piano as a zygote.  To quote: \"Yeah...you know in tenth grade, I was SO into Bach!\"  He has a zippy sense of humor; class is rarely boring.  I absolutely despise classical music, but that notwithstanding, the music was tolerable because of his fine teaching.  The Baz can also play just about anything on the piano, which is extremely helpful.  He will take out as much time as you need to help you understand the material.  All in all, cool guy.\nWorkload:\nEasy, in my opinion.  Not easy like you're guaranteed to get an A easy, but if you put in the time, you'll be fine.  Even a musical dunce like me did pretty well.  There are two tests, two quizzes (cut to one in my summer session) and a paper.  And class participation, of course, which is a freebie.  The tests, again, are not freebies, but you'll never find the Baz trying to trick you or trip you up.  He's just making sure you studied some.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 17, 2007",
            "review_content": "\nThis course changed the way I think about all music. \nAdmittedly, that's what a music humanities class is supposed to do. But I've met a lot of unsatisfied music hum students who complain about the tremendous waste of time they spend trying to learn musical notation and dates of compositions. Professor Blazer focused on concepts in music that apply in other areas of knowledge, he deconstructed pieces intelligibly, and even fit in great anecdotes about the composers lives. He was a truly amazing teacher. Not only was he passionate, clear, and really funny, and really seemed to care about his students, even the musically challenged ones. I have taken most of the core classes here, and this has been by far has been the best. \nWorkload:\nNormal. One quiz, 5-7 page paper, midterm, final. He gives review sheets for these, so if you don't do well, it's probably your fault. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 26, 2007",
            "review_content": "\nProbably the most interesting class I took at Columbia.  It was good to finally take a professor who seemed passionate about the subject in question and took the time to answer people's questions (although this did make the class lag behind in material).  He really makes you change the way you think about music.\nWorkload:\nParticipation is a sizeable part (around 20%) of the grade, so you probably need to say something once or twice a class.  Essays are typically graded like any other writing class at Columbia, a lower grade on the first one and a higher grade on the second.  Midterm and final are not too bad, as long as you know some of the main material you can do decently well as they ask pretty open ended questions.  \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 08, 2007",
            "review_content": "\nThis class has been one of the best experiences  at Columbia. Corbett's knowledge of music is tremendous. Most importantly, his passion for music and charm will inspire you. He never condescends, has a great sense of humor, is very fair and kind. He is extremely witty for a young instructor, in the sense that no question will throw him off. He might willingly indulge in 'beyond-curriculum' music banter, but he LOVES his music. He is quick to play anything at all on the piano to explain what mere mortals cannot hear in terms of rhythm or major-minor mode. The work load was rather big, but I walked away from this class so much richer in music knowledge and have learned to appreciate the old masters in every way. His very memorable, uncanny 'Corbettish' delivery will stay with you. Consider yourself lucky to be in Corbett's class, it will be an asset to you for the rest of your life, if not professionally, most definitely personally.\nWorkload:\nTwo essays, midterm and final. Rather difficult, but always fairly graded.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 12, 2006",
            "review_content": "\nProfessor Bazler, or I shall say, Corbett, is the best professor that I can expect from a music department.  I actually don't know how to describe all the details because everything about him and the class is simply great.  If you are in his class, you are in luck!\nWorkload:\nreasonable and enjoyable\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 02, 2006",
            "review_content": "\nConsidering that if you're in CC you have to take this class, Corbett is an excellent choice for a teacher. I really liked his casual manner - he doesn't make you feel like an idiot if you don't understand music. He's funny and brilliant, with the ability to sit down at the piano and play just about anything.\nSometimes I thought he could be a little too gentle with the class in that some people would just go on and on and on talking and asking questions, but overall Corbett is a really great teacher and I know he'll have a bright future ahead of him when he gets out of grad school.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 10, 2006",
            "review_content": "\nCorbett was a fantastic TA, his music hum section is my favorite class this semester, and among the best I've taken at Columbia. He teaches the theory and concepts thoroughly, and knows many interesting and hilarious anecdotes about the lives of the composers we are talking about. He is super sweet, and very helpful outside of class as well. His class increased my appreciation for music tremendously, and helped me discover composers I knew very little about. Overall, a great choice!\nWorkload:\nNot that much. Most of it involves listening to music, which is the most enjoyable homework you will ever have at Columbia. Read the textbook (which is interesting) if you like, but it is not essential -- we cover all the important points in class. One 3-5 page \"concert report\", which can be written on the class trip to the NYC Opera, and one 8-10 page (rather difficult) term paper of a \"close listening\" comparing several pieces of music.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "November 15, 2005",
            "review_content": "\nCorbette Bazler is definetly not a bad choice for a music hum professor.  He is great when it comes to playing themes and motivs on the piano, and his clasroom has an open, supportive atmosphere.  He really knows his music, and if you can get past some of the awkwardness of his delivery, you will be able to learn a whole lot of really great stuff.  He tends to get a little bit behind because he gets too invovled in what he is lecturing on, and this can get frustrating at times.  Nevertheless, I would certainly recommend him as long as you won't get too frustrated by some mild disorganization and occasionly wandering lectures.  \nWorkload:\nNot too bad at all.  Listening quizes, concert report, final paper, midterm, and final exam.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2005",
            "review_content": "\nTop-notch TA who knows his music/music theory/music history inside-out, cold, blindfolded, both hands tied...etc.  For the handful of classes he taught in place of Prof. Smit, Corbett came well-prepared and even took over for Smit when Smit came an hour late to class.  Three impressions he left: (1) his ability to walk to the Steinway and play segments of the song being discussed -- impromptu; (2) his cheerful mien when piano-ing it up; (3) the amusing repartee between him and Smit.\nI'm not sure if he partakes in grading, but I'm becoming more convinced that he didn't for our class.  Definitely a resourceful, enjoyable, and approachable character.\nWorkload:\nRefer to the reviews on Prof. Smit for this class.\n"
        }
    ]
}