{
    "prof_info": [
        {
            "prof_name": "Perla Rozencvaig",
            "prof_id": 644,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "Comprehansive Beginners Spanish",
            "review_date": "March 30, 2012",
            "review_content": "\nPerla is absolutely fantastic. If you are looking to take Spanish with someone who not only really cares about her students, but is also an expert in her field, you'll be in luck with Perla. It is so obvious that she loves teaching, and she makes an effort to make sure that all of her students stay on track with the course. If you need extra help, she's extremely accommodating. She's also super understanding if you need an extension. She grades fairly in my opinion. Participation is a large part of your grade, and she calls on people so essentially everyone participates which helps when final grades come out. If you get a chance to talk with her about Cuban politics or any politics really, definitely do so! She's a wealth of knowledge. If you're enthusiastic and put effort into the class, she won't over look it.\nPretty much, she's great. I definitely recommend any of her classes. (I've taken three with her.) \n\nWorkload:\nCompositions: 3 or 4 and fairly graded; also she'll help you if you go to her\nReadings: Most are interesting; in her advanced class, they can get really hard so give yourself time to complete them\nHomework: Part of the grade, but never actually checked and easy to provide answers on the spot\nParticipation: It's a language class. If you have a problems with speaking in class, you should probably get over that.\nEnthusiasm: Can't hurt\n"
        },
        {
            "course_name": "Comprehensive Intermediate Spanish",
            "review_date": "December 14, 2010",
            "review_content": "\nPerla's certainly very nice, but I must say this class turned me off to Spanish and Hispanic studies greatly.  Classes were repetitive, which is typical with languages, but she rarely clearly explained the grammar we were studying.  Had I not known most of the grammar beforehand I probably would have gone crazy.  She definitely had favorites and didn't try to hide that, calling on the same few people over and over again.  Her policy on compositions (she averages the grade between original and revised versions) was unnecessary since she rarely bumped the grade any more than from a B to a B+ even if all corrections were made.  I also found it frustrating that she never responded to emails or made an effort to use Courseworks (or any technology) in this class.  \nOverall, she's a sweet woman but did not create an environment or class that I enjoyed or found to inspire interest in the language.  \np.s. Don't get all of the books listed on courseworks (and DON'T buy the $80 online component), because we never used an expensive textbook or the online version.  $115 wasted, $80 of which I can't get back.\nWorkload:\nLots of exercises in the books, but she never checks them so if you're quick on your feet you can still participate in class without doing the homework.  Three compositions and revisions, three movies to watch outside of class, group project, midterm (which was super easy), oral final and in-class final.\n"
        },
        {
            "course_name": "Intermediate (Spanish) Conversation I",
            "review_date": "January 20, 2010",
            "review_content": "\nI loved Perla! She is an absolutely sweet and caring woman. She is very understanding when it comes to work as well. I enjoyed her class because she made us participate - this makes the class go by quicker and helps me learn Spanish. Our class was a lot of fun -- she usually let us work in partners or groups on assignments or we just discussed and chatted about life... in spanish. She rarely gave actual lessons (that stuff is all in the book) and I'm thankful, because that would have been so boring. Some people in my class thought she was a bit intimidating or even mean? for calling on them, but I say, suck it up. She also throws her classes parties at the end of the semester...our conversation with her at the party = our final oral. AWESOME.\nWorkload:\nA lot...a good amount of time goes into this class, but I wouldn't say it is hard.\nDaily homework -- she doesn't check it but I would suggest doing it, because she calls on people and expects them to have the answers.\n4 Compositions -- first draft grade + final draft grade are averaged together, so they are easy. Just make the corrections and hand em in on time.\nFinal Project -- A little irritating, but a grade booster if you put work in. Pick good partners.\nOral Exam -- Literally just chatting with Perla. Awesome\nMidterm -- I thought it was easy, but you have to study out of the book\nFinal -- A little more challenging, but fair\n"
        },
        {
            "course_name": "Comprehensive Intermediate Spanish",
            "review_date": "January 02, 2010",
            "review_content": "\nI took Perla's Comprehensive Spanish class, which is a combination of Intermediate 1&2. It was the fastest and easiest way to get through the language requirement and it was so enjoyable. Perla is such a sweet woman and her class was my most enjoyable class during my first semester here at Columbia. The class is not that difficult. She calls on students alot in order to get everyone to participate (class was only 17 students). So, I recommend that you do the homework so that when she randomly calls on you, you can actually answer the question correctly instead of worrying because you're not prepared. The movies that she assigned for us to watch were really good. We discussed them in class, some much more than others. As long as you sometimes have one thing to say, your good. There were days when I would barely say one thing in class, but I guess I proved myself in other ways because I surprisingly got an A-. The final group project counted for a good amount. It was written and oral. I think it definitely helps your grade if you put the effort in. I definitely would recommend Perla because she's so amazing and reminded me of caring high-school teachers, which I don't think I'll find often around here. \ncons: A little disorganized, especially when it comes to what she assigned for homework and from what books. A little confusion on the final project in terms what she expected for the first draft, but it didn't affect anyone's grades. We almost had an in class essay, which would have been kind of hard, but luckily, we ran out of time in class and we never had to do it. She taught alot of material in the last handful of classes, including several new verb tenses. Most of the multiple choice on the final was about verb tenses. \nWorkload:\nDaily homework from 1-3 books(textbook and workbooks), 4 movies to watch out of class (all of which had english subtitles), 2 pg responses to these films(we get to rewrite EVERYTHING so it's great!), 2 short stories to read, Final group project, midterm(good) and final(fair)\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "November 11, 2009",
            "review_content": "\nI had a really easy and nice Spanish professor last semester, but didn't learn much so I thought I'd challenge myself by taking Perla's class. Boy was I WRONG. Not only am I still not learning anything, my grade is suffering as well.  Whatever you do, do not take this class. She is worse than any professor I even had in public high school in Los Angeles, and that's saying A LOT. \nYou will not learn Spanish because she goes so quickly, never speaks English (even when teaching a grammatical concept) and only goes over exercises and never actually teaches anything. She assigns an unreasonable amount of work.  She plays total favorites and expects us to know Spanish without actually teaching it.  She is a ridiculously hard grader, she will give you a B on a paper and after you make the corrections she suggests, only gives you a B+. \nWorkload:\nWAY TOO MUCH. she never checks it as in collects it, but she goes over it in class and if she calls on you and you don't have the answer, you're screwed. mostly in the main book, red work book and grammar book but she assigns some ridiculously long texts too. also an in-class essay, who does that?!\n"
        },
        {
            "course_name": "Spanish 3300",
            "review_date": "December 28, 2008",
            "review_content": "\nPerla is a great professor. She really helped me improve my Spanish (both speaking and writing). She is very patient and always takes time to make sure students understand the grammatical points. She is very pleasant as a professor and my only complaint is that she often interrupts her students as they speak. I understand that this is important when trying to learn a language, but I feel that she does it a bit too often. But the interrupting is something that should be overlooked because she is an amazing professor. If you want to truly learn Spanish and have fun while doing it take her class. \nWorkload:\n3 essays at least 4 pages each (only the second page counts), a final paper (same length as the others), no midterm/final, an oral presentation, and small readings for every week.\n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "December 22, 2008",
            "review_content": "\nPerla is an absolutely wonderful professor. She is warm, caring, and she always was willing to meet anytime to discuss anything whether or not it had anything to do with class. She was a really easy grader, and we were allowed to do two versions of every paper that then were combined for a final grade. She was really flexible about homework assignments, and she really understood that the way to fluency is through allowing everybody the chance to speak and discuss, and so she would gently guide our conversations by allowing each person a chance to talk and express herself. My Spanish improved immensely with Perla, and I have enjoyed continuing our conversations past the class itself into the new semester. She is also really involved in the Cuban-American community in New York and in the film community, and so always is promoting some events or film showing and always invites her students. She is a lot of fun, and I would definitely take her class again if given the chance!\nWorkload:\nNot too difficult: one longish reading a week, bi-weekly essays, a final essay/presentation project. Not challenging, and she's obviously really into it so you are too.\n"
        },
        {
            "course_name": "Spanish 3300",
            "review_date": "April 01, 2008",
            "review_content": "\nPerla is an absolutely lovely older lady who really wants to instill her students with a love of the Spanish language. She's an extremely easy grader, and only the second drafts of each essay count. Take her class if you want a low-pressure environment just to practice speaking, and to improve your Spanish.\nWorkload:\nSeveral papers, one longer research paper/presentation. Lots of reading, but it doesn't matter if you do it. Pretty chill.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 11, 2008",
            "review_content": "\nPerla was absolutely terrible--our whole class complained about her every single day.  She ran out of time and we ended up doing the last chapter in 2 days.  She is extremely disorganized, and she picks favorites (those who speak Spanish fluently already) and least-favorites.  She picked really hard on her least-favorites.  The kids just looked so sad after each class.\nI know she has a decent review, but if you are taking this class just to satisfy a requirement (as almost all of my entirely unhappy class was) find someone FUN!\nWorkload:\nChapter quizzes, daily exercises (she doesn't check), a movie to see out-of-class, a short story and a 100+ pg novella, 4 compositions (2 written in the last week of the semester), midterm, final\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 11, 2008",
            "review_content": "\nPerla was absolutely terrible--our whole class complained about her every single day.  She ran out of time and we ended up doing the last chapter in 2 days.  She is extremely disorganized, and she picks favorites (those who speak Spanish fluently already) and least-favorites.  She picked really hard on her least-favorites.  The kids just looked so sad after each class.\nI know she has a decent review, but if you are taking this class just to satisfy a requirement (as almost all of my entirely unhappy class was) find someone FUN!\nWorkload:\nChapter quizzes, daily exercises (she doesn't check), a movie to see out-of-class, a short story and a 100+ pg novella, 4 compositions (2 written in the last week of the semester), midterm, final\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 22, 2005",
            "review_content": "\nPerla was ok, she is certainly understanding and willing to work with the students. I found some of the exercises and readings in the class to be simply pointless. I mean, what El Coronel? That was the worst piece of crap ever.\nWorkload:\nNormal quizz after each chapter, midterm and final exam. \n"
        },
        {
            "course_name": "Advanced Expression and Style",
            "review_date": "February 28, 2005",
            "review_content": "\nPerla is one of the nicest, best profs ever. She's incredibly sweet, a good teacher who knows how to lead an interesting class. Advanced Exp. and Style is like university writing in spanish. You read lots of essays, discuss them in a way that will help you focus your own writing. There is a lot of writing....you have to keep a daily diary (but this is done in class). Perla really knows how to teach writing, however, and the class is really effective. It helps your writing in general because it helps you learn to think about writing more effectively. As a result, not only did my command of written spanish improve, but my writing in general did as well.\nWorkload:\nSeveral papers (~every 2 weeks or so), daily readings of essays/short stories, a oral project on a spanish-speaking country, 15 minutes daily writing in class about a variety of topics.\n"
        },
        {
            "course_name": "Spanish Intermediate II",
            "review_date": "February 28, 2005",
            "review_content": "\nThis class is awful if you actually want to learn Spanish. The professor prefaces the class by saying that she won't be speaking any English because our Spanish should be sufficient by this point to enable us to understand her, and then she spends the entire semester speaking to students as if they were Spanish 2-year olds. We rarely did anything but review book exercises in class, which made having a professor pretty superfluous. It's an easy class, but the longest hour and fifteen minutes of your life. The professor is almost sickeningly sweet and doesn't ask any real improvement from her students. \nWorkload:\nStandard for the department, a quiz for every chapter (every few weeks or so), three compositions and required revisions, lots of bookwork that's never collected. All easy. \n"
        },
        {
            "course_name": "Advanced Expression and Style",
            "review_date": "January 20, 2005",
            "review_content": "\nProf. Rozencvaig is great. She's accessible both in and out of class and the readings she provides are engaging and interesting. I found going to her office hours rewarding and my writing improved a great deal. However, if you have just taken the Spanish AP as I did, you are not necessarily qualified for the course- the writing workload is high and the standard far higher than most AP Spanish classes.\nWorkload:\nreading, papers, a few in class essays. \n"
        },
        {
            "course_name": "intermediate spanish",
            "review_date": "January 13, 2005",
            "review_content": "\nThe woman herself is precious and not a bad instructor, but I don't think I'll take another class from her.  Even though it was a small class she wasn't interested in individual students and moved pretty quickly.  If you've got a good handle on Spanish and a really strong vocabulary, this class is probably fine.  \n"
        },
        {
            "course_name": "Advanced Grammar and Composition",
            "review_date": "December 13, 2004",
            "review_content": "\nPerla is exactly her name: an absolute jewel . She has tremendous kindness, is patient with all her students, and has that rare ability to bring out the best in a student, no matter their level. She does, however, expect you to work, but working for a teacher as wonderful and engaging as Perla was never more pleasurable for me.  If you have a strong background in Spanish grammar, and you are passionate about / very interested in the Spanish speaking world, then this is the class for you.  You will have fun, your writing style will improve, and you will make a wonderful teacher/friend in the Spanish Department.  \nWorkload:\n4-5 writing assignments, plus in class essays, all of which are revisions, save for the last in-class and last paper. One informe oral (presentation) over a cultural/political topic of the student'si interest regarding Latin America/Spain\n"
        },
        {
            "course_name": "3200, 3250, 4900",
            "review_date": "December 10, 2004",
            "review_content": "\nTake any class you can with Senora.  She is not obsessed with grades like some of the other teachers, but rather she really wants to make sure that you improve as a student.  Everyone in my classes, with the exception of those who hate life, have loved Perla.\nWorkload:\nReading Short Stories and Essays.  Writing 4-8 papers including in-class writings depending on the course.  \n"
        },
        {
            "course_name": "Spanish Composition and Grammer",
            "review_date": "November 16, 2003",
            "review_content": "\nSra. Rozencvaig is kind, eager to help, and interested in what you have to say.  Her class is well-run but casual, and she never makes a student feel stupid or inadequate because of their language skills.  Grammer and Composition could be a nightmarish subject, but she incorporates other, broader topics to make it more interesting.  I recommend without reservations!\nWorkload:\nVery periodic short stories; nightly grammer worksheets; the occasional papers and in-class compositions, which are normally short.\n"
        },
        {
            "course_name": "Spanish 1202",
            "review_date": "January 19, 2003",
            "review_content": "\nA wonderful professor, she is patient and understanding with students whose Spanish is a little rusty.  A sweet Cuban lady, she dressed like a teenybopper and acts like a caring mother.  Encourages student participation and is fairly generous with her grading, allowing students to revise papers and retake tests for a best mark.  Class is not difficult and she makes it all the more easy.\nWorkload:\nLittle reading, biweekly quizzes, 4 very short papers, midterm and final (not difficult)\n"
        },
        {
            "course_name": "Advanced Grammar and Composition",
            "review_date": "January 29, 2002",
            "review_content": "\nPerla is great. she's a lovely, nice nice lady who will let you chat her up in office hours and is patient in class when you make mistakes. don't let the call number intimidate you. graduate students can register, but in my class there were also several people who had tested into the course or hadn't taken spanish for a few years who were good with grammar but not so great at speaking. you work on a combination of grammar and literature. the only thing is you spend too much time on literature for a grammar class, but also too much time on grammar for it to be a lit class. also, you never really learn how to develop each of the four styles of essays she coverse. overall however, the professor was excellent, and is a fair grader.\nWorkload:\nthe workload isn't actually that bad. in all there are four in class compositions and four at home compositions, each of which you have to rewrite, and each of which range from 2-3 pages (early on) to 3-4 pages (later on). if you have a pretty good grasp of spanish, these shouldnt'be a problem. however, she can tell when you have and haven't put effort into them. \n"
        },
        {
            "course_name": "Caribbean Identities",
            "review_date": "May 10, 2001",
            "review_content": "\nPerla is really very congenial and accomodating once she remembers your name, and once you start to talk...a lot. This course is about reading texts related to three Caribbean nations: Cuba, Puerto Rico, and the Dominican Republic. The reading load is considerable but doable and the workload, three short essays, one longer essay, and oral project in class are not too demanding if you do work consistently throughout semester. My advice: do the reading as much as possible and then say whatever you like about it, as long as it's not totally irrelevant. Do your best to talk all the time. She's willing to let you re-write things when you've done poorly, she's generous about extensions, easy to understand, and patient with those people who once knew Spanish but haven't had it in a year or two. Fair class, fair grader, (though i haven't gotten the final grade yet?!?!)... And as far as nice, knowledgable professors in the Spanish Department go, she's up there.\nWorkload:\nConsiderable amount of reading, varied genres. Three short essays 3-4 pages each, 1 longer essay 5-7, 1 in class presentation. \n"
        },
        {
            "course_name": "V1102 Elementary Spanish II, C1201 Intermediate Spanish I",
            "review_date": "December 31, 1999",
            "review_content": "\nA Cuban woman with German roots, Perla is at her best when covering culture and history. As a teacher of the language, she is good, thanks to her razor-sharp sense of humor. She runs a tight ship but the load is not that bad. Usual amounts of discussion and presentations.\nWorkload:\nregular mix of short papers and exams.\n"
        },
        {
            "course_name": "W4900 Advanced Expression and Style (in Spanish)",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you enter Columbia with lots of AP Spanish credits they may try to steer you into her 4900 class. This is a bad idea -- it's basically L&R; in Spanish. Doesn't cover much beyind basic grammar and not much attention given to developing writing style. Even worse: because of the high course number, many beginning Spanish Grad. students sign up for the course, which makes the grading that much tougher. Sign up for a Spanish Lit. class instead.\n"
        },
        {
            "course_name": "W4900 Advanced Expression and Style (in Spanish)",
            "review_date": "December 31, 1999",
            "review_content": "\nI took this class my first semester at Columbia, with AP credits, and loved it. We worked through various genres, poetry, short story, essay etc., receving a sample of each type of writing, reading and then discussing it, and then writing a piece in that style. We did grammatical exercises as necessary, but the exposure to various extremely interesting works in Spanish, and the chance to practice writing was wonderful. Class discussions were intimate and helpful to those (like me) who needed to practice their language skills. (Prof. Rozencvaig has the gift of waiting patiently while someone struggles for a word without making them feel stupid. If you still have trouble, she will gently offer a suggestion, but she'll wait while you finish your thought.) I have nothing against wanting to take a Spanish Lit course, but don't skip Perla Rozencvaig's class either. - You get to read the likes of Jorge Luis Borges, and Ana Lydia Vega, and you get practice writing and speaking as well. Generally, an excellent course.\n"
        },
        {
            "course_name": "Advanced Composition",
            "review_date": "December 31, 1999",
            "review_content": "\nThe class is challenging, but the teacher is magnificent. If you're having trouble or struggling a bit, she helps you as much as you'll let her. She is very concerned about her students' performance and it really shows. She is also very easy to speak to outside of class and she is very receptive and warm whenever you see her. A great teacher.\nWorkload:\nA lot of reading and writing, but certainly do-able.\n"
        }
    ]
}