{
    "prof_info": [
        {
            "prof_name": "Anthony Webster",
            "prof_id": 3815,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "November 11, 2014",
            "review_content": "\nI really like Webster: he's a great lecturer and person overall. He's very clear and extremely open to questions. My only real complaint is the textbook. \nHe makes you buy these pdf textbooks that he has made himself. They're awful. The outline often don't match lectures (as I realized only after the first midterm...), so you should go to lecture to find out what they SHOULD say. The material itself is really easy, so I thought I didn't have to go to class. Wrong. \nWebster is a better lecturer than he is a writer. Go to class. He clearly outlines what he thinks you should know (which excludes a surprising portion of his own textbook sometimes) and explains it better than he does in the textbook. He will actually discount his own textbook and say \"this is the easier way to think about it.\" Webster is the best resource in this class. So just show up to 8:40 lecture. It's worth it. \n\nWorkload:\nHomework - 15%* \nA note about homework: DO NOT TURN IT IN LATE. If you can turn it in online, that would be best. I once turned in the homework after walking in a minute late; I didn't think he would notice. He did. I was penalized 25%. Just to be safe, turn in your homework online. \nExam I - 20% / 30%**\nExam II - 20% / 30%**\nFinal - 30%\nClass Participation - 5% (I'm not sure how he even determines grades for this...)\n\n* Lowest homework score is dropped.\n**Best exam counts for 30%.\n"
        },
        {
            "course_name": "Real Estate Finance/Construction Mgmt",
            "review_date": "April 28, 2014",
            "review_content": "\nProfessor Webster brings many years of experience into the classroom both as a civil engineer and finance professional. The course is designed to expand students' knowledge of finance by focusing on the public and private real estate sectors (mostly U.S.) from a variety of perspectives: investors and taxpayers, architects and engineers, developers, etc.\nIn addition, the course is structured to help you strengthen your accounting and finance knowledge and and to help you dive into a variety of case studies and real-world scenarios that help you understand both project and financial incentives.\nOverall, the class is well-organized (i.e. clear, well-delivered lectures) and provides a wonderful opportunity to learn more about real estate industry characteristics, investment opportunities, and more. The class is mostly geared to graduate students, but it welcomes undergraduate students which creates a great environment to learn from seasoned engineers and architects.\nWorkload:\nHomework: 20% \n(Straightforward and practical)\nMidterm exam: 25%\n(Take home, Excel focused)\nProject: 25%\n(Get to search for your own property which you would intend on purchasing and then flipping or rebuilding)\nFinal exam: 25%\n(Excel focused, Emphasis on financial models)\nClass participation: 5%\n"
        },
        {
            "course_name": "Decision Model and Applications",
            "review_date": "January 24, 2014",
            "review_content": "\nThis class is a lot like IEORE4004: Deterministic Models, but more focused in scale on optimization. The material is presented very well and the class as a whole is well structured. There is a methodical flow to the material that is presented and a smooth transition between the lecture to the homework assignments. Some lectures are dry while others are very interesting. Prof. Webster does a good job of breaking down the thought process behind why certain companies make certain choices hence the name of the course. He is also approachable and entertaining.\nThe projects and skills learned in this course are very useful down the road. I was able to use the mean-variance portfolio project and crystal ball simulation skills to do the final project of another course. I highly recommend taking this course if only to learn how to use high-powered software to make optimization and simulation models easier.\nThe coursework is not easy. There is an entire lecture dedicated to presentation preparation and it factors a lot into your midterm grade. Don't expect to give MBA levels of buzzword spouting, but be sure to be concise and thorough in your presentations. This is the most challenging and important part of the entire class. It will make your presentation creation and delivery all that much better in the future. The grading is lenient as well, but there's no room for hand-waviness as every assignment has an attached grade used to calculate the final letter. Participation is important but will factor in only 5% of your grade so make sure that you check your work.\nThe projects are done in a group format and they will take a lot of time. You get to select your topic and the groups are chosen in class so don't worry about being left out to dry. In the semester I took, we weren't able to do the final presentation, so your slide content and additional spreadsheets are that much more important.\nThe final exam was supposed to be in class for 3 hours, but Prof couldn't attend so he let us do it take-home style and submit it online. This isn't necessarily a good thing. He gives you 24 hours to complete it; I took 18 out of those 24 hours to complete it. Make sure you are very organized and save every thing you are given (notes, handouts, etc.) and everything you do (homeworks, projects, etc.) in a folder for quick reference.\nThe textbook itself is not so great as it's missing a lot of content that you need to fill-in during lecture. It's too expensive.\nWorkload:\n~10 Homeworks (25%)\n2 Projects (50% at 25% each)\n1 Final Exam (20%)\nParticipation (5%)\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "January 02, 2013",
            "review_content": "\nWebster overall is a great professor. His classbook is clear (no need to buy anything other than that). He is a nice guy, and you learn the basics of accounting. I personally really enjoyed the class, and the examples he uses are interesting. \nIt is kind of important to get the answers to the example problems he gives. The class average is super high, and it feels like a lot of calculator work at times on the exams. Cheatsheets of one page, both sides, are allowed. It seems like the key to doing well in the class is not making stupid mistakes. \nWebster is fairly generous with A+s, with 11% of my 106 person class ending up with an A+. \n~22% As\n~7% A-s\nno B+s \n23% B's\n17% B-'s\n~14% C's\nExtra credit is supposedly not actually extra credit. It's supposed to help bump you up a grade or something. Not exactly sure...\nWorkload:\nHomework                      15%*\nExam I                             15% / 35%**\nExam II                           15% / 35%**\nFinal                                30%\nClass Participation          5%\n \n* Lowest homework score is dropped.\n**Best exam counts for 35%.\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "May 18, 2011",
            "review_content": "\nThis class basically covers two parts, Accounting and Finance. \nIn the first six weeks or so, we learnt accounting and preparing the four kinds of accounting statements.\nIn the rest of the semester, we covered finance, including ratio analysis, risk etc.\nThe class was probably the best class I've taken at Columbia so far. Webster is a great lecturer, and truly wants to ensure that everyone understands the material.\nWe go over real world examples in class, and the tests are very similar to the in-class examples.\nWebster also tries to keep the class entertaining as far as possible, and is always open to answering questions. [See his quotes]\nAlso, worth noting that the final is non cumulative, and cheat sheets are allowed to every test.\n\nWorkload:\n2 Midterms (Better worth 30%, other worth 20%)\n1 Final (Worth 30%)\nAbout 8 Problem sets throughout the semester, graded on a scale of 3. Very easy to get a 3 in each. (Worth 15%)\nOther 5% is for completing the evaluations.\n\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "June 24, 2009",
            "review_content": "\nThis class is required for IEOR students, but all students who are interested in Finance and want to learn more should take this class. As the previous poster said, Webster really tries to make sure that every student understands the material. He also truly wants to make sure that everyone does well and has a good grade, even going so far as to inquire what the curve is in other engineering classes.\nWebster comes from an engineering background himself and has an MBA from Columbia Business School. He also has experience writing on and using the materials and methods he teaches. He intertwines the research he conducts at his asset management firm with the material in class; balance sheets and financial ratio analysis are taken from real companies he researched and invested in. \nAt the height of the credit crunch in September 2008, Webster would often take entire lectures to go over certain aspects of the financial crisis, including securitization as well as risk aversion to lending. These proved very insightful and interesting, for the students who could make it to his 9:10 class.\nThis was the most interesting and insightful class that I have taken at Columbia thus far. The material is not difficult and Webster is not out to trick you on the tests. However, the class does move very quickly through the material. Before you know it, you will have learned the basics of generating the 4 types of financial statements. \nAnd remember, the balance sheet is a snapshot of a business at one time on a particular day/hour/minute. Income statements, cash flow statements, and statements of owner's equity are flow statements that capture the change in a business in a given period of time, usually a quarter. \nWorkload:\n- 7 Homework Assignments graded out of 3 points. (Very easy to get a 3). Essentially copies examples done in class.\n- 1st midterm was very easy\n- 2nd midterm was in general difficult for the class but very manageable and pretty easy\n- Non-cumulative Final was very easy\n- Extra Credit homework at the end that helps prepare you for the Final and also replaces a homework grade if the Extra Credit homework is a higher score\n"
        },
        {
            "course_name": "Introduction to Accounting and Finance",
            "review_date": "May 16, 2009",
            "review_content": "\nWebster is such a sweet man. He genuinely wants everyone to understand accounting and do well in the class. He's really good at explaining things, and teaches you what you need to know. I also loved how he related everything to current events on wall street. it made the class so much better and interesting. So glad I took it with him, and not with the previous teacher of this class! \nThe only thing I felt bad about is that it was obvious he made the final easy as possible to make everyone feel better after the second midterm, which wasn't even hard...everyone kind of complained way too much to him about the second midterm which wasn't even THAT bad! \nWorkload:\nabout 4-5 homework assignments the whole semester. all really easy...just pay attention in class. first midterm was SOO easy. second one wasn't hard, but just really time consuming and hence a low average. Non-cumulative final that was also easy.  \n"
        }
    ]
}