{
    "prof_info": [
        {
            "prof_name": "Elizabeth Cottrell",
            "prof_id": 2207,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "July 04, 2005",
            "review_content": "\nLiz is a true gem. She's intelligent, dedicated, witty and totally down-to-earth. Overall, I was not a fan of Frontiers of Science. I think the principle is important. Not enough people care about major issues facing the planet/our civilization. So, hopefully, there are a few people who, having been forced through the class, decide that they have found their calling. I'm not one of those people, but Liz made me into a concerned bystander. I'll definitely donate money to groups who are fighting global warming someday (if I have the money to do so). \nAnyway, Liz pratically runs the whole department. Her study guides and exercize sheets circulate the department like crazy. She takes the material to the next level. If you have Liz, you WILL do well on the final. She prepares you so well for it. She's tough, but it pays off. You definitely have to work hard to do well in her class...which I'll admit, was frustrating at times, especially when I saw my friends doing next-to-nothing and still getting A's. But, if you do work hard, you'll be rewarded.\nAs for the person who complained that she won't let you cheat...ummm...need I even address that complaint? And, yes, she does teach you how to use graphs, but usually that was part of the required departmental hit-list of things that had to be done during discussion sections. If the class caught the gist, she would move rapidly and get into the more interesting stuff. If not, she spent more time on it. Totally reasonable. \nIf you have to take this class, and most of you will have to, YOU WANT LIZ. \nWorkload:\nTypical Frontiers stuff. Weekly discussion questions. 4 Problem Sets. 2 Field Experiments. Final Exam. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 17, 2005",
            "review_content": "\nAside from the fact that this course is a waste of time and should be immediately removed from the Core Curriculum, there is plenty to complain about here.\nMost people absolutely love Liz. I don't know exactly why. Most of my class came to a consensus that she's completely self-righteous, arrogant, and awkward. Though she's incredibly energetic and teaches with passion -- this much I can't take away from her -- she also has a knack for thinking her students are downright stupid. She assumes that her students don't know if the earth revolves around the sun or vice versa, that they don't know how to read bar graphs or histograms, that they don't know what axes on a graph are like, etc. \netc. Most of the class is spent on learning to read graphs -- now, I have a sibling who I watched learn the same material when she was in the third grade. \nA warning about Liz: if she has even the slightest doubt that you've cheated on anything -- and I'm talking any miniscule doubt -- she will be the first person to take it to the administration and make your life hell. She sticks to every rule and gives no leeway. She is particularly adamant about absences and tardies, but don't mess with her on any level because she will go out of her way to screw you over. Otherwise, have fun!\nWorkload:\nweekly discussion questions, 4 problem sets (best 3 are counted 10% each), no midterm, a final, some readings, stupid stuff.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 09, 2005",
            "review_content": "\nLiz was very sweet and fun and enthusiastic but her explanations often created more confusion than they dispelled.  Each week I left her discussion section feeling like I understood the material even less than I had before the section.  She WAS often available outside of class sessions, and was very quick to respond to her emails but her teaching style veered between explaining simple ideas in a complicated way and breezing over complex ideas with an  \"of course you should know this already\" brevity.\nLiz was very fun and informative on the class trip, but as a lecturer tended to make my head want to explode.  I eventually got tired of saying \"I don't understand\" and just sat quietly, wishing the pain of frontiers of science would finally end.\nWorkload:\n4 coursepacks, weekly questions on reading, brutal final exam.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 07, 2005",
            "review_content": "\nLiz was the only reason I enjoyed this class.  She was throughly knowledgable, and if she wasn't clear on a subject she researched it so that we could better understand it.  She was very enthusiastic and fun, and really wanted to get us engaged and interested in the material.  She was understanding about the workload and often cut down the amount of busywork we had.  She often modified assignments to make them more participatory.\nWorkload:\nweekly readings and discussion questions, problem sets every three weeks, no midterm, final.  two presentations exclusive to Liz's sections (not in the others)\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 08, 2004",
            "review_content": "\nLiz is AMAZING!!!  she is definately the reason that this class was worthwhile at all.  She is EXTREMELY enthusiastic and passionate about all the topics presented in class and helps you understand them by applying them to real life.  She is also extremely dedicated to this course.  She is friendly and very approachable with any questions or concerns about the class.  She loves to change the course-wide assignments so assignments that cover what she feels is important.  A lot of the assignments she makes up are very fun an interactive.  She is very intelligent and knows her sh*t.  She is very helpful in office hours with answering questions about the weekly assignments or the problem sets.  During our field experiments I had the chance to see other section leaders in action and i completely understand why a lot of my friends HATED this course.  I am sure that Liz is by far the best section leader in Frontiers and you would be very very lucky to have her.   The lectures can get pretty boring but if you have Liz you will really appreciate what they are trying to do with this course.  She is seriously a goddess.\nWorkload:\nDiscussion questions after every lecture that need to be posted online day before the section meets (with a good amount of reading for each), 4 problem sets (1 for each unit), No Midterm, Final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 13, 2004",
            "review_content": "\nI would have to say my best teacher this semester and a great year to start off my first year at Columbia.  She is one of the most enthusiastic teacher I've ever had and loves all the material she covers.  She takes the time to explain concepts she feels are important and tries really hard to get us interested by creating powerpoint slideshows and even making a few hands on experiments that make it easier to understand the concepts.  She is a very accessible teacher and is nice and organized.  Her office hours are very helpful and she's prompt about answering emails.  She even gives progress reports, a rare plus among college professors.  Be sure to pick Cottrell if you're looking for a very passionate, organized, and overall, just awesome Frontiers of Science professor.\nWorkload:\nShe is quite reasonable and cuts down the coursepacks if she feels they are unnecessary.  Be sure to start the problem sets in advance so you can see her during her office hours.\n"
        }
    ]
}