{
    "prof_info": [
        {
            "prof_name": "Marcel Agueros",
            "prof_id": 10161,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 Earth, Moon, and Planets; Beyond the Solar System",
            "review_date": "May 05, 2015",
            "review_content": "\nI came into this class with a lot of doubts. I was taking it to fulfill my quantitative requirement at Barnard, and was very worried about the amount of mathematics and physics was going to be in the class. To my relief, there was barely any of either, and I absolutely adored the class.\nProfessor Agueros knows exactly what he is talking about, and his lectures are interesting and engaging. He encourages questions and comments, and always replies to the best of his ability. He also makes people write questions on slips of paper before they leave class everyday, and starts the following class by reviewing the previous lecture and answering some of the questions he got. \nProfessor Agueros is very approachable and happy to help, and just wants his students to come away from the class with a basic knowledge of astronomy. He grades harshly but fairly, and arranges for some cool lessons (such as a visit to the rare manuscripts portion of Butler to see first editions of Galileo, Copernicus, and Newton). The work load is not that bad, with seven homework assignments over the course of the semester, and a midterm as well as a final.\nI would recommend this class to people who are bad at math and trying to fulfill their quantitative requirement, as well as anybody who was every interested in the solar system when they were kids. I very much enjoyed myself.\nWorkload:\nNot that heavy: seven homework assignments, midterm, and final\n"
        },
        {
            "course_name": "Modern Stellar Astrophysics",
            "review_date": "January 08, 2015",
            "review_content": "\nThis was one of the coolest classes I've ever taken, and Professor Agueros was the perfect fit. Because of the low number of people taking the course, he replaced the midterm and final this semester with a midterm presentation (on really cool astrophysics topics like gamma ray bursts and Type Ia supernovae) and an oral final (everyone studied the same paper for this final, which was about the effects of mass loss on the evolution of high-mass stars). Both were pretty enjoyable to study for and they were DEFINITELY preferable to taking a legit midterm or final. He did end up asking some difficult questions on the spot, but he'd always try, at least, to point you towards the answer.\nThe lectures were always interesting. I slept less in this class than I have in any other class, which says a lot. Professor Agueros had a lot of really neat Powerpoints, he'd always derive the equations (but wouldn't take a crazy long time with derivations), he always spent the right amount of time between the powerpoint and the board, and - this is, to me, the best thing - he ALWAYS made sure to emphasize exactly why what he was talking about was important. Always. It was really, really refreshing to experience a professor do this, especially in a class where some of the math can get away from the physical meaning. We'd always have to think about the results we got in a larger context (i.e. \"What does this mean for the star?\")\nThe problem sets were, to be quite honest, pretty tough. But at the same time, they were the kind of \"tough\" wherein you see the problem and know you have all the tools to solve it - it's just a matter of thinking through it and figuring it out. Weirdly, I think I would've enjoyed more homework in this class, because there were always really cool applications of concepts in class that you'd never think of. But at the same time, having only four PSets was a blessing.\nFinally, Professor Agueros made a pretty conscious effort to introduce guest speakers, fringe topics, and scientific computing to the class. A lot of problem sets had a computational component, in which we had to compute some stellar models and answer questions about them. It was very different than what we were used to, but you could tell that he was trying to form the same habits that he and all the guest lecturers already had. The guest lecturers were always relevant to what we were discussing and they too were vulnerable to being asked difficult questions by Professor Agueros on the spot, which was (sadistically) kind of fun to watch.\nOverall, this was a GREAT class - if you're really interested in astronomy and stars, I would definitely recommend you take it.\nWorkload:\nFour problem sets - difficult, but do-able. Midterm presentation - fun, and graded pretty nicely. Oral final - slightly less difficult than the PSets, but with the added bonus of having Marcel help you towards an answer every 20 seconds. All in all, not bad at all.\n"
        },
        {
            "course_name": "Introduction to Astronomy I",
            "review_date": "December 22, 2012",
            "review_content": "\nDO NOT TAKE THIS MAN!!! The comments below are wayy too forgiving. The avg. grade in this class was a 60. Yes he curved, but he was not specific on how he was going to curve, so he kept you wondering throughout the semester. As one student put it, he's like a TA gone wild! His exams, quizzes and homework assignments are ALL written in abstract form and they are ALL trick questions. Some of the questions didn't even have the right answer as an option. My GPA is a 3.9. I am not a lazy student looking to rip on some professor because he gave me a bad grade. This guy is just impossible and will give you an unbearable workload that will stress you out BIG TIME! He is a Harvard graduate and he definitely lets you know it! He comes off all cool and easygoing and then 1/2 way through the semester he has you crying. Don't fall for it. Stay away. Take Bio or something. This astronomy course is not easy, fun, or fulfilling.  \nWorkload:\nHeavy. \n"
        },
        {
            "course_name": "C1403-C1404 Earth, Moon, and Planets; Beyond the Solar System",
            "review_date": "December 30, 2010",
            "review_content": "\nI came into this class just looking for an easy A/a way to get out of the science requirement. I shouldn't have taken this class.\nThough it certainly isn't the toughest course in the world, it's NOT easy. The first couple of quizzes were impossibly difficult; they asked you to apply concepts that we went over in class. BUT some of the concepts were just briefly mentioned in class. Also, the way you were supposed to apply the concepts was impossibly hard. \nI ended up getting an A in the class, but that was only because I studied REALLY hard for the quizzes/midterm/final after i realized how difficult he was making them. That said, he definitely eased up on the quizzes. By the end, the testing reflected the extent to which you read the book/paid attention in lecture.\nThe four assignments were REALLY stupid. We had to write poetry analyses of poems about stars. SERIOUSLY! And he actually went through and graded our analyses. We also had to write a 6-8 page research paper. They were easy but time-consuming and pointless. And h he actually grades them (even though there were probably sixty people in the class... I always thought his level of dedication to the class was almost odd, though it was refreshing in some ways).\nThe positive aspect of the class is that it's not SUPER difficult (like bio, chem, ect.) yet you still learn a bit. He's genuinely interested in conveying the material well and by the end I think he succeeded in that way. I think it was his first time teaching the class and he was definitely looking to improve, so I imagine that the class will be run better next time. Take it for the science requirement if you don't mind putting in a bit of work and if you don't want to be too bored in a complete joke of a science class (the way that I hear oceanography is).\nWorkload:\nreading, quizzes, midterm, final\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 27, 2010",
            "review_content": "\nI took this course due to a recommendation from a friend, and ended up regretting it. \nThe sad part about this is that Professor Agueros seemed to be a really nice guy with a genuine interest in improving his class and soliciting feedback and also making lectures entertaining enough to come to.\nUnfortunately, he seemed to falter a little bit in the actual content of the class. We meandered for almost three classes on the meanings of 2012, which was momentarily interesting-- but also seemed like a colossal waste of time. In addition, we focused with great specificity on seemingly random things. Rather than coming away from this course with a good general knowledge of Astronomy, I feel like I now am in possession of a semester's worth of Snapple Facts. Often, you were better off reading the book and not showing up. \nThe quizzes are also surprisingly hard to do well on-- primarily due to random point deductions. Both the quizzes and the homework suffer from a humanities-melded-with-astronomy ethos, which I really didn't feel was successful. Usually, you would get points off for not mentioning something a question didn't ask for or failing to understand a  subtle trick within the question. \nThere was almost no quantitative reasoning in this class, every quiz usually had 1 problem that involved numbers. To his credit, the final was very straightforward. \nWorkload:\n3 Homework assignments (6 pg papers), 4 quizzes, 1 midterm, 1 final. \n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 25, 2010",
            "review_content": "\nI agree with the reviewer below. Professor Agueros really cares about astronomy and therefore kept the course engaging and interesting. I was taking this class to fulfil the QUA requirement and never thought astronomy would interest me; after this class, I am definitely considering taking another astro course (but I'm not sure many other professors could make it as funny and interesting as Prof. Agueros did!). I certainly laughed a lot in his class, but as the person below said, ended up learning quite a bit in the end. \nIn terms of the class itself, the topics covered are just enough to give you a good understanding of the universe, physics, and ratios/scales. Anyone can understand it if you pay attention. Yes, the quizes can sometimes throw you for a loop because he expects you not only to know the material from the text and lectures but also how to apply them in other ways--taking the formulas and laws and using them to explain astronomical happenings in your own words, essentially. \nOverall, great class and professor! (and not that much math, for people wanting to take this to fulfil Barnard's QUA!)\nWorkload:\n3 homework assignments (1 essay and 2 short research-ish projects about astronomical misconceptions and a topic of our choosing), 4 quizes, a midterm and a final. Reading was not too heavy and we had plenty of warning before anything was due. LOTS of extra credit opportunities (AMNH lecture write-ups, calculating position of moon in sky, etc.) Not bad at all.\n"
        },
        {
            "course_name": "Earth, Moon, and Planets",
            "review_date": "December 21, 2010",
            "review_content": "\nMarcel is a great professor, his lectures are super funny and are always enjoyable to go to, I highly recommend him if you actually want to learn about astronomy. He seems very interested in 2012 and the end of the world. There are only 4 homework assignments which are pretty easy. His quizzes are pretty tough if you don't go to lectures or study. You need to read everything from the book. The midterm and final were quite easy as long you put the work in to study. He is a really nice guy and he is always available to answer questions, and his sense of humor is great. This class isn't easy, but at the end of the course you actually feel like you learned something useful. \nWorkload:\nNot a lot, just study for the quizzes which are hard. \n"
        }
    ]
}