{
    "prof_info": [
        {
            "prof_name": "Anke Birkenmaier",
            "prof_id": 2369,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 04, 2009",
            "review_content": "\nLit Hum with Spanish texts.  It's a lot of reading, class participation is expected; however, Anke doesn't really command the class.  She's nice, but she's interminably boring.  She is a pretty darn easy grader, but I might look for another way to learn about this material/take care of major cultures - twice a week for two hours is not something I would every do again.\nIt's boring, the reading is pretty terrible, but the grading is easy.  Depends on what you're looking for out of the class - if you just want an A, go for it.  If you want an A and not to have to perform a lobotomy on yourself, take Latin American Civ or something.\nWorkload:\nLOTS of really, really dry reading.  A few response papers.  Midterm and final for which she gives you the terms (SO EASY)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 15, 2005",
            "review_content": "\nProf. Birkenmaier is a very sweet person.  She tried to provide good background information (although admittedly sometimes her love of languages was a little too clear, given how many Greek terms we had to know for our first midterm).  She also tried to incorporate different activities during the class time.  If you have her, I'd highly recommend going to her office hours -- she's open to discussing disagreements over grades.  \nOne thing I did notice was that she really improved during the second semester, which means she must have taken our feedback at the end of the first semester seriously.  I think that this is a pretty good sign.  \nI do think that the class discussions weren't exactly riveting, and though that could be due in part to her lack of incredibly inspiring topics, it's also probably due to the fact that we met at 9 am when most of us were barely awake.  I think that more could be found to discuss in the books, and she isn't necessarily the best professor for this topic.  I think it would be worthwhile to take one of her language classes, because I think she's much more passionate about those (for example, we spent four classes on Don Quixote -- the most time on any one book).  \nAs far as grading goes, she is very fair.  Many people in the class felt she was an easy grader: I think once you figure out what style she looks for in your papers, it's not hard to get an A.  \nWorkload:\nFirst semester: 4 papers (two 2 page ones, two longer ones), midterm, final.  Second semester: 2 papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nThis teacher is very kind and really I grew to like her, as did others in the class, primarily in one on one sessions during office hours. However, as a Lit Hum professor she is not suitable. Discussions were more or less non-existant and grading was very easy, to the point that the class was even more boring than necessary. I happen to be one of those people at Columbia who expect to get something out of these CORE classes and frankly Ms. Birkenmaier was not a very engaging teacher. If, on the other hand, you want an easy class to sleep through, she is your lady.\nWorkload:\nthree or four 2-4 page papers - I found her grading to be easy, others it seems struggled more.\n"
        }
    ]
}