{
    "prof_info": [
        {
            "prof_name": "Valentine  Daniel",
            "prof_id": 456,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "October 16, 2013",
            "review_content": "\nAll the reviews below are true: EVD is quite possibly the kindest, most caring man you will ever meet, but he is not structured one bit. He is incredibly smart, to the point where he gets so excited about sharing his knowledge, that he gets too far ahead of himself and loses you in all of these intellectual thoughts. No matter- as long as you do the readings and go to his office for help, you will do fine. He is more than happy to meet with you around YOUR schedule (he once made time to meet me at 10 pm!), and to explain things as slowly as you need. No one is every stupid or too dumb for him; he will break down every view and thought into the smallest of chunks if necessary. \nTo reiterate a few points below: if you like order and structure, get out now. If you like a little humor and chaos, and want a professor that cares about you, then take this class. You will not forget him.\nWorkload:\nTake home midterm and finals; three of five 1-6 page papers over the course of the semester\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 30, 2013",
            "review_content": "\nVal is one of the smartest and nicest people I have ever met. While he can occasionally be confusing in his approach to explaining certain texts, his knowledge of all of them is very thorough, just pay close attention. He is an amazing professor and an even greater person. Some people may complain that he can get tangential, which is true, but each of his tangents has a clear purpose and does relate directly to a point that he is trying to make. Additionally, while the paper time limits (a weekend) can be tight, if you have done appropriate reading they will all make sense and are manageable. He is also flexible with accommodating everyones schedule so that you wont be swamped. If anything is unclear he will always make time to meet with you out of class to help...just make sure you make the appointments in person because he is not the best with e-mails. Above all else, he cares that all his students learn the material - he will make all accommodations necessary for each individual who wants to learn. He is one of the best people I have ever met. I will always remember him and his class.\nWorkload:\n3 out of 5 take home papers, midterm and final. All highly manageable if youve done the reading.\n"
        },
        {
            "course_name": "Semiotic Anthropology",
            "review_date": "January 16, 2013",
            "review_content": "\nVal is a phenomenal teacher and a lovely human being, and I have learned more from him than any other professor at Columbia.  He is brilliant, funny and genuinely committed to provoking the intellectual curiosity of his students.  This course altered not only my academic thinking but my way of thinking about pretty much everything in my daily life.\nHowever, if careening miles off the syllabus the second week of class, total chaos in the communication of assignments and rambling lectures with no clear subject make you nervous, he's not your guy.  If you need to know what to expect from a course, like to know what the reading for every week will be and get things graded in a timely fashion, you will not like Val, I imagine, for any course.  I don't say that derogatorily, he's just a peculiar guy who isn't the right fit for folks who need structure to learn at their best.  For those who enjoy a little chaos, however, he's unforgettable.\n[I am a grad student which I hope is cool w/r/t posting on this site]\nWorkload:\nmoderate amount of readings, but most incredibly dense; weekly responses; final paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "July 13, 2012",
            "review_content": "\nVal Daniel (EVD) is an acquired taste, and it takes time to get used to him.  Expect your tests and essays to be misplaced at some point during the semester. Don't be surprised if your class syllabus is revised two, three, or maybe four times, causing Val to schedule \"optional\" Friday and/or Sunday CC classes that are frequently canceled. Despite my initial reservations, I stuck with Val CC section and as the year progressed, he grew on me. I have come to regard EVD's CC class as one of the best classes I have ever taken. As previous reviewers pointed out, he's hysterical, wacky, and one of the most entertaining professors I have ever had. I highly recommend his section. \nDespite his absentmindedness, Val has a remarkably profound understanding of the CC texts; a considerable amount of effort is required on your part to appreciate the philosophical arguments that Val tries to bring to light; many of them are very abstract and esoteric. While Val's CC section comes off as an unconventional and easygoing one (and it, more or less, is easygoing in the sense that he doesn't enforce the \"mandatory\" discussion board posts, makes all tests take-home, and is lenient with deadlines, which he himself mixes up), this does not mean that you can ace the class without a decent effort. This is NOT the class that you can get away with pseudo-philosophical bullshit during class discussions and on your essays. Val will challenge you, pose brain-twisting questions, and ultimately make you realize the fallacies in your arguments if you choose to bullshit; this class is not a joke. Val takes many liberties with the standard CC curriculum, but he does so to make it a legitimate philosophy class. \nVal's CC section isn't for everyone, and it seems that you either love him or you hate him. His class is not necessarily an easy A -- especially during the second semester (when he steps up his game). Contrary to common perception, Val's so-called \"tangents\" aren't entirely tangential, for most of them turn out to be quite relevant to the CC readings; their abstruseness seems to obstruct their relevance. Especially during the second semester, it was not uncommon to find the philosophical ideas underlying Val's \"tangents\" to appear in his essay prompts, and as unintelligible they may seem at first, you will eventually realize that you have no choice but to confront, dissect, understand, and critique them. This requires a lot of effort and creativity on your part, and the process of doing so forces you to engage the CC texts very closely and think abstractly about philosophy. \nVal is very approachable and helpful during his office hours, and he will do everything he can to help you. He reads everyone's papers carefully (he has supposedly pulled all-nighters to grade CC papers) and scrutinizes your arguments.  Expect 1,000-2,000-word typed-up commentaries (on average) in response to your papers. (Sometimes, his commentaries are longer than the papers that he is grading. A friend of mine once got a 3,000-word commentary on her 2,500-word paper.)\nVal may come off as absent-minded and kind of \"out there\", but he takes CC seriously. He puts a ton of effort into the class and is willing to put a lot of effort into making each and every one of his students develop a deep understanding of the CC texts. If you make the effort and meet him halfway, his CC section has the potential to be a mind-blowing and intellectually satisfying class. \nWorkload:\nThe regular workload is light. When it comes to papers and tests, it's a whole different story: 4-5 papers each semester (pick 2-3 of them to write). 24-hour take home midterm (2-3 essays, each 3,000-5,000 words, painful). 24-hour take home final (2-3 essays, each 3,000-5,000 words, painful). The prompts are tough and my midterms and finals were 10-15 pages long. If you pay attention in class, do the readings, and go to Val's office hours for help, an A is totally manageable. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 23, 2011",
            "review_content": "\nI'm somewhat confused at how taking CC with Valentine-Daniel is an \"experience of a lifetime,\" unless your idea of an experience of a lifetime is getting harsh grades handed back a month after you submit what is being graded with extremely long rantings that practically double your original essay in length, waiting 15 minutes for your professor to show up to class and then scheduling extra classes on Sundays because you \"don't have enough time to finish,\" or discussing dharma and the Indian caste system as opposed to Aristotle and Plato and then getting tackled in your essays when you don't write about a specific concept that was not mentioned in any sort of discussion or lecture.\nWhile I can understand that Valentine-Daniel has his quirks, if your concern is (as I imagine most people's would be) having an enjoyable experience and getting rewarded for the work you do, then this probably isn't for you. Unless you're a hyper-philosopher and a brown-noser, it's doubtful that you'll escape with a B+ or higher. There is no ambition to do the readings, as an hour is usually spent by him lecturing on indecipherable topics and another hour is spent as a dialogue between himself and one loud-mouthed student on some impossible to grapple (and usually irrelevant) topic such as \"moral reason.\" \nAlso, he didn't cancel class on the Wednesday before Thanksgiving, despite the fact that it got out at 4:00 PM. So, there's that.\nI highly recommend taking another section that inspires you to do the readings and doesn't leave you falling asleep every class. While EVD can be a funny guy, I really don't think a joke or two per class is worth an overall negative experience.\nWorkload:\n5 assignments, 4 of which are graded (usually given on Thursday and due Sunday, just to ruin your weekend); a 24-hour take-home midterm and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "October 13, 2010",
            "review_content": "\nE. Valentine Daniel (he may reveal his first name to you at the end of the semester, if you're lucky) is more than just a professor, he is an experience. He is not only incredibly brilliant and insightful, but frequently had our class in hysterical laughter over his hilarious anecdotes from his field work. \nProfessor Daniel is the consummate absent-minded professor in the most entertaining of ways. He once e-mailed our class to tell us that we should come an hour late because he had all our papers on a flash drive in his pocket, but when walking around campus he \"reached into his pocked and found only a hole\" and so would be scouring the grounds trying to find the flash drive. What he didn't realize in sending this e-mail was that it was a holiday and we didn't have class anyway. \nProfessor Daniel was lenient about deadlines and clearly cares much more about his students' well-being than he does about having everything in on time--after e-mailing him asking for a slight extension, he advised me to just make sure I got enough sleep and not worry too much about when I turned the paper in. He took a long time getting papers back to us, but this was largely because he returned our papers with huge amounts of thoughtful comments. It's true that he occasionally would lose our grades and ask us to remind him what he gave us on particular assignments, but I never found this particularly problematic.\nHe also is extremely welcoming in office hours and is happy to have students stop by to talk. Definitely one of my favorite professors and most enjoyable classes at Columbia.\n\nWorkload:\nStandard for CC, three papers, out of which you choose two, take-home finals and mid term that you get 24 hours to do (you get choices of start times). Online discussion posts that you really don't have to do.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 03, 2010",
            "review_content": "\nProfessor Daniel is a misleading teacher.  I had him for both semesters of CC.  For the first semester, he graded everyone wrong.  He thought that a 3.0 correlated to a C.  Luckily enough students complained that he had to change every grade.\nFor the second semester, he was even worse.  The way class was 'supposed' to happen, Mondays would be lecturing, the class would post questions Tuesday, and discussion would happen on Wednesday.  What actually would happen was that he would talk about India all the time, and occasionally make an offensive comment.  \nWhenever you hand in an paper or a test, anywhere from a week to a month later, he will ask if you actually handed it in, even if you asked him if he got it the day after you send it in.  Then possibly a month later he will ask you again.  \nOccasionally he would give me 'no grade' and ask me to correct.  When he finally gave me a grade, it was a B+.  \nDaniel is very good one on one, but otherwise is a pretty bad teacher.  You can do at least an upper B without reading and just using wikipedia.\nWorkload:\n2 out of 3 papers, and 2 take home exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2009",
            "review_content": "\nIf there is any chance of taking CC under Daniel, do it.  It is an opportunity of a lifetime.  Daniel is a kind and caring professor.  Always available, incredibly generous with his time and extremely helpful. He may not be the kind of dynamic public speaker  one meets ever so rarely (how many of them are there anyway), but he is the best teacher I have had so far in Columbia.  He doesn't lecture at you, he teaches you.    At first I thought that his tangential anectodes were taking us away from the text.  But once I started giving these apparent diversions some serious attention and thought, it was enlightenment itself, they always made a profound point.  The comparisons he occasionally draws from Indian philosophy or even from his own research in an Indian village and in Sri Lanka throw into clear relief the distinctiveness of the western intellectual tradition we read.  I love his sense of humor.  He is truly funny and he is always happy, never in a bad mood and never takes himself too seriously even though his knowledge is vast and he is genuinely brilliant, but he always treats the students' questions and contribution to discussion with respect.  He will even admit that he might be wrong about something and the student right.  He is a very good listener and can fire up an interesting discussion and move to the side and let it run its course.  But he is often too indulgent with students. He is too nice to stop someone full of B.S. who hijacks the discussion.  This is one reason why he runs out of time and needs extra class hours to catch up with the syllabus.  In general, he is a poor organizer of his time.  The students present him questions based on each week's reading.  He almost never gets through them, but then he covers them in his lectures.   He assigns three papers and two take-home exams.  He takes a long time to return them.  But the wait is worth it.  I haven't had any professor who reads my writing so closely nor anyone who has given me such copious comments.  On one of my 6-page papers I got 3 pages of single-spaced comments.  For his comments alone it is worth taking the class. He receives, marks and sends our papers electronically.  I think he does this because he is afraid of losing them otherwise.  If you can listen to him through his casual style, you'll learn more from this professor than anyone else.\nWorkload:\nWorkload is fair.  3 papers (take two or take all 3 and drop the one with the lowest grade), a midterm and a final take home, 24hr exams.  A fair grader.  But who cares about the grade is when he gives us such thoughtful comments?  The questions can be hard though.  They make you think.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2009",
            "review_content": "\nOh, Val Daniel, what to say. Personally, he is incredibly intelligent, charming, and absolutely hilarious. There were many times where our class was literally almost crying with laughter at his little stories.\nHow much of that brilliance you will absorb is another thing. The format usually had one day of him lecturing and one day of discussion. This first is boring and although the things he says about the works are often interesting, his presentation is hard to follow. Expect notes with lots of arrows, useless cryptic diagrams, and cross-outs. If you like historical/philosophical background info, he's your man, even though I usually found the information overwhelming, disorganized, and irrelevant. The next class, he reads people's discussion questions (sometimes... he often forgets), answers questions, gets distracted by irrelevant stories about his days in India or travels or amusing colleagues or the caste system or Hindu gods. It makes the class go by faster, sure, but you will sometimes leave with not much added clarity about the readings. In fact, we got so behind that we had \"optional\" three hour classes about six times.\nBelieve the following reviews about disorganization. He will lose your papers. He will forget your grades. For me it was more amusing than problematic, but make sure to save you papers. He doesn't really take attendance; he will only notice you're gone if you're a big talker or class character.\nHis grading ranges from easy to fair, not a hard-ass with papers at all. The take home exams must be done in 24 hours but we can usually persuade him to let us do them in whatever 24-hour period we choose. Don't underestimate how useful take home exams are. Especially during finals week when everyone is studying like crazy. Always lots of choices for paper topics (which range from direct and straightforward to strange and ridiculous), but no \"pick your own.\"\nDo you want an intense, passionate discussion and enlightment that makes you leave class still pondering and awestruck? Do you want to be able to discuss John Stuart Mill and Kant off the top of your head? Do you want to sit enraptured while the professor's wisdom makes you question your very existence? If so, Val might not be for you.\nBut if you want flexible guidelines, minimal work, basically optional attendance (at least second semester.. try to go first semester) a relaxed atmosphere, and a few laughs with a charming and personable academic, then you won't be sorry.\nWorkload:\nThree papers, drop one. Take home midterm, Take home final, weekly discussion posts that nobody does anyway. Reading standard, you don't have to do much.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 30, 2008",
            "review_content": "\nI just had Daniel Valentine for one entire year and I recommend that you not sign up for CC with this man.\nOn a personal level, Daniel Valentine is both charming and comical. However, do not be fooled by his playful exterior. The reviewers listed below are right: Daniel ends up lecturing the entire class. Unfortunately, the majority of his lectures are un-interesting and do not relate to the topic or book at hand. Instead, he will commonly refer to his anthropological discoveries and stores, since he is a successful anthropologist. Much of them center around his time and work in Sri Lanka, where, he has told my class on many an occassion, he grew up. The problem is that since he does not discuss the text at all, you are at a COMPLETELY LOSS when confronted with his paper topics. The topics are all very specific and lengthy, so it is incredibly difficult to BS writing the papers.\nFurthermore, his grading is arbitrary, and even if you speak to him about the grades, they will never be changed. Instead, you will come out of his office having had a fun conversation, but not in which your GPA was enhanced or your lousy grade undone. You will find yourself frustrated, too, with his inability to keep track of papers. The reviewers, again, were not lying when saying that he emails students asking them for their grades. He did that this past year - THREE times. But do not lie, though, I feel as if Daniel does so to see if you are one he can trust. But even then, you know your arbitrary and probably bad paper grade and he does, too. There is far too much stress involved with him. I do not recommend taking this class.\nLastly, when he assigns writing assignments, he does so on Wednesday nights, or more frequently, Thursday evenings, and it is due Monday. This means that he consistently shoots down many a weekend for his students.\nWorkload:\nLOW -- but at at a high-price: a poor grade. There will be three papers, the lowest of which you can drop, a midterm and a final. Sometimes the final will be take home (I had him for two semesters and he switched it up). You will find out only when the final is coming up. And the reading you can not do, but you will be at a complete loss when doing the papers.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 05, 2007",
            "review_content": "\nVal is a very witty guy. He speaks well, and listening to him is a pleasure. \nInterpretations of Culture is not a good class. Its syllabus is scattered and asks for too much while giving too little. Professor Daniel clearly was not fond of it (and could ot change it, as it is a standard course). \nVal made the classes very interesting, despite the fact that he didn't really talk about the readings. Every time the class got out, or during discussion sections, people who had obviously never read Durkheim or Bordieu before complained about lack of clarity and whined about Val's lack of focus on the readings. As an anthro major, having Val as a teacher was a much welcome relief, as he knows how to tell a good story while explicating an idea. \nIn any case, I recommend taking a course with him (I've taken two, this one and CC, and the other one was AWESOME). I do NOT recommend taking this course, but if you are an anthro major you will have to, so good luck. \nWorkload:\na few papers, take-home midterm, take-home final (both with the option for in-class)\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 18, 2007",
            "review_content": "\nThis class was a disaster. Professor Daniel is clearly brilliant, but he should not have taught an intro-level anthropology course. Besides the occasional joke, most lectures were disjointed and way, way too detailed. he would have been better suited for graduate courses. While neglecting to realize that this was the first anthro course for MOST students, Professor Daniel just skipped over to intense theory. And that's all it was - theory. I was definitely hoping for more ethnography in the survey course. \nHe was also disorganized. The TAs were sweet but they clearly butted heads with him and couldn't do much to stop him. As Val's tangents got longer and longer, our syllabus got shorter and shorter. We were talking about Marx up until the last week, and it was the second thing on the reading list.\nThough I doubt he'll be teaching this course ever again, hold out for someone else like Pemberton or Povinelli.\nWorkload:\ngood amount of reading, 2 short papers, midterm and final (both of which had take-home essay options) Val grades any take-home options himself and held essays to graduate-level standards meaning...don't do the take-homes. The questions are ridiculous.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 16, 2007",
            "review_content": "\nVal is an absolute classic.  Take his CC class at all costs.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 12, 2006",
            "review_content": "\nIf you want an easy class, take CC with Val. He is funny, laid back, and doesn't expect much. He is a pretty easy grader: take home midterm and take home final, and 2 out of 3 essays (throughout the semester) are graded. I didn't learn A LOT from Val, but that is because I could get away without reading. The times I did read, however, class was interesting, but often off-topic. It is also set up as Val lecturing for the most part, so if you want discussion, this may not be your best bet. Overall, I recommend Val for an easy CC experience. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 13, 2006",
            "review_content": "\nE. Valentine Daniel is the ultimate space cadet brilliant professor. He will lecture, but it is interesting, if not completely unrelated to the  reading. He comes up with some great quotes in class such as \"You know what would be really sadistic? If the sadist refuses to give the masochist pain!\" He loses tests, papers, and fogets grades, but you somehow can't get mad at him because those things are beyond his control. He's an easy grader and a great guy, so if you don't mind a little uncertainty or lectures in a seminar, take his class\nWorkload:\nstandard. you get to drop your worst paper.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 28, 2005",
            "review_content": "\nOther reviews of Val are completely accurate in describing his lack of organization and absentmindedness. The man is completely aloof most of the time -- he told us multiple stories about losing entire semesters of work in various ways, like leaving his luggage on an airplane and having the swedish police track it back to no avail. However, he's hysterical, and his class requires barely any effort or attention at all. Val rarely takes attendance, or notices when people are absent. His lectures are so distracted that it's best to bring your laptop to class and find ways to amuse yourself instead of devoting full attention. You'll learn more about Vishnu, Hindu gods and goddesses, and the Indian class system than anything else. Hence, you'll be completely unprepared for all of your papers and exams, but thankfully it won't matter because of the existence of Wikipedia and the Stanford Encyclopedia of Philosophy. And his grading system is a piece of cake. \nHe'll most likely lose your grades and ask you to let him know what you've earned, take your word for it no matter what you say, and all your work will have gone to no purpose. But ending up with an A will take far less effort in this class than in others.\nIn short, the guy is a fantastic person to talk to, very brilliant in his own field, but not a great CC prof. I don't recommend his class because you'll come away with nothing except babbles about anthropology. However, if you're solely concerned about an easy A, this class might be for you.\nWorkload:\nFour papers (about 4 pages each), of which only three will count towards your grade. Drop the lowest or only write three. A midterm which he gives you the questions for, word for word, in advance, and an open-note final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 04, 2005",
            "review_content": "\nNutty in that brilliant way. Picture the quintessential absent-minded professor, throw in a few bawdy stories about Hindu deities, and there you have Val Daniel. Disorganized? YES, and to the point where you knew you wouldn't be getting back your papers anytime soon. This progressed from a mere annoyance to a significant problem. Other reviews on CULPA had me prepared for some absent-mindedness, but it was really ridiculous!\nVal seems very intelligent, but perhaps CC is not the class he should be teaching. I bet a class in anthropology, his primary discipline, would be a lot more interesting. His style of teaching just isn't very conducive to learning much in CC. He lets students run the entire discussion, which is nice sometimes but can be a huge problem when you're confused and just want some simple, concrete answers to get you on your feet. Forget about getting clarification - this class is constant confusion and you rarely get a straight answer from Val. Frustration central.\nHowever, Val is really a gentleman, very charming and sweet. Great sense of humor, too. Get him going on a topic he finds interesting, and some of the most brilliant insights will come out of his mouth. I just wish they could have pertained to the CC course material, because then I would have felt that I had learned a lot more. He'll make time to talk to you outside of class, and what I thought was awesome was that he lets you write an extra essay on the final exam that will replace your entire midterm exam grade. Also, you're supposed to write four papers, but he tells you in advance that the lowest grade will be dropped and therefore you can choose to only write three. This has got to be one of the most generous professors ever!\nIn conclusion - A great anthropology professor, I'd be willing to bet. But for CC, you'd probably be a lot less frustrated if you took it with someone else. No offense to Val because he really is brilliant - I just found this class frustrating.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 2004",
            "review_content": "\nWhy? Just why can't we have more teachers like prof. Daniel in Columbia?  Prof. Daniel was without a doubt the best teacher I've ever seen in Columbia so far and I definately disagree with the negative picture painted by the previous reviewer.  Prof. Daniel was a little disorganized but I don't see any major problem with that.  The most important factor about a good teacher is his/her ability to teach well, which prof. Daniel was able to do successfully.  \nI came to CC having heard a lot of negative things about the class, but prof. Daniel changed that perception.  I learned a lot more than I thought I would be able to, I saw my ideas and beliefs challenged to the core, and most importantly, I enjoyed what I learned and didn't suffer through it.  I really believe I came out of this class being a better, more intelligent, and more mature person than before.\nProf. Daniel himself is a very intelligent person.  When he went on tangents during discussions, the students actually found them interesting (Besides, a 10 minute tangent is a nice break from a 2 hour discussion class, so I wouldn't complain about it).  \nIf you keep up with the reading and take good notes during discussions, you will be very satisfied in the end.  I highly recommend this class.\nWorkload:\n4 papers (he drops the lowest), a midterm, and a final.  \nJust keep up with the reading and take good notes in class and you'll be fine.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 19, 2004",
            "review_content": "\nE. Valentine Daniel.  An anthropologist, a poet; disorganized to an extreme, yet a lovable guy. \nCC was my favorite course, although it may have been more of the material and class discussions that were attributable to this fact than the often tangent ramblings of Prof. Daniel.  We learned a lot of random things about India, which in retrospect killed the time but was utterly pointless.  Some of his stories are pretty classic.  The discussions, when on topic, were very useful and often truly thought-provoking.  I definitely recommend this class. \nOne annoying aspect of the class though was how disorganized Prof. Daniel was.  He took attendance only the first few classes--he acted strict at first, but this was obviously a sham, as he broke down two classes later and ended up seeming more of a father figure towards the class.  Grades ended up being based on how much you talked, along with essays and exams. \nBack to how disorganized he was.  The previous reviews for him scared me a little at first, but there was no major problem for a while.  Turns out they are correct and Valentine has a big problem about losing stuff.  So what happened?  He took forever to grade our first paper and midterm.  Then he lost another paper of ours, saying he left it in another state by accident. \nWhat's wrong with this picture?  He had lost all of our grades, something I've never had a teacher do before.  So then he asks us what we got.  I mean, this leaves just a little room for smudging your grades.  There is just something fundamentally wrong with the teacher having to ask you to send your own grades to them.  It was inexcusable the way he loses everything; but at the very least he should have taken our old papers and looked at them himself to see our grades.  I know most people wouldn't lie, but this was a great opportunity to do so.  After all, he left our academic dishonesty agreements on the bus along with everything else, so our swears that we would not cheat were lost as well!\n\nWorkload:\nHe says to do questions each class, but in reality it won't make a difference in your grade.  So you are just graded on participation, best three out of four easily graded 5-7 page essays (make sure to number pages and include a works cited list!), and a midterm and final that have many questions to choose from, so it's not too hard to find something that you know.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2004",
            "review_content": "\nThis seems to be a real problem for Val. I quote:\n\"Dear All:\nMea Culpa. The reason why you have not received your grades is that I don't seem to be able to open the file in which my R.A. \nrecorded your grades for Assignment # 3.  She has been beyond reach over the holidays and the Deans (and I am sure, you too) are breathing down my neck.  If you want your final grades sooner than later, could please you dig up the  3rd assignment and send the grade I gave you on it to me by reply e-mail asap?  Your personal grade will follow soon thereafter.\nAgain, I apologize.\nval daniel\"\n"
        },
        {
            "course_name": "Introduction to Social and Cultural Anthropology",
            "review_date": "November 21, 2003",
            "review_content": "\nIn spite of the following email conversation from last May, I still have a soft spot for Prof. \nVal Daniel. I think itÂ’s because of the day he mumbled something about being sent to the corner as a young schoolboy in Sri Lanka, or the infamous tales of an Indian wedding in New Jersey. Or perhaps the day he reflected on the discipline of cultural anthropology and said, Â“Something so utterly useless... must be the discipline of my heart.Â” And that warmed my heart. The man is brilliant.\n(1) Dear ____:\nDid you submit the two papers that were required of you in the course?  And if you did, please let me know what grades you received for them as soon as possible.\nThank you.\nE. Valentine Daniel\n(Professor of Anthropology)\n(2) Prof. Daniel,\nAs far as I know, for Social and Cultural Theory, there was only one paper required, a midterm, and a final. I submitted the term paper to [the TA], but I do not know the grade.\nThanks,\nMe\n(3) Dear ____,\nThere were two papers due, not one.  And did you present at least one?  And what grade did you receive for it?\nE. Valentine Daniel\n(Professor of Anthropology)\n(4) ____,\nI am sorry, I stand corrected. But do tell me what grades you received for your paper and your mid-term.  I don't seem to have a record of it and [the TA] has taken off for the holidays, it seems.\nVal Daniel\n"
        },
        {
            "course_name": "Introduction to Social and Cultural Anthropology",
            "review_date": "September 02, 2003",
            "review_content": "\nVal Daniel is probably one of the more odd albeit entertaining teachers I have ever had.  His lectures follow no path and he never knows what the assigned readings were for the week or even what AUTHORS he included in his syllabus.  Even if you can find the books he assigns (no store seems to carry them and the reader took two weeks to be ready) you won't read them so don't waste your money.   The material is interesting if you want an independent study course masked as an INTRODUCTORY anthropology section.  The funniest part of Val's lectures is when he starts talking about Indian weddings in New Jersey and when little kids run around naked on beaches.  The man is a nut.  His class was totally worth sitting through as long as he didn't expect much of you as far as being able to regurgitate his incoherent blabbler.  The only problem is....by the time the final comes around Val realizes he hasn't taught anything all semester and so wants to make right by grading your final like it was supposed to be written by the grad student TAing your class.  Completely ridiculous.  You don't do anything all semester....then you take an impossible final that leaves your hand aching for days, because the test is about 30 short essays on authors you haven't even heard him mention once in class.   A sample question from the final (I remember it to this day) was: \"Describe meaning for Marx.\"  WHAT?!....nuff said\nWorkload:\n1 15 page paper you can BS your way through\n1 IMPOSSIBLE final\nThe class makes no sense DON'T take it\n"
        },
        {
            "course_name": "Symbolic Anthropology",
            "review_date": "December 22, 2002",
            "review_content": "\nVal Daniel is one interesting character. I learned a lot in this class, but I know that a lot of my classmates found Val's teaching style strange: very unorganized, with lectures being about whatever Val feels like talking about, or *thinks* what we were supposed to have read. Great and engaging lecturer. T.A., Anush Kapadia, was also an engaging lecturer and fair as well: good thing too, since he does the grading. Just a note, Val missed the last three classes we were supposed to have.\nWorkload:\nWe were originally supposed to have 4 papers, dropping the lowest one. We wound up having three papers and having them all count.\n"
        },
        {
            "course_name": "Symbolic Anthropology",
            "review_date": "May 11, 2002",
            "review_content": "\n Prof. Daniel is a genuinely nice person; concerned about his students, but as stated in the reviews above, definitely wrapped up in his own \"academia.\" I, personally, though an intellectual and an artist, hated the class. I found the philosophies to parade around as though based in science (they weren't, to my knowledge), and entirely out to deconstruct, trivialize, and explain away every last bit of the human spirit. Others in the class definitely enjoyed the material much more than I.\nWorkload:\nI agree with the above statements, esp. that you cannot B.S. your way thru papers... which sucks if you are like me and find the philosophies trivial and illogical. You will be expected to take the approaches of the \"professionals\" of the field, ie- know this guy's side vs. that guy's side and deconstruct and contrast what the battling egos have to say.\n"
        },
        {
            "course_name": "Symbolic Anthropology",
            "review_date": "May 11, 2002",
            "review_content": "\nVal Daniel is definitely a fascinating person, and he definitely knows his stuff. If I were making a list of Columbia professors to invite to dinner parties and have long tangential conversations with, he'd definitely be on it. However, if I had the chance to redo this semester, I would not take this course. Partially this is just because I didn't find the material that interesting, but some people did. If you're big on highly theoretical stuff, and you don't mind treating theory as if it's fact, you might like this class. If you're like me, and you think a lot of theory is irrelevant mental masturbation by academics who like to draw diagrams and make up new words, you'll probably find it frustrating. The lectures are usually interesting, and Professor Daniel has a good sense of humor, but the material in the lectures often has little to do with the reading, and is usually out of sync with the syllabus. This makes it difficult to prepare for discussions- half the time nobody, including the professor, knew what readings we were supposed to have done by a particular day. \nWorkload:\nTotal reading isn't so bad, but its unevenly distributed so some weeks you'll have two entire books to read, other weeks you'll have an article. 4 papers, only three of which count, plus class participation. He's not a bad grader at all, but that's assuming that you take the readings seriously and don't try to bs. He has this policy of giving you two days to write a draft paper, giving it back to you with comments the following week and then giving you another two days to turn in the final version. This seems like a reasonable thing, but if you have any sort of life between Wednesday and Friday, you probably aren't going to have the time you need to write a draft you're happy with. The comments on the draft are usually more cosmetic than helpful, it might be better to not bother turning in the draft and give yourself the time you need to write a good paper. Also, you're allowed to kep your best three grades, but if he does the same thing next semester that he did this semester then the final paper will be much harder than the earlier papers. Doing the first three is probably your best bet. \n"
        },
        {
            "course_name": "Symbolic Anthropology",
            "review_date": "April 29, 2002",
            "review_content": "\nVal Daniel, while a charismatic lecturer, is incredibly disorganized. His syllabus is incomprehensible, the lectures rarely correspond with the readings for that day, and he is highly inconsistent with assigning(via email), grading, and handing back papers in a timely fashion. The readings are difficult to access in the library, and he did little to remedy this problem. These readings themselves are interesting, but it's difficult to prepare for a class that is so out of whack.\nWorkload:\nReasonable - 4 papers, weekly readings. Unbalanced though, some weeks will have a book and 3 articles, some weeks only 2 articles, and the syllabus is merely a suggestion of structure. \n"
        },
        {
            "course_name": "Symbolic Anthropology",
            "review_date": "December 31, 1999",
            "review_content": "\nVal Daniel is the original briliant scholar.  He is so impressively intellectual that his lectures are almost incomprehensible to the average IQ. However, he has a great sense of humor, is really nice and genuinely wants (in fact urges) students to come to his office for help or to discuss the material. So if the material loses you, you wont be left to wither away and fail. This class is a really interesting way to look at anthropology especially if you are used to a materialist approach. The readings are challenging in a mind expanding way, very philosophical. If you like mental masturbation on subjects you went over in CC, this class is for you. You will be forced to think harder than you ever have before. Not for the easily intimidated.\nWorkload:\nA five page paper every month or so, four total for the semester. You get to rewrite (for a new grade) each paper except for the very last. No exams. The TA's do all the grading but they are tough (graduate students) and their grading suggestions go through Val before they are finalized. Altogether manageable but there's no way to b.s. your way through a paper for this class.\n"
        }
    ]
}