{
    "prof_info": [
        {
            "prof_name": "Amber Youell-Fingleton",
            "prof_id": 2765,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "August 04, 2009",
            "review_content": "\nAmber is the best! she is so interesting, knowledgeable, and adorable! she brings in her friends who are musicians to perform a lot of the pieces and she is great at explaining all the musical jargon for people who have no background in music. she is fun and you'll love her class. she's totally open-minded and interested in her students' ideas and opinions about the music. she makes music hum a very eye-opening and interesting class.\ntip: talk a lot in class. you'll get an A+.\nWorkload:\neasy. 3 papers. take home midterm. final in-class exam. weekly listening responses where you can literally write anything about the piece and she'll like it.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "August 26, 2007",
            "review_content": "\nAmber is an amazing teacher.  She is perhaps the nicest woman in the world and is very effective in her teaching style.  I had no interest in western music until I took this class yet she made it fun, exciting and easy to understand.  I know some of the kids in my class who had previous music knowledge and seemed way ahead of the game but I still managed to get an A+! If you do your papers diligently and chime in with some comments in class every now and then, you will be on her good side and she will do all she can to ensure you get a good grade.  Definitely recommend her!\nWorkload:\nCouple papers, midterm and final - ids, essays.  not hard. take good notes in class and make sure to know key words.  papers are not hard - do them diligently and add creative insight and you'll get a great grade.\n"
        },
        {
            "course_name": "Introduction to Ear Training",
            "review_date": "December 27, 2005",
            "review_content": "\nAmber is awesome! She is enthusiastic and very caring. If you have questions, never hesitate to ask her. She is totally approachable and is very willing to offer extra help. She will stay after class with you, answer questions via email (promptly!), and arrange additional practice sessions outside of class if needed. The class is short and flies by quickly (you won't be bored). I learned a lot and enjoyed it. The class was moderately challenging but never to the point of being ridiculously overwhelming. Amber is fair (and even generous) when it comes to grades. Plus she is also a great vocalist herself--see her perform if she announces an opportunity about this! I would definitely take another class taught by her.\nWorkload:\noccassional homework but nothing too overwhelming; do some practice on your own by using musictheory.net (the interval trainer is especially helpful) and do the practice examples posted on courseworks; two midterms and a final\n"
        }
    ]
}