{
    "prof_info": [
        {
            "prof_name": "Bernard Berofsky",
            "prof_id": 19,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "August 25, 2005",
            "review_content": "\nThe reviews are pretty accurate, Berofsky likes to mumble so sit up front to prevent yourself from dozing.  Also, participate!!! Our class was partially brain dead and there were maybe two or three people that would ask questions or answer Berofsky's.  If you engage in the class then it becomes more interesting.  That said Berofsky knows his shit.  He is THOROUGH and if you want to learn alot then take this class.  It was definetly worth it, and he is an extremely nice guy.  Some of the readings are difficult so it pays to read them before the lecture and ask questions.  Take good notes, you will need them for the final!  \nWorkload:\ntwo papers (go talk to him about your paper idea before you write it)  and one final.  If you take good notes in class and study a little, you'll be fine.\n"
        },
        {
            "course_name": "Free Will and Responsibility",
            "review_date": "January 27, 2005",
            "review_content": "\nDon't take this class with Berofsky unless you are really into philosophy.  He is very methodical and breaks down all the concepts and really drives them into your brain, but you'll need caffeine because he does have a rather....uh....droning style.  However, by the time I left this class, I felt that I had achieved a very comprehensive understanding (for an undergrad amateur) of the issues and arguements that are central to the free will debate.  Which is what is really most important.  And I did not find the readings particularly boring, though I would say following up on some of Berofsky's suggestions for outside reading certainly made the class more interesting.  There is really not a whole lot of reading for a philosophy course. \n  I found him to be quite an easy grader.  As far as papers, I would suggest that you see him, at least if you intend to go off the list of suggested subjects. If I had, I probably would've gotten more  out of the class and a better grade.  Also, I agree with the reveiwer who said that Berofsky (like most other philosophy professors) really wants you to basically show that you understand what some philosopher has said rather than to come up with your own stance.  The positions are entrenched and pretty well-defined, so be \"creative\" at your own risk. \n And, yes, the final was a bit much, but he gave us the questions beforehand.  If you've been taking good notes, you've done yourself a huge favor come crunch time.  If you do all of the above and have taken a couple philosophy courses and/or have something of an ear for philosophy, you'll probably get an A.  \nI learned to appreciate Berofsky's occasional and VERY DRY wit. Although it is quite true that he seems to have a hard time understanding questions worded in everyday language, his writing is very clear and even entertaining (MUCH more so than his lectures).  Although I have some reservations about the inflexibility of his thinking. He ain't the most supple of the lot.  Likeable, though.  \nWorkload:\nTwo 1500 page papers (don't be afraid to go over the limit if something really enthuses you and you've done extra research. Berofsky rewards extra effort put in even if he doesn't completely agree with or understand your arguement - again, see him.)  Challenging final that will leave you with writers cramp and a feeling of impending doom, but don't worry too much.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 03, 2005",
            "review_content": "\nBerofsky is a mediocre player on an all-star philosophy team.  He's tolerable, but there is no reason to take a class with him when you can take the same one with an amazing professor, of which the dept has plenty.  He's straightforward and intelligent, but very boring, and clearly has long forgotten what it's like to be a student.  He will deliver the material to you but doesn't add much that you don't pick up on your own if you do the boring (particularly for Free Will) and dense reading he assigns.  Don't waste your time and tuition.\nWorkload:\nMethods: typical classic readings, a couple of papers, midterm and final - grading is what you'd expect for Philosophy 101.\nFree Will: plenty of boring reading, two long papers and a ridiculously comprehensive final that will leave you struggling if youhavent taken good notes in every one of his broing lectures,\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 01, 2005",
            "review_content": "\nThe best way for me to describe this is blah. There were times when those 2 hours were totally unbearable, and others when it was very engaging, but  most of the time, it just was. He's a very understandable teacher, definitely knows his stuff (particularly Descartes) and is understanding about the huge amount of CC reading. He can at times also be very funny and is *a magician*.\nHe tends to evaluate the works very much as a philosopher (he is afterall from the philosophy department) and sometimes this can leave you feeling a little bit \"WHO CARES\" (especially if philosophy just isn't your bag, baby). But, for those of you who love philosophy, then Bernie is your man. He will debate and argue all sorts of philosophical points with you, and you can dominate class discussion. For all the rest of you, try getting in your class participation by volunteering to read things outloud, and asking general questions about the class. This way, he will at least know who you are.\nWorkload:\n2 essays, 5-7 pages, midterm and final, which for CC are NOT departmental. For the papers, he wanted, above all, ORIGINAL thinking, and is a bit nitpicky about grammatical things that  should seem irrelevant. He will definitely not accept a book report or regurgitated information. The midterm and the final can be kind of brutal, so make sure you KNOW the information. If you read, and can recall broad and minor details, you should be fine. I guess I'll also note that my final grade was higher than I expected, so, don't freak out if you think you're doing poorly.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "November 14, 2004",
            "review_content": "\nTo being with, Berofsky is HILARIOUS. The casual way in which he makes hilariously ironic comments was enough to keep classes entertaining. \nIn terms fo teaching style, Berofsky is admittedly somewhat dry, but he knows his stuff and does his best to make complex texts  and concepts acessible to his students. The course structure, esp in Methods&Problems;, was very condusive to giving a broad, general understanding the main currents of philosophy, and while doing the reading is necessary, readings were short and concentrated on the main issues at hand-basically, while you will be somewhat lost if you don't do the reading, if you do it, you'll find that Berofsky's lectures provide answers to the very questions/parts of the text that you had found particularly difficult. In the advanced course, the same holds true. Also, in that class, Berofsky always left time during transition points in the lecture for students to ask questions, but beware, he will challenge you, and force you to think.\nOverall, I have TRULY enjoyed my classes with Berofsky; my expxerience in methods&problems; spurred my decision to major in philosophy and his class on free will has made that topic the focus of my interests in philosophy. I would HIGHLYrecommend him to anyone who has a real desire to understand and as he says \"do\" a little philosophy of their own. Philosophy classes aren't meant to be easy, but Berofsky succeeds in making his accessible and engaging.\nWorkload:\nM&P;: two paper (i think one is 3-5 and the other 5-7, final: he gives you all the potential questions beforehand and chooses from among them. You do get to choose which questions to answer, i think it's like 2/3 for each major topic. definitely do-able.\nFW: 2 1200-1500 papers, suggested topics and reading list provided (you are required to use one paper not on the syllabus for each). Final. VERY do-able.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "December 18, 2003",
            "review_content": "\n    Berofsky's lectures are dull. Berofsky's lectures are dry. Berofsky's lectures are mind-numbing.\n    Berosfky is a methodical, intelligent philosopher. He has a complete and extensive knowledge of what he is talking about.  He answers student questions throroughly, although he has trouble understanding those who speak sloppily.\n     In all honesty, although I like Professor Berofsky very much on a personal level, I would never in good faith recommend his class to anyone. Granted, have tastes other than mine and somehow fall in \"interest\" with him.  But, with this learned philosopher,  very few people who have that sort of chemistry.\nWorkload:\nSeminar : one class presentation, final paper, attend most classes.\nFree Will : two large papers, final, attend most classes.  \n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "November 12, 2003",
            "review_content": "\nSome of the previous reviewers from my class (Spring Â’03) were a little unfair to Berofsky, so IÂ’m going to try to balance their reviews out a little.  There seems to be two basic points of criticism in each of the previous reviews.  First: that Berofsky is boring.  This is a half-truth; while itÂ’s true that the man is no Winston Churchill, I thought he did an excellent job breaking down complex arguments into crystal-clear, easily digestible pieces.  His lectures were dry but usually revealed so much crap I missed while reading that they were able to keep me engaged.  Could he do a much better job livening up the material?  Of course, but I always left class with a strong grasp of the material, and IMHO that makes him a successful teacher.  Second point of criticism:  Berofsky canÂ’t answer studentsÂ’ questions.  This one is mostly true; donÂ’t expect a lot of interesting dialogue from his class.  He makes an effort to answer studentsÂ’ questions, but often has a tough time with them Â– not because heÂ’s been Â‘speaking PhilosopheseÂ’ or something, but rather because he is entirely incapable of reformulating a poorly phrased statement.  If you have something to say, do so using clearly defined terms that you have a strong command of.  And be careful: if you have an objection to one of the arguments discussed in class, think it through carefully before you open your mouth or Berofsky will shred you.  Also: I thought the reading selections were good Â– not great, but a solid sampling of both new and historic material on various problems.  (One paper was closely related to some of the issues touched on by The Matrix, however, sadly Berofsky never saw the movie and wasnÂ’t able to approach it from this angle).  Overall, donÂ’t take this class with Berofsky expecting to become passionate and inspired about philosophy; instead, expect to gain a solid foundation for more advanced philosophy classes. \nWorkload:\nÂ“Two 6-8 page papers, for which you had better do the reading and have an actual point.  Berofsky is no pushover when it comes to grading papers--at least I can respect that.Â”  Show enthusiasm for your paper topic and youÂ’ll get the A.  A retarded final exam that took entirely too much studying.  He gave us a list of 26 questions, each which took 45 to an hour to prepare for.  Very little choice; you have to prep for like 20 of them, which amounts to ~ 16-17 hours of studying.  Hopefully heÂ’ll adjust the final a bit for the next iteration of this class.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "September 10, 2003",
            "review_content": "\nBerofsky is fairly boring, surprisingly inarticulate, and totally unable to answer questions posed to him in normal English.  He has apparently spoken exclusively in philosophese for so long that he often can't parse normal speech.  He's a nice guy and seemed very much to know his stuff.  But, the class is a drag  and frankly I'm at a loss as to what previous reviewers were talking about regarding his supposed wit and charisma.  Occasionally he will go off on some extremely odd tangent about some weird crap, but even then, it's a far cry from funny.  Moreover, this happens with relative infrequency.  The majority of the time is just minutes piled upon minutes of listening to him talk in a monotone voice.  The best part of the class were the absolutely absurd chalk drawings he used in a poor attempt to illuminate those ideas he felt needed a bit more kick than his monologue.  He once drew a giant misshapen oval, which if I recall correctly, was a schematic for the concept of free will.\nWorkload:\n2 (6-8pg) papers and an in-class final consisting of 5 short essays.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "May 19, 2003",
            "review_content": "\nBoy, CULPA really let me down with this one. This class engendered in me one emotion with regards to philosopy: LOATHING. Even my friends who are planning to major in philosophy disliked, to use a milder word, the class. Prof. Berofsky seems very nice and approachable, but he was unable to keep my attention for more than 10 minutes during any given class (exceptions being the first and last lectures--maybe he got his second wind). Whatever the reason for his usual pedantic, incredibly dry approach, I came to dread going to this class by the middle of the semester.\nWorkload:\nTwo 6-8 page papers, for which you had better do the reading and have an actual point. Berofsky is no pushover when it comes to grading papers--at least I can respect that. For the final, he gave out a list of 26 questions, and chose five at random for the final (there is a little choice on the actual test).\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "May 19, 2003",
            "review_content": "\nDisappointment would be the best word to describe this class. After all the positive reviews on CULPA I was looking forward to a good semester with Prof. Berofsky. Instead, I got mind-numbing tedium. He's nice enough, and occasionally funny, but I just couldn't bring myself to pay attention to what he said. As far as the class goes, there's a lot of reading, and I did most of it at the end of the semester prepping for our final. Most of it is not very interesting, but there are a few good articles. While Berofsky knows his stuff, for some reason he couldn't communicate it to us in an interesting way. I wanted to concentrate in Philosophy, but this class has made my seriously reconsider that. And Philosophy majors/concentrators don't even need to take Methods and Problems, so you should probably just go right into an elective or one of the History of Philosophy courses. For non-Philosophy majors,  take this class if you like, but don't expect to become interested in philosophy.\nWorkload:\nFair amount of reading - about 20 pages or so per class on average, most of which is doable. Two papers which are graded fairly, no midterm, and a final that took way too much preparation (he gave us 26 questions, we had to answer 5, with very little choice. Not fun.)\n"
        },
        {
            "course_name": "Free Will and Responsibility",
            "review_date": "November 03, 2002",
            "review_content": "\nLet's just say this: While describing the ideas of a certain very prominent and well-known philosopher, Berofsky says, \"I disagree, and I told him so when we were playing ping-pong once. He's not that good at ping-pong... I actually won a ping-pong torunament in the Bronx once...\" In other words, the class is full of fun, hilarious, interesting anecdotes. I highly recommend it.\nWorkload:\naverage. Make sure your papers are well-written (ie. don't write them the night before at 4 AM) and you'll do fine.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "March 02, 2002",
            "review_content": "\nBerofsky is a fabulous lecturer with a style that flows well. He uses clever examples to illustrate some of the more difficult theories (although some of the examples are from the literature), and moves at a nice pace to cover a lot of material. He always stops every fifteen or so minutes in his lectures to invite questions, so his classes are very open and have the atmosphere of a discussion-based seminar sometimes. However, Berofsky does take attendance and even uses a seating chart to make sure people attend classes. He will count attendance in the final grade. That having been said, I should point out that he is very set in his ways when it comes to term papers. Don't believe what he says in the syllabus that papers should be an original argument! What he really wants you to do is just the opposite. He wants you to reconstruct some argument that some philosopher has made on some interesting topic, usually from the reading list. Believe me on this one--I tried twice, and learned the hard way! Don't make the same mistake I did. It's a good idea to go see him in office hours before you go off to do some research for a paper. he will usually suggest one or two readings--Make sure to include those readings explicitly within your paper, if you want to do well. Be careful, too, about pressing a point too insistently in class--he has the potential of making you look dumb. \nWorkload:\nTwo papers. Final. In seminars, one term paper, one presentation paper.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "April 08, 2001",
            "review_content": "\nProf. Berofsky makes philosophy accessible and engaging for the first-time student. His class examines six different topics that really get at what philosophy is about. His lectures are interesting and hold your attention. You can tell he knows a tremendous amount of shit, and yet he is usually able to explain things so that you can understand them while making sure that you're actively engaged in thought the whole time. This is a great course. Berofsky is very cool.\nWorkload:\nModerate. Readings for each class. 2 papers (5 pg each) and a final exam. Be sure you've done the reading for the final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nKnowledgeable and laid back. He understands that students can't always read 300 pages for every class but still delivers well-researched and interesting lectures. Not very discussion oriented, but his extensive experience with the texts has given him some fascinating insights to share and he's familiar with much of the criticism and opinions associated with the texts. In grading, he's a stickler for good writing. Creates a good classroom environment.\nWorkload:\n2 papers (1500 words), 2 exams.\n"
        }
    ]
}