{
    "prof_info": [
        {
            "prof_name": "Denise Milstein",
            "prof_id": 2065,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Social Movements",
            "review_date": "February 04, 2012",
            "review_content": "\nDenise Milstein is definitely brilliant. She is a very intelligent, sweet and understanding person. I take her classes twice- social movement and social theory. She likes to lead the class in discussion, and she is very good at facilitating good discussions in class. But don't think of her as one of those professors who expect you to speak for the whole 75 mins when they only say one sentence or two. She's very good at lecturing, definitely the best on I have ever had on this campus since she is very good at catching the points of reading and explaining all those abstract terms in very clear ways. You feel the time pass so fast in her class - you are so immersed in the protectors' stories, the thinkers' theories, and you keep your brain running to catch up with the flow of the thought, even after the classes end. You really think a lot in her classes, definitely worth a try.\nWorkload:\nMedium. For Movement I believe I had three essays, two 8 pages ones and one long one for final. For theory there are five short 4-5 pages essays I believe, and maybe one final. Readings could be long some time, but usually bearable. You will need to read for participating into the classes, and she gives pop-up quiz on the readings - scary but very helpful with understanding your material. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2009",
            "review_content": "\nNice, mediocre. Classes have minimal structure; papers take a long time to grade and have few comments. Exams are straightforward, but Milstein never really makes it clear what she is looking for. All things considered, it appeared to me that teaching this course was not a huge priority for Milstein. Bottom line: you are better of elsewhere.\nWorkload:\nTwo papers, easy mid-term and final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2008",
            "review_content": "\nConsider yourself lucky if you've got Milstein. Despite the strict tone of her syllabus, she is extremely nice to her students. She does not put IDs on exams but instead makes you write two essays based on news articles. Her paper topics are similar, being grounded in a modern context. Discussions range from really good to pretty boring - i think this depends on the topic and how well-prepared everyone is. Milstein is a sociologist and thus places the class in an interesting perspective - again, she tends to discuss everything in a modern context and apply principles to real-world situations. In any event, Denise is a sweet woman and very accessible when you need help. I'll be sticking with her next semester.\nWorkload:\nLighter than typical CC. Taking good notes in class will make studying for exams painless. Once a week discussion board posting, which she will cancel during busy weeks. I would still recommend doing the reading, though.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2008",
            "review_content": "\nConsider yourself lucky if you've got Milstein. Despite the strict tone of her syllabus, she is extremely nice to her students. She does not put IDs on exams but instead makes you write two essays based on news articles. Her paper topics are similar, being grounded in a modern context. Discussions range from really good to pretty boring - i think this depends on the topic and how well-prepared everyone is. Milstein is a sociologist and thus places the class in an interesting perspective - again, she tends to discuss everything in a modern context and apply principles to real-world situations. In any event, Denise is a sweet woman and very accessible when you need help. I'll be sticking with her next semester.\nWorkload:\nLighter than typical CC. Taking good notes in class will make studying for exams painless. Once a week discussion board posting, which she will cancel during busy weeks. I would still recommend doing the reading, though.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "May 20, 2004",
            "review_content": "\nDenise is a great instructor.  She is always willing to answer questions and values every student's opinion.  This class is very much a survey course, so don't expect to go into too much depth on any on sociologist or sociological theory.  Basically, if you've already studied sociology, this class may be too basic and/or repetitive for you.  However, if you haven't taken sociology before (or if you have and want an easy A and a chance to show off what you know..) then this class is for you.  Denise is also really nice and is always available for office hourse.  \nWorkload:\nYou pick which 5 weekly reading responses to do, if you do all of them you get extra credit (only 1-2 pages long, graded on a \"check,\" \"check-plus,\" \"check minus\" scale).  Also group presentation on a sociological movement (counts like another reading response) and an oral final.  Class participation and attendance counts too (she takes attendance).  Go to class, talk, do all of the reviews and you will get an A.  Easy class, but still interesting. \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "May 17, 2004",
            "review_content": "\nInisghtful, warm, thought provoking.  Denise Milstein offers a non-intimidating environment as an intoduction to sociology .  Her intelligence regarding the material is astounding, yet she does not flaunt her knowledge.   Participation is encouraged so if you fail to read the assignments it will show. I highly reccomend Denise Milstein in anything she teaches.\nWorkload:\nHeavy and intense reading assignments. You must do them or else be lost in class.   10 two page papers  based on the readings. Oral presentation based on individual reading outside of class.    Final exam is oral.  It is a cumulative half hour one on one conversation, but it is not that bad.  \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "May 13, 2004",
            "review_content": "\nOne of the most interesting courses I've taken.  Denise is extreemly intelligent,  approachable, and insightful.  She encourages class participation.  It is part of your grade.  If you give a wrong answer, she  is not be condesending.   Her assignments are intense and erudite.  They require a great deal of time and attention.  However they are interesting and often topical.   You probably wont understand everything, or sometimes most, of what you've read.  Don't panic.   Denise's visual diagrams will clear things up in class.   I would encourage you to take this course, or anything that Denise Milstein instructs.   She's a winner!\nWorkload:\nLengthly and intense reading assignments.  A two page assignment due each week, usually based on the readings.  A group oral presentation at the end of the term.  An oral final exam that's not to scary.  If you do the readings and participate in class, you'll be fine.  \n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "May 11, 2004",
            "review_content": "\nAt first, I found this class to be very difficult.  The assigned reading was very long, and, having never taken a sociology course before, I was unfamiliar with many of the theories and felt like they were a little over my head.  However, Denise is a great instructor.  She was always positive and listened to everyone's comments.  Her lectures helped to explain some of the more difficult concepts from the reading, and, often, her lectures were led by providing answers to everyone's questions at the beginning of each class.  Denise was very nice, and very approachable.  Although I wasn't particularly enthusiastic about sociology at first, taking this class made the field more interesting to me, and it turned out to be a good experience.\nWorkload:\n7 Reading Responses, 2 Observation Assignments, One Group Comparative Project, Interview Final\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "May 07, 2004",
            "review_content": "\nShe is a delight.  Enthusiastic about the topic.  Open to conversation and requests for explanation.  Clear in her explanations.  She looks for classroom participation and discussions of the readings and ideas under consideration.  Good first sociology course, and a great course in the hands of Denise Milstein.  I heartily recommend it.\nWorkload:\nA fairly heavy reading schedule, particularly in the first half of the course.  Written assignments every week.  No mid-term and an oral final.\n"
        }
    ]
}