{
    "prof_info": [
        {
            "prof_name": "Georgette Fleischer",
            "prof_id": 530,
            "total_reviews": 54
        }
    ],
    "reviews": [
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 08, 2016",
            "review_content": "\nSo this class was pretty much hell on earth, to be honest. It sucks because the material was actually pretty interesting but the professor was just not the best. I know this has been said before on other reviews for Fleischer but I got As on most of my essays in high school and my first two essays (out of three) I got Cs. I'm fighting for a B in the class which is just not where I want to be my first semester of college. The prof gives weird feedback and hates passive verbs (seriously they are her enemy) but when I go to her office hours she just asks me a bunch of questions about my work and doesn't answer my questions. She's actually pretty nice during class time but then I keep getting these horrible grades and not improving. It's very frustrating. I just feel like she hasn't taught me how to write better, which defeats the purpose of first year writing.\nWorkload:\nThree essays (two of them were 4-6 pages and the final paper is 6-8 pages). Reading for every class, rarely difficult. One provocation, it was not hard.  The essays are the hardest part, especially because they are worth so much of your grade and she's such a harsh grader. A couple of opportunities for extra credit.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "August 19, 2016",
            "review_content": "\nThere are already a ton of comments talking about how difficult this class is, so i'm not going to waste your time repeating that. Instead, if you are reading this, you probably were assigned to a class you cannot change. But there is hope! I got an A in this class and so can you. Here's how: \n1. REREAD THE TEXT. You will hear this phrase repeated ad nauseam in her classroom, but it really is one of the best ways to succeed. If you are reading a book that you aren't going to write a paper on (majority of the books), then skimming the text is fine. You can probably even get away with skipping a reading or two, although I wouldn't recommend it. Reading every text allows you to contribute to her in-class writing activities, which are sort of like ungraded pop quizzes (will elaborate below). However, if you are writing a paper on a book, you need to read it at least twice; once with the class, and once independently when you are writing the paper. You need to know this text EXTREMELY well to succeed- any slight mischaracterization or misinterpretation will cost you greatly in the paper. \n2. Do EVERY extra credit opportunity: As mentioned above, Fleischer without warning asks students to complete in-class writing activities, for which you will receive a grade of a check minus, check, or check plus. Every check plus equals extra credit. She will read out loud the best one or two responses in these activities, and if that happens to you a couple of times, you WILL see an increase in your grade at the end of the semester. In order to be successful at these, DO ALL READINGS. In addition, complete peer review throughly and as often as possible. \n3. Class participation is about depth not breath: Yes, it is important to contribute to discussion regularly in her class, but she will appreciate 1-2 thoughtful and unique comments much more than you giving 10 comments that consist of your opinion or are just extending another classmate's comments (unfortunately, I saw many people try the second strategy). Also, as the year goes on, whenever you can make a connection to a previous text or supplement essay, DO SO. \n4. GO TO OFFICE HOURS: Her first draft comments consist largely of pointing out grammar errors and expressing general dissatisfaction with your writing. Office hours will give you an opportunity to actually hear what she has to say about your writing. Whatever suggestions she makes, DO THEM, even if you don't agree. \n5. GO TO THE WRITING CENTER: As many times as humanly possible! Not only will this improve the quality of your writing (seriously, it will), it also will impress Fleischer- when you turn in your drafts, she asks you to include drafts you gave to a writing fellow. This shows her that you are making an extra effort to improve your writing and she will reward you for that. \n6. Do not give up!: I received a b- on one of the 3 papers and still finished with an A due to her generous grade adjustment from extra credit and class participation. Many students do very poorly on the first test and then resign themselves to a low grade, and don't put in much effort. This is very obvious to Fleischer and it will make her dislike you. Instead, if you get a bad grade on your first paper (most people do), go to office hours as soon as possible to discuss with her your grade. Do NOT attempt to argue for a better score or express disagreement with the text; only ask for ways in which you can improve. \nGOOD LUCK!!! \nWorkload:\n2 3-5 page papers, one 8-10 page paper. Everyone takes a turn leading class discussion one day. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 10, 2016",
            "review_content": "\nMy comments hardly differ from what has already been said about Professor Fleischer, but I will state them nonetheless. Let me start off by saying that in the classroom, Georgette is fine. She is certainly passionate about the texts she teaches and is willing to engage with students. With only a few weeks left in her classroom, I will say that she is willing to entertain most notions about the text, even if they do differ from her own. Now on to the bad…Georgette often goes off on tangents that hardly relate to the class discussion only so she can show off her knowledge of an irrelevant detail of the text. This is fine, but boring and a bit egotistic. My biggest point of distress in this class is her grading. The woman is so out of her mind, clearly she does not understand that she is teaching FIRST YEARS. Georgette acts as if we're grad students writing incredibly important pieces, when in actuality her class is required and while I'm sure some people are enthusiastic about the course, almost all of us are also in at least three other classes. First-Year English simply is not at the top of our lists! Her grading is harsh, to say the least. I don't mean the actual grade, as I find she often gives better grades than her comments imply, but the comments themselves border on hurtful. She is the first to mark everything wrong with your essay, down to simple grammar mistakes, and hardly ever has anything positive to say about it. Once again, she is teaching first years, and this technique is simply not effective with those who are already self-conscious about their writing. First-Year English is meant to help Barnard students, and while I know that a certain amount of critical reading is important, there at least needs to be a positive side. I have never received a nice comment on my work from Professor Fleischer, and I am a fairly competent writer. I am a prospective English major, and I must say, Georgette has taken all of the fun out of this class for me. Now with that being said, it is possible to survive this class. The texts are enjoyable (at least I found them so) and the class discussions are usually helpful. There are only a total of three papers due, so if you put aside your feelings and possibly your hope for an A, you will be fine. I will say, I find it deplorable that Barnard chooses to stick Georgette with first years. I understand that a First-Year English teacher is basically as low as you can get, but it's unfair.\nWorkload:\nNot too bad. As long as you don't have to write an essay on a specific book, it's pretty easy to skip it and bullshit your way through the discussions. When it comes to paper time, though, best of luck!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 23, 2014",
            "review_content": "\nBefore taking this class I read all of the reviews on Professor Fleischer, and a lot of it is true. However, a lot of people are overly harsh due to the fact that Fleischer is a tough grader. Yes, a lot of people get a B or lower on their first essay, but it is very easy to do better. Like a lot of english teachers, she has her own opinions and grades accordingly. I am not condoning this but, since it is apparent in her class, there is no reason to try and go against her comments on your paper. \nAlso, one of the most helpful thing is GO TO HER OFFICE HOURS. Many people do not take advantage of this and, as a result, don't do as well as they might hope. If you're not willing to put in the time, then of course you won't see it in the results. Also, especially for her class, go to the writing center!! They can help with grammatical errors that Fleischer might not comment on in the first draft, as well as they can help redirect your essay if Fleischer basically tells you to rewrite it (Which will happen at least once). \nShe also gives extra credit points for participation. As long as you read the given readings it is really not hard to talk once or twice during a class period and get points- considering each is lead by a student and questions are given to start conversation.\nI also believe her essay system is great. You hand in your first draft to her and she hands it back with her thoughts on it. Then you rewrite it with an outline and have a peer review. *****If you do the peer review well she also gives you extra credit***** ( so do them well because they actually do boost your grade). She reads the outline AND AGAIN gives comments, which is very generous. Then you write it a third time and that is the one you hand in. She gives you a week between each draft- giving you many changes to go to her office hours, writing center, etc. Again, very generous.\nHonestly, if you're willing to listen to her criticism and ideas on your essay, then you will do fine. I enjoyed her class because I thought that she had some great ideas, and if you're willing to overlook the fact that she may give you a bad grade, she may not be that terrible of an academic teacher. We go to an academically challenging school and she is an academically challenging teacher. \nWorkload:\nA good number of books (a little excessive because we read most of them for a one day discussion), a provocation (one student leads the class discussion on a reading with a part of the text and 2 questions), two 3-4 pg papers, one 6-8 pg \"research paper\"\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "May 28, 2013",
            "review_content": "\nAs other reviewers have said, if you have Professor Fleischer, you probably have her for FYE/FYS and can't do anything about it.  Still, she's really not as bad as a lot of people make her out to be.  She can be quite boring, but she's generally a very nice and knowledgable professor.\nNow, before I mislead you into thinking she's just another mediocre professor, I should note that there's a big reason why people hate her with such vehemence - she is NOT an easy grader.  Her comments can be downright brutal and solid As on essays are exceptionally rare.  However, contrary to what other reviewers have said, I don't think her grading standards are unfair.  Yes, she's honest, she's a stickler about grammar, and she doesn't put up with BS, but she gives first-years a much-needed dose of reality (no, you're not a good writer just because you got an A+ in AP English) and definitely helps improve her students' writing.  \nEven though it can be tough to get good essay grades, it's pretty easy to get a good grade in the course as a whole.  She's definitely not like some of the newer FYS/FYE professors who missed the whole \"A-pluses don't exist in college\" memo and give good grades to anyone with a pulse, but as long as you're a fairly good writer and at least try to contribute to class discussions, you'll most likely do well.  Bonus points if you manage to get on Professor Fleischer's good side.\nWorkload:\nStandard amount of reading for an English course, one \"provocation\" (leading a class discussion), two short essays with two drafts each (the second draft typically requires substantial revision), and one longer research paper with multiple drafts.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 06, 2013",
            "review_content": "\nIf you are in her class now, don't read these reviews. There is nothing you can do, and reading them will only make you dislike her more. \nSince you don't have control over your First Year English prof, just accept your fate. Learn to take her criticism in papers. Do everything she says. Keep an open mind. Participate in discussion. If she likes you, you'll have an easier time. \nJust roll with it. I think everything else has already been said. \nWorkload:\nReadings, lead one class discussion (provocation), two essays w/ outlines, research paper w/ annotated bib and outline. \n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "January 01, 2013",
            "review_content": "\nProfessor Fleischer was one of the worst professors I've ever had. She waxes at length about irrelevant topics, runs class overtime, dismisses intelligent student comments in favor of her own views, grades absolutely unfairly and frankly dresses inappropriately. The best way to succeed in her class is to agree with/expand on her own professed ideas and take into account every one of her scrawled comments on your papers. \nWorry about grammar more than you have ever worried about it: your grade is primarily dependent on your sentence structure. Participate in discussion. Her comments on papers can sometimes be helpful and she certainly forces you to reexamine your writing; that being said, she doesn't read final drafts of papers in a fair-minded or intelligent way.\nWorkload:\n3 papers, some readings (not bad), one \"provocation\" (prompt based on the reading at the beginning of each class) by each student.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 22, 2011",
            "review_content": "\nBecause you don't have any control over First-Year English professors, there is no need for me to tell you why you shouldn't take this course (if you contemplating taking Professor Fleischer's Women and Culture FYS, CHOOSE A DIFFERENT TEACHER). \nProfesor Fleischer is, put plainly, a bad professor. She likes to listen to herself talk, and she fails to ask any provocative questions, leading to VERY boring discussions.\nThe best way to succeed in this course is to attend her office hours as often as you possibly can! She will claim to read and edit your first drafts of each essay, but her comments are illegible, and the ones that are legible are usually about grammar mistakes. She will not read for content when looking over your first draft, so it is up to you to go and speak with her during office hours to go over what she really thinks about the content of your essay. Make sure to ask her the right questions during office hours, otherwise she will advise you to \"go back and work more with the text.\" TAKE ALL OF HER ADVICE, even if you fundamentally disagree with it. She does not give grades based on your own creativity, but rather on how closely you stick to her interpretation of the text. \nOnce you talk with Professor Fleischer one-on-one, it is evident that she is a really nice, caring person, who is invested in her students. It's unfortunate that this doesn't translate into better teaching abilities.\nWorkload:\nA bunch of readings (it is completely unnecessary to do any readings that you aren't writing an essay on), 10% class discussion (even if you didn't do the reading, it is really easy to BS during discussion), 50% 2 five-page essays, 40% one 8-10 page research paper (be sure that she likes your research proposal and supplementary sources)\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "October 26, 2011",
            "review_content": "\nProfessor Fleischer's class is honestly the worst class that I have ever taken. Ignoring the pretentious comments that come out of your fellow freshmen's mouth who are trying far to hard, the class time itself is not the worst. However, the papers are simply a joke. The prompts are often poorly thought out and impossible to answer, at least in a way that she would choose to do so. She is horribly self-absorbed and will not accept any opinion other than her own. Also, she is horribly pretentious (a theme in Women and Culture) and refuses to use the word \"you.\" This applies not only to writing, but also to class discussions and in response to questions that are clearly looking for a \"you\" in response to a \"should I.\" Please give up hope for a decent grade or a hope to learn something upon entering the classroom. Her grades are unrealistic and her comments are unhelpful. You are likely to find feedback that has nothing to do with the topic you wrote about, but that everyone else got the same comment. Take care in the fact that you're all in it together. Avoid her at all costs. I have not left this class having learned anything, my grammar is no better than it was and I certainly have not learned anything about crafting an original argument and support my own opinion. Sorry if she's your problem next!\nWorkload:\nyou are never not writing some draft of a paper that you have probably written already multiple times. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "May 09, 2011",
            "review_content": "\nAvoid taking a course with her for reasons mentioned in other reviews.  HOWEVER you don't get much say in First-Year English professors, so here's a brief survival guide.\nHow to come out with an A:\nWrite ONLY opinions she would agree with.  With many professors, you need to generally slant your essay toward their opinions, but with Fleischer you must write such that she agrees 100% with all of your points.\nFollow ALL her suggestions from the first draft.\nWrite about things that seem to interest her.  If she doesn't like your ideas for a research prospectus, DO NOT attempt to salvage it.  Talk to her about what might be a better idea and do whatever she says.\nPut a lot of effort into the peer reviews.  You get extra credit.\nParticipate in class discussion.  Quality over quantity: the goal is to get her to like you.\nHow to learn some things despite having a terrible professor:\nThink of the course partly as an English Grammar intensive.  More than anything else, Fleischer can help improve the structure of your writing.\nDo the readings!  Most of the reading list is fantastic.  So many feminist mind-blown moments.  It's not necessary to get an A, but if you read some things besides your essay subjects, you'll learn.\nPay attention if she goes on a tangent about literary theory.  She knows her shit there.\nHow to maintain sanity:\nHave a good attitude.  Seriously.\nLearn to zone out inane comments from your peers, which Fleischer humors.  (But look like you're paying attention!)\n\nWorkload:\n2 papers of 3-4 pages each, 3 drafts of each (graded very harshly) = 50% of grade.  Research prospectus = 10% of grade.  Research essay of 6-8 pages = 25% of grade.  Class participation = 10%.  \"Provocation\" (lead one class discussion) = 5%.  You get an undisclosed amount of extra credit for doing thorough peer reviews, which I'd guess have a substantial impact.\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "April 27, 2011",
            "review_content": "\nThe real reason to not take any of her classes is because she is so closed minded that she refuses to accept any view but her own, which leads to a less than satisfactory learning environment. Although her comments on essays are somewhat useful and helped my writing structurally (she is a grammar nazi), if you don't regurgitate exactly what she thinks your thoughts should be, you won't get her stamp of approval.\nAlso, annoyingly, she writes using sharpie markers and requires you to print single-sided so that her comments, which are illegible anyway, don't bleed through. I wasted so much paper. \nWorkload:\n2 papers, about 4 pages, 2-3 drafts each, and a final research paper, 2-3 drafts, 6-8 pages. A lot of reading. 1 \"provocation,\" or a day when you are required to lead a discussion. \n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "January 02, 2011",
            "review_content": "\nAfter reading the reviews about Professor Fleischer, I was scared to take this class. I was not looking forward to it at all and I was prepared to hate her. However, after going to her during office hours and getting to know her, I realized she really wasn't that bad. Professor Fleischer pushed me to do well. I would rewrite drafts over and over again until I felt it was perfect. And, I guess that's what helped. She really like dramatic differences/changes from the first draft to the 3rd and final draft. Also, I would recommend going to her office hours and seeing what she wants. She definitely forced my writing to become more clear cut and cohesive. I honestly learned so much from her and am thankful for that. She's honestly not that bad. \nWorkload:\n3 papers (3 drafts for each one) \nPARTICIPATE IN DISCUSSIONS!!!! (that definitely helped boost people's grades)\n\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "December 27, 2010",
            "review_content": "\nAlthough her ideas weren't bad, we almost never stayed on topic and often wandered into discussions that were completely unrelated to the texts. This wouldn't have been a problem, except that in papers, Professor Fleischer basically just wants a regurgitation of her own ideas explained with perfect grammar. Although she said that she was really invested in helping us improve our writing, I know that my own did not improve at all. \nThe only way to improve your grades in the class is to meet with her as often as possible, which won't be as often as needed considering how busy she says she is. For the required meetings she holds after first drafts, she almost always runs late, and often spends the entire time picking apart one or two sentences that might not even be that important to your argument. \nI did well in the class, but that is only because I tried my best to figure out what she thought about the texts and just repeated it. Always follow the advice she gives you on earlier drafts or she will hold it against you when you hand in your final copy. \nWorkload:\nTypical, reading varied from week to week, sometimes it was less than 10 pages other times it was 50+. 3 essays with 3 drafts each, they comprise the vast majority of your grade. One provocation (selected passage and discussion questions) you can usually choose which reading you would like to do. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "October 06, 2010",
            "review_content": "\nGeorgette Fleischer has some strong reviews written about her. She's definitely one of those professors at Barnard. I got into her class and talked to a friend I knew who was a senior at the time but had Professor Fleischer for FYE her first year, and told me how sorry she was that I would have to go through that. Needless to say, I went into the class with the notion that I would be suffering twice a week for an hour and fifteen minutes.\nLet me just say that if you go into this class with that idea, it will probably be terrible for you. But if you try to be optimistic, you'll see that Professor Fleischer does care about her students and does want them to learn how to really \"engage with the text\" (her key phrase) and write a strong, well-organized essay. She teaches you how to critically read text in a way you never thought possible, and she helps you to reach simplicity and strength in your argument for your paper. \nNow, I'm not going to be too negative here, but Professor Fleischer is intimidating. For your first essay, she will likely try to tell you that your essay is terrible (she told me I needed to buy a dictionary) and you need to re-write it. She wants you to know that this is college and there is no more joking around. Go to her office hours, get an idea of what she wants you to say in your paper, and just do that. There is not a lot of room for independent thought, but she teaches you valuable lessons nonetheless. \nI was one of those girls that never got a B in high school, and I got a B+ in her class... I will say that I was really pleased with that grade after all my hard work. She's a tough grader.\nWorkload:\nA standard First-Year English class. A few papers, drafts for each, and reading that you really should do. \n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "August 22, 2010",
            "review_content": "\nI was thrilled to begin the first class with one of my favorite scenes from the bible, Genesis. It became clear after my first comment that my opinion and independent thought was not what was going to get me a good grade in this class. Fleischer does not have the ability to think from another's perspective or examine a statement that does not agree with her own theories. If you want a good grade in this class, regurgitate her thoughts. If you are an independent thinker, switch out. Besides being controlling and limiting in the classroom, Fleischer is also a grammar nazi and extremely strict about \"substantiating any statements made in an essay to prove a point\" even if the statement is \"the sky is blue.\" Be prepared to feel and act like a sheep. Meet with her often to understand what she's thinking, so you can write the essay she wants to read. \nWorkload:\nreadings, three essays (which she has you do 3 drafts each for), conferences for each essay and peer reviews. note: you cannot reuse literature for another essay i.e. if you write about wuthering heights in your second essay, you cannot use any part of it in your thrid essay. pick your essay topics wisely.\n"
        },
        {
            "course_name": "Topics in Comparative Literature: The Female Adventure Story",
            "review_date": "July 06, 2010",
            "review_content": "\nI have to disagree with most of what has been written about Professor Fleischer.  The one true piece is that she does want you to agree with her and is not always the MOST open to other opinions, but I found that the real issue is that, if you have do have other opinions, she is happy to acknowledge them as long as you back them up.  In papers, for example, she is happy to read opinions other than her own as long as you clearly cite the text and do a \"close reading,\" pulling your opinions from the text itself and not from something more abstract.  In class, she is delightful - facilitates a really interesting discussion, and is clearly quite brilliant herself.  She was very receptive to meeting outside of class, and is an incredibly kind and smart woman.  It took me a few weeks to get a handle on what she wanted, but i found (happily) that it was not an issue of agreeing with her, but rather backing up my own assertions with concrete evidence.  She is a hard professor, but I really enjoyed her class and would definitely take another one if offered.  Hope this helps!\nWorkload:\n4 books (2 very long) with one in-class writing about each on pretty easy-to-identify passages.  One 3-5 page paper and one 4-6 page paper.  One in-class exam consisting of short answers, passage identifications (and brief explanations), and one essay.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 11, 2009",
            "review_content": "\nFor much of the semester, she seemed like an intelligent enough woman to hold a decent discussion. This changed, however, when it became increasingly apparent that all Fleischer was concerned about was meticulous grammatical structures and her own opinions. While she seemed open during discussion, when it came time for the essay assignments, she only wanted to have her opinions regurgitated in the essays. It's really disappointing as a student to have that. Oh well, it's not the end of the world, but it was pretty much a let down at the end of the semester to get the \"thoughtless A minus\" the previous review talks about. Oh, and you may not even get that much - for some reason she likes to give people lower grades than they really deserve. I lucked out, but some of my friends didn't. \nWorkload:\nStandard for first year english - readings, three essays (which she has you do 3 drafts each for), conferences for each essay and peer reviews\n"
        },
        {
            "course_name": "Virginia Woolf and Her Contemporaries",
            "review_date": "June 23, 2009",
            "review_content": "\nAt some point during the semester Fleischer's elegance faded and I realized she knew little about literature other than things she read. When her arguments were clearly refuted, she cited irrelevant evidence to try to bolster them. Basically she wants you to parrot the opinions of the critics she's been told are good.\nWorkload:\nReasonably light, but her grading can be harsh. Meet with her to find out what she wants to hear and you can get a thoughtless A-.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "February 07, 2009",
            "review_content": "\nHands down, Fleishcher is the worst professor I've ever had.  When you write a paper, you're going to essentially be writing her paper, not your own, because she wants you to write her opinions, not yours.  So closed-minded and rude; she can make you feel badly about your work.  Try to avoid this woman at all costs.\nWorkload:\nTypical for first-year english.  nightly readings, a few papers.  very managable, since she leads the discussions by herself.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 28, 2007",
            "review_content": "\nProf Fleischer is unbearable. She is rude and unhelpful. The assignments are pretty standard for firt year english, but her grading is absurd. (And I'm not saying this because I got a bad grade. I got a pretty good grade. But I deserved a better one.) She honestly made me never want to take another English class ever again. \nShe is the absolute WORST teacher I've ever had.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 28, 2007",
            "review_content": "\nProf Fleischer is unbearable. She is rude and unhelpful. The assignments are pretty standard for firt year english, but her grading is absurd. (And I'm not saying this because I got a bad grade. I got a pretty good grade. But I deserved a better one.) She honestly made me never want to take another English class ever again. \nShe is the absolute WORST teacher I've ever had.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "May 14, 2006",
            "review_content": "\nProfessor Fleischer was not nearly as bad as some of the reviews make her out to be.  I have to admit, she was not one of my favorite professors, but once you get used to her obsession with grammar she is definitely bearable.  \nFor the first two essays, she gave us very specific questions to answer, rather than allowing us to organically come up with our own theories.  We were forced to come up with our theses within her very limited framework, which I have never been asked to do before in an English class.  Luckily, the rough drafts were ungraded, which definitely saved my grade.  She expected us to write three drafts of the essays, which was pretty ridiculous.  We also had to meet with her between drafts for all three essays, and she was not running on time for any of those meetings.  \nDespite all this, she was a fair grader and gave us many opportunities to work out the kinks in our drafts.   \nWorkload:\nThe regular amount of reading for a first year english, but you really don't have to do a lot of it.  Two 4-6 page papers (stay within the limit!), both of which you have to do several drafts of, and a 6-8 page research paper with drafts\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "April 26, 2006",
            "review_content": "\ni actually enjoyed this woman's class. she's nice, approachable, and seems really dedicated to her students. she offered many conferences for essay revisions, opportunities for extra credit (through peer reviews of each other's essay drafts), and was very helpful during individual facilitations. honestly, i think she's one of the nicest english professors here. unlike other professors, she shortened the number of pages required for our research paper to 6-8. i didn't get the vibe that she was close-minded. she never shot down anyone's opinions in class. i mean, if she did say something contrary to your opinion, she might've been trying to play devil's advocate in order to incite more discussion. i thought the class was pretty good. \nWorkload:\nvery manageable. \n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Fleischer is intelligent and seemed to be engaged in the works she was teaching. She has her own point of view and will voice it, but this does not mean that she opposes all views unlike her own. You can voice your own opinion and she will respect you if your point is supported through the text even if your opinion is not the same as her own. Unfortunately, some people in class try to throw back at her exactly what she says and this makes for some redundant discussion. As long as you read most of the assigned texts and come up with interesting theses for your papers, you'll do fine. \nWorkload:\n3 papers (ungraded first drafts of first two papers); possibly a little more reading than with other professors, but as long as you read most of the time it's fine; two mandatory conferences before final drafts of first two papers which are helpful if you've put effort into the first draft\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 01, 2006",
            "review_content": "\nProf. Fleischer is a really engaging and interesting professor to discuss the literary works with. She almost seemed interested in what she was talking about and was always ready to admit she was wrong when told she made a mistake in explaining some concept, especially about the Greek mythology. She made the class really engaging, and as long as you know what the book is about, you will be fine. However, she is a terrible grader. I don't know how other English teachers grade essays, but it seemed that Prof. Fleischer expected us to be professional writers. \nIt is impossible to get an A on your essay if you are in her class. Her conferences weren't helpful. When I had my first conference with her, I became completely scared of her because of the way she was looking at me, right into my eyes. Also during that conference, she told me to change my thesis statement to a completely difference one, but when I did that in my final draft, she said that my thesis statement did not answer the question I was triyng to answer. In brief, I have to say that Prof. Fleischer is a good teacher who has, however, too high expectations of us as writers and therefore makes it impossible to get an A in her class.\nWorkload:\nStandard - 3 essays. She changed some books we were supposed to read for this class - such as she changed the Odyssey to the Iliad and Hamlet to Othello, but I think that this change was great.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 23, 2005",
            "review_content": "\nafter reading the negative reviews about fleischer, i was scared shitless going into this class. honestly though, she's not bad at all. i looked forward to her class. the workload is pretty light too. she gives you the option to do drafts of your essays and peer reviews. i recommend you do them. they were quite helpful. also, the peer reviews you do for other people can boost your grade in the end. if you just listen to what she wants from your paper and do it, you'll do well. she's a very nice lady. very approachable and open to ideas in class. one of the nicest professors i've had. she's never put anyone's ideas down. i have to give her a lot of credit for trying to keep the class discussions going when there were awkward moments of silence. participation can boost your grade too. \nWorkload:\nreadings aren't that bad. not too long. 2 essays of 3-4 pages and 1 research paper of 6-8 pages (shorter than what other professors require)\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 19, 2005",
            "review_content": "\nProfessor Fleischer is nothing like some of the previous extremlely harsh reviews make her out to be. I went into the class having read all the bad reviews, and thats probably why I just didnt like her for the first half of the semester. Gradually, I snapped out of it and realized there was nothing at all horrible about her or the class. My guess is that the bad reviews are written by students who didnt get an \"A\" in the class. And honestly, you may not. \nFleisher is not one to hand out easy A's. You really have to work hard and write an excellent essay for an A. Still, grades can be improved my going to class, participating, and doing peer reivews. A meeting with her per paper helps you figure out what she is looking for. Im not sure where the belief that she only wants to read about what she thinks comes from, because she constantly urged us to make the essays our own. She is keen on grammar which I found useful and helpful. Judging from the reviews from past years, she really tries to cater the class to students needs, as several changes have been made from the days of 3 required drafts and grammar quizes. I found nothing rude about her. She was generally very pleasant, and accepting of everyone's views. My suggestion to get the most out of the class is to do the readings and participate in class discussions. I think this class is pretty much standard for First Year English- it wont change your life, but it its nowhere near unbearable. \nWorkload:\nTwo 3-4 page papers, one final 6-8 page research paper. \nAt least 2 drafts for each. One provocation. Readings. \nAttendence at Reinventing literary history lectures.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "September 07, 2005",
            "review_content": "\nI disagree with many of the negative reviews of Professor Fleischer. I had her for first year English and she was fine. It is true that she likes you to write her opinions in papers, but I hardly saw a problem with this. All you had to do was meet with her during the required office hour before a paper was do and then edit everything to match what she wanted. Knowing what she wanted made it easier to do better on the paper anyway. Some of the class discussions on the books we read were a bit tedious, but I found the rest generally interesting. As long as you keep up with the reading and work hard you should be fine.\nWorkload:\nTwo short papers (both 4 pages long) and one research paper (8 pages) Lots of reading.\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "April 12, 2005",
            "review_content": "\nFleischer is one of my favorite professors at Columbia and I'm sorry to say she is part-time so she cannot be my English academic advisor.   I am appalled at the other students' reviews.  For the entire semester she was very kind, open-\nminded, receptive, knowledgeable and interesting.  Class discussions were thought-provoking and her comments on papers were always constructive.   I looked forward to class every week and the readings she chose were fantastic.  She grades fairly and is always open to extensions as long as you ask ahead of time.  I loved my experience in her class.\nWorkload:\n5 3-4 page papers and an in-class oral presentation on a topic.  A lot of reading but it's a 4 credit class and well worth it.\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "April 11, 2005",
            "review_content": "\nGeorgette's really great.  She's got her ideas and doesn't take any shit.  She's totally respectful of her students' ideas and has never once tried to convince me that school is the most important thing in my life.  She does like to name drop, yes.  And she does parse sentences on the board and make people read aloud from papers, but she makes me work harder and better than I have since high school.  It's a good thing.  \nWorkload:\nRigourous...Riggerous?  I don't know how to spell it, but there's breadth and depth.  \n"
        },
        {
            "course_name": "Women and Culture II",
            "review_date": "March 19, 2005",
            "review_content": "\nI did not listen to the culpa reviews on this prof when I first read them. I thought everyone was being melodramatic and exaggerating about how much they hated Prof. Fleischer.  Believe me, every negative word ever said about her is true.  I will not repeat all of things that others have already said, but if you end up in her class do anything in your power to switch out. Not only is she a cruel, egotistical, and self righteous person, but I have not learned anything in her class on top of it!  I have always wanted to be a writer and English has always been my favorite subject and I do NOT like prof Fleischer. \nWorkload:\nAbout six milion drafts of every paper, which she will deconstruct then put back together in an order approved by her which hardly resembles the original, but you'll never get higher than a B+ on a paper no matter what.  I got a B on the first paper and Im pretty sure it was the highest in the class. Don't do the reading, don't spend time on the papers, it won't matter.\n"
        },
        {
            "course_name": "First Year Seminar: Legacy of the Mediterranean I",
            "review_date": "January 10, 2005",
            "review_content": "\nProfessor Fleischer is okay. I must confess that when I first met her, I hated her. My classmates would laugh after class while explaining to me how unhappy I looked and asking why did I roll my eyes so many times. But Fleischer definitely got better as time passed....and we took control of the class.\nAlthough many people found her to have a mono-optic view on the literature we read, Fleischer is not really so. If you give your point of view and can support it well, then she will agree with you...and if both sides of an argument can support it well, she'll agree with BOTH of you...and really, id rather she not take sides.\nI was constantly late for class but managed to pull a B+ anyway. She is a MAJOR stickler for grammar which was a complete piss off to me since we spent HALF of each class talking about the mistakes in various papers. And the paper did have to be written about a topic that she thought good, not the one you actually choose.\nBut otherwise, I think the problem with the class was due more to the fact that Legacy is a boring class with readings that I've done three times since fifth grade (i.e. The Odyssey) but if you interject your opinions and participate at least once every class, you'll do fine.\nAlso I give her props for taking over my class after Professor Baechler passed away. She was compassionate and did not complain.\nWorkload:\nabout 3 papers (keep them concise), reading which you don't REALLY have to do if other people are doing it (use spark.com, and a provocation (when you choose a passage from the reading to discuss in class and make up two questiona about it) -- overall, really easy....except when she thought we would actually read 200 pgs of Don Quixote in less than four days...yeah right!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 29, 2004",
            "review_content": "\nShe is a great teacher, obviously on the feminist side, likes grammar, very direct and grammatical writer. Gives every student an individual conference between first and second draft of every essay - listen to what she says in the conferences! If you incorporate her comments (exactly) into the essay and apply them to your future essays you will 1) do well on the essay you are currently writing and 2) she will notice what you have learned on future essays and commend you. If you aren't one to actually read the materials, make sure you read a few of them, especially the ones most people will not read, because class participation is a must (and a grade booster).\nWorkload:\nTwo essays and a final paper. Some peer reviews and class participation.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "November 16, 2004",
            "review_content": "\nIf you know what is good for you, stay away from this class! Like everyone else has already said.. 1) its a horrible class, 2) a horrible teacher. She's not so much scary as she is irritating. Everything you write is going to be torn apart and rearranged into her thoughts, her ideas, her views. It doesn't matter how long you work on your essay it just depends on what mood you catch her in when she's grading it. Grading is tough in this class, very tough. She also likes to have way too much control over the writing process. Do not take this class!!! I can't stress that more. If you want a flexible teacher who is open to new ideas and open to discussion, this is NOT fleischer.\nWorkload:\npapers, and thats it. i never do the reading, and u can get by class just fine without it.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "November 16, 2004",
            "review_content": "\nIf you know what is good for you, stay away from this class! Like everyone else has already said.. 1) its a horrible class, 2) a horrible teacher. She's not so much scary as she is irritating. Everything you write is going to be torn apart and rearranged into her thoughts, her ideas, her views. It doesn't matter how long you work on your essay it just depends on what mood you catch her in when she's grading it. Grading is tough in this class, very tough. She also likes to have way too much control over the writing process. Do not take this class!!! I can't stress that more. If you want a flexible teacher who is open to new ideas and open to discussion, this is NOT fleischer.\nWorkload:\npapers, and thats it. i never do the reading, and u can get by class just fine without it.\n"
        },
        {
            "course_name": "Virginia Woolf and Her Contemporaries",
            "review_date": "December 15, 2003",
            "review_content": "\nMaybe I caught Prof. Fleischer in one of her better moods, but I enjoyed my class with her quite a bit. The woman possesses encyclopedic knowledge of Virginia Woolf -- she's able to quote from memory everything Woolf wrote or said. Come on, that's impressive. The reading list she chose for this course was fabulous. I also found comments on papers to be constructive. True, she did tend to be a bit long-winded in class, but I never knew her to be rude or uninterested in what students had to say. All things considered, this was certainly not the most inspiring classroom experience, but it was an enjoyable one nonetheless. \nWorkload:\nLight, but bear in mind this was a summer course: midterm, 2 short papers, presentation, participation in discussion\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 07, 2003",
            "review_content": "\nReadings were pretty interesting. Professor is closed minded and heartless about deadlines.  Insists on her way and hardly open to diverse opinions. Horrible first semester experience\nWorkload:\nJust nasty\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "November 16, 2003",
            "review_content": "\nwhatever you do...DO NOT GET STUCK IN THIS CLASS. Fleischer was one of the most intolerable and rude teachers I have ever had. Although the workload was not to bad, she was certainly not an easy grader as our class surverys found very few people with higher than a B+ on their papers. Also, it is not possible to write a paper of your own ideas...anything you write will be crafted and directed by her own thoughts and opinions or else do not expect to pass. She does not give a *@#%^ what you have to say in class just what she has to say. The only good thing to come out of this was the much enjoyed laughter in recounting the latest horror tale of this first year seminar.\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "November 12, 2003",
            "review_content": "\nOK so fleischer is not the most inspirational and enearing proffesor possible but alot of these reviews are tottaly exagerated. She is very open to class discussion and let her students comment as much as they want. Although she certainly added her own opinion, she did not  condemn others views as some of the reviews said she does. Also, her office hours were always open and she gave much of her time to meeting with students to help them direct their paper topics. She was a fair grader and certainly was not unreasonable in her workload.\nWorkload:\n3 papers, fair reading. definately not bad!\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "October 30, 2003",
            "review_content": "\nVERY RUDE. if you're not going to say something in class-- make sure you're agreeing with her unless you want to spend the whole class period with her explaining to you why you are wrong and she is right. she provided no real insight on your papers, aside from the gramatics, avoid her if you can. \nWorkload:\nvery light\n"
        },
        {
            "course_name": "First year english",
            "review_date": "May 11, 2003",
            "review_content": "\nProf. Fleischer is, first of all, very passionate about english and cares deeply for the subject.  First year english was not the greatest experience of academia but it certainly wasn't unbearable, and I did well in the class.  She does tend to stifle opinions of others and take definite sides in class \"discussions\" - really more like arguments and it is quite hard and intimidating to agree with her if you are concerned about your grade.  Also, rudely, she berated anyone who dared to trail in a couple minutes behind her.  She has these note cards for each student and whenever someone came in late or didn't show without first emailing, she'd whip them out and put little checks or whatever on them.  So yes, she is particular about attendance to the point of being obnoxious. I think she may grade based on what she thinks of you as a person, but that may not be a fair assumption.  One more thing, she goes off on Ridiculous (with a capital R!) tangents for literally a half hour, no exagerration, when you get to modernism - just watch out for Virginia Woolfe and Gertrude Stein (yes, I'm afraid of Virginia Woolfe around her -sorry, had to stick that it).  But really she doesn't know when to stop; she definitely likes the sound of her own voice.  Ok, on a brighter note, she's passionate, interesting, fosters good discussions, and has these great things called oral discussion convocations (they sounds scary but they're not). Every class one student picks a passage from the reading and writes two questions about it and that's what we discuss the next day. It's really a great little thing because it gets everyone involved in the discussion and brings it to a peer level.  A lot of people were offended by the peer editing; I wasn't.  I figure we're all battling the same demon anyway. I don't think any first years were judging me, nor I them.  And usually it was helpful - sometimes not.\nWorkload:\nLight, usually 2 classes per novel; 1 per short story or series of poems or essay.\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "January 20, 2003",
            "review_content": "\nProf. Fleicher is rude and inconsiderate.  She insists that parts of students' papers be proofread in class, which, under any other circumstances, might be a fabulous opportunity for constructive criticism-- yet, instead, she insists that students butcher each other's writing style until the resulting text resembles something she would have written herself, sacrificing often very productive stylistic elements to assure that the comma falls before the quotation mark, but that the period goes after the page citation.  Her own editing comments are useless, stifling, and often somewhat limited to the grammatical, and the insigth she ofers into the reading material is bound to her most recent research project or another class she is teaching.  Also, in a class meant to foster discussion, she has a tendency to make a statement, then await responses, which are only to be taken up if they are in agreement with her own position.\nWorkload:\nfairly light reading, 3-4 papers, and a research paper of your choice\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "December 14, 2002",
            "review_content": "\nShe seemed cool at first--trendy clothes, hip glasses, lots of energy. But it did not take long to figure out that this prof was far more interested in herself and her own ideas to take the time to listen to what her students had to say. I got the feeling that if I did not agree with her, I was wrong. Although Prof. Fleischer made herself available in office hours, it was almost pointless to go as she was sure to not really listen to you. It was not a BAD class per se, and I do not regret having taken it. However, I would not recommend her to anyone who is opinionated, thinks for herself, and appreciates being heard out rather than cut off. One other thing--Prof. Fleischer likes to point out the shortcomings of your paper in a public arena, as in she has you write marked off sentences on the board and then asks the class how the sentence should have been written, as well as being sure to add how she would have written it herself.\nWorkload:\nfive 3-4 page papers which are sure to be graded harshly, plus tons of reading\n"
        },
        {
            "course_name": "College Composition II",
            "review_date": "May 22, 2002",
            "review_content": "\nI too was aghast early on in the semester. YEs she was unapproachable, rude and condescending. BTW ,this describes quite a few of the prof's . However, it's no diminishing returns here. Put in the work, engage in class (imp.) and show up at her office hrs once in a while and you'll 1- learn something 2- wind up w/ a decent grade. Once you get to know her she is quite a nice person and you could do much worse \nWorkload:\nLike all comp II lots of writing. Sound commnets but her handwritng is beyond bad\n"
        },
        {
            "course_name": "First year english",
            "review_date": "April 09, 2002",
            "review_content": "\nI didn't exactly love Prof. Fleischer's class but she is by far not as bad as all these reviews are making her out to be. Let's just say that I went into First Year English not expecting much and that was pretty much what I got. Fleischer is quite pretentious and sometimes abscent minded, but I did not find her to be rude or mean. She was willing to push back the due date of one of the papers and even brought clementines and cookies for out at the end of the semester. In general, I found that the class focused too much on grammar usage and was too open to just about any opinion (many of which were silly, irrelevant, obvious, or all three). Please do not list this class among your top choices, but if you get stuck with it anyway...don't worry, it won't kill you.\nWorkload:\nlight reader, 3 4-5 pg papers, 1 10pg research paper due at the end of the semester\n"
        },
        {
            "course_name": "College Composition I",
            "review_date": "March 27, 2002",
            "review_content": "\nUnless you are a professional brown-noser or ego-stroker, do not think you can get a fair grade from this woman. I honestly don't know how she is still teaching. I wish someone had warned me about her when I took her class freshman year - she's absolutely horrid. Once seen grading papers on Low steps about 5 min. before class. I think almost everyone in my class complained to the dept. about her, but somehow she's still around, so watch out.\nWorkload:\nIt's Comp. 1, so lots of papers, about 1 every other week, based on short readings. Basically regurgitation of Fleischer's opinions or get ready for a low grade.\n"
        },
        {
            "course_name": "College Composition II",
            "review_date": "March 13, 2002",
            "review_content": "\nNever ever, ever, ever take her class! She is rude, condescending, and an intellectual snob. She has nothing nice or important to say. Your writing will not improve in this class; you will only regress in ability. Her comments are not useful, and she's looking for mistakes instead of looking to understand your essay. She gives you CÂ’s when ever possible. She acts like teaching is a major burden. Her assignments make no sense and unless you make your thesis unbelievably simple she will tell you that you make no real argument. If you ask her to explain what she wants from the assignment she looks at you like youÂ’re an idiot for not understanding her gibberish then proceeds to explain in an esoteric and nonsensical way so you are more confused. This woman is stone cold and has no personal depth that would make her a good professor. She will make you hate writing.\nWorkload:\nAverage . . . but the emotional damage is not worth it . . . plus it is a gross waste of money\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "January 28, 2002",
            "review_content": "\navoid this woman at all costs. she can't teach plus she's ultra snotty and rude. watch out first years! don't get trapped in with this one!\nWorkload:\nwho cares?! she's so horrid it doesn't matter!\n"
        },
        {
            "course_name": "BC1201 STUDIES:LANGUAGE & LITERATURE",
            "review_date": "September 09, 2001",
            "review_content": "\nHell. She actually gives grammar quizzes. Her essays are idiotic, and her grading is arbitrary. She leaves entire classes believeing that they do not know how to write. She critiques essays in class, and largely just seems to make negative comments. Do not, under any circumstances, take her class.\nWorkload:\nModerate; none of the reading is actually neccessary, although some of it is quite good.\n"
        },
        {
            "course_name": "College Composition II",
            "review_date": "August 13, 2001",
            "review_content": "\nFleischer's teaching World Lit this fall--avoid her at all costs. Even if it's the only class that fits your schedule, it's not worth the boredom, stress and pain you encounter in that class. She has a way of killing the most beautiful works with her condescending demeanor, and she genuinely seems to want her students to fail. If you do take her class, though, make sure that your papers have a thesis clear enough for an idiot to understand it, because otherwise she'll tell you that your argument is weak and vague.\nWorkload:\nTen essays, midterm, final, provocation on an author. The class reads one of your papers and tears it apart as best possible. And she's a tough grader.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "August 06, 2001",
            "review_content": "\nProfessor Fleischer's class is based on criticizing students. One person presents an essay and everyone is responsible for saying why it's horrible. She is very unsympathetic, but warms up a little if you meet with her privately and show her that you really care about the class.\nWorkload:\nIt doesn't matter how much effort you put in-- she'll try to give you a C no matter what.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "April 22, 2001",
            "review_content": "\nProfessor Fleischer is probably the worst teacher I've ever had. She is an unkind person who is not on the students' side. She does not trust her students and usually assumes the worst. She is rude, insulting, unapproachable and basically unhelpful. Unless you are a masochist, never take a class with this woman.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "April 21, 2001",
            "review_content": "\nThis course was horrible! The classes were extremely boring. Her comments on papers were not helpful at all. She gave frequent grammar quizes that made me feel like I was back in elementary school! The essay topics she assigned made no sense. I would not recommend this class to anyone.\nWorkload:\nA normal amount of reading, provocations, grammar quizes, 2 papers and one big reseach paper.\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "April 21, 2001",
            "review_content": "\nThis course was horrible! The classes were extremely boring. Her comments on papers were not helpful at all. She gave frequent grammar quizes that made me feel like I was back in elementary school! The essay topics she assigned made no sense. I would not recommend this class to anyone.\nWorkload:\nA normal amount of reading, provocations, grammar quizes, 2 papers and one big reseach paper.\n"
        }
    ]
}