{
    "prof_info": [
        {
            "prof_name": "Julie Peters",
            "prof_id": 1856,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "EUROPEAN DRAMA, SPECTACLE, AND VISUAL CULTURE",
            "review_date": "May 02, 2016",
            "review_content": "\nProfessor Peters is a great professor!\nShe clearly prepares each seminar with so many notes ranging from historical context to theatrical history to a multitude of literary critiques. \nShe allows everyone to speak who wants to say something and has a way of guiding discussions such that most discussions are worthwhile. \nShe grades all the assignments fairly and gives a lot of feedback so that you know what you need to work on.\n\nWorkload:\nThree 750-word passage analysis, final acting project with 750-word response, final (2500-word) paper\n"
        },
        {
            "course_name": "Sexual Personae/Sexual Performance",
            "review_date": "December 12, 2013",
            "review_content": "\nProfessor Peters is, in nearly every way, as high quality of an instructor as one could ask for. She never misses class, always responds to emails promptly, provides excellent assignment feedback, and takes a strong interest in the insights of her students. Although she follows her own rules pretty strictly, she is sympathetic and doesn't penalize her students too harshly.\nThis particular course will probably have undergone some renovations by the time it is taught again, but at least for this semester, the basis of the course was a critical study of sex in Western literature. It isn't correct to call it a \"history of sexuality\" course, because the syllabus was as much about sex as an act as it was sex as gender, or sexuality as identity. The syllabus was incredibly broad, perhaps too much for some people's tastes, but considering the dearth of courses which attempt a survey of sex beyond more than one historical era, it is definitely a necessary course. In particular, the cross-generational studies of identity especially resonate in the context of the politicization of sexual orientation.\nEach class started with a 10-20 minute lecture/Q&A; session about the historical period of the literature that was assigned for the week, followed by 90 minutes of classroom discussion. There is a lot of emphasis placed on close-reading, so it really is important to do the readings to get the discussions, but participation isn't mandatory in most of the class sessions.\nI would recommend the course for anyone interested in gender and sexuality generally, but this isn't the kind of class that provides answers to historical or literary questions, and is in fact likely to raise more questions than answers.\nWorkload:\nApproximately 200 pages of reading per week, plus mandatory films towards the end of the syllabus. Occasional one-page reading responses. 10-12 page final paper with a required partial draft submission.\n"
        },
        {
            "course_name": "Drama, Film and the Law",
            "review_date": "December 13, 2004",
            "review_content": "\nNothing short of amazing!  Provocative, thoughtful, funny, compassionate.  She says things you wish you could own; she repackages confused, muddles comments into sheer brilliance.  A beautiful person, all around.  I have taken many incredible professors here, but I don;t think I shall ever be so fortunate again as this semester, when I had Prof. Peters to look forward to each week.  We built a great community in the class as well.  Only at the Biosphere had I ever seen university education achieve that.  She is magical.\nWorkload:\nModerate reading.  Final paper.  Must read--but its such a delight, none of us thought it a chore.\n"
        },
        {
            "course_name": "Renaissance Drama",
            "review_date": "February 14, 2004",
            "review_content": "\nPerhaps she is good in a seminar, but her lecture course was the worst English class I have ever taken. I am not an english major, but those of my friends who are thought that she was even worse than I did.  She seemed scared of the class, was the only one laughing at her own jokes, was the most boring lecturer I've had in any department, and most importantly, Professor Peters did not raise any interesting points in her lecture.  I have never disliked a class as much as this one.  Stay away.  There are too many good professors in the department to waste your time with this one (at least in a lecture format).\nWorkload:\nMidterm and Final.  Harshly graded.\n"
        },
        {
            "course_name": "Drama, Film and the Law",
            "review_date": "December 14, 2003",
            "review_content": "\nHands down the best class I have taken at Columbia (I'm a senior).  Professor Peters is brilliant, kind, thoughtful, funny...The reading is very carefully selected, extremely interesting, and put together so that the readings for each week speak to one another in unpredictable ways.  Professor Peters is always prepared for class, and keeps the seminar moving.  The discussion is always interesting, and she is intellectually fearless, always willing to ask us questions regardless of their implications.  She is also infinitely available by phone, e-mail and in her office, and is interested in her students and eager to help them.  She is genuinely interested in the course material, and genuinely interested in what her students have to say.  If you ever have the opportunity to take a seminar with her, you shouldn't think twice about it.\nWorkload:\nReading every week, and some movie-watching.  One terrific thing about the syllabus is that Professor Peters is very careful to assign only the parts of a reading that are genuinely necessary, so the amount of reading is always completely doable.  One 12-14 page paper at the end, on a topic of your choosing.\n"
        }
    ]
}