{
    "prof_info": [
        {
            "prof_name": "David Kagan",
            "prof_id": 3542,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "August 28, 2011",
            "review_content": "\nHere's what it boils down to: if you are lucky enough to be  automatically placed in David Kagan's Frontiers section, don't bother looking around culpa to see if there is anyone better. Stay in this section. If you aren't so lucky, try to elbow your way in with some major ssol wrestling. \nThis isn't because David is a behemoth of an authority in his field; he's still a bit young for that. But, with Brian Greene as his boss, he's certainly on the right track, and you'll catch glimmers of this whenever he's given the chance to talk about quantum physics. He may be green, but he is clearly just an extremely intelligent guy. Seriously, while you have the chance, probe him about his work. He will never bore you about the trajectories of nucleons and quarks; he seems far more concerned with the philosophical and worldly implications of physics (an interdisciplinary outlook that FroSci is trying to accomplish).\nApart from being hyper-smart and enthusiastic, he really is just a great teacher, given the context of the class. There's no denying it: the class is dull for the most part. But David does the best he can to make it bearable, and decidedly not difficult. He won't hold reticence during seminar against you when it comes to grading. As long as you show up and turn in the assignments, he'll treat you like his best friend. And if you don't, he'll still probably be extremely nice to you and not a harsh grader. Since he was not too long ago a Columbia student, he gets that you can't invest all of your time into this class, but he will do his very best to make sure you do well and get out of it as much as possible. Of particular note in this regard is his penchant for sending exceedingly long emails concerning the week's topic of discussion; you don't have to read them, but you're given the option to soak up his great breadth of knowledge. \nOverall, David is probably one of the best bets you will have as a Professor. He made a class I was dreading even when applying to Columbia not only tolerable, but surprisingly enjoyable.\nWorkload:\nWeekly lecture questions (count for participation), very few pop quizzes (these don't test your knowledge, but whether or not you went to lecture. he only gives these when he doesn't receive enough lecture questions), midterm, final, essay (essentially an analysis/summary of a scientific paper). The last three items are the most important, but he is a very fair (read: lenient) grader. The essay is not a big deal whatsoever. All you have to do is read the study (your choice), summarize it, and then opine on it a little. Virtually painless process. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 06, 2011",
            "review_content": "\nDavid himself, is pretty cool, although if you mine him closely for his own thoughts on science as a discipline, he views it as something that kind of replaces and supersedes the humanities, which is a bit scary. \nDavid tries to make seminars interesting, but sort of fails. Our class was 10 minutes of discussion, and 110 minutes of review of what we already learned in lecture, with a bit too much condescension for my taste (I knooooow that the [basic structure of dna] is hard to understand, but I want to help you), and I generally just found his upbeat attitude a mask to make up for the glaring lapses that constitute Fro Sci as a class. \nDavid, I can safely say, is better than ninety percent of the instructors of fro sci, but it's still just really difficult to make this class interesting. \nWorkload:\n1 WIA a week, 1 term paper, 1 midterm, 1 final \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 08, 2010",
            "review_content": "\nDavid is SO COOL! If you end up with him as your Frontiers Section leader, you're in for a treat. Classes begin with some random quote at the beginning of a Powerpoint that David *attempts* to link to the overall presentation. There are a few occasional quizzes on the lectures, but I found that our entire class was eager to attend the lectures because of David's obvious enthusiasm for the subject matter.\nIn-class discussions get to be quite interesting. He's extremely open to anything a student may want to present and more than willing to answer any questions in class, after class, via e-mail, or during appointments outside of class. David really gets the class to think about present issues not only from not only a scientific standpoint but also in philosophical standpoint.\nI highly recommend him.\nWorkload:\nOne \"problem set\" on the lecture per week (graded leniently). A few easy in-class quizzes. Midterm. Final. Not bad at all, although the questions can be a little ridiculous.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "June 26, 2009",
            "review_content": "\nSo I switched out of another section into David's due to a scheduling conflict and ended up missing the first session.\nI emailed him about it and he sent me a long email explaining everything he'd covered in the first seminar and his thoughts on what this course should help us accomplish by the end.\nI was quite surprised but that has been David's approach throughout this course. He is approachable, always willing to help out and really, really enthusiastic about whatever he is discussing (even when he may not agree with the lecturers or buy some hypotheses!)\nFrontiers of Science can be a real drag, but David made it a fun class.\nHe sought to encourage discussions about science and society, different ramifications of what we were studying and the open and critical thinking attitude necessary for studying what truly are the fringes and frontiers of science in this day and age.\nHis presentations were awesome (he'd add random classic rock songs, show us YouTube videos etc) and he made the in-class activities engaging.\nHe did comprehensive reviews for all the units, and put them up on Courseworks to help us review. He helped so much with anything and everything in this class!\nIf you get a chance to choose your Frontiers professor, I would definitely recommend David!\nWorkload:\nweekly problem sets (sometimes he chose not to grade them just discuss them), some reading off and on\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 31, 2008",
            "review_content": "\nFrontiers of Science is frontiers of science. There is no other explanation and its mandatory so suck it up and take it. It's not awful, especially with David Kagan. He's very amiable and accessible (by email and office hours) and extremely willing to help out if you ever have any questions. He often brings outside sources into the classroom which help to clarify material, and he always made sure to focus on the most difficult topics so as to iron out questions. The activities were occasionally a bit lame, but they always helped you to understand. This class reminded me a lot of high school science, with less focus on the technical aspects of science. Definitely a good teacher in this mash-up of a course. \nWorkload:\nOne homework due per discussion section, one midterm, and one final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 15, 2008",
            "review_content": "\nProf. Kagan was an amazing seminar leader and I was really happy with him. He is a really fun guy who loves science and makes it interesting. He is a fair grader and really reviews the material learned in lecture nicely. So much so that the lectures no longer became necessary to go to because he would do a fantastic job reviewing. I really really liked him and if you want a great guy, this is him!\nWorkload:\nmidterm, final, weekly problems\n"
        }
    ]
}