{
    "prof_info": [
        {
            "prof_name": "Mark Brown",
            "prof_id": 2531,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "February 01, 2017",
            "review_content": "\nI know what you are thinking: \"what the hell is going on in this class? Are these people around me understanding anything? Should I drop this class? But it is a requirement for my major.\" \nDon't worry, I am here to save you. What I can say about this class is that it is absolutely impossible to follow Mark Brown's slides during lecture. I used to take an average of 4 hours per slides presentation in order to have a good intuition about what was being taught (fully understand the slides is out of reach, at least for the mortals like me). It is no surprise that after the first two weeks only ten students were showing up to class. What I mean is that his slides are dense, and it takes time and patience in order to move through the material. Although there is a lot of proofs on them, you will not be asked to do any on the exams or homeworks. Your goal when reading the slides is to get the essentials about the material (ie the main formulas, underlying concepts, etc), not to fully understand each passage. Try to summarize the main points of each lecture after reading it. You will need that summary in order to study for the midterm and final. \nFrom my experience, I could understand reasonably well what was going on from lectures 1 to 8 (by studying the slides by myself, obviously. As I said, going to lectures is a waste of time). Those are the lectures that will be on the midterm. I did not read lectures 9 and 10 (they were dense examples above the material on lectures 1 to 8, kind of useless for the midterm, since the midterm exercises were a lot easier). I poorly understood lectures slides 11 to 20 (but still could get the main concepts and formulas) and I did even touch lecture slides 21 to 25.\nRegarding homework, there will be 4. They will be a lot easier when compared to understanding the slides. You will basically need to know the main concepts and try to apply it. Still, the homeworks are a lot harder than midterm and final. If you can understand the homework problems, that's a good sign. It means you understand the key concepts of the class.\nNow, the key to do well on the midterm and final is to have a good summary of the main concepts and formulas of the class. What you need to do in order to come up with a good summary is to understand the homework problems, understand the main ideas of lectures 1 to 8 and 11 to 20 and fully understand how to solve the practice midterm and final. The practice midterm and final probably taught me more than anything else in this class.\nFinally, I got an A in this class, even without touching 7/25 lectures slides. I am not telling you to do the same, I am just saying that you do not need to freak out if you do not fully understand the lectures or if the material gets impenetrable after lecture 21. \n\nWorkload:\nThe workload is average. Considering that you will spend an average of 4 hours reading the slides of each lecture in order to have a good intuition about the material, 8 hours per week is not that bad. There will be 4 homeworks, which will probably take from 6 to 12 hours each. \n"
        },
        {
            "course_name": "Intro to Probability and Statistics",
            "review_date": "December 11, 2016",
            "review_content": "\nA class of 131 students with less than 15 showing up every lecture, and you know how Professor Brown is. \nAvoid it.\nWorkload:\n4 homeworks EVERY SEMESTER! Yes, 4 for the entire semester.\nBut the thing is, his lecture does not help anything with the homework. You can only count on self-study the textbooks--not even his notes cuz they are totally different. \n\n"
        },
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "November 18, 2016",
            "review_content": "\nThis class will seem deceptively easy at first, but as the semester goes along the difficulty of the material increases drastically. Do not underestimate the materials! The lectures are dry but he presents plenty of examples to help you understand them. He also hosts help sessions where he shows you how to get the answers to the homework, if not show you the entire solution. \nHighly recommend you know your linear algebra, probability and calculus (absolute must). Grading will be separated between the undergrads and MS students so there will be two curves in the class based on this distinction. If only this had happened earlier...\nWorkload:\n4 homework -> difficulty ranges with the materials\nMidterm + final -> pick and choose 4 of 6 questions. Problems will vary greatly on subject but almost all of them will ask for the probability of an event, or the expected value or variance of some stochastic random variable. Predictable but not easy.\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "January 04, 2015",
            "review_content": "\nThere are few professors at Columbia which every student I have talked to dislikes, at Mark Brown manages to be one of them. This class is not actually very difficult, nor does it move fast, so it is probably best for you to learn from the textbook (which isn't amazing but not horrible) rather than go to class. The best option is to read the textbook and then supplement it with class, but if you do go to class (like I did), you should, at minimum, skim the textbook, or you will be horribly lost. Professor Brown gives little context for what he is doing. He does not tell you what he is trying to prove (which makes following proofs difficult since you have no idea where he is headed) and he rarely explains the conceptual nuance of what is going on. He also spends almost all his time in class proving things whereas, apart from the Extra Credit on the final exam, every exam and homework question is an application question, which means understanding the proofs is of little to no help in tackling the homeworks or exams. \nApart from his inability to explain concepts, Mark Brown rarely pays attention to his students. He is 50/50 with being able to understand student questions, he rarely responds to email (and if he does, he is rude), and he doesn't return homework in a timely manner (we got a homework due in October returned on the last day of class). \nOverall, the material covered in this class is not difficult, and there is not a lot of it either. Even though this was, by far, my lowest workload class, it was the one I complained about the most because going to class with Professor Brown is a truly painful experience. If you learn the material on your own, and make sure you understand the concepts behind what's going on, this class won't be a high workload, nor will it be hugely difficult. Professor Brown provides a fairly generous curve, but given that most people take this class because it is a pre-requisite for other things, I would recommend taking this with another professor so that you truly understand the material. \nFor sake of disclosure, I got an A+ in his class, so I think it is fair to say that my unfavorable review of Professor Brown is not due to my grade. He is the worst professor I have encountered at Columbia, and from what I hear, that Statistics department is fairly notorious for having bad professors. \nWorkload:\n4 Homework Assignments. Yes, only 4. They aren't very long. (25%)\nMidterm Exam. Very Easy (25%)\nFinal Exam. Moderate to Easy. Harder than Midterm. (50%)\n"
        },
        {
            "course_name": "Stochastic Processes: Applications I",
            "review_date": "September 04, 2013",
            "review_content": "\nProfessor Brown is very helpful.  His notes are life safer!   the problem sets he gives would clear up most of the confusion you got in class.  His lectures can be little dull at times, and sometimes he goes really fast.  But the materials in this class is so hard that I really can't see how much better a lecture can get.\nBottomland is I know Prof Brown would be there when I have questions, and answer my questions patiently with respect ( unlike some other senior individuals in the faculty).  So I'm very satisfied with the education I got from this course.  \n\nWorkload:\nIt can get pretty heavy if you try to understand every single bit.  But problem set every week.  Standard midterm and final exams\n"
        },
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "January 17, 2012",
            "review_content": "\nMost reviewers give an accurate sense of this course. I just wanted to add some advice on taking the course--\nFor the problem sets, Brown will often have \"help sessions.\" Go to these. He basically goes through the entire problem set and does them. I missed the first two, and then was kind of shocked to see him seemingly give away all the answers in the later two. Immensely useful in bringing down the work in the course.\nFinal and midterm were of the \"pick and choose\" format. For the midterm, something like 7 questions are given and you pick 4. Don't remember exact numbers, and he may change this. So if you don't have a ton of time to study, you can cram for just a few sections. For the midterm, I just learned all of the Markov chains questions really well and ended up with an okay grade.\nTo reiterate what others have said: Brown is a very dry lecturer. The main things to know in the course are Markov chains and Exponential Variables / Poisson processes. Everything is built off of one of these two concepts, so just understand these and you'll be fine.\nWorkload:\nModerate work for problem sets (much less if you attend help sessions). If you're strategic on final and midterm, not much work.\n"
        },
        {
            "course_name": "Stochastic Processes: Applications I",
            "review_date": "December 09, 2010",
            "review_content": "\nThis is not an easy class.  It can seem deceptively easy at the beginning: if you're any good at linear algebra, then finite Markov Chains are no sweat.  By the final weeks of the course, though, when you hit stochastic integration, expect to be tearing your hair out.  Maybe there's no way to understand stochastic integration without knowing measure theory (and I didn't when I took this course), but there's no getting around the fact that the topic could easily be given its own semester long course.\nDespite the inherent difficulty of the material, Professor Brown definitely makes it much more manageable.  In particular, there doesn't yet seem to exist a very good textbook for a course in stochastic processes, so Professor Brown's handwritten notes are the real gem of the course: they provide a thorough and rigorous textbook equivalent.  To this day, I keep a printed copy of his notes on hand whenever I want to loop up a concept that I learned in this course.  In the end: a difficult, but very rewarding experience.\nWorkload:\nModerate.  A very hard midterm and hard final that are both generously scaled.  There are 4 problem sets during the course of the semester.  These are not easy at all, but the Prof. and TA will help you a lot if you go to office hours.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "July 19, 2009",
            "review_content": "\nYeah, like the other reviews say Brown is a boring guy who has difficulty relating to his students and seems oblivious to the class while he lectures, but he gave more opportunities to learn the material and do well than any professor I had in college.  He keeps things straight forward, solving examples in the textbook and letting us know what he expected us to do on tests.  This is a problem solving course, and you mostly learn the material by working through the notes he posts online and doing the hw.  And if you're struggling, he solves the hw problems for you in recitation the day before they are due.  There is also a huge curve.  \nThe second half of the class is harder than the first and you have to know calculus well, but that's it.  Despite what some other students say, this is not a hard class.  If you earned your place here you won't have trouble with it.  \n"
        },
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "May 17, 2008",
            "review_content": "\nThis was an interesting class.  What you get out of it is entirely a function of what you put in.  Lecture is incredibly dry, granted, but the real gold is the posted notes and practice problems.\nStochastic processes are incredibly wonderful things.  I've never though so coherently before about series of random processes, but this communicates the subject well.  \nWhat's really required here:  You need to sit down with the book and the lecture notes and the problem sets and think about Markov chains and Poisson processes on a gut level.  Everything else in the course is just an extension or generalization of this.  \nBecome familiar with limit theorems, with the expected values of many distributions and how they relate (for example, the sum of exponentials is just a gamma-- the quotient of two gammas is a beta.  etc).  There's more than enough practice material to fully ace the exams, there are no tricks on them.\nDr. Brown is a wonderful man, but he injects a formalism into the course that's not needed for the problem sets (that you can do from the book) and is only tangentially needed for the exams (order statistics aren't mentioned in the book, but if you're smart enough, you'll be able to figure out the conditional expectations for the ordering of exponential distributions).\nWorkload:\nFour problem sets, will probably take you a few nights to nail.  One midterm and one final.  I thought the midterm was more difficult, but I didn't prepare for it adequately--  go through all the practice problems and make sure you can nail them and understand what each step is.  This is the exact practice you need for the exams.  \n"
        },
        {
            "course_name": "Probability",
            "review_date": "January 07, 2007",
            "review_content": "\nProf. Brown is an extremely nice person in person, although his lecture style can be a bit intimidating.  Unless you've already familiarized yourself with the material he's lecturing on, you'll often have a tough time following him in class.  The key to passing his class, is to go to his homework sessions where he'll show you how to do any homework problems you're stuck on.  He's extremely patient and is willing to go over a problem until you understand it.\nThis is not an easy course, you've got to put in some time to do well.  The exams, mercifully, allow you to choose from a number of problems to work.  For instance, the final exam had 20 problems, but you had to answer only 8.  That's a help, though, even so, you might have a hard time finding 8 you can answer.\nAll in all, I found Prof. Brown very likeable, and I did learn some probability, although I don't think there's much he can do to make this course a pleasant experience.\nWorkload:\nbi-weekly problem sets, one midterm, final.\n"
        },
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "May 08, 2006",
            "review_content": "\nNot a very impressive professor, as he is usually completely oblivious to his students. You can be in the first row with your hand raised, and he would just stare right past you and never call on you. Lectures are quite dry and quasi-mathematically rigorous, so it may be easy to fall behind occasionally. Otherwise, the subject matter is interesting and rewarding. I don't know how it is different from 4106 or 3106 though. It doesn't seem to be much higher in level. I think the previous reviewer did a good job scaring off most people, but it's not that bad. \nWorkload:\n5 problem sets, about 5-6 hours each. easy midterm. harder final. \n"
        },
        {
            "course_name": "Elementary Stochastic Processes",
            "review_date": "May 12, 2005",
            "review_content": "\nHoly freakin bejeezus.\n.\n.\n.\n.\n.\n.\nBe not fooled by the word \"Elementary\" in this course's title.  This is THE hardest class in Columbia, without qualification.  Ever.  I can't believe I made it out alive.  Unfortunately for Mark, the subject material is perhaps the hardest branch of statistics, in terms of intuition and concepts.  He tries very very hard to make sense of it to us, but hopelessly so.  No mistake, I think Mark would have been a decent teacher in another class.  But in general, I think he's on a totally different level than the rest of the class.  Problems seem easy when he solves them, but come homework, there is no way students would be able to complete them without his hints.\nI don't want to scare any potential stat majors, but the mean on the midterm was around 30 or 40.  If you can't handle the heat of this course (which is actually graduate level) then take the much easier undergraduate engineering version.  However, if you have the mathematical maturity and persistence to learn everything that is taught, then the world is yours -- just kidding, but it's still very interesting stuff.\nWorkload:\nBiweekly problem sets, nearly impossible midterm and final.  Godspeed.\n"
        }
    ]
}