{
    "prof_info": [
        {
            "prof_name": "Christina Matone",
            "prof_id": 3143,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Classical Myth",
            "review_date": "November 12, 2011",
            "review_content": "\nClassical Mythology\nI enjoyed this class and suggest to those interested in mythology to take it. At one point, this class was taught by two professors - one from the classics department and the other from the art department - and the class had an art component that was more than just tossing slides up on the projector and reading the captions. I was frustrated that the class even wasted time with this. One time the Professor asked what the slide was depicting and I answered - and she wanted to know how I knew the answer. It was written on the slide itself...I don't think she ever looked at the slides that she was putting up or had any information about the historical context of the objects depicted. \nThe tests were interesting in that we had a bunch of characters to identify along with some essays - the interesting thing is that if you missed the one minor character that happened to appear in a given work - you could be sure that was the one that was making it on to the test - and it missing one ID like that was worth 10 points. I think on the first exam the entire class ended up missing the same question.\nRegarding her teaching style - Professor Matone pretends that the class is interactive in the sense that she asks questions. Feel free to sit and wait through the awkward sliences as tries to engage students who clearly did not read the material in time for the class discussion - I'm sure it was read right before the tests. I would rather if she just spewed the material up onto the board so we did not have to pretend that we were really discussing the work when all she was doing was spewing the material anyway. \nI am not sure about her office hours - but she is pretty disengaged. I think she must have about 10,000 unread items in her email box because I sent a few which were never acknowledged or even answered. \nI ended up doing well in the class NOT because of her teaching style or the class \"discussions\" about the material. I ended up doing well because I actually read the material. If you are interested in the subject and you will actually read the material - it's an easy A.\nWorkload:\n10 books - some with multiple plays.\n2 tests.\n2 papers. \n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "May 18, 2010",
            "review_content": "\nI took Latin I with Professor Matone in the Spring.  She's a delightful person - very friendly, young, energetic, and very understanding to students' needs.  There is a wide range of Latin ability in the class but I think she manages it well.  \nHer tests were more difficult than I expected.. just make sure to have ALL vocabulary and verb + noun forms memorized.  Latin isn't one of those subjects where you can just pull an all-nighter before the exam and do well - you have to acquire translating abilities gradually over time - so it is MUCH better to study a little bit of grammar + vocab daily than to try to cram in everything the night before the test.\nReading Latin is like reading music.  The more you see, the easier gets.  \nI reiterate - review daily and go to class everyday and it will not be difficult to do well.  \nWorkload:\nShe doesn't assign too much homework.. nonetheless, A LOT of studying is required, especially if you've never seen any Latin before.  The class moves VERY quickly. 2 midterms (20% each) and a final (40%).  The remaining 20% is class participation, attendance, and quizzes - an easy 20% as long as you go to class everyday.\n"
        },
        {
            "course_name": "Intermediate Latin I",
            "review_date": "January 19, 2009",
            "review_content": "\nProfessor Matone is an unnecessarily difficult grader for a required course. Like the above reviewer said, grades are based on two elements alone, significantly decreasing the chances for success. Admittedly the class boasts a particularly wide range of student ability, but I think Professor Matone does a particularly poor job of taking that into account.\nWorkload:\n1 large midterm, 1 large final, sporadic in-class quizzes meant only to gauge personal progress\n"
        },
        {
            "course_name": "Intermediate Latin I",
            "review_date": "June 27, 2008",
            "review_content": "\nThe least painful of fourth-semester Latin experiences, Matone's class's greatest blessing is the same as its greatest curse: she doesn't grade homework, nor does she call on people randomly like some perverse law-school seminar; half of your grade is determined by the midterm, the other half by the final.  This means you can simply come to class with a Perseus-purloined translation and do nothing for two hours a week, twice a week.  (Not showing up will earn you guilt trips that worsen as your absences accumulate, so it's worth it up to a point.)  The time passes slowly in the purgatory of the seminar-room - Christina is very kind and well-meaning, if a little prissy and awkward in the mode of a middle-school duenna - but productive uses abound: the Classics Department is flush with cash, its fridge festooned with food, and its library contains several volumes of Catullus in translation, which contrast favorably as reading material with the fare of raw Livy and Ovid that comprises 1202's syllabus.\nOnce the two tests do roll around, studying your ass off is more than sufficient to excel far and beyond your wildest expectations, and even if you blow the midterm a good grade on the final will earn you deliverance.  I came out of 1020, a little embarrassingly, with an A+, even after not really learning anything.  My anti-intellectual approach to the material, though it was kind of invited by the grading structure, was emblematic of the worst of Columbia, but it's a requirement, so who cares?  If I did this well after a three-year Latin hiatus and then getting into the class based on prior knowledge of the placement exam, surely anyone else can too.  Recommended, as if you had a choice.\n\nWorkload:\nTwo months of boredom followed by two days of frenzied studying.  Rinse, repeat.\n"
        },
        {
            "course_name": "Elementary Hindi I, Elementary Hindi II, Intermediate Hindi I",
            "review_date": "January 09, 2007",
            "review_content": "\nProfessor Matone is amazing!  She makes Latin interesting & totally painless.  At the elementary level, she expects you to learn a lot of grammar on your own time & gives daily quizzes, but she does not give massive amount of homework.  In Intermediate, you are expected to do the translations but not to hand in.  She reinforces grammar by asking identification questions for homework & periodic quizzes.  Her exams are intense, but you will probably be pleasantly surprised by the grade you receive.  She is also very good-natured & nice.  Take Latin with her & you will have a great time.  \nWorkload:\nElementary I: daily grammar/vocab quizzes; short grammar/translation assignments; 3 midterms; 1 final\nElementary II: daily grammar/vocab quizzes; grammar/translation assignments; 2 midterms; 1 final\nIntermediate I: daily translations (not handed-in); a handful grammar identifications for hw based on the translations for much of the semester; 1 midterm; 1 final based on the previous translations\n"
        }
    ]
}