{
    "prof_info": [
        {
            "prof_name": "Andrew Millis",
            "prof_id": 1522,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 05, 2012",
            "review_content": "\nMillis doesn't know how to teach. Period. He made things I understood in high school utterly incomprehensible. Most of the lectures were spent deriving useless formulae that were specific to the problem at hand. He'd go over problems in class and come up with wildly complex 'general' solutions that contained only variables he'd define along the way. So what this means is that you'll be spending most of your time in class copying down random equations that will make no sense to you when you look over your notes again.\nHomework is difficult. Many people did the problem sets in groups, but I foolishly chose to do them on my own, so I spent an average of maybe 3-4 hours per week on them. The problems are similar to what will end up on the midterms and the final, so make sure you understand how to do them. P-sets are given out on Thursday lectures, and are due the following Thursday, and chances are you and your friends will be cramming/finishing uncompleted problems from the week before. Most people end up with near perfect scores on the problem sets (which account for 20% of your grade), so you need to be getting 95+% on them to stay ahead of the curve.\nThe good thing, though, is that Millis is a generous grader. I did above average on the two midterms (each accounting for 20%), got a 95 on the problem sets (20%), probably bombed the final (40%) seeing as I left out an entire question on special relativity (till now, still don't get it), but still managed an A. Don't think I got much out of this class though. Easily the worst class of my first semester.\nWorkload:\nWeekly problem sets (7-9 problems), 2 midterms and a final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 03, 2011",
            "review_content": "\nThis man needs a lesson in teaching. This is the kind of guy who, if you ask what time it is, he tells you how to build a watch. He wastes away the first two lectures discussing dimensional analysis (which if you don't know that and you're in this course, you should be put to sleep), which leads to him running out of time towards the end of the semester when it comes to explaining more important things (relativity, harmonic motion, rotational motion). \nIf you took Physics C: Mechanics, you'll be fine. But be warned that this guy's lectures were so bad that I frequently found myself wondering if stabbing my eye with a pen would ease the pain of watching him babble in front of class. \nBig plus, however, is he curves BIG time. I got a 40 on the first midterm, (average was a 60), a 90 on the second, and bombed the final and still managed a B+.\n\nWorkload:\nHomework is REALLY annoying sometimes. Work in groups. 20%\n2 midterms (20% each)\nFinal (40%) \n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 28, 2010",
            "review_content": "\nHis class was my most difficult my first semester of my first year, and many of my peers dropped to the 1400 physics class after the first midterm. During class he goes through concepts very quickly in a fashion unsuited for amateur physicists and often does not have time to go over many (if any) examples that mirror the homework. Awkward during office hours.\nThe two midterms are only manageable because of partial credit. Some of the problems on the homework the TA cannot even complete. This class, however, is probably much easier for those who have done well in physics in the recent past (AP Physics C in high school).\nWorkload:\nProblem sets once a week take multiple hours if truly understood and not simply copying from TA at recitation or friends. Also, textbook not on cramster\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "January 07, 2004",
            "review_content": "\n  Prof. Millis is one of the worst profs that I have ever had.  In class he frequently makes mistakes on the board.  I couldn't even use my notes to study for the final exam because they were so full of mistakes!  He also has an awful habit of erasing equations immediately after writing them.  You would think that the obvious distress of the class when he does this would be enough to make him stop, but he keeps right on doing it.  He also has a habit of using notation different from the book which is confusing.  The homeworks are incredibly long, but don't try to start on them too early because half the time they are full of mistakes that he corrects by email.  Each homework includes an incredibly worthless Mathematica section that takes hours and doesn't help you learn the material at all.  If you manage to understand the material on the homeworks the tests are hard but not impossible.  If you plan to take this class start looking into alternate text books early because Griffiths is horrible.\nWorkload:\nInsanely long homework assignments (kiss your other classes goodbye), with idiotic mathematica sections.  One reasonable midterm and a final.\n"
        },
        {
            "course_name": "Quantum Mechanics I",
            "review_date": "March 10, 2003",
            "review_content": "\nI was very frustrated by this class.  Granted, it's hard stuff to learn (much less do problems on), but Millis did nothing to facilitate it whatsoever.  He made several mistakes which he spent far too long trying to recover from, ended up wasting class time, and would even come to the next class with the real derivation, spending even more time belaboring an example I could follow ten times more clearly in the textbook.  Also, he had a terrible habit of erasing entire equations immediately after writing them, replacing them with the next step and making it impossible to copy anything down, especially when you're dealing with spherical coordinate Schrodinger Equations with five greek letters and partial derivatives all over the place .  He called it \"algebra by erasure\" but I call it terrible teaching.  I came out of the class with such a remedial understanding of quantum mechanics that I was prepared to take it again next semester, but guess what--he's teaching it.  If you already know a lot of the material and are prepared for an awkwardly-paced, often confusing coverage just to strengthen your understanding, I suppose he wouldn't be so bad, but I honestly could not deal with him and do not recommend you find out for yourself, because you might not realize his faults until it's too late.\nWorkload:\nRelatively difficult weekly problem sets that don't always relate to the material covered in class or the textbook.   Also, he has no flexibility if you don't finish it on time.  The exams weren't so bad after the curve, and I definitely deserved worse than a B- (what I got), but overall this class is plain hard.\n"
        }
    ]
}