{
    "prof_info": [
        {
            "prof_name": "Marianne Hirsch",
            "prof_id": 2424,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Feminist Texts II",
            "review_date": "May 10, 2007",
            "review_content": "\nI have mixed feelings about my experience in this class. On the one hand, I found the student-led discussion format to be really frustrating. Class discussion was mostly dominated by a few students who always spoke and then there were some students who rarely said anythingÂ… and I think we would've gained more had Prof. Hirsch taken a more active role in leading the discussion (or if she had even lectured a bit more). As it was, I never knew what to take notes on and I often left class with a headache. On the other hand, the reading assignments for this class were really fascinating. Some of them were dense and it was a LOT of work to get through them all (a lot of pages), but I really felt the material was worthwhile, interesting, and eye-opening. Prof. Hirsch was not very good about replying to emails promptly and sometimes her responses to questions I'd email were not very helpful. I definitely think she was intelligent, experienced, and passionate about women's issues... but I don't think she was the best instructor (mainly because I would've preferred that she do more speaking in class). She was also somewhat intimidating although I did go to her office hours a few times and she was a little warmer one-on-one than she appears in class, but it's hard to work up the nerve to approach her. She is more helpful in office hours than by email. I also wish she would've provided more feedback on the weekly 1-page postings we had to write (she only returned two of them the whole semester and the comments were brief and there was no letter grade on them). I pretty much have no clue what grade I'll be getting in her class because the whole semester has passed and we only got one grade back (for our \"position paper\"). The class was a good experience, but it was more because of the well-chosen readings than because of Hirsch's teaching style. I would take another class taught by her, but I wouldnÂ’t rush to do so. I would, however, strongly recommend taking Fem Texts II (perhaps with another prof) for the sake of the reading list aloneÂ—the texts you'll cover are excellent. \nWorkload:\na ton of reading (several hundred pages per week), a weekly 1-page paper posted to courseworks, class discussion/participation, a 4-page \"position paper\" (written with a partner if you want to work with somebody else), planning/leading class discussion one day (with a partner), a 12-page final paper\n"
        },
        {
            "course_name": "Thesis",
            "review_date": "May 19, 2006",
            "review_content": "\nI was incredibly lucky to work with Prof. Hirsch on my thesis - she's brilliant and was completely invested in helping me develop an interesting project. She also was very willing to teach me (both on the theorists I ended up using, and on academic research and writing in general) and always made herself available, above and beyond my expectations. Plus, she's just a really nice person. I can't say enough great things about her - she adds a really great dimension to the department, and is a great resource for students interested in areas as diverse as women's studies, photography, and Holocaust studies.\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "April 04, 2005",
            "review_content": "\nHonestly, this class changed my life. Granted I already had a strong interest in the topic, but even if you don't I promise you will get so much out of this course. \nThe readings were great, although the load was pretty heavy. The class was taught by Hirsch and Allison Wylie, as well as two TAs, and each of them lead a discussion section. Comparisons among students led most of us to believe that the grading style varied among them. Hirsch was my section leader, and I think she was the hardest grader (she is also a comp lit prof). However, I felt her high expectations encouraged those of us in her section to step up (or at least I felt that way!). Discussion sections were rewarding and extremely helpful because the class was large and there was little time for discussion. Overall, an amazing class, and Hirsch is a great prof. \nWorkload:\nheavy reading load and weekly reading analyses, 6-8 pg paper on feminist autobiography, media file (eight 1 paragraph entries and 3 pg paper), take home final that is not bad at all\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "January 17, 2005",
            "review_content": "\nTAKE THIS CLASS!!  I can't emphasize this enough.  I loved this class.  The choice of readings is especiall excellent.  While there is focus on standard gender issues, the texts go much further and examin other relevent issues such as race and class.  This class is team taught and the organization is a little so-\nso.  That would be only grip with the class and it's minor.  So I remind you: TAKE THIS CLASS!!\nWorkload:\nHard but worth it.  Lots of reading and one page response due each week at discussion. 6-7 page paper on a feminist autobiography.  Media file project which asks you to critique gender roles in the media.  Take-home final.\n"
        }
    ]
}