{
    "prof_info": [
        {
            "prof_name": "Daniel Lee",
            "prof_id": 10734,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2011",
            "review_content": "\nProfessor Lee is definitely an extremely knowledgeable professor. He was constantly explaining Greek and Latin terms and illustrating connections to current law to help us understand the books more comprehensively. His method of queueing class discussion (having everyone interested in responding to a comment raise their hand and then calling on each in turn) I found to be a bit annoying, because by the time the conversation got to you, it had totally changed subject and you'd forgotten what you were going to say. However, he would respond passionately and intelligently to every point directed at him, and would always do his best to keep conversation on topic, which could be rather difficult in a class full of jackasses constantly tooting their own horns. Although he was rather inflexible with deadlines (I asked for an extension on my first paper, he gave me 24 hours and an explanation of why he wasn't going to grant one again), he did his best to be fair and reasonable, which he was.\nHis grading is also very fair. I received the grade I expected on all my papers within a +/-, and his comments were very direct, albeit all in a paragraph assessment (as opposed to in the margins). For a very subjective class, he certainly made an effort to objectify everything as much as possible. For the final, he provided a comprehensive study guide that had everything we needed to know on it, as well as providing multiple options for all the sections (there wasn't a single part of it where we were required to answer everything).\nBottom line: If you want to get a lot out of CC, especially on the historical and legal side of things, take his class. \nWorkload:\n3 essays, 6-8 pages, double spaced, graded fairly. No midterm. Pretty easy final. Optional weekly response.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 15, 2010",
            "review_content": "\nI initally wasn't sure how I felt about Professor Lee, but I ended up really liking him. He's very good at engaging the class in discussions and encouraging participation. He's extremely intelligent, very knowledgeable about the texts, and was able to really clarify difficult concepts for us. He was interested in student opinions and wanted us all to understand the texts. That said, I would same sometimes his weakness was encouraging almost TOO much participation. Sometimes you just want to hear the professor impart his wisdom instead of hearing what a bunch of college sophomores think. That aside, he was a great teacher and I was really pleased.\nProfessor Lee graded more harshly than I expected, but while I was initially resentful, I took it as a challenge and I'm glad that I did. He really pushed us to go beyond surface-level analysis and REALLY engage the texts and understand the authors' intents. I appreciate this about him. On the first paper he handed back to me, there were comments all over the place. While most of them were telling me what I had done wrong, I was glad that he was actually paying very close attention to each of my arguments. This was both intimdiating and exciting at the same time, and definitely refreshing after too many classes of getting an 'A' on the top without any explanation. In this respsect, he realy encouraged us to learn deeply, and learn from our own mistakes.\nThis was a tough course but I recommend it. Prof Lee is a good teacher who expects a lot from you. If you're up for it, you'll be rewarded. \nWorkload:\nThree papers. One final. Optional weekly email responses.\n"
        }
    ]
}