{
    "prof_info": [
        {
            "prof_name": "Jarvis McInnis",
            "prof_id": 12369,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "SOUNDSCAPES-20TH C AFR-AM LIT",
            "review_date": "August 19, 2013",
            "review_content": "\nHe won't respond to your emails about simple and important questions regarding the course, even though you knew he definitely saw it after a few days. \nHe won't post the one sentence discussion topic early (by early I mean, give the students a couple days, nop) --always the night before it's due. Even though he'll repetitively promised he will. The week discussion is due on Monday night, he always post it on Sunday evening. most students have full time work, and I happened to have a class all day on Monday until 10pm. Not just that, sometime he'll ask you to respond to Thursday's class all of a sudden, even though it's still Monday. \n\nHe likes to give you tons of readings, much much more than he'll even be able to cover in class. One week we had a 350 pages of book and a dense, hard 30 pages of review to read. \nHe never posted his syllabus. The summer class started on Tue which is when we were handed the syllabus for the first and the only time and he was expecting you to read a book (200 pages) and a couple other reviews by Thursday. Right. \nHe's not being transparent and lazy as hell. We were kept in dark from the beginning until over a month after the last class for everything we did in class, from the how the assignments and presentations are graded to the relative standing among peers. \nThere were only seven 8 to 10 pages double spaced paper to grade in the end. It takes a 3rd grader two hours to read every words. He waited 5 weeks to grade them and that's only when we reached out to him. It's ironic because he said we, as students, should not be surprised by 160 pages of reading a day. \nHe's late a few times too. \nEnough of evidence showing how much damn he gives to you as a student. He said it's because of he work full time job. Well, most instructors I knew work full time, so did 5/7 students in his class. My art hum instructor have 4 jobs. No excuse.\nYou'll probably think to yourself, he care so little about students, maybe the class is very relaxing? Nop.\nDespite already set a heavy syllabus, he gave out additional readings on a whim and then didn't talk about it at all. \nAnother example:The final paper requires 3 secondary sources on the syllabus to be used. However, what i was writing about really had only 1 secondary source provided on the syllabus. I reached out to him in advance, he said email him what I would like to use. I did. No replies until a few days prior to the due date. So I wrote my paper. Then he emailed me and said, use this two book as your secondary. First of all, that's way too late. Secondly, the two source that he wanted me to use as secondary were actually Primary sources. Fluff! \ntl; dr: Unreasonably and painstakingly picky and strict about what you should be doing. Extremely non-responsive and non-responsible when it comes to what he, as an instructor, should be doing. \n\nWorkload:\nheavy. Despite it's a summer class, it shouldn't take 2 full days a week from my life. \n"
        }
    ]
}