{
    "prof_info": [
        {
            "prof_name": "Robert Guay",
            "prof_id": 2642,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Nietzsche (Seminar)",
            "review_date": "January 08, 2006",
            "review_content": "\n     Robery Guay is young, clever, sharp, and energetic. He's also got a good sense of humor. The Nietzsche seminar involved a lot of monologues, which was a problem. Monologues, escpecially frequent ones from students and/or teachers regardless of how many impressive concepts are strung together, are not engaging.\n     The reading course covered 2 Nietzsche books (Daybreak, and Beyond Good and Evil). The course was desgined to produce one research paper with short, relevant assignments to aid the reaserch for the final paper. The organization of the assignments was appropriate and Guay's guidleines for the final paper were unusually comprehensible. Guay was also cool, very understanding outside of class  with everyone i talked to, not to mention extremely charming and approachable. In fact, one GS student in our class is beside himself to recommend Prof. Guay for a teaching award and has contacted the whole senior seminar (after the semester's end) by email to encourage us all to make additional nominations. \n    Bottom line, the former review was very unflattering and incomplete. Robery Guay is new, he is knowledgeable, bright, understanding, dynamic, and open-minded. He can teach you a lot if you ask, and are willing to listen for the response. He also scheduled 2 of our classes as full guest-lectures by prominent Nietzsche scholars. \nWorkload:\nvery reasonable: 3/4 short assignments and 1 major paper\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "November 07, 2005",
            "review_content": "\nAt the first class during shopping period, Professor Guay charmed me with his good looks and low-key sense of humor. However, the class turned out to be very disappointing. I went into the class thinking that we'd have cool, existential discussions about morality and the meaning of life. Instead, all that ever happens in class is a lengththy explanation, maybe with a short discussion, of the text we read overnight. Nothing else. It gets boring really fast. There are frequent reading quizzes, but they're designed so that you can't hurt your grade unless you're an class-cutting idiot who never does your homework. Papers are really scary, but if you do exactly what it asks for, you're guaranteed an A. Bottom line: an easy class, but not an enjoyable one.\nWorkload:\nnormal\n"
        }
    ]
}