{
    "prof_info": [
        {
            "prof_name": "Matthew Carnes",
            "prof_id": 2298,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 03, 2005",
            "review_content": "\nI thinked that Matt sucked.  While he may be intelligent and know lots about chemistry, he does not convey this.  I begin to wonder how in the hell is he a TA.  His recitation sessions consists of rambling and more rambling.  His recitation section was almost pointless.  \nWorkload:\nNormal.  He wants the recitation work to be as hard as possible.  One problem per session.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 20, 2005",
            "review_content": "\nMatt is hands down the WORST TA I have ever had at Columbia. His lectures are disorganized, he knows shit about organic chemistry (one time he wanted to show us how to synthesize crystal meth only to forget exactly what crystal meth looks like), and he is one confusing individual. I actually stopped attending recitation after a couple of weeks because his explainations would always contradict Prof. Nuckolls and Matt was always totally clueless about what we were even doing in lecture because his ass was never in lecture! And he randomly grades problem sets and quizzes, you could miss one step of a mechanism or a synthesis and he wouldn't even give partial credit. Stay away from any recitation or class that Matt maybe be teaching because he's a poor teacher, can barely explain concepts and will just confuse the hell out of you. \n"
        },
        {
            "course_name": "Organic Chemistry Lab",
            "review_date": "December 22, 2004",
            "review_content": "\nHe doesnt know much about chemistry.  He does ok in lab, but he tastes a lot of the chemicals.  He makes rude comments and ib my opinion doesnt grade fairly between genders.  I found him to be rather ridiculous and hard to understand.\nWorkload:\nOK\n"
        }
    ]
}