{
    "prof_info": [
        {
            "prof_name": "Boris Gasparov",
            "prof_id": 550,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 23, 2010",
            "review_content": "\nI took two courses with Prof. Gasparov: Introduction to Linguistics, and Discourse Analysis.  He is both brilliant and a phenomenal pedagogue.  While I would have liked the intro course to be more technical, Prof. Gasparov gave a wonderful overview of the field.  In Discourse Analysis, we analyzed different philosophies of discourse: class was a mix of very clear explanations in a lecture style and discussion.  For each philosophy, we had a practicum in which we would apply the theory by analyzing some language sample (writing or speech).  \nWorkload:\nDiscourse Analysis: one practical analysis through the lens of a theory per week, midterm and final both done at home by e-mail but with a time limit.\n"
        },
        {
            "course_name": "Cognitive Linguistics",
            "review_date": "January 17, 2009",
            "review_content": "\nProfessor Gasparov is everything you would have hoped for. Brilliant, well-spoken, but never intimidating. The course has a definite ideological bent, but that's sort of the point-- you get enough Chomskyan linguistics elsewhere (psych, CS, intro to linguistics), so this class provides a useful contrast. \nWorkload:\nEasy for a 4000-level course. One article reading per class (20 pages or so), but participation/attendance isn't actually graded. There was a two-page response paper once or twice when he couldn't make it to class.\nMidterm is a 5-page report on a book from a list, final was 3 2-page essays.\nAn absolute joy.\n\n"
        },
        {
            "course_name": "Semantics",
            "review_date": "December 08, 2007",
            "review_content": "\nI signed up for this class on a whim, and I am so glad that I decided to stay with it.\nThe syllabus was very well organized to give a clear overview of the history of semantics, and the other students were all very into the subject. The best part of the class, though, was the professor. Though the readings were minimal, he used his lectures to put them into context with so much clarity, knowledge and wit that the course was more enlightening than some I've taken with five times as much reading. His lectures are funny and engaging - I loved just sitting back and listening to him relate his own experiences in linguistics circles in the 1960s, his time in Berkeley, his return to Russia, etc. A quarter of my notes are just quotations of his that I couldn't resist writing down. (It's particularly fun to listen to him talk about Chomskyans.)\nI never found his accent a challenge (though you might want to sit near the front of the room), and his English was virtually perfect, so I don't know why people seem to have a problem with it. He talked with the confidence and depth you imagine from a real old-school professor, the type I came to Columbia to learn from.\nOn top of his knowledge and subtle humor, he is a kind and fair professor. He responded to student questions patiently, and he clearly enjoys teaching. You will not regret taking a class with Professor Gasparov, so if you have the chance to do so, take it.\nWorkload:\nReading was one or two articles a week, essential to understanding the lectures. A midterm paper (a book review) and a final paper (a short research paper). Occasional casual written excercises.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 13, 2006",
            "review_content": "\nBoris is a really smart guy. The stuff he says can be truly profound and inspiring, if you can understand him. He's got a thick Russian accent and grammar that is so precise that he often constructs his sentences in ways that no native speaker would ever do. English is his worst language- of course, I think he speaks about 10 other languages. He talks about 90% of the class, sometimes going on tangents about hippies in communist Russia and once he spent an hour doing a thorough review of world history, for some unknown reason. He is also a pretty easy grader. That's why I liked this class; he was brilliant and required less work than most other Lit Hum professors.\nWorkload:\nReadings, midterm final and two 3-4 page papers. Cake walk. Like high school but more intellectual.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "December 16, 2003",
            "review_content": "\nGreat course to take.  Prof. Gasparov is tremendously knowledgable and nice.  Though there was a lot of reading, it wasn't necessary to do it all, and the reader and textbook are interesting enough to get you to do at least some.  \nDisregard the previous review dissing Prof. Gasparov's knowledge of English.  Yes, he has a strong accent, but I never found him unintelligble.  Also, he explained in class that he had consciously chosen to retain his accent when he came to the US to keep the \"educated foreigner\" persona rather than just sounding like he talked strangely.  The man is a linguist; he knows language.  You won't have problems with his examples.\nWorkload:\nReally light.  Occasional homework (probably not factored into the final grade), midterm, final (both take-home).  midterm was extremely easy and quick.  final was less so, but still significantly easier than other finals.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "November 27, 2003",
            "review_content": "\nLuckily, this course counts for nothing but blank credits- no majors, no distribution requirements, nothing (as far as I know).  This means everyone taking the class will actually be INTERESTED in the subject.\nBecause of this, discussions are usually worthwhile.  Okay, so sometimes Dr. Gasparov does let students go on a little too long in their own lectures.  The subjects lends itself to anecdotes about second cousins, friends of friends, and that girl in the mall who talks funny.  But every now and then, the ramblings do have an interesting point.  And in a class so based on discussion, how can this be completely avoided?\nThe material:  No, it doesn't go very deeply into any particular topic.  It's an intro course.  It's an excellent survey of historic and current work in the field, the readings are relevant and interesting.  I suppose the class is more teaching about the field and study of linguistics than preparing you to do your own research.  \nIt's refreshing to take a course purely for enjoyment.  The homework and tests were pretty easy, but I get the idea that your grade isn't the point of the course.\nAnd it is enjoyable.  Dr. Gasparov's often really funny, and he's done so many amazing things; his stories are actually entertaining and have to do with the course.\nAll in all, a great class if you like linguistics.  If you're taking a really hard semester and want a class you won't have to worry about and cram for, but will still get a lot out of, I recommend this one.\nWorkload:\nThe reading was sometimes a little bit dense for an intro course, but it seems like a lot of the students have prior exposure to linguistics, so maybe it was fine for them.  And Dr. Gasparov usually devotes two sessions to each subject: one to give you a brief overview so that you'll understand what you're reading, and then the second class, after reading, for in depth discussion.  Midterm and homeworks were easy.  The class occasionally assumes knowledge of some foreign languages (in general; you never need to know a specific language).  Sporadic homework- for the first few weeks, it's weekly, but tapers off as the material gets less short assignment-friendly.  It's okay to miss class once in a while if you have to, but if you don't ever go to class, why are you taking the course?  The discussions are worth it.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "January 18, 2003",
            "review_content": "\nthis class is a mess. gasparov doesn't have a native understanding of english so he can't really give examples of any of the concepts we study, which results in the class trying to provide examples and the professor trying to determine whether they are appropriate, not really knowing. gasparov lets all the obnoxious know-it-alls in class voice their ideas, but the class is really too big for this sort of thing. and the material is covered so rapidly that you learn only the most obvious, intuitive things from each topic. i really discourage anyone from taking this class. buy a textbook and teach yourself. if you ARE in this class, don't bother to attend lectures. i have never been glad i've attended one.\nWorkload:\nvery very light. weekly handouts/assignments that seem to be extremely optional. an in-class midterm that's very easy if you flipped through the assigned chapters. a take-home final that's a little more difficult but still doable without having gone to class.\n"
        },
        {
            "course_name": "Intro to Linguistics",
            "review_date": "August 06, 2002",
            "review_content": "\nWhat can I say? It's great that there's at least one linguistics course in Columbia. But due to the \"introductory\" nature of the course, you'll go through a whirlwind tour of the various fields of the subject, and come out without a real grip on any of the concepts. As long as you accept that, this is a great course to take. Classes are dicussion sessions rather than lectures (i.e. not much to be learnt) but you'll probably be among intelligent company. There will be boring stretches, but Prof Gasparov's anecdotes are very amusing, and he's accessible during office hours. \nWorkload:\nThere are deep and abstruse readings (from original sources, usually) which the good professor will not check that you have read. Aside from that, my class got a take-home midterm and final rather less difficult than a lit hum essay. Period. \n"
        },
        {
            "course_name": "Russian Lit: The Avant Garde and Revolution",
            "review_date": "May 05, 2002",
            "review_content": "\nProffessor Gasparov is a very nice man, but the syllabus for this class is really unenlightening and the class discussions don't exist. This class was a huge disapointment. We never spoke about the works themselves, only minor points or issues around the works. The music and film element is so minor it could not exist either,\nWorkload:\nnot terrible\n"
        },
        {
            "course_name": "Russian Lit: The Avant Garde and Revolution",
            "review_date": "May 05, 2002",
            "review_content": "\nProffessor Gasparov is a very nice man, but the syllabus for this class is really unenlightening and the class discussions don't exist. This class was a huge disapointment. We never spoke about the works themselves, only minor points or issues around the works. The music and film element is so minor it could not exist either,\nWorkload:\nnot terrible\n"
        }
    ]
}