{
    "prof_info": [
        {
            "prof_name": "Huckleberry Hodge",
            "prof_id": 2267,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "February 04, 2006",
            "review_content": "\nI have to say I completely disagree with the last reviewer's statement.  Huck was a very capable instructor and he was very open to helping people outside of class.  He even let me write an extra credit essay which really helped my grade and he met with me several times to revise and improve my paper.  If you are really interested in the subject and want to learn something, take his class.  If you just want an easy class that you can skip and still get an A then don't.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 04, 2006",
            "review_content": "\nI have to say I completely disagree with the last reviewer's statement.  Huck was a very capable instructor and he was very open to helping people outside of class.  He even let me write an extra credit essay which really helped my grade and he met with me several times to revise and improve my paper.  If you are really interested in the subject and want to learn something, take his class.  If you just want an easy class that you can skip and still get an A then don't.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 06, 2005",
            "review_content": "\nI thought this class was great.  He really knows his stuff and was able to make connections to all sorts of things you wouldn't have thought of without being overly academic.   He's really flexible about when you turn things in even though it doesn't say that on the syllabus.  I learned a lot in this class.\nWorkload:\nPretty easy...a couple of papers quizzes and midterm/final.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 16, 2004",
            "review_content": "\nOverall, nice guy, a little on the quirky side. He has a really strange sense of humor and has a tendency to talk at the ground or into the sky. Each class had a general topic (eg. \"Today we'll talk about Wagner\") but tended to go off on all sorts of tangents. Big on the history, thought, and culture surrounding music. Also big on German words for musical things. Tries to teach music in an un-music way, but it doesn't actually work out because he tends to use music jargon and to really understand what he's saying you have to have some music theory background. He's a composer, so expect a skew in the syllabus towards 20th century music. Reading from the book is not necessary although helpful, class notes are what he tests you on.\nWorkload:\nMinimal. 2 concert reports, 1 midterm, 1 final 3-4 quizzes throughout the semester, usually on what he says in class or on handouts. \n"
        }
    ]
}