{
    "prof_info": [
        {
            "prof_name": "Mario Bellati",
            "prof_id": 105,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 02, 2007",
            "review_content": "\nWhat's with all the Mario-bashing? I love this guy; he's friendly, kind of funny, and easy. If you have a busy schedule but need to get through the language requirement, Mario's class is simply a godsend. First, day-to-day work is minimal, and most classes are just spent talking about your weekend, watching a video, or reciting Dante (not the most fun, but it's 3 lines a week, so it's very manageable). Second, Mario tells in detail what each quiz will be like (and the final could only help our grades, although I'm still not sure why). Third, grading is unbelievably easy; some of my answers were blatantly wrong, and he didn't mark me down. Fourth, he is sort of strict about attendance, but he even started to forget about that as the semester wore on (I missed a couple times more is than technically allowed). Essentially, this class is usually a pleasure, if only because it is so laid-back. Just show up with a smile and enjoy a lesiurely semester. As long as you don't call Mario's bluff, he won't call yours. (However, if you really want to learn about the grammar and nuances of the language, I'd look elsewhere.)\nWorkload:\nCompositions, and that's about it (seriously). He sometimes randomly assigns pages from the workbook, but he only skims those on quiz days to make sure they're completed. Quizzes occur every now and then, but they're so easy that I eventually stopped studying. There is also Dante, which was not my favorite thing to memorize, but it's relatively pain-free. Oh, how I will miss not doing work...\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 02, 2005",
            "review_content": "\nWhile a wonderful character when you're on his good side, Mario may not be the best choice for students trying to learn the ins and outs of Italian grammar.  His classes tend to be scattered and often confusing if one isnt  already proficient in Italian, and would be best described as a crash course in grammar and  Italian culture.  Be warned: Mario tends to play favorites, and if you're on his good side, you can get away with murder.  If not,...well, then you might not enjoy the class as much..  A helpful hint: attendance is important to Bellati, as his the weekly Dante memorizations.  This man takes his Dante seriously.   If you can get this two things down, you should be set.\nOverall, I really enjoyed this class, and really recommend him as a teacher.  While the first paragraph might scare you off, he's really quite a wonderful person, and he tries to teach you more than just the textbook grammar.  He's a bit eccentric, which really made my first class of the day worth getting up for, and class is rarely boring.  Take this class if you're confident (and paid attention the first 2 semesters) in Italian, but need to brush up on the basics.   Otherwise,  if you need hardcore help and structure, look elsewhere.\nWorkload:\nSame for all italian classes: couple of compositions throughout the semester (2-4, depending), quiz every two weeks or  so (that are usually easy, and he tells you exactly what to study), three lines of Dante to be memorized every week (this is by far the most important for Bellati), and one in class presentation.  Midterm and Final Exam, but both are pretty easy if you study what you're told.  \n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "December 05, 2004",
            "review_content": "\nAs much as I agree with the previous reviewer about Bellati's many inadequacies as a teacher, I also get the feeling that the reviewer's homophobic side got the better of him while writing the review. Yes, Mario will sometimes give the guys a little extra attention, but as a guy who took his class, I can say with certainty that he's not a \"creep\" though not a good teacher\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "November 10, 2004",
            "review_content": "\nWhere do I begin?  First off, he likes to spend most of his time talking about what he'd like to do instead of doing it.  Most time is spent listening to him talk about things unrelated to the class at hand or teaching italian.  If you're looking to breeze by in italian... this is your class!  If you're looking to actually LEARN Italian, avoid this class.\nSecond... he's a frist class creep.  I have experienced first hand his inappropriate behavior.  If you are a guy... you may want to try taking another course where you don't risk being subjected to his inappropriate attempts at checking you out or making inappropriate comments to you inside and outside the class-- or worse yet, when he tries finding ways to touch you while you're doing work.  It was a nauseating experience, and one I wish I hadn't been subjected to.  Why is the Italian department STILL employing a man who can't control his sexual appetite, and worse yet... can't teach! The females, oddly enough, either loved him (becuase he was so \"sweet\" to them) or hated him (because they didn't kiss up to him).  If you can avoid his classes, then do so-- and if you can't avoid his classes-- then don't take Italian at all since he'll most likely ruin the experience for you one way or another.\nWorkload:\nMidterm and final that are made up / approved by the department -- relatively easy if you studied alot (considering there was no teaching being done in class).  Homework load was mild--- excercises from the book-- and oh yeah-- memorizing Dante in medieval italian.  \n"
        },
        {
            "course_name": "Intermediate II",
            "review_date": "May 02, 2004",
            "review_content": "\nI cannot begin to express how dissapointed I am with the classes I took with Prof. Bellati. Disorganized, unhelpful, and obnoxious are just a few of the words that come to mind when thinking of this class. Every student I spoke with agreed that it was a living hell four times a week, and none of us got anything out of it. He grades too nicely at times to compensate for the fact that he doesn't teach, and even though I got an A-, there were several kids in the class that did not do well at all. I was actually warned against taking Prof.Bellati and I took his class becasue nothing else fit into my schedule. What a mistake.  He may be a decent enough guy, but he's a horrible teacher, and the class is by far the worst I've ever taken in my life, either here, or in high school.\nWorkload:\nNormal for a langauge class, except you have to teach yourself everything because Prof. Bellati doesn't teach. That gets old fast...\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "April 13, 2004",
            "review_content": "\n     I wonder how this man came to teach at Columbia. I suppose he must have some talent, an expertise in Italian literature perhaps, but he is by far the absolute worst teacher I have ever had in any subject. Now, for the record, I'm getting an A, so it's not that I'm bitter about my grade. I'm bitter that after working as hard as I did to get into Columbia, I would have to sit in a class four times a week, listening to Prof. Bellati speak about whatever comes into his head, and then teach myself Italian at home. I thought we were supposed to have the best of the best teaching here. Bellati emphatically proves this wrong. \n     One of the things that upset me the most is his assertion that he \"teaches to the test.\" First off, this isn't a good way to teach anything, especially not a language Â–teachers are accused of something that he openly admits to. Secondly, he doesn't even do that well -he consistently attempts to teach the class something he has never so much as mentioned in the last ten minutes of a class and then puts it on a quiz  the next day. \n     Prof. BellatiÂ’s assignment of homework is simply ridiculous. He is completely inconstant in every way. He will assign 15 exercises one night, and nothing for the three nights after. More than half of the exercises he assigns he will forget about and never go over. Disorganized and incompetent are the only words that describe his teaching.\n    I know this review is getting long, but I couldnÂ’t write about Prof. Bellati without mentioning Dante Â–in possibly the worst teaching tactic ever, Prof. Bellati insists that you memorize a section of DanteÂ’s Inferno, citing that it will help your pronunciation and you will be able to Â“impress your friends with your Dante.Â” By forcing students to memorize it, the focus of what could be a half-decent exercise, shifts from pronunciation to remembering the words. ItÂ’s a huge waste of time.\n    Prof. Bellati is a decent guy Â–just a very, very incompetent and obnoxious teacher. Be prepared to waste your time with this confusing, irritating, and disorganized man.\nWorkload:\nFairly normal, very erratic, often pointless\n"
        },
        {
            "course_name": "Intermediate 1",
            "review_date": "December 15, 2003",
            "review_content": "\nSKETCHISSIMO!  is the only word that i can think to describe Mario.  He needs to actually teach and let students speak, but other than that, he really doesn't suck that much.   He is basically a nice guy, but i think he is more suited to an adult education course rather than teaching undergrads.  He is supportive of his students, and I can't fault him as an unfair grader, but a little more instruction would come in handy.    \nWorkload:\nniente\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "November 28, 2002",
            "review_content": "\nWhere do I even begin to talk about how bitter I am that I got Mario for Intermediate 1? I had the lovely, vivacious, funfunfun Emily Altman for my first two semesters, and I suppose anyone after her would be a letdown, but Mario plumbed depths I never knew could exist. He turned my overflowing love for the language into... well, total apathy. I can't be arsed about class anymore. All we ever do when we show up is listen to HIM talk. In English half the time, to boot. And he doesn't TEACH, ever. He expects you to know the material, and is incapable of explaining anything that's unclear, and yells at students who don't get it. \"You have been making the same mistake all semester!\" Er, yes - perhaps because you have not yet succeeded in explaining the problem? He doesn't teach us - what he does is make us memorise Dante. Apparently this is supposed to help us magically speak Italian in some way. I have to say, I don't see how - would making a kid who started learning English a year ago memorise \"Whither 'tis nobler to suffer the slings and arrows of outrageous fortune\" have any purpose? As it is, I don't entirely understand the (medieval) Italian, and have succeeded in memorising a very long sequence of pretty syllables. Which have had no impact whatsoever on my spoken or written Italian. The quizzes are departmental and not hard, and easy to do well in - but this as a result of the wonderful Emily and all the grammar she taught last year. If you don't have a solid foundation in the language, Mario isn't going to help. He's going to make you cry in frustration. I'm not even signed up for 1202 next sem - sheesh, who cares about completing the sequence anymore. This semester has pretty much been an overwhelmingly awful experience. Summary: If the only timeslot that fits your schedule is taught by Mario Bellati, take up another language. French, Russian, even Gujarati. Whatever. Anything is better than this.\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "August 20, 2002",
            "review_content": "\nMario Bellati is a sweet guy and a fairly easy grader. If you're a guy, and maybe even a little attractive, be warned that he's really touchy-feely.........He's a neat guy. I also took him for Italian Conversation II.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "June 14, 2002",
            "review_content": "\nMario is hilarious. As some previous reviewers have noted, he is irreverent about anything and everything, but in a very unoffensive, amusing way. He may make fun of students, but it's not meanspirited at all. Fun class and it's really really easy to get an A, but you probably won't learn much. He talks almost constantly, and he usually speaks English (which is a little tough to understand sometimes since his accent is so heavy). You will have to memorize a long passage of Dante, but you can sorta pick it up in class and glance at the text as you recite, 'cause it doesn't really matter if you don't have it down. Fun, friendly atmosphere. I would recommend him if, like me, you get bored to tears in typical grammar courses in which you have to sit and listen to repeated explanations of insanely simple grammar points. He barely does any grammar, so you have to learn it yourself, but the quizzes are the usual (very easy) and I think he gives good grades even when they're not really deserved.\nWorkload:\nChapter quiz every few weeks, occasional short writing assignments, final exam - all very easy and leniently graded. Long passage of Dante to memorize, but you don't really need to know it that well.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "May 10, 2002",
            "review_content": "\nOh Bellati, Bellati, Bellati. You'll never meet a more interesting character--he loves to workout (and seems obsessed with his weight), calls himself a \"Pagan,\" and is ambiguously gay. He is hilarious to listen to in class--which is what you will spend most of your time doing, since he never actually lets the students get a word in edgewise--about everything from modern Italian politics (he hates Berlusconi) to his psycho-analytical interpretations of Dante's inferno. Do not expect to really learn anything, unless you just understand Italian grammar really well already, or you're willing to basically teach yourself from the book. There is no conversation in the class, and he thinks that a good way to improve pronunciation is to make his students memorize a passage of Dante over the semester--a painful, and in my opinion, pointless exercise. He also does not actually teach any of the grammatical concepts; he just reads them out of the book. It is really interesting to hear him talk about the movies and cultural themes, but he does constantly repeat himself. Every time we talked about the movie \"La Famiglia\" he said \"It's about three generations of the same family in one apartment,\" and his favorite metaphor about memorizing Dante is that it is \"just like working out, because you have to exercise the muscle, and keep practicing to see results.\" All in all, take the class if you feel pretty confident in your language abilities (i.e. you don't really need instruction), because he is such an entertaining guy. But find an outside-of-class outlet to practice conversation skills, because you basically never get/have to talk in class.\nWorkload:\n5 or 6 quizzes, sporadic homework exercises that he doesn't collect, short compositions every couple of weeks.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "January 25, 2002",
            "review_content": "\nHe is probably the worst language teacher I have ever had. Granted, he is amusing, but you learn nothing, except the main requirement of the class-having to memorize Dante. Also, he chooses a few students to scrutinize more closely and then make fun of, which strikes me as arbitrary and simply mean. The class is formed around what Bellati finds interesting and his absurd assignments, not learning Italian.\nWorkload:\nnormal-with the additional memorization of Dante or whatever he chooses on a whim.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "December 15, 2001",
            "review_content": "\nSo Bellati can be genuinely funny sometimes. He's personable, he's ridiculous, but he's also irresponsible and disorganized. He doesn't collect homework, I'm not sure what he bases his grades on. He plays favorites very obviously and it can be truly obnoxious sometimes. He also picks on people, and will often humiliate kids in class over silly things. I found that very trying. I don't think he tries to be mean, but he's Italian and he can't help being \"irreverent.\" He will also randomly forget your name, make you memorize passages off Dante, and generally bumble around. His class can be fun, but it's not one I learnt a great deal from. He's a native Italian speaker, and it seems like he would be a great teacher for a class on Dante, but he's obviously not good at teaching basic Italian. He can't explain how to use grammar correctly, because it just comes to him naturally. Not a great intermediate level teacher.\nWorkload:\nRandomly assigned homework, never collected. Presentations (he'll make you read an essay you wrote in class) Memorisation of Canto I of L'inferno.\n"
        },
        {
            "course_name": "Italian Conversation",
            "review_date": "December 31, 1999",
            "review_content": "\nMario is a lovable Venitian with a deep voice, and you'll hear a lot of it since the class is more monologue than conversation. He's very animated, irreverent (get him going on the clergy for a real treat), knowledgable about art, and never at a loss for words, but the class would be more useful and interesting if there were some actual conversation. Good if you want to listen but not speak.\nWorkload:\ntwo or three presentations (usually read verbatim) and occasional brief readings.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "December 31, 1999",
            "review_content": "\nSignor Bellati is, well, kind of crazy. On the first day of class, he stressed the importance of being nosy (under the auspices of learning the Italian language and carrying on a decent conversation...but still). He's very enthusiastic and completely irreverent, although his rather frequent mood swings make for some interesting classes. Basically, it's difficult to tell when he's being facetious and when he's being a loopy Venetian. He can certainly make the class laugh, but he can also be rather harsh when it comes to mistakes and hesitations. He certainly isn't above rolling his eyes at a struggling student or openly playing favorites with the exceptionally studious who seem to have nothing better to do with their lives than memorize the Italian textbook.\nWorkload:\nnightly homework which he never collects, lots of class participation, memorization and presentation of a poem, quizzes every few weeks.\n"
        }
    ]
}