{
    "prof_info": [
        {
            "prof_name": "Iraj Kani",
            "prof_id": 5003,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Applications Programming for Financial Engineering",
            "review_date": "January 24, 2014",
            "review_content": "\nThe course description is a bit misleading. Most of the assignments are heavily invested in Excel VBA and there is only C++ assignment in the course (the first one). Otherwise, the focus is placed on mathematics concepts applied to arbitrage, pricing models, portfolio optimization, etc.\nThe TA's handle the grading and logistics of the class. Prof. Kani serves as the lecturer. His delivery could use some work and he has a tendency to banter about non-class related topics, but the notes he posts are very detailed and very explicit. If anything, the best part about the class is being able to have those notes for your reference if you ever decide to do quantitative analysis. He is also very approachable before and after class.\nThe grading is fairly lenient and the TA/CA staff were accommodating for busy schedules. There was a required presentation for each assignment, but my schedule didn't allow me to attend any. It is essentially a 30-minute (max) breakdown of how you approached each problem on the homework. They are also very responsive to e-mails.\nThe content of the course is very difficult and very broad. Going to lecture is not enough as you will need to read the notes very carefully while tackling the homework. Expect to meet up with your group regularly to manage the work load. There are no exams, but the homework is more than enough to make up for that. The final project can also be as difficult as you want to define it. Make sure there is enough content on it to justify a 30 minute presentation.\nWorkload:\n4 Homeworks (60%)\n1 Final Project (30%)\nParticipation (10%)\n"
        },
        {
            "course_name": "Introduction to Structured Products",
            "review_date": "January 19, 2011",
            "review_content": "\nTook this class last year and lets just say although Iraj is a great lecturer and definitely knows his stuff inside out (you can tell from what he does in industry). The class is interesting ONLY IF YOU ARE OR WANT TO BE A QUANT. Personally I wish I had never taken this class. Assignments are done in groups of 4 and each take a long long time to complete. Do not be fooled by the prospect of no exams - these assignments are hardcore and require an in depth knowledge of the subject. The TA's are not fair in grading although I do not think many people ended up with lower than a B- in the course. I put in considerable effort and had a great team of programmers, yet we only managed a B. I can say I learnt a lot, but do not think i will ever use what i learnt. Moreover than that the stuff is just boring.\nWorkload:\nLOTS OF WORK. Assignments take a very very long time, make sure you have a solid background in other Quant related classes as there is a lot of assumed knowledge. No exams, but at the end of a tired semester you hope there was.\n"
        }
    ]
}