{
    "prof_info": [
        {
            "prof_name": "Jennifer White",
            "prof_id": 1584,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 17, 2010",
            "review_content": "\nMost amazing teacher I have ever had. She cared the most about her students than any other teacher I have ever had. For each essay assigned she returned a page and a half single-spaced review critiquing your ideas - for everyone in the class. Her discussion sections were truly amazing. It was the most fun I have ever had in any English class. I only wish she finished out the spring semester of 2010. \nIf she ever returns to Columbia get her as a teacher you will not regret it!!\nWorkload:\n2 essays - easily graded. First one students were allowed a draft. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2009",
            "review_content": "\nHow does she only have a silver medal? She is hands down the most effective instructor I know of at Columbia. The humanities are not my forte, so I entered the class thinking that it would just be another boring required class. How wrong I was! Professor White works SO hard to make Lit Hum the best that it could possibly be. Class discussions are definitely the highlight of the class because of all the thought-provoking ideas that she introduces. Concerning papers, she does a wonderful job of offering helpful critiques so that one can improve exponentially time after time. Lit Hum with her is rarely (if ever) boring usually because of her great sense of humor and the vast amount of knowledge she has. \nAs a side note, occasionally, when she's sick and on Dayquil, class is hilarious because she can't say certain words properly. \nWorkload:\n2 papers, weekly reading assignments, a midterm and final (per semester). Not bad at all. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2009",
            "review_content": "\nHow does she only have a silver medal? She is hands down the most effective instructor I know of at Columbia. The humanities are not my forte, so I entered the class thinking that it would just be another boring required class. How wrong I was! Professor White works SO hard to make Lit Hum the best that it could possibly be. Class discussions are definitely the highlight of the class because of all the thought-provoking ideas that she introduces. Concerning papers, she does a wonderful job of offering helpful critiques so that one can improve exponentially time after time. Lit Hum with her is rarely (if ever) boring usually because of her great sense of humor and the vast amount of knowledge she has. \nAs a side note, occasionally, when she's sick and on Dayquil, class is hilarious because she can't say certain words properly. \nWorkload:\n2 papers, weekly reading assignments, a midterm and final (per semester). Not bad at all. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 15, 2005",
            "review_content": "\nMs. White is totally amazing!  You should feel lucky to get someone as knowledgeable, down to earth, and understand as she.  We had great class discussions, she was extremely helpful when it came time to choose paper topics, was aways available for office hours, sent out emails after every class period.  I've heard some horror stories about Lit Hum instructors...Jennifer is probably the best.  I wouldn't doubt it.\nWorkload:\nUsual reading of all the books.  However it was awesome when she broke up the readings or spent an extra class period on a confusing book, especially when we had a paper due.  Lit Hum is 12 pages worth of \"paper\" work.  We had 3 four-page papers.  Really not that biga deal.  Also, a one page \"journal\" was required for each class...also, not a big deal\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 22, 2004",
            "review_content": "\nMs. White was the best part of my first semester at Columbia.  She is so kind and her deepest concern is that her students get the most out of her class.  Because of this, she always asks us how her methods are working for us.  If a student is late, the only penalty is food the next time, which means that we usually have a lot of candy during class. She's really effective in breaking down each work and showing why it is considered so genius.  Additionally, her feedback on papers is extensive and helpful, and she is incredibly flexible about meeting with students before their papers.  FIND A WAY TO TAKE HER CLASS!\nWorkload:\nFour papers per semester, usual lithum reading, discussion/participation grade based on class participation anddiscussion q's on courseworks.  \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 25, 2004",
            "review_content": "\nFirst of all, Jennifer White is really sweet and very smart. Her class was excellent. While everyone else in the freshman class complained about University Writing, I actually thought my writing really improved. She really knows how to help your writing. I recommend putting a lot of energy into the first draft because she will give you TONS of feedback, and you also won't have as much work to do later on; if you take the feedback into account, you will definitey get a good grade. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "October 25, 2004",
            "review_content": "\nFirst of all, Jennifer White is really sweet and very smart. Her class was excellent. While everyone else in the freshman class complained about University Writing, I actually thought my writing really improved. She really knows how to help your writing. I recommend putting a lot of energy into the first draft because she will give you TONS of feedback, and you also won't have as much work to do later on; if you take the feedback into account, you will definitey get a good grade. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 06, 2003",
            "review_content": "\nthe other review pretty much summed it up- ms. white is amaaazing!  to my complete surprise, considering its horrible reputation, l&r; was my favorite class of the semester.  i loved the way the papers made me think, and that was definitely due to her interesting and contemporary paper topics, and of course to her constant encouragement to be innovative.  my writing has improved immensely due to her comments- she always told me where there was room for improvement, but the paper didn't have to be perfect in order to get a good grade, which always motivated me to keep trying.  and most importantly, she improved my writing skills without trying to change my writing style, which are two different aspects i think most l&r; teachers find hard to distinguish between.  because of that, i can really carry over the skills learned in this class to all my subsequent writing endeavors- confident that it's my own writing and not some random teacher's.  overall, this class will affect the rest of my college experience, and i really have ms. white to thank for that.  \nWorkload:\ntypical l&r; class, but she replaces one of the earlier papers with a revision (awesome for many reasons) and makes sure that as other classes give more work toward the end of the semester, she gives less- also, we vote on the midterm and final topics in class and can bring in an outline\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 30, 2003",
            "review_content": "\nHint for incoming freshmen: if she's still teaching this class, TAKE HER SECTION! And I don't say this because you'd get a good grade (I don't even know my final grade yet), but because classes will be FUN and you'll actually get to learn a lot, without noticing it. I've heard many scary stories about L&R; from people who took it in the first semester; I'm a math major and English is a foreign language for me, so I expected this to be a real nightmare... well, guess what: it turned out to be my favorite class this semester! Sure, writing two essays per week is hard work, but it feels a lot better when you see your instructor working just as hard to help you. Her comments on each paper were very thorough and accompanied with helpful revision suggestions. As for office hours, the usual 15 minute session would turn out 45 minutes long if necessary... She'd answer promptly to all of your e-mails, be they class related or simple grammar questions... (And she'd do this while preparing for her oral Ph.D. exams). The paper topics were interesting, we'd vote on them in class, and if you really hated the one chosen you could write on an alternative one (and that goes for midterm and final also) She really appreciated it when we came up with our own topics also. I did say earlier that classes were FUN... as a short example: during an Iraq-war in-class debate, the opening statement of the anti-war side was throwing a SOCK at the other side as 'preventive action' (try THAT in a poli-sci class...). All in all she's a very nice person and a great teacher. I wish her good luck with her Ph.D. and I wish YOU to have her as L&R; instructor.\nWorkload:\nUsual L&R; (not pilot class).\n"
        }
    ]
}