{
    "prof_info": [
        {
            "prof_name": "Jerome Chanes",
            "prof_id": 1055,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Sociology of Jewish Life in America",
            "review_date": "September 21, 2002",
            "review_content": "\nProfessor Chanes is an extremely devoted professor and will do anything to help a student who needs support or encouragement. He prepares a very intriguing list of readings to cover over the semester, and aids the class in discussing the assigned readings. He genuinely cares about how his students learn, and about how he can help them in fully comprehending the material. People dont give him a chance because he happens to have a stutter, but this in NO way affects what a kind man he is, and what kind of a teacher he is.\nWorkload:\nA midterm, a final and a paper. The midterm and final both are graded hard, and he sometimes surprises his students with questions on both tests. However, he is completely open for negotiations in grades because he understands students' personal problems.\n"
        },
        {
            "course_name": "Sociology of Jewish Life in America",
            "review_date": "April 30, 2002",
            "review_content": "\nI was extremely excited about this course, and what a disappointment! Jerome Chanes has to be the worst lecturer I've ever encountered. His voice is nearly inaudible, he has a stuttering problem, and he sounds as though he has a permanent sinus infection. As a discussion leader, he is little better; whole classes are spent in circular, pointless arguments about such Big Questions with No Answers as \"What is religion?\" He didn't follow the syllabus at all and spent 20 minutes at the beginning of each class going over redundant class business. Didn't bother to make a bound course book, just gave us a gigantic stack of papers. Biased against Reform Judaism and made only a poor attempt at hiding it. Chanes' knowledge of Jewish sociology is extensive, but he simply cannot teach. Lots of guest lecturers, who ranged from incredible (Sam Heilman of Queens College) to worse than he is (Eva Fogelman, who is incidentally Chanes' wife) That said, the class did have two saving graces. 1. The readings. The reading list is a dream come true for anyone with even a passing interest in American Judaism. It fundamentally changed the way I view my world and my religion. 2. The ease. Chanes is a very easy grader and a total pushover about things like deadlines. So the class is painless if you can tune him out. Overall, though, this course is worthless. Avoid like the proverbial plague. No, better yet: register, get a copy of the syllabus, drop the class, and work through the absolutely wonderful reading list on your own time.\nWorkload:\nTons of reading. You can get away with skipping most of it, but you'd be a fool to, since it's the only worthwhile aspect of the course. Midterm (not a walk in the park but quite doable and reasonable), final (haven't taken it yet but how bad could it be?), ~8-10 pp. paper (absolutely no guidelines given, write total BS about any topic you want and watch the praise roll in). Easy class overall.\n"
        }
    ]
}