{
    "prof_info": [
        {
            "prof_name": "Chun-Fang Yu",
            "prof_id": 2084,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Buddhism: East Asian",
            "review_date": "May 03, 2005",
            "review_content": "\nI completely agree with the previous reviewer. Professor Yu is obviously accomplished, intelligent, and passionate about the subject of East Asian Buddhism. She gives a speech during the first class about how much she wants us to visit her during office hours. In those respects, she is a great teacher. On the other hand, because she is so knowledgeable, she tends to ramble. A LOT. Often times, we would only get to the materials for the day in the last half hour or so of class. If you like learning all about a subject, then you would like this class. If you are just in it to memorize some facts, get an A and leave, then you will find lectures useless. \nWorkload:\nMidterm (IDs and essays), weekly posting on courseworks (1 paragraph about the reading), final paper (6-9pgs), attendence (don't know how its graded but its taken at every class meeting)\n"
        },
        {
            "course_name": "Chinese Religious Tradition",
            "review_date": "December 19, 2004",
            "review_content": "\nProfessor Yu is nearly impossible to review in any way that doesn't undermine her incredible knowledge/achievements in the field of Chinese religions...she knows more about Kuan-Yin than anyone in the world (no seriously, she does...)   She knows a lot about Buddhism and is cleary passionate and excited about it, but this enthusiasm is completely missing from her lectures on Confucianism, Daoism, etc...  The  main problem I guess is that her lectures ramble.  If you can imagine trying to talk in French, to a group of french-speaking people, about your favorite novel in english, which is your native language, that would be something like the challenge that Prof. Yu faces.  This is compounded by the fact that translations, often having gone from sanskrit to several chinese versions and finally to english are EXCRUTIATING.  If you are interested in this kind of work, based on what other people in the class have said, the class is worth taking.  But if you are a religion major taking it for a breadth requirement or you think you \"might be interested\" in Chinese Religion, its probably not for you.\nWorkload:\nOne midterm (10 ids' 2-3 short essays) 1 final (same as midterm) 1 7-page paper on a topic of your choice; weekly posting on courseworks.\n"
        }
    ]
}