{
    "prof_info": [
        {
            "prof_name": "Richard Betts",
            "prof_id": 625,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "January 01, 2014",
            "review_content": "\nThere are no recent reviews for this class, which perturbed me when I decided to take it this last semester (Fall 2013). I thought I would add my thoughts to make up for the dearth of information. \nThe last person who wrote on this class was a GS student who had previously served in the Marine Corps. I write this as 3.5 GPA political science undergraduate junior with something of a hard-on for military history and affairs who got a surprise A.  \nReadings:\nThe course is almost entirely about the readings. There are approximately 3000 pages of it all, which sounds terribly intimidating when one first signs up. Indeed, Betts does everything in his power to impress upon you just how terrified you should be, but in reality I found it much more manageable than the horror stories I had heard. Most weeks have a relatively modest 50-200 pages of reading, which is no more than Jervis's Intro to IR, or any other moderately high level polisci course for that matter. One or two weeks have gargantuan loads of 400-500 pages, while an equal number have fewer than 50 pages. I would say that I actually read about 70-80% of the material without breaking much of a sweat. I simply missed out the entirety of the really heavy weeks. On account of the fact that the exams allow you to choose your questions, you only read to know about 70% of the course well to get an A. Basically, when it comes to the readings - if you are moderately hard working, then don't let the horror stories scare you. You'll get enough of it done to do well. \nSection:\nAs far as TA sections go, the last reviewer said they weren't worth the time, and that you should miss them and read instead. I don't think this is true. I actually think the sections were the part of the course from which I gained the most. All three TAs are pretty fantastic at synthesizing the material, helping you to work through it all intellectually etc. I'm told that Michael O'Hara is the best of the TAs, but I sat down in sections with both Erica and Theo and they were both great. \nLectures:\nThe lectures were also pretty impressive. Past reveiwers have complained that Betts just reads from his lecture notes and does little else. This is mostly true, but his lecture notes are very interesting and well constructed, and he presents them loudly and clearly. You will take more notes in this class than you have ever taken in any other class (As a junior I wrote more than twice as many notes for this class than for any other I have ever taken), but it is all interesting stuff. For what it is worth, I never once so much as dozed through one lecture of this class, which is also a first for my Columbia career. I found myself pretty alert and mentally invested the entire time. \n\nContent:\nAs far as the content of the class goes, it covers 14 different thematic topics concerning war, peace, and strategy, and for each topic poses a number of questions. E.g. For the week on ethics, we ask Â¨when is it permissible to kill civilians in war?Â¨, and try and answer the question with reference to a variety of writers. The week's topics are as follows:\nIntroduction: Nature and Functions of War \nCauses of War and Peace\nSecuring Peace: Balance of Power and Cooperative Institutions    \nChoosing War or Peace: Conquest, Coercion, Crisis Management\nModern War: Constraints, Conditions, Conduct    \nPolicy, Strategy, and Operations\nEnds and Means in Total War and Limited War\nTerrorism and Unconventional Warfare\nSociety, Polity, Culture, and Capability\nWhen Is War Murder? The Moral Calculus of Killing\nThe Nuclear Revolution:  Theory and Practice \nThreat Assessment and Strategic Planning\nArms Control and Disarmament \nConclusion: Evolving Bases of Conflict and Cooperation\nI must say, the material one goes through is extremely interesting. I was riveted by pretty much everyone I read. The assigned and recommended movies to watch are also fantastic, expecially Dr. Strangelove, The Battle for Algiers, and Failsafe. The class has changed me intellectually for the better. I think about the world in a totally new light, and find myself quoting Clausewitz, Mao, Sun-Tzu, and other writers from the course more often than I probably should. It was actually all kind of life-changing. \nExams and Betts Bible:\nThe course is graded ENTIRELY on two exams - the Midterm and the Final, and the midterm is optional for Grad students. The midterm is meant to be worth about 20% of your grade if you elect to take it, but from what I gather this is a sort of fluid number. That is to say, if you screw up the midterm but knock the final out of the park, you are still likely to get an A. \nAs far as what you need to do for the exams.... 1) Know about 10/14 weeks like the back of your hand. You should be able to recite from memory every author for those weeks, their basic argument, and perhaps one piece of evidence that supports their case. 2) For the remaining 4 weeks, you ought to know the names of all the writers, and their basic argument, but you can garner this from the Betts Bible (ask around SIPA for an electronic copy of this summary of every reading) without probably having to do the reading. 3) Pay attention to the handouts he gives out in lecture. There are always one or two short answer questions based on some of the most innocuous details on those pieces of paper. 4) Go to every lecture, and familiarize yourself with what he is trying to teach you for each week. There are no surprises or trick questions on the exam. If you can work out what he wants from you (an impressive knowledge of the readings and why each one matters), you will do well. 5) Just a thing to note - the class tests you on your ability to memorize readings. Memory is more important for this course than ability to construct an argument. \nThe format of the exams is the same as the last review described them - a choice of short answer questions, and a choice of a few essays. The midterm is graded very harshly to scare the beejeezus out of you, while the final seems to have been graded in a more sympathetic way. I got a B+ on the midterm and an A overall, despite the fact that I thought I had done worse on the final than the midterm. \nTL;DR Take this course. It's awesome. The reading is manageable contrary to most horror stories. The content is almost sort-of life changing. Among the top 2 courses I have taken at Columbia. \n \nWorkload:\n3000 pages of reading. Lots of note taking in lectures. Mandatory section for undergrads. Optional section for grad students. Midterm and a final are the only parts graded. Midterm is optional for grad students, but you'd have to have a screw loose not to go the exam and try it out, even if you decide at the end not to hand it in. \nIf you work hard, you will likely be pleasantly surprised by your grade. \n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "January 29, 2010",
            "review_content": "\nFirst, let me note that I am a General Studies undergraduate who served in the U.S. Marine Corps.  I entered the class already comfortable with much of the material and I got an A-, which I believe is better than most of the SIPA students. Even with my headstart on the subject matter, I left this class with a vastly improved ability to read, comprehend, organize and synthesize a lot of information.  This is the first class of my academic career from which I will retain a great deal of useful information for years to come. \nThis class is mostly about the reading, with Betts as a centerpiece who holds it all together. The effort and style of the instructor fell short of the standard set for students, the instructor's experience, or the centrality of the course to SIPA's M.A. in International Security Policy.  His years of experience are evident but his professorial style is lazy.  He read lectures, usually verbatim, from a paper which seemed like it was written years ago and given the slimmest of revisions from one semester to the next.  \nThe lectures and readings are organized into thematic sections.  The reading list posed thought questions for all of the readings.  Your study should focus on answering these questions on the midterm and final while citing the title and author of all relevant readings.  The bar is set very high for the midterm and final, with the TAs docking points for any relevant author not cited.  My study sheet for the final exam, which is cumulative, attempted to answer each of the thought questions and summarize each reading as concisely as possible.  It was 37 pages long, and I would be very impressed to find a shorter version from which one can study for an A on the exam.  The quasi-illicit \"Betts Bible,\" circulated among SIPA students, numbers upward of 200 pages without going off-topic.  \nDiscussion was mandatory for undergrads and optional for grad students. The TA would ask, \"what is so-and-so's argument,\" and students would answer in turn until time expired.  Due to the size of the reading list, there was little room for the less centralized debate and discussion which helps most for comprehension.  \nI heartily recommend that undergraduates complete International Politics before enrolling in War, Peace and Strategy.  IP is organized in the same way with a third of the workload.  You will benefit greatly from the background information, and you will need the practice in reading, comprehending and organizing info for the ID and essay questions.  \nWorkload:\n2,944 pages of reading.  One very involved midterm, optional for grad students. Five of eight IDs and one of two essays.  One very involved, cumulative final. Eight of twelve IDs and three of six essays.  I cited at least ten different authors for each essay of the final.  \nDiscussion section is mandatory for undergrads, optional for grads, and not worth the hour you'd otherwise spend reading.  \n"
        },
        {
            "course_name": "International Politics Seminar: National Security Policy",
            "review_date": "December 22, 2008",
            "review_content": "\nTo enroll in this class, you must fill out an application. Fill this out carefully since it will determine if you make it into the class. Betts tells you that getting into the class is the first hurdle, and indeed it is.  \nBetts is scary, though over time, he becomes a bit more friendly in the classroom and begins to call students by their first name. This does not mean that you will not do well or that you will not learn anything -- it just means that he will keep you intimidated and guessing the entire semester. His weekly oral quizzes help to do this. And you better show up prepared for them or else you will feel entirely and completely humiliated. \nIn terms of course material, much of the theoretical material is still relevant (bureaucratic culture, intelligence gathering, etc.), but many of the sources seemed outdated. Though many of the sources may in fact be valuable to study, it is somewhat frustrating that an entire week's material might be from 1967. I took this class precisely because I hoped it would help me better understand current national security policy. While the class contributed to my theoretical understanding of this topic, it rarely took up issues of current relevance. \nYou can pick up on these issues in your final paper, but to do well on it, you must choose a very focused and specific question and come up with a very focused and specific answer. No broad sweeping statements are acceptable. \nYou will work hard, and unless you are a security buff and a military history nerd, it will only be quasi worth-it. \nWorkload:\nweekly oral quizzes; 2 five page papers on the week's reading (do them early or you will be swamped); one 6,000 word final paper; participation\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "January 23, 2008",
            "review_content": "\nDr. Betts is a well-known academic in his field and he is really a very nice person as well. He expects you to read a lot for this class but doesn't require any other outside work. Most students join informal reading groups and pass around summaries to cope with the reading load. The best part of his class was when he stepped away from the podium and spoke to the class on the fly without his pre-determined lecture notes. Because he is reading his lecture, some people find it difficult to keep up and take notes. Outside of class he is very easily approachable and really very nice.\nWorkload:\nHis legendary reading list is no joke. There are a few movies that you must also watch outside of class in addition to the reading. (yes, they come up on the midterm/final) There is an optional midterm for grad students and a final for everyone. No papers because as Betts says - you need the time to read.\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "December 31, 2006",
            "review_content": "\nBetts' class has loads of readings but speed reading and taking down 1 page summaries of each reading will get you far. His lectures are fascinating although he talks very fast and they seem to have no structure. That being said, the optional sections are the most helpful if you plan to be a lazy ass and not do any reading because the TAs are wonderful in pointing out the key ideas of each reading. \nWorkload:\n3000 pages in one semester, optional midterm for graduate students and a kick ass final comprising of 10/18 IDs + 3/6 essays.\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "December 04, 2005",
            "review_content": "\nVery tough grader, but unbeatable in his field. The reading is extremely interesting, although he fixates on General Clausewitz. He mostly reads his lecture from notes (probably at least a year old, though at times updated). I found him more engaging when he made remarks off the cuff. The TA in this class (in my case Dafna) really saved my butt, especially given the onerous workload. For grad students, the midterm is optional, which is very nice.\nWorkload:\nHis reading load is by far the heaviest I've encountered at SIPA; it's the stuff of legend in the halls of the Int'l Affairs building.\n"
        },
        {
            "course_name": "International Politics Seminar: National Security Policy",
            "review_date": "January 17, 2005",
            "review_content": "\nDespite my comments regarding the heavy workload this class was the most interesting I have taken in the Political Science department. I found the topic of national security to be extremely captivating and actually eye-opening to some extent. Professor Betts is truly a scholar on this topic and many of the selected readings really helped gain a good understanding of the weekly topics from several perspectives. The grading is certainly fair, though be prepared to be interrogated before each class on some minor and major points made by the authors.\nWorkload:\npretty intense, with a pair of five page papers discussing the weekly readings and a 20 pg final paper being arguably the easiest of the work. The weekly reading is intense and sometimes involved as many as 400-500 pg. \n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "December 23, 2003",
            "review_content": "\nThis class and prof are not a good combo if what you expect from a class is a solid presentation of theoretical concepts useful for application to  contemp. issues or other polisci courses. Its an old class in terms of its dry material about the great wars, cmc, nuclear strategy, etc. Light on transnational issues: societal conflicts environmental threats, civil wars, terrorism, heavy on WW 1 and 2.  Moreover, its not only old material--presented in a dull fashion--but lots of it. You will be thrown close to 4000 pages of reading many of which you will have to trek to Lehman and read  for two hours at a time since they are reserve-only readings. Plus, the mt & f are bland and lazy in format and they will not test how much you know or the value of what you do know--youll just have to guess and hope--which is totally stupid for the couple of grand of tuition the course ends up costing. This class is annoying, difficult to navigate within the limits of  a reasonable schedule and though its unique benefit is knowing that you have taken a class that has a reputation for being difficult it will do you no academic good. Last, heads up the prof reads his lectures from a paper at you.\n\nWorkload:\n3500-4000 pages of reading. mt & f which will be complete guesswork. \n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "December 18, 2003",
            "review_content": "\nSometimes you'll wonder why you're in this class and want to drop it (mostly because of the insanely long required reading list and partly b/c Prof. Betts keeps drilling into your head that fact that the class is hard and you MUST do the reading), but the informative and thought provoking lectures will keep you going. The reading list is painful, but well worth it -- if you make it through the course, you'll have a broad and sound base of knowledge relating to war, peace, and the strategies of both. \nWorkload:\nSomething like 3,000 pages of do-it-or-fail reading. \n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "November 18, 2003",
            "review_content": "\nThis is a class with 25% undergrads, 75% grads. Betts says he is not a good lecturer, but he actually is. He refers to his notes, but he makes lecture interesting. A lot of material is covered, but the optional TA session is helpful to clarify questions. He knows his stuff and lecture and the readings are diverse and interesting. He addresses both sides of the argument as well. It was a hard class, since it is a SIPA class, but it was a good class.\nWorkload:\nAverage 250 pages of reading a week, one mideterm, one final, no paper\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "September 12, 2003",
            "review_content": "\nBetts is a very good teacher.  Intimidating as hell with his practice of calling on people at random with specific questions about the reading (so you had better do it unless you like humiliation), but very thorough and thought provoking.  It is one of those tough classes that is worth it.\nWorkload:\nsizeable reading which HAS to be done before class since he quizes you.\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "January 14, 2003",
            "review_content": "\nDuringthe first few lectures, Prof. Betts comes across as a boring, evil ogre out to ruin your average and make you hate him and his class. ( on the first day he will say \"people often see me as something of an ogre, but I think I am a real pussycat,\" and youwill be sure he is being ironic.) Do not let this fool you. He is just getting the dry theory out of the way and scaring the class down to a manageable class. He will soon force you to examine questions that seemed simple with a degree of sophistication that will show why military politics are an important field. His lectures will turn highly engaging (often even funny) and you will learn far more than you thought you could about one subject in three months.\nWorkload:\n~3300 pages of required reading. Maybe 2000 pages of which are absolutely essential to do decently, the rest just very important. The reading is dense and often difficult, but really fascinating. Midterm and final, both graded generously, at least for undergrads.\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "August 03, 2002",
            "review_content": "\nHands down, the best polisci teacher at Columbia. The man is quite simply FANTASTIC!\nWorkload:\nNormal\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "May 15, 2002",
            "review_content": "\nGood teacher. Really knows his stuff. But he's a tough cookie in class discussions and in grading papers. Also, his classes are usually overrun with SIPA students, whose views on international politics are as offensive as they smell. Betts is also an accomplished musician, having played lead guitar with the Allman Brothers for many years.\nWorkload:\nLots of reading. 3 papers, I believe.\n"
        },
        {
            "course_name": "International Politics Seminar: National Security Policy",
            "review_date": "February 11, 2002",
            "review_content": "\nGreat class, if you don't mind getting your ass kicked on a weekly basis. Betts assigned an incredible amount of reading, and every one was expected to know every bit of it inside and out (oral quizzes at the beggining of each class). I learned more in this class than in all my other poli sci classes combined. Class discussions were good, because every one was always prepared; hard to b.s. because Betts would grill you until you broke. Most members of the class were horribly afraid of him during the first few weeks, but agreed at the end that he was a really nice guy. Made it clear that there are no easy answers in national security policy. So I now believe that the world political system is this scary, irrational entity which no one can really control, but I'm all the better for it. \nWorkload:\n2 short (5 page papers), 1 long (20 page) research paper lots and lots of reading\n"
        },
        {
            "course_name": "War, Peace and Strategy",
            "review_date": "May 06, 2001",
            "review_content": "\nBetts knows his stuff and will correct you if you disagree. His lectures are interesting, but he's a grade A [CULPA edit: Enter your favorite noun here]. Don't expect any leniency in grading. Also bring a respirator.. there are countless SIPA students in this class and they don't wear any deodorant.\nWorkload:\nAbove and beyond anything else. Reading list is crazy. Midterm and final only (for undergrads)\n"
        }
    ]
}