{
    "prof_info": [
        {
            "prof_name": "Benjamin Lyons",
            "prof_id": 9658,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Economic History of Latin America",
            "review_date": "May 17, 2010",
            "review_content": "\ndescriptive haiku:\neconomic his\ntory of latin amer\nica: why so long?\nI came into this course struck by Coatsworth's (former) golden nugget CULPA rating, my interest/major in economics, and a searing fervor for all things Latin American. I came out of it with an addled, uneven understanding of Latin American economics tinged with a superfluous degree of actual history.\nIn some ways, this class could have been brilliant (and for a friend of mine, it was). The organizational structure of the lectures are, as mentioned in other reviewed, centered on weekly questions. The questions did a very good job of stringing together the various articles we had to read that week, but the problem was that sometimes they did not flow together quite as well from week to week. It felt as though we were jumping around from topic to topic, and only were able to put things together several weeks later, when we had fuller pictures of what we were talking about. Some of the other issues that were brought up in my discussion session was that as a survey class, we were never able to fully delve into one country's economic history as a case study. Of course, this was supposed to be resolved by the case study papers we were to write for the semester, but these were nothing compared to an officially led discussion on the matter. The syllabus showed great organizational potential; it just never came together.\nThis is partially the fault of the readings. At the beginning of the semester, we were presented with a manageable number of articles (3-4) at manageable lengths (20-25pg). I'll admit, the readings were hard for me to understand at first (even having taken Principles of Economics), but under the advice of my TA (Ben Lyons) and my own experience of a few weeks of reading, it became easier and thought-provoking to do the readings. Slightly tangential, but I have to say this: Ben is probably the best TA I have ever had at Columbia. He encouraged our class to read the articles strategically how to skim, what to skip, and how to boil them down to three sentence summaries. This was beyond helpful for studying for the midterm and final. He also always let us speak about the articles before he put in his own interpretations, which were always helpful and raised new questions for our section to discuss. If it wasn't for him and our weekly discussions, I probably would have dropped this class. This is not even his area of specialty!\nThe lectures, in contrast, were astoundingly disappointing. Salvatore, who taught half of the lectures, was hard to understand, and when you strain to understand him, you find out that he's only summarizing the articles of the week in a less articulate way. No new ways of interpreting the texts, or help on how to read them. Coatsworth, on the other hand, may have been easy to understand, but he gave out so much information at such a quick pace that it was almost impossible to take comprehensive notes of his lectures. Not that you would be missing much--his lectures were basically summaries as well, with interjections of his own opinions in between (usually found in one of the articles anyway, as we read his stuff rather frequently). None of this helped after the midterm, when the readings became denser and longer.\nOverall, what I'm trying to say is this: don't take this class unless you really, really like economic history.\nWorkload:\nA geographical identification quiz at the beginning of the semester, one long, 10-15 page case study, and dense economic readings. 4-7 articles per week, each ranging from 20-50 pages (on average ~150 pages/wk).\n"
        }
    ]
}