{
    "prof_info": [
        {
            "prof_name": "Nathaniel Kim",
            "prof_id": 12652,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Organic Chemistry for First Years II",
            "review_date": "May 24, 2013",
            "review_content": "\nIt's been a while since someone's reviewed Leighton, but for the most part everything the past reviewers have said are true. Compared to Breslow, Leighton's a lot younger, and subsequently more dynamic and engaging. He enunciates his words. He draws molecules that are actually easily discernible. He won't miss your hand if you thrust it up, eager to ask a question of clarification or to show your peers how intellectually curious you are. \nTo do well in his class, 1) Come to lectures. 2) Take good notes during lecture. Make sure you're not just copying down molecules and ignoring the context/explanations that he's giving them. 3) Study the notes regularly, memorize the reactions, and understand the mechanisms. Leighton gave us psets regularly throughout the semester, and if you can do those psets without having to look at your notes, you should be fine for the midterm. \nLeighton's exams are quite conceptual; though the problems are hardly ever straight from the notes, if you know your notes well and can explain/comprehend just about everything he talked about in class, you should have no problem getting an A or an A+ in the class. Seriously. He likes to test a) proposing mechanisms, b) reaction predictions (ugh...stereochemistry comes back with a vengeance this semester), c) designing syntheses (which all involve some sort of retrosynthetic analysis of the product). \nIn the end, the class averages still weren't that high; the averages for the midterms were 64, 65, and 76 respectively, while the average for the final was a 69.7. Don't try cramming for this exam; my friends who were most successful in this class all put in a little time daily for the first couple of weeks, until they were able to get a hang of Leighton-style orgo. \nNate's also a pretty good TA. He's a funny and chill guy. His recitations were a lot more helpful first semester (since understanding Breslow's lectures required more effort than deciphering the Rosetta stone), but second semester they were merely rehashes of Leighton's lectures. Nate's pretty approachable for questions, and is willing to help you do well in the class. \nNow for my experience: I am by no means great at organic chemistry. As whole, the class got better at orgo as the semester progressed, while my grades stayed pretty stagnant. It took me a while to realize that was because I wasn't putting enough time into the class. So I swallowed my pride, starting recopying notes, and then did quite well on the final. Somehow, I ended up doing better than I expected in the class. Unlike the previous reviewers, Leighton didn't send us an end of the year email, and I'm pretty sure he curved my class to a B+. \nBut the bottom line is, if an idiot like me was able to get through this class with a grade much higher than I had hoped for, with steady effort, you can too. \nWorkload:\nIn my semester, it looked something like this:\n3 midterms - 15% each (45% of total grade)\n1 final - 13 questions, out of 235 total points (45% of total grade)\n9 (or 10) mostly weekly recitation quizzes, lowest 1 dropped (10% of final grade)\n**optional Psets that Leighton gives, which of course everyone does anyways. \n\n"
        }
    ]
}