{
    "prof_info": [
        {
            "prof_name": "Anwar Walid",
            "prof_id": 9542,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Topics in Networking: Content Storage & Distribution",
            "review_date": "September 10, 2019",
            "review_content": "\nI took in this class last year (2018) and Anwar a very good professor with well-planned lectures and gives assignments that are relevant to his class. \nCourse Description:\nELEN E6776 - Topics in Networking: Content Storage & Distribution\nThis course is on fundamentals of content acquisition, storage and intelligent delivery. Content storage and distribution networks have emerged to enhance users' experience of accessing all forms of content in efficient and scalable manner leading to the proliferation of many new applications and services with commercial, technological and social impact. Design, optimization and management of content storage and distribution are challenging due to growing numbers of content producers and consumers, expanding size and features of rich multi-media content, and demands for better content access from anywhere and at anytime. Meanwhile, cloud computing, network function virtualization, data integrity via blockchain and distributed ledgers, and AI/ML techniques enable new potential design capabilities. Therefore, there are new opportunities for development and research. In this course we study traditional and new emerging solutions and examine current research problems and future directions. The course covers wide range of topics including: fundamentals of client-server, P2P and hybrid models; multimedia streaming; content/data modeling, caching, and Blockchain-based integrity; massive data mining and content recommender systems; data centers and virtual CDNs; social networks as CDNs; applications of AI/ML and future directions and open research problems.\nNo textbook required.\nWorkload:\n2 homework, 1 midterm, 1 project and 1 final.\n"
        }
    ]
}