{
    "prof_info": [
        {
            "prof_name": "Lisa Tiersten",
            "prof_id": 583,
            "total_reviews": 39
        }
    ],
    "reviews": [
        {
            "course_name": "European History since 1789",
            "review_date": "May 24, 2015",
            "review_content": "\nProfessor Tiersten is fantastic. She is so knowledgable and goes the extra mile to help students. I highly recommend this class for those who want to try out an introductory history course. The material is expansive, but manageable. \nWorkload:\nManageable. 1 X 8pp long essay, mid term and final. \n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "May 19, 2015",
            "review_content": "\nI have enjoyed this class very well, especially the lectures. It offers a pretty comprehensive perspective on Europe's last 200 years. The best part about this class is that we study history through a wide range of materials: the lecture discusses the events, the readings include contemporary documents, the movies offer unique interpretations, and the discussions analyze important philosophies of the period. Each part of the class has its function. Philosophies and ideologies are a focus of this class as well as the historical events. We have discussed liberalism, romanticism, socialism, nationalism, fascism, and many other contemporary philosophies relevant to the events. We include readings that are often the origins of these philosophies, which help us understand these complex ideas greatly. The class also does not fail to differentiate the By taking this course I have learned much more than historical events alone. \nThere are, however, a few downsides to this course. The grade is not curved at all so it's a bit hard to figure out how you are doing in the class. The quality of the discussion sections vary greatly according to the TA you get. My discussion section was pretty dry for the most part, even if I've enjoyed reading the materials. \nFinal grade of the commentator: A\nWorkload:\nWeekly readings, about 50 pages.\nThree books/novels: Christmas Carol, Communist Manifesto, After the Wall\nOne 6-8 pages paper\nMid-term and Final (both with study guides)\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "March 25, 2014",
            "review_content": "\nLet me begin by saying that I loved the lectures, throughout my entire time in the course. While this wasn't a particular area of history that I enjoy, I learned an incredible amount throughout the semester and really felt like I got to see a unique perspective that was thoughtfully laid out. I came to every class and took copious notes, largely due to how much I learned at each lecture. However, the feelings I took away were mostly negative, due to Professor Tiersten. I am not the type of student to complain simply because of a bad grade, if the grade is explained logically and reasonably. Yet her grading was strangely harsh and completely devoid of logical comments. I had always had a good opinion of her in class, she had always seemed very nice and friendly. Then I met with her to discuss a paper which I felt had been graded much too severely. I've never had a meeting with a professor who was so condescending and disrespectful in my entire college experience. Several times, she would ask me to explain something and then interrupt with her own interpretation before I could get even a sentence out. The punitive grading continued with both exams, it seemed as though she was manufacturing reasons to take points off. The course had great potential, but turned into a nightmare because of the way it was handled.  \nWorkload:\nLots of reading, but definitely manageable. A midterm exam, essay and final exam, all graded unreasonably harshly. \n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "September 08, 2013",
            "review_content": "\nI just want to preface this by saying that I practically majored in Tiersten. I was a history major, and I've known Professor Tiersten for the last four years. This won't be too specific to a class because I've taken so many and my opinion of her is consistent across all classes. I've taken two lectures -- her Modern Europe class, her Colonial Encounters, a Consumer Culture seminar, AND she was my senior thesis adviser... so anything I'm about to say is not based on one class where I might've gotten lucky with a kind TA, etc. She is awesome. She is brilliant, she is entertaining and charismatic, and in response to some of the other less than glowing reviews, she is only intimidating because she does remember everything she's ever read. If you find her condescending, it's probably because you didn't read the readings or pay attention, and therefore said something absurd OR worse-- you googled ID's instead of citing unique information she told you herself--at which point, I'm sure she DID tell you off. There is no doubt that she doesn't sugarcoat anything, but that's what makes her so effective and so helpful. If her emails seem \"rude\" or \"condescending\", they aren't. She just has a million things that she has going on during her days and yet she still responds to emails in record time so... not sure what more students want. And if you reach out to her, she will be there to help you find the resources you need for writing papers, etc. In response to the reviewer commenting on how she doesn't like questions about ID's on the study guides she gives before midterms and finals, it's because everything on there has been covered in lectures and readings, so if you're asking for more than just a clarification, she knows you weren't there or weren't listening, so why SHOULD she tell you again? She is approachable, helpful, and really doesn't make it hard for you to do well, especially in her lecture courses. Both Modern Europe and Colonial Encounters cover a lot of time and places, but you learn a lot. And to everyone commenting on how fast she talks -- no doubt this is true. Just don't be lazy and type your notes instead of trying to write down every word she says. I don't want anyone to think I'm being \"rude\" or \"condescending\" myself in this mini-rant, but I just really think it would be a shame if anyone shopping for classes, especially freshmen, who haven't yet been exposed to professors like Professor Tiersten and don't know better than to solely rely on CULPA, were convinced that she wasn't worth taking. She is, and I would know, because I chose to do it four times... and I WOULD have taken more if there had been more. \nWorkload:\nModern Europe and Colonial Encounters - one midterm and final each, both with IDs and essay questions, that are given to you on a study guide before the exam. Each lecture also has one 5-7 page paper based on a list of questions she provides. Modern Europe has textbook reading as well as novels that are discussed in discussion section. Colonial Encounters is mostly various readings compiled either in coursepack (unless this part has changed) or online. \nSeminar- heavy reading, because it's a seminar and IT IS SUPPOSED TO BE A LOT OF READING, and a 15 page paper. Student-led discussions every week. \n"
        },
        {
            "course_name": "European History Since 1789 (Barnard)",
            "review_date": "June 28, 2013",
            "review_content": "\nThis class was one of the most unenjoyable experiences. The first class, I wasn't thrilled, but I was intrigued to see how the Professor would break down and disseminate all of the information (It is a huge amount of time to cover). The second class left me feeling that all too familiar, \"maybe I should shop around the course catalog,\" but instead, I ignored my initial reaction, and stuck with the class. Though I wish this was one of those stories where I go on to tell you how happy I am to have stuck with it, and how rewarding the class turned out to be, that definitely was Not the case. This was the only class where I had to force myself to keep my eyes open, and please, do not mistake me for a student who sleeps in class, because that is not the case. She rambled on and on about such minute facts, yet sped through significant, monumental events in history. History is not my major, but after having taken an Amazing American History course the previous semester, I felt inspired and I desired to become more acquainted with European history. Well, the only time I learned anything of significance was before studying for the exam, and it was not enjoyable, nor enriching. \nWith that being said, exams are fair, and a study guide is handed out a week before, but you are at the mercy of a TA who grades all of your work (unless you end up in Tiersten's section for discussion). My TA was not pleasant, no rude, just blah and while trying to be helpful, just added more jumble to the mixture. \nAnother note...people remark about how quickly she speaks and this is 100% on point. It was tedious taking notes in her class and difficult to follow along. Just thoroughly unenjoyable. I am not one to write reviews, but I just wanted to forewarn anyone else who might find the subject intriguing, sit in the first class feeling mixed, and tell them to go find a different class!!! It's not hard, just a waste of time.\nWorkload:\nA midterm of ID's and 1 essay (previously handed out to the class with about 70 ID's yet only 5 on the exam, and 10 essay prompts, of which 3 appear on the exam, and you write 1)\nA paper between 5-7 pages\nA final exam, same format as the midterm, except for the inclusion of a short essay (study guide handed out beforehand).\nOn top of the text, there are additional readings, comprised of books/articles, which are tied into your essay exam and are discussed in recitations.\nAlso, 4 movies that are to be watched during the semester.\n"
        },
        {
            "course_name": "European History 1500-1789",
            "review_date": "May 25, 2013",
            "review_content": "\nWhen I say Professor Tiersten knows every little thing about European History, I'm not kidding; it's actually a little bit scary.  She speaks extremely quickly, which makes it really difficult to take notes.  Either do the readings or go to class and try to write down everything she says; don't do both. Literally everything you need for the Midterm and Final she says in class, so I would recommend going instead of doing the reading. All in all as long as you go to class/discussion and do the study guides, you should have no problem in getting an A. \nWorkload:\nA fair amount of reading, one paper, a blue book for the midterm and final.  Discussion section is a joke; just go and you don't have to say anything.  She gives you study guides for the exams which have all the terms and essay questions on them, so just study those and you'll be fine. \n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "October 07, 2012",
            "review_content": "\nLectures are extremely disorganized -- I cannot emphasize this enough. She speaks very quickly and is needlessly verbose during lectures out of her need to sound intelligent (she will say at least three sentences about something that could be explained in one).\nVery rude and makes condescending remarks when communicating through e-mails. Absolutely detests it when people ask her question about the review sheets she hands out. Contrary to the other reviews, she is not easy -- she is a tough grader and is not a very good teacher.\n\nWorkload:\nUnreasonable amount of reading that 99% of the class did not do. Guess why, professor?\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "January 18, 2011",
            "review_content": "\nI thought Tiersten was absolutely amazing and her course was fascinating. Initially, I was nervous about taking this course as the course did not seem interesting. The course was so interesting and Tiersten blew me away with her great wealth of knowledge. I would recommend this class to anyone who enjoys history. It is a must-take course!!!! I walked away from each class feeling accomplished and so much more knowledgable. She speaks rapid-fire style but you'll learn to keep up immediately. The course is also not extremely demanding. You can essentially pick and choose which readings you think are valuable. The midterm and the final are spelled out for you on an outline, so if you study hard--you will be rewarded. \nWorkload:\nheavy readings but some are more essential than others. movie nights which were somewhat interesting. one paper(5-7) on any relevant topic. one final. \n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "January 12, 2011",
            "review_content": "\nI have to agree that Lisa Tiersten is awesome. She is feisty and outspoken -- and most importantly, she'll correct you when you are wrong or saying something dumb. Unlike some professors who allow some to rant forever about something dumb, she'll challenge you if she feels you're a littler (or a lot) off. She's also really funny and down-to-earth. You don't come across that last quality too often while at Columbia and Barnard. The texts we read we're interesting, completely relevant to feminist traditions, and useful for a comprehensive overview of feminist theory. She allows students to facilitate class, so it's peer-led, but she'll jump in when she needs to make a point or guide the discussion in a more correct direction. Definitely worth taking a class with her. \nOh, and she's so cool, she even created a snack schedule for the class. \nWorkload:\nTypical seminar reading (and work): 70-300 pages. Weekly discussion post. 1 class facilitation with another peer. 1 15-page paper. \n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "December 21, 2010",
            "review_content": "\n Lisa Tiersten is AWESOME. She is so interested with what she's talking about. And she really wants us to be interested, too. She speaks really animatedly and wildly which is kind of funny. She also tends to speak too quickly, which can be a little bit hard to keep up with when taking notes, but overall I absolutely LOVED this class. I actually LEARNED. She's also incredibly friendly and goes out of her way to help and get to know her students. I highly recommend this class if you're not good at history- this class will keep you interested with a relatively light workload to match.\nWorkload:\nAbsolutely manageable! Interesting readings and movies. One short paper (7 pages), 1 midterm- you get the question and essay options in advance so you can really prepare, 1 final, same style as midterm. \n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "December 19, 2010",
            "review_content": "\nAs the other reviewer have noted, Tiersten speaks very quickly because (I think) there is a lot of material to be covered. The course is very broad and the class is fairly large, but she learns every student's name anyway.\nThere are a lot of movies to watch for this course which I didn't enjoy...pretty much because I can watch movies on my own time. I did, however, enjoy Tiersten's lectures even though they are fluid and pretty much consist of a lot of her comments---mostly tangentially related to the topic at hand, finding her glasses, etc. \nLots of students participated which was mostly good but sometimes bad, but Tiersten really enjoys listening to students, encourages comments, debates, questions, etc. and is generally receptive, enthusiastic, friendly, and laidback even though she's extremely intelligent (Profs. Dabashi and Spivak---take notes please). \nThe reading is also manageable. I hate the time though! Really...change the class to later in the afternoon. I hate waking up before 2pm. \nIn addition, she is really nice to look at. Probably even hotter in her younger years.\nWorkload:\neasy paper + easy, light readings\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "November 21, 2010",
            "review_content": "\nLooking at Professor Tiersten's glowing reviews, I was eager to take this class as a junior history major. While obviously a talented historian and an enthusiastic, if wildly disorganized lecturer, Tiersten is all over the place with this course. The vague subtitle of the course--European Culture in the Age of Empire--is telling: with such a broad time period to cover, Tiersten is unable to focus on either domestic events or their consequences for empire. Lectures are scattered, class discussion painfully reductive, and Tiersten's sweet-but-scatty appeal is undercut by her habit of brusquely interrupting students in order to tell would-be amusing anecdotes. Her classroom manner could use a dose of Professor Snape--she seems unable to exert authority, and lectures are ruined by her stream-of-consciousness remarks on her coffee, her missing glasses, and the attractiveness of the male actors in the clips she shows.\n The course jumped from region to region without even attempting to make parallels or comment on trends in colonial policy, which was my biggest problem with it. This is a sorry excuse for a history class at best. \nWorkload:\nRidiculously easy. About one-fourth the amount of reading for an average 3000-level history course. Could've used a lot more secondary sources; as it was, we barely covered the topics presented. Midterm, short paper, final.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "January 11, 2010",
            "review_content": "\nProfessor Tiersten drinks an entertaining amount of coffee during class. She also talks REALLY quickly, which often makes it difficult to understand what she is saying, but she is really nice and would definitely meet with you outside of class if you had any questions. Her papers/exams are pretty straightforward and as long as you follow directions, it's pretty easy to get an A in the class. The readings for class are often long and sometimes quite boring, but if you do at least some of them, you are totally fine for the exams, so that shouldn't discourage you from taking the class. Generally, the class was pretty interesting and Professor Tiersten is really nice and pretty understanding about things, so it's worth it to take the class! \nWorkload:\n1 short paper (7-10 pages), 1 midterm exam (IDs and Essays- handed out before-hand), 1 Final exam (same setup as midterm) \n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "November 29, 2009",
            "review_content": "\nProfessor Tiersten is, hands down, the best history professor offered at Columbia.  She is so knowledgeable; the information she is able to convey coherently in a lecture setting is astounding.  More importantly, she doesn't assign impossible amounts of work.  For either lectures or seminars, her paper assignments are focused on quality, not quantity.  Lectures require a crisp 5-7 page paper, and seminars a 15 page paper, both of which are very manageable.  As for her reading assignments, I admit that she does demand a large amount of reading, and expect for it to be done.   However, the reading material is always carefully selected and interesting.  Perhaps the best aspect of her reading lists is that she rarely requires the reading of a whole book, but rather selects choice chapters which highlight the author's key points and argument.  Professor Tiersten wants you to enjoy and learn from her classes, which is one of best traits.  A true gold nugget!\nWorkload:\nManageable.  Provides study guides for finals and midterms (come on- this alone should persuade you to take a class with her!), short and crisp paper assignments.  Reading can be high volume, but it is interesting and worth it.\n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "December 27, 2008",
            "review_content": "\nI'm really only writing a review because Professor Tiersten mentioned culpa several times in our last class...\nThis was a wonderful class, and Professor Tiersten was a wonderful moderator. Like others said, she has a lot of energy, which I feel is necessary in this class. As the course progresses, you get into more controversial topics, and people feel very strongly about them. We covered pornography, the ethics surrounding nannies, maids and sex workers from \"third world\" countries who work in the United States, and the \"death\" of feminism. (As well as many of the post-Simone de Beauvoir historical \"phases,\" I guess, leading up to more modern topics.) Professor Tiersten knew exactly how to provoke us to encourage a heated, yet rewarding, debate. \n\nWorkload:\nWeekly courseworks postings, moderating one class with a partner, 15 - 20 page research paper on an issue in contemporary feminism \n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "December 19, 2007",
            "review_content": "\nThis is by far one of the best History classes I've taken at Columbia so far. Professor Tiersten is a very organised lecturer and provides handouts which she adheres to very well. Also, it helps that the reading material and films we saw were very interesting. The subject matter was very enticing as well. We dealt with stuff like Orientalism, modern day tourism, British Imperialism etc. It's one of those courses which makes you get a better sense of the world we live in today and its cultural tensions. Professor Tiersten is also very receptive in class towards comments (even though sometimes she should have shut off some dumb-ass columbia boys).\nGrading is fair. She gives out study guides before the midterms and finals, so it makes studying a lot easier.\nWorkload:\nlight. 1- 2 readings a week. 1 essay. 1 mid term. 1 final. I felt this class was a lot lighter than other classes\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "May 14, 2007",
            "review_content": "\nProfessor Tiersten seems like a very nice/interesting/intelligent person, so I hate to write a negative review, but I was not a fan of this class.  If you've taken any sort of high-school Euro history class, then this class will be a complete recap.  That would be fine if Prof. Tiersten added a new perspective to familiar information, but she doesn't.  This is especially frustrating because I am sure she has an interesting perspective on European history (why else would she have been hired?), but she never lets it show in her lectures.  Instead, her lectures sound as if she is reading them straight out of a textbook.  Not only that, but she talks SO fast.  This isn't totally her fault, as 1789-present is a ridiculously large timespan to cover in one semester, but it's hard to absorb anything when she's talking that fast.  Also, as much as I hate having to find room in my schedule for weekly discussion sections, I really wish this class had had weekly sections. At least then I would have been accountable for the reading. Instead, there is this awkward arrangement where we miss lecture every few weeks to meet with a TA in a small-ish discussion section.  Over the course of four meetings, the TAs barely have the chance to learn your name.  Furthermore, the sections are so big that it's easy to get away with not having done any of the reading. Yes, I should have done the reading anyway, but I was not engaged at all with this class and had little incentive to do all the work.  Basically, if you're looking for a filler class that probably won't stress you out very much, then this is fine. If you're looking to gain some insight on European history, this isn't the right class for you. \nWorkload:\nA fair amount of reading which, as far as I could tell, very few people actually did.  A 5-7 page paper.  Midterm and final, both with comprehensive study guides.  Four movies over the course of the semester, shown in the eveningsÂ—I ended up having schedule conflicts and missed all four, and it didn't seem to make much difference. \n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "May 10, 2007",
            "review_content": "\nSince most of what needed to be said was already said, I want to add just a few quick points about Prof. Tiersten and the class, trying not overlap in content too much. First, it is easy to notice that Prof. Tiersten was a great gal in her younger years, though sheÂ’s not really old Â– maybe 35-40? Â– nowadays either. As a result, sheÂ’s really sociable in general and really cute to watch; she manages to be adorable even when she lectures. In terms of academics, all I can say is \"wow\". I donÂ’t think there anything this woman doesnÂ’t know about history. On one hand, this is a good, because if you have a question (though she doesn't take questions during lecture, given the turbocharged style described in previous posts) she has an answer Â– a good and long and informed and authoritative one. On the other hand, this is quite intimidating, especially if youÂ’re new to history. SheÂ’ll tell you what the most common type of bread in Southern France 1790 was, and why that bread was replaced in 1795 with something else, and youÂ’ll be left wondering: do I need to know this?? The good news is that you donÂ’t; itÂ’s just that her mind functions like a fractal Â– once she gets talking about something, given that she know so much about anything, details like that just pour into her brain. You have a study guide for the exams, and thatÂ’s what you need to know. \nAs for the class, I do have some words of caution, though my final conclusion is that this is a class worth taking. First, there are a lot of posts here saying this is an easy ride. ItÂ’s true, you can skip lectures every now and then, and itÂ’s also true that you can cram for a week before the exam and get an A, like I did. However, thereÂ’s massive amounts of information that you need to take in, and despite Prof. TierstenÂ’s great lectures (as someone else said before, donÂ’t take too many notes Â– just write down the main ideas and enjoy listening to her; itÂ’s really worth it), everything appears disorganized. ThatÂ’s because the textbook is really poor in organizing history, skipping back and forth between the years until all youÂ’re left with is some random dates and names and nowhere to place them. To add to this, Prof. Tiersten has her own teaching plan, which sometimes deviates from the book. Finally, youÂ’re given a study guide before the exam in which the IDs are mixed with only slight consideration for their historical order. In the end, if youÂ’re looking at \"Red Shirts\" on your study guide and you werenÂ’t paying attention in class, you have some serious detective work to do until you find the term in your textbook Â– as anyone from the French Revolution to the fall of the USSR could have worn red shirts (hint: itÂ’s GaribaldiÂ’s troops). With these caveats (donÂ’t expect an easy ride and pay attention in class), I think this is one of the best history classes you could take. The lectures are simply amazing and so is the teacher, the period covered is really interesting (French Revolution, Napoleon, the two world wars, colonialism, communism, post-war Europe), and, overall, it's easy to get a good grade IF youÂ’re paying attention and spend some time studying before the exams. Although the assigned readings are interesting, the discussion sections are not that useful Â– on the contrary, theyÂ’re quite annoying. Make sure you attend though Â– they count for 15% of your grade.  \nI have to say that I held back on the praise and addressed the rougher sides of the class solely because everything positive about it was already said in other reviews. This is a class not to be missed, and I highly recommend it. I don't think there are many students in the class who haven't enjoyed it, and that's saying a lot for a class of more than 100. \nWorkload:\nFairly light. About 50 pages/week which can be skimmed or simply skipped Â– just make sure you know what theyÂ’re about so you can throw in you 2 cents in discussion. If you have the time, theyÂ’re worth reading. 4-7 pages paper, doable overnight. Midterm and final, with essays and IDs taken straight from the study guide, which is distributed one week in advance. No curveballs, what you see on the study guide is what you get. Overall: definitely doable, and getting an A is not hard at all.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "April 07, 2007",
            "review_content": "\nIf this class were a PBS program, I would've enjoyed it--there was a lot of information presented in fairly neat schemes. However, having to remember that information and put aside doubts about her generalizations into the previously-mentioned schemes makes the class a bit annoying. I think this is due to the awfully large span of the course (over 500 years!) and not the professor. She herself seems very friendly and the lectures were interesting (again, if I was just listening for fun and not feverishly taking notes, I would've enjoyed the class more). Everything was graded fairly and on time.\nWorkload:\nMidterm, paper, final. Interesting readings that you need to be familiar with for exams (but they're often discussed in class, so I'm sure one could get by without doing them). \n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "February 06, 2007",
            "review_content": "\nI have read all of the reviews, especially the ones relating to the euro hist class, and I am baffled as to how anyone can say that L. Tiersten is either a great lecturer or the best professor they ever had. The lectures are so disorganized, and Ms. Tiersten talks as though she is in some sort of a speed talking contest, that it is pretty ridiculous. I would say, skip this class, especially if you are more interested in history than philosophy.\nWorkload:\nNo problem with the workload.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "January 08, 2007",
            "review_content": "\nProfessor Tiersten is one of the most intimidatingly intelligent teachers I've had yet at Columbia, and her rapid-fire lectures can be overwhelming. This class, about the effects of colonialism on imperial nations, was a fascinating study of how perceptions of the primitive changed through the centuries. Since it's so broad--500 years and an entire globe--she focuses more on the anthropological theories than the actual dates and names, which is fine if you're a theory person. Right after the semester ended, I took a vacation in Costa Rica, and found myself talking about it more than any other class. Pay attention and take good notes and you should do well and get a lot out of this one.\nWorkload:\nBig coursepack (bits of which are more useful than others--skip the really dense jargon-heavy stuff) and weekly handouts, 8-10 page paper, in class midterm and final. \n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "December 11, 2006",
            "review_content": "\nFabulous professor, fabulous class.  Tiersten is very hip and can easily relate to her students during seminar discussions, plus she has so much energy.  The readings about cultural feminism, pornography, pop culture, nannies in the USA, etc. are fascinating.  Seriously the best seminar I have ever taken -- Tiersten creates such a great class atmosphere!\nWorkload:\nWeekly courseworks posting, host seminar discussion once with a partner, 15 page paper on any topic of your choice. \n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "October 24, 2006",
            "review_content": "\nI've had the opportunity to take two very very different classes with Lisa Tiersten. \nThe history class, which I took solely to fulfill the requirement (I hate history) was a large lecture, fast paced and often leaving me in the dust. She goes extremely quickly, and if you don't have much of a mind for history it can be quite intimidating. The other reviewers do a good job summarizing this class, so I'll leave it there.\nThe women's studies class, however, is quite the opposite. A small women's studies seminar can be fantastic or awful depending on the teacher, and i LOVE Tiersten for this class. While she is a little ADD and a little all over the place, her class is thoroughly enjoyable. She has a very clear idea of where she wants the class to go, and is good at linking the theoretical points to the broader climate at the time. I guess that's why she's a history teacher. In the class we have really interesting and in-depth conversations, and it really feels like a safe space to share and learn. Exactly what a women's studies class should be. I don't know if she'll be teaching it again soon, but it's much better than the other wmst seminars I've taken, I highly recommend it. \nWorkload:\nhistory: see other reviewers\nfem texts 2: a lot of reading (but that's to be expected in a seminar), a thought posting (to make sure you've done the reading) on courseworks before every class, lead/moderate one class session, final 10-15 page research paper on whatever you want. \n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "August 21, 2006",
            "review_content": "\nLisa Tiersten is the best professor I've had so far, bar none.  She seems like a professor who isn't here to write books and monographs and up her standing; she's really just here to teach.  In a class of this scope, it's very important for the professor to know how to emphasize certain events and gloss over others, how to employ anecdotes to illustrate a broader theme, and how to use visual aids successfully.  She does all three of these masterfully.  She successfully coveys the basic historical facts and dates, but more importantly, she gives you a feel for the period, allowing the student to transcend his present day worldview and enter that of, say, a 19th century British politician or a Russian peasant at the turn of the 20th.  She's also a nice person, which counts for a lot, because she's got a great sense of humor and she's the very opposite of pompous.  Finally, I got to sit in on her discussion section (props to any professor who gets involved with their own discussion sections) and I liked the way she let students think things through on their own terms but how she also wasn't afraid to tell a student when his interpretation was a bit off.  You will enjoy this class so much that you won't want to take notes during classes; you'll just want to listen.\nWorkload:\nI found the workload fairly light, but the coursereader especially is geared less towards historical events and more towards philosophical treatises, etc. that try to color in the spirit of the age.\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "May 30, 2006",
            "review_content": "\nI liked her a lot, overall, although maybe not as much as some of the students who wrote the reviews below. The class covers a lot of material (so much that many interesting historical events and trends have to be skimmed over or crammed into the end of lecture), but Tiersten does a good job with it. She obviously knows her stuff, and she's especially good at linking major historical events to the intellectual and artistic trends that they influenced. (Her interpretations are pretty standard, but she always provides a couple alternative analyses for each major topic.) Even though she speaks very rapidly, she's usually very engaging and almost funny at times. She was always running out of time, but that's the nature of a course that attempts to cover as much as this one. I liked her lectures most of the time and would definitely consider taking more classes with her.  \nWorkload:\nThe reviewer who said Tiersten assigned too much reading was way off. The textbook can be skipped (just go to lecture... you can even skip that a couple times if you want to), and the course packet readings are usually around 30-50 pages per class. The outside books are longer, but you have more time to read them. She also requires screenings of various movies (most of which were in French, set during wartime, and included a murder, trial, and execution... don't ask me why) about once a month. Overall, not too bad. She even provides study guides with all the IDs and essay questions for the mid-term and final, so if you don't know what to study then you're beyond help. The only aggravating part of the class was the discussion section, despite the admittedly nice TAs, and even those are not weekly. Oh, and there's a short term paper (5-7 pages, I think) that can be done in a day if you're pressed for time. In case you can't tell, this is an easy course.\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "April 17, 2006",
            "review_content": "\nTiersten's class seemed very boring to me and I didn't particularly like her lecture style.  She didn't utilize visual aids much and she overwhelms you with information, often talking so fast it's hard to understand her.  She handed out outlines at the start of the class, but the material all seemed to be crammed together so that it didn't seem as structured as maybe she intended it to be.  She was a little confusing at times.  She was, however, always prepared.  And even though her lectures were rather vapid, part of that may have just been the course itself.  Covering so much history in so little time tends to make the course more about names and dates since there is less time to go indepth.  Survey courses in history are, perhaps, inherently bad.\nWorkload:\nThere was a rather significant amount of reading outside of class.  There was a course reader, various books, and a text book.  You could probably easily get away with not reading the textbook if you are able to pay attention in lecture and take good notes since it's essentially the same information.  However, since I was often confused I found the textbook a necessary supplement.\n"
        },
        {
            "course_name": "European Women in the Age of Revolutions, Colonial Encounters",
            "review_date": "January 22, 2006",
            "review_content": "\nI love Professor Tiersten. At a school where professors often seem aloof or more involved with other \"more important\" things than teaching, she takes a legitimite interest in her students. She makes it a point to learn the name of all the students in her class (50-100 people in a class), and you just get the feeling that she wants to be there, is excited to be teaching the material, and wants you to like it too. Therefore, the classes are jam-packed with material. It seems that she loves it so much, that she can't stand to leave something out.\nShe also wants you to do well. The workload for the class is relatively light, because by her theory, its better to have a manageable workload and know it will all be done than have tons of books which students probably won't get through. Unfortunately, it seems most students take that to mean that the work doesn't have to be done, and class discussion is dominated by the same people every class (about 10-15 people who probably read). She also gives you, as other reviewers have stated, very helpful study guides for the midterm and final. Her 5-7 page research paper is also a lot of fun, and not too difficult (and is the same for both classes).\nLisa Tiersten's classes are a refreshing reprieve in a department that can sometimes feel like its only goal is to kill your soul: she's enthusiastic, she's funny, she's interested, her assigned workload is moderately light, and she really wants you to do well. There are no surprises in this class, and she's also hilarious and one of the nicest professors I've encountered.\nAnd despite what a previous reviewer said, most people I know got an A or A- in this class, and I think the percent A's in the class is around 65%. Its not hard to do well, and if you do the work, you will.\nWorkload:\nFor both classes: weekly readings that vary in page numbers and interest, one 5-7 page paper, midterm and final, both with very helpful study sheets. Very very manageable.\n"
        },
        {
            "course_name": "European Women in the Age of Revolutions, Colonial Encounters",
            "review_date": "January 22, 2006",
            "review_content": "\nI love Professor Tiersten. At a school where professors often seem aloof or more involved with other \"more important\" things than teaching, she takes a legitimite interest in her students. She makes it a point to learn the name of all the students in her class (50-100 people in a class), and you just get the feeling that she wants to be there, is excited to be teaching the material, and wants you to like it too. Therefore, the classes are jam-packed with material. It seems that she loves it so much, that she can't stand to leave something out.\nShe also wants you to do well. The workload for the class is relatively light, because by her theory, its better to have a manageable workload and know it will all be done than have tons of books which students probably won't get through. Unfortunately, it seems most students take that to mean that the work doesn't have to be done, and class discussion is dominated by the same people every class (about 10-15 people who probably read). She also gives you, as other reviewers have stated, very helpful study guides for the midterm and final. Her 5-7 page research paper is also a lot of fun, and not too difficult (and is the same for both classes).\nLisa Tiersten's classes are a refreshing reprieve in a department that can sometimes feel like its only goal is to kill your soul: she's enthusiastic, she's funny, she's interested, her assigned workload is moderately light, and she really wants you to do well. There are no surprises in this class, and she's also hilarious and one of the nicest professors I've encountered.\nAnd despite what a previous reviewer said, most people I know got an A or A- in this class, and I think the percent A's in the class is around 65%. Its not hard to do well, and if you do the work, you will.\nWorkload:\nFor both classes: weekly readings that vary in page numbers and interest, one 5-7 page paper, midterm and final, both with very helpful study sheets. Very very manageable.\n"
        },
        {
            "course_name": "European Women In the Age of Revolutions, Colonial Encounters, European History Since 1789",
            "review_date": "December 27, 2005",
            "review_content": "\nI absolutely love Professor Tiersten. While many students claim she is a bit boring at times, as her lectures are jam-\npacked, she is so well versed  in the material that it's engaging just to hear the facts she can string together. \nShe's incredibly nice, understanding, and an equally fair grader. Her review sheets for the midterm and final are easy to study for, and her papers are full of interesting topics of which you have a choice. I highly recommend taking her class if not to take a load off in the ever heavy load of history courses, but to enjoy having a teacher that loves what she is teaching, knows what she is teaching, and is interested in her students doing well. She's also laid back and incredibly happy to have people participate.\nWorkload:\nmoderate-light readings, easy to do for classes (sometimes a bit tedious as she basically goes over the whole thing in class). Midterm and final (review sheets given with essays and id's) and a term paper.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "December 17, 2005",
            "review_content": "\nI highly recommend this class for anyone who has any interest in history whatsoever- or even if you're interested in the current events today relating to colonialism because Prof. Tiersten makes this class so interesting.  She covers a lot of material (and talks REALLY fast so be prepared!!!) but it's all extremely interesting and you'll be glad you showed up to class.  The paper assignment is a fun way to go into more detail of one of the topics you may have wanted to learn more about. Overall, great class even if you're not a history major like me.\nAlso- the movie assignments were really worthwhile- you get to see some great movies including Chocolat (not the one with Johnny Depp!), Cannibal Tours, Tarzan, etc. \nWorkload:\nPretty decent- reading isn't too bad, a couple movies to see, a midterm and a final (she gives you review sheets for both and she wants you to do well)\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "December 17, 2005",
            "review_content": "\nTiersten is definitely a funny individual.  One thing you should know about this class is that it is not a survey of what happened in colonialism, it is about how colonialism affected European culture.  Besides that, Tiersten definitely keeps lectures entertaining.  Sure, she interupts herself, and talks about how she might act crazy, but she always has a definite point, and you will learn from this class if you just pay attention.  Also, it's really, really, easy.  One paper, and an easy final and midterm. No worries.\nWorkload:\none 5-7 page paper, reading you don't have to do, and a final and midterm.\n"
        },
        {
            "course_name": "European Women in the Age of Revolutions",
            "review_date": "June 19, 2005",
            "review_content": "\nI agree with many of the previous reviewers, good and bad. People do talk crap about Lisa Tiersten - but I think these people are missing the point. True Lisa Tiersten repeats and interrupts herself, true her lectures can sometimes be disorganized and true sometimes she doesn't tell you as much about something as you'd want to know. But, the beauty of this class is that none of that catches up with you later on. Extraneous, interesting details are presented in that disorganization - but, there's an excellent chance you'll never ever be tested on it. If you get the gist - awesome, you know something more about it, if you don't - oh well! you got the main points, right? If you want to know more about it - chances are there's a lot more about it in your hundred-page course reader, text book, and, if its not, she's so approachable, you can just ask her, and as someone said before - she'll come in with more information about it than you possibly could have wanted. She's so enthusiastic - and that is amazing in a professor. \nHer classes are ones that you never have to worry about, you never feel tremendous pressure over and to boot - she's really fun. I mean, if you're looking for deep, in-depth, pushing-you-to-the-edge-of-your-intellectual-seat history classes, Columbia and Barnard have plenty, but yeah, this definitely isn't one of them. If you want to learn some interesting things in a fairly-easy survey class with an enthusiastic, funny professor, then this is it. I would take many more Lisa Tiersten classes.\nWorkload:\nMidterm, Final (she gives you very helpful study guides for both), 5-7 page Paper (about a book relating to the subject, basically). And class participation (she says it counts for something like 25%, but really, in a lecture class that big, how can everyone participate.). Also, the class discussions got annoying because they were dominated by the same 4 people (i.e., the people who actually read). \n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "January 17, 2005",
            "review_content": "\nA lot of people trash talk Prof. Tiersten for her broad lectures or, well, fairly easy classes, but frankly there aren't enough teachers at CU and BC who give solid, survey introductions to non-Western history.  Colonial Encounters is all over the place, and spans centuries; the course reading and lectures lay out a thematic overview of material you simply can't cover in detail in one course.  So: Don't take it if you're looking to learn everything about one area or period.  Take it if you want a smart, funny, well-informed lecturer who tells interesting stories and can help you connect what you already know to some broad, historical patterns.  Tiersten is a fantastic speaker, a truly dedicated teacher, and nice to boot; her class is one that first-year history students should kick down the door to take.  Also, ask her about the death of Captain Cook.\nWorkload:\nReally, really easy.  5-7 pg paper, midterm+final (id's, essay); she always gives you a list of the id's beforehand, and she's a VERY generous grader.  She's not anal about lecture attendence, but you should show up anyway.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "December 30, 2004",
            "review_content": "\nA fairly good course that deals with the concept of empire throughout history, with some profound similarities to the present day. Tiersten is a good lecturer and tries to get the class to participate, which judging by the large size of the class is not always successful. I think a discussion section would have been a good addition to the lectures, but that's just me. She also speaks VERY fast, though you don't really need to get down everything she says.  Overall, a pretty good course.\nWorkload:\nMidterm, final, short-ish paper on your own topic. All very reasonable and certainly doable. The reading amount for the class was on the low side, which is always good.  \n"
        },
        {
            "course_name": "Women in Modern Europe",
            "review_date": "August 30, 2003",
            "review_content": "\nUnfortunately, I think this class won't be offered again in the near future. However if you ever happen to come across it in the pencil book, take it. I didn't miss one lecture, and really enjoyed the whole of the class. We talked about everything from cottage industries to the birth of condoms and everything in between. Tiersten is one of the best professors in the university. Especially in the area of cultural history, so she got to show a lot more of her brilliance than you would see in a regular intro class. I cannot recommend this professor enough. The class could have easily been terrible, but she managed to make it all interesting and accessible. Very interesting readings that are very fair in length, and paper topics are always interesting when Tiersten is involved. Take this class. \nWorkload:\n3 movie screenings (you aren't tested on them), midterm, final and 5-7 paper. Both the midterm and final have prepared IDs and essay questions so it's easy to get an A if you want it -- the paper requirement was to read a work of literature and put it into the historical context. This was not restricted to women, she even remarked herself that talking about women is difficult without talking about masculinity, as it tends to be a pully-effect relationship.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "December 07, 2002",
            "review_content": "\nI would not recommend this class. I took it to fulfill one of the history major requirements and regret it greatly. While the class is incredibly easy even for a Barnard course, the lectures might as well be read out of a textbook. Prof. Tiersten is nice enough, but the lectures are a constant stream of names, facts, and dates that superficially engage with events. Covering Colonial Encounters is a daunting subject, and so instead of focusing on a few events this becomes a survey course with enough information to make one interested in a subject but never enough to make one knowledgable. The course seems geared towards maximizing information for ids for the exams. Further, Tiersten does not know much of the material besides that gotten from textbooks. When talking about Africa for instace, she ignored many significant events in South African history in order to make her explanations seem as clear and logical as possible. Unfortunately, history is not always clear and many factors, not 1 or 2, influence events. This is a simplified history course geared towards memorization. Nobody does the reading and even the TAs are bored, either not showing up or looking out windows. The discussions are even worse with a few students talking and most ignorantly.\nWorkload:\nVery minimal reading, though surprisingly interesting. A very short paper. Two exams based completely on memorization (which she gives you the questions for beforehand). Easy but boring/superficial class with a nice but simplistic professor.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "May 20, 2002",
            "review_content": "\nLisa Tiersten may be the best professor you will ever have; not one of the best - THE BEST. She is fascinated with history; she is monumentally enthusiastic; she is an excellent lecturer. She will give you an outline of every lecture complete with ID's which will turn up on the study guide for both mid-terms and finals - so if you do them as you go, you will have half of your studying done by exam-time. You might really want to consider this because her exam-style is to give out prepatory essays and a slew of ID's. If you prepare the essays and the ID's you will do well - that's all there is to it. But there are a lot of essays (between 5 and 7) and ID's (around 50) to prepare. They require a good deal of thought and a really thorough knowledge of lectures, plus some of the text and readings but they show up word for word on the exam - no curve balls. While she does tend to digress, it's only because she can't stand not covering items of interest more thoroughly than she gave herself time to do on the outline. This means that she talks REALLY FAST; it's good to study with others because it's almost impossible to get it all and her lectures are she so interesting that there will be times you simply won't want to be distracted by taking notes. She really cares about her students; wants their input and will be blunt, but never rude, if she doesn't agree. She is probably the world's most popular adviser so her office hours really fill up but she will always make time - just be prepared and realise that, just like class, she will talk fast. I would take any class with this woman. She could probably make tax code exciting. Any class you take you will walk out having been thoroughly grounded in key ideas, read some excellent stuff, seen a few good movies, and , on top of it all, it's impossible not to catch her enthusiam. I wonder how many people she has converted to the major.\nWorkload:\nReading is fairly light; one short paper, a mid-term and a final. A ton of stuff to study for exams so best to get on it early but otherwise, a fairly light load. A fair grader.\n"
        },
        {
            "course_name": "Colonial Encounters",
            "review_date": "March 15, 2002",
            "review_content": "\nI enrolled in this class because I needed something to fit in the time slot, and ended up completely loving it despite thinking it was going to be the most boring thing ever. The class was overcrowed but Tiersten managed to know almost everyone's name within the first month. She sometimes seems a bit crazy but her enthusiasm is contangious and she's quite brilliant. If she doesn't know something, she'll return the next class armed with more of an answer than you really wanted. She works hard, cares about her students, has a really good turn around time on grading (which she's quite fair about) and genuinely loves what she teaches. Her lectures are a bit disorganized and she interrupts herself often, but she's easily approchable and does get through the material. I left knowing more than I expected. Seriously, I'd take any class this woman taught and recommend her to anyone. Prior knowledge of history is not required, most of the class knew nothing about history in general. You won't find a bunch of know-it-all history majors here. \nWorkload:\nMidterm, final, three movie screenings and a 5-7 page paper. The paper is open and interesting, and you get review sheets for both exams a week ahead of time. Grading is very fair and there are no discussion sections.\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "April 08, 2001",
            "review_content": "\nAbsolutely the best teacher you'll ever have. Her lectures are interesting, thorough, and really lively. She's an energetic person and it radiates through all that she does. Her grading is fair and accurate - and if you go to class, there is no way you can do poorly. No messy discussion sections to make room for outside of class - they happen every few weeks in class. She knows her stuff like nobody else, and is just a great teacher to be around. Seriously, you could have hated history all your life, but take this class and fall in love with it. She does that to you.\nWorkload:\nLots of reading, but most of it can be skimmed. A few movies to go to at nights, but nothing you can't live without. A paper, a midterm, a final. If you go to class, you WILL do well. (and you'll want to go to class.)\n"
        }
    ]
}