{
    "prof_info": [
        {
            "prof_name": "Ken Light",
            "prof_id": 12569,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "December 14, 2016",
            "review_content": "\nTook his class last year and still remember the way he suggested he'd read all the CULPA reviews, bad ones of course. So I am here to do him some justice. To be clear, I've taken 2 psych lectures and 2 labs and hated ALL of them, not because I wasn't interested in psych but because they were unnecessarily time-consuming.  That being said, Prof. Light really taught me a lot and prepared me well for the more \"advanced\" psych lab. He always stayed late after class to answer questions and really hoped everyone to acquire the skills for basic psych research. \nWorkload:\nlike any other psych lab, quite a bit. \n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "September 30, 2016",
            "review_content": "\nI took this class last semester and am currently three weeks into an upper level psych lab with a different professor, feeling nostalgic and compelled to leave Professor Light a review. While, like other reviewers have suggested, I didn't find the course itself to be especially interesting (it is an intro course after all, so it's mainly about beginning how to conduct an experiment, use excel, write a paper (etc), I definitely learned the necessary skills and am now appreciative of that. I really think Professor Light was a great professor. It was clear he cared about what he was teaching, which helped, and was willing to meet with students outside of lab / genuinely cared about students doing well, and unlike what other reviews say, knew that a 1.5 intro lab wasn't anyone's first priority. While the workload did seem to be quite a bit at times, I'd say it was pretty fair overall. As I'm now taking psych lectures/labs with other professors, I realize how great of a person he was in terms of how he treated his students and how much he cares about the material and about teaching it; unfortunately, this doesn't seem to be a combination most professors have. Professor Light contributed in part to my decision to major in psych–– something I thought I would NEVER do, as I took this with the sole intention of fulfilling my science requirement. And last but not least, I'll forever remember his iconic April Fool's joke. \nWorkload:\nManageable overall. lab report due in installments to eventually be turned in completely, 3 question sets, final presentation. \n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "June 13, 2016",
            "review_content": "\nAMAZING PROFESSOR!!! The class itself is boring, but he really teaches you what you need to know. If you have no experience with writing papers or running experiments, take this class. I will say that it is a bit of a workload, but if you apply minimal effort, you'll get an A. He also is super open to meeting and helping as much as possible.\nWorkload:\nExperiment- final paper\nSections due every week (methods, introductions, etc)\nArticle + question assignments (also our final- semi-difficult if you didn't study)\n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "May 13, 2016",
            "review_content": "\nKen Light is boring, but that isn't the problem. The problem is that he takes himself way too seriously and threatens to fail you for the smallest of reasons (or, more importantly, for your missing class for RELIGIOUS REASONS. THAT IS NOT OKAY.) In my mind, that disqualifies you as a qualified professor. Period. Don't take his class, especially if you're religious in any way. He will not understand. \nWorkload:\nEasy, except for the final lab report, which takes lots of time. \n"
        },
        {
            "course_name": "Intro to Psychology Lab",
            "review_date": "May 06, 2015",
            "review_content": "\nThe below reviews are, quite frankly, ridiculous, and clearly written by students who didn't put any effort into the class. I think we can all acknowledge that Intro Psych Lab is not the most enthralling course that Barnard has to offer. All the same, it teaches the fundamentals of lab work in psychology, a skill which an alarming amount of people simply don't have upon entering college and are in desperate need of learning. \nProfessor Light is, simply put, a brilliant professor. His specialties are in behavioral neuroscience and intelligence. Have a one-on-one conversation with him (that is, if you're not the typical \"I'm only taking this to fulfill the requirement\" students who probably doesn't give a damn and shouldn't be allowed in the already scarce psych labs, anyway) about his research and you'll be floored by his knowledge and inspired to take more upper-level psych courses. I've heard great things about his Learning Lab, and would encourage anyone who wants a hands on experience to try it. He does a damn good job of trying to make required material as interesting as possible-- a nearly impossible task, which Light does with humor, wit, and the occasional 80's or early 90's theme song. \nThe workload is reasonable and entirely manageable, and Professor Light is incredibly approachable and a very funny, interesting guy if you actually take the time to get to know him. Unlike many Columbia and Barnard professors, Light cares about what you have to say, is incredibly available to help with assignments and explain material, understands that his is not the only course you're taking, and sets reasonable requirements and goals for coursework. Showing even a modicum of intelligence and effort (increasingly a rarity at this school, I'm sorry to say) will set you on the right track to success. Put in the time and effort and you will see the results (as all courses should be).\nI couldn't recommend Professor Light any higher.\nWorkload:\nCompletely reasonable. Lab reports (which build skills such as APA formatting that you'll use not only in other labs but also in the real world), a handful of other assignments, and a very manageable final exam if you pay attention and take good notes. \n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 19, 2015",
            "review_content": "\nThe worst professor I've ever had. The worst lecturer, cares waaaay too much about his class, nitpicky, critical, dry and uninspired. He finds joy out of forcing his students to sit through his monotonous lectures for three hours. He makes you do group projects that take weeks to complete. He needs to chill. I don't know why he hasn't been fired yet. \nWorkload:\nUGH something dumb and boring every week that no one cares about\n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 19, 2015",
            "review_content": "\nAvoid him at all costs. He will harass you and threaten to fail you. He tries to find a reason to get you in trouble and will make one up if he has to. His classes are unnecessary and tedious. A total waste of time. \nWorkload:\nRidiculously long, boring and heavy. \n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 13, 2015",
            "review_content": "\nKen Light is probably the most well-intentioned professor one could imagine. Yes, learning the very basics of APA style and how to graph on excel can be boring at best, Prof Light is ready and willing to help you every step of the way. It's unfortunate that the class is 3 hours once a week because it's hard to remain engaged from week to week. At the end of the day, he's really there because he wants you to succeed. He's very available via email and in person, to answer any and all questions. He writes very clearly on the board, which is almost unnecessary, but honestly very appreciated. If you're ever confused about anything at all, he's willing to explain. Also, as another reviewer said, he's really helpful about getting you into a section. At the beginning of the semester, he has everyone fill out a form with their top choice sections so that he can get everyone (or everyone he can) into a section that fits their schedule. I didn't get into the section I was originally on the waitlist for, but then he accidentally put me in a section that didn't fit in my schedule. When I told him, he was very apologetic and actually asked another girl to switch into my section so that I could still take the class because he did have a space for me. Very, very accommodating guy who just wants you to learn about the nitty gritty of psych rules and succeed in the class. If you put in the effort, show up on time, and turn in complete assignments, you should do well in the class. \nWorkload:\nChanges from week to week, beginning with a few paragraphs, then after a couple of weeks you pair up or goup up with your lab partners for the rest of the semester and build up on a construct study three times and present to the class three times. You also write parts of a psych paper as you build up your study. each assignment is worth more as the semester progresses. There's an exam at the end of the semester that tests your ability to analyze a psych paper, so pay attention when you have class discussions analyzing the papers over the semester. \n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "April 05, 2014",
            "review_content": "\nAlthough Professor Light's course was limited by the demands of a 3 hour lab (i.e. they're always kind of tedious), I honestly think that it was the best way I'd have wanted to be exposed to experimental psychology. \nThe best part about the class was having such a supportive and genuinely good person as a teacher. Professor Light is always interested in and excited about the material and enabling students to understand and enjoy it. He's responsive to class emails and questions, and was flexible enough to allow me to change lab sections in the very beginning of the course, when I had to attend an event that was really important. And while the lecture is (too) long (I sincerely don't understand why departments actually feel the need to institute 3 hour labs in the first place), his genuineness makes it enjoyable and you really do learn.\nMy advice: participation is graded in class anyways, but my particular class this year tended to be very (sometimes overly) participatory. Paying attention and asking good questions made the experience more rewarding for both Professor Light and for us -- Definitely stay involved!\nWorkload:\nThe material itself isn't difficult, but assignments often do take time (especially learning to graph in excel). That being said, the work wasn't busy work -- I found all of the assignments actually instructive, and it was interesting to create and run experiments and see the results of other groups.\n"
        },
        {
            "course_name": "Intro to Psychology Lab",
            "review_date": "December 08, 2013",
            "review_content": "\nI took this class last year, and while I didn't particularly enjoy this class while I was in it (a 3 hour lab in the morning can do that to ya), having moved on to more advanced psychology courses, I have come to really appreciate Ken and his teaching.\nKen is extremely supportive, approachable and organized. His class prepared me (even over-prepared me) for future psychology classes. I still use his APA formatting guides and data analysis guides for a refresher when I need it. \nHis lectures were very clear and comprehensive. He really wants you to do well, and understands that this is an intro class, so he's very accessible if you need help. \nIs a 3 hour lab class (often with a 1-2 hour lecture) going to be the most interesting use of your time? No. But Ken will really help you build useful skills, especially if you will be going on to other psychology courses. \n\nWorkload:\nA little heavy for a 1.5 credit class. Online quizzes, 2 exams, short writing assignments, lab report, presentation (assignments have changed a bit since I took this course.)\n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "September 27, 2013",
            "review_content": "\nKen Light is a really great teacher. He is very specific in his directions for labs/ tests and always available through email and in person. Yes, we all know that three hour lab classes can be monotonous, but Ken does his best to mix up the class period with lecture, discussion, and lab experiments. The time flew in most class periods. I recommend Ken Light's labs 100%...you will gain and retain important knowledge that you will use throughout your college career.\nWorkload:\nSlightly above average for a lab because it fits in some lecture as well as lab experiments. But...all of the assignments were worth while, no busy work. After this class, you will be set for any lab!\n"
        },
        {
            "course_name": "Intro to Psychology Lab",
            "review_date": "April 29, 2013",
            "review_content": "\nThis man is terrible. Avoid all his labs.\nYou can do the work and get through with a good grade, but don't expect to be even mildly intellectually stimulated. Everyone is browsing the internet the whole time. Ken can be totally fine, just way too stuck up about the \"policies\" of the psych department.\nThe 3 hour-long class could easily be condensed into 1 hour, 1.5 tops, but he drags on and makes you suffer. He also feels the need to email you 100 times throughout the week with essay-length instructions and \"clarifications\" on things. It's like, no one cares man, this is a 1.5 credit requirement.\nIf for any reason he feels like you are not making an \"earnest\" effort to complete your \"science requirement in order to graduate from barnard\" he might be out to get you. Watch out. And do not hesitate to contact your Dean or the Psych department to sort it out for you. I have a feeling this has happened to him more than once. Good luck, Kennio.\nWorkload:\nLabs and writing assignments that make you feel stupid at something that's not even smart. Do it ahead of time and go to his office hours to get him to point out your dumb little mistakes that result in like, 10 points off for \"shadows\" on graphs and incorrect formatting.\n"
        },
        {
            "course_name": "Introduction to Experimental Psychology Lab",
            "review_date": "December 26, 2012",
            "review_content": "\nSo when I signed up on the lottery Intro to Psych Lab, I signed up for Professor Pham's class. Barnard, instead, put me in Professor Light's class. This was the first time that this lab was taught at Barnard with a new professor, so I guess we all needed to be a bit lenient. But I kind of expected the road to go both ways. I found the class very very structured. We come in. We take a quiz. We do some debriefing/after discussion. We do a lab. Done. And we didn't stray from this path all that much. Fine. I'm good with structure. But at the same time, I didn't really feel that I learned much or felt as passionate about psychology as I did with the intro lecture class. Here we were in a small forum (made very small do to the lottery) and I hardly knew any of my classmates. We did not have class discussions, and I did not feel compelled to converse outside of class because I didn't feel there was anything stimulating to talk about. Even the group work felt very detached. And all the papers that we learned from were quite dull. This was meant to look like a survey course of all the different areas of psychology, areas that are very interesting. This lab made them all look uninteresting.\nAs for Professor Light himself... He was a 6/10. And it is not because of his stutter at all. He was pleasant and a good guy and seemed to legitimately like his subject and be willing to help where he could. But I could tell the students in Professor Pham's class were enjoying their time more (I had a friend take her class). Just a small example of that was the ending paper. I heard that Professor Pham's class got a little bit better of an idea what the ending paper was supposed to look like, whereas I felt I was on my own, trying to ask the professor and TA the right questions about what the final product was supposed to look like rather than having a legitimate step-by-step structure (we had an excerpt that told us what we were supposed to do, but even with that outline, I was lost). I guess it was because I didn't have any previous history in writing scientific papers.\nI was also annoyed that we were not able to take our papers/homework home with us. I understand why they were doing it, but still. We signed an honor code at the beginning of each exam. Isn't that enough for you?\nWorkload:\nI felt it was quite a bit for 1.5 level class. A quiz each week on the previous lab, presentation, and assigned chapters. Lab assignments for each class. One group presentation. One final research paper.\n"
        }
    ]
}