{
    "prof_info": [
        {
            "prof_name": "Heather Ohaneson",
            "prof_id": 3491,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 16, 2015",
            "review_content": "\nSo, like stated in the other reviews, Heather is NOT an ideal person to be leading a CC course. The Core is here for us to engage our ideas with those of one another and explore various concepts through the texts. Now, in Heather's class, that is not the case at all. She pushes discussions so they follow what SHE believes about the text and what SHE wants to discuss. She could give less of a sh*t about what we as students want to talk about. Her grading is beyond unfair -- she's so ridiculously anal and nitpicks the smallest details. When going into office hours, any questions she is presented with get thrown back with either super vague answers or no answer at all. \nAlso, for those dealing with any psychological struggles, transfer out of her class ASAP. I have several clinically-diagnosed psychological issues, one of which is severe social anxiety. I reached out to her so I would not have my participation grade affected as much by this, and it turned out to be a ridiculous mistake on my part. She brushed it off, saying \"social anxiety isn't real\" and that my being nervous was \"all in my head.\" Never had I felt more dismissed. She then proceeded to tell me that had I told her this in the beginning of the semester (which I did -- I came to her in the second week of class), she would have encouraged me to switch out. God knows why I didn't just run then.\nSo all in all, if you're looking for the worst possible CC experience AND have your psychological issues both exacerbated and dismissed, you can get it with Heather.\nWorkload:\n1 10-12 page paper.\n1 midterm -- in which she replaces a section with a discussion\n1 final -- in which she cuts your working time in half to take a walk and have a discussion. (Yes, take a walk. You can't make this ish up.)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 27, 2015",
            "review_content": "\nWARNING: STAY AWAY FROM HER CLASS! I had Heather for CC and because of her it became one of my least favourite classes at Columbia. She has a very weird way of teaching. This class is suppose to be about building/sharing your ideas with other students. It has to have a professor that is slightly flexible (not asking for much), but Heather is the opposite of that. \nI agree with the review that explains how she begins every class with a 5 min introduction, stating random facts that don't really help with the discussions. It kills your mood at the very beginning of the class. Also she has a habit of putting people on the spot, and judges you if you don't say what she wants you to say. In short, not a chill professor at all! She cares about her work, but cares too much, and that becomes an issue. \nGrading: She is pretty harsh when it comes to grading. For example, in my 12 page research paper, the spacing between the paragraphs weren't according to her guidelines (forgot to mention.. she has a 12 page guideline for a 12 page research paper) and while talking to me about it I am pretty sure she said \"the paper looks atrocious\" (REALLY??!!) there are better ways of saying things.. Moreover, this just shows how anal she is about things. Honestly I dislike her so much. \n\nWorkload:\n12 page paper \n1 Midterm \n1 Final \nBut her set of rules and everything I just mentioned above, discourages you to do your best! \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 25, 2015",
            "review_content": "\nHeather is committed to you getting the most of our your CC experience. If you are looking for an easy and unstimulating experience where your teacher doesn't push you, switch out! She can be intimidating and doesn't pat you on the head if you say something stupid, but you might actually learn something about the texts you are tackling. Its near impossible to bullshit your way through the class, especially on the paper (18 pages) and midterms, but she incorporates enough contemporary discussions that those who haven't read the text can offer a comment. That being said, she emphasizes doing the reading a lot. \nShe is obviously very smart, knowledgable about the texts, and a good teacher. That being said, she is impersonal. \nWorkload:\n1 paper (20 pages)\nMidterm\nFinal\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 18, 2015",
            "review_content": "\nI have to disagree with the previous two reviews as I feel like they are a bit too salty and biased. I had Heather for CC this past semester, and while I think she has plenty of weaknesses as a teacher, she has plenty of strengths as well. First, compared to other core teachers, she is in the middle of the pack. There are great teachers out there and shit teachers, I think she is neither, due to her young age she has the potential to be either. Heather is very rigid and clearly inexperienced as a teacher, and I think because of this she tries to impose too much authoritarianism on the classroom. She does prevent the discussions from being organic, but it is in the spirit of hearing everyone's voice. In short, Heather seems insecure about her authority and so choke-holds the class in an attempt to maintain it; put simply, she needs to chill. Now for the pros: Heather really cares, and she knows her shit--she isnt one of the CC professors who A) doesn't know what they are teaching or B) simply doesnt gaf, and this allows for some great discussions to take place, inorganic as they may be. Secondly, she wants her students to read the books, to engage in the discussions, and most importantly, to care; though some of her policies are pragmatically inept, they are well-intentioned, and a refinement of these policies will lead to her becoming a great teacher (looking at the quiz/grading style of midterms and the paper). Many people were upset by the quiz at the beginning on Plato and its brutal grading (along with the midterm and papers), though the grades seemed to be curved by the end--I think frustration of low grades angered students more than her actual teaching. If Heather relaxes, makes it clear that grades will probably be curved (or rather more clear what is expected and what will be given for types of work), but most importantly, chills out, she will make a great teacher. Contrary to a prior review, I don't understand how one would find her unintelligent--also, if you came to Columbia for the teachers, most of the good ones are reserved for the grad schools (refer to last year's Varsity Show- \"fuck the undergrads\"\nWorkload:\n10 page paper, CC reading, midterm and final; graded brutally but curved at the end\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2015",
            "review_content": "\n\nwow, heather is easily one of the worst possible experiences I've had not simply with the core, but throughout my entire academic life. yes, it was pretty bad — i almost want to transfer out of columbia because of her.\nso here it goes. her class is discussion based, where she gives a brief 5 minute background of the author of the books we are talking about and then opens the floor. the problem with her discussions is that she fails to make it organic. in class she’d go, “OK Person X talks, then Person Y, then Person Z, and then we’ll spend 7 minutes talking about …”. this stifles the flow of conversation as she fails to foster a natural progression of ideas. she would disrupt interesting ideas that people had thoughts on and jerk the conversation in a direction that she deemed fit. while some people like the intense rigidity, it didn’t provide the experience I was looking for. also, though admittedly a more minor point, CC is also supposed to be a class where we can see how the ideas of philosophers centuries ago are relevant to modern day, and we only began doing this at the end, at the request of students. while i respect her intelligence, she still has a lot to learn about what a CC class should be, and more generally, how to teach. she also needs to be more comfortable in our skin — she’s a little awk.\nnow for the worst part, the grading. the main parts of your grade are participation, the midterm, 1 10-12 page paper, and a final.  for our first reading quiz, some people thought it was out of 50 instead of 100 it went that bad. that was our first and last reading quiz. our midterm was graded pretty harshly too, and who knows how she did participation. now you might be thinking, “wow only one paper how great!”. but here’s the problem —(1) you have no idea what she looks for in your writing (2) there is no room for improvement/rewrites since she literally gives the paper back the day before the final (3) she does a poor job encouraging students to meet with her. writing is like a muscle that needs to be exercised, and even though CC isn’t university writing, it is a class based on the expression of ideas and writing is a medium in which we do that. now I’m not saying that we should have had a writing assignment due for each class, but I’d prefer having multiple smaller papers so professors can see the evolution of our writing and work with us to strengthen our writing abilities. for the record, i read a majority of all the books, genuinely attempted to think and tackle with the ideas talked about in CC, and received a pretty bad grade. \nthe only good thing that heather did was bring in bryonn bain for class one day. he was such an inspiration and legend, and his performance about prison injustice was awesome. that’s the only credit she gets though.\nP.S also, never say \"I FEEL THAT…” when expressing an idea. she’s a stickler about this one and will dock you participation points.\n\nWorkload:\nusual reading. participation, 1 midterm, 1 final, 1 long paper. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 23, 2014",
            "review_content": "\nHeather was one of my worst academic experiences at Columbia. Intellectually, I was not impressed. I felt like I was talking to an intellectual equal, whereas my ideal CC professor would have spent years or even decades thinking about the CC texts and drawing profound connections between them.\nShe's rigid and inflexible when it comes to attendance and due dates--she refuses to extend a deadline even if you explain that you have 2 papers and a final on the same day, and WILL take marks off for late submissions. Apparently, this is supposed to instill self-discipline and help us come to terms with the fact that sometimes, life is hard.\nWorkload:\nUsual CC readings; one long paper (10-15 pages); midterm; final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2013",
            "review_content": "\nHeather is a nice person, but she definitely needs to work on properly facilitating discussion. She cuts people off mid-discussion and tries to make everyone talk at least once each class, which can be a bit frustrating because she has a tendency to put people on the spot regarding things they have nothing to say about. I know that's not a bad thing and many professors do this, but something about the way she asks specific questions out of nowhere to people who are not engaged in the discussion is not conducive to class. Also, sometimes when it seems as though discussion is actually flowing nicely, she may stop it if the class gets off the ideas she wants to follow. She kind of has exactly what she wants to discuss already in mind, which definitely takes away from the overall feel of the class. Overall, Heather does give some insightful information regarding the texts, and she is a very eager instructor who clearly enjoys teaching CC, but she has some things to work on. If you're looking for the ideal CC experience, this might not be it.\nWorkload:\nusual CC reading, participation(30%), ID's and essay midterm (20%), 10-15 pg paper draft(15%), 10-15 pg. paper final draft (15%), final (20%)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 17, 2011",
            "review_content": "\nI know that the semester's not yet over, but I've been feeling the need to review Heather. Here we go.\nSummary of this review: \nHeather is very nice. She means well, but isn't really the best teacher yet (maybe in time...) \nLonger Version:\nI was excited for the first few CC classes to see that I had a young, seemingly \"fresh faced\" CC teacher who would be open and flexible. That said, Heather is too new. This is literally the first CC class she has ever taught as a Professor, and probably the first class that she has ever taught at all. While Heather is definitely young and fresh, she is somehow rigid. In trying to take control of the classroom and lead with grace, she ends up treating us like middle schoolers and eliminating any possibility of organic, classic CC-like discussion. Heather makes us do weekly \"lightning rounds\" in class, where we go around and each bring up a point from the reading that intrigued us. While this might seem like a good way to start class and get our brains working, it ends up dragging on for so long that it feels like a pointless stream of random thoughts... nothing really builds or comes from this exercise. Heather also asks that we write weekly courseworks postings about the reading for that day. This is pretty standard procedure for some professors, and I don't really mind it. For some reason, though, the whole thing feels like a middle school assignment. I've had to do courseworks postings for other professors and it's never felt this way. I truly don't think it's me... it's something about how Heather runs the classroom. That brings me to my strongest negative feeling about Heather's class. She has not at all mastered the art of leading a classroom. Half the time, it feels like she's scared of the students, and the other half, she's trying to assert her dominance over us to re-affirm her place at the top. It just doesn't work. Heather has a weird way of facilitating discussion...she likes everyone to talk at least once, so she will literally call someone out and ask \"do you have something to say about this?\" or \"would you like to add one to so-and-so's point?\" even if that person has nothing to say. This makes it so the discussion is disjointed and herky-jerky. It's awkward and forced. When any real, exciting discussion seems to be springing up, Heather feels the need to control it and make a \"line\" of people to talk. She also has a very rigid time limit for every part of class. She will literally say \"we are going to discuss the Republic until 2:27 and then Aristotle until 3:30.\" She will literally someone off because we've reached a time limit. This is not the way a CC class should be run. I understand that professors need to curb discussions and facilitate different things at different times, but Heather just has not got the hang of it yet. I want to say that I hate writing this, because I can tell that she really is trying very hard. Heather truly is so so kind and understanding. She genuinely cares about her students. However, she is not what I wanted out of CC. When I applied to Columbia as a senior in high school, I was thinking about my future CC class and professor. I wanted the classic Columbia class, and I haven't gotten it.\nWorkload:\nnot so standard CC\n20% paper (10-12 pages)\n20% midterm\n20% final\n40% participation (attendance, courseworks postings, participation in class)\n"
        },
        {
            "course_name": "Religion and Its Critics",
            "review_date": "August 31, 2008",
            "review_content": "\nHeather was a great TA. She really cared about the discussion section and that we all got a better understanding of the material. She was really good at provoking discussion and challenging questions.  While the class was great in it of itself, Heather definitely added something to make it especially awesome. She was always available to meet outside of class/office hours to clarify the material or help with the papers. She was really good at giving advice on picking paper topics and starting research. However, just as she puts a lot of effort into the section she had high expectations of the students: she was, so I hear, a bit of a harsh grader, although I didn't have a problem with it myself.\nWorkload:\ncome prepared to discussion section with a question or a comment on that week's reading.\n"
        }
    ]
}