{
    "prof_info": [
        {
            "prof_name": "Marilyn McCoy",
            "prof_id": 9702,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "February 16, 2013",
            "review_content": "\nWhat to say about Marilyn McCoy. SHE IS AMAZING! Now granted, after talking to other students in different sections of Music Hum, I realized that I had to do a little bit more work than others in the different sections, but in the end, it was worth it. She has such a passion for the material, and is such a great teacher! She truly cares about her students, and does everything she can to see each of us succeed. Her lectures are informative as well as fun, and does a really good job describing musical terms and jargon, so people without music backgrounds can follow. I would seek her out for this class, and I learned a lot having her. Her class was my favorite last semester, and if I ever take another music class, I want it to be with her.\nWorkload:\nA little bit more than most Music Hum sections:3 Tests (8 Sections/5 Questions each listening, 20 non-listening questions) Short (2-3 page) Papers, class blog assignments, and a Concert/Opera review_content. With the Tests, she goes over certain pieces in great detail, but if you pay attention during lecture and actually listen to the music with the listening chart, you will do just fine on the tests. All the readings are through course readers through the Village Copier, and that contains all the information you need. She is a pretty generous grader so just put some effort in and you will do just fine.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 05, 2012",
            "review_content": "\nProf McCoy was awesome.  I'll agree that there are a TON of assignments, but none of them take long, and she's not a tough grader at all and gives extensions to anyone who asks.\nAs earlier reviews note, she covers the material in a pretty different way than other teachers.  Her course is based on First Nights, a book that covers only 5 musical works (Monteverdi's Orpheo, Handel's Messiah, Beethoven's 9th, Berlioz's Symphony Fantastique, and Stravinsky's Rite of Spring).  Regardless of whether you like the works, you'll learn a ton from them because you spend so long on each one, and McCoy is really good at putting them in the context of what was going on in music history when they were written.  One downside is that you don't get to have that one week at the end of the course where you learn about more modern composers or the beatles or whatever contemporary music another professor might cover.  Overall I think it was a great way to learn about western music.\nMore than anything, McCoy just cares.  She cares about the music and about the class and about her students, and her enthusiasm is contagious.  She wants you to succeed and will go out of her way to help you understand concepts or to help you catch up if you miss a lecture.  Being there for students is an often overlooked asset in a teacher, and she just totally gets it.\n\nWorkload:\nAssignments are a bit of a mess and a bit confusing, just because there's a ton of little things you have to turn in.  For each of the five units there is a half-page \"warm-up\" assignment, a 2-3 page paper, a short blog post, and a multiple choice quiz.  There are also two 3-page concert reports.  I would estimate about 4 hours of work a week, which is probably more than other music hum classes, but really not all that bad.  Late work is usually totally fine, just let her know what's up.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 08, 2012",
            "review_content": "\nIf you want Music Hum to be a light and enjoyable course, do not take it with Marilyn McCoy. There are lengthy and tedious assignments due every single class. Sometimes she assigns two homeworks to be due in one day, or due on days you don't have classes. Her exams are very easy, but the she takes the homework and the classes way too seriously. \nHer essay grading is tough. She is very disorganized when it comes to giving you feedback. She will make you rewrite anything below an 80% and then tell you your score is the same, even if you rewrote the entire thing. She is very enthusiastic about the course, which is nice, so you learn a lot. \nEvery other Music Hum teacher knows that we only take the class to finish the core, so it should be light and easy, but McCoy wants us to make Music Hum our number one priority, which is ridiculous. Find ANY other teacher for this class.\n\nWorkload:\n5 2-page papers, 5 warm up assignments, 5 \"Journal\" assignments, 6 blog entires, 5 exams, a final discussion, and a Final exam.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 18, 2010",
            "review_content": "\nA very enthusiastic and slightly eccentric professor who loves music and wants you to love it too. I would fully recommend taking Music Hum with Prof. McCoy, she marks easily and she wants to you to enjoy listening and learning. She bases the whole course on \"First Nights\" the textbook, which looks at 5 musical pieces - Orfeo, The Messiah, Beethoven's 9th, Symphonie Fantastique, and The Rite of Spring. Each piece is a mini course with some musical terminology and historical background specific to the music. After every unit you get a fairly easy multiple choice 'midterm' and a short (1-2pg) 'essay'. The assignments are not cumulative so you can forget about each unit once you have finished it. Best of all there is no final, just a 'final discussion' in class.\nWorkload:\n4 multiple choice 'midterms', 1 'final discussion', 5 1-2pg essays, 5 'warm up, non graded' paragraphs, 1 concert review.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "September 28, 2009",
            "review_content": "\nMarilyn McCoy is hilarious. Her approach to Music Hum, while not the most engaging for anyone with a mildly serious music background, is accessible for all students. Her enthusiasm for the material is evident, and while she struggles with technological issues on the daily, I can honestly say that I enjoyed her classes. Her knowledge is great, but she can sometimes be slightly unclear when explaining concepts. However, she is more than open to any questions, and she truly appreciates curiosity. One negative I have is that she bases her curriculum off of a book which studies five major works of 'classical' music. I would have liked to examine other kinds of music and their position in history. Overall a great professor.\nWorkload:\nSeveral small papers, a review of a pre-selected live music performance, multiple choice midterms, and a final exam.\n"
        }
    ]
}