{
    "prof_info": [
        {
            "prof_name": "Omar Sarwar",
            "prof_id": 11086,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "History of the Modern Middle East",
            "review_date": "May 14, 2011",
            "review_content": "\nKhalidi's class was throughly enjoyable and I learned a lot. I didn't know very much about the Middle East before I took this class, and now I feel solid about my knowledge about the region. Khalidi is a great lecturer, but he does go off on tangents and ramblings about certain issues. He can spend what feels like fifteen minutes emphasizing one point. It was also interesting to hear what he thought about the Arab revolutions and how he incorporated that with what he was lecturing about during the Spring 2011 semester. I honestly would not mind taking the course again in the Fall just to see how his opinion and events may have changed. Khalidi is also willing to talk with you outside of class to go over material that you didn't understand or even just talk about current events, so definitely take up the opportunity to do so!\nFor section, Omar had us write weekly discussion posts that he called reaction papers for the readings, and for that reason, I did the readings. Maybe you could get away with not doing the readings, but to me, it seemed like something that would be difficult to write if one had not done the readings. But otherwise, Omar was good about summarizing the readings and we usually had interesting discussions about events relating to Middle East as well as our opinions.\nWorkload:\nReadings, take home midterm and final.\n"
        },
        {
            "course_name": "Gandhi's India",
            "review_date": "December 24, 2010",
            "review_content": "\nWhat a great class this was! There's a lot of information, a ton of reading every week, and the exams aren't easy. But Professor Bakhle is a terrific lecturer. I don't understand why people think she's a \"bitch on wheels\" as one reviewer said below. She commands the classroom but not in a bitchy way at all. \nThe TA's are very intelligent, approachable, and professional. Mine was Omar Sarwar. He started out somewhat lacking in confidence but a few weeks into the semester he had us engaged and the fifty minutes of discussion section seemed to fly by. He's also hot. Just thought I'd add that! I highly recommend this class to anyone interested in the history of South Asia.\nWorkload:\n200 to 300 pages of reading a week, 2 paper assignments, midterm exam, and final exam. Weekly discussion posts on Courseworks. It's a lot of work so only take the class if you know you can handle the workload. It's all worth it in the end.\n"
        }
    ]
}