{
    "prof_info": [
        {
            "prof_name": "Greg Smithsimon",
            "prof_id": 1783,
            "total_reviews": 32
        }
    ],
    "reviews": [
        {
            "course_name": "Senior research seminar",
            "review_date": "September 05, 2009",
            "review_content": "\nWhere could I begin? I have taken many courses with Greg and I was BLESSED to have him as my professor for Senior Seminar. He was an inspiration and was always there for me when I was going through ethical struggles during my thesis. Many people complained about this course but I truly believe it was because they had not picked a thesis which they could see themselves working on for an entire year. After many conversations with him and emails going back and forth I found a topic truly inspirational for me at least. I found myself, and I put together something I will always be proud of. For that I thank Greg, for the guidance and support that he gave me. Barnard is not aware of what it has lost, and it is a shame. The whole Urban Studies Department has lost its backbone... Professor Gutfreund, and Smithsimon. I am grateful I was there when the department was at its best.\nWorkload:\nManageable.\n"
        },
        {
            "course_name": "Urban Sociology",
            "review_date": "June 23, 2009",
            "review_content": "\nI Loove Greg! He was so enthusiastic and helpful and passionate. Columbia REAAAAAAAlly messed up by letting him go. I absolutely loved his class. It was always interesting. And he was really hot! what more could you ask for? \nWorkload:\ninteresting reads but couldnt quite keep up\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "May 21, 2009",
            "review_content": "\nRidiculously dreamy professor who would be a perfect 10 if he worked out a little more. Last reviewer was right, he talks way too fast to get most of what he's saying and sometimes his mouth is working faster than his brain and it just mumbles jibberish for a few seconds until his thoughts catch up. I also agree that if you're not a racist, you don't really NEED the class (although my classmates were better than the previous reviewers, and we all seemed pretty forward-thinking, or maybe just the stupid ones kept their mouths shut). He assigns a RIDICULOUS amount of reading, especially for those of us who like to read every word, but at least 89% of it is interesting. But none of this really matters anyway, since this was his last semester. I kind of feel bad for the students who will miss out on the easy-ish A and those baby blues. \nWorkload:\nToo much reading. Really.\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "March 11, 2009",
            "review_content": "\nI HEART GREG! Yes, his class is so boring that I want to make a break for the door 20 minutes into his lecture which he manages to deliver at  top speed, mumbling most of what he's saying, but his mild attractiveness and metrosexual fashion sense keeps me seated as I try to figure him out. Overall, he is a good person and grading is more than fair... (Isn't that all that really matters?) \nWorkload:\nObnoxious amount of reading-mostly boring material. 2 papers;Midterm;Final.\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "March 03, 2009",
            "review_content": "\nI actually like Professor Smithsimon a lot. I don't really get the whole \"smug\" critique. I have to agree with the previous reviewer though, if you are not a racist moron then don't bother taking this class, which I refer to as \"How not to be Racist 101\" The class was filled with little gems like black people can't get jobs because the economy is structured to have unemployment not because they're lazy! WOW! Honestly I thought Smithsimon handled it well considering the heaps of insanely racist questions asked. I would strongly advise people not to take this course if you want to have any respect for the student body at Columbia left. One girl on the last day of class after countless days of attempted reprogramming against cultural stereotypes said \"Yea but Muslims are just way too religious to assimilate.\" My bill for text messages went through the roof because of this class because I was constantly texting all my friends the insanely racist quotes from my classmates that made up this class. One last anecdote, a girl actually raised her hand and said \"You know in Crash the scene where Ludacris is like 'oh look those white people are crossing the street because they think we're going to rob them' and then he did. Like what does that mean?\" Ah how racism thrives among the enlightened body of this fine institution. \nWorkload:\nTwo papers midterm final. If you have any basic knowledge about the world and are not racist you can do all of these things without studying and get an A like I did. \n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "January 07, 2009",
            "review_content": "\nOh Greggy... \nBeware! This class is sort of for people who need an introductory course to reality. In other words, if you already know that Black poverty/underclass is a result of structural problems and not cultural patterns, then you don't need this class, because Greg will just beat the subject like a dead horse and he's some prophet spreading the gospel. The gospel of not being a sheltered pseudo-racist I guess. \nI found this class boring and even a little insulting sometimes, because Greg is just so smug. He seems like one of those kids that grew up in some lily-white suburb outside of Boston, went to college and took some sociology class, and is now obsessed with teaching others like himself the plight of African Americans. \nAlso, he's a novice professor, and he shows all the signs. His midterm was way too long for the amount of time given, plus it was just full of rote memorization-- he's one of those professors who's trying to find out what you don't know, as opposed to testing you on what you know/have learned. (X author cites 9 components of the global city. Please list them and explain their significance in 2-3 sentences. You know? Ugh! How do you explain \"The Global City\" in 2 sentence?) Plus, the readings come off as kind of outdated, from the late '80s, like maybe he read them when he was in college. Plus, his TAs are obnoxious, and aren't really in touch with what Greg says or the readings, etc. so their grading is frustratingly random. Lastly, winter break is almost over and I still haven't gotten my grade, par for the course as far as this class goes. \nSuffice it to say, there are some interesting and enlightening parts of this class, but they're hidden among all the smug, self-congratulatory crap that is Greg Smithsimon. \nWorkload:\nNot too bad. Half a book a week--sometimes interesting, sometimes embarrassingly bad--2 annoying paper assignments, a ridiculously long midterm, a final (exact same amount of material as midterm, double the time). I'm going to make a good grade in this class, but I can't say much of the work was enjoyable or even worthwhile. \n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "December 31, 2008",
            "review_content": "\nBeing in the class itself, with all the readings, pressure from doing the field research and the sometimes excessive amounts of readings for his class, was kind of difficult and sometimes very annoying. Overall, though, coming out of the class, I think there were definitely some interesting ideas and concepts that i had not considered before taking this course. This course seems kind of an introduction to the urban studies field, and it did lead me to keep going with the urban studies major track. I wish I had time to read more of the readings; while interesting, a lot of them, I also felt that we had little time, especially during the second half of the course, to really go through all the readings and really critique the theories and ideas that came out of them. At some point, yes, Greg started lecturing, and lectures for less interesting. It was definitely an interesting course, though.\nAlso, while Greg is quite good at his lectures and knows his stuff, I had a huge problems with the TA system we had this semester. Greg did not read the papers or midterms himself; it was the TAs who did so. I am not at all sure if Greg even made sure they had the same grading rubric, as it was evident in the grading of our papers and midterms that one TA was grading rather generously and one was grading pretty harshly. It was very unclear, the grading rubric, and seeing as how I still haven't gotten the grade back for this class yet, I'm still not sure. \nWorkload:\nLots of readings, especially at the second half, where we would read chapters from three or four readings for one week. Two papers (this time, one a neighborhood study, another an election day project where we had to stay in the city), a midterm (which was wayy too long, hardly anyone completely finished), and a final. Participation, somehow was put into it. The discussion sections were not helpful at all, but I'm assuming some participation grade went into those.\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "December 17, 2008",
            "review_content": "\nThis was a truly eye-opening class and Greg is an excellent lecturer. He packs a lot of information into one semester. The first half of the class focuses on race in urban America, and Greg does an excellent job of showing the institutional causes of racism in the US. The second half of the semester (which is not as strong) focuses on immigration. The idea of the \"global city\" is incorporated throughout. Not only does the material feel immediately relevant and applicable, but Greg slowly debunks a lot of common stereotypes about race and immigration. At times he can ramble or trail off in his lectures, but for the most part he is very engaging. His two papers require field assignments that allow you to see real-life examples of what you are studying in class.\nWorkload:\nWeekly readings (about 100 pages, sometimes excessive), two papers with field assignments (easily graded) and midterm/final (reasonably graded).\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "December 14, 2008",
            "review_content": "\nI greatly disliked this course. The professor's lectures are disorganized and often incomprehensible, and he tends to trail off in the middle of a thought, leaving you wondering what he said and whether it was important. He goes WAY too fast through the notes, but he will repeat things if you ask. Talking to him one-on-one he comes off as standoffish but he generally will help you figure out your paper topic, whatever. The TAs have not actually done any of the readings and thus are unfair graders and unhelpful in sections. Take this class if you want to do somewhat difficult and demanding fieldwork and then be indirectly called a racist.\nWorkload:\nMidterm, final, two papers that involved going out and doing \"fieldwork.\" LOTS of dense, uninteresting readings.\n"
        },
        {
            "course_name": "Race Ethnicity and Immigration ",
            "review_date": "December 13, 2008",
            "review_content": "\nProfessor Smithsimon is very excited about his course and the material, however his lectures were increasingly boring as the semester went on. He began to give summaries of the readings, and no longer brought new or interesting ideas to the table. There was a lot of lecturing in this course, and not very much discussion. Some of the readings such as Streetwise were interesting, but many were repetitive and hard to force yourself to get through. The two assignments--both requiring interviews and research--were all right, but the grading rubric was pretty vague and unexplained. Your grade in this course really depends on which TA you get. This semester one TA was far more lenient and generous with grades while the other gave no reasons for his grading, but simply docked points. Overall this class is pretty boring if you aren't planning on becoming an Urban Studies major, but Professor Smithsimon makes a good effort, although unsuccessful in my case, to make you as interested in this course as he is. \nWorkload:\nLots of reading--some books are interesting, but some are very hard to get through. Two papers (5 pages) requiring interviews and field research, but not very hard--although he required us to be here over the election day holiday. One of the only Urban Studies classes to have both a formal midterm and final. (grading is very subjective and depends on the TA you get)\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "December 10, 2008",
            "review_content": "\nProfessor Smithsimon is engaging, but be slightly wary when you take this class.  \nThe TA's this year graded the papers rather easily but the midterm was way too long for the time period given.  \nMy main complaint for this class is although its nice to have a lecturer who makes what he is saying interesting, Smithsimon is really hard to take notes on and get \"general points\" from.  He mumbles a lot.  He doesn't do slides and makes diagrams that people \"sort of get\".  \nOn the other hand go into his office hours and he will talk and listen to you and is very good at taking/giving constructive criticism.  \nOverall not a bad class but wish I could pull more \"concrete\" things that I learned from it than I did.  \n\nWorkload:\nThe work load is light, lots of reading (not all of which is necessary) 2 paper-projects which mean going \"into the real world\" and are time consuming but easy and a midterm and final.  \n\n"
        },
        {
            "course_name": "Race Ethnicity and Immigration ",
            "review_date": "October 30, 2007",
            "review_content": "\nProfessor Smithsimon is one of the best professors I've had here.  He is smart, funny and engaging.  The reviewers who said he was unorganized must rely too much on conventional teaching styles.  He challenges the boundaries of society and invites the class to do so as well.  Even in a 100 person lecture, he manages to involve every student.  Some of the readings can be dense, but he reviews them in class, challenging the author's views.  This is definitely a great class, and Smithsimon is a phenomenal professor.\nWorkload:\nMidterm, final, two short papers (involve fun field research)\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "August 29, 2007",
            "review_content": "\nI disagree with the negative reviews of this professor.  He allows his students to express their opinion and allows us to talk about racial issues that honestly just make some students uncomfortable.  But that is the beauty of his class, he is trying to expose the truth, not try and be so polite that he cannot touch upon racial issues.  It is impossible to talk about city life without evaluating race relations.  Also, I enjoyed his essays because he gave us room to develop our own ideas and go out into the city for a hand-on experience.  \nWorkload:\nTwo short pages, 3 and 5 pages.  Papers are tied in with readings, but leaves you room to develop your own concentration and expolore an area in the city of your choice.  Mid-term and final were essays.  This means either you know your material or you don't, but exams are very fair. Pay attention to the major ideas in class and basic concepts in the reading. Concepts in class appear on exams. \n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "March 25, 2007",
            "review_content": "\nGreg is awesome! It was a totally great class. The reading could be a little dense at times, but if you pay attention in class it's not hard. He is very availiable in office hours, and a totally nice and unscary guy. The biggest problem is that Greg doesn't speak very loudly and sometimes can drone on in lecture. \nWorkload:\nNot bad at all. You can get away with not doing  a lot of the reading. 2 easyish papers. midterm and a final.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "January 09, 2007",
            "review_content": "\nI should probably be terrified because there are only 18 people in this class and I will be spending all of next semester with him and he will be grading my thesis but I think it is important to say a few things.\nIf you are a senior Urban Studies major, like myself, you already are way too familiar with what he sees as his mission to teach you - that there is a racial dimension to everything; that you should not always judge people by stereotypes; that the hood is not as dangerous or exotic as media portrays it to be; that you are in desperate need of turning against your blindly capitalist, mainstream ways and understand the burden of the minority. Etc.\nF that. It's practically the only thing we talked about in our other urban studies classes. Not that it makes it less valid, but we should be reaching past this at times simplistic, reactionary thought and into more complex issues, acknowledging that white guilt is important but can sometimes be distracting in searching for pragmatic solutions. I am all about hearing the other side. We all are - we're urban studies majors for goodness sake - but the lack of objectivity is irritating.\nAlso, Greg, if you are reading this, I think you are a great person and, in fact, a very responsible and competent seminar facilitator with passion and a humorous self-awareness. But we did not sign up to be sociology majors. I am under the impression that some-to-many of us don't really even like sociology. It is very frustrating that all of our theses - the culminating works that are supposed to build on our individual sets of knowledge we have acquired in college - are evaluated by the standards of a discipline we were not exposed to until senior year.\nIt is also intimidating because I sometimes feel pressure to not pursue the argument I think is most accurate but one that most closely conforms to his beliefs.\nSo, seniors of 2008 and beyond, understand what you're getting into because I sure didn't. \n(I also realize this is kind of a passive-aggressive way of communicating - if, Greg, you are reading this - so maybe I'll just talk to him in person.)\nWorkload:\nFirst semester isn't bad. Some interesting readings and the draft deadlines are not do or die (although it's in your best interest to abide by them, of course). Don't know what second semester is going to be like.\n"
        },
        {
            "course_name": "Race Ethnicity and Immigration ",
            "review_date": "January 03, 2007",
            "review_content": "\nThis professor was disorganized, ill-informed narrow-minded and self-congratulatory.  He knows he has all the right answers and is just waiting for the rest of us to figure it out.\nGood professors may guide you to answers, but Smithsimon does nothing short of drag you to his personal favorites.  There are some arguments not worth having, but there are some that are, and Smithsimon is not interested in having them.\nThe reading material for the class was very interesting, but the coverage of it in class was rough.  Frequently had the impression he had no more knowledge of the subject than the reading he'd assigned.\nWorkload:\nmoderate to light.\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "November 30, 2006",
            "review_content": "\nHe's a little scattered, that's definitely true, but all in all I enjoyed this class.  He didn't seem nearly as condescending as other reviewers described, in fact, he was very interested in having discussions in office hours.  One thing that was annoying was his tendency to mumble during his side comments.  It was as if he wasn't talking at all, given that no one could understand him.  He acknowledged this habit to us early in the semester, but I haven't seen any improvement on his part.  I felt like we could have gotten deeper in discussion with some of the material, but the class was so big it hindered that potential quite a bit.\nWorkload:\n2 essays (3-5pgs), midterm, final\n"
        },
        {
            "course_name": "Urban Sociology",
            "review_date": "August 23, 2006",
            "review_content": "\nStay away... basically Prof Smithsimon is a flake who does NOT care about you as a student. He arrives late to class, does not give any information on due dates or formats of tests (he leaves all of that up to the TAs) and he does not even prepare lectures- he kind of just talks about what is on his mind that day in loose correlation to the assigned reading. Basically not enlightening or worth your time- more frustrating and irritating than anything else.\nWorkload:\nlight but completely random and confusing to actually know what reading is assigned\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "July 30, 2006",
            "review_content": "\nI have two main problems with how Greg teaches:\n1. He presents material in a very one-sided manner. The readings and lectures all correspond to his nouveau-socialist political perspective and thus you never have the chance to critique this viewpoint. Objectivity? Nah. My politics are left-wing, and even I thought this class was ridiculously biased. I felt like you pretty much get taught that unions can do no wrong, all white people are racists, if you criticize teen pregnancy you're biased against the working class, etc etc.\n2. I get the distinct vibe that he assumes every white kid in the class was born with a silver spoon in his/her mouth and has never had to struggle or work for anything. This viewpoint is condescending, innacurate, and insulting. I never knew if he was taking me seriously, thanks to my background.\nI mean, he's not terrible, but this class didn't teach me anything I didn't already know.\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "May 06, 2006",
            "review_content": "\nThis class is such a dissapointment.  While the topics are absolutely fascinating, Smithsimon is a total flake.  He cancels class at the last minute, shows up 10-20 minutes every class, does not respond to emails, returns papers/exams almost a month later, and implements mandatory discussion sessions half-way through the semester.  Furthermore, no direction whatsoever is given on what IDs/ESSAY QUESTIONS might be on the exams.  This instructor is a complete waste of time.\nWorkload:\n2 papers; midterm; final\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "April 15, 2006",
            "review_content": "\nIf you've taken any class that dealt the slightest bit with racism, you don't need this class. It only repeats the obvious. At first I really liked it but Greg's style of teaching very quickly wore thin. By the middle of the semester it turns into just nonstop white guilt. I also think there's a lot more to urban studies than race and class. When we talked about the property market I was really interested and I wish there had been more of that, but instead the class just turned into racism 101. It gets old quick.\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "March 29, 2006",
            "review_content": "\nInteresting course and he is a really good teacher and nice guy.  If you are looking for a fun and light course you should def. take this.\nWorkload:\nNot bad, the homeworks are field work type assignments and graded easily, a fair amount of reading but its quick reading, midterm and final that aren't too bad\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "January 24, 2006",
            "review_content": "\nI agree with some of the other reviewers in that the lecture structure was obnoxious or nonexistent and that the field research was a serious and slightly unnecessary commitment.  I disagree with the others in that I think they have been too kind to his general style and personality.  Although nice and cute, Smithsimon comes off as cocky and disorganized at times.  He spent multiple class days talking about his personal research projects which, though interesting, had very little to do with what we were actually trying to cover - more to do with personal petting.\nIn general, I just didn't like the guy.  He plays favorites.\nWorkload:\nfield research was a pain, tests were completely unfair, have to do the reading.  not too hard, though.\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "January 16, 2006",
            "review_content": "\nProf. Smithsimon is one of the greatest prof. this school has to offer. He respects his students and is interested in what the class as  a whole has to say about the topics discuss in class. Fellow students, please keep in mind that a good prof. is one that gives you the answers, a great Prof. is one who leads you to find it yourself-to think-this is why we are here-right?.. Ok. Some other reviewers complained about the his exam: I took this class-I did the reading-went to class-and paid attention to his lecture-I did very well- and so my friends from that class. If you do the work and study for the exam -you'll get an A. But you have to think about what he is teaching  you. No-one should leave this campus without taking a class with Prof. Smithsimon. He would make you think!.\nOnce again he is GREAT!\nWorkload:\nVery reasonable. If you do the work and go to class you'll be fine.\n"
        },
        {
            "course_name": "Race, Ethnicity and Immigration in Urban America",
            "review_date": "January 07, 2006",
            "review_content": "\nI have mixed feelings about this class and this prof. I absolutely loved most of the readings and I found the topics very interesting, but it seemed like we tried to cover too much ground and I would have preferred to just focus on one  or two subjects instead of the three we covered (race/segregation in cities, global cities, and immigration in cities). I admire Greg for trying to pull them all together but I dont think it worked too well for our class. \nI also felt that, although greg seems incredibly laid back in class, his grading was slightly harsh. Of course, I cant say for sure because it is january 8th and I still have not gotten my grade. Greg says he hates giving tests, yet the tests he gives are extremely hard and sometimes focus on minute terms in the reading that we have discussed in class. The reading and lectures could have been more closely tied together; sometimes Greg would lecture about random things that didnt relate to the topics of the course of the readings. And like another reviewer, I did not think spending time on discussion in our lecture was useful. That's WHY we have discussion sections.\nOne other (small) complaint is that two of the assignments required in-the-field observations. This is interesting, but time consuming, especially for the second assigment which requires that you observe a neighborhood that is not in Manhattan. Personally, it was a big burden to find time for this field research in my insane schedule. I wouldn't recommend this class if you want to just sit at a desk and write a paper in a few hours. But if you have the time, these field assignments are definetly more interesting and engaging than traditional papers. \nGreg is an entertaining and interesting lecturer, and he chose great readings. He is also extremely accessible outside of class and an overall nice guy. Overall, I am glad I took the course. However, there is definitely room for improvement. \nWorkload:\nfair amount of reading, bi-weekly discussion sections, one two page paper, two five page papers (I found them more time consuming than the average 5 pager), midterm and final (both hard)\n"
        },
        {
            "course_name": "Race Ethnicity and Immigration ",
            "review_date": "November 24, 2005",
            "review_content": "\nGreg is a great professor.  I'd encourage anyone to take his class.  He is young, energetic, and knowledgeable.  He has a lot of credibility because he does research in the fields that he teaches.  He is friendly and easy to find outside of class.  Assignments are interesting and easy to do because you want to be prepared for class.\nWorkload:\nmedium - 1 2-page paper, 2 5-page papers, midterm (hard) and final\n"
        },
        {
            "course_name": "Race Ethnicity and Immigration ",
            "review_date": "November 16, 2005",
            "review_content": "\nI'm the only person who's gonna give him a negative comment, but i didn't enjoy this class. I get the feeling that he didn't really master the material too well, and was teaching really random stuff that didn't relate to the readings too directly. also, i'm the kind of person who doesn't enjoy discussions in a lecture class of a couple hundred, so i didn't like the way he opened up the floor for everyone to speak so often. i wish he were a more structured lecturer instead of a teacher who just kept babbling on about this then that then this again. \n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "July 08, 2004",
            "review_content": "\nI agree with all the other reviews--he is energetic, interesting, and dedicated.  He's extremely available outside of class and really works hard to get to know his students.  Unforunately, I found the class itself kind of stupid.  It usually went from people talking about the reading to then talking about whatever they wanted--which was great because I could participate without doing the reading--but was rather irritating sometimes.    \nWorkload:\n3 short papers, 1 final paper\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "May 15, 2004",
            "review_content": "\nGreg is a great teacher.  He designed the class in a very unconventional way: there was a choice of readings, so for each class not everyone was reading the same books.  I doubted at first whether this would work out, but it turned out to be great because we brought in so many more angles than would have been possible with a single reading list.  The readings he picked were all great; the title of the class \"Evaluation of Evidence\" is a misnomer, because no individual book is about that; the evaluation comes in comparing the books.  Also, he brings a ton of energy into class, and he creates a really supportive learning environment: no matter how incorrect your comments are, he'll find some element of value in them and bring it out.  He also uses a lot of real-world examples to explain concepts that might be hard to get otherwise.  Really dedicated, incredibly helpful, and fun.  Take any class with him.\nI would also disagree with the previous reviewer's comment that going on strike shows a lack of dedication to students.  The afternoon before the strike, I had a long conversation with Greg in which he gave me a ton of help on my final paper.  He was dedicated to his students to the end; I get the sense that when the strike is over, he'll return to the classroom just as dedicated as before.\nWorkload:\nSome weeks there was a lot of reading and some weeks there was none at all.  3 short written assignments and one 10pg term paper, all evaluating evidence in different ways.  No midterm, no final.  Relatively easy.\n"
        },
        {
            "course_name": "Evaluation of Evidence",
            "review_date": "May 07, 2004",
            "review_content": "\nGreg's class was extremely interesting and I enjoyed the nonstop discussions. We learned about contemporary issues that are actually pertinent to everyday life, something rarely found in college curriculumns. He's young, enthusiastic, and brings excellent insights into topics which have already been discussed at length (race, poverty, corporate exploitation, etc.) Pretty much what we did was read one book a week and talk about it, letting the conversation go where it wanted. I'm not sure what exactly I learned about \"evaluating evidence,\" but at least the class made me think. I'd definitely recommend it; everyone in the class was brilliant. From his teaching style I was under the impression that he truly cared about his students, and when he dropped us like a hot potato for the strike I felt extremely let down. That makes me question his committment to his students.\nWorkload:\nA few short papers, final paper, lots of interesting reading (like Fast Food Nation!)\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "December 07, 2003",
            "review_content": "\nI agree with the other reviewer that Greg is amazing, but I disagree about the material. I thought Greg picked really interesting articles and topics that were worth discussing.\nHe's VERY available outside of class and very accomodating as far as due dates are concerned, as long as you give him a legitimate reason. He's not only extremely knowledgeable in regards to social theory, but also clever and very capable of guiding an intelligent discussion.\nJust do the reading and participate in class (he can transform anything you say into an interesting comment, so don't be afraid of looking stupid) and you will be fine.  He really does care about whether you enjoy the material he brings up and wants you to learn and think about social phenomena and concerns.\nWorkload:\ntotally manageable: 3 two-page response papers and 1 ten-page final paper. No midterm, no final.\n"
        },
        {
            "course_name": "Sociological Imagination",
            "review_date": "November 16, 2003",
            "review_content": "\nGREAT Professor. The class itself it's especially difficult, but having him as a professor makes the dry material seem more interesting. He makes a effort to engage his students and the class is more of a discussion that a lecture. He respects students opinions and will not blatantly tell you you're wrong but more guide you in the right direction. Over all it's a good class to take, even inf you're not a sociology major.\nWorkload:\n3 response papers, bunch of reading, final 10 page paper, no midterm or final\n"
        }
    ]
}