{
    "prof_info": [
        {
            "prof_name": "Jamil Daher",
            "prof_id": 2249,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Arabic I",
            "review_date": "April 30, 2006",
            "review_content": "\nI found Jamil Daher to be one of the most exasperating, incomprehensible, and unkind teachers in my entire Columbia career. The man refuses to follow the teaching schedule of the Arabic department at Columbia, making his own exams that are far too fast paced for first year students in Arabic. In addition, Jamil is incredibly prejudiced against many groups of people, including Muslims and Turks. I found that his class was confusing and frustrating; it ended up being a battle with his personality rather than an endeavor in learning Arabic. Switching out of his section is the best decision I ever made.\nWorkload:\nAbout one hour a night. The exam takes about 4-5 hours to review for.\n"
        },
        {
            "course_name": "Intermediate Arabic I, Beginning I, Beginning II",
            "review_date": "January 18, 2006",
            "review_content": "\nI agree that Jamil is a nice man.  Having had him for three semesters, I found him very helpful for the first year and not helpful for the second.  At a time when we should have been speaking Arabic most of the time, he preferred to always use English.  I feel that he probably valued his ability to make jokes above our listening skills: after all, we wouldn't understand any of his jokes in Arabic.  While classtime was most enjoyable, I felt very frustrated by the lack of rigor and the lack of emphasis on actually using Arabic.  Now that I have a different teacher, I find that I'm behind the other students.\nWorkload:\nYou can get by with a lot less than you should be able to.  In Intermediate, he let us use a dictionary on the exams, which didn't motivate anyone to actually learn the vocabulary.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "May 26, 2005",
            "review_content": "\nJamil is a very kind and interesting and understanding professor.  He dedicates a portion of every class to conversation via partnering students up with students.  Although you learn standard Arabic, he devotes some time to teaching slang that would be used in other countries and explains how the Arabic differs in other countries.  One day, he even brought in some fresh baked bread (can't remember what kind) for all the students in the class.  He's tough on you if you don't hand homework in and don't practice, but he's fair also.  \nWorkload:\nhomework every night, but if you don't practice you won't learn very well---it's up to you.  Also 4-5 quizzes and a final.\n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "January 10, 2005",
            "review_content": "\nJamil is a wonderful man who truly cares about his students. He wanted us all to do well and often stated that he was tough on us only because he wanted us to learn arabic. He would often sidestep questions or answer them with a nonsequiter, but his responses were always so odd and entertaining that I couldn't help but laugh. For example, when asked an either/or question along the lines of \"is this word pronounced this way or that way\" he simply responded with a \"yes,\" without specifying which way was correct. After a moment of akward silence, he continued with one of his best nonsequiters, saying, \"do you like lettuce or tomato--yes?\" Then he went back to teaching without further explanation. All in all, Jamil is an excellent and entertaining professor. I'm putting my money where my mouth is, as well: next semester i am going to take Elementary II with him.\nWorkload:\ndon't kid yourself: it's arabic. Expect 2-3 hours of homework for every class and cram for the six tests that are evenly spaced every 3 weeks or so. He grades fairly. \n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "December 05, 2004",
            "review_content": "\nJamil is certainly an odd bird, as professors go.  He adopts a very strict persona to teach class, but breaks out of it every so often to make jokes, whose hilarity is what keeps me coming back.  He is a good, engaging teacher who makes sure that everyone participates, and therefore everyone has a chance to screw the language up at some point.  Our class always included a \"conversational\" period at the end, which allowed people in the class to get to know each other and we all felt very comfortable by the end of the semester.  Jamil's personality could be very abrasive, especially given how demanding he is on his students.  I would not reccomending taking the class if you're Turkish, as he seems to be particularly hard on that nationality.  He sometimes made fun of people who asked questions, especially in his worse moods.  However, I found him to be a good enough teacher that I hope to take class from him again.\nWorkload:\nArabic is an intense language; don't take it if you're not willing to throw away your entire concept of how a sentence should be structured.  The homework is demanding, and the task of memorizing all the words he gives you is even more demanding.  You may feel that you are always behind the textbook, but mostly likely everyone in the class will be right there with you.  This was frankly my hardest class this semester, but to learn a new language is surely worth it.\n"
        }
    ]
}