{
    "prof_info": [
        {
            "prof_name": "Meg  Jacobs",
            "prof_id": 13238,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "America in Depression and War",
            "review_date": "January 22, 2017",
            "review_content": "\nProfessor Jacobs is a wonderful professor. She's highly engaging and encourages students to engage with the material in a way that both sharpens our historical skills and encourages connections and analysis with other parts of history, especially our present. \nHer seminars were focused around helping us develop the skills and timeline needed to write a 15 page research paper. She takes this seriously. She will help you every step of the way and give structured assignments to take you through formulating a topic, researching and assembling a corpus of material, and finally writing. She gives feedback at every step and is willing to help you at her office hours constantly. This also ties into how the readings are structured to help you with your historical skills, particularly argumentation, as she'll mention frequently that your job in writing the research paper is to present an argument with evidence, just as the authors you read in class do. She ran the seminar incredibly well, incorporating our weekly work in with the readings, and often brought in cookies or other treats for class. Readings for Consumer Culture included two novels, a book on fast food, a book on Wal-Mart and a book about the baby boom. Readings for Nuclear Age included a book about the baby boom, detente, African American movements, the oil crisis, the Iran hostage crisis and the origins of environmentalism. Both classes involved readings, primary sources and a short, two page analysis (weekly), a 5 page primary source journal (where you summarize your sources) and a 15 page research paper (which, as I've written, she helps you with extensively). \nThe lecture class was a very standard lecture, focusing more on the material than on developing your own history paper. The topic was fairly narrow -- the Roaring 20s, the Depression years and World War II, and then a bit of the post-War period. The years covered are about 1920 to about 1950, covering primarily the presidencies of Roosevelt and Truman, with special attention paid to the government and responses to the government, as well as issues of class, consumption, labor, race and gender. Her lectures were engaging and interesting, and covered a lot in very little time. Very little was said about military history or about the battles of World War II. Readings focused on the economic crash in 1929, people's responses to Roosevelt, demagogues like Huey Long and Francis Townsend, the impact of World War II on the home front and on veterans, as well as primary sources outlining government policy and response during the Roosevelt years. Discussion section focused on improving our understanding of the reading alongside material from the lectures. Assignments included only two exams (term and passage IDs, as well as one essay, the prompts she gives in advance) and a short five-page paper based on newspaper research (which should be easy for anyone who has written any type of history paper based on primary work). \nAs a professor, Professor Jacobs is truly a gem and not to be missed. Her classes are interesting and timely, and her passion for teaching is obvious and welcomed. She'll also learn your name on the first go (seriously, only one introduction needed)! I wholeheartedly recommend professor Jacobs if you have any interest at all in the topics she's teaching. \nWorkload:\nAs mentioned above: \nSeminars involved about 100 to 150 pages of reading a week, a 15 page research paper, intermediate assignments for the research paper, weekly primary sources and analysis, and a five page \"journal.\" The primary sources involved finding and analyzing a primary source related to the reading, and the \"journal\" was a five page summary at the end of the semester where you place them in a sort of narrative or reflective arc. She incorporates the primary sources into the discussion so there's a chance to participate every single time class meets. The intermediate assignments for the paper are ungraded but are meant to be for your benefit, as she gives notes and feedback based on them. Intermediate assignments include a paper proposal, revised paper proposal, preliminary bibliography of primary and secondary sources, an introduction and outline, a rough draft and then the final paper. \nLecture was about 100 to 150 pages of reading a week, a five page essay and two exams (term IDs, passage IDs from the readings, and essays, the prompts for which she gives you in advance). Weekly discussion section that involved discussing the readings and incorporating them in with the material from lecture (my TA assigned no additional work). The five page essay involved analyzing a debate presented in class (e.g. the Lend-Lease Act) through newspaper research on ProQuest. A very easy assignment if you have done any type of historical work with primary sources before, and a very gentle introduction if you haven't. \n"
        },
        {
            "course_name": "America in Depression and War",
            "review_date": "May 19, 2016",
            "review_content": "\nA really great class. You will learn so much about the New Deal and World War II. This class covers many of the economic, social, and political developments during this time period (roughly 1932-1948). \nProfessor Jacobs is a great lecturer. Instead of heavy secondary readings and boring primary sources like most classes, she just assigns four books the whole semester. One of them Stud Terkel's oral history of WW2 is one of the best books i've read in a long time. \nOne easy paper, midterm, final. \nWorkload:\nVery manageable and enjoyable. Go to lecture, prep for exams (She gives the essay questions ahead of time), you can easily get an A. \n"
        }
    ]
}