{
    "prof_info": [
        {
            "prof_name": "Jason Frydman",
            "prof_id": 2596,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "April 30, 2006",
            "review_content": "\nJason is well-spoken, tack sharp, and very nice. The essays we covered were surprisingly interesting for UW and his seed text for the research paper allowed for a lot of fun, creative possibilities. Unlike a lot of other graduate student teachers I have encountered, he is actually very well-studied in pedagogy already and it definitely shows in his ability to lead discussions and keep the class on course. Overall I would say he's a very fair grader and his suggestions on drafts are usually right on the money.\nWorkload:\nUsual UW progressions + a small writing assignment following most sessions. The department guidelines are fairly standardized for this course so I wouldn't spend too much time looking for that one instructor who assigns less work.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "August 03, 2005",
            "review_content": "\nI had Jason as a UW teacher my first semester at Columbia.  It was his first class, and he was great.  I loved him. (and he's so adorable!)  He made UW my favorite class even thought I wasn't too crazy about writing.  Many say that UW doesn't help you become a better writer, but I think that's dependent on your teacher and what you want to get out of the class.   Jason really knows about writing and is great about extracting meaning and analyzing texts... If you listen to him, and following his suggestions (espically the corrections he makes on your drafts), you really can become a better writer... Also, he's not a very difficult grader.  In UW you get to write drafts for everything so if you make the corrections your TA asks you too, you really don't have a reason not to do well.\nWorkload:\nThe usual 4 progressions... and sometimes you have to write  responses to the essays he assigns you to read...\n"
        }
    ]
}