{
    "prof_info": [
        {
            "prof_name": "Nelson Moe",
            "prof_id": 107,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Italian Cultural Studies 1 & 2",
            "review_date": "August 06, 2014",
            "review_content": "\nI took Italian Cultural Studies part 1 with Prof. Moe. I definitely understand why other reviews think that Prof. Moe is disorganized...He seems a bit ADHD and sometimes leaps around a lot which can be a bit anxiety inducing because you aren't sure what he wants from you.  If you can get past the fact that he can be a bit chaotic, I think you'll get a lot out of his courses. He touches on really important Italian thinkers, authors and film-makers that you need to be familiar with to have an understanding of contemporary Italy. This is definitely not a traditional history course or an anthropology course, it is very much a course that uses a wide variety of sources to give an overview of the history and culture of Italy in a way that may feel sort abstract at times, but in retrospect you'll realize you got a lot out of it. He doesn't give a lot of instruction on papers, but I think the benefit of that is that if you have a solid argument, you can really write about just about anything. It's a course that gives you a lot of leeway for creativity.\nWorkload:\nNot very much.\n"
        },
        {
            "course_name": "Mafia Movies",
            "review_date": "May 15, 2013",
            "review_content": "\nWorse teacher I've ever had. \nHis classes are unintelligible, he is disorganized, there is no structure in the class. The workload is quiet important and he asks us to write papers without giving us any indication of what he expects. His handouts mean nothing and the 4 hours of class are very painful. Also when he gave us the papers back there is NO indication on how to improve and reaching him is mission impossible. \nHe is a very nice and knowledgeable person, very easy to talk to etc... don't get me wrong, but I highly recommend to NOT take his class. In point of fact Moe is the archetype of the cool, super knowledgeable guy but that has no idea on how to be a teacher, \n\nWorkload:\nAbout a book every week. \n"
        },
        {
            "course_name": "Italian Cultural Studies 1 & 2",
            "review_date": "December 29, 2004",
            "review_content": "\nThese classes are great because they are accessible to anyone.  No knowledge of Italian language or history is required.  Moe does a great job combining historical texts with novels, films, etc to keep the course interesting.  He encourages students to come to class with discussion points in mind, often permitting time at the beginning for students to share thoughts with one another and using those thoughts to stimulate a full class discussion.  It's refreshing to take a lecture course where the professor wants to hear the students (and not himself) speak.  This definitely puts more pressure on students to get the reading done, but it is worth it.  Moe is slow returning assignments but his comments are helpful and allow the student to improve on future assignments.\nWorkload:\nReading: About a book per week\n(Part 1 also had a small presentation and another 4 page paper--both based on non-reading materials *film and illustrations*)\nTake Home Midterm: three 3-page essays\nFinal Paper: 8-10 pages\nEasily manageable if you stay on top of the reading\n"
        },
        {
            "course_name": "Mafia Movies",
            "review_date": "March 31, 2004",
            "review_content": "\nI idon't understand what all these other reviews are about. Professor Moe - or Don Moe if you like-is a courteous, knowledgable, funny professor. And you do indeed watch the Godfather all the way through. It really is interesting class that goes beyond a simple fascination with the mafia- I would really recommend it...\nWorkload:\na bit tough.. quite a bit of reading and the midterm is pretty intense, but nothing you can't handle if you show up to class and pay attention once in a while..\n"
        },
        {
            "course_name": "Mafia Movies",
            "review_date": "January 01, 2004",
            "review_content": "\nOverall, this course encouraged students to simply sit through the class and listen to Don Moe's lectures. Not a difficult class at all...if you want an easy class and are willing to sit through some lengthy lectures, this is the class for you. Taking notes is not necessary...just sit back and relax! \nWorkload:\nExtensive reading...only necessary when researching for the mandatory 2 papers. Midterm and final in which Prof. Moe allows you a one page-typed cheat sheet for 2 essays he gives before the exams. Honestly....great class! \n"
        },
        {
            "course_name": "Mafia Movies",
            "review_date": "April 10, 2003",
            "review_content": "\nThe worst class I have taken at Columbia by far. We don't even watch the Godfather all the way through. Focuses on older italian movies and readings. Overall a terrible experience\n"
        },
        {
            "course_name": "Mafia Movies",
            "review_date": "March 04, 2003",
            "review_content": "\nThis is one of those classes that sounds great until you show up.  The movies are largely from the 20s and 30s and when we finally get to The Godfather, Goodfellas, etc, we only watch selected scenes.  In fact, our paper and midterms were based largely on readings having nothing to do with the movies.  The focus on the early stages of the mafia is not what any of us expected and Moe's teaching ability and insights are usually very dull.  Highly NOT recommended.\nWorkload:\n2 papers, midterm, final.  Class is 4 hours long and 40% of students leave after the movie.\n"
        },
        {
            "course_name": "intro to italian cultural studies",
            "review_date": "January 18, 2003",
            "review_content": "\nclass consists mostly of discussion, but moe does a good job facilitating it so that the class doesn't go round in circles or get hung up on unimportant details. i enjoyed the variety of sources -- academic texts, primary sources like novels and periodicals, and movies -- but the readings were a little boring.\nWorkload:\nrather heavy. sizeable reading each week and required 1-page response papers; three longer papers.\n"
        },
        {
            "course_name": "intro to italian cultural studies",
            "review_date": "January 18, 2003",
            "review_content": "\nclass consists mostly of discussion, but moe does a good job facilitating it so that the class doesn't go round in circles or get hung up on unimportant details. i enjoyed the variety of sources -- academic texts, primary sources like novels and periodicals, and movies -- but the readings were a little boring.\nWorkload:\nrather heavy. sizeable reading each week and required 1-page response papers; three longer papers.\n"
        },
        {
            "course_name": "Italian",
            "review_date": "December 31, 1999",
            "review_content": "\nDoes a good job of moderating discussion, inserting his opinion at times, but also allowing students room to hash things out for themselves. Provides good historical, biographical information, but never to excess. Highly recommended.\n"
        }
    ]
}