{
    "prof_info": [
        {
            "prof_name": "Maite Conde",
            "prof_id": 3117,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Latin American Humanities II",
            "review_date": "September 02, 2008",
            "review_content": "\nMaite is hands down one of the best teachers i have had at columbia and i have had many (im currently a senior). \nthis class at first seems like a pain but you get really into it and the text are all very interesting. it seems like alot of work but you can pick and choose like any other course at columbia..much like lit hum or another hum...anyways this teacher is amazing- she gives extensions and she is beyond a fair grader. she knows what she is talking about and really tries to get everyone involved.. there were times honestly were i was upset that i hadnt read the assignment because discussion about it was so interesting..you almost want to write the papers. she is just one of those inspiring teachers that makes you want to do well in her class- she is very nice and the work load if you are an over achiever is alot but if you just do what you need to do its not bad..and shes really flexible in terms of papers- if you are a good student and talk in class and do the posts then she likes you and gives you time. also the midterm and final are great because you go over the same themes over and over again i may be going on and on take this class for major cultures or spanish requirements...it will be a great experience. \nits not all reading you go to a cool museum see great movies like city of god and also alot of stuff on art which is great cause it brings alot of diversity to the class\nits exactly like a lit hum just way cooler and easier...\ni dont think she gave anyone less than a b-and an a is totally doable\ntake it you wont regret it! \nWorkload:\nposts 8 times a semester (short but keeps you in check), 2 papers a 6 pg and an 8pg i think midterm (like the lit hum one) and final (same- from post midterm info) there are reviews for the tests and you can go to her for help on the papers \n"
        },
        {
            "course_name": "Latin American Humanities II",
            "review_date": "May 17, 2007",
            "review_content": "\nLet me keep this as short as possible: Prof. Conde is a very lovely teacher who has a great sense of humor and who expects her students to be just as engaged in the material as is she. Class discussions were always very thorough..especially if you had done all the reading..(which you should do, because everything is well worth your time!). True, she assigns a lot of reading, and true, you should be willing  to put a lot of effort into your essays. But above all, take this class if you genuinely want to learn something about Latin America that goes beyond a history or literature course. \nWorkload:\nA lot of reading..but all incredibly interesting and useful..and even the occasional movie as well!\n"
        },
        {
            "course_name": "Latin American Humanities I",
            "review_date": "May 16, 2007",
            "review_content": "\nI've never written a culpa review in my four years at Columbia, but this professor deserves one.  Please, please, take this course with any other professor but Maite Conde.  I've taken many literature courses in the Spanish department with professors--like Jaime Hanneken or Helene de Aguilar, incidentally both also teachers of Lat Hum--who challenge and inspire their students to understand their course material from both a well-informed and a unique perspective.  In contrast, Maite encourages neither quality in this gut course.  Here are a few points to consider:\n--Even when Lat Hum is mainly limited to Spanish-language texts (read in translation, of course), the treatment of the material can feel cursory because you're covering an entire century of \"humanities\" materials from a wide range of nations with particular political and social histories, all important to understanding their literatures/films/art/etc.  But because Maite's particular specialization is Brazilian lit and film, she adds a ton of Brazilian material into the course, which only increases the utterly scattered feeling of the syllabus.  You never get a sense that you know a country's history, whether literary or political, nearly well enough to understand its art more than superficially.\n--Maite is just not a good discussion facilitator.  It's obvious that she arrives at class with certain questions and expected answers prepared, which is perhaps natural.  But the problem is that she is nearly incapable of commenting intelligently on (or, in some cases, even acknowledging) student comments that don't match her expected answers to a T.  As a result, almost every student in the class commented at one point or another during the semester that they felt as though the only way to gain Maite's approval was to figure out what she wanted to hear and then regurgitate it back at her.  This might seem fine for those of you who want a mindless \"List A\" experience, but for anyone who likes to think creatively about literature, film or art--and especially for anyone who has prior knowledge of Latin American humanities and might have more advanced analyses to offer--it's going to be a problem.  Just one example: Maite commented to me early on that my idea about a piece \"was deep--but she's a simpler person, and was looking for a simpler answer\".  As the semester progressed, the atmosphere became one of increasingly condescending anti-intellectualism... a BAD combination.  \n--Maite simply assigns too much reading for an introductory-level course.  The problem, as the last reviewer mentioned, is that you never get a sense of what reading is most important, and the consequence in terms of the classroom dynamic is that no one reads and everyone bullshits 90% of the time--which, considering that the class is 2 hours long, gets pretty old pretty fast. \n--Ahh, Maite's paper-grading.  Again, I concur with the previous reviewer: as one of the few students who got above a 90 on both papers she assigned, I saw that the only way to win her approval grade-wise is to approach her before the due date, discuss your topic with her, find out exactly which sources she thinks are important and which details of your thesis she finds most interesting, and then write the paper SHE wants to see instead of the paper YOU want to compose.  There is, as in discussion sessions, zero tolerance of perspectives (even if well-developed and well-supported by the works in question) that don't match her own.  \n--And finally, if I may quote one of my classmates, who broke down and started ranting about Maite during evaluation time--\"If I hear the word 'identity' one more time, I'm going to shoot somebody\".  I think one of the bi-products of a learning environment in which nobody reads and nobody is allowed to introduce ideas in class or on paper that don't exactly match the teacher's is that tritely superficial, often unsubstantiated analyses become the norm.  You're rewarded for throwing around the same PC buzzwords with reference to every text, repeating yourself over and over again and boiling an entire canon of artistic production down to cliches like \"identity is a social construct\"--with barely any regard for the details of the texts themselves or the perspectival differences between them.  \nIf we're honest with each other, we'll admit that this is the way the core is in a lot of cases--but if you want to put in the effort, you can still seek out an environment where genuine scholarship is attainable.  Maite's classroom is not the place, which may be the reason why there were only 10 people in our class while all the other spring sections of Lat Hum were full or over-booked.  So do yourself a favor, and go where you can learn something.           \nWorkload:\nThis class is a lot of work with few rewards.  Reading assignments can entail as many as 150+ pages per class, weekly courseworks postings are required but never brought up in class discussion, there is a midterm and a final (both of which include passage identifications that can be tricky if you haven't done the aforementioned reading), and papers are nigh-impossible to get higher than an 88 on unless you have ESP.  Who wants to jump through all these hoops for nothing?\n"
        },
        {
            "course_name": "Latin American Humanities I",
            "review_date": "January 01, 2007",
            "review_content": "\nProfessor Conde is a good instructor, but be prepared to do a lot of reading if you take this class--perhaps more than in other sections.  She assigns a ton of supplemental/commentary readings along with the regular course readings.  Some of these readings are superficial, but others are important and discussed in class.  Determining which readings are important is the student's job; she does not separate core and supplemental readings in the Courseworks outline for a given day of class.\nGrading is fair in the end, but I found the grading of papers to be a bit harsh.  Professor Conde expects students to write papers thinking all along about the context of her essay questions rather than just the questions and the books to which they relate.  Getting above a 90 on a paper required answering not just the essay question but other (unwritten) questions related to the essay topic.  Usually, the only way to find out these rrelated questions was to write the essay, turn it in, and read her comments about what other questions the paper could have answered along with her final grade.\nIf you're looking for a way to satisfy a cultures requirement this class is definitely OK.  However, if you want a lighter reading load take a different section.\nWorkload:\nLots of reading, 2 6-8 page papers, midterm, final.  Midterm was a take-home and exceedingly long, involving a trip to the Met to look at Art of the Americas.  Final is in-class and covers only the second half of the course.\n"
        }
    ]
}