{
    "prof_info": [
        {
            "prof_name": "Elizabeth Perkins",
            "prof_id": 3934,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 13, 2016",
            "review_content": "\nElizabeth Perkins is a great professor who does an excellent job of presenting concepts clearly. Perkins also utilizes multimedia, such as videos or documentaries, to supplement lectures and make them more interesting and relatable. Even though I'm not super interested in art, her enthusiasm and knowledge of the subject was contagious and even got me to start looking more closely at art. She is also very nice! Definitely recommend her for Art Hum.\n\nWorkload:\nParticipation (30%) - consists of participating in class and showing up to museum trips. Perkins also works at the Met, so she gives tours to the class. \nAssignments and essays (30%) - consists of small assignments like sketches or taking notes on certain artwork and essays. She doesn't require very long essays, but she is a stickler for grammar and proper style, so follow the rubric. \nMidterm (15%) - Slide identification (title of artwork, artist, artist's dates, medium, location) and free response essay question.\nFinal (25%) - Slide IDs and free response essay question. \n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 30, 2011",
            "review_content": "\nThanks to Elizabeth and her excellent teaching of this course, I feel a lot more solid about concentrating in Art History. The discussion that she promotes while we go over the various works on the Art Hum syllabus helped me to better understand and evaluate art. She also knows a lot about the different artists and works that we study, so she does her best to make the material interesting to even the most skeptical, but like the reviewer above said, it can get boring sometimes. If she's doesn't know the answer to a question that a student asks, she's not afraid to say that she doesn't know. She'll even take the time to find the answer and post it online on the class wiki. She also posts other helpful and interesting links for us, in case we want to know more about whatever we're studying. If you need her help understanding some aspect of the material, she's willing to meet with you to discuss whatever issues you're having. She even offers to read drafts of our essays and provide feedback, which is especially helpful if you're having difficulty with what to say.\nElizabeth is an excellent professor and I really enjoyed her class. Definitely try to get into her section if you can!\nWorkload:\nReadings, drawings, three essays, two mandatory class sessions at museums (one at the Met and the other at MoMA)\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 03, 2010",
            "review_content": "\nElizabeth is excellent. She is a wonderful woman and really made Art Hum a good experience for me. Granted lectures can get boring at times, and she knows it, but she tried with all her might to keep everyone interested and involved (it helps that she is a very beautiful woman). Towards the end of the semester she had our class play Art Hum Jeopardy. She is also very thorough. Her weekly assignment postings are full of useful links and information. She likes to make you draw sketches of everything, Grant's Tomb, St. John The Divine, etc...There are three essays, for each of which she gives a very clear idea of the assignment and what she is looking for. Her exams and grading are both very fair. The trips to the met were a lot of fun. She is very knowledgeable about all different aspects of art and is certainly the best Met tour guide I have ever had. She also brought us cupcakes on the last day of class! Above all she just really wants her students to appreciate art for what it is, and if you can learn to do that you will truly enjoy this class.\nWorkload:\nMidterm and Final were fairly easy, essays were straightforward. Homework was mostly reading, and any drawing was not graded. Overall very manageable.\n"
        }
    ]
}