{
    "prof_info": [
        {
            "prof_name": "Eric Gamalinda",
            "prof_id": 2159,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Asian American Cinema",
            "review_date": "January 23, 2013",
            "review_content": "\nProfessor Gamalinda is a very nice man who can not teach. He started off the class going through slides rapid-fire, and when one student asked if these slides would be uploaded on Courseworks, Gamalinda said no because he's trying to get them published? Seriously? Then don't go through them so quickly.\nHe's also very vague in teaching us critical ideas such as racialization versus racial formation. Although he tried many times to see if we understood the difference, he is never effective.\nGamalinda really also could have given us more grades during the semester so that we have some sort of idea as to how we're doing during the semester. The final paper feels like it's our entire grade, but he is unwilling to look at drafts before the submission date.\nPerhaps it's because he's an adjunct professor, and so he's disconnected to Columbia (he didn't even know what the tree lighting ceremony was), but this is a four credit class that won't help your gpa. Don't take it.\nWorkload:\nReadings every week, get shorter as the semester goes on\n1-3 movies every week\na few short assignments\na presentation\nweekly response to each group's presentation\nfinal paper\n"
        },
        {
            "course_name": "Asian American Cinema",
            "review_date": "January 02, 2012",
            "review_content": "\nPros: Overall I would recommend this class because the movies we watched in Asian American Cinema were very interesting and gave a good idea of the evolution of Asian American film. The movies were very diverse in subject; the material itself was really enjoyable and I thought the movies and readings were definitely worth the time. The class didn't really cover intense film theory (although that could be seen as a pro or a con depending on what you're looking for). It really focused more on ethnic studies and the beginning of the class was really centered around the history of Asians in America in general. The discussions were pretty interesting for the most part and I felt that the class taught you how to think critically about film in general. You should make an effort to say something every time because a lot of the grade is participation. The workload isn't bad because it's all just watching movies and reading articles for a 2 hour class that only meets once a week. \n\nCons: In my humble opinion, Professor Gamalinda wasn't very good at giving the students feedback. He's very knowledgable about Asian American cinema and film in general, and clearly has a lot of interesting things to say, but he was pretty vague in explaining concepts (racialization vs. racial formation??). Taking a class for the love of learning is all nice and good but realistically it would be nice to know how you're doing in the class or get actual grades for that matter. He assigns a couple short papers throughout the semester (2-3 pages) which he supposedly graded but were actually just given a simple check without a single comment besides \"good.\"\nWe don't get to watch that many movies in class. All of the movies are supposed to be watched beforehand, but a lot of them were very obscure movies that couldn't be found online (i.e. Nowhere by Gregg Araki, Freckled Rice or Charlotte Sometimes). Also it was frustrating that there was only ONE copy at Butler for a class of 20-something students. \n\nWorkload:\nweekly movies/articles (1-2 movies weekly and the articles get shorter later in the semester)\na couple short response papers which he doesn't usually assign regularly or grade (usually only 2-3 pages max)\nwe had one pop quiz but he didn't even really grade it (just a check)\npresentations (not really presentations-you just get assigned to a group of 4 and you just have to lead the discussion for the day)\na final paper (7-10 pages)\n"
        },
        {
            "course_name": "Asian American Cinema",
            "review_date": "November 24, 2009",
            "review_content": "\nThis class used to be mainly watching movies but Prof. Gamalinda recently found out that he is only allowed to show 20 minutes of a movie each class.  In the beginning of the semester, we would watch a movie for 1.5 hrs & then he would spend the rest of the class explaining Asian American concepts like the model minority & how it was integrated in the movie with just saw.  Now, we must watch the movies by ourselves before class and we discuss the movies for 2 hours.  If you're looking for a class where you just sit and watch movies, this isn't the class for you anymore.  It's annoying to go to Butler and hunt down these random movies.\nOverall, Gamalinda is a nice guy but he surely isn't used to lecturing or leading a discussion for 2 hrs.  The class is however interesting and is certainly unique.  It gave me the opportunity to watch movies I never would have watched and also to critique in respect to Asian American history.  It was also interesting to trace the historical evolution of ASAM cinematic representation through the semester.\nWorkload:\nrandomly assigned 1-2 pg responses to movies, pop quizzes (I've only had one), 1-2 essays to read before class, 1 movie to watch before each class, & a 10-12 pg final paper\n"
        },
        {
            "course_name": "Asian American Cinema",
            "review_date": "January 17, 2009",
            "review_content": "\nProfessor Gamalinda charges his students to think.  It's a wonderful course with manageable readings.  The classroom could be relocated to a bigger space with a better (flat-screen) TV.  The films are enjoyable; however, there are better films for Indian-American films and that should be reviewed.  He makes everything topical and relevant.  Personally, this is one of the best courses I've had in my three and half years at Columbia.  Did I mention that it's a 4-point open enrollment seminar?  He takes roll since you have to be there once a week.\nWorkload:\n2-3 Mini-responses (1-2 pages) on films watched in class that are not really graded.  1 final paper (10-15 pages).  Mandatory participation--say something every class.\n"
        },
        {
            "course_name": "Asian American Literature and Culture",
            "review_date": "June 16, 2006",
            "review_content": "\nProf. Gamalinda's class is 80% watching videos/listening to inane discussion/trying not to fall asleep and 20% self-investigation of what seem to be interesting texts.  The reading selections run the gamut, from gay Indian poets to angry Chinese/Korean/Japanese writers.  As a person who usually does well in these types of classes, I found the papers to be graded rather harshly--maybe our TA, Jason, finally realized that the lack of teaching in the classroom translated to a lack of integration in written work.  In other words, I feel like Prof. Gamalinda does not teach at all--what the other reviewers said about classes being lead by student discussion groups is absolutely true.  While this may be a useful pedagogical tool in theory, this probably ranks up there with Da Vinci's flying machine--probably a useful invention but in reality a complete and utter failure.  That being said, if you usually do well in English classes, you'll probably do well in this class.  If you want a slacker class and get a decent grade--B/B+, take this class.  This class is DEFINITELY not an easy A.\nWorkload:\nShort readings every week, 2 books--America is in the Heart and The English Patient, presenting a reading\n"
        },
        {
            "course_name": "Asian American Literature and Culture",
            "review_date": "July 07, 2005",
            "review_content": "\nI enjoyed Gamalinda's class.  He picks interesting readings.  I liked his teaching style and his poetic sensibility.  However, I loathed going to class when the TA took over because she was the poster-child for pretentious English PhD students. At times,  I appreciated her effort.\nIt's sucks that the grading depends mostly on teh two papers due right around mid-terms and finals.   \nWorkload:\nvery light\n"
        },
        {
            "course_name": "Asian American Literature and Culture",
            "review_date": "June 02, 2005",
            "review_content": "\nI only took this class because I thought it would be an easy A.  The class was easy but not everyone got As.  (I think the majority got Bs and B+) The only two books that were important in Professor GamalindaÂ’s class are America in the Heart and The English Patient.  DonÂ’t ask how the last book fits into this course but itÂ’s important.  I think it would be wise to get the syllabus from last semester and look at the essay question he assigned for each book, since a large portion of your grade comes from the two essays.  Work out the papers way in advance if you want a good grade.  I really donÂ’t think anyone got lower than a B in the class but I didnÂ’t know too many people who walked away with As.  I think Professor Gamalinda didnÂ’t do the grading and it was our TA.  She was harsh with the grades and she was very specific with what she wanted in our papers.  I agree with the last review that this is a good slacker class, but if you want A in this class you have to write two excellent papers.\nWorkload:  Extremely light its ridiculous.  A story or a poem for class each time we meet. One week off from class to read each of the novels.  Saw around two movies (Â“Finding ChanÂ” and I forgot the other one).  In the beginning of the semester he split us into groups to discuss poems.  So you were left on your own to decipher itÂ’s meaning, which usually lead to nowhere.  DonÂ’t expect too much from Professor Gamalinda because he is not the greatest lecturer.  He would stop in the middle of his sentences and forget what he was saying.  He is very approachable and friendly, but not always available when you need him outside of class.  DonÂ’t even bother with emails because he takes a very long time to reply.  Towards the end of the semester the TA basically took over and lectured the class.  Sometimes I thought the TA was more like the professor than Professor Gamalinda.  The two papers needed to cite books and articles he gave us.\n\nWorkload:\nExtremely light its ridiculous.  A story or a poem for class each time we meet. One week off from class to read each of the novels.  Saw around two movies (Â“Finding ChanÂ” and I forgot the other one).  In the beginning of the semester he split us into groups to discuss poems.  So you were left on your own to decipher itÂ’s meaning, which usually lead to nowhere.  DonÂ’t expect too much from Professor Gamalinda because he is not the greatest lecturer.  He would stop in the middle of his sentences and forget what he was saying.  He is very approachable and friendly, but not always available when you need him outside of class.  DonÂ’t even bother with emails because he takes a very long time to reply.  Towards the end of the semester the TA basically took over and lectured the class.  Sometimes I thought the TA was more like the professor than Professor Gamalinda.  The two papers needed to cite books and articles he gave us.\n\n"
        },
        {
            "course_name": "Intro to Asian-American Literature and Culture",
            "review_date": "September 07, 2004",
            "review_content": "\nI took this class hoping to get a good overview of Asian American Literature, and wow was I completely disappointed. I only stayed in the class because it fulfilled 2 major requirements for me and was absolutely no work. I think I went to half the classes and read 10% of what was assigned and walked away with an A. Professor Gamalinda is a poet (not teacher) by profession and seems to avoid saying anything educational or substantial. He breaks the class into small groups and basically lets go of the reigns, resulting in the most disorganized discussion you'll ever experience. The only two books you read in class are The English Patient and America is in the Heart (which, by the way, we got complete weeks of NO CLASS to \"finish reading the book\")....everything else comes in his coursepack, a flimsy group of pages of random poems and short stories that are of course interesting, but not particularly challenging. We spent entire classes discussing two or three poems with no focus, which basically led to beating a dead horse. If you really want to learn about Asian American Literature, wait until another professor teaches this class. Otherwise, it's a great slacker class.\nWorkload:\nyou get 2 weeks each to finish reading the 2 books he assigns. other than that, there's a couple poems or short stories for class that take 15 min to read. i think there were two papers to write during the semester on essay topics that were so wide and general you'll have no desire to answer them.\n"
        }
    ]
}