{
    "prof_info": [
        {
            "prof_name": "Gabriele di Cerbo",
            "prof_id": 13332,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "January 24, 2017",
            "review_content": "\nGabriele was a pleasure to have as a teacher; I had a wonderful experience with him in Lin Alg. He was very approachable at hours and always happy to help. He's a very nice, laid-back guy. He told us he would be very generous with the curve and a lax grader, and he held that promise. \nWorkload:\n2 midterms, 1 final, weekly hw (very standard)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 29, 2016",
            "review_content": "\n\nAs someone who previously loved math, the fact that I am relieved to not take another calc class tells you all you need to know about Cerbo.\nFirst- Cerbo does not know how to teach. I gave up showing up to class after a month because I honestly got nothing out of it. He is very awkward and does not seem to know what is in reach for the class. Apparently he got better near the end of the semester-- I wouldn't know. All I know is that the class got crazy difficult from the second midterm on. The second midterm was a nightmare, plagued with mistakes only corrected via email from an absent Cerbo in real time. And the final was on a whole other level. My friends from higher levels of calculus were surprised they couldn't do a single one of the problems from my practice final. Although the class was curved, I would still appreciate being taught how to do the questions I'm given. The assigned homework was very deceptive, nearly all of the problems extremely easy compared to the final. I will say, his practice exams are decent indicators of what you need to know for the final. If you do take his class, don't assume he's making them easier than what's on the actual test. \nIf you want easy A, do not take Cerbo, even if you've taken AP calculus! If you want to learn and truly understand the material, do not take Cerbo! Just don't take Cerbo lmao. \n\nWorkload:\n- homework once a week, 2-3 hours (including teaching myself the material), lowest homework dropped (20%) \n- 2 midterms (40%)\n- 1 final (40%) \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 29, 2016",
            "review_content": "\nDisclaimer: I took Calculus BC in high school and did well in the class. \nAlright, the first thing that you need to know is that di Cerbo is a bit of a mixed bag. But the dude knows his shit. Seriously, go to youtube and find his video on birational geometry. If you can get past the 20 minute mark, get the hell outta Calc I and go to Honors Math. \nAnyways, di Cerbo is a pretty average math teacher. When talking about Mean Value Theorem, or the FTC, or Intermediate Value Theorem, or Squeeze Theorem, he always does a proof. This can be either good or bad - if you find value in the proof of a theorem, and that helps you understand, then great. If not, you can just snooze for 20 minutes in the classes where he introduces them. One plus point: He always brings a lot of examples to the table in class. The structure will almost always be \"Prove the theorem, example problem, example problem, example problem....\" These examples increase in difficulty and correlate very closely to the homework problems. \nThat all being said, he has some negatives too. He tends to rush through his algebra, which can leave some of the class behind. He's got no problem skipping 2 or 3 algebraic steps every so often. But it doesnt happen enough to be a serious issue, so I wouldnt worry about it. He can assign ridiculously tedious homework (one of them was 10 problems of finding the first and second derivative, inflection points, concavity, asymptotes, intercepts, the works) and his TAs can be dicks with the grading. But the midterm and final aren't horrific, so I'll give him a pass.\nHonestly, he isn't stellar, but if you're stuck with him, know that he won't try to screw you. \n\nWorkload:\nHomework every week, usually fine but sometimes tedious: 20%\n2 midterms, first one on derivatives/limits and second one on FTC/Antiderivatives: 40% (20 each)\nReasonable final: 40%\n"
        }
    ]
}