{
    "prof_info": [
        {
            "prof_name": "Stacey Lutz",
            "prof_id": 5963,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "W2680 Social and Personality Development",
            "review_date": "August 23, 2012",
            "review_content": "\nBeware.\nThe course material is honestly not very difficult at all and Stacey is a fairly good lecturer (if not a bit like an elementary school teacher with her obvious answer questions that would throw everybody off since we're not used to that here).  She does make the material abundantly clear so that chances are you will find that you totally understand the concepts  (provided that you go to class OR do the readings, which are also pretty straightforward).  Sometimes she overdoes it with the review of what we learned last class in the next class (which is quite useful when you do skip a class/reading or few) but your difficulty will not be in understanding the material, but in trying to understand what in the world she wants or expects from your papers.  She will take a whole hour out of the class to go over the assignment and clarify her expectations, which on the surface seem simple enough.  However, when you get your grade back chances are you won't be happy and it's because, as the other reviewer pointed out, the TAs are really strict on what they expect.  When I went over my paper with the TA, the rubric they were supposed to adhere to was so strict and detailed--which was annoying considering the papers are not allowed to be very long AND there's a penalty for going over the length.  In a way, she over complicates things with diagrams and such in her notes which are not really necessary, and if you don't explain the concepts exactly as she did, you won't do very well.  Plus, the second paper was unfair (in my opinion) because it was something like \"Come up with your own new theory using the theories we learned in class.\"  \n...  \nThe people who come up with these things spend YEARS fine tuning their theories and ideas so it's pretty unfair to ask us to come up with something really sophisticated and insightful in like a period of a month and squeeze it into 6-8 pages in addition to in-depth explanations (and they must be in-depth or you lose points) of all the pertinent theories we went over in class.  \nThe midterm/final are pretty easy.  You basically just have to replicate the outlines you got from the class notes in essay form.  If given the chance, I would avoid this class and take another one instead.  I found it way too frustrating and her random rude outbursts in response to students whispering or people outside the classroom talking to be quite disconcerting.  Her constant references to herself and when she did swing dance were also pretty annoying.\nWorkload:\n2 papers (make sure you follow that paper referencing guide!).\nA midterm and final which are essay questions and she gives you a study guide.  She says they're short answer essays but don't be fooled!  If you want all the points, you're going to need to write a lot and get down almost everything she went over in class.  She is *very* thorough.  \n"
        },
        {
            "course_name": "Social/Personality Development",
            "review_date": "December 21, 2011",
            "review_content": "\nI had Stacey Lutz for Social/Personality Development. I am a die hard Culpa reader, and while you often have to take what you read here with a grain of salt, when there's an overwhelming consensus among the reviews it's easy to get a feel for the professor. Suffice to say I was skeptical when I typed \"Lutz\" in on Culpa and came up dry. But still I sat in on the class and fell in love with the flirty, funny professor who reminded me of the aunt I never had. \nBut wait, and keep reading. While her lectures are exceedingly clear and very entertaining she is among those professors here at Columbia University who are either feeling the heat from their department to practice grade DEflation or just doesn't believe that before we enrolled here at Columbia, we were all for the most part \"A\" students. Basically this translated into her giving the TA's a talking to about being \"strict\" graders (i.e. she would take points off if you were even half a page - double spaced - over the page limit). In the end she would give us back our grades saying that she was happy with them and that she thought we did very \"well\" when there were about a fair number of people in the \"F,\" \"D,\" and \"C\" range. \nPerhaps in another class I wouldn't think this was so bad, except that her idea of what it meant to do well didn't really gel with mine. Grading was based on one 5-7 page paper, a midterm, a 6-8 page paper, and then a final. The first assignment we were given was a 5-7 page paper. When we got it back she said she might be curving it as there were only a few people who had received A's (and those were low  A's), with the majority of the people lying in the D-B range. As inspiring as the idea was, it never came to be and when we got back our midterms, she decided the class did too well. But before you start imagining a midterm where everyone got an A, stop, take a step back and remember this is Columbia. If such a thing ever happened I would advise you to spit several times or throw some salt over your right shoulder because your professor is clearly possessed by something. So what exactly does doing \"too well\" look like? Well, all my little over achievers, this means basically that no one failed or had a D, a result that was simply not okay with Lutz. It wasn't even like a LOT of people had A's. The number of A's were less then then number of B's and there were a fair number of C's. Our next paper, which was a 6-8 page paper, left Lutz absolutely tickled. About 4 students failed the assignment with several others landing squarely in the D range, a number of people had C's, there were a bunch of B's and only a few A's.\nBottom line- be wary. It is definitely possible to do well on the tests but the class just leaves you a little bewildered and kind of discouraged. After all, she does a great job helping you to really understand the material that you would think she would be eager to see you do well...and you become so excited to write the paper and then find points taken somewhat randomly. So now you're free to make your own decision but if you decide to take this class PLEASE, go over an outline (Lutz's favorite word as she'll be sure to tell you repeatedly the story of how her father did outlines with her growing up) with a TA or better yet with Lutz herself! Better yet go over it with both TAs and Lutz, because I'm telling you these will be gone over with a fine tooth comb! Best of luck!\nWorkload:\n1, 5-7page paper (double spaced, points deducted if you over and that includes references); Midterm (you're asked to answer 5 out of 6 essay questions... but before the exam you're given a study guide with 6 potential questions that are more expansive versions of what will actually appear on the test); 1, 6-8 page paper (same rules as applied to the first); Final (same as the midterm except the review sheet had 7 possible themes as opposed to 6. Although on the exam were were still only asked to choose 5 out of the 6 questions to answer.) The reading is manageable and very interesting but not necessary if you go to class.\n"
        }
    ]
}