{
    "prof_info": [
        {
            "prof_name": "Victor Corona",
            "prof_id": 9913,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Sexuality and Society",
            "review_date": "September 10, 2015",
            "review_content": "\nVictor Corona is one of the most fascinating professors I've ever had. He is a great lecturer and his syllabus is fantastic. The readings are interesting and well chosen. But (and this is a big but) he is the most arrogant, self-centered, and inappropriate professor on campus. His lectures always end up wandering onto the topic of him, what he's writing, the famous people he knows, and the hot LES clubs he visits. Before we started writing midterms we spent one day of class going around proposing topic ideas. Some he loved, some he was neutral on, and some he hated. Instead of giving constructive criticism he tore my classmates apart. He even went so far as to say that the next person that presents their topic idea should have something good or else he would \"throw himself out the window and into Broadway.\" While this was mildly entertaining, it is completely inappropriate for a professor to behave in this manner. He also has a bad habit of picking favorites (if you're an attractive girl who likes to go clubbing he will love you). One class he had the audacity to wear reflective sunglasses while lecturing which left me speechless. Additionally he frequently calls certain kinds of people douche bags. I get it. Some of the people we discuss in class easily fall into that category, but he did it so frequently that it lost its entertainment value and just came off as unprofessional and lacking the ability to articulate his sentiments. \nIf you take his class you need to do the readings (which isn't hard because they are all interesting) and arrive prepared to be called on even if you don't raise your hand. Make sure you have a thick skin because he will put you on blast if he doesn't like what you have to say. Occasionally he conceded that a students argument was sound despite his disagreement (but that was as rare as the Hamilton elevator being free).\nIf I could go back in time I would get a list of the readings he selected and then drop the class. He has the potential to be a great professor, but he needs to lose the attitude and remember that we are students paying and showing up to be taught by a professional. Not a whining diva who wants to go get his drink on at The Box. \nWorkload:\nA 3 page response paper to a weeks readings\nMidterm about 6 pages and final about 10 pages (both which are unclearly graded)\nAbut 6 articles a week that can get pretty lengthy. They are interesting so if you don't have the time to read in depth they are definitely worth skimming to pick out main points. \n"
        },
        {
            "course_name": "Sexuality and Society",
            "review_date": "April 29, 2015",
            "review_content": "\nImagine if, on the first day of classes, Stefan from Saturday Night Live flounces into class and begins to lecture on New York's Hottest Club, The Box. Only Stefan isn't tame and just annoying, he's your professor who gives you grades, is blatantly rude to the students he doesn't like, and spends half of his lectures talking about himself. He puts together a banging syllabus, sure, but then spends his lectures talking about all of the different clubs he goes to as part of his research. At around halfway through the semester, he just seemed to stop caring and just started talking about his life. It's quite clear that he really cares more about his own work than he does about teaching.\nHe also does things that no professor should ever do, like read out the names of the students who received A+'s and A's on the midterm paper, and talks pretty openly about how some statements that students have made in class make him want to \"throw himself out of the window.\" He's smart and sassy, sure, but he passed that point, and there were several students in the class (including me) who were scared to speak up because he shut us down so quickly.\nBottom line: if you're interested in the course material, show up and get the syllabus on the first day and then drop the class and do the readings on your own time. The readings are all amazing and interesting. Corona, however, isn't.\nWorkload:\nMidterm paper (5-6 pages) and final paper that requires you to do two interviews about a topic relating to sexuality of your choosing (10-12 pages). One response paper to the readings (2-3 pages). Participation, if you have the skin thick enough to not care about his responses to you.\n"
        },
        {
            "course_name": "Sexuality and Society",
            "review_date": "April 05, 2015",
            "review_content": "\nThis class is not Sexuality and Society. This class is the Victor P. Corona lecture on Victor P. Corona. The class started off perfectly. Corona is sassy, knowledgeable, and relatable. His class seemed to be the ideal class which had just enough reading to be serious, a well-organized syllabus, and discussions that related directly to the readings. However, the readings began to relate less and less to the class and the class itself became about who he knows and what he is writing about. Don't get me wrong, the entire semester was incredibly fascinating. He also becomes increasingly frustrating. You really need to have thick skin when it comes to dealing with him. During our midterm presentations he was incredibly rude and acted like a middle schooler in a class he hates. Corona is a brilliant man studying a fascinating topic but he does not know how to act like a professor in a classroom setting. He also picks favorites. Are you an attractive girl who visits clubs downtown frequently? Well, Victor P. Corona will be your new best friend. Also, he invites really fascinating people to class and it can be a great opportunity for networking.\nBottom line: This class is super cool*\n*if you can deal with Corona's pretentious attitude and lack of professionalism\nWorkload:\n1-2 hours of reading a week, often cancelled\n1 midterm (5-6 pages) on a cultural object, graded on mysterious criteria\n1 final which involved interviews\n1 reflection paper on the readings\nOverall very doable.\n"
        },
        {
            "course_name": "Social Media",
            "review_date": "April 28, 2011",
            "review_content": "\nSeems like a brilliant man.  I wish he would have guided the conversation more or lectured a bit more.  The material was very relevant to our everyday lives (perhaps why so many students all but had therapy sessions in class).  However I would recommend the course to students.  He is somewhat disaffected but not unreasonably so.  The workload is very realistic and I even did all the readings for the class because he realized that students at Columbia take more than one class per semester.\nWorkload:\nweekly reading 1-2 hours worth, response memos that he took out half way through the class, a presentation one week on the readings, midterm research assignment, final paper based on readings.  Overall VERY realistic.\n"
        }
    ]
}