{
    "prof_info": [
        {
            "prof_name": "Kurt Dasbach",
            "prof_id": 1593,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Strength Training",
            "review_date": "January 20, 2004",
            "review_content": "\nI was thrilled with Kurt's class.  He's a knowledgeable instructor and very easy going.  If you can finagle a way into strength training with Kurt, I suggest you do so while you can--his classes tend to be cramped dwellings.  He's upfront and honest, and doesn't play any tricks (he'll expect the same of you).  I rate this instructor A+.  \nWorkload:\nThe workload is fine, except for that load of weights!\n"
        },
        {
            "course_name": "Strength Training",
            "review_date": "January 18, 2004",
            "review_content": "\nHe's a great professor. Very nice, very helpful. He tries to learn everybody's names. Don't try to fool him, he'll notice. If you ask, he'll help. He tries to create a program that fits your needs or wants. Overall, an excellent professor.\nWorkload:\nAttendance - you can have 6 cuts. A late is a half-cut. He'll know if you don't attend.\n"
        },
        {
            "course_name": "Strength Training",
            "review_date": "June 07, 2003",
            "review_content": "\nThe last review was incredible.  I can't stress enough how helpful that reviewer was.  Because of the previous review, I elected to take Kurt's class.  It was an excellent ride.\nJust don't trick him, and you'll be fine.\nWorkload:\nJudge Croc rules:  time-consuming and a brain teaser, but worth your while.\n"
        },
        {
            "course_name": "Strength Training",
            "review_date": "May 06, 2003",
            "review_content": "\nthis class is a good time.  kurt is a personable instructor, and he'll help you tailor a program to fit your needs or wants.  although he walks about giving the occasional unsolicited advice or adjustment, he's not meddlesome.  kurt pretty much keeps to himself, but he's helpful and a good resource as he also knows quite a bit about forms of exercise other than strength training.\nwatch out:  kurt does Not lead a group warm-up (it's just not what he believes), so if you're looking for one of those, don't take his class.\nWorkload:\nattendance, don't faire the sneak out.\n"
        }
    ]
}