{
    "prof_info": [
        {
            "prof_name": "Ian Zuckerman",
            "prof_id": 9509,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 14, 2011",
            "review_content": "\nTake this professor if you really enjoy engaging the reading on your own. Although this professor seems extremely smart, his classes are not enjoyable, better yet, they are unbearable. He talks and talks nonsensical information, information that is not useful and he picks details to discuss that are pretty much pointless. To articulate a point there is a speech of five-ten min that precedes it. And so by the time he finally says his point, he has already lost the entire class in boring material. Also, he tries to engage the class and get us talking however, his questions are like 5 parts...seriously. It is just not feasible to answer them because firstly, his questions are always what people skimmed, and secondly, he never gives us enough time to answer. \nIT IS JUST A BORING CLASS. I understand that CC is CC but this is not an engaging class...just terrible discussions. TERRIBLE.  Most of the time Ian is just talking to one student. \nAs for the workload, it is a take home midterm that is basically a Uwriting assignment of putting texts into conversation and beware of the straw argument, he will kill you for it. He seems to enjoy plausible arguments but his midterm took hours to complete despite the fact he said it would only take 4 hours tops. That's not true. Expect to take longer. I rather take a in class exam   any day than do that midterm ever again. But most people did rather well. \nThe rest of work is duable. So its up to you, you can have an easy grade if you follow his structure but you decide if it is worth the boring discussions. \nWorkload:\nMidterm, final. Two essays, then two postings per week. One presentation on one of the works.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 15, 2010",
            "review_content": "\nIan seemed like a smart guy and a capable professor. Unfortunately the way the class was structured he gave a droning non-informative lecture the first half of the class and then tried to foster discussion the second half of class. This was never successful. I'm not sure if it was the composition of the class or Ian's inabilities to put forth \"controversial\" statements as he called them. But I never felt the class went anywhere or taught me anything innovative or different about the texts.\nIan only assigned the basic CC readings - no more, no less. I tended not to favor his essay topics - but was very easily able to write about what I wanted with his approval.\nGrading (though I've only seen my midterm and one essay, the other was due this week) has been a pleasant surprise. He didn't necessarily agree with my arguments: but because I supported them well it was a great essay. Biggest criticism was that I needed to better proofread my essay - which I agreed with having never done it for having finished/handed in the essays right as class started. Still I got A-/As.\nAgain I felt that most of the benefit was from reading the text. The class didn't do it for me.\nWorkload:\nFairly basic CC. \nResponses on Courseworks for every class, two papers (one 5-8 pages and one 8-10 pages due last day of class). A midterm of take-home essays and a final of 'in-class' essays but composed at home during the CC final time slot.\nNot too overwhelming if you keep up with the reading.\n"
        }
    ]
}