{
    "prof_info": [
        {
            "prof_name": "Kristina Olson",
            "prof_id": 1042,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian I",
            "review_date": "April 22, 2004",
            "review_content": "\nProfessoressa Olson is so great! Her two hour classes actually fly by and she is one of the sweetest people I know. She is an excellant instructor. I never even felt like I had to study for her tests because she prepared us so well. Bravissima!\nWorkload:\nNightly hw, collected in class. A couple of easy dept. quizes, midterm, final.\n"
        },
        {
            "course_name": "Intro and Intermediate Italian",
            "review_date": "November 18, 2003",
            "review_content": "\nOne of the best language teachers I've had.  Workload is simple, just takes a few minutes every day.  She's a very fair grader and you will learn italian well in this class.  The only thing that can get annoying are the group skits once in a while.  Other than that there is a very social atmosphere in the class due to her emphasis on cooperative learning in small groups of 2 or 3 during class.  If you have the chance, take italian with her.\nWorkload:\neasy workbook homework, weekly lab, fair quizzes, midterm, final.\n"
        },
        {
            "course_name": "Intermediate Italian I",
            "review_date": "October 19, 2003",
            "review_content": "\nShe is an amazing professor. I never once saw Kristina in a bad mood and when I came to class sleepy she was always peppy which cheered me up. She is funny and joyful. She is an excellent teacher who makes every concecpt clear in a step-by-step fashion. She is always available to answer questions and is more than willing to give you extra help if needed. She is 100% amazing, there was not ONE SINGLE THING that bothered me about her. Her teaching methods are simply excellent.\nWorkload:\nWeekly compositions (short, 200-300 words), worksheets, listening labs every other week, quizzes every other week, midterm and final.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 17, 2002",
            "review_content": "\nHaving spent three semesters at Columbia, I've suffered insufferable profs, But hands down Olson was the best teacher I had the luck of selecting -- she's so so so understanding, and her LEGIT passion for the language is communicated.  I took KO my first semester, and recently passed her on my in a hallway; seeing her again alerted me to the fact she's the only prof I'd ever stop in the hallway to have a conversation with.  In fact, Kristina is so much fun I'm sure it'd be a pleasure to spend an hour drinking espresso with her at Pertutti.  But for those who can't work their way into her personal schedule, find a way to work into her professional schedule.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 08, 2002",
            "review_content": "\nTake this course! Kristina is an AMAZING professor. She manages to keep everyone wide-eyed at 9 AM! I would suggest this class above any other that I have taken. Sign up now. \nWorkload:\n4 papers, weekly quizzes, 2 tests, nightly homework assignments (which she collects.) If you put in 20 minutes a day, you will get an A. \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 25, 2002",
            "review_content": "\nI don't think there could be a better teacher for this class. Kristina is funny, sweet and approachable and you never feel like you aren't getting the attention you deserve. Her grading is very fair; you always get the grade you expected. I know its cheesy, but class really feels more like a family than a random assorment of students. With this environment, its easy to ace every quiz.....Take this class with this woman!!!!\nWorkload:\nquizes every week or two, 4 compositions, midterm and final....all very do-able... \n"
        }
    ]
}