{
    "prof_info": [
        {
            "prof_name": "Lillyrose Veneziano Broccia",
            "prof_id": 3281,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Italian I",
            "review_date": "May 18, 2007",
            "review_content": "\nComing off a semester of very little work in Professor Bellati's class (highly recommended if you have the option), I was a little worried that Lilly was going to be all work and no play. Little did I know that this woman is a saint. She is so kind, sympathetic, forgiving (you can tell what kind of student I was), and very skilled in teaching Italian. Essentially, she allows you to make the class as much work as you want it to be, in that she'll accept assignments well past deadlines and go over everything in class (ergo, it matters little how much you do outside of class). She was also very cool about a little harmless tardiness every now and then. Basically, she's the coolest, and she adds little touches here and there to make the class more exciting (including bringing in food, making a mix CD for us, and using our midterm reports to create a guide to Italy for the whole class). I'm not going to pretend that this course will change your life; if you're like most people enrolled, you're probably taking it to fulfill the language requirement anyway. But Lilly makes it fun, and she will meet with you outside of class whenever to go over confusing concepts. She also prepares you very well for the quizzes and exams, which was much appreciated by this lackluster studente. All of that is why, in a department full of young, friendly instructors, Lilly is simply the best. (She is also very jovial and good-natured in class--I don't think I saw her get upset with anyone once this semester.)\nWorkload:\nThe same random assignments that the department requires profs to dole out every now and then. Semi-regular quizzes that Lilly marks up and has you correct. A few presentations that are very open and easy to complete. And don't worry about turning things in late. Ah, how I will miss Lilly.\n"
        }
    ]
}