{
    "prof_info": [
        {
            "prof_name": "Richard Friesner",
            "prof_id": 889,
            "total_reviews": 28
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 30, 2014",
            "review_content": "\nFriesner was a pretty distant professor, but that is to be expected for a large lecture class. In general he was pretty fair but just an average lecturer as he merely read off his slides and only rarely divulged things we might actually need to know. You could easily skip class. To do well on his tests, you really do need to know the material and especially minute details because he asks about those often. I didn't think he was a bad prof, but he's not necessarily great. \nWorkload:\n-chapter homework (not required but recommended)\n-quizzes (don't let these fool you,they're important)\n-3 midterms, lowest dropped\n-final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 27, 2014",
            "review_content": "\nDisclaimer: I did okay in the class so I have no reason to write a biased review.\nFriesner is a pretty shitty lecturer. As a matter of fact he reads right off his slides which makes going to class kind of pointless. His exams tend to contain awkwardly worded questions which at times make you feel like you're being tested on comprehension rather than the material itself. Also, his TA this year loved making ridiculously tough quizzes. He was a really nice guy but I think he expected a little too much out of someone who was encountering the material for an intro level course. That being said, if you are a self studier and one of those people who can read the book and show up for exams, this class may not be as bad for you. The curve tends to be nicer since his exams averages are pretty low compared to other chem sections. Some of his exam questions are directly off the slides so definitely read the slides after reading the textbook. Overall, I would say take this class if you are a good independent studier and NOT if you learn the most from going to lecture.\nWorkload:\nDepends on your study habits. I would just keep up with the chapter being taught in lecture. You have to anyway since there are weekly quizzes. Other than that, I would give myself full 2 days before an exam to go over problems and his practice exam. \n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 19, 2014",
            "review_content": "\n   This class was interesting and very lenient in terms of homework. Unfortunately, and I am not exaggerating, you will have to teach yourself the material by reading the book and working on the homework assignments (which are not collected). Going to lecture is optional, for the most part. Professor Friesner provides an overview of each chapter and drops hints about what will or will not be tested.\n   Lectures are, in a way, an overview of what you should have taught yourself. You cannot expect to learn the material at the lecture or even in recitation. Many of the formulas are long and involve 4-5 steps to complete, with missing variables at any step. Just because the Professor and TA's only briefly mention a topic/formula does not mean that it will not be a major part of the next exam/quiz.\n   The quizzes and tests are usually an even mix of highly conceptual problems and involved computational problems. Some of the formulas that I was tested on were literally only mentioned once in lecture and recitation. The best way to succeed is to learn what kinds of computational problems you'll be tested on (usually assigned in the homework) and drill them in all their permutations. After you get good at them, the computational problems will be money in the bank for exams. For the conceptual parts, read the chapter early and let the concepts roll around in your head as you do the homework. Don't be afraid to use YouTube and Khan for some additional help.\n   Recitation was the worst part of my week. Right off the bat, you have a 15 minute quiz, most of which are super stressful. The remaining 45 mins were simply not enough for the TA to review all of the lecture material. The Quizzes can be soul crushing, even if you studied hard. My class average, across all of them, was somewhere around a 65. Even though I knew there would be a curve, I definitely had a few long walks home after getting wrecked on a quiz. Expect it, it will happen to you.\n   I would only recommend taking Gen Chem with Prof Friesner if you're a certified self starter. You'll have to teach yourself the course, flat out. I never went to office hours or attended a study group and got an A-. Just be aware that the material is highly conceptual and you'll have to know the formulas and concepts like the back of your hand.\nWorkload:\nThe workload is pretty much all study time. Homework is assigned for each chapter, but is not collected.\n-3 Midterms, one dropped, first is the hardest\n-7/8 exams in recitation. 15 min time limit, two dropped, range from impossible to complete to easy\n-Final, tough but fair\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "February 17, 2012",
            "review_content": "\nI feel obligated to write a review for professor Friesner, because I think he does get a bad reputation from all of the other CULPA reviews below. Friesner is a good guy, but a bad professor. However, that is not to say that it is impossible to get a good grade in his class. Although he teaches straight out of his slides, be aware that his slides are based off of the Zumdahl book and that his exams are based off of his slides. So therefore, his exams are straight out of the book. I went to maybe 50% of the lectures, and got an A+ in that class. The easiest way to do well in his class is to read the book at the same pace as he teaches. The Zumdahl book is straightforward, and so are his exams. As long as you read, you'll do fine. Also, the TAs are extremely helpful, because they know that Friesner doesn't do a good job of teaching such simple topics (he often goes on ridiculous tangents into really advanced chemistry), so go to office hours and recitations, because they will help. \nFriesner posts practice exams with answer keys before each midterm, and posts the actual midterms with your answers after each test. He is very generous with giving back points, so argue for your points!\nAlso, know that he is teaching GEN CHEM I, which means that there are a lot of people who think that they're going to be pre-med, but can't handle the workload in that class, creating an extremely generous curve.\nHe's a good guy, bad teacher. But by the end of the course, if you put in the effort, your grade WILL be an accurate reflection of how much chemistry you learn. \nWorkload:\n20% recitation quizzes (easy), 20% midterms (3 of them, lowest one dropped, slightly difficult), and 40% final (fair).\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 07, 2012",
            "review_content": "\nHorrible, but fair, professor.  His lectures suck, point blank.  Contrary to what another reviewer said, his slides are his own, or at least edited by him, even though they say the book name at the bottom.  He reads straight from the slides and seems condescending when he answers questions (even though I don't think he means to).  He actually does care that we learn from him even though we are undergrads, even though it doesn't seem like it at first.  Go to the TA's office hours if you need help; they are useful.\nAll his slides including his exam review slides are posted online.  Study them and read the book, and you'll be golden.  The only reason to show up to lecture is that he'll tell you what WON'T be on the exam that is in the reading/he accidentally left in the slides.\nDefinitely, definitely read the book!!!!\nFair grader, fair exams.  Average is usually low, so curve is generous.\nCan't say that you shouldn't take this class, because he is fair.  If you read the book, you'll learn the material, and his slides are stellar imo.\n\nWorkload:\nHomework that isn't collected/graded. Quizzes in recitation. Three midterms, lowest dropped. One final.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 25, 2011",
            "review_content": "\nIt would be unmerited to characterize what happens in Friesner's lectures as \"teaching.\" He simply reads verbatim from the extremely elementary PowerPoint slides that he has managed to throw together. \nThese same slides are always posted on CourseWorks, so by the third or fourth lecture,  most people eliminate the middle man, read the slides themselves, and stop wasting time at his classes considering that they are simply an opportunity for Friesner to recite the information to you.\nUnfortunately, most of what's covered during the semester will essentially need to be self-taught, which is no small task considering the complexity and the inherently confusing nature of the material. \nNeedless to say, the best part about this Chemistry class for me was when it came to a conclusion.\nWorkload:\nQuestions assigned for each chapter, but these were never collected. Three midterms, one of which is dropped. The quizzes in the recitation session combined count as a midterm grade. Then there is a final worth 40% of your grade.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 24, 2011",
            "review_content": "\nThis professor was useless.  Professor Friesner, or as we call him \"Ricky Bob Friesner,\" is completely uninterested in undergrads and really couldn't give a rat's ass about us.  I heard that he is a millionaire because of some huge discovery he made, and is a major hot shot in the field, and an incredible researcher, whatever.  But no man can be perfect.  In Friesner's case, he fails completely at teaching.\nHis lectures are ridiculously boring, he only reads the slides that came with our textbook (unaltered).  Think that having a well-known professor will add value to your class?  Think again.  I could have learned more by reading through the slides myself for an hour and 15 minutes.\nBecause of this, I stopped going to lectures right around the beginning of October.  Chem was much better after that, I just read the book before midterms and managed to get through the course putting no more than 6 hours (total, including study time) of work between the beginning of October and the end of the semester.  I didn't get a great grade, but it was worth it.\nOf course, Ricky Bob Friesner still gets a chance to fuck with us on the tests.  On the first midterm, I got an uncurved 22/25.  Then, two and a half weeks later, they emailed us to say that they were changing the answers to the midterm.  They switched the answer to one question, and not only added points to people who got the new correct answer, but REMOVED points from people (like me) who got the old correct answer!  The craziest thing is that one of the answers was correct in the textbook, and the other was correct in Friesner's lectures--so I got points taken away 2.5 weeks later for putting down the answer that our textbook listed.  Wicked, bro.\nDon't bother taking this class with Friesner.  Or, if you do, just don't come to lecture at least.\nWorkload:\n3 midterms, 1 final, plus seven weekly quizzes in recitation section.  No required HW/problem sets.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 23, 2011",
            "review_content": "\nThis was a very fair class.  The lectures were not particularly interesting, as Friesner essentially read off his slides.  Occasionally, he offered some extra information but the tests did not contain any material outside of the powerpoints and the textbook.  The midterms were very fair.  Most of the material is covered in the powerpoints and the review before the midterms (25 MCQ) covers a lot of the topics that will be on the midterm.  The questions on the midterm were sometimes quite annoying (lots of which one of these is not true) but they were doable if you studied well.  The recitation was also very fair.  My TA was not an exceptional teacher but he did a fair job.  Overall, this class was fairly easy.  You don't need to go to lectures to do well (I stopped going after the first three weeks).  Just self-study and look at the powerpoints.  \nMidterm One: Class Average: 70-75\nMidterm Two: Class Average: ~65\nMidterm Three: Class Average: 70-75\nOne midterm is dropped and there are 7-8 recitation quizzes (2 dropped; average of quiz grades is equivalent to another midterm). Midterms are 20 percent each\nFinal is 50 questions and counts for 40 percent.  The class is curved ridiculously.  The class average is curved to a B and one standard deviation above is an A.  For those who have previous chemistry experience, an A is not very hard to obtain.   \nWorkload:\nNot much.  Just study the two days before the midterm.  3 midterms (1 dropped) 7 quizzes (2 dropped) and final.  There is optional hw that is useful to look at in preparation for the midterms.  I received an A+ :)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 23, 2011",
            "review_content": "\nThis class is extremely boring. Friesner only reads off the slides that are basically like reading the book. I went to the first 3 weeks of class then stopped going altogether. He does post exam review power points that say, for the most part, what you need to study. I personally do not enjoy his exams, there's a lot of theory based questions and you really need to understand to subject to get them. He also words them weird:\n\"Which of the following is not correct?\" \nWhich pisses me off because i don't understand why he can't just say \"false\" -.-\nThe curve is really nice, which I did like about it. There are three exams, one of which is dropped. The final is fair, and I thought was relatively easy once you've taken all the other tests. \nWe definitely need more passionate and class-engaging chem. professors at Columbia. If you're taking this course, I recommend going with Parkin, everyone seems to enjoy him much better. \nWorkload:\n3 Exams (lowest dropped)\n1 Final\n10 Quizzes? (2 dropped)\nOptional Homework\n"
        },
        {
            "course_name": "General Chemistry 1401",
            "review_date": "December 21, 2011",
            "review_content": "\nPlease do not take this class, the lectures are absolutely pointless and he seems to not care at all about teaching gen chem. Get out of the class when you can. Do not think because you took AP chem or something to that extent this is an easy A, not at all. Everything, especially his tests, are highly conceptual and even though the tests are multiple choice, its paragraph multiple choice where you legit have to read it three times just to figure out what it's saying. The only perk in this class is that the average tends to be low, so beat the curve, do the practice exams and read the textbook, and read the textbook again. \nWorkload:\n3 midterms (one dropped) \n1 final \n7 quizes (two dropped)\n"
        },
        {
            "course_name": "General Chemistry 1401",
            "review_date": "January 27, 2010",
            "review_content": "\nI love professor Freisner and completely disagree with these negative reviews. He is 110% fair and approachable. He is always willing to help during office hours and the course is very interesting. It is not an easy class, but if you work hard there is absolutely no reason why you shouldn't do well. I would definitely recommend this class, professor Freisner is the cutest! Although it is tough material, any Gen Chem class will be just as demanding so you're better off doing it with Freisner. Freisner gives reviews before every exam and is pretty vocal about what he finds to be important (and will usually test on the things he points out).\nWorkload:\n3 very very fair midterms. If you study and memorize his slides you will probably get an A. One final, and recitation quizzes every week that help you keep up with the material. \n"
        },
        {
            "course_name": "General Chemistry 1401",
            "review_date": "January 12, 2010",
            "review_content": "\nI wasn't going to write a review until I saw the other very negative reviews on Professor Friesner. The class was very challenging in that you had to completely teach yourself the material from the textbook. The lectures themselves were really boring and simply consisted of watching him read the material on his slides back to us for an hour and a half. I wouldn't blame this so much on Friesner as on the class in general, as it seemed that people in other classes seemed to be having just as hard a time with their professors. Needless to say, the lectures are pretty useless. I didn't go to lectures very much at all after the first midterm and I ended up doing very well. If you are able to teach yourself (which shouldn't be hard because most of the material is very straightforward) then the class should be no problem at all. Friesner himself is very helpful if you go to office hours and he always has a review day the lecture before the test during which he essentially tells you everything that you need to study. If you study the review slides, do the homework (and actually attempt to understand it) and read the textbook then you'll do fine. \nI would definitely also recommend getting the solutions manual that comes with the textbook because when test time comes you're probably going to have to do a lot of practice problems to understand things, and if you have the solutions manual it saves you the time you would have had to spent going to TA office hours to get the answers.\nOverall, I would definitely recommend taking Friesner's class, it's very fair and he's very willing to help students understand the material. But keep in mind that no matter what GenChem class you take, you're going to have to work hard to get a good grade.\nWorkload:\noptional homework (I recommend doing it), 8 quizzes (2 dropped), 3 midterms (1 dropped), final\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 06, 2010",
            "review_content": "\nComing from an entire family of chem professors, I spent the winter break talking to them about my Gen Chem I experience. Apparently, it is VERY unusual for a senior professor to be teaching two sections of gen chem.  Gen chem is usually a subject that takes a lot of work and time to teach, is boring, and normally not fulfilling as many are uncaring freshman. That being said, the reason Friesner is teaching two sections of gen chem is probably because his research has tanked and he has nothing else to do with his time. This would explain why he was grumpy, impersonal, would not write his own lecture material, did not like teaching, etc. Bottom line: do NOT take his class...he was the worst of the 4 gen chem professors this semester. Avoid at all costs.\nHis TA's however, were generally helpful.\nWorkload:\n8 quizzes (drop 2)\n3 exams (drop 1)\nFinal\n"
        },
        {
            "course_name": "Chemistry I",
            "review_date": "January 04, 2010",
            "review_content": "\nI would highly recommend taking Professor Friesner's class. He is fair and approachable. If you attend class regularly, complete the homework and study from his lecture notes, you will be well prepared for his exams. He provides you with all the resources to do well. In fact, in disagreement with some of the other negative reviews, Professor Friesner makes it very clear that he wants his students to do well and to master the material. The first exam is extremely challenging, most likely because Professor Friesner's exams are far different from the average science exam. His questions are demanding, especially conceptually and qualitatively. His evaluations really do demonstrate whether or not you have mastered the material. If you are having trouble grasping concepts, I would highly suggest that you go to his office hours-they are very helpful.\nWorkload:\nExpected workload for General Chemistry\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 29, 2009",
            "review_content": "\nProfessor Friesner is a terribly ineffective teacher. The slides come straight out of the textbook and by the end of the semester nobody even bothers to go to the lectures.\nI had a serious problem with the tests in that they were hard to score well on. He uses \"Which one of these is not true?\" questions way too much for 25-multiple choice tests and you end up getting frustrated, even though you know about the material than what is reflected in your grade. You'll slap yourself for getting those questions wrong, but what can you do? The most effective thing to do, sadly, is to study yourself. Study with friends who have him and pay close attention to CourseWorks where review material is hiding- the TA's, collectively, are helpful. The review sessions are so-so, I recommend office hours if you don't get ONE particular topic rather than sitting through an hour of \"Water sticks to things, and itself!\" \nPick someone else.\nWorkload:\n-3 Midterms, one dropped.\n-10-12 quizzes, two dropped.\n-Homework, which I recommend you do. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 26, 2009",
            "review_content": "\nBeware. Dr. Friesner (DF) obviously hates teaching undergrads. Apparently he is an impressive researcher - overheard some students talking about how he is \"the sh*t\" but that does not apply to his teaching abilities. His \"lectures\" consisted of him reading off slides which he ripped right out of the textbook. Every 4 or 5 words in his lecture, he never fails to interject with his hacking cough. His pronunciation also leaves much to be desired - he managed to mutilate \"Schrodinger\" into \"Shroner.\"\nThe best part about DF was the way he told us to disregard the way the textbook broke the octet rule for lewis dot structures, since *according to his research*, hyperconjugation wth formal charges was a more accurate method. So if you are the type who wants to learn about cutting edge results from quantum chemistry research in an intro class, DF might be the one for you.\nI learned absolutely nothing from DF's lectures and was forced to learn the material on my own from the book and the TAs (Nicholas Anderson and Sy Redding were both extremely competent and helpful.)\nI'm not sure you could do better than DF in Columbia's chemistry department though. We had a professor who was teaching another section of 1403 (Valentini, I believe) substitute for DF once. He wasn't much better.\nWorkload:\n8 quizzes, drop the lowest 2.\n3 midterms, drop the lowest 1.\nFinal.\nPractice problems that are not graded.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 26, 2009",
            "review_content": "\n  Before I chose classes for the first time I did not think that the teacher I had would affect the type of education or grade I recieved because I had the belief that simple hard work and self reliance would be all I needed to do well.  This is NOT the case in Friesner's classes.  As many others before me have written, he seems genuinely disinterested in teaching and takes every opportunity to remind you that you are in gen. chem and thus will not go into as much detail as he would like.  That being said, he goes into extreme detail in his notes that do show up on the test, but it is not laid out in a clear enough fashion to completely comprehend.  His tests are extremely hard and wordy, which is shown in the average test grades of 17/25 for each test.  All of the slides he shows in class are read in an extremely monotonous voice verbatum with no explanation given.  People are allowed to ask questions, but more often than not after his garbled and jargon riddled answers you will end up more confused.  I had a great TA though who clarified a lot for me.  It is extremely important to read the text book and to stay on top of the material otherwise going to class will be even harder since you will not have any idea as to what is going on.  In Friesner's defence, he does have a review session before every test and goes over what will be covered.  Also, he did say the average grade in the class would be a B, so I guess if the whole class does poorly it is possible to do somewhat decently.\nWorkload:\nUngraded homework for each chapter (sometimes helpful, sometimes not), 3 midterms (1 dropped), 8 quizzes in chem rec. (2 get dropped, and the average of your quizzes is equal to a midterm) and a final worth 40% of your grade.\n"
        },
        {
            "course_name": "General Chemistry 1401",
            "review_date": "November 17, 2009",
            "review_content": "\nHorrible teacher.  He reads slides that he got from the company that wrote the textbook with a monotone voice with most of the lights out in the lecture room.  Basically, you end up falling asleep.  Some of the TAs are okay.  I had a good one but didn't learn enough from him to do well.  Studying on your own for this course is very helpful (the book is quite good) and if you do you should get a great grade.  Take Valentini, he is easier.  Nobody attends Friesner's class and those who do just browse the internet during class.  Friesner is not only an incompetent teacher he also seems to dislike teaching.\n\nWorkload:\nnot bad: ungraded homework that nobody does, 8 quizzes (in recitation) that help prepare you for the midterms, 3 ridiculous midterms that are hard to do well on even with multiple-choice, and a final.  You drop 2 quiz grades and a midterm.\n"
        },
        {
            "course_name": "Chemistry I",
            "review_date": "October 08, 2009",
            "review_content": "\nTake Parkins if you can. This guy just reads confusing slides that he probably got from the internet. He's useless. The slides are bad, as they try to digest everything into a few words to fit on the slide, which simply ends up being tough to understand. You might as well read the book by yourself. TAs, at least as I've learned from mine and from friends' are stupid. They don't really care about you and just quiz you.\nif this is an ivy league school, why cant they get good teachers? fuh, my high school teachers were better than the majority here\nWorkload:\n2 mid terms, 1 final, couple quizes in recitation, ungraded hw.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "October 03, 2009",
            "review_content": "\nFreisner is very unfriendly towards students. He is extremely rude in person and doesn't really care about his students.\nSome of the TAs are also extremely bad and they don't know what is going on as they never show up for lectures. The quizzes differ in their difficulty so choosing the right TA will give you a better grade in the class. The TAs also do not communicate with each other or the professor, so don't expect to ask them anything logistical about the class. You go to recitations to take the quiz and that's basically it. No time for anything else.\nJust because they're your TA doesn't mean they know more than you. Keep this in mind.\nLectures are completely useless. The book, however, is golden. \n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "September 28, 2009",
            "review_content": "\nHe sucks!!!  His powerpoints are straight off the text book and he doesn't really explain anything.  All questions are answered with \"you don't need to know that for the exam\" What if I want to know just because I'm actually interested in Chemistry beyond passing the exam?  If you have him, make sure you pick a good TA.\nWorkload:\nNot too bad\n"
        },
        {
            "course_name": "General Chemistry C1401-1402",
            "review_date": "September 24, 2009",
            "review_content": "\nFriesner is unfriendly towards students and clearly dislikes teaching and showing up to class everyday. If you end up taking this class I would recommend viewing his slides online, reading the book, and skipping the lectures. \nWorkload:\nUngraded homework, weekly quizzes, midterms and final. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 11, 2007",
            "review_content": "\nI highly recommend Friesner if you plan to go to class and read the textbook. If you do both these things seriously, there is no reason not to get an A. He puts his notes on the blackboard....copy these down WORD FOR WORD, because a couple questions on each test come from these notes. Some say that the only class you need to attend is right before the exam, where he gives a great overview of what he'll be testing. This is good enough to get a solid B (assuming you do the textbook problems). Going to every class gives you the A.\n \nWorkload:\nStandard gen-chem class, 3 midterms and a final, recit. quizzes\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 26, 2005",
            "review_content": "\nFriesner is a decent professor, definetly better than the other two. His classes are not the most exciting, but he tells you exactly what you have to know, especially the day before the test he has a \"review\" day where he basically puts an outline on the board of what is on the test, and basically every topic on the test is covered in his outline. (his tests are fairly easy, but you have to actually read the textbook once cause his notes don't always cover the topics completely). Overall, Friesner is a very fair professor and I would recommend his class. \nWorkload:\nThe class has three easy midterms an even easier final and 8 quizes(pick best 5). You can drop one of the midterms, the quizes, or half of the final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 23, 2005",
            "review_content": "\nI took this class to fulfill my CC science requirement (which was not the greatest idea in the first place). I learned more from my TA in section every week than I did from Friesner's lectures. Lectures were not very instructive nor engaging. The main thing I disliked about the course was that he made it pretty obvious that he did not want to be there, and even through e-mail, he was not very friendly. I did not attend his office hours, though, and that may have made a difference. He was, however, good with always taking the last lecture before a midterm to review basic concepts and go over what one needed to know for the test, which I found very valuable.\nWorkload:\nRead the textbook, 3 midterms (lowest grade dropped), 8 quizzes (5 count as a midterm grade), 1 hard final (counts as 2 midterm grades)\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 13, 2005",
            "review_content": "\nOverall not too bad.  I took the course to fulfill a requirement, and its mostly straight out of the book.  I went to most lectures where he put notes from the book on the board and did not look at the class when facing it.  He had office hours each week that may have been helpful if I went.  The recitations were helpful in understanding the hard concepts.  Overall this guy might be better than the others.\nWorkload:\n3 midterms, 8 quizzes (5 count as 1midterm), 1 final that counts as 2 midterms.  lowest midterm grade dropped.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 16, 2003",
            "review_content": "\nFriesner taught the portion of this course devoted to quantum mechanics. The material was rather interesting, but the presentation was frequently difficult to follow. I found that I had to make more frequent use of the textbook than in other comparable courses in order to follow the lectures. In reality, I probably could have done equally well if I had just read through the chapters in the text and showed up at the review session, at which he revealed about half of the test questions.\nWorkload:\nProblems in the book assigned but not checked. A good amount of textbook reading required to understand lectures and do well on exam.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "January 10, 2002",
            "review_content": "\nA little quirky but nice. don't bother going to class, he lectures straight out of the textbook and answers to the test problems come right from the book. if you read the textbook, you'll be in good shape. as for lectures, not really worth it.\n"
        }
    ]
}