{
    "prof_info": [
        {
            "prof_name": "Ronna Popkin",
            "prof_id": 13083,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "August 25, 2015",
            "review_content": "\nI had Ronna for UWriting, Gender Studies. It will be an \"eh\" experience if you're a good writer. If you're not the best writer and looking for a class to improve, this is not for you. She will probably make you feel kind of dumb and you will do poorly. She is more on the tough side of grading. She seemed to pick favorites, this was the only time when she showed personality. Overall a fairly monotone course ie why it will be an \"eh\" experience. \nSimply put - U writing is 100% what your professor makes of it, and she will not make anything great out of it and you will not improve as a writer. \nWorkload:\n\"standard\" workload - except our selected readings were super long\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "February 02, 2015",
            "review_content": "\nRonna was by far my favorite professor first semester. She's knowledgable, sweet, and just an overall good person and professor. She made everyone in the class feel comfortable and was able to facilitate group discussions really well. Her office hours are also really helpful, so be sure to go to them. She tries to make herself available as much as she can.\nShe grades fairly, and is very conscious about handing drafts back so that we have enough time for the final draft. My advice would be to treat every draft like the final draft, so that you don't have to cram writing a whole new essay in a week. \nThe readings she chose were really interesting too, more so than the other sections from what I could gather. They changed my views on a lot of different gender related topics. \nBottom line: if you're placed in Ronna's class, be thankful. If you take Uwriting second semester, then try and register for her class. You won't regret it!\nWorkload:\nThe workload is pretty standard. If you want an A, then make sure you visit the writing center and her office hours. She'll give A's on essays, but your ideas, essay structure, and writing should all be really solid. \n"
        }
    ]
}