{
    "prof_info": [
        {
            "prof_name": "Joshua Navon",
            "prof_id": 13066,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "July 21, 2015",
            "review_content": "\nIf you Have Josh you have won the Music Hum lottery. He is awesome. Josh not only taught us perfectly all the facts and information of any music humanities course but did so with amazingly in depth conversation and analysis that was largely discussion driven and student based. We discussed topics outside the traditional music hum syllabus such as the implications of including a specific piece or style in the syllabus and what exactly the \"great works\" are and how they came to be considered as such. He constantly challenged and made us consider our framework and vantage point in music hum and more broadly within the core, and Columbia in general. While we were learning the basics of music theory it also felt like we were having important and fascinating conversations about people,society, history, and our perception of them. All of my other friends found Music Hum to be fine and doable but altogether underwhelming -- my class turned out to be one of my favorite thus far. \nAssignments were extremely clear, his expectations and the information we needed to know were all given precisely. I had never had any prior experience in music, and he managed to both teach me all that I needed to know with ease while not boring some of the more experienced students. \nHe's also just funny and super cool. \n \nWorkload:\nOn the lighter side. Quizzes and small assignments throughout the semester, which he gives you lots of notice for, tells you what to expect, and gives you the materials to study it. Three papers, a final that was just a long quiz, and option for extra credit. No midterm. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2015",
            "review_content": "\nI had written a much longer and better review of Josh last semester, but somehow it got lost or maybe I just never hit submit. \nIn any case, Josh is the professor you want for Music Hum. He is very understanding that many of us have no musical experience, and that many of us could not care less about meter or instrumentation before taking this class. With that in mind, he tries to make Music Hum entertaining and engaging for everyone without placing too much stress on us as students. He is more than clear in explaining everything, and will tell you when he is not too sure about something. When you come out of Music Hum, if anything, you will likely have an appreciation or greater appreciation for classical and even non-classical music. \nEven though it was his first semester teaching, the readings were very appropriate and the assignments were incredibly reasonable. Seriously, for quizzes and even the final, he prepared a study guide for us! That’s how much he wants you to learn. That being said, if you're a super music whiz who has been playing the piano or violin for years, you might find him boring, as he will likely explain things you know or can already pick up on. However, Josh is also very good about asking you about more specific questions (musical key, technique, etc) and then he builds off that for the rest of the class. \nThere are unknown and known listenings, some listening assignments, the trip to the Met, essays, etc. like every Music Hum class. But all in all, if you’re looking for an engaging teacher who will make learning all this Music Hum stuff worth your time, Josh is the professor you want. \nIf you manage to get him as your prof, don’t switch out! He is so worth it. \nWorkload:\nReadings every or almost every class, not too bad\nSome listening assignments\nFour quizzes, which later became three quizzes, one of which was dropped\nA very reasonable final\nA concert report (5-6pgs, he will give feedback!)\nA second essay, which you can write on another concert, a comparison of two pieces or music in film. \nAll in all, a very reasonable workload. Not too much, but the assignments are helpful and readings are relevant. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 05, 2015",
            "review_content": "\nA fabulous teacher, I recommend him wholeheartedly. At first, I was a bit concerned since it was his first time teaching Music Humanities. But Josh is a very down to earth, yet passionate teacher, and is clearly interested in helping all of us learn to love Western art music. \nAlmost every class was interesting and engaging, and Josh always helped us better understand not only the music but the context of the music -- what sort of changes occurred both in society and in the music that make what we're studying worthwhile. He was also careful to clue us into controversies that surrounded the music, like the modern reactions to Wagner's antisemitism or contemporary reactions to Bach's Grosse Fuge. \nAll in all the class was enjoyable and a lot more than I expected from the first time teaching a course. I have been in some train wreck classes where the teacher was passionate, but disorganized to the point that it made the course unenjoyable. This was not one of them. The class was clearly organized and Josh was passionate about the material. \nThere were some kinks or complaints -- but I expect that they will be worked out for next semester. The main complaint I have was is that the syllabus had no schedule for readings or listening assignments, and instead they were given to us two or three days in advance by email. Josh later admitted that he was planning the course as he went, so kudos to him for consistently selecting good readings that helped us ground the music we listen to. Hopefully he will keep most of the material and give a reading schedule for the coming semesters. \nAs far as workload, typically there were two or three readings for class, given to us in a PDF format. The book that is usually assigned for Music Hum was not necessary. There were about four or five listening assignments, two essays, three quizzes and a final. All very straightforward. Josh is clear in what he wants you to know and will go the extra step to make it as easy as possible for you to succeed, even going so far as to make study guides for us! \nIn all, he really, really wants you to succeed in music hum. His class was always a joy and I always looked forward to it. Josh is the teacher to get for music hum, if at all possible. If you have his section, don't give it up! Even if the time is at 8:40. \nWorkload:\n- About five listening assignments. Originally meant to be weekly, though it was scaled down. Took about thirty minutes to an hour.  Usually they are very guided, so if you've never done one before, no worries. 20% of the grade. \n- Three short quizzes. Originally meant to be four, but one was pushed back and eventually cancelled. Each one took about forty-five minutes, if only because the listening portions were a bit long. Each one typically had three known and three unknown listenings, along with multiple choice and a short answer question. He gives us possible known listenings in advance, as well as what the multiple choice questions will cover (typically they were simple definitions). He makes us study guides! What other teacher does that? 20% of the grade. \n- Concert Essay and Second Essay. Each one is about five pages. The concert essay you go to the Music Hum Opera (ours was Carmen) and make an argument (any argument) about the opera (or opera more generally). He values originality but he also doesn't mind if your argument is not completely original. The second essay you got to pick between a second concert report, a comparison of two recordings of a piece of music, or a music in film paper. He offered to read over our first draft of the concert essay via email and then gave us comments. Each one is 15% of the grade. \n- Final exam. Basically a long quiz. There were six known listenings, six unknown listenings, two short answer, one short essay, and some matching questions (definition + word). He also gives a very detailed study guide for this! I am telling you, you can't go wrong with Josh. 15% of the grade. \n- Attendance and participation. You're allowed one unexcused absence. Participation is either in small groups or sharing your thoughts on the reading. 15% of the grade. \n"
        }
    ]
}