{
    "prof_info": [
        {
            "prof_name": "Leon Gold",
            "prof_id": 3375,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Human Factors",
            "review_date": "December 03, 2013",
            "review_content": "\nThis professor is absolutely crazy. One second he will go on a rant about how people are clearly not paying attention to him, and literally the next second, he will thank us for putting in such hard work. Talk about mixed signals. People have described him as funny, but in actuality, if you listen to the content of what he's saying, he's pretty offensive. Add that to his bipolar ranting, and you've got one terrifying professor.\nIn terms of work, it's not so bad. It's a lot of work, but not difficult by any means. The issue is that Leon is not clear with his objectives, so many times, you find yourself doing an in-depth assignment with no direction. As long as Leon can see that you've made an effort, you'll be fine though.\nI'd say, all in all, the class is an easy A, but it's not worth enduring the craziness.\nWorkload:\nChapter summaries, take-home final, one annotated bibliography, a bunch of small group projects.\n"
        },
        {
            "course_name": "Human Factors",
            "review_date": "June 06, 2012",
            "review_content": "\nIn all seriousness, Leon's class was very enjoyable and relaxed compared to many of other IEOR classes. \nLeon tells you up front how much work you have. It is not alot. It is just do your own work of writing chapter summaries and doing weekly presentations. If you did all your work and talk to him in class, you will have a good experience. The work isn't that hard, it is just time consuming.\nThere is no midterm, no final, and no fancy math involved. Simple as that. People who got bad grades deserved it because they didn't do their work. If you didn't turn in your homework in any other class, you would get a 0. But Leon will give you an extension and ask you to turn it in ASAP. Only after being reminded 5-6 times that you didn't do your work does your grade drop. \nNo Midterm, No weekly math related problem sets, No final, and you already know your grade - how much more can you ask?\nfinally, leon is a nice guy and is pretty chill. \nWorkload:\nAs long as you do the simple work, you will be very happy with your grade. And by happy, i mean nothing less than an A.\n"
        },
        {
            "course_name": "Human Factors",
            "review_date": "December 23, 2010",
            "review_content": "\nHe is not as funny as the other reviews make him out to be. He is also becoming stricter as time goes by and presents the class with a fair amount of work.The reason that this class is often mis- led into being an 'easy' class is because it does not involve math. However, if you are not willing to write a great research paper at the end, you will not get your 'easy' A. That being said, this is definitely an easy class and the professor is actually competant in his area and is able to teach the class well. He is also very approachable and a super nice guy. So if you're interested in human factors, you can't go wrong taking Leons class. \nWorkload:\nFair. Grading Fair.Very nice guy. Not necessarily funny \n"
        },
        {
            "course_name": "Human Factors",
            "review_date": "January 20, 2010",
            "review_content": "\nThis was a great class, with barely any work and a comedic professor who may or may not have insulted pretty much everyone in the class. If you are actually interested in the material, then he actually does know a lot about human factors. If not, just sit quietly in class, listen to the lectures and do the chapter summaries and you are guaranteed a good grade in the class. A large part of the course is devoted to group work, so make sure you sign up for the class with some people you know and work with them in the group. The project was easy, and really didn't take too much work, as long as you had a good idea. There is a research paper where you just have to pick a topic in human factors and write about it. There was also a final paper, but both of these were not too bad at all, as this was almost all the work for the whole class.Overall, a good class to take for an elective, and I would highly recommend it. Easy class\nWorkload:\nBarely anything. 2 sets of chapter summaries which are a pain, but not bad if you start early. No midterm, instead we had a research paper and a final paper, along with a group presentation which you could finish in one weekend. Very light.\n"
        },
        {
            "course_name": "Human Factors",
            "review_date": "January 01, 2010",
            "review_content": "\nOne of the best professors in the IEOR department. His one class is worth at least a late night comedy show--he will have you in splits. His sense of humor is amazing, and every second utterance out of his mouth is a joke, some self-deprecating, some sexual.\nHe doesn't take himself or the class too seriously, which is a good thing. But don't be fooled--he knows his stuff very well and has worked for some big-names companies in the field of human factors.\nThe class consists of a bunch of slides every week, where he also gives a bunch of real-world examples.\nIf he likes you and you do the required work, you won't be disappointed with the grade.\nWorkload:\n1 take-home midterm, 1 final paper, bunch of group projects (including one big one at the end). Nothing too intense.\n"
        },
        {
            "course_name": "Human Factors",
            "review_date": "January 17, 2008",
            "review_content": "\nHe seems very bitter about things in his life, so the class is spent with him ranting and raving, never really having anything to do with the subject at hand.  If you go to class willing to laugh at him it is a very enjoyable 2.5 hours, otherwise you will hate it.  Either way bring your laptop because you will need to distract yourself.  No notes are required.\nWorkload:\nGroup project, midterm paper and final paper.  The project has to do with the textbook, so buy it, but you do not have to read it until the project.  Two paper are on whatever you want them to be.  Very easy A (he tells you that the first day of class).\n"
        }
    ]
}