{
    "prof_info": [
        {
            "prof_name": "Sumati Gupta",
            "prof_id": 12542,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 25, 2017",
            "review_content": "\nI love Prof. Gupta - she is inspiring as a person and therapist as well as being a great teacher. she's very straightforward and clear whilst also being thorough and engaging. Her teaching style is very clean and structured which suited me really well - if you're looking for someone more philosophical and tangential, look elsewhere. Her course material is extremely interesting and she brings a lot of her personal experience with patients and anecdotal examples to help explain concepts better. \n10/10 would recommend - she's brilliant. \nWorkload:\n2 midterms, final all noncumulative and one 8 pg paper \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 20, 2017",
            "review_content": "\nProfessor Sumati Gupta is an exceptional professor. She clearly does other things besides teach this course, and so manages her time exceptionally well. \nShe has power point slides for each lecture that give the basic subheadings that we need to know, and it is our duty to go to class and pay attention to what she says and take down notes.\nHer intention is for us to learn and absorb what she teaches, and most definitely not to trick us. \nIf she confuses you and herself in the process of explaining a concept, she will make sure to not include it in the exam and let you know of her decision so you don't waste time studying it. \nIn her exam review sessions, she will make whats going to be tested very clear- giving you a break up of how much each chapter constitutes the exam. \nOverall- A great class, she never took attendance but something about her and her teaching made you want to go each time, a guaranteed A if you study exactly what she asks you to study and a class I would definitely recommend! \n\nWorkload:\n3 multiple choice non-cumulative exams \nAn optional 5 page paper on the DSM V - If you choose to do this, the exams will weigh less in the calculation of your final grade\n\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 19, 2017",
            "review_content": "\nTAKE THIS CLASS (And any class with Professor Gupta)! Professor Gupta is an amazing teacher, presenting the course information in a clear and engaging way. She often supplements her lectures with real life examples that she has gathered from her patients in her practice in Tribeca. Professor Gupta is extremely clear in the expectations of the course and is understanding of her students. Her exams are thorough, can be tricky, but extremely fair. If you pay attention in class and do the textbook reading, you can excel in the course. \nOne of the best qualities that Professor Gupta possesses is the way in which she makes herself accessible to students. She is always willing to help in office hours or out of class and responds to emails almost immediately. She will help a student understand material that may be confusing or just advise on the psychological field in general. Though she must certainly extremely busy with teaching and her clinical work, she puts her students as priority. \nIf you are interested in psychology, want to fulfill a requirement, or just looking for a good class, Abnormal with Professor Gupta is the way to go. \nWorkload:\n3 multiple choice exams with 50 questions (non-cumulative), 1 optional 5 page paper for extra credit\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 18, 2017",
            "review_content": "\nOne of my favorite classes at Columbia. Prof Gupta is also a psychologist in Tribeca and brings a lot of her practice into the way she teaches. She's extremely clear and reasonable; she is always open to hearing students suggest the best ways of assessment. Gupta provides extra credit too! I really appreciated how at the end of the semester she thanked the class itself, emphasizing how we help her fulfill her career in a way her practice does not. She's just hella cool and calm, and I loved her teaching style (incorporating videos, stories, etc to explain disorders). \nWorkload:\n3 exams, non-cumulative. + 2 opportunities to get your shit together: 1 essay to replace a test grade if needed and an extra credit paper \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 18, 2017",
            "review_content": "\nOne of my favorite classes at Columbia. Prof Gupta is also a psychologist in Tribeca and brings a lot of her practice into the way she teaches. She's extremely clear and reasonable; she is always open to hearing students suggest the best ways of assessment. Gupta provides extra credit too! I really appreciated how at the end of the semester she thanked the class itself, emphasizing how we help her fulfill her career in a way her practice does not. She's just hella cool and calm, and I loved her teaching style (incorporating videos, stories, etc to explain disorders). \nWorkload:\n3 exams, non-cumulative. + 2 opportunities to get your shit together: 1 essay to replace a test grade if needed and an extra credit paper \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "June 09, 2014",
            "review_content": "\nProfessor Gupta is fantastic. She is not only passionate about the material she teaches, but also passionate about making sure she presents the material in an accessible and clear way. She is a part-time professor - she spends the rest of her time in private practice, meaning that she really understands what she is teaching about because she sees it firsthand. She is extremely considerate regarding her tests- they can be tricky but she does not want to trip you up. If there is a question that most of the class missed on an exam, she will most likely give everyone in the class credit for it because she feels that she didn't teach the material or ask the question in a clear enough way. She's also really great to talk to out of class! \nWorkload:\n3 exams, optional 5-page paper, option 5-page paper for extra credit\n"
        },
        {
            "course_name": "Intro to Clinical",
            "review_date": "December 17, 2012",
            "review_content": "\nYou can definitely tell that she is a new professor, but she tries really really hard. She is a super nice woman, who really cares about her students. Her class was a little bit surface oriented at times, but got way better as the semester went on. Overall, a great addition to the Barnard psychology department. She is a great resource when it comes to questions about clinical psychology. She is just caring in general and it was a pleasure going to her class everyday.\nWorkload:\n3 tests, 1 paper, and a few quizzes/posts to boost your grade\n"
        }
    ]
}