{
    "prof_info": [
        {
            "prof_name": "Stacey McMath",
            "prof_id": 6398,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "New York Theatre",
            "review_date": "March 10, 2015",
            "review_content": "\nThis was an incredibly fun course for a student who didn't know much about theatre. Seeing a show every week was amazing, and it really opened my eyes to amazing theatre off-Broadway. The shows were all very different and while not completely traditional, I didn't think that they were overly avant-garde (but I don't have too much knowledge about what counts as avant-garde theatre). I was very impressed by the line up of the shows we saw - we went to The Public, BAM, Soho Rep, Theatre for a New Audience, and many more. Many times the show we saw would have a front-page rave review in the NYTimes Arts section the next day. For someone who wants to experience the NYC theatre scene it was amazing.You also only have one class a week so it's relatively low stress. One note - a lot of the class time focuses on how the theatre works and how the business works as a whole. I found this really interesting but if you don't care about how they run a theatre or put on a show then McMath's class may not be your favorite. \nEach week you write a response paper (about two pages) for the previous weeks show. My problem with this was that we NEVER got grades on them, just a check and maybe a comment or two about what you could improve. There were also no guidelines for these papers. I literally had no idea what my grade in the class would be until I got it. In addition we had two research papers at midterm/final time that were very easy - each had to be ten pages but there was a checklist of topics to cover that easily got you there if you were willing to look up all of the info. There were readings each week but you could get through the entirety of the semester without really reading at all - we would occasionally discuss them in class for a few minutes but thats it, more often we focused on the general topic of the readings so if you had skimmed a bit to get the gist you were completely fine!\nWorkload:\nLong readings every week but they really aren't necessary - you could get through class discussion if you had simply skimmed the first and last few pages. Oftentimes I didn't read at all and I did perfectly well in the class. \nOne response paper a week (2 pages)\nTwo research papers (10+ pages) but on pretty easy topics to write about - low stress for sure. \n\n"
        },
        {
            "course_name": "New York Theater",
            "review_date": "March 31, 2010",
            "review_content": "\nEither the last reviewer strongly hated McMath's class from the beginning and everything was colored by that hatred, or McMath significantly altered the class this term.  Either way, here my side of the story:\nMcMath does really like the avant-garde, and she does explore it in slightly more depth than other things.  After all, she is the producing director of an avant-garde theater company (Gertrude Stein as idol).  That said, so far we have only seen one avant-garde production--and it wasn't even as strange as I was expecting it to be.  Mostly we have seen off-Broadway productions.  It's also important to recognize that the productions change from year to year with funding, availability, ticket prices, etc.\nThere is a lot of reading.  However, the only time we had to read a book in its entirety that had to be bought at the bookstore was 500 pages, divided between two weeks.  The 400-page-book-per-week idea is absurd; maybe that happened last time this class was offered, but I doubt you would ever face that now.  Additionally, the reading IS, in fact, important: the midterm expects you to understand all the concepts from all the readings as well as important years, figures, names, trends...Do the reading, even if you just skim it once in a while (some of it is quite dry).  Some of what's important in the reading is discussed in class, but it's not a guarantee, and you may not be able to take notes fast enough to catch it all; basically, do the reading and your grade will thank you for it.\nMcMath does not critique the response papers like an English professor, per se.  I doubt that grammar or syntax or a five-paragraph structure or anything like that matters much to her (if McMath was to grade me for this review she wouldn't take into account this run-on sentence).  If she sees truth in the ideas you put forth and you occasionally use what you learn in class in the papers, you will get a good grade; if you don't, you won't.\nMcMath does spend a lot of time discussing the economics of NY Theater.  If you want an art-requirement-fulfilling art class that is more focused on admiring or making art rather than analyzing its connections to other areas, this may not be the best class for you.  Personally, the economic side of theater was very interesting to me and studying it helped me grasp larger trends in theater I would not have otherwise fully comprehended.\nThere's one more thing to take into consideration as well that was not mentioned in the previous review.  The class itself, in its basic design--lecture followed by performance somewhere in NYC--allows for a great amount of communication between students, and can even act as a way to easily make new friends.  Think about it: you spend an hour on the subway getting to midtown or downtown to see something you've never heard of, all the while sharing the same feelings of hunger (no time to eat after lecture), then you spend more time after the production together, eating, chatting about the production, exploring the Village at 11:00 at night...In a way, the class is worth taking just because of its structure.\nWorkload:\nOften pretty heavy--at least in the opinion of a first-year student.  100-250 (rarely more) pages of reading per week, a 2-page response paper for every performance seen, a pretty challenging midterm, and a 10-page research paper.\n"
        },
        {
            "course_name": "New York Theater",
            "review_date": "May 28, 2009",
            "review_content": "\nDo not take this course! She is terrible! The idea of a class called NY Theater is wonderful, and I am sure that the other teacher's do a wonderful job teaching this course.... just not McMath! She focuses on all of the most boring topics of theater, spending class after class listing every person who works in the theater, how much their salary is, the economics behind the theater business.  It is interesting to learn that it takes a lot for a production to be profitable, but when she spends the entire semester reiterating the same point with too much detail, it is boring, pointless, and beyond a waste of our time.  My guess is that no one is taking this course to become a theater manager (which is what her passion is, so duh, of course she is constantly spending her time on it), and that mostly everyone is taking it for personal enjoyment.  With a topic as broad as NY Theater, it is so sad that she wastes the entire semester not covering an ounce of interesting theater information.\nShe is also full of herself.  She believes that she is an English teacher, and corrects the weekly 2 page reviews with such incorrect scrutiny that it is pathetic. If she actually knew what she was talking about, I wouldn't have a problem... but the fact is that she doesn't, it is frustrating.  How do you tell your teacher week after week that she is wrong? You just can't, it's not polite.  Besides that, she assigned a book a week as our reading, and these books were on average over 400 pages.  It was my mistake for immediately going out and purchasing over $150 worth of the required reading material, which then she never even discussed in class. Basically, don't even bother buying the books in the first place, the reading does not matter and is entirely a waste of your money and time if you try to read it.\nFinally, out of all the genres in theater that are available, McMath loves to teach and see what she wants, not what is beneficial for the class... so we ended up primarily seeing avant-garde theater.  Going to see this type of play is definitely interesting and worthwhile, but should not be the focus of the class. NY is full of all different types of theater, and has world renowned musicals, yet we did not venture deeply into any other genre. The very last play that we saw was in a public school, with seats for around 20 people, and only filled with our class, and yes, this was avant-garde theater as well, and absolute torture.  \nJust heed my advice... if you are thinking about taking NY Theater because it sounds interesting and fun, do take it, just do NOT take it with McMath.  She's a bust of a teacher.\n\nWorkload:\nNot bad, but she is an overly strict grader considering that this is just a theater class that most people are using to fulfill an arts requirement or for personal enjoyment.  Weekly 2 page responses on the production you saw, a midterm 10 minute presentation, and a final 15 page paper on the topic of your choice.\n"
        }
    ]
}