{
    "prof_info": [
        {
            "prof_name": "Nicole Cuenot",
            "prof_id": 3091,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 20, 2008",
            "review_content": "\nI took this class the previous year, and I must admit that I actually enjoyed going to class and learn about art. I knew absolutely nothing when I enrolled in the class but came away with a good sense of how to analyze art after the semester was over. The core has its share of bad professors, but Prof. Cuenot definitely is not one of them. She created a relaxed environment in which most of the students participated in the discussion unlike other core classes that I have been in. As a side note, she is also easy on the eyes. Highly recommended!\nWorkload:\n3 papers on works of art and a final. She grades very leniently. Take her class!\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 11, 2007",
            "review_content": "\nWonderful.  Truly a great teacher.  This is one of the few classes that I've been in where EVERYONE in the class participated willingly, and where the professor not only lead the discussion well, but managed to teach us a huge amount while letting us explore themes and ideas as a class.  I knew nothing about art coming into the class, and now feel like I can walk into a museum and talk intelligently.  If you get Nicole for Art Hum, consider yourself VERY lucky.\nWorkload:\nMinimal; a few short papers, midterm, and final.  Engage in the classroom and you're fine for the papers; skimming the readings is recommended for exams.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 22, 2006",
            "review_content": "\nPeople (many people) have told me that Art Hum was a terrible class, so I was expecting it to be awful, but it wasn't at all. Ms. Cuenot is very friendly and very approachable, and also has a very strong background in art history. The class is a series of structured discussions, which she generally managed to lead in a productive direction. Of course, the fact that it is a sub-intro-level pseudo-art history class meant that some of the discussions were a little repetetive, but that is a problem of the cirriculum more than the teacher. Much more emphasis on looking at the work and seeing what there is to be seen than on historical minutiae. If you already have some sense of how to talk about art, the class is a breeze. Highly recommended (given that you have to take it with someone).\nWorkload:\nLight. 3 three page papers on objects from the met. Daily readings, but they are largely unnecessary - you're supposed to cite them on the tests, but it's a tiny fraction of the grade. The two tests both consisted of writing for about 5-10 minutes each about a bunch of slides - no dates required.\n"
        }
    ]
}