{
    "prof_info": [
        {
            "prof_name": "Natalie Humphrey",
            "prof_id": 9868,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Abnormal Psychology",
            "review_date": "April 29, 2012",
            "review_content": "\nDon't do it.\nJust say no.\nEasily the worst class I have taken at Barnard or Columbia.\nYes, the material is interesting (even though if you've taken Intro you'll probably know most of it already).  But she herself is infuriatingly unreasonable.  It's like she's overcompensating for being young and relatively inexperienced--she takes everything way too seriously.  This opinion was echoed by others I know who've taken the class.\nDisclaimer: I did receive a B- in this course so maybe you should take what I'm saying with a grain of salt.  It isn't because I didn't know the material though--I got a 98 on the final.  I just got an awful grade on the paper and literally have no idea why.  I've written bad papers before, but that wasn't one of them.\nWorkload:\nfew tests and a paper for which there are actually zero useful guidelines\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 19, 2010",
            "review_content": "\nThis is by far the most incompetent professor I've had in my college career. Humphrey misgraded every single test in the course and blamed the scan-tron when in reality she does not even provide the correct answers for her own questions. Not to mention the fact that the answer keys for her exams were also always incorrect. She is hostile and unresponsive to student emails and questions, refuses to tell the class how to prepare for exams and keeps changing exam dates even right before the exam is supposed to happen. Also, she came very late on every exam date and does not seem to care. Honestly, Humphrey is not fit to teach at any college or at any level. She gets defensive if you question her and will never admit she made a mistake. This course is a waste of time unless you want to be constantly frustrated. Take Abnormal with Monk at Columbia instead.   \nWorkload:\na ton given that you have no clue what to focus on for the exams. 2 tests, 1 cumulative final and a case conceptualization paper (8-10 pages) with virtually no guidelines. \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 18, 2010",
            "review_content": "\nThis is the best psych class I've taken so far at Barnard! Professor Humphrey is an amazing professor! Her lectures are dynamic, and they cover some of the information from the textbook, but they also add to the text. She includes videos, and interesting case studies from her experiences working as a clinical psychologist at Harlem Hospital. She knows about the material, and is able to answer questions that go beyond what you have to know. The class covered 17 chapters, which is a lot, and the exams are not easy, but she offers extra credit opportunities. This semester, the extra credit assignment was to write a two page paper and present to the class on a journal article--for 5% added to the final grade! There was an also an optional lecture and if you attended it she added 2% to the final grade. If you're interested in the subject, or if you're a psych major, I would definitely recommend this class. It's at 5:40, which is annoying, but that's because she works at Harlem Hospital during the day, and her experiences there are a really positive contribution to the lectures! She also allows for discussion, in a class of 80, which is really interesting. \nWorkload:\n2 midterms (50 multiple choice, one essay)\n1 8-10 page paper on a movie character\n1 final (80 multiple choice, one essay) \n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 21, 2010",
            "review_content": "\nThis class was far too easy. Professor Humphrey is exceptionally nice and I greatly enjoyed hearing her recount personal stories from working in Harlem Hospital (although I highly doubt they are typical of your average psychologist/psychiatrist). However, there was little to nothing that I took away from this class that I hadn't known previously. And the only other class I've taken that covered abnormal psych was in high school. AP Psych.\nThe book is weak and very redundant. Our use of the DSM was very superficial. I wish she would've covered more in depth into the neuropsychology of things. This class was easier than high school.\nWorkload:\nVery light, can read the textbook a couple days before test and still get an A.\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "January 03, 2010",
            "review_content": "\nI actually really enjoyed this class.  Prof. Humphrey clearly doesn't have much classroom experience, but she tried really hard to keep the class interesting and unique.  Though her Powerpoints were from the textbook, she livened them up with different role play exercises, surveys, interactive exercises and numerous examples from her own work at Harlem Hospital.  All of these psych survey courses use Powerpoints straight from the textbook; luckily this Abnormal textbook was good, and Prof. Humphrey added other activities and discussions to make it more interesting.  The midterm and final covered a lot of material, but she basically would tell you what you needed to study and what you didn't, so it wasn't too bad.  For the case conceptualization paper, we had to analyze a character in any movie of our choosing which was really interesting; got to watch a movie and diagnose someone with a disorder...it wasn't hard and was actually cool to write.  Totally different than just writing some boring research paper on a disorder.  Plus, you could earn 7 points of extra credit by reading two articles and giving a 5 min presentation on them--she added the 7 points to the paper grade.  Best extra credit opportunity in any class I've been in, I can't believe everyone didn't taken advantage of it.\nShe does take attendance and wasn't the most approachable professor I've had, but she was always available to answer questions and managed to make this class way more unique than other psych classes I've taken (which is a lot, as I'm a major).  The only big problem I found in this class was the annoying people who felt the need to add their comments to everything--\"my neighbor had such and such a disorder, I didn't actually know him but it was really stressful for me blah blah,\" \"my best friend has this disorder, well maybe not exactly this disorder but something like it, it's so hard for me blah blah.\"  She did a decent job at cutting people off when they weren't contributing anything substantial, thankfully.\nWorkload:\nMidterm, Final, Case conceptualization paper.\nCovered a ton of material, but it's pretty clear what you need to know and what you don't.\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 18, 2009",
            "review_content": "\nThis teacher makes Abnormal Psych. so BORING and DENSE. Going to class is a waste of time, her Powerpoints are straight from the book and all she does is read them out loud. \nAlthough there was only one midterm it consisted of basically memorizing half the book (TOO MUCH). Professor Humphrey isn't meant to be in a class room, she tries too hard to be a stereotypical teacher and is strict with essay extensions and extra credit assignments. \nShe takes attendance at every class which is ridiculous and expects students at this level to be able to fully diagnose and recommend treatment for a movie character. Her grading is harsh and the exams are overwhelming unless you are great at cramming or have photographic memory.\nHer review sessions (if any) are quick, random and useless\nThe content of the class is So interesting it really is too bad that Humphrey was given the chance to teach it.\nWorkload:\n1 midterm (11 chapters worth of disorders!!)\n1 pretty difficult essay about 5-15 pgs...\n1 final \n\n"
        },
        {
            "course_name": "Abnormal Psychology",
            "review_date": "December 10, 2009",
            "review_content": "\nThis was not a bad class, but if you're a Psych major I would probably go with Professor Monk at Columbia if you can. Here's why...\nProfessor Humphrey is a fairly young professor who I suspect doesn't have a lot of classroom experience. Though she knows her stuff up to a point, there were certain sections she was a little shaky on, and this was probably the first time she's taught this course. Of course this is a survey class, so no professor is ever going to be expert in every area covered, but a more experienced professor would have been more comfortable with more of the material. The lectures (and Powerpoints) were mostly taken straight from the textbook. So rather than augmenting the material from class, the text was the primary source for all the material. It seemed like a bit of a short-cut. I suspect Dr. Humphrey is a great clinician, but maybe less suited to lecturing.\nI should note that there was a lot of classroom discussion, which is good up to a point. The problem is, when most of the class has very little coursework in this field and probably no clinical experience, these conversations get bogged down in people's personal experiences of the guy next door who had schizophrenia. It didn't help me learn more about psychopathology. It would have been great if we had stayed more focused on what the literature has to say and less on people's personal opinions. That said, some people like a lot of discussion in class, but if you're there because you're planning a career in the field, you might feel like you could have learned a lot more in the semester. If you fall in the latter category you would probably find Dr. Monk's class more to the point and empirically driven.\nThe coursework is quite manageable. There is one short paper in which you write a diagnosis for a movie character. The exams were multiple choice with a short essay (choice of three topics). Study from the textbook. All the questions were taken straight from the the book's teaching companion. Attendance was compulsory and roll was taken at every class.\nWorkload:\nModerate...\n1 Midterm\n1 Final\n1 Case conceptualization paper\nClass participation was worth 10% of the final grade\n"
        }
    ]
}