{
    "prof_info": [
        {
            "prof_name": "Meredith Benjamin",
            "prof_id": 13301,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Writing: Women and Culture ",
            "review_date": "November 14, 2018",
            "review_content": "\nI think she is super nice and sweet but as a teacher she's pretty tough and ambiguous. She favors students and makes it difficult for the rest of us to understand what she's talking about. Her favorite advice on essays are these three words, \"be more specific\" but she doesn't really go into that we need to do unless you ask. If you happen to take her class go to lots of office hours and ask many questions in class and you'll be alright. I was just disappointed because as much as I try and I show how dedicated I am I was unable to get an A, which I did get for my other writing heavy classes. The readings are great. \nWorkload:\nEvery day a little assignment due on Courseworks\nThere are 3 papers, the last one a research paper\nExtra credit offered when you go to a seminar or lecture outside of class and write a response to it. \nFairly medium workload. \n"
        },
        {
            "course_name": "First-Year Writing: Women & Culture",
            "review_date": "November 07, 2018",
            "review_content": "\nDO NOT TAKE THIS CLASS! I repeat, DO NOT TAKE THIS CLASS!  This class is a GPA bomber and I do not say this lightly. I repeat again, DO NOT TAKE THIS CLASS.\nProf. Benjamin is really nice and very welcoming during her office hours, however, after closely working with her on my first and second essays, she still gave me horrifying (GPA 2.7) grades on both. The daily readings are engaging and totally doable, but she often plays favoritism on certain students. I talked to one of her former students who I think is very bright, and according to her, the same happens to her class and she ended up with a B- as her final grade. I don't and probably will never understand the scale she grades students on, and when I asked if she could let me know what's wrong with my revised essay, she responded she simply couldn't read the whole thing. \nJust to remain non-judgemental to this post, I do want to let you guys know that I constantly ask myself the question, \"Is it truly my fault that I bombed (really bombed... C+ level bombed) after spending over 30 hours on an essay, visiting the Barnard Writing Center, and asking my friends to proof-read it?\" and \"Am I really judging this class and her?\" I don't think so.\nSome advice: if you want to rock your first year GPA and actually learn something from the First-Year Writing class, I recommend Prof. Wendy Schor-Haim and Prof. Cecelia Lie-Spahn in the sense that they actually teach and do let you know what's going on with your draft. My Women & Culture first-year writing class is a joke, and my writing level has definitely not improved. \nDisclaimer: I do like the atmosphere of my class, and the girls in it. We really bonded and had fun. In retrospective, I'm glad I had the honor to get to know them. Seriously gals don't go choose her normal writing class (mine was the 4-credit workshop class where we have to meet on Fridays) because essentially it is the same. \nWorkload:\nNot too bad.\n3 essays. First one is on Hymn to Demeter (4-5 page). Second one is a lens essay (4-5 page). Third one is either on the Bluest Eye by Theresa Hak Kyung Cha, Toni Morrison or other scholars (6-8 page research paper). \nShort writing assignments which I actually like\nConference with her on every essay\nGoing to this class on Fridays\n"
        },
        {
            "course_name": "First Year Writing: Women and Culture ",
            "review_date": "January 03, 2018",
            "review_content": "\nI took this class as my first college writing class and it was an AWFUL experience. Professor Benjamin not only makes you feel like you can't write but you feel like you are thrown out on your own with no helpful comments from her in the essay writing process. Throughout the whole semester, I was given the same grade and same comments suggesting nothing had improved in my writing. As someone who came from a writing intensive school college prep school, it was hard to understand how my writing could receive such low grades. Her class itself feels repetitive and can often drag during awkward silences. As a professor, Prof Benjamin can often seem condescending and establishes authority by dismissing comments she finds not intelligent. Her favorites in class are evident and she does not try to help those who may not see the text as clearly. As a freshman, this class honestly ruined my first semester of college in terms of my confidence and mental health. I do NOT recommend this class. \nWorkload:\nHEAVY! Do all readings and responses before class. Two analytical essays on the text. A 10 page research paper at the end \n"
        },
        {
            "course_name": "First Year Writing: Women and Culture ",
            "review_date": "January 03, 2018",
            "review_content": "\nI took this class as my first college writing class and it was an AWFUL experience. Professor Benjamin not only makes you feel like you can't write but you feel like you are thrown out on your own with no helpful comments from her in the essay writing process. Throughout the whole semester, I was given the same grade and same comments suggesting nothing had improved in my writing. As someone who came from a writing intensive school college prep school, it was hard to understand how my writing could receive such low grades. Her class itself feels repetitive and can often drag during awkward silences. As a professor, Prof Benjamin can often seem condescending and establishes authority by dismissing comments she finds not intelligent. Her favorites in class are evident and she does not try to help those who may not see the text as clearly. After spending three weeks writing drafts for research papers, students were asked to completely rewrite with only a week remaining before submission.  As a freshman, this class honestly ruined my first semester of college in terms of my confidence and mental health. I do NOT recommend this class. \nWorkload:\nHeavy! Reading and responses every class. Two analytical essays on the text followed by a 10-page research paper on a topic of your choice. Meeting with her can sometimes help but her comments/feedback are not super helpful. \n"
        },
        {
            "course_name": ": FY WRITING: WOMEN & CULTURE FALL 2016",
            "review_date": "December 08, 2016",
            "review_content": "\nThe class and readings are interesting. She is very helpful if you are having any problems and gives good feedback. She appreciates if you meet with her and show that you care.\nWorkload:\nThere are weekly assignments but they are very short (no more than 20 pages) with a written response. There are two essays and then a research paper.\n"
        }
    ]
}