{
    "prof_info": [
        {
            "prof_name": "Grigsby Julia",
            "prof_id": 3263,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus IV",
            "review_date": "August 04, 2009",
            "review_content": "\nGrigsby is an amazing person and professor. She had such a refreshing personality and interest in the subject that made you really want to learn the material. She was incredibly approachable during office hours as well. (She is also young and female - how common is that in a math professor?)\nYes, the class did have weekly quizzes that mirrored the homework problems due the week, but I found the quizzes to be more helpful than bothersome. I reviewed the material every Sunday night before the Monday morning quizzes, which really did help me keep up-to-date on all of the material. Also, studying for exams was easier since I had already studied the material somewhat.The quizzes were 10 mintues long at the end of class. Sometimes I really needed a few minutes more merely because of the tedious-ness of the given problem and lost points a few times for a stupid minor mistake I made in the rush to finish.\nThe quizzes are different from the exams. She gave practice exams, but after everyone did well on Midterm I due to the similarity between her practice exam and actual exam, she gave useless practice exams for Midterm II and the Final. \nThe exams were tricky. Each problem had a trick to it that you either got or didn't. However, they were not extremely hard, just thought-provoking.\nPlus, her curve is VERY GENEROUS. I made in the mid-80s and received an A. Everyone that received over a 90 I think received an A+. \nIn sum, take her class! I don't think you will regret it.  \nWorkload:\nWeekly problem sets due every Monday with 10-minute quizzes given every Monday at the end of class. 2 Midterms (~5 prob) and Final.\nBREAKDOWN:\n10% Homework (Counts 10 of 13)\n15% Quizzes (Counts 10 of 11)\n20% Midterm I (avg. 160/200)\n20% Midterm II (avg. 130/200)\n35% Final (avg. 240/350)\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 13, 2009",
            "review_content": "\nThe quizzes make the class artificially stressful because we don't have an awful lot of time for them, and they're relentless: we never had a holiday. They also prepare us little for exams.\nThis class is stressful, but Prof. Grigsby's enthusiasm for the material does show in class.\nSeriously if you don't need to, if you're like me and wanted to take Calc IV as a utility, read a book. Just read the chapters of Stewart, get the main ideas without fussing over the tedious (!!) and esoteric details. This class, though I agree is not \"unnaturally hard\", is pretty stressful.\nWorkload:\nQuiz every, every, week. About ten HW problems each week. These can be long because problems are computationally intensive; a lot of times you just wish you could press the EASY button because you know how to do the problem, it just takes forever.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "February 27, 2009",
            "review_content": "\nI would avoid taking Prof. Grigsby's Calculus IV class. She is a pretty nice person, but her teaching is far from perfect. She seems to have trouble speaking in front of the class, which often takes away from her ability to teach effectively in my opinion. She gives weekly quizzes that really do nothing for you. It seems like a good idea to keep up to date with what's going on in the class, but the questions on the quiz are so conceptually easy, its more of just a time test. Can you complete said question in 10 minutes? If so, enjoy your 15 points. If not, better luck next time. What is even worse is that the midterm covered problems that had literally nothing to do with the quizzes. So instead of wasting 10-15 minutes of class once a week, explaining some of the more \"challenging\" questions that appear on the midterm would be kind of nice.\nI wouldn't say the class is unnaturally hard, but her teaching really doesn't help you understand anything but the simplest of problems. I understood very clearly what she taught on the board, but it simply did nothing come exam time (although it did help on the quizzes). And to put my thoughts into perspective, I have received an A or better in Calculus I-III. So take Grigsby at your own risk, but personally, it's simply not worth your time.\nWorkload:\n2 midterms, final, weekly quizzes, and weekly homework. A lot of work that really doesn't help come exam time. \n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "June 10, 2007",
            "review_content": "\nProf. Grigsby is young, I think it may have been her first semester teaching, which made her very understanding and approachable. She was genuinely excited about math and more than happy to see students at her office hours. Her lectures were enthusiastic and well organized, covering what would be on the homework and problems similar to those on the exam. The weekly homework consisted of problems out of stewart, except for the complex analysis homeworks. They were all straightforward, occasionally a tricky problem at the end, but nothing hard. There were weekly quizzes, but I thought they were also easy if you had done the homework. Prof. Grigsby said her reason for giving them was not to be mean, but to keep us from falling behind, help us evaluate how well we knew the material. The midterms were also fair- a few straightforward problems and then a problems or two that required some thinking. The final was similar, maybe a little bit harder. The lowest quiz and homework were dropped. I would recommend taking Prof. Grigsby if you can.\nWorkload:\nstraightforward weekly homework and quiz, two fair midterms and slightly tougher final\n"
        }
    ]
}