{
    "prof_info": [
        {
            "prof_name": "Sam McVane",
            "prof_id": 12954,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Elementary Latin",
            "review_date": "July 05, 2014",
            "review_content": "\nSam was my teacher for intensive Latin (first two semesters) during the summer.  This means that in 6 short weeks, we attempted to learn essentially the entirety of Latin grammar.  Being honest, I was taking this class to get my language requirement out of the way, and intensive intermediate is offered the next half of the summer, meaning the entire language requirement done in 12 weeks.  So I was somewhat appropriately assuming this class was going to be the most horrible academic thing I have ever done, and when I found out a grad student was going to be teaching the class, I was expecting the worst.\nBut I couldn't have been more wrong.\nSam was one of the most fantastic, engaging, dedicated teachers I have had at Columbia.  He took what should have been a horrible 6 weeks (btw 3 hours a day, 4 days a week), and instead made it fun and interesting.\nA few things that made this class so great:\n1) Because only a portion of class was lecture (about 20-40% of class time), we were able to really engage with the other classmates when translating together, making it a fun, lax, yet very productive environment.\n2) The textbook, while kind of a pain to read, was incredibly thorough and answered almost every little \"well what if...\" question.\n3) For what the textbook couldn't answer, or perhaps just didn't say well, Sam was able to answer with relative ease.  He is incredibly knowledgable about Latin (and Greek apparently), and also just really knows how best to think about most things.\n4) When there wasn't enough time to go over all the material in class, (a function of the class, not Sam or the students) he made these videos with a virtual chalkboard and audio track that explained it as if he was teaching it in class.  These videos proved to be very helpful.\n5) Sam also clearly cared about classics and us.  During our daily 10-minute breaks, he would sometimes be talking with one or two of us about the ancient world, his studies, or maybe even just trying to help someone out who was struggling with some of the material.  His caring also manifested in very quick email response time, very quick grading, and a general receptiveness that was greatly appreciated.\nSo all in all, if you've skipped to the end of this review for the verdict, Sam taught a classics class that made me, a prospective econ-math major, really enjoy what I was learning and perhaps even give a second thought to some classics electives.  Sam mentioned in class that all he really wants to do is teach, and it shows.  I highly recommend you take a class with him.\nWorkload:\n30% Daily quizzes that could be anywhere from a breeze to really tough, but they always kept us on our toes with vocab, syntax, and morphology.\n30% Two midterms\n25% Final exam\n15% Participation/attendance \nIt was an intensive course during the summer, so about 3-6 hours of hw a day, which was basically never collected, but nevertheless pretty essential to doing well in the class.\n\n"
        }
    ]
}