{
    "prof_info": [
        {
            "prof_name": "Martin Haugh",
            "prof_id": 1215,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "foundations of financial engineering",
            "review_date": "December 22, 2016",
            "review_content": "\nWorst professor ever. Let me list a few enlightening qualities of Mr. Martin\n1. Doesn't know much about anything but acts as if he is like Prof. Derman ( Too much ego )\n2. Basically rehashes materials from all his courses\n3. If all things are pretty obvious, I don't understand why we need you to tell that to us Martin\n4. Least helpful guy who you would ever have the displeasure to meet\n5. He said he had some fun stories to share about Peter Carr who he thinks is not that great ( Do people even that you exist Martin ? ) - Basically thinks he is better than the best.\n6. Look at his linked in profile and tell me why is he is in anyway qualified to teach here ( where you get the cream of the crop ). I think the the only reason he is still not fired is that he sucks up a lot to the chair presumably.\nNow the only redeeming quality is that the course is good and seems to be well thought out. Just because the material is good doesn't mean you don't need to teach and get away with everything.\nIn summary: A guy who is fun who you can grab a drink with, but stay away from his courses.\nWorkload:\nModerate, but grading is random and answers seem to be who writes english which apppears to be most aligned with this thougts ( very subjective ). Just take the materials from someone else and skip this. Way better courses on offer.\n"
        },
        {
            "course_name": "E4703 Monte Carlo Simulation",
            "review_date": "September 20, 2002",
            "review_content": "\nA great professor. He is extremely organized, provides excellent online class notes, and knows the stuff cold. And even though all the notes are available before class, he still manages to make coming to class very worthwhile with his excellent and clear presentation of the material. Coming to class was actually essential to me for understanding the stuff since Monte Carlo Simulation is not something that can be just picked up while leisurly browsing through some notes. This is an excellent class and Professor Haugh is an excellent Professor. It's hard to believe that this was his first year teaching and that he actually might get even better.\nWorkload:\nThe first few weekly homeworks were hard and kind of long and the midterm was pretty challenging. But later on, the homewroks get easier since you're just modifing the same program and the final was pretty easy. On average, spent about 7 hours a week on the homework. \n"
        }
    ]
}