{
    "prof_info": [
        {
            "prof_name": "George Kolombatovich",
            "prof_id": 2111,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Fencing",
            "review_date": "January 06, 2009",
            "review_content": "\nGeorge may appear slightly off kilter to those who don't catch the glimmer in his eyes as he makes fun of you in front of the whole class. If you really want to test his mettle, wear the T shirts of other Ivy League colleges and see how he reacts. A girl with a Yale shirt was poked fun at all semester because \"ladies should not be wearing shirts with four letter words on them\". It was hilarious, and the girl wore the shirt repeatedly. George is brilliant - make sure you count the number of times he says \"pommel on the wrist\" for the entire 14 weeks. Oh wait, he told us that a former student actually did, and it came up to over a 1000 times over the whole semester, so you do the math. George was absent alot this semester because he was off in China to help train other fencing judges because (and we had to Google to find this out) he is one of the world's best and most sought after fencing judges. And because of this, we learnt how to fence, as well as how to judge the scoring. Believe me, with tiny metal points going at speeds of more than 100mph even at beginner level, the class got into alot of headscratching just trying to figure out who got hit and who didn't. So if George is one of the best in the world, you're definitely studying with someone with real field experience. \nWorkload:\nWhat workload?\n"
        },
        {
            "course_name": "Fencing",
            "review_date": "May 22, 2004",
            "review_content": "\nGeorge is great!  He really cares a lot about you learning to fence properly and he will work with you individually if you need help.  He also tells you about the history behind fencing, which is actually pretty interesting.  Through the whole thing he is very funny--not laugh-out-loud funny, but joking around in a more mellow way.  Class somehow managed to be casual and structured at the same time.  I may not have gotten that good at fencing, but I learned a lot anyway while having fun at the same time.  My only complaint--and it's a small one--is that George is not that great with names.  All around, a really great guy; you'll be lucky to have him.  Definitely worth taking his class.\nWorkload:\nThis is PE.  You shouldn't be doing any work outside of class.  As usual, you can skip 6 classes and still pass.\n"
        }
    ]
}