{
    "prof_info": [
        {
            "prof_name": "Alison Keimowitz",
            "prof_id": 3073,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 21, 2008",
            "review_content": "\nAlison is a very engaging teacher with an obvious wealth of knowledge. This section of Frontiers was great, and everyone in the class really benifited. At one point, for example, we were discussing the wave particle duality of the electron and she presented a really good animation to illustrate the principle. She was also very available for help outside the classroom and with particular concerns.\nWorkload:\nAverage. A WIA due every week, excluding the first few weeks, when team projects were assigned.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 17, 2007",
            "review_content": "\nProfessor Keimowitz is amazing. She made FoS worth attending. She's approachable, helpful and seems to be genuinely interested in trying to make the class work for you. \nWorkload:\nStandard: 1 WIA per week, plus Midterm and Final.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 29, 2007",
            "review_content": "\nI love this woman! She is so nice and I learned so much from her! If you can take her class, do  it!\nWorkload:\nThe regular workload of a Frontiers class, except that Alison is an amazing teacher so you will ENJOY Frontiers!\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 03, 2007",
            "review_content": "\nAlison Keimowitz was a very good section leader. She was able to break down the major points from each Monday lecture during my Thursday Frontiers discussion section with her. She is always able to answer questions, both inside the class and during her office hours. I would contend that she puts a lot of effort into teaching this class though, like the many other teachers, she has a ton of research she is working on, on the side. All in all, Alison is a recommended leader. I hear of the other ones who are terribly boring and uninsightful and mean. Alison actually makes it a point to laugh at the jokes kids make, even if the jokes are downright terrible and stupid. She makes sure that the learning environment is a good one.\nWorkload:\nThe WIA's (weekly individual assignments) were nicely sized. They took a couple hours out of one's day, one day a week. There was also one department-wide project. She also had discussion posts to be made online, which she stopped after the midterm. Not tooo bad.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 25, 2006",
            "review_content": "\nAlison is a great instructor.  She is sweet and you can tell that she really cares about her class.  The Monday lectures are terrible but you really don't need to go to them for this section.  The class can drag on at times but it's what you should expect from any FOS section! There is a lot of group work which reminded me of busy work from high school, but the overall class was o.k.  Alison was always available, and easy to talk to.  The only downfall is that she is an extremely hard grader. Don't expect to get perfect scores on Weekly assignments and if you want full credit on lecture questions you better write a full-page response to your question.\nWorkload:\nweekly individual assignemnts, weekly lecture questions, standardized midterm and final. \nThe assignments took about two hours- use the FOS help room if you want a quick answer. The lecture questions are pretty easy but remember to write a lot for full credit! The midterm and final weren't that hard they're just like 5 mini W.I.A.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 07, 2006",
            "review_content": "\nAlison is the best Frontiers of Science teacher ever! Not only is she thorough with explaining the information, she is funny, sweet, and a genuinely nice person! Her scientific knowledge is extremely impressive -- she was capable of explaining concepts in astronomy and climate and ecology with skipping a beat. She is strict but reasonable with the work you hand in, but it is for your own benefit (she prepares you well for the departmentalized midterm and final). If you do all the work and participate, you should do well. If you were assigned to Alison for FoS, consider yourself lucky.\nWorkload:\nStandard Frontiers of Science workload -- Weekly Individual Assignments, Lecture Questions, Midterm, Final. Some of the work is tricky, but if you put effort in, you should be able to handle it.\n"
        }
    ]
}