{
    "prof_info": [
        {
            "prof_name": "Ruth Raphaeli-Slivko",
            "prof_id": 1038,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Readings In Hebrew Texts I",
            "review_date": "August 27, 2008",
            "review_content": "\nNice lady but not the most challenging class if you have completed the required Hebrew classes to take this class (which is considered an upper-level language class). Very easy to get side-tracked on conversations about the roots of words or how to remember the grammer of a word. Not a difficult grader and will regive a quiz if the class does not do well. Overall I am not even sure that the quizzes factor into our grading, and I doubt the homework did either. Homeworks and assignments are given two grades: content and language. Most people get an A on the first and an A or A- on the second. Overall the class was enjoyable and I would take it if it fits your schedule.\nWorkload:\nLots of Quizzes, 2 written assignments, final assignment or a written final (depends on her preference), periodic homeworks (mostly sentence writing on the words for a quiz or summaries of readings)\n"
        },
        {
            "course_name": "Upper Intermediate Hebrew II",
            "review_date": "June 06, 2005",
            "review_content": "\nThis is the 4th semester of Hebrew.  I knew more before I took this class.  Most annoying thing to wake up to 4 mornings a week.    Seriously didn't learn anything in class but because its a small class, you need to go or it will affect your grade... and there are useless EASY quizzes every day.   On the first day just sit far away from where she will be teaching so that you can do the crossword or entertain yourself in some other way for 50 minutes\nWorkload:\nquizzes almost every day but theyre all the same just with different words roots and Binyanim. 2-3 \"tests\" throughout the semester on which it is impossible to get an A. Perfect paper gets you A+ but one mistake and you get an A-.  I asked her about it and she gave some lousy explanation which I didn't even comitt to memory.   Mostly busy work for homework.\n"
        },
        {
            "course_name": "Advanced Modern Hebrew I",
            "review_date": "January 01, 2005",
            "review_content": "\nI know that some people have extraordinarily good experiences with the Hebrew department in MEALAC and others have heinously bad ones.  Fortunately, I've been part of the first group.  That's not to say that some people have been royally shafted, but I've been lucky, I suppose.\nProf. Raphaeli's class is the first I've ever taken where, when we came to winter break, I truly wished I could continue to have her class straight through to spring semester.  In class, I find her delightful and helpful, always willing to supply even obvious vocabulary words you may have forgotten (I am notorious for this; in my third year, I am still forgetting \"to know\" and \"large\").  She grades fairly, and any problems you have on her quizzes are made obvious, so you can correct them the next time.  It's not an easy class, but it's a fair one. \nWorkload:\nLots of reading assignments, which will take more or less time depending on your fluency.  Some simple \"go home and write sentences\" homeworks.  Essays graded on content and language skill.  Very fair final for which almost no studying was necessary.\n"
        },
        {
            "course_name": "Upper Intermediate Hebrew II",
            "review_date": "May 18, 2004",
            "review_content": "\nFar and away, the most spiteful and petty professor I have ever met.  If you want to get an A in this class, be sure never to let Prof. Raphaeli know.  In my opinion, she has no problem disregarding the average of your test scores, your homework scores, your class participation and attendance to make sure you do not get the grade you deserve and want.  She seems like a nice old lady until you question her grading system (a 99 can sometimes be recorded as an A- in her class!).   And watch out - she never gives partial credit for test questions and always makes sure that the distribution on a test comes out so that one mistake will result in an A-.  \nIn terms of her actual teaching skills, she's decent.  The article segments that she gives to the class are helpful and generally illustrate the way the verbs we learn are used in modern Hebrew discourse.  Though, class can get pretty monotonous; most days we just sat and read an article or went around the room answering questions in a workbook.  \n\nWorkload:\nAnnoying, but necessary writing assignments about every week.\nShort tests and quizzes on the different types of conjugation.\n"
        },
        {
            "course_name": "Advanced Modern Hebrew I",
            "review_date": "August 26, 2002",
            "review_content": "\nAdvanced Modern Hebrew was one of the best classes I have ever taken at Barnard and Columbia (or ever)! I have learned more in that class than I ever thought possible. It was entertaining yet challenging, one of Ruth Rapphaeli's greatest talents as a teacher is meeting everyones needs as a student. Even though everyone's experience with Hebrew is different, very soon after the first day of class the class becomes very unified. Even though the individual student makes his or her own individual achievements and accomplishments, challenges are often tackled as a team. The material is stimulating. The prof. always picks different types of stories to read so you can never get bored. She has great taste in the stories she picks. All of them usually have some suspence involved so that you really want to know what happenes at the end. The articles she picks are everyday articles from a newspaper that usually have a lot of the vocabularly that was just discussed. They too are interesting. The absolute best part of the class, though, is the wonderflul teacher. She trully is wonderful both as a teacher and as a person. As the saying goes 'Its the teacher who could make or break the class.' She is the sweetest person you will ever meet, she is sincere and thoughtful. She is extremely fair. She trully wants you to learn while enjoying the class. She wants you to have a good time and to reach the goals you want to reach. She, trully, works with you, not against you or in front of you or behind you, she is there for you when you need her, no matter how you learn.\nWorkload:\nThe workload is definetly not overwhelming. It is not a pure breeze either. If you pace yourself you will enjoy the class the most and get the most out of it. Half an hour everyday is what I suggest, but there will be days where something may take you two hours or a day where you have nothing to worry about. The workload often depends on your previous level of Hebrew. Eitherway, it is not boring and it changes often so you wont get stuck in something you may not particularly like. Prof Raphaeli-Slifkov is patient and always there to help you. It is a great class- a highly reccommend it to everyone. If you have some doubts shake loose of them because you will see that this will soon be your favorite class.\n"
        },
        {
            "course_name": "Readings In Hebrew Texts I",
            "review_date": "August 26, 2002",
            "review_content": "\nThe best class you will ever take. Everyone must take it if they can. It is like no other class. The structure Prof. Raphaeli creates is amazing. The prof. is the best. She will teach you so much and you will have fun at the same time. You as a class will decide the direction that class my take. When a class says a text is too easy, the next text will change accordingly. If the class decides something is too hard you will recieve an easier text. You will learn so much. Everyone does and everyone enjoys it, even if all at different levels. The Prof really know that everyones learns differently and everyone is at a slightly different level. What might not be an achievement for one person is for another. You will definetly feel great in this class no matter what your experience is as long as you try and you do your part. I looked forward to this class everyday.\nWorkload:\nAbout fourty minutes for every class day. Projects make take longer or shorter depending on what you do and your level. Workload all depends on your level- it will never be too much or none at all. I promise you you will enjoy it and the workload will be manageable if you really want to improve your Hebrew.\n"
        },
        {
            "course_name": "Upper Intermediate Hebrew II",
            "review_date": "August 05, 2002",
            "review_content": "\nThis is a fairly boring class. It's mainly focused on written grammar, with a bit of reading and speaking. The prof. is ok as a teacher. That said, the class is not particularly painful (a boring but easy first class each day is not necessarily a bad thing) and she gives light work and good grades. She is also pretty cool about lateness and attendance and is personally quite nice.\nWorkload:\nShort assignments most days. (I averaged about 15 minutes, 3 days a week.) Easy tests after major verb groups and a final that took most people forty minutes.\n"
        },
        {
            "course_name": "Advanced Modern Hebrew I",
            "review_date": "April 24, 2002",
            "review_content": "\nWhat a f***in waste of time this class was. Professor Raphaeli teaches with the exact mannerisms of a kindergarten teacher dealing with retarded gimps. Everything is repeated, over-enunciated, repeated a couple more times, slowly explained, etc. Much time in the class is spent learning grammatical rules that no Israeli would know or care about. Little or no attempt is made at fluency. To her defense, the class was also full of students who acted like kindergarten gimps.\nWorkload:\nMany small assignments and quizes, all repetitive and dull. Still, it makes for the easiest A in a four-point class I've ever seen.\n"
        }
    ]
}