{
    "prof_info": [
        {
            "prof_name": "Michael Fowler",
            "prof_id": 12940,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 02, 2017",
            "review_content": "\nSo glad I took this professor for Art Humanities- he is super competent and knowledgable about the material and the lectures were very engaging and interesting. He was also understanding about deadlines and was willing to grant extensions if necessary for the semester long exercise. 100% would recommend taking this professor!\nWorkload:\nTotally reasonable- A take home midterm, semester long exercise (3 drafts), and a final slideshow exam. If you pay attention in lectures and take notes you will do fine. Attendance to all lectures was required \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 23, 2016",
            "review_content": "\nFriendly, very engaging, will go out of his way to help students. Opens himself up for frequent office hours. Knowledgeable to classical era especially, but well-versed in every unit. Has clearly done his homework.\nClasses are very much a group conversation based around slides; very little lecture.\nWorkload:\nRequired reading, though solely personal accountability holds you to it.\nA term paper, with multiple drafts due at different stages in the semester which help keep you from procrastinating.\nSlideshow final, take-home midterm.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 12, 2016",
            "review_content": "\nProfessor Fowler is truly an incredible professor. He goes out of his way to help students and exudes a contagious level of enthusiasm for the subject matter. His lectures are energetic and intellectually stimulating. He is always excited to take the extra time to speak outside of class. His passion for the subject material and for instruction in general is really extraordinary. If you have a chance to take Art Hum, consider taking his section! \nWorkload:\nThe workload is about average.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 29, 2016",
            "review_content": "\nMichael is the single most enthusiastic professor I have had at Columbia. Not only does he commute back and forth from BOSTON every week, but he also prepares his lectures extremely thoroughly as not to waste students' time. He takes the time to sit down with each student outside of class to talk with them about their essays, too, and sets multiple deadlines so that students can improve their work before it is submitted as a final, polished draft. He also was the first professor I've had at Columbia who made any effort to put the Core in context of it's inherent flaws, calling out its focus on white male scholars and inserting the voices of other groups where appropriate (without tokenizing said groups).\nWorkload:\nNot bad at all. Very much graded based on how the student grows in written analysis + how much the student is willing to engage in class discussion, not how much they know about art in the first place.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 29, 2014",
            "review_content": "\nAn incredible professor. Rare is it that you find someone with a combination of such brilliance and such engaging pedagogy. Michael really does his research, knows a ton, and constantly exudes his passion for the material. He has every right to be full of it, but is far from it - he's incredibly personable and approachable, and really cares about each student.\nWords really can't do justice to his praises - if you have a chance to take Art Hum with him, do it!\nWorkload:\nTotally fair - one midterm, a take-home final, and a writing exercise.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 27, 2014",
            "review_content": "\nI had Michael Fowler for Art Humanities Spring 2014 and he is really fantastic. First, the class was at 8:40AM and he still made it fun and interesting to come to every Tu/Th morning which shouldn't have been possible.  He covered the material incredibly well: I came in with no art analysis or history experience and thanks to his class I feel confident in my abilities. Our field trips were also really great and well prepared. On top of all this, I was expecting to feel left out of another \"western\" white male centered Core class but I was pleasantly surprised to see Michael consistently try to bring in other thoughts, ideas, and artists to the curriculum. Definitely gold-nugget worthy and I'm really surprised he doesn't have other reviews.\nWorkload:\nA formal analysis paper with drafts due over the course of the semester, an in-class midterm, and a take-home final. The midterm and final were difficult, but if you came to class for the lectures and did some of the readings you were definitely well prepared. He works with you on the paper to make sure that you have a good product and is a very fair grader. \n"
        }
    ]
}