{
    "prof_info": [
        {
            "prof_name": "Hailong Wang",
            "prof_id": 1292,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Chinese II (W)",
            "review_date": "May 04, 2014",
            "review_content": "\nProfessor Wang is amazing, and is a great teacher. I learned a lot from him and my Chinese definitely improved in the year that I was his student. He does his best to help you to improve, and he genuinely wants to give you a good grade. He may not be the most exciting, but he definitely knows his stuff. Sometimes, he'll digress and tell you a story about his life in China, which are usually not that funny, but is good for wasting some time in class. Do the work, listen in class and study for the tests. It doesn't get much simpler than that. \nWorkload:\nDictation almost every day, 10 homework assignments, 1 for each chapter, 3-4 essays and 5 tests. Seems like a lot, but definitely manageable. \n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "April 29, 2014",
            "review_content": "\nWang è€\u0081å¸« really isn't as bad as a teacher as the reviews make him out to be. Yes, he can be sarcastic and tease/pick on you for small things, but it's not like he's trying to be mean. That's just kind of who he is, and the general old-Chinese-man-from-China kind of personality: super sarcastic with a very dry humor. Don't take it personally, he does it to everyone. He'll usually enter the classroom in a kind of bland mood, but he'll start to liven up quickly. He can have his off days--if he does, do not irritate him in any way.\nThe cardinal rules of his class: 1) Do not be late. 2) Participate. 3) Double space your homework.\nDespite his insistence on participation and the strict way he runs his class, I enjoy his class more than the previous instructor I had. She was super sweet and so nice, no complaints, but because she was super lenient and didn't push the class, I subsequently also was less invested in the class. WIth Wang è€\u0081å¸«, I actually really care because you can tell how badly he wants the students to care.\nHe also actually really cares about his students, and despite how much he teases us, he's really proud of the students as well. If he sees that you're not feeling well, he'll insist that you don't come to class and just go back to your room. He's also constantly telling the class how we're \"the best of the best\" and the advantage we have because we're sort of native speakers.\nHis teaching style isn't for everyone. He drones on about tangential lectures a lot. He drills you about your pronunciation and if you say something wrong, he'll laugh and tease you about it. He'll put you on the spot for sure, and he's real strict. But he genuinely cares about the class and cares that the students learn something, and so I really respect him.\nWorkload:\nDaily dictations, either 10 vocab words or 3 sentences from the lesson. Test every 2 chapters, 3-4 compositions.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "August 19, 2012",
            "review_content": "\nWang Laoshi seems to find joy in appearing as much of a jerk as possible in the first week of school. On the first day everyone has to give an introduction in Chinese and be corrected/mocked for every mispronunciation and grammatical mistake. After the first week he isn't as perpetually angry, but will still have his pissy days. Always do the homework the exact way he tells you to, never arrive late to class, and make sure you keep your phone on silent.\nWang Laoshi's insistence on correct pronunciation, while often embarrassing, has been very helpful. Being made to repeat a sentence over and over again will ensure that you will never dare say it wrong again. He has some interesting stories to tell and isn't the driest of lecturers but class is mostly centered around him talking without much discussion (other than during the oral presentations). Fair grader and pretty approachable during office hours.\nWorkload:\nDaily dictation quizzes of approx. 25 words, weekly homework assignments, tests every other week comprised of 2 chapters. Also 2 group oral presentations that serve as an oral test grade. Doable, but all the vocab memorization is still a pain, especially on Thursdays when you have 24 hr for Friday class.\n"
        },
        {
            "course_name": "Advanced Chinese 3W",
            "review_date": "January 09, 2012",
            "review_content": "\nHailong Wang will probably be the worst teacher I'll ever have at Columbia. He is conceited, bordering on biopolar, and uninspiring. His textbooks are not only outdated and often not useful, but also full of mistakes in both English and Chinese. Wang thinks highly of his opinions, some of which I'm sure are very good, but I don't want to learn about Jane Eyre in Chinese even if he has a degree in English literature. \nHis lecture style means that everyone daydreams for the majority of the class, leaving most of the work to be done outside of class. At the beginning, the workload may not appear too heavy, but Hailong Wang will then often be unreasonable and be prepared to expect an oral presentation, homework essay and long dictation all due on one day. Furthermore, his TA marks the homework quickly without helpful comments about how to improve the essay. \nOccasionally, he can be nice, especially during office hours. But generally, expect a total dick. \nWorkload:\nIf you don't speak fluent Chinese, very heavy. If you do, heavy. \n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "December 24, 2011",
            "review_content": "\nWang Laoshi.  The best way to describe him is a mixed bag.  In the first 3 weeks, he wasn't exactly friendly, extremely cranky, and strict.  But do not be fooled.  It's all an act.  After that period, he becomes much friendlier and you will probably like him by the end of the semester.  So Wang Laoshi is by no means a nasty person - just someone who wants to make an impression.  That being said, he still as strict requirements.  The commandments include: Do not be late to a test.  Do not be late to class.  Do write your hw neatly.  Do follow all his directions to the letter.  Do participate.  Do the readings.\nAs for his teaching style, this class is mostly for people who can speak fluently and cannot read or write.  So it is mostly self driven work to memorize, not something he can help you with.  As a result, he spends the class going over grammar, which is not all that helpful because we are assuming you can speak fluently.  He is very thorough.  Up to the point of being boring.  But then again, I suppose there is not much to do in class aside from that.  Outside of class is another story...\nWorkload:\nA crapload.  Memorize 60 characters a week for class.  On the bright side, he won't give you lower than a B+.  While the class is not difficult, it is extremely time consuming.\ndaily dictations of the characters you were supposed to memorize (3hrs 3 times a week.  Less if you want but you won't be as prepared for the tests).  Less than 1 HW a week (2 hrs).  A test every 2 weeks.  Final.\n"
        },
        {
            "course_name": "Advanced Chinese 3W",
            "review_date": "June 10, 2009",
            "review_content": "\nI had Hailong Wang for 3 semesters: all of 1W and the first semester of 3W before I finally switched out to 3N, which I found suited my needs and learning style better. \nThe biggest con is that Wang lectures through the entire class, and it's normally not too interesting (though he does have some cool stories about the Cultural Revolution). Although I knew Chinese coming into the class, I was looking for more speaking practice and formal instruction regarding grammar and structure, neither of which was a focus in the class. I found the textbook lessons boring and not particularly well-structured or well-written (too many archaic vocabulary words, lessons that don't build off each other or progress naturally, etc.). Wang could also be a bit of an ass sometimes, as other reviewers have already mentioned (e.g. referring to Cantonese as \"barbaric\"). \nStill, this might be a fit for some people. We do learn a lot of vocabulary. I personally didn't think there was a strong enough focus on practicing the correct usage of that vocabulary, but if you're seeking primarily just to learn to read/write characters that you already know how to use in speech, this may be the class for you. \n\nWorkload:\nStandard for a language class: daily dictation, light homework assignments and occasional essay. Relatively easy A. \n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "January 20, 2009",
            "review_content": "\nProfessor Wang is a stickler for pronunciation but that's a good thing; I realized that I had been pronouncing so many words incorrectly and I am glad that he makes you repeat--in front of everyone--the word over and over and over again until you get it right (despite it being a bit embarrassing). Class can be a lot of fun, he's got a sense of humor. However, on some days, he can be a bit irritable and be prepared to the receive the brunt of his anger. He also holds grudges, so if you forget your homework one day, or your cellphone rings during class, be prepared to hear about it every single day after the incident. He grades tests and essays very fairly. He isn't harsh when you just don't know a character and write the pinyin instead. Great teacher, I'm glad to have taken his class. \nWorkload:\nDaily dictations (10 vocabulary words and you need to write the character, pinyin, and English definition), 5 tests (2 chapters per test), a couple of writing assignments. All in all, not heavy but certainly not light. The vocabulary memorization for the final is what kills you, not the tests/dictations/writings.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "December 16, 2008",
            "review_content": "\nThis class was very fun and worthwhile. I learned more characters than I had imagined and the professor is really entertaining. Come to the class only if you know how to speak Chinese already or you'll have a hard time since he doesn't speak English at all.\nWorkload:\nThe workload is pretty intense but you'll get used to it. There's dictation quizzes everyday so you'll have to memorize about 25 to 30 characters for each class. Homeworks are assigned about once every week and it's not that bad. It's definitely worth the 5 credits.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "May 24, 2007",
            "review_content": "\nProf. Wang is a great teacher. I don't exactly agree with most of the stuff about how he's a hardass and makes fun of people. Yea, in my class, he made fun of this one kid, but with legitimate reason, because that kid was late almost every single time, and was pretty much a smart-ass. His style, like other people have said is mainly lecture, but there are 2-person presentations. His personal pet peeve is if you're late, so don't let that happen, study for the daily (10 question) oral dictations and watch your pronounciation and he'll love you. Workload is pretty easy for a 5 credit class- homeworks that take about an hour/hour and a half, easy tests every 2 weeks, final and a group skit.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "May 13, 2006",
            "review_content": "\nI really liked Professor Wang.  Yes he is strict, but tends to lighten up as the semester goes on.  His teaching style is very enjoyable and interesting.  It is a time consuming class, but definetly worth the effort as your Chinese will greatly improve.  Take 1W from him.\nWorkload:\nDaily dictation: one page or so worth of vocab (20-25 phrases/words), or sentences from the text, essays every two weeks or so, written homework for every lesson, no midterm, oral presentations (2 per semester), final\n"
        },
        {
            "course_name": "Advanced Chinese 3W",
            "review_date": "April 05, 2005",
            "review_content": "\nInteresting teaching style, to say the least. He wrote the books he uses, both the 3rd year and the Business Chinese. Whenever you start a new lesson, you sit down and shut up for 3 classes while he gets people in class to read and then talks about the material himself. As with the last reviewer, I agree that this class is much more lecture-based than it should be for an advanced native speaker class, but at the same time, despite the lack of in-class conversation and written exercises, I learned a lot from his sit-down-and-listen style. This style was especially helpful in terms of hearing about issues (ex. farmers, cultural revolution, etc.) from a Chinese perspective. Sometimes he tells really entertaining stories, like when he was  working on the farms and a pig drowned in piss. Writing exercises are standard, make sentences, write essays, etc. The matching words with same meanings is ridiculous. Just memorize the matching words tables for the tests.\nAs far as supplementary readings and the business Chinese sections, I'd say that the supp. readings are valuable because they give you a broad view of Chinese culture, but are largely otherwise a waste of time. Presentations of this supplementary material are like Wang's lectures, where you end up listening to Wang talk for most of the time. Business Chinese is an even bigger waste of time, you learn how to write notes and letters in Chinese, but it's all stuff you learned in elementary school anyway.\nI got the most out of this class on my own time just learning the words. Sitting myself down for a couple hours and going over the text and memorizing the words (remember those lines of words from Saturday morning Chinese classes? yeah those came back again) that I didn't know is what got me through the class, and Wang's expectations of his students encouraged me to do this--otherwise I wouldn't have that much of a motivation.\nOverall, learned a lot of new characters, learned a lot about history/culture of China. Would take another class with Wang.\nWorkload:\nShifts between minimal and a lot. At the beginning of new lessons, lots of new words to learn, but afterwords you can come to class without really preparing too much. Daily dictations at the beginning of lessons, 4 lesson tests, 1 essay/lesson. Supplementary presentations. Final.\n"
        },
        {
            "course_name": "Advanced Chinese 3W",
            "review_date": "March 13, 2005",
            "review_content": "\nAt first, I was a bit intimidated by Wang Laoshi because he seemed to pick on me frequently about not being able to recognize the simplified characters in the textbook and kept asking if I knew how to use a dictionary. I thought it might have something to do with the fact that I learned most of my Chinese in Taiwan and grew up writing traditional characters. After a while I realized that it was only partially because of my Taiwanese background, and it actually had more to do with the fact that he's just not a very people-friendly instructor.\nWang Laoshi is not a very good instructor, in my opinion. For an advanced language course that is supposed to be taught to native speakers, there should be more in-class conversations and more intense writing exercises. Instead, he just really likes to hear himself talk in class and lectures for most of the time. And even when we have group presentations for the supplementary readings, questions raised by other students in class are usually answered by Wang Laoshi, and his answers always last for 20 minutes, seriously. Although I'm already fluent in Chinese, I really wanted to be comfortable just speaking Chinese outside of my own house and be able to learn phrases or figures of speech that is used in everyday conversation, so Wang Laoshi's domineering attitude over the class was a big disappointment.\nAlthough Wang Laoshi's textbook is very interesting in introducing American-born Chinese to the mainland culture, the written assignments for each chapter are always structured so awkwardly and at times, poorly. For example, a lot of the times the \"find the pair of phrases that most closely relate to each other\" exercise is often ambiguous and confuses many students. Unfortunately, Wang Laoshi is not very welcoming of criticisms or even questions raised towards the textbook that he authored. He often makes very unpleasant comments or answers questions rudely, which makes the students feel uncomfortable and intimidated to ask anymore questions. I don't feel like that is a good approach to teaching a language. Furthermore, he has intense mood swings -- you'd think the guy was on menopause. He is the epitome of the typical Chinese man; you never know if he's going to come into class and be really nice, or be slamming the table and be really rude. \nThe good thing about his class though is that it's REALLY easy. As long as you know a fair amount of written Chinese as a native speaker, you'll do fine in that class. Most people get A's in that class, so don't worry about the class being 5 credits -- it's not hard at all for a 5-credit class. The hard part is staying awake for the entire 85 minutes of the class, 3 times a week.\nWorkload:\nDaily quizzes, 5 chapter assignments, 4 chapter tests, 5 compositions, 4 group oral presentations for supplementary readings, 1 comprehensive final.\n"
        },
        {
            "course_name": "Chinese 4005/3W",
            "review_date": "February 01, 2005",
            "review_content": "\nVery strong instructor and course overall.  His textbook uses an anthropolgy approach so you will learn Chinese language in the context of Chinese culture.  Also the practical business writing sessions are interesting but a bit long and half of it is too basic.\nIf he likes you, he is incredibly flexible with abscences for job interviews or illness.  Don't be late to class and/or be really dumb and the default is he will like you.\nWorkload:\nDaily quizzes half the time, short homework, short essay, easy tests, 4 presentations and discussions.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "January 13, 2005",
            "review_content": "\nLike the other reviewers are sort of hinting at, this guy is smart but often a bitch, though unfortunately, that's probably why he makes him a good introductory teacher as well.  He is strict and has no professional scruples about using anger, disappointment, and condescending belittlement to prod and embarass you into a hard working student.  You learn a lot in 1st year, which impressed me when I took the course, but less so as I had much more effective teachers that were also decent human beings.\nOkay, so you know you can learn a good amount, but specifically, who is he going to pick on?  People late to class (even by a little, though somewhat understandable), girls (uh, because he's not one?), and non-Beijingers.  He hates Cantonese accents and English accents--on the one hand it's good he is strict with pronounciation but on the other I don't get why it's carrying over to how he treats them--to a lesser extent Taiwanese accents.\nI was lucky enough not to fall into any of his hitlist categories, but it leaves a bad taste in your mouth when the professor goes on monologues purposely trying to embarass students for arbitrary or prejudiced reasons.\nWorkload:\nDaily dictation quizes.  Also have to be able to read the passages fluently in accurate pronounciation, or he's gonna pick on you.  Tests I think every 3 lessons.  Couple of essays.  Final.\n"
        },
        {
            "course_name": "Shanghai Business Chinese Program",
            "review_date": "January 13, 2005",
            "review_content": "\nThis review is not about Wang Hailong as a teacher, but about him as director of the Shanghai Business Chinese Program and a general review of the program in general, because it doesn't fit anywhere else.\nI generally agree with the other reviews about him as a professor in the classroom--decent teacher but sometimes is an ass to particular students.  Okay, well, all that teaching competence does nothing for him as an administrator.  What really sucks about the program is the business part of the program is a crock and is more about Hailong Wang making some extra cash for himself than giving students good exposure to the business world in China.  Bottom line--if you're really committed to doing a Columbia program, go to Beijing because 1) learning more Chinese is more useful than wasting time in the \"business\" side of the Shanghai program 2) it's not as hot and muggy during the summer as it is in Shanghai.  You might consider non-Columbia programs too.  They're much cheaper since the cost of everything in China is cheaper, and Columbia keeps the tuition artificially high because they think it's worth more since they're Columbia credits (Columbia makes you pay Columbia tuition when you study abroad during the school year too, even though no one else in the world comes close to matching top American private school tuitions).  You could probably hire a private tutor for 10 weeks in China for the money that you pay for the program.\nThe program consists of 6 weeks of class and 4 Weeks at an internship.\nTextbooks (2): You have 3 days with a typical textbook then 2 days with the Business Chinese textbook, that (surprise!!!) Mr. Hailong Wang authored himself.  This book was garbage, and I know it was garbage not just on my opinion, but because my teachers regularly complained about how bad it was and how many mistakes the book contained.  The book ends up being too difficult for third year students and too easy for fourth year students (but that's because a lot of the 4th years are almost fluent in Chinese and either wanted to chill for the summer in Shanghai or were conned into applying by \"business\" side of the program).  If you're going to use your own textbook for the program, it better at least be good.  The mistakes weren't just typos; a lot of times our teachers were just like, \"what the hell?  you can't use that phrase like that.\"  The content is pretty ridiculous too--yes, maybe the resume section is useful, but way too much obvious garbage passages about how notes are good for comunicating informally.  Gets real boring for a four hour class.\nThe supplementary talks are also garbage.  These guest speakers sounded interesting up until they started actually talking.  Actually they don't talk.  They just read from Powerpoint slides in broken English.  Sleeping and text messaging time.\nInternships are worthless.  I just sat around and did nothing for four weeks, and most students had the same experience.  Sure, met some nice people, sat in on some meetings.  Uh, but I paid good money for the program, and the alternative could have been learning more Chinese or travelling.  One student was stamping papers but that got so bad they were moved and a lot just started skipping days of work.  I at least had my own internet connection and could IM other students doing nothing--some students were sitting around and doing nothing and had no computer.  Face it kid, your Chinese is not good enough to really be doing anything useful and four weeks is just too short of a period for the company to want to invest time and effort to teach you anything so that you could be useful.  If your Chinese is good enough... then just find a job yourself.  It'll definitely be better, it'll pay you instead of you paying it, and you won't screw the students that actually are trying to learn Chinese.\nTrips.  Out of the places we went, the only place that was any good was to a real estate company.  Everything else was stupidly touristy, i.e. Shanghai Circus.  Fortunately your language partners can take you to more interesting spots.\nAnyways, China is an interesting place with its fair share of problems, so I recommend studying there.  But this ain't the program to do it with, not even if you have business aspirations.\nWorkload:\nColumbia style Chinese course.  Daily dictation quizes, weekly tests, final the last week.  Practically daily essays.  Intense, lots of words each day, those 6 weeks are supposed to be 2 semesters worth of Columbia Chinese.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "September 01, 2003",
            "review_content": "\nAs most of the other reviewers have said, Prof. Wang knows his subject material, and, although he is a strict lecturer and grader, he will take you through beginning Chinese thoroughly and well.  By the end of the course, we could all have gone on to third-year Chinese.\nHowever, I do have to comment on his bad days, because they can be quite pronounced.  On good days, he's funny, can take a joke, and goes about with a generally positive attitude.  On bad days, however, he's willing to stop the entire class to single out a student to belittle for several minutes.  The worst of it is, often the student in question hasn't done anything particularly offensive.  In one instance, students were asked to name the most influential person or persons in their lives.  When called on, one student said that everyone had influenced him in some way, and that he couldn't choose a single person.  Prof. Wang stopped class expressly to chastise this student, and to accuse him of not taking the class seriously.  I think everyone in class felt that was overkill.  Although no one I have ever seen has actually been reduced to tears in the class, I am almost certain some of the students, who bore the brunt of Prof. Wang's displeasure, may have come dangerously close.  As another reviewer said, the students that are picked on the most tend to be girls.\nTherefore, take this class at your own risk.  It is by no means certain that you, particularly, will be singled out, and if you are not, you will learn a lot of Chinese from a teacher who is definitely capable and efficient, lesson-wise.  If it looks like you are going to be Prof. Wang's punching bag during the first two weeks, however, do not stay in the class.  Transfer out -- there's no reason you should have to take that, especially when we're paying such astronomical sums to attend this university.\nWorkload:\nA ten-question quiz every class, a test every two weeks, a midterm, a project (usually a skit of some sort) and a final.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "January 19, 2003",
            "review_content": "\nThis man is so intelligent! Absolutely great Chinese teacher. I admit, he can be very serious sometimes, definitely isn't one of those teachers you can kid around with. But, he is so incredibly knowledgeable about the Chinese language (especially calligraphy), and Chinese history. He focuses alot on pronunciation which is great. Definitely a teacher to have! \nWorkload:\nDaily dictation quizzes on vocab, biweekly tests, a group skit/presentation, final exam. Standard Chinese class requirements. \n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 16, 2002",
            "review_content": "\n   He is a good teacher in that he knows  how to present the words of the language for the students to learn.  He paces the class well and you will learn if you do his work.     That said, I must say that this man has some of the characteristics that create for a poor human being.  He thinks he has a good strict style, but that kind of teaching style belongs back in elementary school, or communist china where disciplining students is part of a teacher's job.  He continually targets students he does not like in class, especially the ladies of the class.  No matter how hard they are trying, he continually mocks them and belittles them in front of everyone in the class. (This is all my opinion, of course)\n   This, I feel detracts from his overall teaching ability. \nWorkload:\nFair workload.  Dictations every class.  One chapter per week, one test per two chapters.  No Midterm.  Oral presentation mixed with Final.  Class is simple and straightforward.  Easy if you have background.\n"
        },
        {
            "course_name": "Elementry Chinese W",
            "review_date": "December 09, 2002",
            "review_content": "\nA great teacher. He lectures mostly and spends a lot of time on correcting your pronounciation. He is devoted to making sure that you are saying the words correctly. The class was very interesting and the book we use is so great. Take this class if you like chinese a lot and would like to learn indepth material. He's funny, sarcastic and quiet a knowledgable guy.\nWorkload:\nA fair amount of work. If you work hard, not only do you learn the material, but feel a sense of accomplishment in the end. Dictations in the beginning of class, 5 tests, 3 compositions, an oral project, and a Final. If you work hard, that A will be so rewarding.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "November 21, 2002",
            "review_content": "\nHe's a good teacher, but a very strict guy. Do not come to class late. He is not that flexible with absences. He notes them and questions you about it the next day. He expects you to know stuff and if you've never had any experience in writing, this class can be very overwhelming for the first few weeks. I've learned alot from this man. However, I do notice his occasional mood swings and harshness in his personality. He can be pretty tough on you on a bad day. He can pick on you and criticize you in a demeaning way if you are on his bad side. \nWorkload:\nvery intense....daily dictations...a test every other week ...and a few essays...presentations\n"
        }
    ]
}