{
    "prof_info": [
        {
            "prof_name": "Valentina Izmirlieva",
            "prof_id": 409,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Magical Mystery Tour",
            "review_date": "August 26, 2014",
            "review_content": "\nProfessor Izmirlieva is a phenomenal lecturer-- her class sessions are vibrant, informative, and relevant, and the assigned readings are well-selected and fascinating. One would expect a historical survey course to be somewhat dense and dry, but Magical Mystery Tour was anything but-- supplementing lectures with discussion sessions, films, and \"field trips\", Professor Izmirlieva worked hard to ensure that students weren't bored. That being said, last semester for various reasons she canceled a total of 6 classes and made no effort to make up for this lost time. Please know that if you take Professor Izmirlieva's course you may not get your money's worth.\nWorkload:\nLight-- brief weekly online responses, 2 very brief papers, and a midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 23, 2010",
            "review_content": "\nNot to be mean--because yes, she's \"nice\"--but this class bored me so much that instead of listening to the lecture/discussion about the books we read, I brought my own books and read some more, and I jumped at the opportunity to switch into another section when the first semester was over. The class is mostly lecture, in which she went over the events of the book and elaborated a bit on themes, etc. None of the things she brought up were new or interesting or entertaining to me, and, though this next part perhaps isn't as much her fault, even when the class had open discussions they were stunted, not engaging, and not many people participated. Another thing that really bothered me is that this is a *reading and writing class* and yet she wouldn't look over drafts of the assigned papers, no matter how early you finished the draft, because, and I quote, \"it wouldn't be fair to the rest of the class who didn't hand in drafts and receive constructive criticism.\" Huh?? The rest of class could just as well finish their drafts early too if they wanted to! What kind of English teacher won't look at your writing? She also let her personal life interfere with her teaching (I'm tired from moving, I'm distracted from my kid, etc) and mentioned a number of times how she \"has a life\" and isn't always online to answer emails like us hip young kids and to not expect to always be able to reach her. I understand that teachers have lives too, but she definitely made her teaching seem low on the priority list. \nWorkload:\nRegular reading load for Lit Hum. A bunch of books, a moderately large amount of reading them. A couple mid-length (3-5) page papers, a midterm, and a final. She seems to give mostly A's and B's on the papers. However, she won't look at your drafts so you can't improve! \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 07, 2009",
            "review_content": "\nAs a practical note, I wouldn't change section if I get her again unless I am sure I would get a better instructor. There are a lot of awful professors teaching lit hum; at least she doesn't rebuke any other field than literature or does crazy things many other section instructors reportedly do. And the workload is rather light (3 short papers, submission of short question every night before class) but midterm ID was not so easy. I am not as so sure about favorites as other reviewers, but I couldn't say she doesn't have one.\nThe main issue I had with the course is how the class is taught. It is mostly discussion and she hardly writes down anything, and I am doubtful whether it's very effective. She does give questions and leads the topic to what she wants to teach, and she is very knowledgeable, but the teaching itself if rather disorganized, because there is a continued discussion (and quite a few parts of it going nowhere) and she says things she wants to say between them, so sometimes it's hard to get a big picture about the book. But most of the time, you can get something out of the discussion.\nThe bottom line is that she is a nice person, and you can learn quite a bit in the course if you try. And you won't get absolutely horrible grades even if you are not very good or don't have much time. Not bad.\nWorkload:\n3 short papers, Readings(Assigned, but she sometimes skips some material), discussion questions before each class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 19, 2009",
            "review_content": "\nShe could be worse, but she is not exactly the most approachable professor. She DEFINITELY has her favorites, and if you aren't one of them expect her to look at you like you're a toddler if you ever dare contribute to class discussion. If she doesn't agree with whatever you say, she will give you her awkward stare and try to move on by bringing in whatever her genius right answer was. Class discussions aren't earth-shattering, and you will probably find yourself bored to death after twenty minutes. This isn't the most enlightening lit hum section, and if it isn't what you're looking for, switch. \nWorkload:\nAll the regular reading, plus a discussion question submitted by midnight before each class. The midterm is alright with both obvious and obscure quotes; department wide midterm\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2008",
            "review_content": "\nI must disagree with the last recent review and say that Valentina's really not all that bad. In fact, I enjoyed the class. I was not one of her 'favorites' (and far from the best student in the class), yet I still felt that I was treated respectfully, even when she didn't agree with what I said in discussion. She wants you to touch on certain ideas because they are likely to help you on the exams.\nAs for class: in the beginning she expected too much out of our group and expressed a lot of frustration at our 'reluctance to speak', but worked with us to find a solution, and we reached an equilibrium about halfway through the semester. She usually led a lively and engaging (but never earth-shattering) discussion. Outside of class she was always polite and helpful, without the condescending 'you're just a teenager' attitude that is sometimes present in freshman classes. Being one of the older students, i really appreciated this.\nBottom line: Valentina is a good lit hum teacher. No matter what amount of commitment you give the class, she will treat you respectfully. If you're looking for a life-changing experience, however, look elsewhere.\nWorkload:\nTwo six-page papers and a brief discussion question to be submitted before each class, along with the reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2008",
            "review_content": "\nI must disagree with the last recent review and say that Valentina's really not all that bad. In fact, I enjoyed the class. I was not one of her 'favorites' (and far from the best student in the class), yet I still felt that I was treated respectfully, even when she didn't agree with what I said in discussion. She wants you to touch on certain ideas because they are likely to help you on the exams.\nAs for class: in the beginning she expected too much out of our group and expressed a lot of frustration at our 'reluctance to speak', but worked with us to find a solution, and we reached an equilibrium about halfway through the semester. She usually led a lively and engaging (but never earth-shattering) discussion. Outside of class she was always polite and helpful, without the condescending 'you're just a teenager' attitude that is sometimes present in freshman classes. Being one of the older students, i really appreciated this.\nBottom line: Valentina is a good lit hum teacher. No matter what amount of commitment you give the class, she will treat you respectfully. If you're looking for a life-changing experience, however, look elsewhere.\nWorkload:\nTwo six-page papers and a brief discussion question to be submitted before each class, along with the reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 05, 2008",
            "review_content": "\nTerrible professor. She seems to be under the impression that her students are dim-witted blobs she must shape and mold. She is condescending and belittling. Being in Lit Hum with her is like pulling teeth as she sruggles along to get you to say whatever point she has in mind since students are obviously incapable of coming to the incredibly insightful conclusions she makes about the books.\nWorkload:\n2 papers of 6 pages. You'd better be able to regurgitate back to her whatever ideas she pushed onto you.\n"
        },
        {
            "course_name": "Re-Reading Nabakov",
            "review_date": "December 18, 2005",
            "review_content": "\nTake this class in order to spend a semester slowly sipping one of the twentieth century's greatest literary works. Prof. Izmirlieva is a challenging and vigorous discussion leader who brings a wealth of insight into Lolita to the class. At times she seemed dissapointed by class participation, but  she was up for tenure review and understandably  more nervous than usual. At the end of the day she is a very smart, very lucid professor who has a passion for Nabakov. \nWorkload:\n 1 in-class mid-term (in the style Nabakov used to give at Cornell in the '60's, so be on your toes to remember every single detail). 1 in-class presentation. 1 8-10 page final paper. \n"
        },
        {
            "course_name": "Re-Reading Nabakov",
            "review_date": "December 18, 2005",
            "review_content": "\nTake this class in order to spend a semester slowly sipping one of the twentieth century's greatest literary works. Prof. Izmirlieva is a challenging and vigorous discussion leader who brings a wealth of insight into Lolita to the class. At times she seemed dissapointed by class participation, but  she was up for tenure review and understandably  more nervous than usual. At the end of the day she is a very smart, very lucid professor who has a passion for Nabakov. \nWorkload:\n 1 in-class mid-term (in the style Nabakov used to give at Cornell in the '60's, so be on your toes to remember every single detail). 1 in-class presentation. 1 8-10 page final paper. \n"
        },
        {
            "course_name": "Dostoyevsky's Literature",
            "review_date": "January 02, 2005",
            "review_content": "\nOne of the nicest professors at Columbia.  Prof. Izmirlieva definately knows what she is talking about, she brings up very  interesting details.  A very relaxing class, especially if you have a lot of other things going on the same semester.  Focus on the midterm and final assignments, they are the only grades you will get throughout the semster.\nWorkload:\nShort weekly readings in Russian, a midterm (two essays)  and a final (two options for the final, either one essay (comparison to another book) or two shorter essays).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 29, 2002",
            "review_content": "\nA wonderful, wonderful teacher! She is passionate, outgoing, interesting, and brilliant. Prof I leads a great class discussion and she loves her students and her work. Thank the gods if you are lucky enough to have her for Lit Hum. You will learn a ton. She is also a very fair grader.\nWorkload:\n2-3 papers, midterm, final - fair/easy grader \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 29, 2002",
            "review_content": "\nA wonderful, wonderful teacher! She is passionate, outgoing, interesting, and brilliant. Prof I leads a great class discussion and she loves her students and her work. Thank the gods if you are lucky enough to have her for Lit Hum. You will learn a ton. She is also a very fair grader.\nWorkload:\n2-3 papers, midterm, final - fair/easy grader \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 29, 2002",
            "review_content": "\nA wonderful, wonderful teacher! She is passionate, outgoing, interesting, and brilliant. Prof I leads a great class discussion and she loves her students and her work. Thank the gods if you are lucky enough to have her for Lit Hum. You will learn a ton. She is also a very fair grader.\nWorkload:\n2-3 papers, midterm, final - fair/easy grader \n"
        },
        {
            "course_name": "Dostoevsky",
            "review_date": "December 31, 1999",
            "review_content": "\nThis is one of the most engaging, brilliant and excited profs i have come across at columbia. She is genuinely passionate about the material and her students. She is very fair and attentive, caring and kind. If you are lucky enough to have a class with her, thank your lucky stars.\nWorkload:\nMidterm and final papers (several topic choices, graded favorably).\n"
        }
    ]
}