{
    "prof_info": [
        {
            "prof_name": "Jess Fenn",
            "prof_id": 9390,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Chaucer's Ventriloquism",
            "review_date": "July 12, 2009",
            "review_content": "\nJess Fenn is a PhD candidate and taught a class on Chaucer this summer (2009).  I'm not sure if she's taught before because I couldn't find anything on culpa about her, but she is one of the best professors I've ever had.  I was thoroughly impressed by her.  Our class was (1) over the summer, (2) at nine o'clock in the morning, (3) three hours long, and (4) full of readings in middle english-- it sounds kind of impossible to get excited about it.  But the syllabus was incredibly well put together.  Not only was there a fair amount of reading for each class (somewhat heavy since it is a summer course that's only 6 weeks long, but never too much and she was always open to suggestions), but the readings were always incredibly complimentary and the sequencing was great.  I actually felt like every reading was worthwhile, helpful, interesting, etc., not a single one felt like busy work or something thrown in because she wasn't sure what to do.  We had to post a short response for every class but they were informal and could be any length, and weren't bad.  In class, the three hours always went remarkably quickly, and she gave us a 15-20 minute break every class.  She was great at facilitating discussion and always brought up really interesting, great points.  I'm an English major but I was not really a fan of the pre-1800 requirement or of Chaucer until Jess (my only other exposure was in high school), but I am so glad that I took this class because I absolutely love him now.  She also really seems to sincerely care about her students and that they are learning something-- she takes great pains to give a lot of feedback about essays, presentations, assignments, etc.  She is not an easy grader but is certainly fair and I think that if you put in the effort you will not be disappointed.  Definitely take this class if you get a chance; she is fantastic!\nWorkload:\nDecent amount of really great readings, 1 short response for each class, 1 short presentation on a medieval manuscript at the Met or the Cloisters, 2 paper presentations (only one is graded), 2 papers (both 5-7 pages).  No exams.  I was taking 2 other classes and working 3 days a week and found it manageable.\n"
        }
    ]
}