{
    "prof_info": [
        {
            "prof_name": "Piero Stanig",
            "prof_id": 2459,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 09, 2005",
            "review_content": "\nPiero has been a fabulous TA.  First of all, he's exceedingly intelligent. He doesn't bullshit responses, and he knows the readings and lectures quite well. He's accessible, interested, and works at the perfect pace in our sessions every week. Sometimes he doesn't seem confident in his knowledge or how interesting he may be.  He's a really intelligent and helpful guy and I would definitely sign up to have him as a TA again. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "May 09, 2005",
            "review_content": "\nPiero has been a fabulous TA.  First of all, he's exceedingly intelligent. He doesn't bullshit responses, and he knows the readings and lectures quite well. He's accessible, interested, and works at the perfect pace in our sessions every week. Sometimes he doesn't seem confident in his knowledge or how interesting he may be.  He's a really intelligent and helpful guy and I would definitely sign up to have him as a TA again. \n"
        },
        {
            "course_name": "Introduction to Comparative Politics",
            "review_date": "February 02, 2005",
            "review_content": "\nPiero was my TA for Intro to Comparative Politics and after the first discussion section, I was already looking forward to our next meeting. He was extremely knowledgeable about everything on the reading list and he did his best to help clarify many of my uncertainties about the course. He really took hold of the subject matter and was very focused on making sure we benefitted as much as possible from every section meeting. I often emailed him with questions and he always responded promptly and politely. Many people would probably agree that initially he seems somewhat arrogant, but donÂ’t be intimidated; after a while youÂ’ll find him to be a genuinely cool, down-to-earth kind of guy. His personality can be characterized by a mixture of brutal honesty and charming wit, making for really engaging and lively atmosphere. The only criticism I have is that he sometimes seemed to be in a hurry, and towards the end of the semester he seemed somewhat burned out. Sections were still informative, but not as upbeat. I imagine that juggling grad school courses and a teaching position simultaneously must be stressful, so I feel it would be imprudent to criticize too harshly. Perhaps under different circumstances those sections would have been more effective. Nonetheless, I would highly recommend taking PieroÂ’s sections because heÂ’s more reliable than most scholars IÂ’ve encountered at here at Columbia and he definitely knows what heÂ’s doing in the classroom. \nWorkload:\nHe expected us to be prepared and on time for all sections. He did not assign any additional assigments independent of Prof. Oldenburg. The workload for the class was relatively light: one pass fail country study, midterm, and final with a take-home essay portion, but that varies depending on professor.\n"
        }
    ]
}