{
    "prof_info": [
        {
            "prof_name": "Andrew Hall",
            "prof_id": 2760,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 06, 2009",
            "review_content": "\nAndrew is awesome. To tell the truth I really hated Lit Hum and I didn't expect CC to be much better. Much to my surprise, however, it was a LOT more enjoyable. Andrew is really into his subject and prepares really well ahead of time to ensure that good ideas are talked about. He is clear, consise, and always gives funny and relevant examples from the modern day. He really enjoys picking out relevant quotes and summarizing key points. If you listen in class and take good notes you will learn a lot and have a good time doing it. He is really personable and will remember all of your names really quickly. Im not much of a humanities buff but Andrew definitely made CC one of my favorite classes. He is a fair grader and during class discussion he doesn't force people to participate but most of the time someone has someone to say. The only thing that you may not like him is that he requires a post about 350 words before every class. However this isn't really even a problem because you don't need to do all of them and if you do you can even score extra credit. He is really keen on having every class so if he cancels you can expect a make up but he is really nice about it and if you miss one or two it should be fin you will lose a few participation points. He is also pretty lenient about deadlines. I remember last semester he extended our final essay basically saying let me know when you want to hand it in. So to sum it all up. He is a) interesting, b) brilliant, c) funny, d) lenient, e) essentially awesome. He is not a professor that just gives everyone As but if you want to learn something and have fun doing it he is awesome. Oh and another thing. Before the midterm and finals he gives you the questions that will be on the test and you can prepare ahead of time. \nWorkload:\n350 word posts before every class (don't have to do all of them and will get extra credit if you do) Class Participation (same with the posts) Two essays (he gives you the questions and a lot of time) Midterm and Final (He gives you the questions on both and he picks some from the sheet and puts them on the test)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 29, 2007",
            "review_content": "\nAndrew's amazing. CC is supposed to change the way you think about the world, but frankly I think Andrew's more responsible for my new outlook than any of the specific texts we read. He's extremely well versed in the texts and knows each one cover-to-cover, but he doesn't pretend to know the definitive interpretation of any of them. He facilitates class discussion, lectures when appropriate, and pours his heart and soul into the class. I generally hate philosophy, but this class was surprisingly pleasant. I'd highly recommend him.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 13, 2007",
            "review_content": "\nAfter talking to my friends from other CC sections, Andrew is pretty much the best CC instructor you could have.  Not only is he good relative to the other sections, he's a great instructor on his own.  He doesn't talk too much, but always leads the discussion, putting in comments to direct it in the direction it needs to go so taht we understand the important points of any text.  At the same time, if a certain topic interests the class greatly, he'd allow for some tangential discussion to get everyone participating, which were sometimes heated debates that everyone learned a lot from.  In terms of papers, he always took time to meet with students to review rough drafts and help them flush out ideas and really make the paper the best it could be.  I personally learned the most from writing these papers which were answers to specific questions, or open ended ones (they were open to your interpretation - assuming Andrew approved.)  And the format for the exams vaired with creativity, almost fun to take.  Ultimately, Andrew made the CC experience a very positive one and it is his CC class that inspired me to minor in Philosophy.\nWorkload:\nVery fair; only about 50 pages of reading per session, weekly response (very fairly graded), 2 short papers (1500-2000 words), midterm and final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2007",
            "review_content": "\nHe's a nice guy and good instructor. He knows his stuff and he purposely assigns less reading than a lot of the other CC professors. Sometimes class can be numbing, but that usually only happens when most of the class has clearly not done the reading and is trying to cover that up. He gives thoughtful feedback on the weekly writing assignments and on the papers, and is willing to meet with you if you need paper advice. I hear he's also pretty generous with extensions. He's a bit strict on attendence though, so make sure you're in class when you need to be.\nWorkload:\n2 papers, a midterm and a noncumulative final (both of which he gave us the questions for ahead of time), weekly writing assignments\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "June 05, 2006",
            "review_content": "\nAndrew Hall is the best teacher I've had in two years at Columbia.  His knowledge and laidback attitude allowed for amazing class-led discussions all year.  He presented us with any extra information we needed each class, and he always had passages to suggest when we couldn't answer one of the topics he brought up.  His grading was generous first semester, but by second semester, he gave out more apropos grades (still mostly As and Bs).  \nAll of his teacher-choice selections were fantastic and helpful.  He made this class very fun, and I'm frankly sadder than I've ever been to see a class end.  If he ever teaches another class at Columbia, I'll be first in line to register.\nWorkload:\n80 pages or so per class with emphasis notes.  Some readings are just recommended. He makes an excellent, straightforward study guide for each midterm/final.   2 papers, 1500 and 2200 words\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 14, 2006",
            "review_content": "\nIf you have Andrew as your lecturer, consider yourself lucky.  He's quite well spoken, a great listener, and much more intelligent than one of these reviewers asserts.  All grading is fair.  He likely has some of the most open class discussions of any CC dude/tte, so if you like to talk, you're doubly lucky.  If you don't, though, don't worry, because, as one reviewer already mentioned, he's good at \"cutting off ramblers.\"  The discussions are perhaps the only flaw: sometimes the essence of the material disintegrated once it hit the floor; in other words, Andrew almost doesn't do enough talking.  Otherwise, though, he's about as good as you're gonna find.\nWorkload:\nQuite reasonable: two papers, one short response assignment a week, midterm, final. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Hall is a very nice and intelligent man. He definately has that new teacher glow and I do not imagine he will loose it any time soon.  He has obviously gained some confidence, though, as he now cracks jokes that poke fun at himself. But, as for the academic stuff, he comes to class well-\nprepared with insightful questions that often fall one after another to lead in interesting directions. He also makes a point to allow people to bring in modern (and even personal) connections to the texts. He really enjoys friendly student debates and often asks students to defend, agree, or disagree with the philosophers, then allows opposing views to make their cases. Yes, this class is hellishly long, but he makes it...dare I say...fun.\nWorkload:\nWeekly response assignments that are graded on \"effort\" (meaning, don't worry; you will be surprised, however, at how much they help your comprehension of the text!), 2 papers (one medium, one longer length), a midterm and final for which he provides a nice set of guiding questions to study. He is a very fair grader and has proven to be flexible with assignment prompts, and class participation (common, is it that hard to say ONE insightful thing in a 2-hour period?)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 12, 2006",
            "review_content": "\nIf there are varying degrees of the middle of the road, Andrew Hall is the most middle-of-the-road.  He's smart, but not brilliant.  Occasionally funny, but by no means a comedian.  He was good at letting the class speak while giving us direction when we needed it.  Also, he was good at keeping his lecturing to a minimum; an especially valuable skill in a 9AM section.  He didn't inspire anyone, but he didn't make anyone want to kill him, either.\nOh, one last thing: his comments on papers I generally felt were lackluster.  It may stem from his not being the brightest, but he also seemed unwilling to allow for creative thought/interpretation, even after encouraging just that on the assignment sheet.\nWorkload:\nWeekly responses; 2 papers (one 10 pgs, one 5); midterm; final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 02, 2006",
            "review_content": "\nExcellent instructor, down to earth, interesting discussions - he lets the students talk at least half of the time, sometimes he dominates discussions, especially when students not participating. Pretty good at cutting off ramblers, but does not hurt anyone's feelings. Very approachable, replies quickly to emails, best damn courseworks site ive ever seen.\nWorkload:\nnot too much - 40-80 pages per class, he also says what to emphasize and what is only recommended. gives list of possible short answers/essays on exams - very straightforward. 2 papers - one 4 pgs, one 7 pgs.\n"
        }
    ]
}