{
    "prof_info": [
        {
            "prof_name": "Caterina Pizzigoni",
            "prof_id": 3066,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "History of Latin American Civilization, Pre-Columbian to 1810",
            "review_date": "December 21, 2016",
            "review_content": "\nCaterina is literally the nicest person on the planet. I read all the other reviews about how amazing she is and how wonderful her class is but somehow I didn't believe them, and went in thinking that this class would be really challenging. It's not. It's a suuuper easy global core, all you have to do is memorize the terms she puts on the board in lecture and be able to recognize some documents and images on the midterm/finals. There are usually two papers, but she took one off this semester (and anyway they're both very short, like 5 pages). Caterina will do anything in her power to raise your grade and make your experience in her class positive. She cares so much about what she's teaching, but she's also extremely reasonable with her requirements and expectations. She understands that people have lives outside her class, and she really takes that into account with the workload. You never have to read the textbook, just go to class. But DO go to class, because literally everything she wants in the exams is in her lectures, so you'll never have to do any outside work if you just go to lecture (you won't even have to study much if you memorize the terms as you go along). She makes an effort to get to know everyone's names (especially if you come to class regularly) and if you participate a little in lecture it makes her day and will definitely boost your grade (usually she discusses a primary source doc for 10 minutes with the class). Also, she's brilliant and her lectures are always fascinating and she gives a great overview of a really crucial historical period. Sometimes she talks a little fast, but you don't really need details, just the broad themes from every lecture, so don't stress about that. Also definitely go to her office hours for any reason, even just to say hi. Basically, if you want a thematic, not-date specific, light workload global core, this is the way to go. And Caterina will make it absolutely a pleasure to attend class and be engaged in the subject. \nWorkload:\nSuper light. The reading for class is primary source documents, usually 1-10 pages (mostly 1 or 2 pages, but some weeks 10). Discussion readings for section are not tested on the exams, so you can skim them or skip them completely depending on if your TA makes you write discussion questions or not. (Technically there's a textbook assignment every week but literally no one does it and it's not necessary at all -- IF you go to lecture.)\nUsually 2 papers, but this time only 1, which was a book review, and she said almost everyone got As\nMidterm and final, the final was way easier than the midterm because people struggled on the midterm so she adjusted the final -- more proof that she wants to help people succeed\n"
        },
        {
            "course_name": "Inidigenous Worlds",
            "review_date": "September 11, 2015",
            "review_content": "\nDr. Pizzigoni is an extremely knowledgable professor and it's obvious that she truly loves her job. Dr. Pizzigoni is one of the few professors at Columbia -- at least in my opinion -- that is prepared every single class. She clearly has a direction that she wants to take the class in and points to make along the way. As a graduate student, I was unsure if I wanted to analyze 'colonial' documents. Walking away from Pizzigoni's class, I have decided to write a thesis using exclusively colonial documents. I do caution graduate students to err on the side of caution with Dr. Pizzigoni when deciding deadlines for final papers as she is not very flexible, despite understanding that graduate students are writing papers in every course (which was really disappointing). Regardless, I highly recommend Dr. Pizzigoni as she really opened doors and changed the way I approach all forms of written history. \nWorkload:\nThe workload depends on the week; some weeks there was very light reading ranging from 30-50 pages. Other weeks has 20-30 pages of very dense colonial documents. My advice is to acquire the books beforehand and plan accordingly. You ARE expected to contribute in class -- even if the comment is literally, \"I thought XYZ was interesting...\" She appreciated all commentary and makes the class comfortable to speak about anything. Wonderful professor. \n"
        },
        {
            "course_name": "History of Latin American Civilization, Pre-Columbian to 1810",
            "review_date": "April 17, 2015",
            "review_content": "\nShe's amazing! She truly wants every single student to understand the material. Yes she has an accent but seriously get over it! We're in NYC a town known for its diversity and people are complaining about an accent? She's very passionate and has visited almost all the sites she speaks about. There are readings you have to do for both the lecture and \"lab\" you have to go to. There are also some written assignments however, they do not have to be formal or try to fix any world issue. She's just looking to see if you read it and understand it. \nWorkload:\nNot a lot of work but it just becomes a bit annoying. Weekly readings ranging from 4 pages to over 40 pages a week but again you can skim it and you'll be fine as she or the TA will go over it. \n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "February 21, 2015",
            "review_content": "\nI took this class my freshman year as a potential chemistry major. Thanks to her, I'm studying Latin American History.\nProfessor Pizzigoni loves what she studies (it's the lives of indigenous peoples in the colonial era in case you were curious) and loves to teach it even more. I wouldn't skip lectures as she doesn't put notes online, but I can't imagine why you would want to in the first place. Her lectures are fascinating, and with her delightful Italian accent she draws you into the material you can't help but gain an interest in. She very much encourages class participation (not an easy feat when lectures have 150+ students), but she fosters such a warm and open atmosphere that it's almost natural to do so. \nAlso of note: she's one of the most approachable professors on campus. She takes an active interest in getting to know her students, and is always ready to help out in any way that she can. She has a playful personality and childlike sense of wonder that is exceedingly rare, but make no mistake she is one of the most intelligent people you will ever meet. I adore her beyond words, she will forever be my favorite professor. \n\nWorkload:\nVery doable. Weekly document readings that are gone over in class, don't skip over these as you will be asked to ID them on the midterm and final. There are two short papers with word limits, and weekly discussion sections with attached readings that can serve as a grade booster if you participate frequently. Textbook readings are assigned, but it's honestly not necessary if you attend class frequently. The midterm is on the first half on the course and consists of document IDs, vocab words, and essays, while the final (which is only over the second half) contains that and art IDs. \nEither way, TAKE THIS CLASS.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "February 04, 2013",
            "review_content": "\nIncredible class. Professor Pizzigoni is inspiring and incredibly enthusiastic. She obviously loves what she studies and loves teaching it. Her lectures are worth going to, they are also necessary for knowing the material since she does not put the information online, however they are never boring since she has an endearing personality and is energetic throughout lectures, constantly moving around. Although it is a large lecture class, she makes an effort to learn names or at least recognize the faces of people who attend lectures and participate. She is very approachable, always open for comments and questions. Sometimes her Italian accent can be a little difficult to understand, but she likes to make fun of it and admit that she has problems with pronunciation, personally I never found it to be much of an issue. As a Latin American and Caribbean Studies major I found the material to be fascinating, however even if the subject matter isn't something you would normally be enthusiastic to learn about, I think that Professor Pizzigoni makes it something that you will begin to take an interest in. If you go to lecture, do the document readings, and participate in discussion, it is an easy and enjoyable class.\nWorkload:\nWeekly document readings (usually only a couple pages) that are discussed in class and on the midterm and final. 2 papers, with strict word count limits, one short and one longer. Participation in discussion is an important part of your grade, and the only burden is that sometimes discussion readings can be very long and dense. Midterm, and final on only the second have of the semester, both are very doable. \n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "January 05, 2013",
            "review_content": "\nJust reiterating what other posters have said in hopes of boosting Caterina to a gold nugget. She's passionate about what she teaches and it shows, very engaging, and makes coming to class a pleasure. It's worth going to class because Caterina is very methodical in the way she lectures and if you attend, you really really do not have to do the readings. Go to class and the only readings you really have to do are the Documents which consist of primary sources that she asks you to ID on the midterm and final. At the beginning of class she also writes down key terms on which you're also tested on the midterm/final (asked to define each term), so write those words down at the beginning of each class and you'll be pretty set for the exams. Also, the final has art/photograph IDs based on pictures she displays on slides in class and discusses. I first heard of these art IDs when we were 3/4 of the way through semester, so I was sort of screwed because I usually tuned out that part of the discussion (didn't think it was important, they were almost always discussed at the end of class, and my concentration was waning), so don't do what I did. Really, moral is GO TO CLASS - Pizzigoni is a fantastic lecturer and it will make your life ten times easier. Grading is done by the TAs, but she will review any grade you want her to. She also sends personalized emails mid-semester to let you know where you stand in the class and signs her emails \"un abrazo,\" which is just so endearing. I did, however, think the TA section was lack-luster (just my TA section, I didn't attend any others for comparison).\nJust going to class regularly and reading the documents will get you a B+. Participating frequently in the TA section will bump you to an A-. You definitely have to put in that extra effort if you want an A, though. \nWorkload:\nThree types of reading assigned per class: textbook, documents, discussion. Textbook is the heaviest reading but you REALLY don't have to do it if you go to class and take good notes (but you will need to if you don't go to class). Discussion texts are discussed during TA sections, and they're a nice supplement, but not totally necessary. Documents are primary source texts which are definitely necessary because you're asked to ID them on the midterm and final. There are between 1-3 Documents per class, each Document rarely exceeding 5 pages. They're interesting reads and easy to do, so not a big deal. \n2 papers, participation (determined by mandatory TA section), midterm, and non-cumulative final determine your grade.\nPapers are about 1200 words each and are graded by the TA. Participation is similarly determined by your TA section (and a worksheet we had to do randomly, which was sort of annoying, but not too burdensome). Midterm consists of Document IDs, definitions, and an essay. Final consists of more Document IDs, definitions, two essays, and art IDs (works of art/photographs are displayed on a ppt slide during class; slides are posted online but are useless if you didn't go to class because there's virtually no text on the slides). Pretty standard. \nPizzigoni is really wonderful! \n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "February 01, 2012",
            "review_content": "\nAs everyone before me has said, Professor Pizzigoni is amazing. She absolutely loves to teach, which shows through in her lectures. She truly cares about her students and even in a large lecture would call people by their names. I don't know how she did this! I disagree that this class is an easy A though. Maybe an easy B+ or A-, but you really have to put in that extra effort to get an A because her grading scale is really different. However, don't let this discourage you from taking her class. If you go to the lectures and pay attention to what she says, in her lovely Italian accent, you'll be fine. The papers were graded a bit harshly, but you can easily get an A- on them last minute if you've been paying attention in class. THE FINAL IS NOT CUMULATIVE!!!\nWorkload:\nNot much outside of class: skim through book readings and read the documents; 2 1100 word essays; a midterm and a non-cumulative final. Really not bad\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "December 31, 2011",
            "review_content": "\nCaterina is absolutely fantastic. I'm a senior history major and took this class as an afterthought to double as a global core and my last breadth requirement. I ended up loving it. Caterina is perhaps the most endearing professor I've had and my only regret is that I could not have her more to myself, as in a seminar-type setting. I agree with the previous reviewer: there is a kind of curiosity and enthusiasm that just radiates from her and infects you. She really cares and is extremely fair. She also appreciates students' input and tries to encourage student discussion whenever feasible (admittedly difficult in a room with 100+ students). I can't think of a more approachable history professor.\nThe course has one core text, from which 15-25 pages were assigned each week. At no point did we discuss these readings in lecture or sections, but I found them helpful to review and go a bit deeper than the lectures. We also had to review a short book for the first paper (really easy and the only other required book). In addition, there was one primary-source document (2-5 pages, to be discussed during lecture) per lecture and 2-3 articles per week. For the exams, only documents and the lectures are necessary to know, but the articles are helpful. There is only one small aspect of the course I did not especially like, and that was that for the exams, you need to know the who/where/when for the documents. I found Foner's approach to documents on his exams to be a little fairer, namely, suggest a plausible who/where/when and justify your answer. That's a minor detail though, and only counts for a small portion of one element of the overall grade. \n\nWorkload:\nOn the lighter side for a history course, but not inconsiderable. Manageable weekly readings, two review essays (4-5 pgs.), one easy midterm and a fair final. Attendance and participation in sections weighted heavily (I think 20%). She will not give out an A+, but an A is easily attainable.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "December 22, 2011",
            "review_content": "\nTAKE CATERINA PIZZIGONI.\nI'm a first year and prospective history major, and Caterina was the person who made my first semester at Columbia. She has a great sense of humor and a timid nature, but under her innocent and playful veneer is an incredibly intelligent and remarkable individual.\nLectures were interesting and engaging. Even the driest material was brought to life by Caterina's style.\nIf you come to lecture, she will get to know your name (among around 130 students), and when you see her on the street or around campus, she'll make a point of talking to you about life and your classes. \nWow. I'm going to miss this class.\nWorkload:\nLots of reading that you really don't have to do. I read the textbook reading maybe once or twice during the semester and probably will be pulling out of the class with an A. If you pay attention during lectures, review your notes thoroughly, and study the documents for the exam, you'll be fine. I rarely did the weekly discussion readings, but it definitely helps to do so for participation purposes. TAs determine your grades, but Caterina takes an interest in every individual's performance.\nIf you're not familiar with the history department, be warned: 91 to 95 is an A- and 96 to 100 is an A. However, Caterina is really fair, and it is possible to get grades as high as a 99 on papers and exams.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "December 09, 2011",
            "review_content": "\nShe is my favorite professor ever and I'm a junior at this school. She has a sense of innocence and curiosity that is extremely rare. She never gives off a hint of pretentiousness yet she is extremely knowledgable on the subject matter. I took Latin American Civilization as aglobal core requirement because I had to, but by the end of the semester, through her amazing lectures, I fell in love with the subject.\nI am in love with her. Everything about her. She is the greatest. She is beautiful in every sense of the word. I adore her. I will never forget her.\nShe almost cried during the last lecture because of how much she loved teaching us, and we in turn almost did too. \nTruly a diamond in the rough. \nThey need to create a diamond nugget just for her.\n\nWorkload:\nLots of reading, discussion section once a week, she is so fair it's not even funny. She is the most reasonable professor I've ever had at this school in terms of grading. She will truly give you what you deserve, if not better. \n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "June 16, 2011",
            "review_content": "\nI took Latin American Civ I Fall semester 2010 thinking it would be an interesting Global Core requirement, and someone suggested Pizzigoni. She is absolutely wonderful! She comes to class with a slideshow that is very detailed and a good reflection of the material learned/read. She doesnt just read out a prepared lecture to the class, she truly tries to explain everything and her passion shows through in the class. Although the class is a lecture she asks questions and tries to engage students as much as possible. Also the TAs were good (in my opinion)\nWorkload:\nALOT of reading, you can get away with not reading the book (dont buy it), but you have to read a couple documents before every class, and some long documents for the discussion section (but you can get away without reading those since its not on the exams). There is one book review, a midterm and final that has document identification, short essays and something else I cant remember but it was all super easy. \n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "May 12, 2011",
            "review_content": "\nWhere is Caterina Pizzigoni's Golden Nugget? I took her Latin American Civilization class and her seminar on Nahuatl culture. In one semester, we were reading the Nahuatl language, or what many people would label the Aztec language. Caterina is by far the most compassionate historian and teacher I've ever met. While taking her class, my mind was on an incredible journey. I had several epiphanies learning about the people of Mexico and did not want to return my library books at the end of the semester. \nI have never been so sad to see a class end. Caterina loves what does, and it shines through her. She is both a great historian and a great professor. In my experience at Columbia, you don't always get both, a person who publishes many books doesn't always make them a great professor. Caterina is both, I used her book Testaments of Toluca when writing my research paper and found it to be a fascinating topic.\nI will never forget how much this class did for my mind and my soul. In the end, we all become a part of history, what other reason is there to study history but to connect to the people who are no more and apply these lessons in our own time. Many thanks to the History department for choosing some one like Caterina Pizzigoni, I will never forget her. \nWorkload:\nIf you work hard, you will do well. This is a no brainer. If you want a great teacher who cares about history, as well as her living students, go with Caterina.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "March 28, 2009",
            "review_content": "\nCaterina is a great professor--she was very available and friendly (always encouraging us to come to office hours), she's extremely knowledgeable about the material, and unlike previous reviewers I usually didn't have any trouble understanding her.  This is definitely a good class to fulfill major cultures, since 50% of the class got some kind of an A.  \nHOWEVER: choose your TA wisely, since whoever you get will completely determine your grade.  My TA (Omar Sarwar) was absurdly pretentious, and always seemed annoyed at having to put up with our lowly non-PhD-level comments/questions/papers.  For a class that's mostly major cultures kids, he graded way too harshly--I had friends in other sections who said most of their section got A's on the papers, and very few people in mine did.  \nThis could all be solved by making sure the grades across sections are normalized, but I don't think they were.  Please fix this!!  \nMy other complaint is that sections weren't used to review/clarify lecture material, which would have been actually useful since Caterina covers a ton of material, so it's easy to miss some facts here and there.  Instead, we had to do a few hundred extra pages of reading each week (my stack of printouts is about 3 inches tall, and I'm definitely missing some) that were related to the course material, but didn't make anything easier to understand. \nOverall, the material is interesting, and Caterina is great, but make sure you get a good/easy TA! \n\nWorkload:\nModerate.  Textbook readings which aren't strictly necessary, but will help clarify material that Caterina covers at warp speed, and a few hours of additional reading for section (and one discussion leader stint).  Reasonably graded midterm/final (make sure to give EXTENSIVE definitions on the IDs), and a 5-6 page book report and film report of the same length. Tests/papers/section are all 20%.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "December 21, 2008",
            "review_content": "\nI decided to take this class in partial fulfillment of my Major Cultures requirement, largely based on the very positive reviews I saw on CULPA.  After doing so, I can only conclude that these reviews were written by a few disturbed individuals or that Professor Pizzigoni wrote them herself--I cannot otherwise account for their astonishing lack of accuracy.\nLet me provide a couple of personal details about myself.  I am a senior, a history major, and a native English speaker.  I was let down by Professor Pizzigoni in each of these capacities.\nAs a senior, this was the worst class I have taken in three-and-a-half semesters at Columbia, without a doubt.  The lectures were unspeakably dull, the textbook was beyond poorly written (hint: it's a bad sign when your writing style is less comprehensible than Hegel's), and the class actually made me like history less.\nProfessor Pizzigoni is extremely difficult to understand while she is lecturing, and many of the choices she made in teaching the course were incomprehensible as well.  For example, 20% of our grade was our participation in our weekly section with the TAs.  In these sections we did not review the poorly presented material from lectures or attempt to decode the textbook's jargon, which as a history major, I can say is inexplicable.  Instead, students had to do presentations on the additional readings assignments we were given for these sections (about 200 pp/week) which were not tested on either the midterm or the final.  The amount of material these TAs were teaching was equivalent to the amount the professor was (supposedly) teaching.\nNor are these the words of a poorly graded malcontent; I will get an A in the class, almost certainly, and when I looked around at the extremely poorly attended lectures, two in three students were either sleeping or holding conversations with their friends while the professor was lecturing.\n"
        },
        {
            "course_name": "Gender and Sexualities in Colonial Latin America",
            "review_date": "April 30, 2007",
            "review_content": "\nI love this woman! This was a seminar class and she did a great job of balancing discussion with making sure major themes were covered and us getting the most out of the readings. She is so nice and approachable that her classroom is an environment where you want to talk and keep talking. She really knows A LOT about Latin America and is always wanting to know more. She relates with students very well and is quite available outside of class. She really cares about her students and it shows in her prompt and warm responds to e-mails and willingness to help. She is the type of professor you WANT to write papers for because there is such a level of mutual repect in her classroom. If you are at all interested in Latin America this woman cannot be missed.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "February 28, 2007",
            "review_content": "\nI highly disagree with the last review. Caterina is an AMAZING professor, genuinely interested in teaching her subject to her students. It's hard to find such enthusiastic professors nowadays and I hope that she doesn't change anytime soon.\nBasically she just needs to keep up the good work. The lectures are amazingly interesting and she clearly prepares a LOT for them. And she's even fluent in Nahua - an indigenous language from Guatemela and with that she's able to provide us with wildly varying and novel perspectives on Latin American history that at least I hadn't thought of before. \nThe books are great, the lectures are great, the workload is manageable. \nmake sure you get carlos as a TA \n\nWorkload:\nVERY MANAGEABLE. midterm/final (questions practically given out before) just go to lecture and you'll be fine!!! you don't have to do all the readings but if you go to all the lectures you should get an A. \nbook review papers are easy. i recommend that she maybe do a different sort of thing next semester. maybe a paper working with primary documents instead???\nanyway very mangeable\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "February 01, 2007",
            "review_content": "\nAmazing professor. Extremely knowledgeable. Great lecturer. Young, Italian, smart, good-looking. what more could you want from Columbia. She's also very accessible during office hours. I greatly recommend her. this is a great course taught by what I feel will one day be one of our \"famous\" cc profs like sachs and phelps. \nWorkload:\nreasonable. two 7 page book reviews. lots of reading (But you don't have to do it - just listen up in lecture), EASY midterm and final! - in these cases you should brush up on th readings \n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "January 14, 2007",
            "review_content": "\nHint: you know the class is not going to be hard when the teacher signs her emails with \"big hugs!\"\nThis is a good class to fulfill the major cultures requirement with if you don't want to do much work and don't mind being occasionally bored.  Make sure you're interested in the material, though: I didn't realize the class only went up to the year 1800 or so, meaning that all you learn about is the colonization and early development of Latin America (and the destruction of the Native American empires).  If you're at all interested, then take the class: the lectures are okay (not great), the required reading is light, and don't waste your time doing the extra reading (in fact you don't really need most of the required reading, just the primary source documents).\nPlus: no research papers!  Just two \"book reviews\" which take almost no thought at all.  And the grading in the end is pretty light.\nIf you have no interest at all in the material, then you shouldn't take the course, since you'll be bored and frustrated as very little of it applies to modern day Latin America.\nWorkload:\nMidterm and final (easy).  Required 50 minute recitation that will give you clearer notes than you'll get out of class.  Two book reviews (one book is good, the other is incredibly boring), 4-5 pages, where you read  the book and summarize (right there is a B+ grade minimum) and then analyze a bit and maybe throw in a common theme.  People did poorly on the first one because they didn't read the instructions for the assignment.\n"
        },
        {
            "course_name": "Latin American Civilization II",
            "review_date": "January 09, 2007",
            "review_content": "\nCaterina is wonderful!  She is new this year from Italy and isn't used to the system so the class was disorganized but her animated and engaging lectures more than make up for having to stakeout on the reading assignments (there are A LOT) on Courseworks.  While undoubtedly scatterbrained, Caterina is extremely knowledgeable and knows what she's talking about.  Besides, the absentmindedness is endearing rather than an annoyance.  Take any class with her if you get the chance.  She's very interested in both what she teaches and her students' view.\nWorkload:\nCore text and tons of documents but most people don't end up doing all the reading becuase her lectures cover most of the text material.  Go to class though because the lectures are where you really learn.\n"
        },
        {
            "course_name": "Early Latin America",
            "review_date": "December 17, 2006",
            "review_content": "\nShe can read Nahuatl, she makes the indigenous people of Peru and Mexico exciting. You can go into her lecture exhausted and go out exhilarated. she obviously prepares a ton for lecture: they directly correspond to the readings, and she makes sure they are organized. She's self-deprecating about being Italian and having to work in English. It was an awesome class, she was more about themes than dates and specific names. Examples of the themes in individual case studies are stressed in the class. Plus, she actually uses interesting art and photos for lecture. \nYou might not want to take her, though, if you love European history; she admits that it's not her field, and tends to gloss over European events that are probably important...like Napoleon.\nWorkload:\nlight, 2 papers (book reports), midterm and final. Grading depends on your TA, mine was hesitant to give anything above A- (and also anything below b+). Weekly readings from a textbook, additional (but required) readings, and primary sources...you don't need to read the text, she gives a really good overview of it. Selections from primary sources are put on the test; stay on top of them. The additional reading is kind of optional; they help you debate/ flesh out the material from lectures but are not necessary.\n"
        }
    ]
}