{
    "prof_info": [
        {
            "prof_name": "Angelina Craig-Florez",
            "prof_id": 6349,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "May 04, 2015",
            "review_content": "\nDO NOT take this course if: \n1. You are not interested in either art or history. The class contains both in-depth discussions on artists and their artwork, and lengthy readings about the history of Spain. The readings are assigned in each class, and the Professor expects students to make outlines on them (though she doesn't usually check if you have). She hands out sheets in class with questions and students are expected to be able to regurgitate information learned in the (way above vocabulary level, especially if you are not a native speaker or have not spoken Spanish in a while) readings. This was definitely the wrong choice for me, a person for whom the only thing worse than history is art history. \n2. You have not spoken Spanish in a while. I had not spoken Spanish regularly for over 6 months prior to taking the class, and had forgotten a lot of my grammatical and vocabulary skills. The Professor is not forgiving about this at all, and on top of not allowing any English in the classroom (expected for a 3300 level class, so this isn't really a problem), she refuses to review vocabulary or grammar and gives major side-eye when asked to provide a word if a student has simply forgotten it. Additionally, at the beginning of the class, she makes explicit that she will not teach grammar; students are expected to do additional work outside of class if they wish to learn about grammar, as if we are not already taking four or five other classes at an Ivy League University. \n3. You don't like to speak in class. The Professor expects students to speak up and speak often; speaking once or twice every couple of classes definitely doesn't cut it. She expects students to speak at least once during every class, so do that. She also requires that students do multiple oral presentations throughout the semester. \n4. You enjoy clear due dates and organization. The Professor does an extremely poor job of clarifying due dates for each essay, and does not warn students when they are coming up either via CourseWorks or in class. She expects students to be constantly checking the syllabus, which she often does not follow anyway. \n5. You like to cite other sources in your research papers. She has very high expectations for student analysis and learning in the class, and does not like to see students citing frequently in their papers. \nPros: she is very understanding if you need to turn something in late, and makes herself available and keeps in touch. \nCons: (other than what was stated above) she can develop a grudge against a particular student if she feels that he/she is not performing satisfactorily \nWorkload:\n6 short essays (2 pages approximately), 2 short oral presentations (~2 minutes), 1 longer oral presentation (~10 minutes)\n8 page research paper that is turned into an iBook and then published \n"
        },
        {
            "course_name": "Spanish 1201 - Comprehensive Beginner's Spanish",
            "review_date": "January 03, 2015",
            "review_content": "\nDefinitely take this class if you are somewhat familiar with Spanish and want to complete the language requirement quickly! It is a fun class and enjoyable class Angelina really cares about her students. \nHere are a couple things to note:\n1. DO NOT SPEAK ENGLISH IN CLASS.\n2. Go above and beyond when writing your compositions. She will give you a rubric showing where you need to improve and will make corrections on your essays and will assign a letter grade for herself, but she will not give you a letter grade on your drafts. If you make all of the corrections, she will bump the grade she has in mind up a tad but not much, so it is just best to give it your all when writing the draft.\n3. The class is mostly spent going over SAM and learning conversational Spanish. You are pretty much on your own for learning grammar.\n\nWorkload:\nAbout an hour of SAM (online homework) + Workbook Homework every class.\n3 Composition Assignments \n1 Final Project (Composition + Oral Presentation)\n1 Oral Exam\nMidterm and Final\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "January 02, 2015",
            "review_content": "\nShe is absolutely wonderful.  Not only is Prof. Craig-Florez extremely competent and effective at teaching, she is also very warm and cares about her students.  I came into this class with zero spanish skills and felt really worried and down the first couple of weeks.  The class seems to be geared towards students that have some basic skills in the language already, so if you're new it can be really intimidating and intense.  The texts for the class are almost entirely in spanish, so doing homework can take a really long time since you have to translate all of it.  My heart sank and I would sit in class with the dear in headlights look and a tummy ache, but she made me feel at ease and assured me that with practice I would be ok.  I wish I would've utilized her office hours as I'm sure it would've made life easier.  \nProf. Craig-Florez is very organized and keeps a fast pace, but slows it down for tougher concepts.  You'll need to get over any insecurity of speaking spanish in front of others as there's a lot of group exercises, but it was funny sometimes.  We had some laughs throughout the semester.  She's also a very fair grader and willing to work with you if you get sick and need to make up for something.  Make the effort and you will do well in this class.  \nI was crushed to find she doesn't teach elementary II.  I'd take her for every section if I could.  If you're a \"true beginner\" as she has called me, take her class.  If you're not, take her class.  She's awesome!\n\nWorkload:\nHomework for every class in myspanish lab and/or worksheets.  3 short writing assignments, fair midterm exam, final project, oral exam, fair final exam. \n"
        },
        {
            "course_name": "Comprehensive Beginning Spanish",
            "review_date": "May 25, 2014",
            "review_content": "\nProfessor Craig-Florez is a real gem. She is one of the kindest teachers I have had at this university, and it was clear from the beginning of the semester how much she wanted her students to learn and succeed. Part of her method of teaching the language was very practical, focusing on conversational comfort and fluency. \nIn her class, if you put in the effort to be on top of the assignments and lessons, it was not difficult to learn and do well - especially if you were actually engaged with the material and showed any sort of enthusiasm for the language or culture. \nLike the other reviews below, it was true that we spent a lot of class time doing exercises from the book, but I found this to be helpful in really understanding concepts as she was actively helping us throughout.\nAll in all, wonderful teacher and wonderful woman. If you do the work assigned and participate in class, it's very easy to receive a good grade and learn a lot.\nWorkload:\nVery fair for an intensive language class - daily exercises (very small), 4 short essays, one fairly large final project with an oral presentation. Midterm, final, and oral exam were all very reasonable.\n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "December 10, 2013",
            "review_content": "\nI took Spain Through Art with her and really enjoyed it. I switched in from a different section of W3300 and definitely made the right choice. If you are already familiar with Spanish Art History, this will be a review for you, but the goal of the class is practicing Spanish, not delving deep into art history.   We were assigned museum visits, which are lots of fun. I probably wouldn't have gone to the Hispanic Society of America on my own, and I am so glad I did--it's now one of my favorite places in New York. The Sorolla Room is incredible. \nThe main issue I had with this class was the frequency with which other students lapsed into English, and the degree to which the professor tolerated this and responded in English. About half the students really should not have been there, as they did not speak enough Spanish to participate in class discussions without constantly using English. The issue lies mostly with the students, of course, but I guess just be prepared for frustration if you take any section of W3300 expecting that the majority of the class will avoid using English.  \nThe professor was very understanding about lateness and makeups. She allowed me to turn in a revised draft of a composition wayyyy after the due date when I asked her politely, which I really appreciated. She is also a very fair grader.\nWorkload:\nVery reasonable. Readings assigned every class, but we usually went over them together anyway. Three compositions and a final presentation/essay on a topic of our choosing. No exams. \n"
        },
        {
            "course_name": "Comprehensive Beginning Spanish",
            "review_date": "November 03, 2013",
            "review_content": "\nI would not recommend taking Comprehensive Beginning Spanish with Craig-Florez.  She is a push over and it is pretty easy to get a good grade in her class, but it will be the most boring 4 hours of your week for the entire semester.  She doesn't ever prepare for class, just picks random exercises out of the textbook.  Basically, you have to teach yourself everything because class is a total waste of time.  Don't bother going to her office hours because she is unhelpful and rude.  Basically, Craig-Florez doesn't do anything for her class that requires extra time or work.  The Spanish department is huge...find somebody else.  \n\nWorkload:\nDaily textbook assignments (short, don't have to do them) plus MSL (takes some time), a few compositions, midterm and final.  Not bad.  \n"
        },
        {
            "course_name": "Comprehensive Beginning Spanish",
            "review_date": "January 29, 2013",
            "review_content": "\nProfessor Craig-Florez is a GREAT teacher. She is incredibly friendly and welcoming, so sweet. But also a really great teacher who encouraged everyone to talk in class and wasn't afraid to laugh a bit. It was my first semester taking Spanish and I definitely learned a lot. \nMy only real criticism is that in the beginning we went suuuuuper slowly over vocabulary and then sped through the grammar at the end - which was significantly harder than vocab.\nWorkload:\nTotally reasonable midterm, final, and oral. Project and ~3 writing assignments. + daily homework and class participation.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 16, 2011",
            "review_content": "\nProfessor Craig-Florez was one of the nicest professors I've had, but also one of the most ineffective. Everything she did was simply regurgitated from the the textbook. If participation wasn't such a big part of the grade I probably would not have bothered to go to class. If you want an easy grade and are just trying to get through the language requirement I highly recommend Craig-Florez, however, if you actually would like to learn Spanish, I suggest finding another professor.\nWorkload:\nSporadic homework, a lot of in class worksheets, 3 movies, 3 essays, powerpoint project, midterm, final\n"
        },
        {
            "course_name": "Spanish 3300",
            "review_date": "December 21, 2010",
            "review_content": "\n  I think that the department has better professors that Craig-Florez.  She seems to favor the hispanic speakers and seems impatient when the non-native ones butcher the language.  I, a non-native speaker, know for a fact that I worked harder than most of the students in the class and doubt that my grades will show that.  We did a lot of group work and when everything was natural to the native speakers, it become obvious that there was a gap between my skillset and theirs.  Usually, the teachers acknoledge that in 3000 level courses everyone is on a different level and are graded accordingly- not in this class.  As a result, I did not feel confident speaking in class, and I know that my participation grade suffered.  When I went to her office hours she was not very pleasant in assisting me with essays (she refused to go over grammar with me) and instead told me to get a tutor or do a whole bunch of extra grammar work on my own as if I am not enrolled in 5 other classes.\nThe class itself was fascinating if you love art, but the pain of the ridiculous amount of reading and assignments may not be worth it. \nWorkload:\nAt least 10 pages of reading in spanish for every class (average of about 20 pages) 8 essays ranging in length, an oral presentation, and a final 5-7 page paper.  Sheesh.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 19, 2010",
            "review_content": "\nGreat professor. Very nice lady, extremely accomodating.  Very generous with turning in late work, tardies, and absenses.  Good teacher!  i probably should have failed this course, but i got a B-. The only thing i would be cautious about is her FREQUENT worksheets and excercises almost each class, they are not graded but they do count towards participation.  these exercises included everything from grammar worksheets to reading poetry and even renting and watching spanish movies.  the group project is easy, interview someone from a spanish speaking country, and make a powerpoint about the interview and basic wikipedia info about the country.\nWorkload:\n3-4 two page essays.  workbook excercises that are collected at the midterm and final.  mid-term and final, per the department standards.  1 \"project\" powerpoint on a country you research (EASY).  lots of exercises along the way, constant print outs and worksheets that are required for in-class participation.\n"
        },
        {
            "course_name": "Spanish 3300",
            "review_date": "December 25, 2009",
            "review_content": "\nI took Spain Through Its Art with her and i loved it. We had to visit museums and it was a great way to get introduced to New York City, especially if you are a freshman. This class is amazing. Angelina Craig-Florez is really enthusiastic about the subject and she leads the class with ease and entertainment. She helps you build a better vocabulary and to improve your pronunciation effortlessly. Angelina, being a native spaniard, really provides a passion for spanish art and culture. I thought she was funny and really gave a lot of freedom when it came to homework. I forgot about a paper and she simply told me to turn it in the next class. \n\nWorkload:\nNot bad. I thought it was manageable. She's a fair grader and if you try hard she'll notice and give you credit for it. \n"
        }
    ]
}