{
    "prof_info": [
        {
            "prof_name": "Alexandra Sears",
            "prof_id": 11043,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Beginning Fiction Workshop",
            "review_date": "December 20, 2010",
            "review_content": "\nDespite the fact that this was Alex's first time teaching, the semester was a fruitful one and on par with the other workshops I've taken at Columbia. While Alex's inexperience showed through at times, especially when she was unable to reel in quirky, but long-winded student's from derailing critiques with discussions about theoretical stab-wounds, I didn't find it to be at all detrimental. In fact, I thought that her inexperience worked in her favor, making her more of a humble and down-to-earth professor. This gave critiques an air of peer-to-peer camaraderie and took away the added pressure of having a professor-overseer that one had to look good in front of. That's also not to say that she completely blended in and become one of us. She consistently made the most insightful comments, clearly read our stories thoroughly, and showed off her expertise with clear and cutting suggestions as to how to make our stories better. Furthermore, the short exercise assignments were tactfully chosen. With some of them, I groaned at first, but after putting in some honest effort, I was able to figure out the rationale behind them. They did a good job of creatively challenging us to write outside of our preferred comfort zones. If you have a chance to have Alex as your teacher, I highly recommend that you take it. She is caring, thoughtful, kind, funny, and understanding. The lady seems to channel an unquenchable supply of enthusiasm and positive vibes, and gives truly useful encouragement--caring enough to make you feel like your writing matters, but critical enough to show that she's not just shining you on. A total gem of a prof!\n\nWorkload:\n2 short stories, critiques and critique letters every week,  a handful of short exercises, and another handful of short stories for discussion. Manageable and fair. \n"
        }
    ]
}