{
    "prof_info": [
        {
            "prof_name": "Arvid Lukauskas",
            "prof_id": 580,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "US Foreign Economic Policy",
            "review_date": "April 11, 2001",
            "review_content": "\nWhat makes this class dull by virtue of subject matter, the professor makes up for with a quirky sense of humor that, unfortunately, doesn't get unleashed until well into the semester. No real knowledge of econ. necessary although principles is quite helpful. The readings are somewhat extensive (not by poli-sci standards, though) but he goes over the important ones in class (read: he holds your hand!). He'll put an outline on the board every other lecture and usually starts class with a relevant article from the Financial or New York Times. If you enjoyed the political economy section of into. International, you'll most likely enjoy this class. I wouldn't take it as my first poli-sci class.\nWorkload:\n2 in-class midterms (he even hands out a study sheet b4 each exam!), take-home final, optional 10 pg. research paper, optional section (not really necessary, although the TA's are good email contacts for questions) \n"
        },
        {
            "course_name": "US Foreign Economic Policy",
            "review_date": "April 08, 2001",
            "review_content": "\nWhile it might be hard to make economic policy funny, Lukauskas takes a very dry humor approach to his teaching and brings the subject to new levels. He really incorporates current events into lecture, opening each day with a news tidbit, and often opens the class, some 80+ people, to a discussion. He's not overly knowledegable about specific case study examples, but explains the substantive material very well, always repeating for those who struggle to write down everything he says. Good board writer (gives outlines), heavily incorporates authors' arguments into his lectures. Exams are graded by TAs. In general, a very pleasing, not too difficult course (if you're into the subject material).\nWorkload:\nTwo midterm exams, take-home final, and the option of a 10-page paper to boost your grade. There's a lot of reading, but as for the substance, if you go to all the lectures and use your notes in your essays, backing it up with some \"name-dropping\" of the reading assignments, you'll be fine.\n"
        }
    ]
}