{
    "prof_info": [
        {
            "prof_name": "Gil Zussman",
            "prof_id": 4210,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Wireless and Mobile Networking I",
            "review_date": "December 18, 2012",
            "review_content": "\nI actually took semester 2 of this course, semester 1 isn't a pre req though. \nActually a very good professor with well planned lectures and gives assignments that are relevant to his class. I really have no issues with him at all. Between him and the TA all questions were answered quickly and if you learn from your homeworks and pay attention to the material presented in the guest lectures the mid term isn't too bad. \nThe labs are interesting, and when they screwed up on the setup for a lab they understood and accomodated those that wanted to do the lab and those that didn't for time restraints very fairly. \nI'd take a class with him again. Jelena was a great TA as well! \n\nWorkload:\nThe workload was a bit compressed but that is only because I took it over the summer. I'd gladly take a course with Gil again. \n"
        },
        {
            "course_name": "Computer Networks",
            "review_date": "April 05, 2010",
            "review_content": "\nProf Zussman is a very smart professor with a lot of background in Networking. His lectures are very well planned (granted the slides are from the publisher). The lectures are good if you are at all interesting in networking and general informative.\nThe lectures are planned so well that any student asking a more advanced question or trying to correct the professor is faced with a sharp reply from the professor.\nThe book does a good job of giving a implementation and high level view of networking, but that is not enough for this course. Gil likes to bring his research of statistics into the classroom and sometimes supplements the book for his slides he created while at MIT. They are full of statistics and other advanced topics which are asked on most of the homeworks.\nThe statistics which are briefly discussed in class are a large portion of the homework and exams.\nThe programming assignments were time consuming, but pretty simple if you have used threads and sockets before. You can use C or JAVA.\nWorkload:\nAssignments: 6-7 written homework assignments\n2 mid-sized programming assignments\nMid Term : 75 min. during class hours, calculator and one sided letter paper with notes allowed.\nFinal: Dec. 21, 9AM, 180 minutes, calculator and one sided letter paper with notes allowed, comprehensive.\nMethod of Evaluation\nAssignments 30%\nMidterm 25%\nFinal 45%\n"
        }
    ]
}