{
    "prof_info": [
        {
            "prof_name": "Yinon Cohen",
            "prof_id": 5591,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Immigration and Ethnicity in Israel",
            "review_date": "March 11, 2015",
            "review_content": "\nI actually LOVE Professor Cohen. I will admit what the other 2 reviews said about knowing background information on Israel is true and important, but you certainly don't need to be an expert on the region. Professor Cohen caters towards those with a real interest in internal Israeli politics and issues and he is certainly opinionated and has an Israeli attitude. However, he can be quite hilarious. The readings were very interesting, very readable. His class is pretty chill, as are the assignments. It is easy to do well. I learned a lot from him and found class discussions to be very valuable. He doesn't want you to memorize statistics and figures, but rather he wants you to get a larger picture and be knowledgable enough to have discussions about particular issues. Don't take this class if you have no interest in Israel. With minimal effort, this class is an easy A.\nWorkload:\nThree 2 page papers, 1 final paper 10-15 pages\n"
        },
        {
            "course_name": "Immigration &  Ethnicity in Israel",
            "review_date": "January 18, 2015",
            "review_content": "\nOh god, this class and this professor were awful. I couldn't agree more with the reviewer below me. This class was first of all so incredibly boring; he took the least interesting aspects of studying Israel and turned it into a course. The readings were average length but just so incredibly boring. I only read them when I had to write a paper for them. Professor Cohen is just not a nice person at all. Every time I emailed him with a question or approached him after class, he was always so unnecessarily snide. He's really just an unkind person and shuts down any opinions that contradict his, which is probably because a large part of the readings we had were his own or his colleagues'. The way he speaks to his students both in private and in class is nasty and he seems to have no passion for teaching at all. He puts up the same powerpoint every class and goes off on tangents about uninteresting and irrelevant things. Like the previous commenter mentioned, he expects you to know a great deal about the subject of the class before you take it, so if you have no background in the topic of the class, I would either be prepared to read a few books on the topic or choose another class. I would strongly recommend the latter. \nMaybe it was because this isn't my area of study, and I only took this class pass/fail for pleasure because I thought it would be interesting especially in light of the Israeli/Palestinian conflict, but I thought this class and the readings were mind numbingly boring. \nWorkload:\nAverage length of readings per week, three 2-page reading response papers due by the end of the semester, no midterm or final but a 15-20 page term paper on a topic of your choice, but must be related to Israel in some way. \n"
        },
        {
            "course_name": "Israeli Society",
            "review_date": "May 24, 2009",
            "review_content": "\nProfessor Cohen is a horrible professor. He expects you to know everything about the course before you take it, is difficult to approach, biased on the Israeli/Palestinian conflict and is open about this, unkind, and does not know what it means to teach. He would go off on tangents all the time and shut down anyone who had an opinion other than his own. \nWorkload:\n69-90 pages of reading each CLASS, one midterm, and one horribly defined final.\n"
        }
    ]
}