{
    "prof_info": [
        {
            "prof_name": "Alenka Copic",
            "prof_id": 9888,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 07, 2011",
            "review_content": "\nAlenka is, like the previous reviews stated, a fair FOS instructor. She really tries to initiate discussion, but only a few people ever spoke up, so she occasionally had to force people to contribute to the conversation.  She is very kind, but not very helpful.  I feel like she expects her students to know a lot coming in to the course, so if math and science aren't your strong suits, you might have difficulty as she tends to answer questions with more questions and never really gives a straight answer.  She grades very fairly (I got an A on the midterm and I hardly did the readings).  GO TO LECTURE.  That is my only advice for this class.  The lectures can be boring, but you can always sleep through the less interesting parts.\nWorkload:\nWIAs due each Friday, 4 quizzes, midterm, final, and the research paper.  She really does NOT do a good job explaining what she wants you to do for the research paper.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "November 13, 2010",
            "review_content": "\nAlenka isn't the best Frontiers teacher out there, but she's O.K.  She basically goes over whatever you learned in the lecture during the week's seminar.  She sometimes has difficulty relating to students.  When I told her I was having a hard time understanding a certain section, she didn't really ever comprehend why I would ever have a hard time with it.  We don't discuss the reading often, but sometimes they're on the quizzes so that's worth a thought.  She gives a lot of extra credit work though, so that's always helpful.\nWorkload:\nWeekly WIAs, 4 quizzes (one for each unit), weekly readings, midterm and final.  Extra credit work usually consists of going to museums and writing reviews.  \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 15, 2009",
            "review_content": "\nAlenka is a fine FOS discussion section leader, but I question whether she could teach any other class where the curriculum wasn't spelled out word for word like the curriculum of Frontiers.  Her ability to solicit class participation was very lacking.  The students who wanted to gain a few participation points would speak up and those who were not as concerned for their grade would sit in the back and never say a word.  No one, however, really cared about what we were talking about.  I'm not sure if that's a failure on the part of our teacher or the course itself, but it is the main critique I have.  I simply was never engaged by Alenka or made to care about what I was learning.  On the third lecture Alenka walked in with a new MacBook Pro saying, \"This is what I get for teaching this course.\"  I think her statement sums up our discussion section nicely.  No one really wants to be there, and, while Alenka is happy to help you, her heart just isn't in it.  Other than that, I think Alenka is a fair grader and definitely knowledgeable enough about all the subjects in Frontiers that she was able to answer all my questions.\nWorkload:\nStandard FOS stuff:\nWeekly WIA's which are graded for completion only\n4 Quizzes (one for each section in Frontiers) which go into your participation grade\nMidterm\nFinal\n"
        }
    ]
}