{
    "prof_info": [
        {
            "prof_name": "Jeffrey Kysar",
            "prof_id": 1923,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanical Engineering Lab I",
            "review_date": "August 06, 2015",
            "review_content": "\nProfessor Kysar is a wonderful professor to have and teaches with clarity and passion. He really cares about his students and the previous reviews sum him up very well.\nWorkload:\n2 psets, 4 labs and a final\n"
        },
        {
            "course_name": "Mechanical Engineering: From Micro Machines to Jumbo Jets",
            "review_date": "March 19, 2007",
            "review_content": "\nThe person sitting next to me saw the title to the class as I typed it and said \"That sounds like a cool class.\" That was my thinking too when I signed up for the class. Unfortunately, it was quite a disappointment. It was very equation-based and did not point to the greater picture of \"how things work\" as i had hoped. Much of the class is spent doing proofs that are much more complex than you are expected to know for the tests. I had a hard time staying awake. \nI found Kysar to be a very nice guy and not a poor teacher. It is just difficult to stay awake that early when the class consists of proofs. I have problem with the design of the course itself rather than the professor. I would recommend taking the pre-prof Engineering graphics course with Jose Sanchez instead. \nWorkload:\nEssentially physics problems with a few extra equations from the book specific to the problem. \n"
        },
        {
            "course_name": "Mechanical Engineering Lab I",
            "review_date": "January 02, 2006",
            "review_content": "\nProfessor Kysar genuinely takes an interest in students and their sucess in his class. He would always make room in his schedule to answer student questions and make sure they acutally understood the material. Bummer that he doesn't teach any further undergrad classes, as he's probably the nicest teacher at Columbia.\nWorkload:\n5 Not Too Hard Lab Reports (50%), Medium difficulty Homework assignments (25%), Managable Final (25%)\n"
        },
        {
            "course_name": "Mechanical Engineering Lab I",
            "review_date": "December 14, 2005",
            "review_content": "\nProfessor Kysar is extremely passionate about both his field of study and education. He cares a lot for his students, and makes a lot of effort to ensure that students understand the material. All the lectures are at the start of semester, and its easy to lose concentration in 3 hour lectures. But this is just how the course is structured. Its hard to find Professors in Columbia that are willing to go the extra mile for their students, and Professor Kysar is one of them.\n"
        },
        {
            "course_name": "Mechanical Engineering Lab I",
            "review_date": "September 16, 2005",
            "review_content": "\none of things i don't like his class is that he always teach some stuff that you can't find in the textbook, and what that means is that in order to do well, you would have to go to his lectures, pay attention, take notes and not fall asleep. However, speaking of Prof. Kysar's own character and capability, he is recognized as, without a doubt, one of nicest profs at CU. \nWorkload:\nok\n"
        },
        {
            "course_name": "Intro to Mechanical Engineering",
            "review_date": "January 21, 2005",
            "review_content": "\nbest instructor ever. He should teach gateway lab.\n"
        },
        {
            "course_name": "Intro to Mechanical Engineering",
            "review_date": "December 23, 2004",
            "review_content": "\nThe class was a delight, it provided a solid overview of the applications of our first-semester studies. The class combined ideas from physics, chem and calc to explain operating principles of various machines and devices. Professor Kysar clearly loves teaching in the ME department, and his enthusiasm spills over into the material. Highly reccomended.\nWorkload:\nWeekly homework sets which eat your free time (40%), Easy Midterm (30%) and Group Final Project (30%).\n"
        },
        {
            "course_name": "Mechanical Engineering: From Micro Machines to Jumbo Jets",
            "review_date": "December 18, 2004",
            "review_content": "\nThis is one of the nicest people I have ever met. He will do anything to help students out, very approachable and his door is always open. He is very eager to teach and share his vast knowedge with you. On the other hand, the course isn't that interesting, so don't be fooled by the discription. You learn the mundain of mech eng, which will be much like your physics class. The homework is very difficult and will kill your weekend, and the lectures can be painfully dull. However it could be much worse.\n\nWorkload:\nOne problem set a week that will kill your weekend, a difficult midterm, and a group project for a final which is pretty cool and not too difficult.\n"
        },
        {
            "course_name": "Mechanical Engineering: From Micro Machines to Jumbo Jets",
            "review_date": "January 07, 2004",
            "review_content": "\nOverall, an interesting course.  The topic and speaker change every week so you will probably be fascinated one week and bored to tears the next two.  Everyone knows their stuff, but since the professors change it is almost impossible to get outside help unless you form a study group within the class.  The indepth, last day of class tour of the mechanical engineering department makes everything worthwhile and will have you reconsidering mechanical engineering as a major even if you hated the course.  Definately worth taking if you have any interest in mechanical engineering.\nWorkload:\nweekly problem sets that will eat your weekend, final group project on the topic of your choice\n"
        }
    ]
}