{
    "prof_info": [
        {
            "prof_name": "David Mejia",
            "prof_id": 13194,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Advanced Language Through Content: Spain at War",
            "review_date": "April 19, 2017",
            "review_content": "\nDavid was an awesome teacher. Every week of this course was devoted to a different facet of Spanish culture or international context throughout the time period leading up to, during, and following the Spanish Civil War. It was clear that David was deeply interested in many of the topics we talked about; when discussions got slow he would offer his insights to provide food for thought or guide the discussion in a direction we could share more about. He's an incredibly sweet person, but is pretty sarcastic and humorous during class which made everyone feel more at ease. He was super helpful during the process of writing final papers for the class, suggesting lots of resources and possible approaches. The workload was also relatively light, but if you do all the readings it'll be easier to participate in class which is important in such a small seminar. Highly recommend if you're at all interested in sociopolitical issues surrounding the rise of fascism, international relations, or cultural identity in Spain.\nWorkload:\n- Weekly readings and/or films and responses (1 page-long compositions; reading is comparable to other Advanced Lang through Content courses, if not lighter)\n- One presentation per student - present about topic of week, guide discussion of readings\n- Final paper (7-10 pages) on topic of choice - can basically be anything related to the Spanish Civil War or the period directly before or after it\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "September 27, 2016",
            "review_content": "\nYou should take David's class. Whatever level it's at, if you need it and he's teaching it - You. Should. Take. David's. Class. \nIn the past I've been hesitant to take classes with PHD students, and before his class had taken the other language levels with professors, but honestly his was the best experience I've had in a language class at Columbia thus far and not by a small margin. \nIt's so important to feel comfortable in a language class and David has a laid-back teaching style and approachable-ness (mixed with a solid sense of humor) that  seems to put everyone at easy, making it so much easier (and more productive) when attempting to use the language.  \nHe also manages to get you through  the material in a way that leaves you feeling prepared for both the exams and the next class level - He even manages to keep subjects (like grammar) fairly interesting (or at least more interesting than other professors were able to) I'm honestly not sure exactly how he does it - all I know is that it's working. \nHe never had a problem staying after class, answering questions or just generally helping you out. He's not out to crash your GPA and gives off the vibe that he wants you to do well\nThe best way I think I can explain it to you is by telling you that every student in my class. EVERY SINGLE ONE talked about how much they liked David as a professor. Even the kid who was always seemed like he hated it - wanted to go out of his way to thank him for the class. \nTo summarize: You should take his class, you will thank me for it. \nWorkload:\nStandard for the classes within a language requirement. \n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "April 19, 2016",
            "review_content": "\nTL/DR: Take his class, any class, if and whenever possible.\nDavid.  Ah, David.  Pronounced Dah-veed, it is a name that you will always remember if you take one of his classes.  In a good way.\nDavid is a fantastic teacher.  He has a very laid-back, free-flowing teaching style with lots of humor mixed in, yet he manages to, well, manage the class extremely well.  For example, one class, we ended up discussing vegan-ism for nearly forty minutes, arguing back and forth across the circular seating arrangement -- all in Espanol, of course -- and David STILL was able to interrupt at key points and get the components of his lecture in.  While not every class was like this, his keen ability to adjust to the fluidity of a small, immersive, foreign language class was just amazing.\nOh did I forget to mention that?  Yes, his classes are Spanish-speaking only and very participation heavy.  That's OK though; the class time will disappear in no time flat.\nHow much did I enjoy his class?  Well my wife visited me one Friday for the first time in five weeks -- and she and I get along quite well -- but by-golly I still went to David's class that morning.  Did I have to?  No.  Did I want to?  You betchya.\nIf I didn't have to return to Seattle this summer I would take his Intermediate 1 course.  Even then, I am tempted to stay.  Just for his teaching.\nTo quote the prescient Shia, \"DO IT!\" and take David's class.\nOh and did I mention he is incredibly handsome?  \n(Editors, feel free to cut that last line if needed.  But you shouldn't.)\nWorkload:\nPar-for-the-course Spanish department stuff.  If you study regularly and complete the MySpanishLab materials you will be fine.  It isn't a lot of work, but it isn't something you can only study for two days before the exam, either.  It earns its 4 credits.\n"
        }
    ]
}