{
    "prof_info": [
        {
            "prof_name": "Patrick Gallagher",
            "prof_id": 119,
            "total_reviews": 45
        }
    ],
    "reviews": [
        {
            "course_name": "Honors Math B",
            "review_date": "May 18, 2015",
            "review_content": "\nHaving taken Gallagher for two semesters now in the Honors Math A-B sequence, my overall feelings for him are definitely very mixed.\nIf you are looking for an easy time in an otherwise difficult class (Gallagher also teaches Modern Algebra and Modern Analysis), look no further. He prints out his own notes and doesn't need a textbook so everything you need to know is on those packets. You don't even need to go to lecture, since he just repeats everything he puts on the packets in lecture. As for grades, let's just say that last semester 75% of students got an A-range grade according to my transcript. He also gives out many A+'s.\nThat said, if you are looking to really learn the presented material and get something out of the class, I would stay away. As a math major with a strong passion for the subject, I don't think I'll ever be taking a Gallagher class again. \n- He is not a good lecturer. He speaks very softly in at a volume that is probably softer than a normal person's talking voice so it's very hard to pay attention, especially when he's just repeating what's on the notes anyway.\n- He doesn't use a textbook. Some see this as a good thing, but as someone who learns best when given a very rigorous (albeit dense) presentation of the material, I found it hard to really learn the material through his notes. Gallagher's notation is his own which can be confusing, especially when his LaTeX skills are subpar and when his notes are not immune to typos.\nBesides from this, his class can also be a pain with problem sets and midterms.\n- Problem sets. The questions can be very tedious (\"An exercise for the hands, not the mind\" he calls them), very vague, or occasionally just plain wrong (which he doesn't acknowledge until a day before the set is due). Plus each problem set varies greatly in length - one week we had a four problem set which took less than an hour and the next week we had a twenty problem set. Not to mention, the TA's only end up grading a very small fraction of the questions, so it's possible that you get those questions wrong and get everything else right and get an atrocious grade on the problem set overall. Plus it just doesn't feel good to write out two pages of tedious computations if they're not going to be graded anyway. I just don't see the point.\n- He is very vague with midterms. He never makes the format explicitly clear, nor does he make the content. For our second midterm of this semester, we asked what would be tested on the midterm and he vaguely responded \"everything, but only the short proofs.\" First of all, I don't see the merit in making us know every definition, theorem, and short proof to the point that we can recite them - it would be better to give us a list of the important ones he wants us to know and have us remember those (which my other professors do). Second of all, the proof he gave us ended up being Green's Theorem, which was one of the longest proofs of the semester (it was two pages long)! On the other hand, sometimes he surprises you with an easy midterm, which means that tiny mistakes have a huge impact. I forgot to state that an eigenvector must be non-zero and I lost 5/100 points on a test where we had to recite 25 total definitions/theorems verbatim.\n- The final is easy. 25 T/F questions. He tries to trick you, but if you know your stuff it's pretty easy to figure things out.\nAll in all, Gallagher's class can be tedious and frustratingly vague, but definitely easier than other options for these theoretical math classes, and he gives out good grades VERY leniently. If you're looking to get something out of the class and really learn the material, I would choose another professor - they may be more difficult but it's worth it. \nWorkload:\nWeekly problem sets ranging from anywhere between 4 and 20 problems each. Be prepared to spend a good amount of time on homework, and make a study group.\nTwo midterms and a final. Midterm format changes each time and varies drastically in difficulty, but expect to know everything presented to the point that you can recite them in 40 or so pages of math. \n\n"
        },
        {
            "course_name": "Honors Math B",
            "review_date": "May 13, 2015",
            "review_content": "\nIf you are interested in mathematics as a field and have not yet finished the calculus sequence, take this course. It is much more interesting than the alternatives. It has some fun proofs and introduces topics like Fourier series and group theory that you would not see in a calc sequence.\nGrading is reasonable, workload on the lighter side. The midterms can be a little unpredictable, but usually fair.\nOne warning: if you are only interested in calculus and linear algebra as a means to an end, do not take this course. You could certainly get the computational skills you need in the calc sequence instead; in fact, Honors Math is a little light on computations. \nWorkload:\nWeekly Problem Sets (20%)\n2 Midterms (20% each)\n1 Final (40%)\n"
        },
        {
            "course_name": "Honors Math B",
            "review_date": "March 29, 2015",
            "review_content": "\nThis is not your grandfather's math class. Not your great-grandfather's either.\n\nIn fact, Gallagher is the most brilliant mathematician I have ever seen. He loves the material and enjoys teaching a lot, and sometimes tell jokes about Prof. Goldfeld (who was his student!) or other mathematicians. Try talk to him after class, especially if you want to major in Math. He has notes for all the math classes taught here and knows every professor the extremely well. He is absolutely the best adviser you can have. (Also ask him about what he did on Goldbach conjecture, what his middle initial X stands for, how does he translate Vietnamese songs to English  etc.)\nThe con side of this course are that Gallagher go over the more advanced stuff pretty fast(maybe because they are not the main focus of tis class). It can be pretty hard to grasp when it comes to Analysis. Another problem is the way he teaches is based on theorems and definitions, which can be really hard to understand. But you are more than welcomed to go to his office hours to ask him for a geometrical explanation or questions on any problem for any math class.\nFor the exams, midterms are straightforward, but final is something like 25 tricky true or false questions---they will be the most tricky true or false questions you will ever have unless you take another course with Prof. Gallagher.\nWorkload:\nlight. 5 to 15 problems per week, but can be a lot if that is on Analysis. 2 midterms based on his notes and 1 final consists only of true or false questions.\n"
        },
        {
            "course_name": "Honors Math B",
            "review_date": "February 25, 2015",
            "review_content": "\nVery nice and funny professor. \nNot a really good lecturer. He just reads and writes down what's in the handouts and sometimes couldn't explain everything ( especially on the second part of the class)\nYou could do fine on his class by just taking his handouts and learning the stuff.\nMidterms and Finals were pretty easy. They basically consisted of Definitions/Theorems and True/False questions. You can get an A or an A+ in the class by just learning the definitions and proofs word by word and paying attention to the True/False questions which can sometimes be tricky. Don't underestimate all the questions though, each one could cost you third of a letter grade.\nWorkload:\nProblems sets were given every week (except midterm week) and consisted of 6 to 8 shorts exercises with very helpful hints (A lot of them ask you to imitate a given proof).\nHe also drops 2 problem sets.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "January 10, 2011",
            "review_content": "\nGallagher definitely deserves a mixed review; he's great in that he truly loves the material, he's very sweet and pretty funny at times, and the homework is reasonable. The midterms/final weren't terribly difficult, but the time constraint on the midterms was rough, especially considering that he takes off 5 points from a 20 point problem for any math mistake, no matter how small. It's very easy to get a low midterm grade if you make a few small mistakes. Also, I found the lectures entirely incomprehensible. Even when I tried to pay attention, it just seemed impossible to follow his logic. Still, I would generally recommend this class just because it's not unreasonable, and 90% of the material is out of the Stewart textbook, which I liked.\nAlso, Gallagher's random tangents on poetry and mathematicians and the like are very enjoyable.\nWorkload:\nHomework is easy. Midterms okay but tough on time. Final kind of hard, but not terribly. Curve is pretty good. FEAR the section at the end on Fourier series. It makes no sense.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "December 25, 2010",
            "review_content": "\nThe easiest professor ever!\nI took cal1~4 and I felt that CAL 4 was the easiest because of this The Man professor!\nThe man!!\nGallagher was the man, in fact, his TA \"Ben\" or \"Ban\" was very very terrible.\nHe was always late at submitting out hws grades on the courseweb, and he was very very unhelpful at all.\nTake his class as early as you can because, it's so sad, but he seemed that he was very tired of giving lectures every time, and I assume that he might retire in few years.\nI got A in his class.\nWorkload:\neasy hws, 2 midterms, 1 final. EASY EASY ENJOY!\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 25, 2009",
            "review_content": "\nTaking Calculus II with Patrick Gallagher is like taking Calculus II with your kind grandfather. He usually teaches harder courses, but of course he's nice enough to teach some introductory ones as well, and at times, he'll put things so simply that it feels like he is actually speaking to a 4 year-old. \nHe is an elderly kind man and his lectures cover exactly what you need to know, meaning you'll hardly ever have to look to the book for clarification. However, his lectures do tend to run late often, as his eyes cannot see the clock in the back of the room. \nAlso, because he's is a pure mathematician in the purest sense, he gives a lot of proofs. A LOT. And you don't need to know them for tests or homeworks, which means that once he begins one of his 10-minute proofs, you can put your pencil down and safely nap for a while. He sometimes also puts ideas and defines things in a more abstract mathematical way, which may not have been suitable for a low-level class, as there were times when it seemed like the entire class was lost. \nOverall, I'd highly recommend Professor Gallagher. He will perhaps be the nicest professor you'll ever have, is very accommodating to students, and will answer any question in class and phrase his responses in a cute grandfatherly way. \nWorkload:\nCompletely acceptable: PSet every week of varying lengths, the most was probably 15 problems; 2 midterms; 1 \"short answer\" final meaning no partial credit but lots of easy questions\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 23, 2009",
            "review_content": "\nProfessor Gallagher is a sweet man and a great mathematician, but a terrible teacher. Switch out of his section if you can. His lectures are quite boring, he delves into proofs too much, and generally makes one hate math. I used to be quite fond of Calculus until I took this class. Gallagher takes off an insane amount of points for stupid mistakes--make sure you check and re-check your answers. Also, he has much respect for the curve. You won't get a bad grade if you put in a substantial amount of effort, but if you intend to learn some math or if you're pre-med, switching out may be the best option. If not, be prepared to frequent the Math Help Room.\nWorkload:\nOne incredibly easy midterm, one inexplicably hard one, and an in-between final, in addition to weekly problem sets. The problem sets sometimes have impossible questions that even the math help room TA's can't solve.\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "January 12, 2009",
            "review_content": "\nHe's like they used to make 'em: a pure mathematician who understands thoroughly his material, with a British sense of humor to boot. He finds most appealing the concepts rather than the illustration of the concepts through examples. He thinks in theory. Thus the pedagogical approach is unusual, but in the end-- if you'll stick around to it and work hard-- he will make YOU a stronger mathematician, comfortable with hard proofs...\nWorkload:\nvery light, in my opinion\n"
        },
        {
            "course_name": "Introduction to Modern Algebra I",
            "review_date": "December 09, 2008",
            "review_content": "\nThe man stands in front of the class for 65 minutes (he's always ten minutes late) and rambles on and on about topics. The classes are INCREDIBLY boring and I didn't get anything out of them. There is no text book. Instead, he writes out notes and passes them out during class. A decent amount of people grabbed the notes and left within the first 5 minutes of class. He throws in the occasional witty remark, but is pretty boring for the most part.\nWorkload:\nWeekly problem sets... he wasn't so strict about deadlines and seemed to always push back due dates. There were two midterms, both of which were very straightforward as long as you studied. The problem sets aren't too bad.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "August 06, 2007",
            "review_content": "\nGallagher is a brilliant, eloquent & likeable professor who spends his classes weaving through proofs; his approach to teaching is very theory-oriented. Unfortunately, not all those attempts ended satisfactorily, and we often had classes that ended abruptly or were left incomplete. The text book was easy enough to understand though.\nThat said, he was teaching the Engineering version of ODE, and did occasionally make a concerted effort to include examples & solve text book problems. The material was best learnt in classes where he did this.\nMy biggest qualm with Gallagher were his tests though. The two midterms were unbelievably easy, completely distorting the curve, so that a 96% ended up being a B. His final was a Multiple Choice+ No partial credit & he made it difficult to make up for the midterms. Worst of all, his grading system averages the letter grades you received in the HW, midterms & final (double counted).\nIn short: Brilliant, quirky & eloquent professor; loves the theory & neglects the administrative/practical side of the class.\nWorkload:\n4-5 easy weekly problems, 2 very easy midterms, 1 short answer difficult final; beware the curve & the letter average system!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 17, 2007",
            "review_content": "\nProfessor Gallagher is a very nice man who is clearly very brilliant in math. My only problem with his teaching style was the number of proofs which he decided to include in the course. Basically every theorem we learned was followed with a proof, some of which found themselves onto his tests. In terms of personality, Gallagher is one of the most approachable professors I've encountered at Columbia; he is always willing to answer questions or even look again at grades on tests that students felt were incorrect. If you are taking Calculus III for the economics requirement, I would stay away because this course is quite in-depth. \nWorkload:\nA problem set every week with about 5 problems that actually need to be handed in, two midterms, and a final. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 16, 2007",
            "review_content": "\nA few facts: Gallagher is an eccentric man - his non-sequiturs are not only hilarious, but relevant in ways you might only understand months later. He wears sweet sneakers. He doesn't use Courseworks (which can be REALLY annoying).\nI took the class as a marginally possible premed looking to take his last math course ever. This class had its pros and cons. In retrospect, I wish I had kept up with the material; the way that Gallagher leads you through all of the proofs and hands you the material on a silver platter you won't have with many other professors. On the other hand, some people walk out of his classes toward the end of the semester not knowing what they just sat through. As classic Gallagher does, he is more concerned with the different proofs of all of the core concepts of the class. And he doesn't even need many notes. Also, geometry is a very big part of this class.\nWorkload:\nWeekly homework, two midterms, final. Expect to prove (\"show\") things on the midterms and homeworks but NOT on the final. The final is about 20 questions with right/wrong numerical answers. Almost all homework questions come from the textbook.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 08, 2007",
            "review_content": "\nProfessor Gallagher is a brilliant, eccentric man.  He is the stereotypical elderly math professor who loves to prove everything.  I felt honored to be able to take a class with him, even if it was only Calc III.\nI appreciated how he helped us think through the theoretical framework of the material, rather than listing theorems and formulae and plugging numbers into them mindlessly.  In fact, he dislikes/fears numbers with a passion and will avoid them whenever he can...\nHe is very respectful to his students and directly and kindly answers every question.  He's also available outside of class to take your questions.  Despite writing meticulous (color-coded) notes on the board, he still manages to neatly tie together every class.  His self-deprecating and math-nerdy humor is the finishing touch.\nHis many eccentricities and sheer intelligence will win you over.  He's adorable and one of the best teachers I've ever had.\nWorkload:\none homework/week (10-ish text problems, sometimes handout problems; lowest 2 grades dropped; 20%), 2 midterms (20% each), 1 final (cumulative, 40%, \"short answer\" format, no partial credit)\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "April 24, 2007",
            "review_content": "\nI cannot understand the good reviews that have been written about this guy. He is perhaps the worst teacher that i have encountered at Columbia. He might have been good previously, but by now is worthless because he is too old and senile. \nHe writes the intricacies of unimportant proofs on the boards and does most of his work with colored crayons, which is extremely frustrating for those students who do not bring such an array of colors to class. \nHe also created the easiest exam i have seen, which made the curve extraordinarily high. if you got one mistake you dropped a letter grade. \nFinally, in his class there were probably 3 or 4 examples of blatant cheating (talking, passing blue books, having an open text at their feet) that I observed during the first midterm. When he was confronted with this problem by a student he did nothing but shrug and stutter. \nDo not take a class from this man. He should retire. \nWorkload:\nNot bad - the problems from the text are easy, as are the tests. too bad the class sucks. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 03, 2007",
            "review_content": "\nPatrick Gallagher is the best math teacher I have ever had. True his proofs and hard homework may seem daunting at first, but he provides a real challenge for those interested in learning rather than just earning a grade. Plus he is very passionate about what he does. He genuinely cares about the quality of his class. He is hilarious (prepare to laugh), his midterm is fair, and his homework is managable. PS. Im an econ major and i didnt run\nWorkload:\nfair\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 03, 2007",
            "review_content": "\nRun from this man if you are an econ major. I sat in his class not knowing what he was talking about as he ambled from proof to proof. Then i went home and sat at my desk for hours trying to do his complicated proof loving homework. He is double the work, he expects you to know all the random proofs he goes over in the lectures and then go through the book on your own. Again run. fast!\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "June 06, 2006",
            "review_content": "\nNot the greatest math teacher I've had because he basically proves EVERYTHING (all the equations, properties and theories) the entire class period but doen't actually do a problem for the class. Otherwise, he's a nice and funny man who reminds me of my Irish grandfather. The first two midterms are straight from the book. Just study the homework. But the final is basically all the stuff that wasn't part of the Calc IV curicculum that Gallagher taught on his own. Hence, go to every class and take the notes even if you think  it's not part of the curicculum because it'll all be in the final!!! If you do all this you'll get through the class with an A. \nWorkload:\nHomework 20%, 2 midterms 20% each, Final 40%\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 13, 2006",
            "review_content": "\nPart of me regrets writing this review, as I failed to attend class beyond the first class of the semester, other than for the midterms and final.  Yet, I do not regret my absences.  Professor Gallagher is a fascinating professor, if you want to know proofs, as he is a native English speaker.  He passes out notes, homework, and answers in class, so make sure to come to class or make friends with those that do.  The first part of the class and homework are all from the James Stewart book.  However, after we finished the book, we progressed on to Complex Numbers and Fourier Analysis, which was based solely on lectures and notes.\nWorkload:\nup to 2 hours of homework per week.  2 fairly graded, straight-forward midterms.  Final is part true/false and write answers in blanks (no partial credit on final!!!).  this way, he can grade the final immediately.\n"
        },
        {
            "course_name": "Calculus IV",
            "review_date": "May 13, 2006",
            "review_content": "\nGallagher is getting really old (my dad took a couple of classes with him in 1965), but he's still quite competent.  He will ramble on at times during class about some great mathematician of the past that he knew or about poetry or whatever is bouncing around his head, but he's mostly on point.  Class is nearly useless for understanding the material because Gallagher just presents proofs that he likes and a general overview of the material without examples - but if you like math his class will be one of the best you've taken, even if it is only Calculus IV.  He seems to care about how everyone does in the class and is very receptive to questions.  Because he's been here forever he teaches classes like this purely because he likes to (I think he's director of the undergrad math program also), so if you have the opportunity to take his class, definitely do.\nGrading is fairly generous.  Gallagher gives partial credit on the midterms, so if you're clueless but you had the presence of mind to write down a marginally relevant formula he may spring for half credit.\nWorkload:\nproblem set every week, most problems straight from the book, fairly long but usually not impossible; standard math class exams, two midterms and final\n"
        },
        {
            "course_name": "Complex Variables",
            "review_date": "May 08, 2006",
            "review_content": "\nIn short: Gallagher is clearly brilliant, but the course has some serious flaws.  The course packets (handed out each lecture) are elegant, concise, and make complicated proofs seem simple, but the exercises assigned (which are very time consuming!) aren't designed to help you learn the material.  Rather, the homeworks often introduce new stuff and that doesn't really enrich your understanding of the old.  The midterms literally asked you to spit back definitions and theorems you have memorized -- they require absolutely no understanding whatsoever, and are graded somewhat harshly (two missed words like 'convexity' is a B-range grade).  Then out of nowhere the true/false final exam asks you to apply the theory in the lecture packets in ways you've never seen before and that require a very deep understanding of the material in the packets, an understanding you were never encouraged to develop in the joke midterms and somewhat orthogonal homeworks.  In short, having gotten what most likely will be an A or A- in this class, I don't really understand complex analysis. \nWorkload:\nExpect to spend something like 6-8 hours on the weekly problem sets; maybe 4 or 5 hours memorizing stuff you dont have to understand for the midterms; and an indeterminite amount of time studying confusedly in vain for a final you could never adequately prepare for in a million years.\n"
        },
        {
            "course_name": "Complex Variables",
            "review_date": "May 08, 2006",
            "review_content": "\nIn short: Gallagher is clearly brilliant, but the course has some serious flaws.  The course packets (handed out each lecture) are elegant, concise, and make complicated proofs seem simple, but the exercises assigned (which are very time consuming!) aren't designed to help you learn the material.  Rather, the homeworks often introduce new stuff and that doesn't really enrich your understanding of the old.  The midterms literally asked you to spit back definitions and theorems you have memorized -- they require absolutely no understanding whatsoever, and are graded somewhat harshly (two missed words like 'convexity' is a B-range grade).  Then out of nowhere the true/false final exam asks you to apply the theory in the lecture packets in ways you've never seen before and that require a very deep understanding of the material in the packets, an understanding you were never encouraged to develop in the joke midterms and somewhat orthogonal homeworks.  In short, having gotten what most likely will be an A or A- in this class, I don't really understand complex analysis. \nWorkload:\nExpect to spend something like 6-8 hours on the weekly problem sets; maybe 4 or 5 hours memorizing stuff you dont have to understand for the midterms; and an indeterminite amount of time studying confusedly in vain for a final you could never adequately prepare for in a million years.\n"
        },
        {
            "course_name": "Modern Analysis I",
            "review_date": "November 13, 2004",
            "review_content": "\nBe very careful about taking this class.  As an econ major, I heard that it was important to take this class to get into grad school--but the level of abstraction here crushed me.  Don't take this class unless you have a very strong background in mathematical theory, and love memorizing proofs.  Although he seemed to be a very good lecturer, the material was way over my head, and I had to drop.\nWorkload:\nAlmost nothing.  The midterm was essentially a test of how well you remembered the proofs.\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "August 30, 2004",
            "review_content": "\nTo avoid repeating any opinions hereinto expressed, let me just say that this man gives you a glimpse into how graduate-level mathematics should be done. Having done mathematics research over the past summer, I was amazed at how close Gallagher's method of definition, theorem, proof is to research caliber mathematics. While the protocol that he uses can be construed as boring [xeroxing notes and requiring no homework essentially], one should allow time to digest the notes that he does give. \nBombard him with questions, he will give you great answers. While this class might be a shock to some who have been used to the calculus sequences, it is definitely a great class to test one's aptitude and curiousity for higher mathematics.\nWorkload:\nEssentially no written work. He assigns hw problems randomly and infrequently. However, I would recommend reading each of his sectioned notes two to three times to aid in the overall understanding of the material. Exams are usually true false requiring complete understanding to receive full points [no partial credit], but the overall difficulty of the questions is not that bad. \n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "July 05, 2004",
            "review_content": "\nGallagher is the most brilliant professor I have had so far. He doesnt use a book - in fact, writes up his whole course in notes that he copies and hands out, which is very nice, since you dont have to take any! His lecture style is very enjoyable - he lectures completely from memory, which adds some spontaneous insights and jokes to his lectures, and his 50 years of teaching experience make sure you have a great time in class.  Did I mention that his lectures are absolutely clear and reflect his unending love for teaching? There are, though, occasional mistakes in his lecctures/notes which he usually corrects immediately (instead of covering them up like some pretentious profs). In one word, a Gold Nugget. Oh, yeah, and he included poems in his notes, too!\nWorkload:\nnot too heavy - grading is very lax (if you do most of the homework), and the exams almost entirely true/false.\n"
        },
        {
            "course_name": "Complex Variables",
            "review_date": "May 17, 2004",
            "review_content": "\nTaken Spring 2004: Gallagher is a great professor as the other reviews have said, but he is getting older, so he's referring to his notes more frequently and will be slower to grade things- he returned our second midterm which was taken on March 31 on the last day of classes May 3. That said, I think Gallagher's teaching method, doing all the important proofs in class and not requiring you to reproduce them on exams, is the gentlest way to study pure math, but I'm not sure that it's the most effective. \nWorkload:\nOccasional homework that is collected and not graded. Two doable midterms and a 25 question true-false final with a range of question difficulties.\n"
        },
        {
            "course_name": "Intro to Modern Analysis I",
            "review_date": "May 14, 2004",
            "review_content": "\nI personally love Professor Gallagher and would take any class he offered. The man is the shining example of someone who loves teaching, loves math, and lives for his job. He explains very well if you are willing to listen, and can go through really hard proofs without even looking at notes. The man LOVES proofs. He doesnt assign a textbook, and instead, writes a packet of notes very every class and gives a copy to each student. You don't have to take notes, so you can just listen. He is also just a very interesting guy - writes and reads lots of poetry, etc. Once in a while he gets caught up in one of these other things and isn't very prepared for class (or like the time he didn't give back the graded midterms until the last day of class!)., but hey, knowing the average Columbia student, who are we to complain. \nWorkload:\nRandom homework problems (don't worry too much, just hand it in), 2 midterms (memorize the definitions and theorems word for word, final is all true/false\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "April 17, 2003",
            "review_content": "\nProf Gallagher is one of those instructors where the students can tell that he truly enjoys his work. You can see the joy in his face as he figures his way through a proof. However, his enthusiasm for proofs sometimes gets in the way of going through the material and giving the students enough examples for them to understand it in a more concrete way.\nWorkload:\nWeekly homeworks that aren't checked, 2 midterms, final exam\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 30, 2003",
            "review_content": "\nVery nice person, just the grandfather you want to take home. He is obsessed with proofs though, and sometimes reminds me of John Nash from Beautiful Mind. He answers any question you have, and will also give a proof to go along with it. Teaches ok, nothing spectacular, just normal. I do recommend him though.\nWorkload:\nProblem set of about 10 questions per week. 3 midterms, lowest one dropped, 1 final.\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 22, 2003",
            "review_content": "\nIf you really resent having to take math class, Gallagher is not for you.  But, if you like math and think watching it unfold is enjoyable, then I very highly recommend Gallagher's class.  I thought he was an absolutely excellent teacher who was there to teach us, not merely to keep us in league with the requirements.  When he began each lecture, he seemed to think, \"Ok, what do these kids need to learn today?\" and to just go from there.  He knows what we need to know and how we can remember it.  All of his examples were usually made up on-the-spot, and in watching him work through the problems myself, I could really get a sense as to how he thought about them (and all of his thoughts were generally outloud).  Essentially, Gallagher shows a greater passion for math than any teacher I've had and I miss him this semester!\nWorkload:\nmoderate\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "January 19, 2003",
            "review_content": "\nProf. Gallagher is a genius, on top of being a very nice man.  He provides notes for the lectures, but people seemed to be taking their own notes anyways (why??!!!!)  His exams require understanding of the material rather than just rote memorization, which is what exams should do, in my opinion.  However, understanding modern analysis is no simple task.  Be prepared to study if you want to do well.  No need to go to class if you can understand his notes.  Go to office hours if you can - he seems to explain the material better if you ask him specific questions.  My only complaint is that the lectures were to dry - I wish he would have done more than simply repeat what he wrote in the lecture notes (although he did it all from memory).\nWorkload:\n1 Problem set per week (proofs, graded for completion), 2 Midterms, True/False Final (Very Tough)\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 17, 2003",
            "review_content": "\nLectures are boring and almost unnecessary, but test are easy and the curve is amazing.  Basically, you got to teach yourself out of the book.\nWorkload:\nWeekly problem sets that need to be turned in, but can be BSed; he never checks them over.  2 midterms, 1 test- all very easy.\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "January 13, 2003",
            "review_content": "\nYou can't help but feeling affection for Gallagher, a little old man who wears the (seemingly) same rumpled shirt every day.  His duty is to teach math, whether the class is there or not, and though his lectures are pretty good (all from memory - he knows his stuff), they can get dry and watch out when he starts showing proofs that have nothing to do with what the course covers.  Maybe math fanatics will like that, but the tangents seem to just cause confusion.  He's a really nice guy and is open to questions, though if you don't understand it during the lecture, you can get left in the dust.  Overall not bad, not too bad of a grader.\nWorkload:\na problem set each week from 2-3 sections, 2 midterms, a final (no partial credit), and a needless mathmatica recitation\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 19, 2002",
            "review_content": "\nProfessor Gallagher is a terrific professor and a very nice man.  His lectures were extremely clear and often quite fascinating.  Furthermore, there is no need to take notes, since he hands out photocopied notes for each lecture.  (Actually, the notes make attendance at the lectures less than absolutely necessary. However, I went anyway since the lectures were so helpful and interesting.)  Gallagher clearly understands and deeply appreciates the beauty of math.  While he may appear to be absent-minded and easily distractable, this is not really the case.  He can be quite witty and is extremely receptive to questions.  When I went to his office hours, he was helpful and patient.  In short, I can not think of a single bad thing to say about him.  The meaterial for this class was sometimes quite interesting, sometimes not so much.  I found the class helpful, in that it provided precise definitions for concepts that I had previously understood only in vague terms.\nWorkload:\nWeekly problem sets (almost entirely proofs) which are graded for completion, not content.  Two midterms and a final.  The first midterm required the restatement of definitions, theorems and proofs.  The second, had some definitions and proofs, but was mostly true/false.  The final was entirely true/false.  All three were relatively difficult, but the curve was not too bad.\n"
        },
        {
            "course_name": "Calculus IIS",
            "review_date": "November 08, 2002",
            "review_content": "\nFall '02: On first glance, Professor Gallagher seems to be quite mad and an unsatisfying math professor. Yet in actuality he is very well-versed in mathematics (he attends class without any aids, and can prove pretty much any formula in about ten minutes, tops). His frequent digressions on proofs can get rather tiresome, especially since he doesn't test them, but they are always clearly presented and informative. His tests are not too challenging if you do the homework, and attendance at class isn't even necessary, though I always enjoyed his random digressions. However, not every student enjoys inanity in mathematics - if that's the case, then I suggest a different professor. Otherwise, Gallagher is an excellent choice.\nWorkload:\nWeekly collected problem sets, about an hour and a half's worth of work. Two (easy) midterms and a final.\n"
        },
        {
            "course_name": "Honors Math II",
            "review_date": "January 27, 2002",
            "review_content": "\nMaybe it was just for this class, but really not that hard a prof. Talks to himself though---not engaged in the class at all. He randomly recalls a Vietnamese song or poem and sings it to the class and translates it. Despite only 4 people showing up to class regularly he would start exactly on time even if only one person was there. If people slept in class he pretended not to notice. Kind of a space cadet. I don't really recommend him, though he seems to have a good rep.\nWorkload:\nVery difficult material. A couple problem sets he never collected after the first one. Midterm and final that were completely random and easily graded. The final was two questions---one essay and one problem that was, do any proof you want that will impress me.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "January 17, 2002",
            "review_content": "\nProfessor Gallagher was a pleasure to have as a professor. He's a sweet guy who has a genuine love for math (he held a review session before the final that went well beyond the scheduled length because he wanted to make absolutely sure that he had answered all the questions we had). As a teacher, he has a solid understanding of the material, which he is readily able to communicate to the class. Negatives: he has a thing for numerical computation and proofs, and often went on tangents involving one or both. When this happens, you can generally stop taking notes and paying attention, because that sort of thing was generally not on the exams. Overall: I thought he taught the material very well, and his lectures were (speaking as someone who does _not_ generally enjoy math) actually fun to go to. Highly recommended.\nWorkload:\nWeekly problem sets, two midterms, final.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 05, 2001",
            "review_content": "\nProfessor Gallagher is an excellent professor. He has extremely clear lectures and is always willing to work with people outside of class.\nWorkload:\nGraded problem sets due every week. About 10-15 problems per problem set. 2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "November 14, 2001",
            "review_content": "\nGallagher is a veritable math pimp. He lectures without any notes, relying instead on his experience in the field (he's gotta be around 65). I have not seen him fail to answer a question yet. At times, he spends class time with extraneous material, such as long, but clear, proofs. Still, if you don't mind learning a bit from the book on your own, this class is a dream. His exams are short, simple and curved generously. Usually there is one fairly difficult problem at the end that separates the high A's from everything else.\nWorkload:\nTwo relatively easy exams, Final, weekly problem sets (most of which are majority odd problems w/ answers in solution book). Overall very light.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "July 26, 2001",
            "review_content": "\nIf you already know the material pretty well, then you won't mind the fact that Prof. Gallagher spends most of the class time doing long, unnecessary proofs, or telling random semi-math related anecdotes. He's a pretty nice guy and always makes time if you need extra help, but the problem is that he speaks math, making it difficult for us non-math majors to understand him. You have to learn of lot of the material on your own and contrary to his high opinion of the world-reknown \"Early Transcendentals,\" I think the textbook sucks! Maybe I'm just stupid, or maybe I just really suck at math... But then again, he dropped my lowest grade and I ended up doing well after all. Oh, one more thing, the homework is spot-checked (he forgot to tell us the first time) which is really bad when you can do everything except for one really difficult problem. Try to make use of the math help rooms (which aren't always \"help\"-ful). workload=\nWorkload:\nModerate. Weekly homework assignments.\n"
        },
        {
            "course_name": "Complex Variables",
            "review_date": "December 31, 1999",
            "review_content": "\nInteresting lectures as math goes, excellent (5 star) handouts, basic homework, and awful tests (100% memorisation of months of material).\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 31, 1999",
            "review_content": "\nPatrick Gallagher is not a young professor, but is far more down to earth and happier to work with students than most professors. He speaks clearly and not too quickly, responds to questions well, and lectures well. While he may get a bit off track with a not as relevent proof that takes up much of a lecture, he also displays suprising humor from time to time. This all makes him an excellent choice for lower level math courses.\n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "December 31, 1999",
            "review_content": "\nAs a person, he is very congenial and willing to help at his late night, pre-midterm help sessions. As far as the lectures, they are almost completely unnecessary for the homework and the midterms. If you don't mind learning out of a good textbook and just using a professor for the things you have problems with, he is definitely the way to go.\nWorkload:\nmoderate\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 31, 1999",
            "review_content": "\nSimply put, Professor Gallagher is a mathematical genius. He brings almost no notes to class, but he has yet to be unable to answer any student questions, and he never gets lost while lecturing. His lectures, at least in higher-level math courses, consist solely of definitions, theorems, and proofs. Gallagher and his lectures are laid-back and relatively easy to understand, which is surprising given the complexity of the material (set theory). He throws in some \"math humor\" occasionally, which anyone in this class should appreciate. He *almost* reaches the level of you actually looking forward to class, but not quite. Now, for the not-so-fun part. His tests, in any math course higher than Linear Algebra, consist of rote memorization of the definitions, theorems, and proofs that the lectures cover. That means you had better be prepared to attend every single class, lest you be royally screwed on the tests. If you go to class, the tests really aren't that bad except for the proofs, which can get very complicated. However, Gallagher usually makes his tests definition-heavy, which is good. He is very picky about wording -- miss a single word in a theorem, and expect some points off. He doesn't fail anyone, at least in this course -- the lowest grade on the first test was called a C-, and he worked up from there. Back to the good stuff, he's always available to meet with students. He schedules late-night review sessions prior to midterms, which can really help if you're struggling. There's not a lot of homework at all in this class, though the problems that are assigned are usually challenging. Overall, I like Gallagher as a professor, and would recommend this course to other students -- at least Math majors looking for an elective.\nWorkload:\nA \"few\" problem sets, totalling about 30 problems over the entire semester. Really, not bad at all. Two midterms in this class, and of course, a final exam.\n"
        },
        {
            "course_name": "Introduction to Modern Analysis",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Gallagher is (in my opinion) the greatest professor in the math department and quite possibly the entire school. He is extremely well spoken and knowledgable to the point where he brings no notes to class, doesn't follow a book and hardly ever gets lost. Both midterms are straight foward-definition, theorem, proof. The final is true-false, and is absolutely impossible--bring your anal-butt plug and pray to god your midterm grades were good enough because no amount of studying is going to give you any sense of confidence on the final. However, if you're interested in taking an upper level math class that is actually enjoyable to attend, Prof. Gallagher is a safest bet.\nWorkload:\nWith the exception of the test, there is no workload (Maybe one assignment, but don't worry, its not even graded).\n"
        }
    ]
}