{
    "prof_info": [
        {
            "prof_name": "Noha Radwan",
            "prof_id": 2371,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "Themes in the Arabic Novel",
            "review_date": "May 19, 2007",
            "review_content": "\nLovely class and professor. The class was mostly seniors, and they all seemed to know Professor Radwan. The class was exceptionally laidback, though discussions were still often lively and interesting. Radwan raised great points, and she really wanted to class to be close - she held three class dinners, including one at her apartment.\nThe novels were great, and she clearly had a deep knowledge of them - though sometimes it was frustrating to read in translation (she read the books in Arabic) and not get all of the things she noticed in her reading.\nWorkload:\nOne book a week (most are short novellas), weekly short response postings, midterm paper (5-7 pgs.), final paper (10-14 pgs.) - all deadlines are flexible. all of them. but PARTICIPATE.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 23, 2006",
            "review_content": "\nProfessor Radwan is one of the most amazing professors here at Columbia.  You will definitely have to work in her class, but this means that you will get a lot out of it.  She likes lots of participation and discussion, so you have to make sure that you do the reading, cuz she's not afraid to call people out who are just being lazy and slacking off.  However, if you are unable to do the reading one week, just tell her, she will most likely understand and just not call on you that day.  She puts a huge effort into making sure that her students not only learn the materials from the class (she held additional review sessions for the final that were actually useful) but that we had fun (she ordered pizza for us and we all watched O Brother Where Art Thou? after we read the Odyssey.  Overall, if you are willing to put the work in this is the best way to take LitHum, it's pretty painless, fun, and you will learn more about these books than you thought there was to learn.\nWorkload:\n3 papers of increasing length, Midterm, Final, 2 or 3 smaller writing exercises (a page long double spaced)\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "April 08, 2006",
            "review_content": "\nNoha Radwan is a strong, knowledgeable and amazing professor. Many students will complain about her accent, or her no B.S. approach, but this is for those who cannot take the education that an Ivy League has to offer. The course is a not a light one, but this is not because of the professor, it is because The History of the Islamic Civilization is not something small, so the long unfamiliar names and dates and places all over the world will seem overwhelming, but Professor Radwan always does her best to go through it all and answer questions. The class and the sections are more intimidating than the Midterms and the Finals. There will be a lot of students groaning and complaining about the bombardment of information, however, they fail to comprehend the vast, rich and extensive history that is in this course. Professor Noha Radwan is lively and brings fourth films, songs and poetry to spice things up. Her English is as strong as her Arabic. Her mysteriousness adds to her quite colorful character. \nWorkload:\nSection work, that is determined by the TAs\nReadings every week: Moderate for an Ivy League\nMidterm and Finals: Very fair, she tells you the format, the terms that might be on it, and the readings. \n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 18, 2006",
            "review_content": "\nI really enjoyed Noha's class.  Admittedly, she was a weak lecturer during the beginning of the course, but she improved dramatically throughout the term.  She is very kind and approachable.  As far as I can tell, the only reason people took issue with her was because of the somewhat tough grading of the midterm.  The test probably should have been curved, but plenty of people did fine on it and Noha was willing to meet with everyone who was concerned about their grade.  She took the time to go over the test and even changed grades where she thought the TAs had been too picky.  \nRadwan is really excited about teaching students about the Middle East and I would recommend this class to anyone who is remotely interested in the history of that part of the world.  Everyone I spoke with did fine in the class, and to be honest, I thought the grading was almost too lenient.  If you have ANY background in the area, you will not need to study for either of the tests, and if you don't, then you should approachthe professor before you get your grade back to discuss the issues and terms at hand.  \nNoha is really nice and I think she was fair.  Her class had its ups and downs, but all in all it was enjoyable.\nWorkload:\nSection participation. Midterm and Final. Radwan provides detailed ID list for study before the tests. Optional short extra credit essay.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 14, 2006",
            "review_content": "\nDue to Radwan's exceedingly unpleasant personality and voice, I attended a total of about 45 minutes of class throughout the semester.  I attended about 3/4 of the discussion sections, participating not once, and submitted each of the obviously ungraded 250 word weekly response papers as a lump at the final session.  For the midterm and final, for which she gave us a list of terms and essays from which the test questions would be chosen, I wikipediaed the terms (about 3% weren't on the site, so I checked the textbook's index), my friend wikipediaed the essays, and we exchanged them.  I also spent about 3 hours wikipediaing the 3-page double spaced extra credit essay.  Hence, the total time spent on the course outside of attendance, was 20 minutes times 10 = 3.3 hrs for the responses, 6 hrs for the midterm (pretty relaxed studying--just procrastinating, wikipediaing, and memorizing terms), 9 hrs for the final, and 3 hrs for the extra credit, for a total of 21.3 hours.  I received an A+ for this 4 point class.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 05, 2006",
            "review_content": "\nThis lady is very intelligent, and there is no doubt that she is passionate about her subject.  She enjoys teaching, and I believe that she is good at it.  She comes prepared and is, most of the time, very interesting.\nThat being said, I believe that the course itself is more difficult than one may, at first, expect.  I, as someone who had only minimally been exposed to Islamic history, had a much harder time remembering the details of the course than I had anticipated.  Think about it, you take thousands of years of vast amounts of history and shove it into one semester... not so easy (at least for me).  However, if you put a lot of time into the course, you can get an A.\nAll in all, she's a good professor who teaches a relatively difficult intro. course.\nWorkload:\nmidterm, final, extra credit paper\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 02, 2006",
            "review_content": "\nStay away at all costs.  Professor Radwan comes in on the first day yelling at people to sit down and be quiet and showing off the tattoo on her arm.  You probably would think, this professor is going to be cool, but she's definitely not!  No one could follow this woman's lectures.  Half the time she'll talk about people with complicated arabic or persian names and when someone asks for her to spell it she will tell you not to worry, it wont be on the midterm/final.  The only problem is, the midterm and final are so complictated, they expect you to know the entire history of Islam from when it originated to now.  So basically it was impossible, so they gave us a list of 75 terms to study, 20 of which would be on the final.  Needless to say that still wasn't really much help either.  Avoid this class at all costs.\nWorkload:\nMidterm, Final, Discussion section work... lots of reading out of a huge history book that you'll never be able to do and a course reader that is useless\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 02, 2006",
            "review_content": "\nNoha is a no-BS, tough professor-- at least when it comes to her lecture performance.  When it comes to grading, the TAs do most of the work.  Noha's one big flaw is that she concentrates WAY TOO MUCH on the individual level of Islamic history, going into detail about so many scholars, scientists, artists, writers, and rulers that the class devolves into a jumbled mess of names by the time the midterm rolls around.  The consequence is that the larger picture, ethnographic developments, political trends, etc are lost in the mix.  Nonetheless, it's not hard to get a good grade, as long as you can deal with rote memorization.\nWorkload:\nLots of memorization of names and terms, work for Discussion section depends on individual TA requirements, an easy midterm and fair final.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 22, 2005",
            "review_content": "\nProfessor Radwan is a great person, but not a great lecturer.  I thoroughly enjoyed Professor Radwan outside of class; she is funny, energetic, and really cares for her students.  Unfortunately, this was her first lecture and she had some difficulties communicating the entirety of Islamic Civilization to the class.  Many times she would get flustered and just recite a bunch of information and details in a completely unorganized way leaving students scrambling and confused whether or not what she said was important to write down or was not.  \nMy T.A. was absolutely awful and incredibly mean so it didn't help in clearing up all of the information Professor Radwan threw at us.  In short, I want to say I don't recommend this class simply because it was hard to follow her all the time (her accent is difficult but still understandable), mostly because lectures weren't structured in the best fashion.  \nHowever, if you have the opportunity for a seminar (i.e. Lit Hum), you should definitely take it with Professor Radwan.  She's young, fun, and totally passionate about her job.  \nWorkload:\nThe \"workload\" was sort of a joke.  There's a coursepacket and one textbook (The Oxford History of Islam).  There are NO essays.  30% discussion; 30% midterm; 40% final.  She even offered a 5% extra credit assignment because so many people bitched and moaned about the difficulty of the midterm, which really wasn't that bad.  Personally, I found the class to be an easy A. \n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 13, 2005",
            "review_content": "\nI'm sorry, but Radwan is easily one of the most awful professors at Columbia. \nHer lectures at incomprehensible.  She seems to hate when students ask questions! She comes into class and reads directly from her notes.\nHer presentation is almost always inadequate. Even people in the first row cannot understand her, and she refused to do anything about it despite complaints! Further, she comes to class and read DIRECTLY from notes she has prepared. AWFUL. \nIn short, she is just terrible as a lecturer for a large class.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 21, 2005",
            "review_content": "\nIt is hard to fall asleep in Professor Radwan's class. The woman's got spunk, and she's not too keen on bullshit, which is both refreshing & frustrating at the same time. \nAs a person, I love Prof Radwan, but as a student trying to follow her lectures, life is not so grand. My personal assessment is that she is a fairly impatient person, and as such, she likes to speed through things and cut the crap; but when she does this during a lecture (as she often does), it's hard to figure out what's going on. Her disdain for what she sees as unneccesary will more than once lead to your confusion, especially when it comes to arabic names. She hates taking the time to write things down on the board, so as a result, you notetaking is a spelling free-for-all when it comes to names or titles.\nAll this aside, I would love to have Prof Radwan in a seminar class. She's energetic and engaged and genuinely interested in teaching. Big lectures though, are not her style, and--as much as her persona shines through--you suffer for it.\nWorkload:\nLight to Moderate. Weekly readings, some of which are uneccessary, and a midterm & a final.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 14, 2005",
            "review_content": "\nWhile the reviews from Professor Radwan on here seem very positive, I'm going to have to warn you all not to take this class with her.  While the syllabus and readings are organized and manageable, her lectures have left me more frustrated and confused than any other class I've taken at Columbia.  She refused to use a microphone in a huge lecture hall, and supplements her lectures occasionally with powerpoints or handouts with the names and places being discussed.  If you have no previous experience with Islamic civilizations or the arabic language, it makes for very challenging note-taking when she doesn't come prepared with the list of terms.\nThe only saving grace may be if you have a good t.a., but then again you are not saved...many people have complained about the inconsistencies in the midterm grading.\nOverall, I obviously don't recommend her at this point. More experience with the course and with a larger class size may help her improve.\n\nWorkload:\nweekly course packet reading and text book reading.  mandatory discussion sections.  midterm (ids and essay), and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 17, 2005",
            "review_content": "\nI had Noha for 2 semesters of Lit Hum and despite the 2 hr classes I had a good time. Noha is new to Columbia from California yet has already found a way to effectively and interestingly teach this course. I think much of this comes from her personal experiance with the culture invovled (more so the first semester as she is Egyptian) as well as being acquainted with some of the texts when she was younger. She is upbeat in class, always interested in what you have to say, knows what shes talking about and tells you what you need to know without the bullshit.  She expects you to participate in class though. Dont take her if you want to sit in class and do nothing. \nI would take the class again if she was my teacher. I highly reccomend her to anyone. \nWorkload:\n4-5 papers based on the semester, personalized midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 16, 2005",
            "review_content": "\nNoha rocks super hard. This is the class that I really look forward to each week, due in part to Noha's great teaching. One reviewer wrote that Noha spends too much time focusing in on the small stuff and not enough time on the big ideas, yet I haven't found that to be the case at all. Ms. Radwan takes care to place the works in the appropriate context and does a great job of tying them all together to create a narrative of western literature. She certainly does focus in on the text in a line-by-line fashion much of the time, and thank goodness! She understands that in order to understand the \"big ideas,\" one must first understand the specifics. On a personal level, I've really appreciated how cool Noha is and how much of an effort she's put into making the class really fun. \nWe've had a few class outings and extra study sessions (nothing to sniff at when you realize she has two young children,) and she even invited us to her house for dinner and a movie. All in all, if you get Noha, count yourself lucky and enjoy the ride.\nWorkload:\nNormal for lit hum, lots of reading. 3-4 papers that increase in length as the semester goes on, (note: you won't get much feedback on the papers if you don't ask her specifics.) A normal midterm, and the same final that everyone takes.\n"
        },
        {
            "course_name": "Themes in the Arabic Novel",
            "review_date": "January 16, 2005",
            "review_content": "\nProf. Radwan is awesome! This is the course I put the most into and got the most out of. It's definitly one of my absolute favorites at Columbia and has inspired me to take more in the department. At first, I was really in awe of  Radwan because she has such a commanding presence and authoritative voice but, as the semester progressed, I came to really respect her as a person and admire her as a scholar.  Listening to Radwan's insightful comments, it's hard for anyone to deny her firm grasp on the subject material.  I looked forward to going to lectures and felt they moved at a comfortable pace.  While she's open to students' opinion, she's not one of those newfangled profs who believe everything some how makes sense--she won't hesitate to tell you when you're off kilter (which is appreciated!).  My only complaint is she allows certain students to monopolize the discussion and often calls on the same opinionated students again and again. Besides for this minor glitch in facilitating class conversation, Prof. Radwan is really wonderful.  She's surprisingly easy to talk to one-on-one and very encouraging when drafting papers.  At times I felt she was my age because she's so approachable and has a good sense of humor.  I highly recommend taking a class with Prof. Radwan because she's a great lecturer, approachable scholar and friendly individual.\nWorkload:\nA book a week--if the first class is on a Tuesday, you'll be expected to read a book by Thursday, which is difficult if you're still putting you schedule together and shopping for classes!  Some of the books are charcoal dry, others are unnecessarily avant-garde but most are very enjoyable and Radwan's lectures tend to illuminate the texts.  She occasionally assigns convoluted secondary sources but you'll be ok if you just skim them since some are painfully pedantic and don't merit meticulous dissection.  Active class participation is required (she'll call on you even if you don't raise your hand!).  Two papers (one that is 10pgs and another around 15pgs). She grades fairly (probably more on the easy than hard side).  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nNoha is really cool. She has no scruples about shutting people down in front of the class in her brusque Egyptian voice. That said, her idea of a class discussion is everyone responding to her question directly and here agreeing or disagreeing with them in turn. Pretty lame. She teaches lit hum as though it were any old literature class and thus misses the point entirely. the papers topics are really ridiculously specific -- she is not a big ideas person but a line by line person which is pretty tedious / a shame when studying plato, dante, etc...\nIn general: not bad, but could be better. then again, she's just a rookie. probably will be a lit hum legend in a decade or so. \nWorkload:\naverage lit hum - 3 papers, midterm, final - c'est la vie\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 02, 2005",
            "review_content": "\nI really like this teacher! She is very nice, makes class fun, is young, and clearly has the energy and interest to teach. I think that she is very real and fair. An added bonus is that she is from Egypt, so she does not hold the \"Europe = Only True Culture\" idea that the CORE promotes, though she does like the works we read (which rubs off on the students, believe it or not). The only fault she has is that she does not write too much on the essays she returns. However, we have told her that and she will probably change soon. (This was her first semester; she is from UC Berkeley.)\nWorkload:\nA lot of reading (like any Lit Hum class) and 4 total essays that build up nicely, ending in a 4-6 page paper (not bad, eh?)\n"
        }
    ]
}