{
    "prof_info": [
        {
            "prof_name": "Chloe Layman",
            "prof_id": 5771,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 23, 2013",
            "review_content": "\nJust please try not to take CC with Chloe. I strongly agree with the review below. I am embarrassed to have had Chloe as a teacher. She may know a lot about Philosophy but honestly is not fit to be a teacher. She is extremely uncomfortable with public speaking and lectures as if addressing an invisible spot on the wall. A couple students turned around the first few weeks to see what she was looking at. Nothing. She doesn't look us in the eyes too often when she talks to us. She is not mean, but she is in no way nice. She's just weird, strange, and awkward. She occasionally snapped at students for doing harmless things like raising their hands while she was speaking, or walking in front of her to get to the only open seat when arriving a few minutes late. I am so disappointed in Columbia for hiring this woman to teach us as taking this class with her was a complete waste of time and energy. \nWay too much effort needs to be put into Chloe's class for a Core class. One thing she does that is really wonderful is that she makes outlines for every text, covering all the important points. But reading the texts and/or the outlines is never enough. Chloe's essays and assessments basically will never test you on your ability to remember a philosopher's point of view or an important point made in a text. She'll give you that and ask you how the philosopher arrived at the point, or how he proved it. Most often, she asks questions that she, a Descartes scholar, is curious about, saying \"this is just something I always think about and I'm curious to see what you guys think.\" These questions are often impossible and unimportant to our basic understanding of the text. A couple of students have said they've brought these questions to older Philosophy majors they've known who could not answer them. ALSO, she gives these ridiculous bi-weekly 15 quizzes full of these questions that cover up to 3 philosophers at a time. Sorry Chloe, but a 15 minute reading quiz should basically only assess whether or not we've done the reading, especially if administered BEFORE our discussion of a text. \nHer grading is almost cruel, and probably based in her deep insecurities. Though, it is not impossible to do well in Chloe's class if you kill yourself working and know the one answer she approves of for her questions. She grades like it's a math class. Hardly ever gives partial credit. You either get the answer 100% or you're getting an F on you're quiz, again (she drops the lowest quiz though). \nWhen you finish your class with Chloe you will notice that though you've read the same texts as other CC classes, but you will have had a completely different dialogue about it. Chloe is not concerned with her class understanding the main points of the text, or having a general knowledge about a philosopher, but rather she only cares about things that are interesting to her. This is why her class is a waste of time. \nSo disappointed with you, Columbia. How could you let this happen!? \nRUN! \n\nWorkload:\n3 short papers (2-3 pgs) [ridiculous questions], 1 long paper (4-5pg), plain rude quizzes, midterm and final (short answers and essays that she gives you ahead of time, No IDS!)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 11, 2013",
            "review_content": "\nChloe is clearly a very smart person. She is also a hyperbolic example of why good researcher do not necessarily make good professors. She was without a doubt the least personable, most awkward professor I have ever encountered in my life. I have never met a teacher more incapable of interacting normally with students. It seems to me like it is as painful to teach for her, as it is for us to be taught.\nClass discussion were stale, boring, and too scarce. Chloe talks too much, and clearly only wants us to regurgitate answers from the outlines she writes. So its more like we listen to her talk for a long time, then she asks us a question, we search where on the outline to find it, spit it back, and we move on. I can't remember if our class ever got really into a topic. I don't think any of us ever really debated, or argued, or cared. No effort was ever made to impact all of this philosophy to our lives, which is just absurd, because this is really what Contemporary Civ should be. I have never sat in such a dead core class, and this was not because my peers and I are idiots. We just were never really rewarded for doing anything but complying with Chloe's oppressive, regimented plan. \nAssignments were convoluted and unclear, especially paper prompts, which were utterly absurd in their complexity and specificity. I am doing alright in the class but find the grading, especially on the quizzes and midterm to be absurdly difficult. Something is wrong when in a core class a bunch of the class gets a C on the midterm. That's not how it's supposed to work. Chloe gives great feedback on papers. Unfortunately you don't care enough about that feedback because the paper topics are so inaccessible and boring that no one is invested in finding out how to improve. Like the class discussions, I got really nothing out of the assignments except for an uncomfortably in-depth understanding of final causation. \nHonestly, I don't know if it is possible for this course to become any semblance of normal or even merely mediocre. Every aspect of it was off, from the quizzes, to the discussions, to the essays. Even the office hours were ridiculous, with some students having to wait hours, literally, before seeing Chloe. I just can't imagine that this class could ever be valuable.\nThis is without a doubt the worst and most strange class I have taken at Columbia. I want to be clear that I say this not as someone who is bitter about his or her grade, because I am happy with my grade. I am just trying to be honest about what this class was like. I don't think it helps any party involved to lie and say I got anything positive out of this class. I feel cheated out of a potentially enriching experience. \nI think Chloe is a good person, with good intentions and is one of the hardest workers I have ever encountered. I don't mean to construct a tirade on her personality, I just think she is not suited to teach CC, or any class for that matter. \nWorkload:\n3 short papers asking you to summarize arguments and then resolve conflicts in them (highly confusing but only 3 pgs, one longer paper (5pgs), difficult midterm, difficult final, announced quiz every 2 weeks or so that is graded quite harshly\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 18, 2013",
            "review_content": "\nChloe Layman is an interesting character. A little bit insecure, somewhat OCD, but she's harmless. She's had maybe 1-2 years of actual teaching experience, so she's relatively new to things. I wouldn't say her class demands a lot of work in terms of reading. Most of the texts she assigns are small snippets or paragraphs, and even then, you don't necessarily have to read to be able to participate in the class and do your papers. She provides thorough notes to supplement our readings and discussions, and regularly makes study guide materials for our tests. Although our paper assignments tend demand a little more effort than what's expected in class, they're relatively short (3-5 pages) and few in number. We also have a few in-class \"reading check\" quizzes, but Chloe always reminds us ahead of time. She tests material that we've usually  gone over in class, so there isn't much extra work involved other than studying the notes she's made for us. The highest quiz grade is counted twice, and the lowest is dropped. No IDs on midterm/final.\nWorkload:\nAttendance/participation, a few quizzes, 3 short compositions (2-3 pgs.), 1 longer essay (~5 pgs.), midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "October 29, 2013",
            "review_content": "\nChloe Layman is probably the worst teacher I have ever encountered.  She tries really hard to be kind (sometimes) but she is utterly incapable overall.  Her workload is not terrible, she has us read a small excerpt of the text but what she expects us to do with it is very strange.  The essays will probably make you cry.  They made me cry.  Twice.  More than that she is very strange and in a large group of students resorts to rudeness in order to deal with her insecurities as a teacher.  She says things like \"I'm not your therapist\" when you are worried about grades, and she won't let you raise your hand if someone else is talking.  She also never looks in anyone's eyes during class.  The average on the midterm was a C+...If you go to her office hours she is nicer and tries to make things work but overall she is a failure of a teacher.  It's unfortunate because I think she does want us to do well, and most of us will probably end up with an A or B but the journey there is like finally reaching the ninth circle of Dante's Inferno.  How I wish I was in Lit Hum right now.  If you can switch out, DO IT NOW.  \nWorkload:\nReasonable, but you have bi-weekly quizzes that a lot of people fail.  Who gives quizzes in CC?  Not too much reading and she provides handouts for the readings each week.  Translating the handouts is a different story...\n"
        }
    ]
}