{
    "prof_info": [
        {
            "prof_name": "Jennifer Cole",
            "prof_id": 2855,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "May 21, 2007",
            "review_content": "\nA DISASTER! Jenna is a terrible teacher (and person), and only because of her my experience in Frontiers was horrendous. She is a terrible teacher, doesn't know anything about any of the topics of Frontiers, and she is a very hard grader. I don't want to waste my time, so STAY AWAY from her.    \nWorkload:\nUsual frontiers: Weekly set of 2~4 questions, online response on courseworks, hard midterm and final. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 04, 2007",
            "review_content": "\nJenna is a terrible teacher.  My experience in Frontiers was horrific partly because the class is terrible, and partly because she is a horrible teacher.  She knew nothing about any of the topics which we covered, and often deferred to more knowledgable students in class to answer \"hard\" questions.  She never grades anything and didn't answer a single lecture question after the first one.  This could be used to your advantage, however--if she doesn't return the work, you can't be expected to get any better.  There are more examples of her incompetence, but I don't want to waste my time listing them.  Suffice it to say, the class is mindlessly easy and just hang in there!  It will be over soon.\nWorkload:\nstandard frontiers.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 26, 2006",
            "review_content": "\nJenna did a great job of breathing some life into a class that was otherwise unbearable for me. I fell asleep during almost every lecture, yet appreciated Jenna's discussion section. \nShe tried her best to clarify any questions people about the material. She was a tough grader on the problem sets yet I felt prepared for the final. I don't know how I would have done in Frontiers if I hadn't had Jenna as a TA. She was reasonable, kind, and understanding.\nWorkload:\ntypical frontiers: problem set each week, online response on courseworks, no midterm, final. Jenna had us do some groupwork which was actually pretty fun\n"
        }
    ]
}