{
    "prof_info": [
        {
            "prof_name": "Jeremy Carlo",
            "prof_id": 2664,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Experimental Physics",
            "review_date": "December 17, 2007",
            "review_content": "\nJeremy was a very very nice guy who was extremely accomodating. Here's the thing - he really didn't impart any great knowledge on you.\nThe TA's did 95% of the work as far as I could tell from grading to managing the labs. Carlo would stop in every now and then to check on how things were going which was nice but he never had any significant purpose.\nGo to class the first 3 or 4 sessions. They are the most essential because you get assigned a lab, get your book etc. After that he goes over the labs and you can read about those on the website or if you download the PDF file for the Experimental Physics course.\nHe's a funny guy and if you bother going to lecture (only about 1/8 of the class was going last time I checked) you may hear some funny jokes, corny yet great lines and you'll hear a fair bit about the people in the physics department and Jeremy's past mentors. Its good times but not essential to go.\nHere's a suggestion - Bring a laptop to labs. They are theoretically 3 hours long but most labs take only 1-2 hours tops. Recording the data on your laptop right then and there also allows you to plot your data and see if you're anywhere close to the error/shape of the data distribution that you should be at.\n\nWorkload:\nLight. Maybe 3-5 hours right before the lab filling out the analysis sections of the Lab Book and putting the results into your lab report. Grading is fair if you're on good terms with your TA. 10 Labs. 2 official absences allowed. \nDon't bother trying to use them tho.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "February 21, 2006",
            "review_content": "\nJeremy is a rock star on the scale of Mick and Keith.  He is a great teacher, explains even the vaguest concept from lecture in an engaging and interesting way-- he made going to recitation terrific.\n"
        },
        {
            "course_name": "General Physics Lab I",
            "review_date": "November 16, 2005",
            "review_content": "\nHands down, the best TA I have ever had.  Heck -- one of the best *teachers* I've had at Columbia.  Jeremy is not only a physics genius but a gifted instructor able to explain the most difficult concepts with wit, brevity, legible handwriting and clear chalkboard diagrams.  He's also a generous grader and a very, very, very nice guy.  I actually enjoyed physics lab most of the time (GASP!).  If there's any justice in the world, Jeremy will get tenure at a big-\nname university before he's 30.  If he wins a Nobel Prize... you heard it here first, folks.  But I doubt he'll win one -- because he spends too much time and attention on undergraduates.  This guy was born to teach.  He cares too much about us (at the expense of his own career).  \nWorkload:\nLab reports completed in class.  He grades generously.  You can always ask him for hints and explanations in class.  Be sure to show up on time, as the first 10 minutes of lecture-style explanation are ESSENTIAL for understanding the experiments.\n"
        }
    ]
}