{
    "prof_info": [
        {
            "prof_name": "Eric LeMay",
            "prof_id": 9582,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 21, 2009",
            "review_content": "\nI LOVE Eric. He is the most amazing writing professor you could ever encounter as a freshman. I was lucky enough to be in his section, and despite all of the hatred that this class gets, I enjoyed it. Eric sincerely cares about his students and spends much of his time meeting with students, workshopping, and providing extremely detailed and useful feedback. He would post an audio feedback file for each student upon returning papers, which was insightful. We spent a great deal of time brainstorming and working with sources in class, and this was always helpful. He is not an easy grader by any means, but the class is fair. I HIGHLY recommend this class and anything he may teach in the future.\nWorkload:\n4 papers, the usual UW workload\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 19, 2009",
            "review_content": "\nDr. LeMay is a spectacularly good teacher who puts an incredible amount of effort into this class. Unfailingly fair grading, flexibility, and engaging lessons made LeMay's UW section not only enjoyable, but the best class of my first semester at Columbia. Students deride UW, but LeMay is dedicated to improving this class, transforming it into a stepping stone for future academic work. Although many of the assignments may at first seem irrelevant to working in the academy, virtually everything LeMay does is constructed to prepare his students for scholarly writing. Yet, he also helps in other writing disciplines. \nMake sure you spend time to get to know LeMay, as he's a wealth of knowledge on everything from literary theory to cheese. Gold star for LeMay!\nWorkload:\nTypical for UW--\n4 essays. Be prepared to write papers under pressure/over weekends, as he'll sometimes assign a paper on Thursday that's due Monday. Plan accordingly.\n"
        }
    ]
}