{
    "prof_info": [
        {
            "prof_name": "Alexander Casti",
            "prof_id": 1322,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "January 18, 2015",
            "review_content": "\nI am rather tardy to the party here in my review of Prof Casti's teaching chops. I took his Calculus 1 class, summer 2013. I write this because I think BY FAR Casti's class is the best I have had at CU. Mowch's Bio class lectures were good, but her exams are unfair compared to Casti's. He isn't personalizing the course to such an extent that it leaves out students who do not approach learning the way he does. This is not the case with Mowsch. Its her way or the highway. But, I digress....\nI'm now about to finish my postbac premed courses, and well, Casti still takes first place. Mind you, I hear there are great profs to be had if you are at CU proper and taking the Core classes. Sadly, I am one of those people you see at the airport running to catch a red-eye with one foot wedged in the closing airbus door. My life has been one of so much curiosity that I find that career-wise, in the world we live in, I must now get serious, and hence, I am an older student with no time to take the classes I would really like to take from the utterly riveting profs out there, which I enviably here exist. I'm treating my time here as a sort of technical school; so I can make enough money to write my poetry. May I not be struck by lighting for this.\nNow about Casti: everything is written out on the chalkboard. So unless you are asleep (which you cannot be because he's very animated, funny, and engaging), or have some sort of deficiency (hand-eye coordination, broken arm, personal calamity, etc.) there should be no problem keeping up with his lecture, which is crystalline in its directness, authenticity, accuracy, and detail. He is very generous of heart. How can anyone not appreciate that?! The man is sweating through his shirt every lecture because of the effort of writing across the board all class period. He does this because he believes this is the best and only way to truly learn calculus. There is no Powerpoint slide. He isn't lazy in any sense of the word. His exams are fair. If you did the homework and understood his emphasized concept in his lectures you should get an \"A\" in this course. There really is no reason not to, because believe me when I say that this isn't my forte; and if I can do it, you certainly can. It is possible to get a 100 on his exams. This does not mean the class is easy. Please don't misconstrue what I am saying here. You have to work for the A, but this you should know from being at CU, no?\nI didn't have to read the book. In fact, I would have stopped after Chapter 2, but I'm way too uptight for that. So I gave the book a cursory nod, reread my notes a couple of times and redid a few key problems (which will become apparent to you after rereading the notes and having done them once prior). You must do the homework to do well. All of it. \nCasti really knows his calculus backwards and forwards, and I understood everything he gave in class just from his explanation and my notes of his lectures. If I needed clarification, I stayed after class and asked. This is a professor with a plan. He knows exactly what he's going to do each day, and it gets done efficiently. You are expected to participate; shy people you will just have to get over it, and you egotistical lot (myself, sometimes included here), you will have to check yours at the door. Looking stupid or giving a wrong answer means nothing to this professor. He has your best interest at heart, and you will never be made a fool of. He simply is too down-to-earth for that sort of pompous lack of generosity.\nThe final is cumulative. But so is his review session. He gives extra time on the exams. It's not about rushing through and getting it wrong. He isn't trying to trick you. He's a very reasonable person.\n\nWorkload:\nHomework, quizzes, class participation: 25%\nMidterm: 30%\nFinal: 45%\n"
        },
        {
            "course_name": "Principles of Applied Mathematics",
            "review_date": "April 28, 2005",
            "review_content": "\nImagine a blond Ben Stiller (same idiotic sense of humor by the way) trying to teach you the higher points of Linear Algebra. You might have already gotten the feeling that this little story will not have a happy end, and I would say that you are at least partly correct.\nProfessor Casti thinks he is funny; and most of the time, that's a problem. He's the type of smart-a** who just can't help to make stupid puns and jokes throughout the lecture. The upside to this is, of course, that now and then, he actually scores on his humor, which in turn lightens up the mood of the class a little.\nThat aside, his teaching is relatively average. Instead of actually explaining the key concepts presented in an understandable way, he likes to ride his theorems and proofs. Being the fluff that he is, he tends to make quite a few errors during the lectures and he is relatively sloppy with his notation, which at times can be somewhat annoying and potentially confusing. When it comes to notes, this is also the type of professor who likes quantity over quality, so expect to be writing for 150 minutes straight during his class. Since he follows the required book (Sadun) almost to the dot, there is little else to turn to if you can't grasp a concept in its entirety. To make matters worse, the book is pretty pathetic.\nSo, to make a long story short:\nÂ•\tProfessor: B\nÂ•\tBook: C\nÂ•\tOverall Class: B\nProfessor Casti is adjunct faculty, so he's pretty hard to get a hold of outside the classroom. However, he did hold a review session for both the midterm and the final, so that was a fair move on his part.\n Homeworks are sporadically assigned throughout the semester, seven in total. Generally, I would say that they are of moderate difficulty, but very generously graded by the TA. So, start early on them, and youÂ’ll do just fine.\nWorkload:\nÂ•\t8 Homework Sets, generally assigned every 2 weeks; a bit sproadic in nature. They are moderate in difficulty but graded quite leniently, so start early, and you'll be fine.\nÂ•\t1 Midterm/1 Final - closed book, no calculator, just paper and pencil. Grading is fair, but the curve is pretty high overall, so study or die!\n"
        },
        {
            "course_name": "Partial Differential Equations I",
            "review_date": "December 04, 2002",
            "review_content": "\nIn my opinion, Alex Casti could not teach his way out of a paper bag. He goes through material very quickly, often skipping steps and not explaining key points. This combined with his inane sense of humor make this class a really unbearable experience. Almost nothing was learned during the course of the semester and any motivated student would be able to cover all of the material that Casti covered within a few days of motivated study. I definitely do not recommend this class.\n"
        }
    ]
}