{
    "prof_info": [
        {
            "prof_name": "Matt Moss",
            "prof_id": 11424,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "History of Philosophy I: Pre-Socratics to Augustine",
            "review_date": "April 11, 2012",
            "review_content": "\nThis was my first philosophy class and I was really excited to study the great philosophers whose names were ubiquitous on libraries, statues, etc. Suffice it to say that I was genuinely curious about philosophy. \nUnfortunately, this class was extremely difficult and caused me unprecedented stress as a first-year. The works were, of course, challenging to get through and writing philosophically was something I had never done before. I really needed guidance, but lecture did not provide me with this. \nWorse, I went to every single lecture and struggled to stay awake every single time. For those insomniacs out there, get your hands on a recording of Mann lecturing and I can guarantee you that you're problem will be solved. Okay, that's a little harsh, but you get the idea. Maybe that's my fault... The point is, however, by falling behind in understanding lectures and readings, I never felt comfortable talking directly with Mann. I never asked him questions and I had plenty. \nDespite all the trouble I had with this class; I made it through, thanks to the TA, Matt Moss. If you're looking up Matt Moss to see how he is as a teacher - whatever it is- take it! He's phenomenal. His recitations made philosophy exactly what I envisioned when I signed up for this course: engaging. He is an upbeat character, listens to students really well when they pose ideas, and is ultimately quite understanding that members of the class are at different levels. Moreover, he provides support to everyone and does a thorough job every single time. All this is only possible because he loves thinking and wants to help others do the same!\nAll in all, I recommend Matt Moss and I do not recommend Mann or this course if you're just in that stage of 'being curious about philosophy.'\nWorkload:\nDense. Very dense. Most could not keep up with the reading, but that will be okay assignment wise... you'll just have to prep hard for the final. \n"
        }
    ]
}