{
    "prof_info": [
        {
            "prof_name": "Taylor Carman",
            "prof_id": 152,
            "total_reviews": 35
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "December 18, 2016",
            "review_content": "\nLike all previous reviewers have said, Carman's an excellent lecturer who makes his points very clear and takes time to clarify and explain difficult concepts. He also has a great sense of humor and endless knowledge of both philosophy and subjects that might not seem to be closely related to philosophy at first glance, like neuroscience and classical music. His classes are a joy to be in, and you manage to get a lot out of them, though I can see that people with a bit of knowledge in philosophy already might find the style of his lectures a bit boring, as he tends to reiterate points quite a bit to make sure we really understand the concepts. Carman also takes time to answer more or less any question students might have, sometimes to good effect and clarifying valid confusions, and sometimes to just entertain the inquirer while trying to steer the subject back to the lecture at hand. This makes his lectures seem a little disorganized at times, though I think he always gets time to say everything he wants to say.\nAs previous reviewers have also said, Carman isn't an easy grader. It's not impossible to get an A or A- in his class (I got an A- on both the papers I turned in), but he really makes you work for it, and if my peek at his gradebook was accurate, he's given out a few Cs and C-s to particularly bad papers, with the majority of grades being Bs. However, Carman more than makes up for his difficult grading with extensive and fair feedback on your writing. I never felt that I deserved better than I got in his class, though some might find Carman to have overly high standards. \nWorkload:\nFairly light- 2 papers, each around 5-7 pages, and a final. Readings were very short and for the most part easily digestible.\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "July 30, 2015",
            "review_content": "\nProfessor Carman is very engaging lecturer.  He patiently explains the concepts and, if you don't understand something, he is always available at office hours and will spend a lot of explaining things.  I don't agree with the other reviewer, and I think that if you really work on a paper, you can definitely get a B+ or A-.  That being said, in order to do well on the papers, you really need to ensure you understand the concepts, which can be difficult.  That being said, the class was great - I would even say that it is life changing!\nWorkload:\nPop quizes, two papers and a final exam.  Regular readings every week that you need to do in order to do well on the quizes.\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "April 15, 2015",
            "review_content": "\nI love Prof. Carman. I love him. He's a great speaker, never boring, and super kind. Sometimes he's even funny! The work load is simple and not too fast paced, and he makes it very clear in class. That being said, it's impossible to get anything over a B on your papers unless you ARE Plato. I mean- office hours, outlining, notes, constant revising of my paper STILL was a B. So, keep that in mind. If you want a simple class where you'll get a B and have a good time and not be stressed, take this class\nWorkload:\nTwo papers, one final. Weekly readings that are simple and not too long.\n"
        },
        {
            "course_name": "20th Century European Philosophy",
            "review_date": "May 24, 2013",
            "review_content": "\nCarman is consistent. His lectures tend to be clear, although every now and then he does end up talking about thinkers and topics that seem somewhat irrelevant for the purposes of the class. I am also of the opinion that his lectures on Heidegger are significantly better than his lectures on Foucault. I don't know if this is because Heidegger is just more interesting than Foucault, or because Carman is Columbia's resident expert on Heidegger. Perhaps it is both. When lecturing on Foucault, he often seemed to be figuring it out as he taught it, which was definitely not the case with Heidegger -- although, again, this might be a consequence of Foucault's unnecessarily (and, I would add, sometimes annoyingly) obscure style. Only when reading Heidegger did Carman offer truly mindblowing lectures. In general, however, Carman will settle for being clear and consistent rather than mindblowing. (For the latter, maybe take Honneth or Neuhouser). The upside of this is that he virtually gave no repetitive, reiterative or unclear lectures.\nThe best thing about this class is Carman's feedback. He reads at least half the essays in the class, and gives extensive, insightful and rigorous (but never harsh) comments. Office hours are very helpful, although he does seem more receptive to students' ideas in class than in office hours.\nAll in all, a good class. Definitely take anything he teaches on Heidegger. If you want a class that will really improve your philosophical writing, take it as well. If you want mind-blowing, earth-shattering lectures, think twice. You will get some, but they tend to be rare.\nWorkload:\nthree short essays, reading tends to be light but foucault's a bitch to read.\n"
        },
        {
            "course_name": "20th Century European Philosophy",
            "review_date": "May 22, 2013",
            "review_content": "\nProfessor Carman is a great guy, and that doesn't imply that he is not a fantastic professor (in fact he is), therefore I always wondered in the past couple of months why nobody had ever reviewed him since 2007. As I was attempting to write this review, I suddenly realized the challenges: \nFirstly, Professor Carman (after these 5 long years) still is an engaging lecturer: He is witty, humorous, a-library-of-interesting-examples, and of course very knowledgeable what he teaches. Sadly, his previous reviewers have already said those good things about him. And yes, he goes on tangents sometimes, either to give you one of the aforementioned examples or to (politely) respond to a student's (half of the times relevant and insightful) question. Unfortunately this has also been mentioned by my predecessors. In general, his lectures consist of: him talking plus Q&A; sessions with a mixture of debates and anecdotes. If you have fetishism of highly \"structured\", professor-\"dominated\", \"normalized\" lectures, with little or none \"deviation\" from the textbooks, look elsewhere. If you don't, this is the most fascinating course you can take in the philosophy department(s), and I sincerely hope that you will enjoy it as much as I did.\nThis, however, is the second challenge: It so easily attains the \"great course\" title that I find it difficult to articulate why it deserves it. Well: 1) The course material was (pleasantly) different from anything you would read in an orthodox philosophy course, in other words, \"radical\". Hence if you were, like me, frustrated about the stuff philosophers said before Nietzsche, you would probably find what Heidegger and Foucault said refreshing and liberating, and perhaps at the end of the semester feel frustrated again for a different reason. 2) This course seemed to attract a group of intelligent and well-read students, and risk-takers (like me) who didn't know anything about the topic but stubbornly decided to stay simply because Heidegger+Foucault+Kuhn+Carman were awesome. The classroom environment was therefore slightly competitive yet the atmosphere was perfect for learning. If you were up for the challenge you would learn a ton.\nTo address a few concerns before I end this (ridiculously long) review:\n1) Professor Carman is not a particularly harsh grader and the assignments are pretty straight-forward. What hinders you from getting an easy A is that you have to write much better than Heidegger and Foucault about what they intended to talk about after reading their writings and therefore getting confused about what they intended to talk about (t do well in your first essay. It gets better as you become more familiar with the language and literature. \n3) Professor Carman is, as I said at the beginning, a nice guy. There is no need to feel intimidated to talk to him during office hours. But you do need to be prepared in order to get the most out of it.\nWorkload:\n3 essays (first two about 1500 words; last one 2000-2500 words). SHOW UP (he takes attendances and doesn't tell you how he deals with the data. Foucault would tell you that Carman is thus using \"disciplinary power\". Carman would tell you that \"disciplinary power\" is dangerous but not bad hence you have to deal with it.)\n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "July 10, 2007",
            "review_content": "\nCarman's a good professor.  He knows his stuff and you can tell he loves what he teaches.  His lectures can get a little boring/frustrating when you're not sure where he's going with them, because he does tend to go off on a lot of tangents, usually sparked by a student's question.  This can be good if you want to debate the nuances of philosophy, but, like I said, it's frustrating if you just want to learn what he's supposed to teach you and what you're going to have to write about.  He does enliven his teaching with lot's of subtle humor, though.  He finds lots of philosophical things hilarious and talks about them in a strangely academic tone for jokes.  As far as how tough of a grader he is and all of that, I think he is made out to be  a lot harder  than he really is.  I will confess that I literally did about five percent of the reading and even fell asleep in class a few times (it was at 1030 in the morning and i took the class pass/fail, give me a break) and I still managed to pull Bs on my essays just by reading what I had to read in order to get something written.  My essays were seriously pretty horrible, and he still gave me Bs.  Furthermore, his comments on these bad essays were totally fair and accurate - he pointed out the flaws that I knew were in them.  I think if I had really tried my best and written essays that I had been happy with myself, that he totally would have given me As, because I think he is a fair and not too difficult grader.\nI passed the class, btw.\nWorkload:\ntwo medium-length papers and a two essay question final that wasn't even comprehensive (only on Nietzsche)\n"
        },
        {
            "course_name": "FYS Mortals, Creatures, and Subjects",
            "review_date": "May 22, 2007",
            "review_content": "\n  Taylor Carman requires first drafts before final essays, a request that doesn't seem as big of a pain in the ass as it actually is.  His concepts of first drafts and final drafts differ from those of the rest of the world in that he expects two entirely different theses, theories, papers etc. You would think that as the class continues you would be able to guess at your grade based on the amount of work you put in.  Basically it's a grade out of a hat, and if you go and try to talk to him you'll receive cryptic, \"I can't thoroughly reread everyone's papers beause of the sheer number of papers\" answers that you leave you tempted to fling hamlet in his general direction.  And after you worry and agonize over you grade, you find that the final grade is completely different that what you expected.  I don't mean to sound like a jaded student, trying to get out of my frustration by bashing him on culpa. His lectures were really quite interesting, as he constantly questions whether or not we exist, and if you're into the whole \"it's not 'why are we here?' but 'are we here?'\" line of questioning you'll be thoroughly amused. Also he has no problem interrupting, but don't try and do it to him.\nWorkload:\n3 papers, draft+finished = actually 6 papers\n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "April 19, 2007",
            "review_content": "\nWhat a fantastic survey introduction to 19th-century philosophy! I was worried, at first, that in spending a mere four months in reading and discussing centuries' worth of thought (think of all the accumulated and processed knowledge and thought that Kant, Hegel, Schopenhauer, Kierkegaard, and Nietzsche gave the world) the course would resemble something like a skipping stone. But Prof. Carman has been able to a tremendous amount of good work with very little time.\nBut let me be more organized about this: I'll start with a full listing of the syllabus, because I know that I would have liked to have known this before I started. We read: most of what, in Kant's \"Critique of Pure Reason\", is important to later philosophy with the exception of specialists' concerns; Hegel's notoriously difficult Introduction and Preface to the \"Phenomenology of Spirit\", as well as his lectures on aesthetics; meaty selections from Schopenhauer's \"The World as Will and Representation\"; Kierkegaard's \"Sickness Unto Death\" and \"Fear and Trembling\"; and Nietzsche's \"The Gay Science\" and \"Beyond Good and Evil\" plus healthy servings of other works like \"Thus Spoke Zarathustra\", \"Genealogy of Morals\" and his essay on \"Truth and Lies in an Extra-Moral Sense\". \nWhat Prof. Carman does with this is pretty impressive. He is always prepared, coming to class with a detailed set of notes and yet familiar enough with the texts (he's a Heidegger expert) to extemporize. He's the sort of person who immerses himself in philosophy and academia from all ages, and he will not infrequently highlight connections between these philosophers and those of ancient Greece (Plato, Aristotle, Sextus Empiricus, etc.) as well as those of the 20th century (Wittgenstein, Allison, Westphal). Thus, he really gives you as thorough a context for appreciating these thinkers as can possibly cram into two sessions a week... \nHis explanations of exceedingly dense and circuitous prose (like that of Hegel) are manna from heaven for someone struggling to understand these pivotal works. While he is extremely open to fielding questions, even from those who it seems don't do the readings or come to class with preconceived notions of what these philosophers or ''philosophy en generale'' are about, the structure he imposes on class time is usually adhered to, enabling us to get a reasonable amount of depth. \nProf. Carman is affable and extends himself a fair amount in meeting students after class and engaging in impromptu post-class discussions with those students eager (and impertinent) enough to accost him before he's out the door. My only problem with this class was the choice of TA, (who KIND of approachable and yet rather abrupt with me on the two occasions I asked him about things) though I'm thinking Prof. Carman didn't have much to do with that decision. \nIf you want a solid teacher with a well-planned course, take History of Philosophy: Kant to Nietzsche. Don't expect it to be easy, just because it's a survey. His papers demand a lot of thinking and work and he grades with a demanding eye. I (without intention, I swear) scanned his gradebook when he was telling me my grade for the first paper (my paper was with the TA, who wasn't in class that day) and I noticed that most of the papers had gotten B's and B-'s. \nThe final exam is just like doing his papers, only with harsher time restraint.\nWorkload:\nTwo five-page papers and a final exam (no midterm). Medium to Heavy reading, though he makes sure that heavier readings are given over the weekend. \n"
        },
        {
            "course_name": "FYS Mortals, Creatures, and Subjects",
            "review_date": "March 05, 2007",
            "review_content": "\nProfessor Carman is a really great professor. He's engaging and the class is surprisingly interesting given the tough reading. The class is very interactive and it's a good place for debating some fundamental philosophical arguments. \nThe only downside to the class is that he seems to be very fixed on his viewpoint at times. I find this to be a problem with most academics, however, so don't be surprised. Fight for your idea in your papers and argue persuasively. In the end, you'll have learned to argue your ideas more efficiently despite the grade. \nWorkload:\nReasonable.\n"
        },
        {
            "course_name": "Hermeneutics, History, and the Human Sciences",
            "review_date": "December 26, 2006",
            "review_content": "\nI don't normally write reviews, but I noticed that several of Professor Carman's previous reviewers seem to think that he is an unfair grader and a poor lecturer.  I've studied philosophy at a few different institutions, and Professor Carman is easily one of the best I've had.  He made sense of Foucault, which is no small task, and he was perfectly clear about what he expected from the students (excellent papers, not written the night before the due date).  He is accessible, answers his emails, and responds to questions in a sincere manner.  In response to the person who conducted the \"experiment\" with the term papers: I never once went to Professor Carman's office hours to discuss the paper topics, nor did I rehash his ideas, yet I still received A's.  I think it is safe to say that Carman is well-read and  experienced enough to know when someone has not done any research.  Sorry for the snark, but really.  I read the previous reviews before I took this class and was a little nervous about what to expect, so I just want others to know that I am happy I took it.  (If you think Carman is difficult, try studying non-classical logic with Professor Gaifman). \nWorkload:\nNormal amount of reading; if you don't understand it, don't worry, Carman will clear everything up in the next class.  Three term papers, no exams.\n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "July 19, 2006",
            "review_content": "\nProfessor Carman has a terribly frustrating teaching style. \nHe fields questions from everyone and gives a ten minute answer to each (I'm not exagerating). He does so even if the questions are entirely irrelevant. This means that he isn't able to go into much depth and is always running behind, usually keeping the class five minutes late. \nHis lectures are also somewhat disorganized and overly simplistic. His grading, however, is very severe. He assigned paper topics on subjects that he only briefly covered and then pounded each paper with correctives. \nHe seemed to expect  a lot more from papers than he was willing to give in lectures. I had a grad student who is specialized in Nietzsche look over my paper on Nietzsche before I handed it in, and she thought it was worthy of an A. He only gave me a B on it.\nHe does, at least, read papers thoroughly and give extensive comments. I feel that I learned much from the readings themselves but very little from Professor Carman.\nWorkload:\nModerate amount of reading considering the breadth of the topic. 2 papers (very severely graded) and a final.\n"
        },
        {
            "course_name": "History of Philosophy III: Hegel to Heidegger or Kant to Nietzsche",
            "review_date": "May 12, 2006",
            "review_content": "\nTaylor Carman is probably the best person to learn 19th and early 20th century philosophy from at this school.  His lectures are always extremely coherent, well-rounded, and reasonable, and he takes students' questions and comments seriously and answers them directly.  His lectures are quaint and charming enough so that usually I didn't fall asleep.  The reading load for the class was very manageable: no more than 40 to 50 pages per class, and often much less.  He knows how hard this stuff can be and wants you to take your time reading it.  I would take most anything he offered, especially Heidegger, which is his specialty.  Again, a very solid professor.\nWorkload:\nfairly light for a philosophy class.  less than 100 pages per class, which you don't really have to do. Two 5 page papers with lots of choices for topics.  Final of two essays that wasn't cumulative (only on Heidegger)\n"
        },
        {
            "course_name": "Recent European Philosophy",
            "review_date": "September 22, 2005",
            "review_content": "\nA great guy and a great class. Mostly covered Heidegger with a bit of Focault at the end. He really teaches you how to read and understand Heidegger--first reading, i was LOST, but after the first lecture or two, I was able to start understanding the readings and really getting into some of the complex issues they dealt with. Carmen does a great job stressing and flushing out these ideas without being overly reductive..my only complaint is that he sometimes took too much time answering and contemplating the issues which students brought up. Still, overall, a great class.\nWorkload:\nthree papers, I think one was 4-6, two 5-7 (was originally supposed to be 2 papers plus final but he, with the class' approval, switched the final to a paper).\n"
        },
        {
            "course_name": "FYS Mortals, Creatures, and Subjects",
            "review_date": "May 08, 2005",
            "review_content": "\nProf Carman is a really nice guy, the readings are pretty interesting for philosphy-lite, but like most first-year requirements, this class is pretty boring and useless. Prof. Carman is very gracious about everyone's opinions, even those that are pretty dumb. It's easy, boring, and you can skip as often as you like: all in all, a decent way to fill the Seminar requirement first year.\nWorkload:\nFour 4-6 page papers with revisions, which you get ample time to do. A reasonable amount of reading, which you really don't have to do if you don't want to\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "January 21, 2005",
            "review_content": "\nThis class is boring.  I would almost fall asleep on a daily basis.  Although it is a boring class I found it to be an easy one (and i'm no philosophy expert.)  You don't ever have to do the reading (i rarely did) because Carmen gives very detailed lectures.  The papers are not too bad (you have a lot of options on what to write about) and he gives you the questions that will be on the final.  I never did the readings and was always sleepy in class but still managed an A.  \nWorkload:\n2 papers 6-8 pgs. and 1 final (non cumulative)\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "January 01, 2005",
            "review_content": "\nThis was by far the worst class I have taken.  In my opinion, Carman believes that his thoughts are the only ones that matter, and is very egotistical and demeaning towards his students.  His lectures are boring and not helpful, since even when you think you are understanding what he is saying, he will certainly prove you wrong.\nWorkload:\n2 6-8 page papers that he grades harshly, and a final.  All are worth 1/3 of your grade.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "December 29, 2004",
            "review_content": "\nNice guy, not so great professor. He loves philosophy and it shows, but his lectures tend to lean towards the boring and repetitive. I missed a class on a Thursday and came back on Tuesday to find that he was repeating things from the previous Tuesday's class. Papers are graded ridiculously; it seems as though he wants students to repeat his ideas, though I haven't really figured it out because the grading seems fairly arbitrary. (My first essay and my second essay were pretty different -- one creative, one basically mimicking the notes -- and I got the same grade.) A lot of the reading was excruciatingly boring and heavy-handed (David Hume especially), but Professor Carman went over the work so thoroughly that reading the texts seemed optional. I wouldn't suggest taking his class if you like to be creative in your papers or you're looking for a great lecture, but he's not bad if you're just in it for the philosophy.\nWorkload:\nOkay -- Fluctuating amounts of reading (sometimes 15 pages, sometimes 50), 2 5-7 page papers, and a final.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "December 27, 2004",
            "review_content": "\nA lot of people really love this guy, and a fair number of people really hate him. Basically, the syllabus for this course is interesting and he presents all of the material well. It's easy to tell which works he likes better than others, because he focuses on some texts exorbitantly and leaves little to no room for others towards the end of the semester. He makes things relate to modern day life quite well, which makes it easy to understand the texts. However, he is a ridiculously difficult grader, and is extremely picky. In my opinion if you make any impression on him, he will grade according to that impression -- if he doesn't like something about you, he will grade accordingly. He doesn't appreciate creativity on papers, and is meticulous when it comes to clarity. Often times if you write sentences that are direct quotes from his lectures, or even from the text introductions, he will say they are unclear and mark you down for them. He punishes really heavily for tiny mistakes (saying one thing slightly off-point might warrant you a grade drop) even if your papers are mostly accurate and precise. Also, he doesn't give many chances to improve grades -- he doesn't really take rewrites, except for on rare occasions, and doesn't change grades even when he agrees himself that they are unfair. Carman makes for a rather interesting lectures, but bruises the GPA in far too many cases. \nWorkload:\n2 papers, 5-7 pages each (harshly graded -- very few A's), and a final (2 essays, sample topics provided before exam). each essay counts for 30% of your grade, and the final accounts for the other 40%. not many chances for redemption if you mess up on one paper.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "November 18, 2004",
            "review_content": "\nA good introduction to philosophy.  Interesting readings, although a lot.  But the professor goes over the readings at lenght in class.  In fact, the class can get unbearably boring because he wants to make sure certain things are drilled into our heads.  The professor is a very nice man and he does a great job explaining if you don't understand the reading.  But don't expect to have any interesting debates about what you read.  It's all about understanding what the texts.\nWorkload:\nLots of reading, two 5-7 pg essays basically summarizing what was said in class, and a final\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "November 18, 2004",
            "review_content": "\nA good introduction to philosophy.  Interesting readings, although a lot.  But the professor goes over the readings at lenght in class.  In fact, the class can get unbearably boring because he wants to make sure certain things are drilled into our heads.  The professor is a very nice man and he does a great job explaining if you don't understand the reading.  But don't expect to have any interesting debates about what you read.  It's all about understanding what the texts.\nWorkload:\nLots of reading, two 5-7 pg essays basically summarizing what was said in class, and a final\n"
        },
        {
            "course_name": "Hermeneutics, History, and the Human Sciences",
            "review_date": "December 18, 2003",
            "review_content": "\n    What Carman lacks in philisophical precision he makes up for with entertainment value. Granted, possibly this subject material didn't allow for him to be rigorous in his argumentation and thorough in his analysis; regardless, during each class I got the feeling that we were at a level of such generality that anything held sway.\n     Of course, when I got my first paper back, I realized that not just anything held sway. So a friend and I ran a little experiment (far from scientifically precise, so be forewarned). She went into his office hours and \"asked him about the paper topics.\" I, on the other hand, wrote about the topic based on his lectures, the readings, and ultimately my philisophical reasoning.\n    The result: Her = A. Me = B. Now, this result alone need not shock you, you know nothing about she or I. However, in light of reading the other reviews here, the conclusion becomes a bit more clear: shut up about your thoughts and remind him of his. (I use the word 'remind' since my friend related to me that when she went over her paper with him, he would review sections that were direct quotations from him and make such remarks as, \"Great idea!\").\n      Point being: this Carman class was great because he's interesting on a general level and good grades are within your reach. However, if you value philosophical precision over general appeasement, and you'd like to practice your own philisophical reason as opposed to restating his, then  avoid this class.\nWorkload:\nLike what other people said. Two long papers (7-8), take home final (3-4).\n"
        },
        {
            "course_name": "Hermeneutics, History, and the Human Sciences",
            "review_date": "December 10, 2003",
            "review_content": "\n   I am definitely in agreement with all the other positive reviews, so it's hardly worth repeating all the compliments, but I can't resist taking the opportunity to give due praise to one of the best (and probably the best) professor I've had so far at Columbia (I am a Math major and a Physics minor, however, so maybe I have lower standards).\n   Anyway, let me start with the class itself.  The three main authors (Gadamer, Danto, Foucault) were a great cross-section of the various strands of contemporary philosophy of language, history, and society, and also form some interesting continuities (although the loose, Continental approach we took in the class could turn anything into a continuity, no matter how much Foucault would turn in his grave).  The topics we addressed ranged from the ontology of language to the sociology of everyday life (through Bourdieu, who was added to the syllabus at the end since we finished ahead of time), and there wasn't a single lecture that wasn't captivating for less than half the duration of the class.\n   This brings me to Professor Carman himself.  He's probably the most lucid, reasonable, and entertaining lecturer I've ever had (except for John Collins on the latter point--sorry, but it's true), and there wasn't a single concept he discussed of which I didn't have a clear understanding following a lecture or two on it.\n   I certainly plan to take any other course he offers in the remaining two semesters I'm here (unfortunately, he's not teaching anything in Spring 2004), and recommend that you do too, whether you're a philosophy major, just slightly interested in the field, or even if you know nothing about it, although in that case you'll certainly have trouble with the papers.  So audit it then, if he'll let you (this class was pretty small, but 19th Century is usually big, I think).\n   I could go on... (and will, for just a little bit).  One unique characteristic Carman has is an uncanny skill for improvisation & stream-of-consciousness philosophizing.  Far from being tangential or confusing, this style conveyed (with utmost clarity and coherence) an amazing interdepartmental, international web of ideas that constitutes a large part of modern theory.\n   The only negative aspects of Professor Carman are 1) his slightly disorganized syllabus, or rather his lack of sticking to it completely rigorously--and yet I really can't complain, because it allowed for the fluidity I praised in the last paragraph, and 2) his susceptibility to being derailed from his crazy train by inane or naive questions (though I must say, I was probably responsible for some of these), but this was never horribly harmful to the structure of the course, so I suppose it could be construed as yet another virtue of his: he'll listen to anyone's ideas, and set them on the right course when necessary (which was almost always the case).\n   Alright, that's all; sorry for the long sentences and parentheses, but that's philosophy for you.\nWorkload:\nTwo 5-7 page papers (there were suppsed to be three) and a take-home final (i.e. 3-4 page paper; it was supposed to be in-class).  He seems to be a fair grader so far (I haven't done the final yet), though I've heard otherwise from some people.\n"
        },
        {
            "course_name": "Hermeneutics, History, and the Human Sciences",
            "review_date": "December 10, 2003",
            "review_content": "\n   I am definitely in agreement with all the other positive reviews, so it's hardly worth repeating all the compliments, but I can't resist taking the opportunity to give due praise to one of the best (and probably the best) professor I've had so far at Columbia (I am a Math major and a Physics minor, however, so maybe I have lower standards).\n   Anyway, let me start with the class itself.  The three main authors (Gadamer, Danto, Foucault) were a great cross-section of the various strands of contemporary philosophy of language, history, and society, and also form some interesting continuities (although the loose, Continental approach we took in the class could turn anything into a continuity, no matter how much Foucault would turn in his grave).  The topics we addressed ranged from the ontology of language to the sociology of everyday life (through Bourdieu, who was added to the syllabus at the end since we finished ahead of time), and there wasn't a single lecture that wasn't captivating for less than half the duration of the class.\n   This brings me to Professor Carman himself.  He's probably the most lucid, reasonable, and entertaining lecturer I've ever had (except for John Collins on the latter point--sorry, but it's true), and there wasn't a single concept he discussed of which I didn't have a clear understanding following a lecture or two on it.\n   I certainly plan to take any other course he offers in the remaining two semesters I'm here (unfortunately, he's not teaching anything in Spring 2004), and recommend that you do too, whether you're a philosophy major, just slightly interested in the field, or even if you know nothing about it, although in that case you'll certainly have trouble with the papers.  So audit it then, if he'll let you (this class was pretty small, but 19th Century is usually big, I think).\n   I could go on... (and will, for just a little bit).  One unique characteristic Carman has is an uncanny skill for improvisation & stream-of-consciousness philosophizing.  Far from being tangential or confusing, this style conveyed (with utmost clarity and coherence) an amazing interdepartmental, international web of ideas that constitutes a large part of modern theory.\n   The only negative aspects of Professor Carman are 1) his slightly disorganized syllabus, or rather his lack of sticking to it completely rigorously--and yet I really can't complain, because it allowed for the fluidity I praised in the last paragraph, and 2) his susceptibility to being derailed from his crazy train by inane or naive questions (though I must say, I was probably responsible for some of these), but this was never horribly harmful to the structure of the course, so I suppose it could be construed as yet another virtue of his: he'll listen to anyone's ideas, and set them on the right course when necessary (which was almost always the case).\n   Alright, that's all; sorry for the long sentences and parentheses, but that's philosophy for you.\nWorkload:\nTwo 5-7 page papers (there were suppsed to be three) and a take-home final (i.e. 3-4 page paper; it was supposed to be in-class).  He seems to be a fair grader so far (I haven't done the final yet), though I've heard otherwise from some people.\n"
        },
        {
            "course_name": "Hermeneutics, History, and the Human Sciences",
            "review_date": "December 06, 2003",
            "review_content": "\nI got to say, I started this course with no idea what Hermeneutics is. Having finished it, I still couldnÂ’t give you a good definition. But, amazingly, it doesnÂ’t matter. It was perhaps the most informative class I have had about twentieth century philosophy. The whole gang was there, if not in text than in spirit: Heidegger, Kuhn, Foucault. The class was an arcane mixture of Philosophy of History, Critical Theory, and general bizzaro methodology. Only Taylor Carmen could ever pull this kind of voodoo, and it is a testament to his incredible teaching ability. I hope he is given more free reign to conduct similar classes in the future because he has so much insight into what other teachers could only present as gibberish. \nWorkload:\ntwo papers and a take home final. \n"
        },
        {
            "course_name": "Hermeneutics, History, and the Human Sciences",
            "review_date": "November 22, 2003",
            "review_content": "\nTaylor Carman is incredibly smart, as you will be able to tell seconds after hearing him speak.  At first I thought he was kind of a pretentious intellectual, incorporating german words like \"nacherleben\" into his lectures (I won't even go into the number of times I took notes and later had to bust out the good old dictionary) but I decided that he is really just so incredibly knowledgeable that he doesn't realize how his lectures sound to an outsider.       I came to adore the class, mostly because Professor Carman would have us laughing uproariously at least once every class, and his lectures were clear and interesting.  The workload was very manageableÂ—2 relatively short essays, which are difficult, but so neccessary to the class because it was one thing to listen to him talking about complex ideas but it was quite another to sit down and have to sort them out for myself in a coherent essay.  There was a lot of reading...but you really don't need to do it, because he talks about everything in class and explains it.       One other thing thoughÂ—there were a lot of people who asked questions in the class, and he always took them seriously and answered them well...which was a blessing when the question was good, but got annoying when the person would be off on this obscure tangent or would be saying something completely stupid, and rather than disregarding them and moving on he would sort through their nonsense and answer...but what can you do?\n   Take a class with Professor Carman.  You'll laugh...and you will learn a lot, too.\nWorkload:\n(2) 5-7 page papers, and a final exam.\n"
        },
        {
            "course_name": "19th Century Philosophy: Hegel to Nietzsche",
            "review_date": "November 15, 2003",
            "review_content": "\nTaylor Carman is a wonder-worker, one of  the most captivating lecturers that I have encountered in my Columbia career. Essentially, he understands complex philosophical texts so well (we're talking Hegel, Kant, and Heidegger here - I'm pretty sure that he's fluent in German) and explains them so beautifully -- and comprehensibly -- that his courses almost negate the need to read the primary source being discussed. This man is, I repeat, a genious, and his cult following has been flourishing as of late. Also, a really nice and approachable guy at office hours.\nWorkload:\nThe workload is not too bad - a few papers - but Carman is a hard grader and likes papers with no frivolous elements or personal opinions -- only straightforward discussion of the philosophic problem in question. \n"
        },
        {
            "course_name": "Heidegger OR Phenomenology and Existentialism",
            "review_date": "April 02, 2003",
            "review_content": "\nBy far the best philosophy professor I've had at Columbia.  (Still mid course.)  Don't make the mistake I've made and take him the last term of your senior year!  Engaging and animated lecturer, astonishingly open to student questions.  Carman is one of the few professors who truly cares about accurately surmising the point of confusion -- too many professors misunderstand what's being misunderstood and only further mire the class in confusion.  Elegant thinker, quick on his feet, incredibly illuminating examples (and drawings!!) that show how Heidegger makes intuitive sense.  You can tell that he's truly in touch with his students *and* the process of reading Heidegger for the first time.  Obviously cares about his work -- both in his involvement with the texts and the class.  The first class lecture was positively breathtaking, it was so exciting.  I've never before had such a clear and precise lecturer who also inflames excitement about philosophy.  Just had his book (Heidegger's Analytic) published by Cambridge UP as well.  A real gem, don't miss out.\nWorkload:\nTwo papers.  Contrary to the other reviews (which initially scared me about this course) Carman is a fair grader.  A solid exegesis alone should garner an A-.  Clear exegesis with a particular interpretive angle will get you an A.  I wonder why some people think getting a C is necessarily unfair.....\n"
        },
        {
            "course_name": "19th Century Philosophy: Hegel to Nietzsche",
            "review_date": "March 10, 2003",
            "review_content": "\nTo echo the previous review, Carmen does have a little bit of a loose hand when it comes to student input. I normally wouldn't fault a professor on this point, but in a hundred person lecture it can be quite painful to watch the personal agendas of a few other students be played out. Otherwise, he is clear and insightful, the two most valuable characteristics of a good philosophy professor. His grading is not as harsh as some make it out to be (Philosophy is not walk in the park, kids). And the subject matter won't have you hitting your head against the wall in hopeless confusion and existential anxiety.\nWorkload:\nThree papers about the three major authors covered. Readings range from extremely diverting to impenetrable.\n"
        },
        {
            "course_name": "19th Century Philosophy: Hegel to Nietzsche",
            "review_date": "January 14, 2003",
            "review_content": "\nProf. Carman is a realy great lecturer for all the reasons that other reviewers have said. I have one caveat to that however, sometimes he allows too much strudent discussion, he tries to suppress the really bad points, but has too much personal niceness and philosophical respect to do so as ruthlessly as some points deserve. Also, to everyone who complained about his grading: he isn't unfair, he just doesn't inflate grades. More importantly, he wonn't just write something like \"B-, poor presentation, developed your least interesting ideas most.\" (Which were his criticisms of my first paper.) He will write two pages of notes on your paper that will allow you to substantially improve on your second and third papers, IF you really consider his criticisms and take them to heart. Also, for majors, the improvements in philosophical prose he will force you to make will wind up helping your GPA more than his demanding standards will hurt it.\nWorkload:\n3 five page papers. Moderate but occassionally difficult (or, for Hegel, completely impenetrable,) readings, that are necessary to maximally enjoy the class, but not crucial to your understandigns as his lectures are top notch.\n"
        },
        {
            "course_name": "19th Century Philosophy: Hegel to Nietzsche",
            "review_date": "December 06, 2002",
            "review_content": "\nWow. Whatta great course! Prof Carman is a wonderful lecturer -- interesting, informative, entertaining. The class was cracking up several times a lecture; the material was all very interesting and relevant and fresh and un-stodgy. He speaks calmly, but with enthusiasm; he always has the time and patience for student questions, so that the 100-person lecture never felt intimidating; he has a genuine concern for students and a passionate and honest interest in the subject matter. He was always available, not only during office hours but at other times as well, for long discussions about essays and anything else. The first time I went to see him, we talked for an hour and a half about Hegel, Kant, Marx, Popper, Soros, Plato, Stalin, and god knows what else. He's an organized lecturer but doesn't talk like a machine - he's quite spontaneous. A combination of intelligence, knowledge, humiltiy, wit and humor, and accessibility. I cannot imagine a better philosophy course.\nWorkload:\nThree five-page essays. That's it. Grading is fair and reasonable; he cancelled the final.\n"
        },
        {
            "course_name": "Hegel's Phenomenology of Spirit",
            "review_date": "May 14, 2002",
            "review_content": "\nPreliminary note: this review is written prior to the reception of a final grade, if this means anything to those of you reading this. Contrary to what another reviewer has more or less suggested (and I apologize if I'm interpreting incorrectly), Professor Carman is no philosophy fascist: there IS such a thing as right and wrong, over which there is such a thing as interpretive disagreement. If you're going to disagree--back it up. If you're going to disagree with Professor Carman on Heidegger--well, good luck and back it up real well. Professor Carman has an enormous amount of integrity and respect for the philosophers he studies; by the simple fact of his own attitude toward philosophy, he motivates students to respond in kind. His interpretations are highly textually based and draw on an incredible amount of knowledge and thought. He is friendly and receptive to open disagreement, but he will also correct a misunderstanding--which is an incredibly important thing that many reputedly \"nice\" professors fail to do. He deliberates carefully before responding to questions, and will do his best to understand the point of confusion, point of interpretive disagreement, or point of simple stupidity (if necessary). I would personally think two or three times before coming to the conclusion that a poor grade on a paper was due to the professor's personal dictatorial tendencies. In any case, I highly recommend Professor Carman to any and all who want to see what philosophy is all about. As a graduating senior, I can say conclusively that my two courses with Professor Carman have been the highlight of my philosophy studies here.\nWorkload:\nRequired workload--normal. You may be motivated, like many others I know, to do some extra reading on your own. Don't be surprised if all the recommended secondary texts disappear from the library alarmingly early in the term.\n"
        },
        {
            "course_name": "Heidegger OR Phenomenology and Existentialism",
            "review_date": "May 07, 2002",
            "review_content": "\nProf. Carman is a pretty good lecturer-he is clear, somewhat animated, well organized, and he is always open to questions and discussion. He is not a nice person, however. He says inappropriate things to students. One time he wrote on my paper, \"It was a great paper because Heidegger wrote half of it.\"-which is not something to say even if it is true. Another student told me something not nice he said to her but i forget what that is.\nWorkload:\n3 papers where you are required to spit back what he said in class or get a C-which is what happened to me but friends told me that if you try the mentioned formula then you do well.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "April 20, 2002",
            "review_content": "\nAnother reviewer says that no one from this class should walk away with less than an 'A.' I have my suspicions that whoever this person is, they must have slept with the professor. This class is very interesting, and Carman is a great lecturer (though he jumps around quite a bit), but as a grader? He's death to your GPA--so before you take this class for credit, decide if you want a good class, or a good GPA. If it's the former, you've hit pay dirt. The guy knows, and moreover, *loves* the material he teaches you--and it shows, from the useful and creative analogies and examples to make the point crystal clear to the way he's able to relate philosophy to his 2 year old. He's so thorough that reading is almost optional--though you definitely get a better grasp of the nuances if you've done it, plus you'll be better able to argue with him (he almost never concedes, but he certainly respects and appreciates a thought-out and backed-up response from his students). However, if you're taking this class for a good grade, well, don't. If you do a thorough and thoughtful job on the paper, he'll rip it to shreds, like he did on my second paper. If you do any less, which I did on my first, he rips it into shreds, then will make you eat it. In fairness, however, he's more lenient on the midterm--and I assume the final--and he gives your overall grade a curve. I walked out with a very good grade, in spite of my diatribe, though by no means an A; and boy, did he make me sweat with fear to get even what I did. \nWorkload:\nIt's not the workload that kills you--it's not too bad: two papers, final, midterm, final, and manageable reading that you really only have to do in order to do the paper--it's that murderous gleam in his eye when it comes time to grade papers that will get you.\n"
        },
        {
            "course_name": "Philosophy and Human Existence",
            "review_date": "November 04, 2001",
            "review_content": "\nOne of the most eloquent professors I've had so far. His lectures are clear, succinct, engaging, and thought-provoking. His knowledge of the material is impressive, and he is available to his students--a nice man, a mild intellectual. The reading is definitely manageable and pretty interesting--is basically an intro/survey class. no reason for anyone not to walk away with an A. Lectures are a must to attend, readings can be done last minute for purpose of writing the essays.\nWorkload:\nModerate reading, 1 short paper, one medium-lenth definitely manageable.\n"
        },
        {
            "course_name": "Heidegger OR Phenomenology and Existentialism",
            "review_date": "December 31, 1999",
            "review_content": "\nReally an excellent professor. Extremely knowledgeable about the texts, peppy and animated as he moves through the lectures, you couldn't ask for a better speaker. Be careful not to get ambushed on the papers. He's careful and picky about every attempt to stray from the accepted line on a given issue. This is hardly a fault--when he gets up and tells you something in class, it's because he thinks it's right. When you sassily refute him, he's usually going to think you're wrong (and be right about it). The papers are short, but require great care and methodical exegesis of your invariably confused notes (he sort of jumps around a lot) into a coherent and steady position.\nWorkload:\nthree 5 pg papers, a in-class essay final.\n"
        }
    ]
}