{
    "prof_info": [
        {
            "prof_name": "Ross Hamilton",
            "prof_id": 1453,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Colloquium: Enlightenment",
            "review_date": "May 18, 2014",
            "review_content": "\nThis man is literally on another level of brilliance....so so so knowledgable, not at all conceited and really cares about what his students have to say. Cannot speak highly enough of this professor. Also not a difficult grader as long as you put in effort and write something interesting. He is more interested in theoretical and historical framing, rather than close reading works of literature, so if that's not your thing be wary. Nonetheless, his classes are always a ton of fun. Even when I was dead tired and just didn't feel like talking about Derrida, he somehow pulled somehow always pushed me to think critically and engage in class discussions. He is also  VERY VERY relaxed with deadlines, because he realizes we are adults with lives. In my view, he is a flawless professor. \nWorkload:\n100-150 of reading a week, weekly discussion posts, and 2 papers. Light in amount but dense in content. If you love the subject matter it won't feel like work. \n"
        },
        {
            "course_name": "18th Century Literature",
            "review_date": "January 26, 2013",
            "review_content": "\nWhere's the nugget?   He's an incredible professor.  I took his 18th Century Novel class and it was the best English class I took at Barnard.   He lectures and asks questions (watch out, he will call on you) but it is all really relevant and interesting.   He gave me a clearer reason to study English... it helped in all of my other classes, too.    It is unusual because even though it was 18th Novel we also discussed early and later periods.   A great experience.   \nWorkload:\ntwo papers, mid-term, final.  If you do the work and participate in class you will do fine.  \n"
        },
        {
            "course_name": "Literary Criticism and Colloquium ",
            "review_date": "May 25, 2010",
            "review_content": "\nI've taken two classes from Professor Hamilton, and I've loved both of them.  He's changed the way that I think about literature, history, culture..  he made me understand the connections between fields, and made me realize the importance of historical knowledge in English studies.   It's true what people say, that you work harder in his classes, but it is so worth it, because you really learn things, rather than just hear your classmates fill in the time... \n\nWorkload:\nIf you work hard, you'll do fine.   I took his Literary Criticism class first, and I have to say it was the hardest class I've ever had -- a difficult essay every week.   He also meets you three times a semester for an hour to go over your essays one by one, which was nerve-wracking, to say the least.    But my writing, and especially my logic, improved SO MUCH.  And it has made writing essays so much easier.   Looking back on it, as a graduated senior, it was the most important class I took at Barnard.  \n"
        },
        {
            "course_name": "Junior Colloquium (Renaissance) and 17th-Century Poetry",
            "review_date": "April 11, 2010",
            "review_content": "\nRoss Hamilton is a rock-star professor. He takes a holistic approach to presenting a literary period - historical, cultural, artistic. At first I thought I was all about straight-up literature but I quickly started to understand what Professor Hamilton was trying to achieve - by the end of the semester I felt that I understood the subject matter and especially the time period, more than I could say regarding most other courses. You will work hard but most probably feel good about it, especially because Professor Hamilton cares less for polished work and more for sincere, hard work. \nBe prepared to work harder than other junior colloquium students, and then prepared to understand the Renaissance better!\n\nWorkload:\nhe's down to earth, pretty laid back about deadlines, and really there to teach the material and not to worry about pettiness. \n"
        },
        {
            "course_name": "Renaissance Colloquium",
            "review_date": "March 28, 2010",
            "review_content": "\nProfessor Hamilton's Junior Colloquium was great! I recommend it. All of us worked really hard in his class, but as a result, we also learned A LOT. Professor Hamilton is a very caring and a very intelligent professor. This class is a lot of work, you write four short papers, take a midterm, and write a final paper. But you learn so much! You get to write about Montaigne, Breugel, learn about the Eucharist and Purgatory, and think about Philosophy and Religion. You read Colish's history on Medieval history. The class is interdisciplinary: less literature and more history and philosophy. Professor Hamilton invited us to his apartment and cooked a phenomenal dinner at the end of the semester. He always had really interesting and thought-provoking things to share in class--he was both a teacher and a listener. The class isn't perfect--Prof. Hamilton does not give a lot of feedback on papers, though you could always go to his office hours and discuss your papers with him. I was nervous about taking his class because the culpa reviews weren't so hot, but my friend could only say good things about him, and I opted for taking it, and have no regrets!! So do not fear, this class is great, and you will learn a lot, your mind will be expanded, and you will work hard. \nWorkload:\nAs mentioned above, there's a lot of work in this class. As mentioned above, the work is worth it. \n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "January 17, 2009",
            "review_content": "\n\nProfessor Hamilton is certainly a brilliant man and a very friendly, approachable professor. But if you take this class too seriously it will become a nightmare. The reading load is about a 200 pages a week (no joke, with very very small font from the Norton Anthology of Theory and Criticism). The first few meetings of class will be awkward, as he has a tendency to sit at the round table of students and stare in silence, waiting for you to start the discussion. If you are not talking he will call on you, so prepare yourself well with the readings. As the semester goes on things become more relaxed, and I slacked off a great deal on the readings as did the rest of my class. As long as you arm yourself with one point to talk about, you will be fine. Do not stress out about cramming in 200 pages of dry, difficult, technical reading. He will also ruin your weekend, as a three to four page essay is due by midnight EVERY SUNDAY. They are difficult, vague, and frustrating to write. But he is an easy grader. He won't even give you grades on your essays, your grade is an arbitrary sort of assessment of your general effort and intelligence level. If you write interesting, thought provoking essays you will be rewarded, even if you misinterpret all of the basics of post-structuralism.\nP.S. No midterm, no final.\nWorkload:\nHeavier than any class I have ever taken, however, you can get by with a little skimming and the reading of summarizations. By no means are all of the readings necessary, he assigns things that are never even mentioned in class. \n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "January 17, 2009",
            "review_content": "\n\nProfessor Hamilton is certainly a brilliant man and a very friendly, approachable professor. But if you take this class too seriously it will become a nightmare. The reading load is about a 200 pages a week (no joke, with very very small font from the Norton Anthology of Theory and Criticism). The first few meetings of class will be awkward, as he has a tendency to sit at the round table of students and stare in silence, waiting for you to start the discussion. If you are not talking he will call on you, so prepare yourself well with the readings. As the semester goes on things become more relaxed, and I slacked off a great deal on the readings as did the rest of my class. As long as you arm yourself with one point to talk about, you will be fine. Do not stress out about cramming in 200 pages of dry, difficult, technical reading. He will also ruin your weekend, as a three to four page essay is due by midnight EVERY SUNDAY. They are difficult, vague, and frustrating to write. But he is an easy grader. He won't even give you grades on your essays, your grade is an arbitrary sort of assessment of your general effort and intelligence level. If you write interesting, thought provoking essays you will be rewarded, even if you misinterpret all of the basics of post-structuralism.\nP.S. No midterm, no final.\nWorkload:\nHeavier than any class I have ever taken, however, you can get by with a little skimming and the reading of summarizations. By no means are all of the readings necessary, he assigns things that are never even mentioned in class. \n"
        },
        {
            "course_name": "Literary Criticism and Theory",
            "review_date": "January 17, 2009",
            "review_content": "\n\nProfessor Hamilton is certainly a brilliant man and a very friendly, approachable professor. But if you take this class too seriously it will become a nightmare. The reading load is about a 200 pages a week (no joke, with very very small font from the Norton Anthology of Theory and Criticism). The first few meetings of class will be awkward, as he has a tendency to sit at the round table of students and stare in silence, waiting for you to start the discussion. If you are not talking he will call on you, so prepare yourself well with the readings. As the semester goes on things become more relaxed, and I slacked off a great deal on the readings as did the rest of my class. As long as you arm yourself with one point to talk about, you will be fine. Do not stress out about cramming in 200 pages of dry, difficult, technical reading. He will also ruin your weekend, as a three to four page essay is due by midnight EVERY SUNDAY. They are difficult, vague, and frustrating to write. But he is an easy grader. He won't even give you grades on your essays, your grade is an arbitrary sort of assessment of your general effort and intelligence level. If you write interesting, thought provoking essays you will be rewarded, even if you misinterpret all of the basics of post-structuralism.\nP.S. No midterm, no final.\nWorkload:\nHeavier than any class I have ever taken, however, you can get by with a little skimming and the reading of summarizations. By no means are all of the readings necessary, he assigns things that are never even mentioned in class. \n"
        },
        {
            "course_name": "colloquium",
            "review_date": "December 22, 2007",
            "review_content": "\nProf. Hamilton warns you on the first day that his version of the Junior Colloquium will be tougher than the others, and this was indeed true. The reading was heavier, it seemed like we wrote more essays, and we had a midterm unlike other colloquiums. That said, class discussions veered off the topic of the reading to a great extent, and Prof. Hamilton would talk at length at certain points, so doing the reading did not really matter. The essays, it seems, were graded fairly to easily, in that if you put at least some effort into them, you'll do well (though you won't know this for at least a month after handing in the essay because he is an unnecessarily slow grader). And the midterm - you have to read a book so chock full of information about the Middle Ages that there is no possible way to know it all. Prof. Hamilton's grading of the midterm seemed to stem from the idea that you wouldn't get any answer right, so many people do exceedingly well. Prof. Hamilton is very intelligent, willing to talk about ideas with students, and really seemed to want to give us a well-rounded view of the Renaissance. It was clear our class was not top priority, and while this was irritating at times, the class itself doesn't seem to serve a great point, so the entire experience becomes somewhat ridiculous that you get through it and it's fine and hopefully you learned something. \nWorkload:\n4 short essays, 1 research essay on any topic relating at least remotely to the Middle Ages/Renaissance, crazy midterm that will cause a lot of stress but is graded easily, weekly reading. \n"
        },
        {
            "course_name": "colloquium",
            "review_date": "March 29, 2007",
            "review_content": "\nI have to agree with the positive reviews of Ross Hamilton.  I'm a graduating senior in Englihs, and I learned more in his class than in any other one I took.  There's a huge amount of work, but only after the course is over -- and his insane exams fade like a bad dream -- do you realize how much you learned. \n\nWorkload:\nI know this is a culpa review, so I want to go straight to the good and the bad.  The bad: the amount of work.  The good: the amount of work.  Plus he allows you to revise papers, so if you don't get a grade of A or A- it is just because you didn't work hard enough.  \n"
        },
        {
            "course_name": "Romantic Era",
            "review_date": "June 04, 2006",
            "review_content": "\nHe's a brilliant guy.  His lectures were really remarkable (I say this as a comp-lit major) linking up literature, philosophy, art and science in a way that really made me understand the material and its impact on me.  He's also has a funny sense of humor which was a plus for a nine am class.  The downside was that the last third of the semester were student presentations and most of them were a waste of time.  Plus it was hard to figure out your grade since on most of the assignments he just wrote comments that were difficult to read since his handwriting is illegible.  However I did fine.  But if you want to have lectures that are both intellectually illuminating and entertaining, its a great course.  \nWorkload:\nfour assignments/papers plus term paper. Pretty easy.  \n"
        },
        {
            "course_name": "Romantic Era",
            "review_date": "June 04, 2006",
            "review_content": "\nHe's a brilliant guy.  His lectures were really remarkable (I say this as a comp-lit major) linking up literature, philosophy, art and science in a way that really made me understand the material and its impact on me.  He's also has a funny sense of humor which was a plus for a nine am class.  The downside was that the last third of the semester were student presentations and most of them were a waste of time.  Plus it was hard to figure out your grade since on most of the assignments he just wrote comments that were difficult to read since his handwriting is illegible.  However I did fine.  But if you want to have lectures that are both intellectually illuminating and entertaining, its a great course.  \nWorkload:\nfour assignments/papers plus term paper. Pretty easy.  \n"
        },
        {
            "course_name": "Skepticm and Affirmation",
            "review_date": "February 07, 2006",
            "review_content": "\nI've taken two classes with Professor Hamilton over the past two years and I have to say that he grew on me. First class, I thought he was ridiculous. For the first \"quiz\" we had to memorize an entire map of European trade routes which had NOTHING to do with what we were reading (ok, ok, so we were reading Crusoe, but why do we have to know every goddamn traderoute?). So I come into class, do the trade route map anally with colors and a ruler, etc. He then wanted to meet with everybody after the quiz to go over it and our ideas in generally. Ok, so the day I meet with him I go into his office and he says to me, \"I'm very dissapointed, you never handed in your map\". Of course I flip out, say that I did, and that I spent a long time learning it....So he does a half assed search on his desk and says \"Oh, well.\" He also has a habit of coming into class late, looking as if he just rolled out of bed with his shirt inside out and wrinkled and his hair a mess, and then the in class comments about how much tequila he had last night explains it. BUT, aside from these facts, which are actually amusing, he grades very easily if you are a decent writer (and stroke his ego a bit--he literally told me to do that in my paper--I got an A). He is also genuinely interested in his subject and I think really enjoys getting to know his students and have office discussions. I would recommend taking his class because 1) he's funny 2) the work isn't that hard and you can get away without reading anything (you have control over how much you learn) 3) and the books are pretty good. \nWorkload:\nOccasional \"quizzes\" and 1 or 2 papers. Final paper is usually 20 pages.\n"
        },
        {
            "course_name": "Skepticm and Affirmation",
            "review_date": "February 07, 2006",
            "review_content": "\nI've taken two classes with Professor Hamilton over the past two years and I have to say that he grew on me. First class, I thought he was ridiculous. For the first \"quiz\" we had to memorize an entire map of European trade routes which had NOTHING to do with what we were reading (ok, ok, so we were reading Crusoe, but why do we have to know every goddamn traderoute?). So I come into class, do the trade route map anally with colors and a ruler, etc. He then wanted to meet with everybody after the quiz to go over it and our ideas in generally. Ok, so the day I meet with him I go into his office and he says to me, \"I'm very dissapointed, you never handed in your map\". Of course I flip out, say that I did, and that I spent a long time learning it....So he does a half assed search on his desk and says \"Oh, well.\" He also has a habit of coming into class late, looking as if he just rolled out of bed with his shirt inside out and wrinkled and his hair a mess, and then the in class comments about how much tequila he had last night explains it. BUT, aside from these facts, which are actually amusing, he grades very easily if you are a decent writer (and stroke his ego a bit--he literally told me to do that in my paper--I got an A). He is also genuinely interested in his subject and I think really enjoys getting to know his students and have office discussions. I would recommend taking his class because 1) he's funny 2) the work isn't that hard and you can get away without reading anything (you have control over how much you learn) 3) and the books are pretty good. \nWorkload:\nOccasional \"quizzes\" and 1 or 2 papers. Final paper is usually 20 pages.\n"
        },
        {
            "course_name": "Colloquium: Enlightenment",
            "review_date": "October 31, 2005",
            "review_content": "\nProfessor Hamilton is one those professors that you may end up having a love/hate relationship with. He's intelligent and extremely helpful when it comes to writing and editing papers, but he expects you to read every single thing on his extensive reading list and then write a paper almost every other week. It was tough! Still, I must say that it was rewarding especially because he recognizes good work, acknowledges your comments and really wants to foster discussion in class. He speaks a little too softly for me. It made the classroom seem so silent. Still, we all sat in a circle most of the time, so that was cool. He sometimes rambles, goes off on tangents .... Overall, he's an awesome and bright professor that loves to help his students with writing. Beware that he will make sure you're working hard and making an effort. He told a story about a trip he made to Africa as a college student. He realized that African students don't have the same priveleges American students do and, consequently, he now wants to make sure that his students take advantage of what this great country has to offer. So, skipping class is a no-no (you'll have to make it up), etc.\nWorkload:\n5 papers total and an intense final exam that you must start studying for early or else it's very challenging! Still, he warns you about this.\n"
        },
        {
            "course_name": "colloquium",
            "review_date": "August 17, 2005",
            "review_content": "\nTake his class.  Hamilton knows everything -- he's got all of Butler in his head.  He made me work harder than I've ever worked in an English class, but I left with a real understanding of the Renaissance and the Enlightenment.  Plus he's funny.  The downside is a horrible midterm in which you have to memorize a book, plus dates.  And there were four research papers.   But you won't feel your in high school anymore.\n"
        },
        {
            "course_name": "colloquium",
            "review_date": "August 17, 2005",
            "review_content": "\nTake his class.  Hamilton knows everything -- he's got all of Butler in his head.  He made me work harder than I've ever worked in an English class, but I left with a real understanding of the Renaissance and the Enlightenment.  Plus he's funny.  The downside is a horrible midterm in which you have to memorize a book, plus dates.  And there were four research papers.   But you won't feel your in high school anymore.\n"
        },
        {
            "course_name": "Reformation to Romanticism: The Violent Origins of Modern Thought",
            "review_date": "October 26, 2004",
            "review_content": "\nI thought this was an amazing class.  Yes, he lectured the entire time, and yes, he did so from notes.  But the lectures were amazing.   Hamilton is one of the smartest profs I've had at Columbia, he is able to move from classical to modern, and link up philosophy and art history to literature.  What was strange about this class at least was the complete lack of discussion, which he found weird too.  But of all profs to be described as boring, he is one of the last ones I'd use that word about.  Be sure to come to his office hours with ideas for a term paper fully worked out,  or you won't get very far.   He's not a hard grader (I'm undergraduate and got an a minus) and easy with extensions, although he can come across as elitist.  But if you like a good lecture, this is a great class.  \n"
        },
        {
            "course_name": "Reformation to Romanticism: The Violent Origins of Modern Thought",
            "review_date": "September 14, 2004",
            "review_content": "\nOverall, the class was dull and uninspired thanks to Hamilton's monotonous focus in lectures and his general disinterest.  I'll reiterate what others have said: the only things I gleaned from a semester's worth of Ross Hamilton's meandering lectures were a litany of catch phrases -- substance, architectonics, etc.  And he's also just as distracted and flaky with his students as everybody's said.  He's genial and flexible, sure, but terribly unengaged and unengaging.  He habitually showed up to class ten to twenty minutes late, and while the class (comprised mostly of grad students and some seniors) waited for him to show, it eventually devolved into discussions of what an uninspiring professor he was.  (\"This is FAR from the best class I'm taking this semester\" was one girl's comment, and I had to agree with her understatement.)  Because even when Hamilton WAS in class, his lectures weren't even lectures so much as repetitive term papers stuffed with long quotations from the readings; indeed, for nearly two hours he'd stand in front of the class reading aloud straight from a large stapled document.  If there were any time afterward (and there often wasn't), he'd pose a few vague questions to the class for discussion that usually met with tepid response.  Also, one on one, Hamilton acted equally uninterested.  The one time I visited his office hours, he barely responded to my questions or comments; instead he looked at me blankly, suggested I think about the texts on my own, and asked whether I had some more specific questions.\nWorkload:\nWeekly readings--some of which were damn heavy--that could be pretty easily skimmed/skipped if necessary.  Twenty-page paper on any topic (just has to incorporate one of the texts somehow) due at the end of the semester and optional midterm paper.\n"
        },
        {
            "course_name": "English Colloquium: Skepticism and Affirmation",
            "review_date": "June 15, 2004",
            "review_content": "\nI won't rave about Professor Hamilton's teaching, but I won't disparage it either.  I found him to be a decent instructor and knowledgable about the Enlightenment, and he seems genuinely interested in what his students have to say.  However he expects the class to lead the discussion the entire time, which I think most of us found created a meandering and therefore not-so-helpful examination of the material.  He also tends to come across as a literary and social snob, openly putting down popular books that some of us enjoy, throwing french phrases into his speech without explaining them, and mentioning outside materials assuming you have read them.  I think he tries to be friendly, but it often comes across awkardly, so his good intentions end up rubbing people the wrong way. Don't expect a life-changing experience in Professor Hamilton's colloquium, but you can count on a pretty good reading list and a moderate and refreshingly creative workload.\nWorkload:\nnormal amount of readings for a core English class, 5 short papers that are often creative, oral exam that is a conversation, so you can choose the focus\n"
        },
        {
            "course_name": "Imitiation and Creation; Renaissance Coloqium",
            "review_date": "February 16, 2004",
            "review_content": "\nRoss Hamilton is not only an amazing teacher, but he is an amazing person. He doesn't brush people off, he doesn't ignore students...he just hates to bullshit. If the previous respondents weren't properly coddled, thats shouldn't really infringe on teaching. He is honest, sincere, and most of all - giving. He radiates passion for English and History. He is brilliant and keywords like \"Plato\" and \"substance\" are keywords for the entire renaissance, not just his class. Take this guy's class. It's amazing. No Joke.\nWorkload:\n5 mini papers which ARE read and VERY easily doable. One long paper at the end of the term. One oral exam, which is more like a conversation. \n"
        },
        {
            "course_name": "English Colloquium: Imitation and Creation",
            "review_date": "August 29, 2003",
            "review_content": "\nBefore I came to my first class, I ran into a senior working in the Barnard English department. \nTrusting her experience, I asked her if she knew anything about Ross Hamilton. I saw her actively try to hide a grimace. \"He's very nice....\" I begged her to continue, \"but he's writing his book right now, and applying for tenure. So don't expect him to pay attention to you at all.\"  It was true. He had a few nervous tics, which were distracting at the very least because most of what he had to say was not enlightening or stimulating. He didn't particularly seem to like class discussion, or, indeed, even his students.  He habitually handed papers back late with nitpicky  corrections or asinine comments that usually indicated that he wasn't reading the paper very closely.  Not to say that I didn't get a good grade-- I did. But I do feel a little cheated-- such a potentially intelligent class required for the english major at Barnard, and I learned nothing but the fact that if I answered \"substance\" or \"plato\" to any given question, I was usually in the clear with Ross Hamilton. \nWorkload:\nA total waste of my time-- I did not touch the reading list, and still passed with flying colors. Ridiculous. \n"
        },
        {
            "course_name": "Romantic Literature",
            "review_date": "June 04, 2003",
            "review_content": "\nAfter reading the above review I must wonder if I indeed took a class with the same man. I found Professor Hamilton an eloquent lecturer with igniting ideas. \nHis love for romantic literature, and vast knowledge of it and the time period, made the course informative and exciting. \nDuring the class we analyzed literature of the time, placed it within a historic context that included the period and reached as far back as Plato and as forward as modernity, and then used these two to discuss how man saw himself during this period. I have never before had a class in which Darwin's affect on the psychology of man is discussed. \nHamilton's approach to this course made the literature excitingly relevant to my life, not only giving me a deeper understanding of the romantic period man, but of myself. He showed how romantic literature has shaped history and helped answer the question of why I am an English major. His grading was quite lenient, and he was very flexible with deadlines. You will get an A if you attend class and demonstrate an interest in the subject through your work and class discussion.     \nWorkload:\nModerate reading for every class which you do not need to do but I would suggest since you will probably never again hear it lectured upon so well. Every other week short creative piece of writing and one final 8-10 page paper, you will get an A if you simply show a little thought and effort.  \n"
        },
        {
            "course_name": "English Colloquium: Imitation and Creation",
            "review_date": "January 19, 2003",
            "review_content": "\nOn the last day of classes, Ross Hamilton left the room to let us fill out our evaluations, and my classmates and I tried to figure out what exactly it was that had made this class so terrible.  We're not sure.  Perhaps it was the fact that every class seemed centered around a series of buzzwords--the Eucharist, the Stanza della Segnatura, substance and accident, and architectonics--without ever really addressing the readings we had done.   Perhaps it was his manner of asking questions as if there were only one possible answer (usually  \"substance,\" \"the Eucharist,\" or \"architectonics\").  Perhaps it was the constant references to the fact that he was writing a book, or perhaps his complete lack of interest in helping his students (\"If you have a question about your paper,\" he once told us, \"please bring me something in writing.  I hate it when students come to my office hours fishing for ideas\").   In any case, this class made for a miserable two hours every Monday morning, and the snickers with my fellow classmates every time Professor Hamilton left the room were not worth enduring his scattered and tedi lectures.\nWorkload:\ntwo short papers and one term paper, a bunch of readings that Hamilton never mentions after you read them\n"
        }
    ]
}