{
    "prof_info": [
        {
            "prof_name": "Rodolfo de la Garza",
            "prof_id": 1662,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Immigration and immigrants",
            "review_date": "July 10, 2011",
            "review_content": "\nHe is an example of the failure to provide adequate organization and focus classes; the best way to describe his class is the absence of continuity in class lectures and in the manner in which he follows up with students on their   assignments. He never provided appropriate syllables. There were concerns by some students that he was homophobic, and expressed some anti-gay opinions in his class. There was no regular attendance at his classes. When it comes to papers evaluation, he couldn't provide   regular formal assessment and feedback to students relative to their papers and often students concluded that he never really read the papers. To cover for his inability to handle course materials, he often brings controversial issues in the classroom, which creates discomfort among students, as they are not related to the class materials\nWorkload:\none presentation + one paper submitted in two parts , \n"
        },
        {
            "course_name": "Latino Political Experience",
            "review_date": "May 21, 2011",
            "review_content": "\nTake this class!! I had been a little wary considering de la Garza's negative CULPA reviews, but Latino Politics turned out to be one of the best classes I've taken so far at Columbia! De la Garza is extremely knowledgeable and a great communicator--more of a story-teller than lecturer, but at the same time the author of groundbreaking and airtight studies on Hispanic politics. The class covers Latino political history as well as recent elections and current Hispanic political issues. \nIt had been supposed to be a 30-person lecture or something, but only 10 or so students signed up, so de la Garza ended up adopting more of an informal format. He canceled the paper and allowed for class discussions and debate. We didn't follow the syllabus, which could have frustrated some people, but the flexibility never really felt like disorganization. \nThe majority of the students in the class were Hispanic, and de la Garza was very interested in everyone's personal history and relating our families' experience with the issues we were discussing. Also, we spent a good deal of time discussion Mexican food, which is delicious. We even got together for dinner once!\nWorkload:\nReadings were interesting and very manageable, although de la Garza tends to deviate from the syllabus, so you can end up with a lot at once and not so many for a while. He cancelled the paper. The 10-page paper was cancelled for our class. Other than that, a midterm (graded very harshly) and final that are take-home but due within a class period. \n"
        },
        {
            "course_name": "Latino Political Experience",
            "review_date": "May 17, 2006",
            "review_content": "\nI enjoyed the subjects and topics covered in this class, but I would definitely not recommend this class to another student. The lectures were unorganized and he often veered into his own opinions on things which, if taken from another perspective, might be taken as very politically incorrect comments. The course material itself is very interesting, but it is not a course for everyone in that it sometimes seems that his lectures are more geared toward Latino and Chicano students. This class covers many more Mexican and Mexican-American topics and issues in the U.S. than it does for any other Latino group, and so make sure that this is the course you want to take.\nGrading is extremely harsh; the reading is not terrible and I was able to keep up with it, but unless your 15 page paper + exams are absolutely stellar, you will end up with a terrible grade. I think that my own quality of work, if graded on standards used in another poli sci class at the same level, would have received much higher grades.\nWorkload:\nAbout 5 main books, some surveys, articles, and census material; one 15 page paper, midterm, take-home final...all harshly graded\n"
        },
        {
            "course_name": "Latino Political Experience",
            "review_date": "August 23, 2003",
            "review_content": "\nHe is definitely NOT the Eric Foner of the Political Science Department.  As the other reviewer said, his lectures were very disorganized and had no structure. He gave us no idea of what he was looking for on the midterm and gave out a slew of Cs to a class of mostly upper class political science majors. The grading was considerably better on the final and final paper though.  He does know his stuff and is an expert but he is horrible at communicating what he knows to students.  Could there be a more vauge professor!? It could have been a great class- it was interesting at times but you leave at the end wondering if you learned a single thing. Also, he makes comments during the course of the semester such as \"I'm not afraid to give a bunch of Cs or Fs if that is what the student earned\" to scare you into thinking you'll do horrible.  About a month into the class he tells us the research paper has to be not 10 pgs like the syllabus says and he said on the first day of class, but AT LEAST 15 pages, closer to 20. He then says \"you could write 10 pages but i'd fail you\" and proceeds to tell us the syllabus is a guide, not a contract.  Well this would have been nice to know the first week when we are figuring out our courseloads. I dont care if he invites the class over for pizza I rather have someone who knows how to teach and communicate, not just research.\nWorkload:\nA lot of reading after the first month, some pretty interesting and some ridiculously boring but you dont have to do all the reading. Take home midterm with 24 hours to do 3 essay questions, take home final with about 2 days to do it and a final 15-20pg research paper.\n"
        },
        {
            "course_name": "Latino Political Experience",
            "review_date": "June 02, 2003",
            "review_content": "\nThe class could have been fascinating, however, his lectures were disorganized and I often felt they had no structure. His syllabus provided no guideline for the readings, as he often jumped around and provided no guide to where the class was going. Prof. De La Garza, provided little information of what he wanted the assignments to contain or their basic instructions, but provided an extensive list of the things he did not want. The students in my class often felt like we had no clue of what we were doing. The class could have been so much better, as he is extremely intelligent and know his stuff.\nWorkload:\nReading gets intense after first month.  But do able. Papers are graded harshly.\n"
        },
        {
            "course_name": "Latino Political Experience",
            "review_date": "May 31, 2003",
            "review_content": "\nSeeing no reviews of quite possibly the best professor in the American section of the political science department, I felt obligated to write this review.  I learned more from this class than any other I have taken at Columbia.  His lectures were concise, entertaining, and informative.  He loves referencing sports movies and the Godfather.  He is passionate about this subject, and one of the leading experts on it in the country (he spent a long time as a professor at the University of Texas in Austin before Columbia gave him an offer he couldn't refuse).  Every Columbia professor is an expert, but de la Garza is THE expert.  Not only that, but he genuinely cares about his students and had the entire class over to his apartment for pizza one night.  I don't think this course was offered before this spring and there were only about 20 people in it.  I will be shocked if there aren't at least 100 students taking this class within the next three years.  The History Department has Eric Foner.  The Political Science Department has Rodolfo de la Garza.  \nWorkload:\nTake home midterm and take home final, plus a 15-20 pg. paper due at the end of the term (on any topic you want).  The midterm and final were as good as one could hope for.  Very straight forward, but you couldn't b.s. your way through them.  \n"
        }
    ]
}