{
    "prof_info": [
        {
            "prof_name": "Nicholas Christie-Blick",
            "prof_id": 2779,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 09, 2015",
            "review_content": "\nIt's no secret that students with a strong interest in science find FroSci to be extremely... manageable. One thing I'll say is that the lecturers usually are very competent, and if you have any actual questions about anything related to their fields, going to their office hours will usually be a fruitful experience, although you might have to wait in line as other students ask questions pertaining to the lecture material. I wouldn't say that I learned nothing interesting in Fro Sci, but learning definitely isn't required to do well in the class, and all interesting material will be repeated many times (so don't worry about missing it the first time around).\nIf you ever want to take 6 classes, definitely do it while you're taking Fro Sci, as it shouldn't take up too much of your time.\nWorkload:\n1-2 hours of homework a week, graded extremely leniently\n4 quizzes\n1 midterm, 1 final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 09, 2015",
            "review_content": "\nIt's no secret that students with a strong interest in science find FroSci to be extremely... manageable. One thing I'll say is that the lecturers usually are very competent, and if you have any actual questions about anything related to their fields, going to their office hours will usually be a fruitful experience, although you might have to wait in line as other students ask questions pertaining to the lecture material. I wouldn't say that I learned nothing interesting in Fro Sci, but learning definitely isn't required to do well in the class, and all interesting material will be repeated many times (so don't worry about missing it the first time around).\nIf you ever want to take 6 classes, definitely do it while you're taking Fro Sci, as it shouldn't take up too much of your time.\nWorkload:\n1-2 hours of homework a week, graded extremely leniently\n4 quizzes\n1 midterm, 1 final\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 16, 2010",
            "review_content": "\nIf you get Nicholas Christie Blick for Frontiers, find another section. He takes Frontiers way too seriously, will literally send you two or three emails every day (and attached PDF's of those emails, in case you want to download them onto your computer to reread at a later time), demands extra work, likes putting students on the spot and making them feel like idiots for not knowing some random ass detail that we never even learned in the first place because he doesn't really teach you anything, and finding ways to make science more boring than it already is. If you have a thing for middle-aged British men who chuckle at their own jokes, then NCB is right for you. If not, spare yourself a lot of grief and find a less intense teacher who realizes how much of a joke Frontiers is in the first place. \n\nWorkload:\nWeekly WIA's, term assignment (5 page paper on a scientific article), sometimes added work suggested in emails that no one ever really did except huge math nerds. \n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "December 14, 2010",
            "review_content": "\nThis man is insane.  The level of dedication he expects for this joke of a class is completely ridiculous, and his obsession for all things Frontiers borders on manic. He emails his students several times per day, often singling out specific people in the emails that he sends to the whole class.  He creates a hostile work environment (creating \"hit lists\" to punish students struggling with the concepts) and turns almost all students off to the subject and him.\nSWITCH OUT IF YOU CAN.\nWorkload:\ntypical Frontiers WIA nonsense and readings, lectures which I skipped half of the time without qualms\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "February 15, 2010",
            "review_content": "\nNick is hilarious, engaging, friendly, and extremely committed to Frontiers of Science. Where a lot of seminar leaders don't take FoS seriously, Nick DEFINITELY does. He obviously spent huge amounts of time on even this freshman course and would go to great lengths to meet up or answer questions. His enthusiasm made the section fun and worthwhile--but outside of class, his commitment seemed a little scarily obsessive. Know that you will be expected to be just as committed to the course as he is. Use every one of the resources he provides you with (especially Courseworks. He randomly throws out extra credit to people who have spent time going over the extensive materials posted, and very conspicuously notes who they are...and, indirectly, who they aren't...).\nWorkload:\nJust the weekly problem set, formally, and numerous emails and posted links, videos and materials which he WILL ask you about, in detail. Probably three hours a week if you're really committed.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 12, 2010",
            "review_content": "\nIf you get Nick as your Frontiers of Science seminar leader, by all means try to keep him!  Based on what I've heard from other people, he's definitely one of the better seminar leaders out there.  He is an excellent teacher and really tried to know the material of the course cold (and sometimes admitted to spending hours figuring out the answer to a certain problem).  He also cares a lot about everyone in the class, and he is always open to questions (not condescending at all), though he does get a little disappointed sometimes when we don't get the answers to a question he asks.  \nAs a person with an excellent background at science, I gradually lost my initial excitement for the course over time.  However, having class with Nick was the saving grace of this course, when problem sets were trivial and annoying and the lectures were tiring.  Even though class dragged on a little some days (it was my second to last class on thursday, right after lunch), I really liked being in his class because he's such a great guy.  He tells stories and has a British accent and makes cute noises sometimes...*sigh* He even let us eat lunch with him at the Faculty House for free (which has amazing food), in order to discuss improvements to the course... \nHe's just awesome.  I'm kind of jealous of next year's class, because he'll be leading the course then. \nWorkload:\nPretty minimal if you have a good background in science; problem sets usually take about an hour (readings the same amount of time) and are graded based on your grasp of the concepts.  Make sure you keep up with the readings and the lectures because if you get lazy, you have to work harder later... \n"
        },
        {
            "course_name": "Sedimentary Geology",
            "review_date": "January 18, 2006",
            "review_content": "\nProf. Christie-Blick is an extremely dedicated professor who has a true affection for this subject. Unfortunately his drive and passion can be focused on the discipline, while students' focus must be distributed across 5-6 classes. This leads to students persistently and inevitably failing short of Prof. Christie-Blick's expectations. Prof. Christie-Blick's use of an almost-Socratic method of constantly asking questions, both slows down the overall presentation of material and hampers his teaching, while mortifying students. Most graduate students were not able to provide adequate responses to questions posed. Rarely was any student able to respond sufficiently.\nThis class entails a very heavcy workload, for little reward, and Prof. Christie-Blick did not handle the mid-term particularly professionally either: he called people to the board with no notice to explain the questions they did the worst on from the mid-term.\nIn a department where grading is all over the place, the grades in this course were harsh.\nUnless you are trully passionate about the subject (sand ripples): avoid.\nWorkload:\nIntense. Significant reading in preparation for class, mostly from grainy PDF's. Solid textbooks reading assignments. Sacrifice three weekends for fieldtrips. Sacrifice one month to compose a fieldtrip report, feel not worthy when you read his comments on said report. Mid-term and final that require perfect recall and photographic memory of textbook, scientific papers and about 265 pages of handouts.\n"
        },
        {
            "course_name": "Sedimentary Geology",
            "review_date": "January 05, 2006",
            "review_content": "\nNick is an incredible professor. He is 100% devoted to teaching this class, and making you learn every little fact and factoid about\nsedimentary geology. That being said, I cannot in good conscience recommend you take this class. Seriously, don't take this class\nunless you live and breathe sedimentary geology. Not even just geology, but intense sedimentary geology. Nick will go out of his\nway to help you, he will come down to Morningside on his day off just to give you extra help, he will reply to your emails at all hours of the night. He will send you hundreds of emails and keep you incredibly up to date as to what you should know by heart already. He uses courseworks constantly, with every day's class delicately planned out. He hands out notes on everything he shows you, literally reams of paper over the course of the semester. This all sounds excellent right? The kind of teacher who actually cares? Yes. BUT. At the same time, he expects you to hit the ground running like an olympic sprinter. Its not that he assumes you arrive at the class knowing everything there is to know about sedimentary geology, its that he assumes you have no other classes and are able to memorize every single thing he says. Expect from the first moment that you will be reading serious academic papers that are on the cutting edge of modern sedimentary geology, things published up to any day now. Nick will expect more of you if he thinks you know more or can do better than you do. His midterm was incredibly difficult, with definitions drawn from various single lines in various single sheets in the hundreds and hundreds of pages he handed us. He is so involved in the class and how much we learn that when the mean was like a 60, he described it as \"disappointing\" and sent out a blistering email. He then spent the whole next class calling people to the board to do the questions they did wrong on the exam. He literally wrote on the cover of our blue books what parts we got wrong, and photocopied and saved them. He then asked to have little meetings to discuss our \"disappointing\" performance. Seriously, in a class of only majors and grad students he acted like that. It was ridiculous. \nThough I don't want to give you the wrong idea. Its really him trying to help, every thing he does is  directed towards helping you learn sedimentary geology. He really loves sedgeo and teaching, its just incredibly, incredibly frustrating as a student. Especially a busy student. Seriously, don't take this class, even if Nick is begging you. This shouldn't be taken as a comment on Nicks Death Valley trip, which I hear is amazing fun. Oh and he's very British. It wears on you, and complicates already difficult geologistese, for intance Foreland Basin always sounds like Fallen Basin, and don't even ask how he (constantly) pronounces Facies. But seriously folks, don't take this class.\nWorkload:\nOh Nelly. Tons of Reading. Not just a dense textbook, but also, probably 20 long academic papers in dense, basically unreadable\ngeologistese with diagrams that muddle more than they clarify. An intensely difficult midterm. 2 field trips, one all day trip to Fire Island early in september, and a 3 full day trip up to the Catskills the last weekend of september. They were fun, but, they\nkill your weekends at not exactly relaxed moments, and they come back to haunt you, becuase you are expected to learn everything there is to know about the areas, and to have taken excellent notes. You have to write a very long and very complex field report on this. That took the better part of a month! His comments on it make you want to cry. Seriously, draw more. Less verbiage. Also, his final is incredibly difficult.\n"
        }
    ]
}