{
    "prof_info": [
        {
            "prof_name": "Teresa  Sharpe",
            "prof_id": 12724,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Sociology of Work and Gender",
            "review_date": "November 14, 2016",
            "review_content": "\nI don't know how Teresa Sharpe doesn't have a silver nugget yet-- she has a cult following within the Sociology department. \nShe is a thoughtful teacher who clearly takes undergraduate teaching very seriously. Her lectures are engaging and all of the readings are meaningful-- Sharpe assigns no busywork, and usually the final papers are opportunities to explore something you're really interested in. Usually her classes are lecture + powerpoint style, but she has a knack for making discussions happen in classes of 60-80 people. If you can take her for Sociology of Work and Gender-- DO IT! She will revolutionize how you think about work, so if you ever plan to have a job (regardless of your own gender)-- take it!)\n\nWorkload:\nShe assigns weekly articles/books. The amount is pretty standard for humanities classes, but they're always REALLY interesting.\n"
        },
        {
            "course_name": "Sociology of Work and Gender",
            "review_date": "November 14, 2016",
            "review_content": "\nI don't know how Teresa Sharpe doesn't have a silver nugget yet-- she has a cult following within the Sociology department. \nShe is a thoughtful teacher who clearly takes undergraduate teaching very seriously. Her lectures are engaging and all of the readings are meaningful-- Sharpe assigns no busywork, and usually the final papers are opportunities to explore something you're really interested in. Usually her classes are lecture + powerpoint style, but she has a knack for making discussions happen in classes of 60-80 people. If you can take her for Sociology of Work and Gender-- DO IT! She will revolutionize how you think about work, so if you ever plan to have a job (regardless of your own gender)-- take it!)\n\nWorkload:\nShe assigns weekly articles/books. The amount is pretty standard for humanities classes, but they're always REALLY interesting.\n"
        },
        {
            "course_name": "V3225 Sociology of Education",
            "review_date": "December 05, 2013",
            "review_content": "\nSharpe's teaching style is a standard lecture. She basically has a PowerPoint and talks about the readings. However, this class is also discussion-based, so she will elicit answers and responses from students about the readings. \nPersonally, I found the class and subject material interesting. However, even if you are not studying sociology or education (or both), you can still succeed in the class. Furthermore, the concepts you learn in class are quite eye-opening and will probably explain a lot with regards to your schooling experiences.\nWorkload:\nParticipation (show up to class, sign attendance sheet)\nReadings can be quite heavy sometimes. You can expect to read a book or selected chapters to prepare for the week's classes. Other times, she posts the readings on CourseWorks.\nMidterm and final - both take-home. If you do the readings, then you will be fine. \nOriginal research paper - this can seem daunting (I almost dropped the class because of it), but once you find your research question (e.g. something to do with tracking, or something to do with procrastination), it can be really fun. It's 8-10 pages. She announces it on the very first day of class, and it's due early December, so you'll have lots of time to think of a question and to conduct interviews.\n"
        }
    ]
}