{
    "prof_info": [
        {
            "prof_name": "Dan Miron",
            "prof_id": 1083,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 17, 2012",
            "review_content": "\nUnderwhelming considering all the positive reviews he has gotten - Quite a dry lecturer, and sort of gets stuck making one point for about 35 minutes.  He also would sometimes move away from cultural aspects and try to relate history, but his facts were not tight (which is not surprising, as he is not a historian).\nClass is worth it just for the readings you are provided - If you are interested in the underpinnings of historical zionism, they are quite interesting.  His lectures, however, leave something to be desired.\nWorkload:\nA lot of assigned reading, but it is not required to get an A in the class - You need to read one book for a 2-3 page \"book report\" that is graded with a check or check minus.  There is one 5-7 page paper on different topics that he gives you, and a take-home final that is probably around 6-8 pages typed.  Not an insane amount of work, but not extremely easy either.\n"
        },
        {
            "course_name": "Intro to Israeli Literature",
            "review_date": "December 22, 2011",
            "review_content": "\nI'd highly recommend taking this class if you have an interest in Israel or Israeli literature. Half literature class, half history class about Israel in the 20th century, you will learn *so much* from this man--he is close friends with most of the authors we read, and translates many of the works we read himself. I was often star-struck by him and how much he's read/translated/done in his life.\nMiron speaks for the entirety of every lecture. You leave class every day with approximately seven pages of notes. It's a strange teaching style, kind of like he's trying to bestow upon us some of the knowledge he's accumulated over the years. Do not take this class if you want a discussion-based class--there is zero discussion involved. However, he is receptive to questions, and will often pause his lecture to ask if there are any questions. He doesn't really like when you critique his ideas, but rarely did anyone in my class feel that we knew enough in comparison to him to do so. \nIt's a good class. He's spent many years thinking about this class and how to best structure it in order to give students an understanding of the context of the works you read, and it shows--I could not have understood the works we read in the same way had I not read them with him.\nWorkload:\nVery light. Weekly readings that are really interesting but not necessary to do, one paper that he allows you to hand in a rough draft for to receive comments before getting graded, and a take-home final that is basically an essay. He likes people to do well in his class, so he's really willing to help you along. \n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 10, 2010",
            "review_content": "\nThis professor is truly a gem. He enjoys teaching, is happy to answer questions, and always wants students to come to his OH, which I think that few do. His lectures are entertaining and thoughtful. The course largely consists of a survey of the cultural underpinnings of Zionism, while side-stepping the current political aspects of it. A further bonus is that many of the kids who show up don't seem to take the class seriously, and so the bar for doing well is really not that high. If you want to take a fun course that will boost your GPA, this is it.\nWorkload:\n2 page book review (P/F), 5-7 page term paper (50%) which can be submitted twice for a better grade, take-home final (50%). Generally light reading (20 pages) per class. Come to class, do the work, get an A.\n"
        },
        {
            "course_name": "Intro to Hebrew Literature",
            "review_date": "December 20, 2008",
            "review_content": "\nDan Miron is one-of-a-kind. To not disregard the ravingly positive comments on him, there are some downsides of this class. On the positive end, Miron is a master of Hebrew Literature and knows the subject better then anyone in the world. He conveys hi knowledge through lectures that take up the full class period every lesson. While sometimes very interesting and almost always enthusiastic, Miron's lectures are also very dull and tedious. He allows little room for questions and there is rarely any sort of discussion among students in the class. Miron is under the impression that his interpretation of a text is the only correct interpretation. Therefore, any other way of viewing the text, even if well-substantiated, may not be sufficient to impress him. Nevertheless, if you are truly interested in Hebrew Literature, there isn't a more knowledgeable professor in the world. \nWorkload:\nThere is a midterm paper worth 50% and a take home final also worth 50%. There is weekly reading which isn't really necessary to do because he explains everything in class. Miron didn't tell us until after the midterm papers were graded that he would have reviewed them prior to being submitted. The T.A. for my class, Suzanne Schneider, was very helpful and grades in conjunction with Miron. The grading was not completely fair because of Miron's narrow minded interpretations of the text.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "April 30, 2007",
            "review_content": "\nDo not leave Columbia University without taking a class with the almighty Dan Miron. Not only is he brilliant, but he's a powerful lecturer who truly wants to make his students understand the (extremely interesting) material. \nFor the big 10-page paper that you'll have to write, he was extremely helpful in going over drafts, meeting with students, etc, which help to sharpen my understanding of Zionism and its roots. Also, his graduate fellow Andrea is probably one of the greatest TAs you'll ever have (no joke, this woman went above and beyond for us, and when she did lecture rarely, her teaching style rivaled that of many tenured profs you'll probably have).\nSeriously, I cannot praise this prof highly enough. Take anything he teaches, you won't regret it.\nWorkload:\nA paper that he's AMAZINGLY helpful with (you can hand in a rought draft and then turn in a new draft for a completely new grade), short response paper to a text of your choice, take home final\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "April 04, 2007",
            "review_content": "\nI can't help but think something has gone horribly awry between the posting of the previous reviews and this one, because the Professor Miron described by others cannot, CANNOT, be the same professor I currently have a class with.\nSigning up for a Zionism class was an attempt to broaden my knowledge of the Zionist movement, its implementation, and its implcations.  After two months of class, almost no material had been covered, and it felt like a literature class.\nPerhaps the esteemed Professor decided to take a mental sabbatical, or is coasting on the sycophantic reviews previously posted.  Or perhaps I just lack the mental agility to translate the random Hebrew thrown in and rambling and unstructured lecture style.  Either or.\nThe TA is great, though.  Very organized and very smart.  Almost makes the class worth it.\nWorkload:\n5 page midterm, two 8-10 page papers\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "October 24, 2006",
            "review_content": "\nBEST CLASS THAT I HAVE EVER TAKEN AT COLUMBIA. \nWorkload:\n12-15 page paper in which he guides you through the process, take home final. \n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 12, 2006",
            "review_content": "\nProfessor Miron is infinitely knowledgable. While some may find him intimidating, he is a rather kind man, willing to help and meet with students outside class. The course mainly deals with primary sources, so there is reading, but is is completely unnecessary to do it. His lectures are riveting and his take on the literature is fascinating. Take this class if you can, you will not regret it. \nWorkload:\nEasy. 1 10 pg paper-you can hand in a rough draft which is read and returned with a grade and comments which you can rewrite and submit for a completely new grade. Plus, you have the entire semester to write it. Take-home final-easy\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 07, 2006",
            "review_content": "\nColumbia is a good school because of passionate scholars like Dan Miron. The guy is definitely the master of his subject. For that matter, he's so knowledgable in any subject you can think of. Dan Miron uses philosophical articles, novels, poems and any kind of text you can imagine to present what Zionism is and how it developed as clearly as possible. Miron makes the subject very attractive and interesting because he knows it so well and he knows how to present it. He is very detail-oriented and will not leave anything unclear. Unlike many scholars, Dan Miron will never express his personal views about different brands of Zionism or about the Arab-Israeli conflict for that matter. Yes, you can somehow see that he has his own interpreations about certain texts but all he does is to present the literature on the subject in the most comprehensive way possible. Contemplation on the subject is up to the student. I am not a good writer to praise a scholar like Miron. So, please do yourself a favor (just like I did) and stop reading this review and GO REGISTER FOR ANY CLASS THAT PROF. MIRON TEACHES. \nWorkload:\nweekly readings (varies from one poem to a novel)\none paper (8 - 10 pages, do your readings, analyze the texts, talk to Miron, he's a fair grader and will not accept any B.S.)\ntake home final (fairly easy and straighforward if you listen to him during lectures)\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 03, 2006",
            "review_content": "\nProfessor Miron is one of the most intelligent, thoughtful, articulate, knowledgeable, well-read professors I have encountered. He is intimately familiar with the subject matter and brings a passion and a love of Jewish history, culture, literature and learning to his lectures. Take this class, you won't regret it! \nWorkload:\nNot hard at all. Weekly readings (not very long) which is to your advantage to do, since it's mostly really excellent stuff. One short paper, 1-2pgs. You have about 10 weeks to do the final paper--a topic you choose from a list of 6-8 or so. Graded fairly, even generously. Mostly, it seems, he wants thoughtful writing that reflects an ability to think critically. Also a take home final--very fair.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "February 14, 2006",
            "review_content": "\nIt's been said before and absolutely deserves to be reiterated: Dan Miron might be the most passionate, well-read, talented lecturer of any humanities professor at Columbia. Somehow he both teaches the material and emerges from it, the hallmark of a professor whose heart is in his lecturing. I don't doll out encomium lightly, but Dan Miron is of a different order of professors, and you would be missing out to miss any of his classes. \nWorkload:\n1 page review of chosen text, 8-10 page reflection on primary and secondary source material (NOT a research paper), in-class final. \n"
        },
        {
            "course_name": "Intro to Israeli Literature",
            "review_date": "December 22, 2005",
            "review_content": "\nProfessor Miron is a GOD.  This is the second course I've taken with him and I just had to write a CULPA review.  He is the most intelligent professor I have met at Columbia.  The man knows everything and anything about the subject of Israel and Literature.  \nYou can tell Professor Miron has been doing this for years.  His lectures are perfectly times and JAM-PACKED with information.  I would leave every class with SEVEN pages of notes.  Professor Miron is so passionate about the texts, too.  When he talks about Haim Bialik you can see the admiration Miron has for his work just in the way he speaks.  In addition, Miron knows many of the writers personally and has information on them and their writings, which you will find NOWHERE else.  \nThe reviews about the difficulty in meeting with him and his gradings on papers is completely unfounded.  I was not available during his office hours and he was EXTREMELY flexible in meeting with me.  In fact, many times I would stop by his office unannounced to ask a really quick question about my paper and he was totally responsive.  His grading is not hard at all if you take advantage of the LOADS of time he gives you to write your final paper.  I turned in a rough draft, he gave it back to me by the next class with a good grade, he offerred some suggestions, and I got a really good grade on my second essay. He's totally a fair grader.\nI recommend Miron's class to ANYONE who is interested in this subject.  He guides you on such an intellectual journey that you will be happy you attend Columbia and that such brilliant and passionate professors like Miron exist.  Every time I came to class, I truly felt like I was seizing the opportunity of a lifetime listening to this man educate me.  I have no idea how the reviewer before had problems meeting with Miron. I met with him twice and he was extremely helpful. The special thing about Miron is that he actually listens to what you're saying and provides a very extensive response to every question you ask. About the earlier reviewer's comments on Miron's grading. Miron is a tough grader because he expects a great paper from students who have had half the semester to polish it. God forbid a teacher expect quality work from a student at Columbia. \nIf you go to his lectures, take his notes, appreciate the texts, and meet with Miron you'll not only do excellent in the class, but you'll learn so much information and leave feeling very knowledgeable on the subject.\nA must-take professor.\nWorkload: One paper you have half the semester to write and can turn in rough drafts to him to edit and one take-home final which is really straightforward.\nWorkload:\nA 50% paper you have the entire semester to write and an extremely straightforward 50% final that you should ace if you come to class and take really good notes.  \n"
        },
        {
            "course_name": "Intro to Israeli Literature",
            "review_date": "December 11, 2005",
            "review_content": "\nBoth Prof. Miron's class are gems. While he can talk for the entire class period, he is always open to any questions. Furthermore, he knows much of the subject matter like few professors -- he actually knew many of the Israeli writers. He will often share insights not found in any anthology or other literary review. On top of this, Prof. Miron is a gentleman. These classes are great introductions to a vibrant literary culture.\nWorkload:\nA paper which he helps you in revising and a take-home final exam. Put in the hours in class and with the readings and you will do fine.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 14, 2005",
            "review_content": "\nWow.  Professor Miron's intelligence alone is enough for me to recommend any student to take this class.  While his style of lecturing is relatively boring (he really just walks around and talks for an hour and 15 minutes), everything he says is anything but.  If you're interested in the subject, then I definitely recommend taking the class.  You will not be disappointed.  \nI have no idea how the reviewer before had problems meeting with Miron.  I met with him twice and he was extremely helpful.  The special thing about Miron is that he actually listens to what you're saying and provides a very extensive response to every question you ask.  About the earlier reviewer's comments on Miron's grading.  Miron is a tough grader because he expects a great paper from students who have had half the semester to polish it.  God forbid a teacher expect quality work from a student at Columbia.  \nIf you go to his lectures, take his notes, appreciate the texts, and meet with Miron you'll not only do excellent in the class, but you'll learn so much information and leave feeling very knowledgeable on the subject.\nA must-take professor.\nWorkload:\nOne paper you have half the semester to write and can turn in rough drafts to him to edit and one take-home final which is really straightforward.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "January 26, 2005",
            "review_content": "\nDan Miron is one of the best professors I have had at Columbia. He is incrediblly knowledgable, eloquent, kind and caring of every student in his class. However, if you are looking for a class where you will be entertained, Professor Miron is just not your guy. In the end, I took him twice because I learned so much more about Israel, the Jewish people and myself that in any other course. He is very balanced in his different views he gives for each issue discussed and never focuses on his own personal positions in the classroom. Overall, you will gain a lot from this professor. Just rememberm these are cultural and sociological literature courses and NOT a poli-sci course.\nWorkload:\nVERY light, readings that you really never have to do. No midterm, 1 take home paper due whenever you want on whatever you want and 1 straightforward final. Hoever if you want to do the readings, they're great.\n"
        },
        {
            "course_name": "Intro to Israeli Literature",
            "review_date": "January 06, 2005",
            "review_content": "\nWhile I had a lot of gripes about this class, I enjoyed it overall. The material gives a great intro to the topic, and miron's brilliant insight into Israeli culture brings the pieces to life, contextualizing them in a manner that only a few scholars are capable of doing. Sometimes the lectures are a bit dry, but that is to be expected. My main frustration with his class was based on his personality. As another review said, he is an old gruff Israeli man with a dry sense of humor. His attitude is hilarious, except when you have to meet with him about a paper that is worth half your grade. He's rarely in his office during his office hours, and it took me three times of running over to Kent when we had scheduled meetings to actually speak with him. Because he is so knowledgeable on the subject, I got the impression that he does not really understand (or care to) how we as students work. He wanted me to address a plethora of questions in my paper, but I could not even formulate these questions because I did not know enough to ask them in the first place. Therefore I chose to write all of his comments in essay form and got an A- on the paper. Go figure.\nWorkload:\nbarely any reading, a paper that is fine UNLESS YOU WRITE ABOUT NAOMI SHEMER. he HATES her work, and I found out the hard way. whatever you do, stay far far away from her work.  Pick a story he likes and write an intelligent 5 pager and you'll be fine. Also a final that was take-home for us (his eyes are bad and he can't read handwriting so we have to type) that was fairly straightforward.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "December 03, 2004",
            "review_content": "\nAfter my first class with Dan Miron I wanted to drop the course. But  not so fast ... \ndespite my first impulse I stayed and discovered what a great professor he is. He is a really good lecturer, you'll want to go to every lecture, partly because he's interesting and partly because the really important stuff will come out of Miron's mouth in lectures not from the readinsg which are mostly short stories and texts by various zionist thinkers, most of which are pretty impossible to understand without going to lectures. Personality wise he's your typical old Israeli guy,  super gruff and pretty intimidating (and I'm not one to be easily intimidated), highly intelligent and with a dry sense of humor underneath it all. \nWhat really makes him a great professor is this:\nHe takes time trying to understand what you want to say in your paper, and will help you develop your argument if you plan ahead enough to give him the time to read a draft. I wrote a draft that I think he might have hated and/ or disagreed with, but he gave really constructive critiizism, pointed me to the right books, and the end product was what I consider to be the best paper I've ever written. \nWorkload:\nlight, weekly readings that he will pretty much go over verbatum in class; one ten page paper due before the end of class, and a final. I got the feeling that he's an easy grader if he feels that you've made an effort.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "August 03, 2004",
            "review_content": "\nProfessor Miron has tremendous  presence in front of a class.  He speaks in sober, measured tones with great aplomb.  When he comes into class, he lays a small page of notes in front of himself and talks straight through the end of class, although this is not a negative.  On the contrary, I had the feeling that every sentence contained some morsel of wisdom or profound insight gleaned through his decades of contacts with Zionist leaders from Ben Gurion to Sharon.  Prof. Miron is highly balanced.  Until the last week of class, he managed to keep his lectures from revealing any personal opinion, and that was only breached during the last week because the final classes were open debates where we were able to ask for his opinions, point blank.  He is not a difficult teacher either, with the workload consisting of relatively light readings and one paper.  Quite simply, Prof. Miron is one of the most powerful teachers that I have had the pleasure of learning from, and I would recommend this class to anyone of any political slant.\nWorkload:\nLight to medium readings, one 5-8 paper, and he lets you redo it until you get the grade you want.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 26, 2002",
            "review_content": "\nThis guy is great, he knows everything about everything. He was a total disorganized mess, we didnt get the syllabus until halfway through and there was no text book, and all the readings were on reserve, including a bunch of novel, but you learned a lot just from his lectures. He seems to know all the authors that you read, which is cool. \nWorkload:\nHe says its an easy class, and it is. One paper (keep it short, and he lets you redo it until you like your grade, but do it early so you have time to revise) and an easy final.\n"
        },
        {
            "course_name": "Zionism: A Cultural Perspective",
            "review_date": "May 07, 2002",
            "review_content": "\nA must take. Miron is a master of many languages, all of which he uses in class. He is very smart and knows personally many of the authors who we discussed over the course of the semester. His Israeli mannerisms are humorous in an endearing way. The readings are pretty interesting.\nWorkload:\ndecent amount of reading, paper, final\n"
        }
    ]
}