{
    "prof_info": [
        {
            "prof_name": "Matthew Keegan",
            "prof_id": 3234,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Drawing",
            "review_date": "December 14, 2009",
            "review_content": "\nMatt is an incredible teacher. I've taken plenty of mind-numbing Basic Drawing classes through the years and I was dreading being forced to take one more. Luckily, Matt's class in nothing like your typical \"draw the shoe 60 times and let me suck out any personal identity you have as an artist while I'm at it\" intro course. He teaches a broad range of mediums, and encourages students to push themselves out of their comfort zone. For some people that means teaching them to draw to life, for some it means trying new media, and for others it means encouraging them to break away from realism. He actually looks at the individual student and where they are in their development as an artist. Granted, if you want a class to simply teach you to draw a pretty still life or portrait, then someone else's class is probably a better choice. But Matt is an working artist and he will teach you to approach art as a working artist would--you will learn technique but you will also learn how to think and talk about art.\nNote: Syllabus is very flexible, and the class included both fieldtrips to other galleries (MoMA and Chelsea) as well as visits and lectures by current artists.\nWorkload:\nPretty self-determined. About one major assignment in a one to two-week period, but how much you do outside of class is up to you.\n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "October 11, 2009",
            "review_content": "\nMatt Keegan is a fascinating artist and a pretty cool guy. It's true that this basic drawing class is not quite as traditional as one might expect, but I found this to be much more of an asset than not. He encourages his students to play with art and try new styles and mediums. The artist that walks into the classroom on the first day will not be the same artist who walks out even a week later. I would highly recommend this class to an artist at any level. I'm very glad not to have opted to pass out of it. \nWorkload:\nThe syllabus is certainly not set in stone. There will be a completed drawing based off of what you've worked on in class every week or so, but he will adjust the pace of the class to suit the class's needs. \n"
        },
        {
            "course_name": "Basic Drawing",
            "review_date": "May 07, 2007",
            "review_content": "\nMatt Keegan is a prime example of the CRIMINALLY BAD ART TEACHER! This was a BASIC DRAWING CLASS, and for the second project, he had students create a COLLAGE. I cannot understand the justification for this. The course title \"Basic Drawing\" implies that the student will be taught how to DRAW, not be instructed to cut pretty pictures out of magazines and stick them onto a sketchpad. Keegan offered absolutely NO teaching of drawing to students WHATSOEVER, and his attitude toward evaluation of work is \"I'm ok, you're ok.\" Any work made by students, good or bad, was received equally by Keegan. This attitude does absolutely NOTHING for the student. Since he seems so afraid to teach, he should be BARRED from doing so. I am not at Columbia to waste my money to be told that my drawings are fine. I want to have the strengths and weaknesses in technique pointed out to me, and I expect the instuctor to offer insight into how I can improve my technique. I took basic drawing to LEARN HOW TO DRAW, and I am really irritataed that I received absolutely no instruction on this at ALL. I was not even given pointers on how to approach the aesthetic problems that arise in basic drawing. By far, the biggest waste of my time and money at Columbia.\nWorkload:\nOne \"composition\" per week. Not necessarily one \"drawing,\" being that drawing per se was not the main focus of the course, idiotically so...\n"
        }
    ]
}