{
    "prof_info": [
        {
            "prof_name": "Cathy Leung",
            "prof_id": 4853,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate French II",
            "review_date": "May 08, 2010",
            "review_content": "\nI have to disagree with the first review. I only took this class because I had to fulfill the language requirement, so I have little interest in the subject matter. Prof. Leung made this class so enjoyable that I actually considered taking another French course. She is kind, patient, funny, a little off (in a good way), and great at explaining concepts. You can't teach a language like you would say, math- you can write out grammatical formulas but you also need tangential conversation about different points (about grammar, vocab, culture, whatever). We read some great literature, learned more advanced grammar, and learned a lot of music/film/theater vocab (which will definitely help if you plan on traveling to France). Granted, Prof. Leung was a little scattered sometimes, but I've been taking French since 7th grade, and I think it comes with the territory :)\nWorkload:\n4 compositions (short and easy), few quizzes w/ flexible scheduling, midterm, final, homework exercises\n"
        },
        {
            "course_name": "Intermediate French II",
            "review_date": "May 05, 2010",
            "review_content": "\nI found her teaching disorganized and confusing. She writes all over the board and so it is hard to follow her points. She would spend too much time on something irrelevant, and not enough time on grammar points that everyone had problems with. We didn't do much for basically the first half of the semester, and had 3 compositions in the last 2 weeks of class!! Though she is a nice person and genuinely wants to help us, sometimes she'd let the class dictate when we took a test or turned in an assignment. I found this annoying - she's the teacher, she should decide and the students can handle it. Seriously, don't take french with her, it'll be the worst hours of your week.\nWorkload:\n4 compositions, bunch a quizzes, 1 midterm, 1 final\n"
        }
    ]
}