{
    "prof_info": [
        {
            "prof_name": "William Russell",
            "prof_id": 13013,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Green Accounting",
            "review_date": "February 05, 2015",
            "review_content": "\nThis content of this class was interesting to learn and so was the presentation of the material by Prof. Russell.  This isn't a strict accounting class.  If you're looking for that, you're in the wrong class.  I'll spend less time reviewing the content and more time reviewing the professor.\nProf. Russell seems to be a very nice person and certainly has a great amount of knowledge on the subject.  For all the enthusiasm and energy the professor has for his subject, and for all the work that the student is expected to produce, the amount of feedback the student receives is almost none.  I repeat, not one of the three major projects handed in merited any feedback from the professor.  This issue was the elephant in the room throughout the semester.  You won't know how you are doing (grade-wise) in this class other than the problem sets returned by the TA. Of the three major projects handed in during the semester, not one hint of feedback was given to any of the students in this class.\nIf receiving feedback from your hard work is important to you, do not take this class.  However, if you'd like to be exposed to corporate accounting practices that involve environment, social, and government (ESG) metrics while at the same time gain some understanding why this might be important, then this class is enlightening.\nWorkload:\nThroughout the course reading is light. One problem set per week which can take anywhere from 4 to 6 hours. One individual project (25%) and two group projects (20% & 15%) . Overall, the workload is light if you have good group mates for the group projects.  If you do, it's an easy A class. If you don't, welcome to the nightmare.\n"
        }
    ]
}