{
    "prof_info": [
        {
            "prof_name": "Matthew DiPentima",
            "prof_id": 11230,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 23, 2014",
            "review_content": "\nGreat guy, sweet, but\n1. Very harsh grader - he basically doesn't like anyone's writing, which is very annoying; makes an already challenging class freaking hopeless\n2. Office Hours/Help - literally none; you go to talk to him, and the minutes keep ticking, yet at the end you realize you haven't actually reached any conclusion and you have nothing to improve with. \nBut, his comments on essays are helpful, more so that meeting with him, so pay attention to those. Overall, I would only recommend him for strong writers who will go to the writing center for additional help!\nWorkload:\nusual; homework every night but readings were all great!\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 12, 2013",
            "review_content": "\nI was very nervous to take University Writing. I love writing fiction and poetry, not academic essays. Within the first few lessons with Matt, my attitude changed completely. He teaches with such clarity and really strives to make sure that each of his students understand what he's looking for from an essay. The topics of the four essays are also incredibly interesting, and the reading assignments he gives the students are 95% of the time really compelling and exciting to read. I also found that when I received less than ideal grades in the class, I wasn't angry. Matt grades fairly and you tend to end up agreeing with him on the grade you get. On top of all this, he is so organized, always responds to e-mails right away and is funny. He also handles the class very well, treating his students like colleagues rather than inferiors. Also, we had one kind of annoying kid in our class who always questioned Matt's ideas and points of view, and instead of either yelling at the kid or being flustered by his questions, Matt would start dialogues with the student and try to understand his position in the debate. I couldn't recommend this guy more. There is a good amount of reading and the papers are a little demanding but it's worth it. You'll become such a better writer. \nWorkload:\nFour essays, (called \"progressions), and weekly reading assignments/mini write-ups. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 18, 2012",
            "review_content": "\nMathew is a fantastic teacher. Everybody complains about UWriting but thanks to him I didn't mind waking up at 8:40 -- well, I minded much less. He is very clear, if you don't have a draft or small part of the progression it isn't the end of the world though don't make a habit of it and be sure to get your final essays in on time. He is cheerful, makes jokes, and it just generally a really nice guy. It is also clear that he is very intelligent and loves writing. Wish I could take another semester with this guy.  \nWorkload:\nNot too brutal.... We have readings and some writing responses. You'll probably have to write around 500 words between each class or every other class but the work all seems to make sense. Never thought he was wasting our time or giving busy work. Also the four major Uwriting essay...\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 07, 2011",
            "review_content": "\nMatthew DiPentima is a well-organized teacher that I learnt a lot from in the University Writing class. The assignments are clear and engaging. I happened to find many of the readings required fascinating. We wrote on compassion, terror, animal rights, psychology and philosophy. (Fitting, because the class was in the Philosophy building.) \nMatt offered very good feedback on both exploratory drafts and final drafts. He would often write full, single-spaced responses in letter format in addition to the mark-ups on the actual paper. We also used a workshop style critique to improve upon our exploratory drafts. He would pair us up with others in the class, have us read our compadres' essays, then write responses to them. Sometimes this was helpful and sometimes it wasn't.\nThe class isn't easy for those who don't like reading or writing. There are many readings each class near the beginning of the semester and many writing assignments every class towards the end of the semester. Most of the daily homework is not graded, with only a check recorded for completion. Work hard on the final drafts. I know lots of people would complain about the workload, but it was in no way unfair. Just do your work and it will be fine. This class also utilizes the new Courseworks which is a nice way to upload writings on the web. He also requests that you print your work out.\nBeware if this class occurs at 9:10 AM. You'll probably be late once or twice and you might see some sleepy people in the class. I would highly recommend this class. Matt is a great teacher.\nWorkload:\nFairly large readings: 8-10 pages. Writing assignments each class: approximately 500-1000 words for smaller assignments. 3 big essays: progression essay, conversation essay, and research essay, ranging from 1500-3000 words. Final retrospective essay 1000 words. Research time for writing essays.\n"
        }
    ]
}