{
    "prof_info": [
        {
            "prof_name": "Elaine Sisman",
            "prof_id": 139,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Mozart",
            "review_date": "December 24, 2016",
            "review_content": "\nSisman is an extremely knowledgeable lecturer who is very enthusiastic about her subject. In class, she will usually play clips from performances or operas and provide commentary. Sometimes, she will also play musical excerpts on the piano to emphasize certain sections. She definitely expects students to participate in discussions, so make sure you do your readings. \nOverall, the work is very manageable. As long as you don't procrastinate on your papers, you will be fine.\n\nWorkload:\nParticipation\nOne short 2-3 page paper\nOne 8 page paper\n5 page midterm\n7 page final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 21, 2010",
            "review_content": "\nThis class was one of the best I have even taken at Columbia. \nProfessor Sisman is incredible at teaching what she loves and makes the material covered very interesting. \nShe also had various guests come perform during class. She often sits at the piano to explain concepts and to detail aspects of the pieces. \nLot of anecdotes/jokes on the composers. \nCourse covers Medieval music, Renaissance, Baroque, Early Classical, Late Classical, Modernism, Jazz, Post-Modernism and Electro-Acoustic. Class visit to a MET Opera.\n\nWorkload:\nVery fair:\n- Readings from two books (never checked) over the semester\n- 2 papers \n- Midterm and Final\n"
        },
        {
            "course_name": "Mozart",
            "review_date": "December 30, 2004",
            "review_content": "\nSisman is extremely knowledgeable about her subject and very interested in teaching.  She learns everybody's names (and remembers you throughout following semesters), is serious about reading and grading papers and making sure that everybody understands the material.  The downside of this last point is that if you are a music major, or knowledgeable about music, you may find the course at times mind-numbing.  When she refuses to discuss the meter of a piece because \"compound meter\" is too complicated a concept for the class to grasp, you may wonder why she bothers making this a 2000 level class.  You will definitely wonder why she doesn't bother teaching any higher level courses.  For those with a strong musical background, taking Sisman's class is a trade off:  she is a leading musicologist, passionate teacher and neat person but the level of the class is disappointgly low.\nWorkload:\nOne research paper which takes effort but is very open in terms of subject matter, a take home midterm and take home final which are a breeze if you have taken other music classes.\n"
        },
        {
            "course_name": "Mozart",
            "review_date": "May 08, 2004",
            "review_content": "\nOne problem I had with this class is that it's at a strange 2000 level.  There are freshman from Columbia and grad students from Juilliard in this class....I don't know how Professor Sisman factors this in when she gives us our grades.  Music analysis can get pretty technical and it is easy to get lost.  I really wonder how many people in that class could follow what the professor was talking about.  Readings can also get technical and boring, depending on the book.\nWorkload:\nTakehome midterm and final which are EXTREMELY difficult if you're not a music major. You can't just BS like you do in music hum. This is Professor Sisman, afterall, the leading lady in musicology.  It's said that knowledge of music theory is not required, but it is really hard to give thorough answers that will get you full points on the midterm/final if you don't know music theory and if you don't have very very sharp listening skills. \nThere is one paper and the topics are pretty broad, so you can choose one where you can show your strengths. \n"
        },
        {
            "course_name": "Mozart V2024",
            "review_date": "April 20, 2004",
            "review_content": "\nAn amazingly accomplished and knowledgable professor teaching students on the subject for which she is most passionate: What more can you ask for? Prof. Sisman makes an effort to learn the names of all 50+ students in the class. She is very approachable and kind, and she encourages different interprations of the music than her own. The class is rich with information and intellectual discussion and musical analysis. Especially interesting are the classes devoted to Mozart's Operas and final symphonies. This class made me want to become a music major. Sisman gets an A+. Take this class if you can. Prior knowledge of theory and familiarity with Mozart's music are not required, but helpful. \nWorkload:\nlight: read a few essays (all very interesting!). Midterm take home, final take home, and essay. Lots of active listening (if you consider that work)\n"
        },
        {
            "course_name": "Beethoven",
            "review_date": "April 02, 2003",
            "review_content": "\nThis is not a class for non-music majors. It is very difficult if you enjoy music as a whole, and not the challenge of analyzing it to death. I have a music background (RECREATIONALLY). Just because you played the violin in fifth grade, or the harp since third does not mean you will enjoy the class. I was in awe at the music majors, they are dedicated and powerful listeners. I am not one of them and longed to be a member of their group, but I was years and years behind.\nProf. is nice, but has very little patience for those who thought to themselves \"Beethoven? That sounds interesting. I'm studying MELAC... but I'll be fine.\"\nWorkload:\npaper,take home midterm and final, based mainly on lectures so take amazing notes and save the handouts!!\n"
        },
        {
            "course_name": "Beethoven",
            "review_date": "February 09, 2003",
            "review_content": "\nGenerally, quite a good professor.  She is extremely, extremely knowledgeable about Beethoven and classical music in general.  Occasionally, she could be a bit sharp in responding to a stupid question, but generally she was very pleasant and approachable.  This class seemed to be a mix of music and non-music majors.  I (a non-music major) found it a bit challenging, but very do-able.  Perhaps music majors would find it a bit on the easy side.  My only real complaint was that some of the readings were not that engaging.  However, they were not really that essential to the class. The listenings were the most important homework and they were (this is Beethoven, after all) terrific.\nWorkload:\nTake home midterm, paper, take home final.  The grading was relatively easy, although Sisman is a stickler for grammar and spelling.\n"
        },
        {
            "course_name": "Beethoven",
            "review_date": "December 23, 2002",
            "review_content": "\nProfessor Sisman is the chairman of the department for a reason. She knows her stuff, and will come to class filled with information. (She also dresses very well and has a cute sense of humor.) In this class we studied a variety of works by Beethoven, all of which were very enjoyable because of the way she presented them. It was a pleasure being in her class, and I would highly recommend her.\nWorkload:\ntake-home midterm, take-home final, paper\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 02, 2002",
            "review_content": "\nStudents in Prof. Sisman's class should be ready to work. Sisman is very knowledgable, and she expects her students to learn and participate alot. It may seem like a pain during the semester, but learning from her definitely pays off on the midterm, final, and class reports.\nWorkload:\n2 concert reports, final, midterm, class participation\n"
        },
        {
            "course_name": "V2023 Mozart; V2026 The Symphony",
            "review_date": "December 31, 1999",
            "review_content": "\nSisman, though knowledegable, delivers dull lectures. Better on historical background than she is on analysis. Perhaps this is because of the odd intermediate level of 2000-level music classes.\n"
        },
        {
            "course_name": "V2023 Beethoven; V2023 Mozart; V3125 Music of the Classical and Romantic Periods",
            "review_date": "December 31, 1999",
            "review_content": "\nElaine is quite knowldegdable in her field, which is classical/romantic music, especially Mozart and Haydn. She's the only female tenured prof in the music dept, which must mean something. She's a little soft-voiced, but her lectures are packed full of info, and boy does she know her stuff. She dresses sort of dainty and I'm still trying to figure out where she shops. I think she grades easier on non-music majors. She likes to go thru pieces in details at times but she'll always have a handout outlining the piece. Many of her classes \"require\" prior ear training exp or theory, but you really don't need it. If you want to learn alot of new music in the classical style as well as some relevant anecdotes, definately take a class with her.\nWorkload:\nmedium (if you choose to do it). weekly readings, and listening assignments. 1 paper, midterm, final.\n"
        }
    ]
}