{
    "prof_info": [
        {
            "prof_name": "Matthew Sharpe",
            "prof_id": 990,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Tactics of Fiction",
            "review_date": "August 10, 2004",
            "review_content": "\nIt's difficult to believe that this man was the same one in the previous reviews.  Alien Abduction?  Demonic Possession?  Perhaps there is no explanation, but he wasn't the committed or helpful teacher I had expected from his reputation.  Most of the time he seemed to be phoning it in, he played obvious favorites, and subtly encouraged the class to go after certain students.  Just a weird vibe throughout the semester.  His written comments were often helpful, though, so maybe it balanced out.  Generous grading.\nWorkload:\n4 stories, and he's flexible.  Great, great readings.\n"
        },
        {
            "course_name": "Structure and Style II",
            "review_date": "January 09, 2003",
            "review_content": "\nMatt Sharpe is the bomb.  His comments and written feedback on work are lengthier and more insightful than those of any other professor I've had, at Columbia or otherwise.  I really felt he had read my work and put serious effort into the advice he later gave me, and when I got my grade I knew why I had gotten it.  He's also a creative guy who runs a witty, well-done class.  His in class writing exercises always pushed me in new directions of thought and style.  He does a fairly good job at getting classmates enthusiastic about workshopping, though inevitably, workshops can drag if the piece stinks or if the class is beat-street.\nWorkload:\nSharpie Sharpe collects assignments pretty regularly throughout the semester, a poem here, a scene there, so you have to keep on top of it.  Word to the wise - his own word has been described as \"absurd\".  If you're ever stuck on an assignment, just write something wack as shit and he'll probably dig it.  \"Ah, yes.... this is quite absurd....I don't really see why the innkeeper isn't wearing any pants, but I like the weirdness of it.\"  It worked for me.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "February 28, 2002",
            "review_content": "\nHe was a funny guy in a low key sort of way. Read his book its funny. Its called Nothing is Terrible. Its quite absurd. In class was pretty good at keeping the class going. He was a little too generous with his complements though, and so our class did not criticize our stuff very much\nWorkload:\nLight. 2 poems, 1 monologue, 1 dialogue, 1 short story.\n"
        }
    ]
}