{
    "prof_info": [
        {
            "prof_name": "Meha Priyadarshini",
            "prof_id": 3539,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "World Migration",
            "review_date": "May 20, 2009",
            "review_content": "\nMeha was a mediocre TA. She told us up front that she didn't have much background knowledge on the class subject and that she would basically be on the same page as us for all of the readings. This showed - most of our discussions were not \"discussions' at all but instead just a review of the really basic points from each of the articles. This isn't totally her fault, though. First of all, the discussion itself is supposed to be a \"review section\" meaning it's basically supposed to just rehash what's been said in lecture/the readings. Second of all - and this was the killer for me - there are a LOT of whiny Barnard girls who waste the whole section time complaining about how they don't understand the structure of the exams/papers. They literally ruined what could have otherwise been a (somewhat) enjoyable section.\nWorkload:\nThe class overall isn't much work. There were maybe two people who did the readings and they didn't have to because the exams literally did not cover a single thing that was not discussed in lecture.\n"
        },
        {
            "course_name": "Latin American Civilization I",
            "review_date": "December 15, 2008",
            "review_content": "\nMeha's focus isn't Latin American history, but she brings some enthusiasm to the subject, and is fairly capable of answering easier questions and explaining some concepts.  It as obvious that she knew as much as we would have if we had read everything required.\nShe has the familiar \"TAint your friend, TAint your professor\" kind of awkwardness, and had us describe the circumstances surrounding our births.  \nOverall, she was friendly and casual and baked us brownies.\nTAint bad.\n\nWorkload:\nOne short presentation on one of the readings, with some discussion questions, once in the semester. \n"
        }
    ]
}