{
    "prof_info": [
        {
            "prof_name": "Amber Miller",
            "prof_id": 1615,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 25, 2010",
            "review_content": "\nNo. Don't do it! \nThis course title is misleading and you will be pissed when you sit in the class on the first day and have the professor remind you of that fact. It's for non-science majors, yes. But Physics for Poets sounds cool and the title holds the promise of a certain whimsical, imaginative, mysterious, beautiful and metaphysical foray into the way things work in nature and in space. Uh, No. However, you will feel motivated to write poems in this class, since the constant daydreaming you will do makes for great poetry writing.  You should pay a little attention, though, because some of what you're ignoring is gonna be on your homework assignment and you can't submit a poem. If you have to take this class, go to every session our lovely TA Robert conducts and he will give you all the answers you need and he'll even repeat them for you if you had been writing a poem or haiku while he was lecturing on the topic the first time.\nThe assignments took a lot of time for many of us, maybe those of us less disciplined poets who yearned for metaphors and analogical thinking to help our tender souls make sense of the profundity of nature and the cosmos  as it was presented so unimaginatively on those dang power point slides. And the door always had this moaning whooshing sound when closed. Frightened air was trying to blast its way in or out, always a panicked air blowing through that door...\nSometimes when we just sat there looking at Professor Miller with our blank faces, she would say \"You guys look tired.  Well, how do you think I feel? I have to TEACH this class...\". And she was serious. She was mostly serious and rigid when conducting class. When speaking to her face to face, she was kind and very helpful and her pleasant twinkly eyes and a perfect professional crispness didn't seem so harsh up close. She just doesn't seem happy teaching, it certainly isn't her strong suit. And it's obvious to everyone, herself included. So why does she teach this class? Why should Columbia students --  or ANY students for that matter, have to settle for unenthusiastic teachers?\nThe worst part was the haphazard organization of the course. It was a mess. Miller jumped back and forth through chapters and it was hard to know if you should have known the stuff presented in the chapter before. There's a deadline for grade gripes but somehow, every time I realized a TA had improperly deducted from my answer I realized that my beef was toast since the deadline for said beef had already passed. You should know that your homework gets whisked up into the hands of TAs who NEVER return your homework. It took for. ever. to get my homework back.\nEveryone was pretty humiliated after the first midterm was returned. You must take a second midterm and she takes the lower grade of the two. And after the second midterm, still there were some grumbling and 'fuck this' faces. She drops two of your lowest homework grades but that doesn't matter because the final was long and sometimes hard and people were sweating and sighing. \nI got a B. Ode to a feakin' B. Others were secretive about their grades so they may have done the same or worse. Or better since they may have been sensitive poets and didn't want to hurt me.\nHAIKU\nEinstein curved space time\nrelativity was real \nNewton didn't know\nWorkload:\n24 lectures.11 homework assignments. 2 midterms. 1 final exam.\n"
        },
        {
            "course_name": "Physics for Poets I",
            "review_date": "January 03, 2010",
            "review_content": "\nForget previous reviews that say how easy it is and what a perfect course it is if you're trying to get your requirement done or boost your GPA.\nWith Dr. Amber Miller, this 1000-level elementary course transforms into some 3000-level intermediate course, and she teaches you physics more than you wish you knew or in other words, more than it is required of you to know and no decent person will not be overwhelmed by the amount of information that she overloads on PowerPoint slides. So if you happen to love physics, want to gain in-depth knowledge, or find enjoyment in learning, you will love her.  Otherwise, I strongly recommend that you take Earth, Moon, Planet with Applegate. \nAmber Miller is very knowledgeable and takes her teaching job VERY seriously (possesses characteristics of a good professor,) although she is primarily a researcher. And she has a PhD/MA from Princeton(where I transferred from) and BA from Berkeley and specializes in cosmology, but surprisingly not pretentious at all. She clearly lacks affectation required of every Princetonian. Maybe too serious to be sociable...? I wish she learned how to be a poseuse rather than polishing her diva status. \nAt the beginning of the term she warned us that this course would not proceed chapter by chapter through a textbook, and I though it should be fine. Boy, was I wrong on that assumption!  Since we skipped many chapters, we sometimes lacked prerequisite knowledge that was supposed to be covered and therefore, had to find relevant chapters and do reading on our own or search necessary info online in order to do our homework. In fact there were problems that were so ambiguous or not covered in class that we had to consult Wikipedia or beloved Robert (our TA). She also mentioned that she would select readings that would help us understand the topics that we chose, but for the first part of the semester, there was no instructions.  Also, graders didn't return graded homework/exams in a timely fashion, though Robert posted solutions for review.\nAs for exams, she doesn't tell you what you should know or doesn't give you practice exams, but you can predict and focus on certain topics/questions that may show up on exams. Midterms (short answers and a few easy math questions) were not particularly difficult(mean was about 148 out of 200pts and 137 out of 180 excluding 14 students who missed the 2nd midterm) but long. The final exam was long (total 545 points) and difficult and required thorough knowledge and understanding, though there were also very simple questions - for example, the age of the universe (probably worth only 3pts) and whether or not the orbit of the Earth will change should Venus suddenly collapsed into a black hole. \nShe grades on a curve, so I ended up with a B despite my poor performance on final (about 55%)   But I would have received an A if it was truly a 1000-level course. \nHaving said that, I liked most materials covered in class.  It's just that I wouldn't risk my GPA.\n\nWorkload:\nNot much reading, or put another way, exam questions come from lectures, so you have to go to class...\nWeekly assignment (difficulty varies, can be very easy or challenging, but most people managed to get above 18 out of 20 on average) and the two lowest scores will be dropped.   Two midterms and final (long and minute)\nHomework assignments (25%), midterms (30% from the better score of the two), and final exam (45%)\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "July 16, 2007",
            "review_content": "\nShe knows her stuff, doesnt mean you will. Homework problems are impossibly hard. Exams are really really reaaaaaly hard. If you want to fail, and do so after working your butt off, take this class. I highly recommend shifting to 1401. You wont regret it. \nWorkload:\nMidterms are Hard, Final exam relativity will kill you. \n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "March 06, 2007",
            "review_content": "\nVery clear and interesting lectures.  Prof. Miller didn't make any assumptions about prior knowledge and did her best to make sure every single person stayed with her.  Homework much more difficult than lecture examples, but doable if you go to the help room or recitation sections.  Difficult exams, but one is dropped and the curve is VERY generous.\nWorkload:\nweekly problem set (~10 questions), 2 midterms (one dropped), 1 final\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 08, 2007",
            "review_content": "\nI like Amber Miller.  She taught the material well, especially relativity.  Every now and then she would stop and make sure everyone understood what was going on.  She seemed very interested in making sure the students were learning and understanding the material.  \nIt was also helpful that she allowed a page of notes on the exams.  I wish my Calculus teacher had done the same...\n(My only qualm is that it was sometimes hard to see her decimal points, which would confuse me at times.)\nWorkload:\nWeekly problem sets, two midterms (one of which will be dropped), and one final\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 30, 2006",
            "review_content": "\nshe is a very nice teacher but also the homeworks are much harder than the examples given in class. additionally, the first midterm was pretty easy if you know the topics and also was very similar to the practice midterm, but then the second midterms was extremely hard, both topic wise and question wise, and much harder than the practice. luckily you drop the lowest of the 2 midterms. the final was challenging but easier than the 2nd midterm, though relativity is almost impossible.  but seems that there is a decent curve.\nWorkload:\n10 questions from the book each week. they r hard but between the help room and finding the answers from past years, they r doable.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 23, 2006",
            "review_content": "\nProfessor Miller was a decent lecturer. She tended to be go through the problems she did on the board rather well but she taught straight out of the book. Although, she was considerably more organized than the book-behemoth itself. I learned more from the TA's than I did during the class. Relativity was touched only superficially but there were two problems out of 8 on it on the final (which, by the way, was not a walk in the park, contrary to other reviews.)\nI didn't take AP Physics in high school but I still consistently scored top 3 in my class. But I still wasn't even close to the level of these other guys. The people here tended to be geniuses or failed geniuses from the 2800 level. \nTake this class if you are serious about physics. Find someone who you know who is a physics god if you want to pass. \nShe says she gives make-up finals. Thats a Lie. I had 3 exams that day, hers was the first, and 1 the next day and she point blank told me she would not move her exam. Absolutely rigid would be a term I could use for her as a whole.\nWorkload:\nVery very hard problem sets. Midterms were decent if you knew the stuff or went to the physics help room. Very hard final. Know your stuff.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 10, 2006",
            "review_content": "\nIM SO CONFUSED\nDid all the previosu people take 1601 with the same Amber Miller. I was a student who aced the Physics B exam and it was a difficult class because whatever she taught was worlds easier than the problems on the homework. Don't even touch relativity...that part of the class no one in the class got that. The majority of the class did not like her becasue she was a terrible teacher but not many have written reviews for her. Granted, she is an INCREDIBLY nice person. Very smart, but she is not the person for this class. Her notes are not detailed and how she writes them on the board, they are not able to be studied from for the exam. THe book sucks, and ther are not enough examples for what we learn in class. Poor wording and difficult reading causes everyone to hate that blasphemed cube of papers.\nTake it if necessary, but do your best to get  parsons or whoever else. \nWorkload:\n2 midterms, one dropped, difficult final, 10 prob sets, about 1/3 are impossible and the rest are manageable\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 13, 2005",
            "review_content": "\nAs the review before mine said, Miller is great, enthusiastic, neat, organized, and VERY approachable. She tries to get everyone engaged in the class. Teacher easy to get, so take.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "June 02, 2005",
            "review_content": "\nThe lectures were presented by introducing concepts, then following with  rather in-depth examples.  This works well; however, if you prefer to learn physics by derivations and definitions, this might not be the class for you.\nThe book is ok.  It is one of those physics books that has plenty of pictures and colors to calm down people who are nervous about math.  The mechanics and thermodynamics sections are handled reasonably well, but the E&M; isn't good at all.  The problem is that they dummy down the math to the point that many of the intuitively obvious vector calculus ideas become difficult to understand, rather than explaining the mathematics first and then the physics.  For example, they don't even use vector notions of curl and divergence when discussing fields, and all problems where area, volume, or surface integrals would generally be needed can be simplified to single integrals.  I would recommend using a supplementary book while studying this section if you are seriously interested in physics.\nThe homework consists of ten problems.  Usually these took me about 2-4 hours.  I would STRONGLY recommend doing them yourself if you want to learn the material.  The TA for the first semester was decent, but the second semester TA basically gave away the answers at recitation.  I know some might find that to be great, but honestly, having your head ache for 10-20 minutes before understanding a problem is better than having someone do it for you and losing the experience.  Homework is 20% of your grade.\nThe exams are doable.  There are 2 midterms and 1 final per semester.  Students are allowed handwritten notes on one side of paper for midterms, and two sides for finals.  Midterms aren't easy, but perhaps it is a testament to the class that as I was reviewing my errors on them for the finals, I was banging my head against the wall at how foolish my mistakes now seemed.  The finals are really a comprehensive test of the material, and are worth studying for.  Your best midterm is 30% of your grade, and the final is 50%.  The curve is reasonable: it is difficult to get an A unless you really know your stuff, but an A-/B+ is pretty much in the pocket if you stay up to date.\nAmber Miller is friendly and competent.  I would recommend this class.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 09, 2005",
            "review_content": "\nAmber Miller is an excellent lecturer and has a good rapport with her students. She has frequent asides with students, answering some very interesting questions and making the class much more enjoyable. The material is taught slowly and fairly thoroughly, being reinforced week by week. A helpful habit of hers is that she recaps the previous lecture before each current lecture, making it easier in case you've missed it. She is always very well prepared and has immaculate handwriting. \nAnother very positive aspect of this class is that Miller drops one midterm. The first midterm is almost assuredly going to be a piece of cake, especially if you've taken physics before. Well over half the class got A's. The second midterm is significantly more difficult due to the material, but if you've done well on the first one, it will drop. \nI strongly recommend Amber Miller.\nWorkload:\nTough but doable weekly problem sets, two midterms (one drops), surprisingly difficult final that curves generously.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "January 02, 2005",
            "review_content": "\nDisregard old reviews: she is great now. The classes are well planned, lots of example problems solved in the class, adequete practical examples as well, approachable, willing to help, knows the stuff well. On the downside, the course was not paced consistantly. At first it was a bit too fast, and later it was just too slow.  Overall: I will strongly recommend her. And though it's not her fault, the TA sucks.\nWorkload:\nProblem sets each week, each containing ten problems three-four of which will be not-difficult. Posts solution to problem sets online pretty regularly.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "July 01, 2004",
            "review_content": "\nDisregard the reviews from 2 years ago!  She teaches alright.  She tries hard to make the class interesting by throwing jokes around here and there.  However, because the class covers a lot of material, she sometimes would just write down tons of equations and give little explanation.\nShe's very approachable and willing to answer questions. \nWorkload:\nTwo midterms and one final.  They're pretty difficult, but the grading curve is very generous.  Weekly problem sets that take about 1.5 hours each to complete.  The Physics Help Room would be a nice place to turn to if you're stuck on some of the problems.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 19, 2004",
            "review_content": "\nTries hard to make class interesting, but the course covers so much material at such a fast pace that she ends up just throwing up equations on the board which only make sense to you when she explains it. When you try to the do hw on your own you're pretty much completely lost since just knowing the equations doesn't help you at all. Nice, but not that great a teacher\nWorkload:\nProblem sets every week, very hard. Two midterms and a final, one midterm dropped, all very hard. Everyone will  fail all the tests, so there is a huge curve.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "January 23, 2004",
            "review_content": "\nContrary to other reviews, I really did not find Professor Miller to be as terrible as alleged. I am taking her this semester, and she teaches just like Professor Hailey from last term, with less experience, let's just say. The only difference, I would think, that lead to such contrasting reviews, is that Professor Hailey cut his students a LOT of slack, where i don't think Professor Miller has learned how. To those engineering students or people taking the class for the requirement, a word of advice: drop down to 1402, but for those who are seriously inclined to major in physics: stay in, you might learn something.\nWorkload:\nregular, 7-8 problems per week, 2 midterms and 1 final\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "August 16, 2003",
            "review_content": "\n﻿Some people are meant to teach and others, like Professor Miller, are not.  Although she was new to the instructing arena, thatÂ’s no excuse for her lack of command of the material and of the class in general.  MillerÂ’s voice was often too soft to be heard and she usually spoke to the blackboard.  Unless you sat in the first few rows (or even if you did) many were prone to sleeping, doodling, listening to their walkmans (yes I often witnessed this), or at least donning a glazed countenance.  Miller commanded very little respect and she often had to stop to hush the class with feeble threats of pop quizzes.  Professor MillerÂ’s lectures were long and dull, consisting mainly of derivations and very very rarely of an example problem.  I realized only too\nlate that she teaches straight out of the book.  If you take the text to class you will be able to follow along section by section if not sentence by sentence.  ItÂ’s sad.  Basically, if you donÂ’t wish to spend countless hours teaching yourself out of the book and prefer a professor who holds interesting lectures and provides good notes, this class is not for you.\nWorkload:\nWeekly graded homework assignments consisting of about 10-15 problems.  Two midterms that are challenging but straight from the book- Plus, she drops the lower grade.  One final that was very challenging- it covered a lot of information and contained a few tricky questions.\n"
        },
        {
            "course_name": "Electricty and Magnetism",
            "review_date": "June 04, 2003",
            "review_content": "\nAmber Miller had a very difficult with this time with this class almost from the beginning...  this was her first time teaching a lecture course and the students showed no mercy.  *CULPA CENSOR* ...much of the class did not take her seriously from the beginning.  The result was that she soon lost control before she really had a chance to prove herself, which she actually did with her cosmic microwave background lecture.  For the few students that bothered to attend that lecture she proved herself once and for all to be a competent and accomplished physicist well-deserving of her position at Columbia, but by that point most of the students had decided she was a bimbo and stopped attending class.  THis also produced an absolutely atrocious curve, (I think the mean on the final was 202 out of about 450) because a lot of the students just copy each other's homework and as a result don't learn.  Ultimately if you get Miller, be prepared to learn a lot from the textbook because she is not very good at explaining things.  I think that if she gets a class that is more respectful she would do better, but she still needs a bit more experience to learn how to infuse some life into the material.  She is too dependent on formulas at the expense of concepts, a major pet peeve of mine.\nWorkload:\nThe problem sets are difficult but DON\"T COPY THEM!  They are the only way that you will figure this stuff out because E&M; is HARD!  the first midterm is easy, the second is very difficult, and the final is somewhere inbetween.  \n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "June 03, 2003",
            "review_content": "\nI heard that Miller is very knowlegeable. Since it was her first time of teaching, Miller wasn't really able to make her class interesting or comprehending. She put or rather derived many confusing formulas on the board with very inefficient explainations. I don't really blame her for that, because she truly tried her best. Her class was a bit boring but manageable if you really sit down and study your text book. I really mean it. You have to pretty much study the whole course on your own. If you are the type of person who relies largely on the class lectures, don't take this class. Homework counts a lot in the final grade. The best way to study for her exam is to go over all the homework problems, which are hard and study the text book's examples problems. Good Luck for those who want to accept this challenge. \nWorkload:\nweekly homework, two midterms and one final\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 31, 2003",
            "review_content": "\nIf you're scheduled to take a class that Prof. Miller is teaching, don't let the other reviews get you too upset. First of all, 1602 covers so much material that any teacher's explanations would have been short and somewhat curtailed (this is less true for 1601 for example). She showed interest in communicating the material to students and, while it's true that she doesn't do so very well, this was her first class at columbia and she may be open to feedback and have learned some lessons from this class. \nAnd let's be honest about some of the other reviews. With their blatant tone of mocking condescension, they betray a prejudice that dogged Prof. Miller's relationship with class throughout the term: sexism. It was unfortunately too clear that a number of students took simple mistakes that any teacher makes on the board and turned it into an indictment of her intelligence. I even overheard some guys agree after a class that she \"doesn't have a clue what she's doing.\" I'd like to see any of them get a tenure-track job as an experimental cosmologist at a ivy league school. So don't fall for that crap.\nLessons for you the student: Don't come late to class. Don't yack with your friends in class. You would have learned these common standards of politeness eventually but Prof. Miller will ensure that you learn them now. Just grow up a little and go along. \nAlso, 1601 & 1602 are not hard if you do the problems as much as possible on your own. Do not copy others' work and do not depend too much on the TA's doing the problems for you. Sometime I did the latter, and and it came back to haunt me. Just do the problems on your own and you'll be fine.\nWorkload:\nweekly HW, 2 exams, one final, all generously curved\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 27, 2003",
            "review_content": "\nOh do I need repeat? Electricity and Magnestism is notoriously a tough subject... to add a terrible teacher who cannot teach, adds to the pain.  I opnened the book one day in class and as I suspected, everything down to the expamples was pulled right from it, ommitting of course the sometimes helpful conceptual explanations. She stares into the board and derives formulas and when you ask \"what does that mean?\" she replies with another formula. I suppose its good we were allowed to have formula sheets then on the tests, otherwise there would be many left out on a limb. (My advice, make those formula sheets - people put expamples on there too which was a very helpful suggestion.) Unless you've taken AP E&M; or have a good grasp of the material I'd say swallow your pride and take 1402. Youll be glad that you did. If you want to understand what you are studying, don't take this course. Its not about learning the concepts in this class, its about struggling to memorize which formula applies where. I'm sorry Prof. Miller, I didn't learn a thing from you.\nWorkload:\nWeekly Problem Sets (10 problems, 2 dropped, challenging, go to the TA session), 2 Midterms (1 dropped, make a formula sheet!), 1 Final (50%, dont worry everyone's going to fail, there will be a curve)\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 24, 2003",
            "review_content": "\nAmber Miller was obviously a new teacher this semester as she struggled through demonstrations and could barely contain herself when students had the audacity to show up late for class.  I tried to give her a chance, but after awhile I gave up (like many of my peers) and didn't even go (which solved a couple of her late arrival problems).  If you find yourself in a similar position just accept the fact that you have to teach yourself physics because when you do get to class on time you quickly realize that amber's not a very good teacher.  She's great at following her notes though and who doesn't like that!  The way to get around this class is to pull off one money midterm and go to the TA sessions.  The TA does the homework for you and Prof. Miller drops one of your midterm grades.  Don't worry that the final's worth 50% of your grade, you're not going to do well on it anyways.\nWorkload:\nWeekly problem sets.  2 Midterms, 1 dropped.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 22, 2003",
            "review_content": "\nI don't think anyone in their right mind would have something positive to say about Ms. Miller. Her lecturing cannot keep anyone's attention, she just spits stuff off the top of her head and writes it on the board. It's amusing because she makes mistakes the entire time, despite having pages of notes in front of her. I was especially displeased as she would not explain her derivations of many problems and we were later expected to regurgitate them on the midterms. Speaking from experience, if you are not at least in Calc IIIs or IVa you are screwed. It didn't dawn upon me until I finished learning partial multiavariable differential equations at the end of the semester that I should have known them for this class. Same goes for double and line integrals. \nAlong with her complete inability to lecture in a professional manner, she was never able to carry out basic experiments and frequently threatened to an at least 150+ lecture class that pop quizzes would be given due to 10 minute lateness of students. Please avoid her, I think that eventually she'll figure out how to teach this course, but not any time soon. No ability to teach and just plain mean....\nWorkload:\n11 problem sets (you'll copy them), 2 midterms (first one is easy and second one is hard). RIDICULOUSLY HARD final. one midterm is dropped and 2 homeworks are dropped (supposedly)\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 18, 2003",
            "review_content": "\nAmber Miller is terrible, as you've read from the other reviews. Amber Miller takes everything personally. In a 130 person lecture, she threatened giving us pop-quizes in the first 10 minutes of class because she thought it was rude that some students would come in late. I guess she doesn't understand the idea of a LECTURE course, as she would comment anytime she heard talking or someone would leave early. Amber, not everything is about you. Or maybe it is. Compared to 1601, there was more talking for two reasons: 1) Amber Miller does not have a commanding lecture style and 2) Amber Miller's lectures are horrible.  In her defense, the class did seem to have a few people trying to prove her wrong whenever they could, but then again, if she presented the material more clearly, it wouldn't have been an issue. Amber Miller's lectures amounted to putting derivations of formulas on the board, often the same ones found in the text book. Her lectures were useless and the book isn't great either (Fishbane). The first midterm was ridiculously easy and the second ridiculously hard. She is so incompetent as a teacher that she said to the class after the second midterm, \"The average was lower this time and I'm not sure why.\" This was her first semester teaching....\nWorkload:\n10 homework problems a week, typically including a few extremely difficult, not-representative problems that you'll copy from someone who went to the TA's recitation, 2 midterms, final (very hard), but the mean is the border between B and B+\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 17, 2003",
            "review_content": "\nAmber Miller is a horrible teacher.  She throws equations up on the board with little to no explanation, and her demeanor discourages questions (she answers them, but if you want any sort of real explanation for the topics, go to the physics help room - if you ask her in class, she'll mostly just repeat herself).  She works almost straight from the book, to the point where you can open the book and follow along as she goes through everything.  Her lectures go at a pace such that if you're not a physics genius and aren't already familiar with the material, you have a hard time keeping up.  Lectures often had 20% of enrolled students attending class.\nSurprisingly, however, she's very nice in person.  If you go to her office hours and ask her questions about the material, she'll happily answer them and is very good at explaining specific things.  Maybe she's just nervous in front of crowds, but that doesn't justify her behavior.\nShe seems to have ego issues with her teaching; students often came in late to her class (we're talking large lecture class, 150 students), and this would annoy her and she'd threaten to start giving quizzes.  If students walked out in the middle of class, she would make fun of them or grumble.\nOverall, avoid Miller if possible, but if you're stuck with her, definitely go to her office hours.  She'll solve homework problems for you and explain stuff with a smile on her face you'd never think existed.\nWorkload:\nweekly problem sets (challenging), 2 midterms (1st was ok, 2nd made class cry), final (challenging but doable)\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 15, 2003",
            "review_content": "\n[culpa censor]...She is by far the worst teacher I have had at Columbia.  Her lectures are unintelligable even to those very good at science and math.  Her inability to explain anything was bad enough, but the textbook was equally horrendous.  To anyone who has to take physics, take the 1400 track instead and steer clear of this class.  \nWorkload:\nA problem set every week, 2 midterms(one dropped) and a final.  \n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 14, 2003",
            "review_content": "\nA very nice woman who at first appears to be a ditz but do not be fooled, she's a Princeton graduate who specializes in astrophysics.  Unfortunately, she's a terrible teacher.  Her lectures don't relate to her exams at all.  Stay away.\n"
        },
        {
            "course_name": "Physics II: Thermodynamics, Electricity and Magnetism",
            "review_date": "May 12, 2003",
            "review_content": "\nAmber Miller is the worst teacher I've ever encountered.  She did not even once try to explain a concept, she only explained the derviation of equations of concepts.  This is especially bad because people don't work with electricity in their daily lives and don't have a feel for it so concepts are foreign.  Also, her tests are always off.  The first midterm was ridiculously easy and the second ridiculously hard (3 of the 6 questions were worded in a way that made them impossible to solve).  Also, she was flatout mean.  She was not receptive to questions of any sort and couldn't handle it when there was even a little bit of noise.   Having her was ultimately a bad experience.\nWorkload:\nReasonable, one problem set a week, 2 midterms, and a final.\n"
        }
    ]
}