{
    "prof_info": [
        {
            "prof_name": "Rashmi Sadana",
            "prof_id": 2612,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "January 15, 2006",
            "review_content": "\nSadana is a very stiff professor.  Her excellent reading list certainly taught me a lot about South Asia, but I did not gain any insight from her.  She is clearly knowledgable about the topic and her section, in which she typically shows videos, was fascinating (though mandatory).  However, her lack of energy or enthusiasm in her teaching, and her tendency to read off a sheet of notes, is not conduscive to interesting discussion. She does make herself very available and is flexible with her time.\nWorkload:\nA midterm (approx. 6 pages) and a 10 page final. Very ambiguous on how exactly she wants the papers to be structured, which results in erratic grading. Not an extremely generous grader.\n"
        },
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "January 02, 2006",
            "review_content": "\nThis class does not have ANY exams: no midterm or no final. However, it is a very rigorous 3000 level introductory class that demands a lot of reading on the stidents' behalf. For each class you have to do a whole lot of intreresting primary  source reading which are supplemented by the lectures. There is a one hour mandatory discussion section which is basically just watching movies and documentaries that gives the course a soft side  and neutralises the pressure of the dry readings. One weekly posting on open ended topics mandatory, in class discussions highly appreciated, and pretty balanced syllabus. Also, Prof. Sadana deserves appreciation for being able to teach South Asian topics that are as controversial as middle-east problems pretty neutrally by focusing on all sides of the issues equally. She is a rational grader, is very approchable, and helpful. On the down side, she is a bit stiff in class as long as she is delivering the prepared lecture (but eases down as she enters the class discussion). Also, this being a fast paced introduction to a vast topic, students better do the readings. For those who does not have some idea about South Aisan history: specially read the optional/required Jalal & Bose chapters to make sure you know what is happening to the bigger picture otherwise you will be scrambling through the more focused texts without getting any clue about how to make sense of them.\nTaking this class can be a very nice option for fulfilling half of the major cultures requirement.\nWorkload:\nWatching movies, one response paper (online, courseworks) per week, one 5-6 page paper as mid-term and one 10 page paper for final. Lots of reading, still, easier than average workload.\n"
        },
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "December 16, 2005",
            "review_content": "\nProfessor Sadana is a good, thorough professor. She makes herself very available through office hours and through e-mail. However, she is a bit stiff in front of the class, not quite as spontaneous or as good at stimulating class discussions as other professors. She seems to still be finding her way a bit. All in all, you'll learn a great deal about South Asia (1800s to about the mid 20th century with some emphasis on present day problems), even if it isn't the most exciting course one could take.\nWorkload:\nA 5-6 page essay, a 10 page final research paper, weekly postings on CourseWorks.\n"
        },
        {
            "course_name": "Introduction to South Asian History and Culture",
            "review_date": "September 02, 2005",
            "review_content": "\nMs. Sadana led a well structured class.  She followed her syllabus and let the students know what she expected of them.  However, her attempt at constant class discussion led to many dull, uninsightful classes. It was clear that she was still feeling out her teaching style.  Apparently she has decided to add a discussion section for future classes - an unnecessary step in my opinion.  Overall, Ms. Sadana gave a basic overview of South Asia's move towards modernity.  While the class is in no way inspiring, she will surprise you with interesting insights on occasion.  You could do much worse, but you could also do better.\nWorkload:\nPretty light: 2 papers, midterm and takehome final\n"
        }
    ]
}