{
    "prof_info": [
        {
            "prof_name": "William Menke",
            "prof_id": 1170,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "July 12, 2013",
            "review_content": "\nWilliam Menke is not that great of a teacher, but he's not bad either.  His grading is very vague though, since he doesn't assign concrete points to homeworks or discussions and just gives you a final letter in the end.  He said something the first day about standing out in class, and part of it is how well you participate to discussion and how thorough your homework answers are, as well as grades on your midterm/final/final paper.\nHe has you hand in your homework for the week on the mondays of the week after, which gives you an extra weekend since all the other classes hand them in on fridays.  For each discussion, he gives you some pre-discussion questions and readings.  Then he questions you on the articles by drawing names randomly.  He's a little bit quiet and awkward and he makes you go up to the front of the class sometimes when answering questions.  There's some group activities involved too.\nIn the end, Frontiers of Science is just a pretty easy course.  Sure, you could probably find a more engaging teacher, but the readings and the homework are the same for everyone.  When people say they didn't like FoS, it's more about the way the course is set up, rather than how their discussion professor was.  As an upperclassman told me once,  \"It tries to be everything, but ends up being nothing.\" Still, you do learn a bit and the readings can be interesting sometimes.\nWorkload:\n1-2 readings every week. One HW assignment every week. Maybe taking 3-ish hours total? Depends how thorough you want to be. Some of the homework questions are really vague and confusingly phrased... I feel like I ended up googling to find some of the answers. A lot of \"back of the envelope\" calculations.  Midterm and final are easy. Final paper is on a topic of your choice, and he was vague about that too -- he never specified a page number and just said \"enough to get across what you need to say.\"\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "September 10, 2009",
            "review_content": "\nProfessor Menke is very knowledgeable about what he teaches, and when stumped by a question will look up a topic between classes.  He schedules ample time for pre-exam review, and is always happy to answer questions outside of class.  However, he's not a very engaging teacher.  In fact, he's rather boring.  To be fair, it's not all his fault--Frontiers is a difficult class to teach--but if you want a fulfilling Frontiers experience, you're probably better off in another section.  If you don't, stick with Bill; he only assigns every other problem set.\nWorkload:\nLight.  One Frontiers-standard problem set every two weeks (alternates with a reading every two weeks, instead of another problem set)\n"
        },
        {
            "course_name": "Environmental Hazards and Disasters",
            "review_date": "December 05, 2005",
            "review_content": "\nThis class was horrible! Prof. Menke and Klaus ruined such interesting subject matter..... their lectures (ppt. presentations) were dull, and put you to sleep right away. I would not recommend taking this class. \n\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 10, 2005",
            "review_content": "\nClass is more work than expected, expect the same from climate and life.  Labs havent been edited in about 10 years or so...so mistakes and unclarity still exist.  Bill Menke has a weird system of grading based on a list of requirements he deems fit.  But, he doesn't tell you what he wants.  Doesn't really answer questions directly, would stray from lectures at times...very strange man.  Nicknamed \"Wild Bill\".  \nWorkload:\nWeekly labs and hw assignments.  One midterm, one final.\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 06, 2005",
            "review_content": "\nIt's pretty hard to sum up Bill Menke in a short review.  The man obviously knows his stuff, but his lack of organization would never let that on.  His lectures are so full of information (and lots of it completely extraneous) that I found the online lecture notes to be better than the notes I took during his lectures.  What's good is that he does know basically everything about most of the topics that he teaches (first half of the Solid Earth course), but often he's not receptive to questions and just wants to keep on doing his own thing all the time.\nIt's very hard to talk to Menke outside of class - he doesn't have office hours, won't respond to email, and has the greatest ability to suddenly disappear mid-way through class or before a lab, never to return.  If you do get to corner him, however, he is only moderately helpful.  We're left to do the problem sets and labs on our own, which sometimes is OK but other times is ridiculously hard.  Menke's labs are the worst thing I've ever had to do in my entire scholastic career, especially because he's never there to help us out.\nI've found that I've learned a whole lot in Solid Earth, but that I retained Bill Ryan's lectures easier than I did Menke's lectures.  Menke isn't a bad prof by any stretch of the imagination (I just think he's spent way too much time looking at rocks), but you do have to work insanely hard to do well in his class.\nWorkload:\nWeekly problem sets (relatively easy), weekly labs (killer), 1 midterm, 1 final\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 02, 2005",
            "review_content": "\nIf you are reading this and have any power over the earth and environmental science department (perhaps you're even professor Menke!) please god change this course.  Its horrible.  In no way does the work done correspond to the amount a student might learn.  In no way is the amount of time required worth the payoff.  That's a shame, because its a fascinating subject and the professors and TA's are competent and intelligent, but the course obviously hasn't been improved for decades (the syllabus my semester was never even in sync with the actual dates we had class.)  If you're a student, complain until they change things!  If you're \"them\", put the student body out of its misery and fix this course.\nWorkload:\nWorst class of all time.  Horrible.  Absolute hell.\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "January 01, 2005",
            "review_content": "\nOkay, he's a weirdo.  But he's not THAT bad, you guys.  Solid Earth was more complex than Climate, in my opinion, but only partially because of the profs.  In fact, I started out as someone who frankly HATES geology and everything having to do with it... but by the end, I found myself rather awed by the age and complexity of stuff that just looks like rock to me.\nNow, the inescapably awful part of the class is the labs, which I suppose I can blame on the professors but because Menke was never there, I feel like I can't even pass the blame off on him.  The TAs were only rarely helpful and often biting in their responses, as if every question you asked was on that should automatically become clear to you.  In addition, before the final, I'd received back only FOUR of the labs I'd done the whole semester... so, talk about unable to figure out what my grade might be.\nMenke's a sweet guy, at heart, and his coprof, Bill Ryan, is the geologically brilliant grandfather I never had.\nWorkload:\nThe labs. just. suck.  The rest of it, even the midterm and final, weren't crisis-inducing, if you'd gone to class and done at least some studying.\n"
        },
        {
            "course_name": "Solid Earth System (V2200)",
            "review_date": "December 21, 2004",
            "review_content": "\nIf you are looking for a FUN and EASY class then STAY THE HELL AWAY FROM THIS ONE!!!!  The only reason that anyone should be taking this class is because it is required.  This is probably the worst class I have ever taken at Columbia.  Even if you love earth science (and somehow decided not to major in it) you will hate it by the end.  It's 4.5 credits of torture.  Normal lectures and a 3 hr lab every week.  The labs suck and usually result in you banging your head against the wall/table due to the sheer monotony and confusion (one lab required you to draw 20  seismic profiles to detail... totally unnecessary).  The TA's were pretty cool (although I still havent gotten back labs from October) and do stay around for the labs.\nNow on to Menke.  Part of the problem with the class.  I find it interesting that such a space cadet could know so much about our planet.  Ask him a question and watch him stare into space for 5 minutes before giving you an answer.  His lectures were basically an outline on the course website with links to other pages and images... Switching between pages gets really frustrating and annoying after a while.  He also never stays for the labs and is out of class quicker than the students.  The midterm was just as weird as he was.  Awful.\nThe one saving grace was Professor Ryan, who teaches the second half of the semester.  The complete opposite of Menke.  He's very interested in everything the student has to say. His lectures are all powerpoint and are coherent and organized.  He is very open to questions/comments and is always willing to help.  The labs still sucked, but unlike Menke, he sticks around.  During the first lab he was around, he said before it \"this is a hard lab. But don't worry, if you need help call me.  We'll get through it\".  He was an overall really nice guy and wanted us to understand the material and succeed more than anything. It's a shame that he has to teach the class with Menke. It could be so much better if it was only him.  For our semester he gave us an essay final.  Not bad at all-straight forward that made you consider the environmental impact and implications of our actions.\nWorkload:\nPURE EVIL.  Weekly labs with lab reports that usually say 1-2 pages but require more, 7 homeworks over the semester, midterm and final.  4.5 points doesn't do it justice.  Like one review said: makes you want to jump off prominent geomorphological features to your doom.\n"
        },
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "October 26, 2004",
            "review_content": "\nThis class must be designed to make students want to jump off of prominent geomorphological features to their doom.\nWorkload:\nA lot of climbing followed by a lot of falling, concluding with absolute doom.\n"
        },
        {
            "course_name": "V2200 Solid Earth System",
            "review_date": "October 26, 2004",
            "review_content": "\nThis class must be designed to make students want to jump off of prominent geomorphological features to their doom.\nWorkload:\nA lot of climbing followed by a lot of falling, concluding with absolute doom.\n"
        },
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 07, 2004",
            "review_content": "\nThe frontiers of science class still has many bugs to be worked out. The friday lectures were fascinating, but the homework was silly. However, Menke cannot be blamed for the class as a whole. He was disarmingly nice at all times and really tried to get our class talking. Often times, he failed spark a good discussion. Though with a class that was randomly chosen and who had very little real interest in the subjects, Menke cannot be completely blamed for the apathy of the class either. He is a wonderful and nice person who I would love go out and have coffee with, but he was unable to make the discussion sections into good discussions- rendering the class into a waste of my time.\nWorkload:\nAnnoying and time consuming problem sets every three weeks that are assigned to everybody and every week a little summary of what you liked/disliked about the lecture that should take no more than five minutes if you went to lecture.\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "December 18, 2003",
            "review_content": "\nMenke does appear spacey at times, but his lectures are cohesive and well-organized. Only take the class if you know that you will like the material, but with that said, the class is interesting and enjoyable. Menke is much less aloof than he appears. He IS interested in your questions and wants to help you understand\nWorkload:\nrequired Homeworks, and frequent lab write-ups.\n"
        },
        {
            "course_name": "v2200",
            "review_date": "January 02, 2003",
            "review_content": "\n(note this course is cotaught with Bill Ryan.)\nThere is no way to explain Bill Menke other to say than he tries to teach this class at an undergraduate level.  He is a brilliant man but he tries to dumb down the class to a level we all understand.  That means taking 30 minutes to state a basic concept, and let the rest of the class tell stories relating to this concept.  I just want to shake Menke and tell him two things: talk faster (it takes forever for an average sentence to come out of his mouth), and yes, I get the basic concepts, let's get into something more interesting.  He seems to be a nice guy but is very spacey.   He really cares that we understand the material and like geology, but that means he talks about superficial concepts.  Would I take another class with Menke?  Only if it were taught at a graduate level (I have heard he is excellent at grad courses).\nAlso, Bill doesn't always stick around for the labs.  That's really unhelpful because you will need either the TAs or Bill to walk you through the lab -- the instructions are so vague.  \nWorkload:\nMenke's section was covered in an easy essay midterm.  Ryan's section was covered in a killer multiple choice final.  Menke took care of all of the homeworks, supposedly one every week, but between a lazy class and a lazy Menke, we did 5 homeworks.  And the labs - well, at least they are easier to write up than climate labs, but they can take 4-9 hours tow write up.\n"
        },
        {
            "course_name": "Solid earth",
            "review_date": "June 25, 2002",
            "review_content": "\nThis is by far the worst class for the major. While it is easier than Climate, the profs suck, the labs seriously suck, and the material is completely unorganized and boring (though some may find erosion rates of million year old rocks fascinating, I think most would agree IT SUCKS.)The policy stuff at the end is more interesting than the rest, but Ryan is pretty annoying and mellowdramatic. Don't expect the profs to give a shit or explain anything well. Worst Part: A horrible all day field trip (leaves 7 am sunday) to look at rocks covered in poison ivy on the side of a highway in Rockland County. \nWorkload:\nridiculously complicated weekly problem sets, weekly lab reports, fair midterm, and killer final--overall, this class will take up A LOT of time\n"
        }
    ]
}