{
    "prof_info": [
        {
            "prof_name": "Zhirong Wang",
            "prof_id": 850,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "CHNS W4003-W4004 Advanced Chinese N",
            "review_date": "January 20, 2017",
            "review_content": "\nWang Laoshi is an amazing, dedicated professor. I took her for Third Year Chinese for Non-Heritage Speakers and my reading, writing, speaking and vocab skills improved dramatically. She is super sweet and practical and does demand a lot from her students, but if you do the work and have enthusiasm about coming to class every morning, it will pay off :) \nWorkload:\nDictation quizzes every other day or so (or every day)\nReading\n3-4 essays a semester\n"
        },
        {
            "course_name": "Chinese language",
            "review_date": "December 12, 2016",
            "review_content": "\nI took Wang Laoshi for Third Year Chinese N and it was the worst decision of my life. She spends the whole time talking about the dialogue and stories in the textbook that she wrote, and then does not teach any of the grammar that constitutes a huge portion of the test. She assigns homework on grammar that she'll go over the next day after everyone says they are confused. Oh, and just FYI the Third Year Chinese N course that she teaches is not the same as any of the others but is \"Chinese for Humanities,\" which entails reading experts from classic Chinese stories and learning words like \"claw\" and \"concubine.\" \nShe's cold to students who ask questions, and is very impatient when people ask for clarification. She consistently will shame students who are struggling with the material in front of the class and will point out which students are doing better. She's very obvious about her preference for which students and will make reference to those students' lives (particularly if you studied with her in Columbia in Beijing). All in all, she does not care about her students, is impatient and puts students down for basic questions with the response \"you should already know that, why are you asking.\"\nWorkload:\nMuch more work that Chinese I or II. She will randomly assign extra work aside from the work on the syllabus, and will not explain the grammar required for the homework before she assigns it. DO NOT RECOMMEND. \n"
        },
        {
            "course_name": "History of the Chinese Language",
            "review_date": "May 20, 2014",
            "review_content": "\nDefinitely take this course if you are interested in Chinese and linguistics. As stated below, the ratio of what you put in and what you learn is incredibly favorable (i.e. little effort for pretty large amount of stuff you learn). I took this class to take a break from Chinese classes, which are super time consuming, while still being able to learn Chinese.\nAlso, I agree with the review below and really just want to fill in the gaps a bit more.\nThis class is basically split into two halves. The first half is essentially a crash course on linguistics with Chinese as a case study. Topics in the first half are more linguistic focused: phonology, morphology, script, etc. I found this incredibly helpful and interesting, especially since I'm interested in linguistics but did not have the opportunity to take the introductory class. If you have taken the intro, then the first few weeks might be slow. A typical class will consist of Professor Wang lecturing intermixed with class discussion, which she really enjoys having. Some days discussion was really good while other days it was just okay. Usually, this will depend on your classmates and how knowledgeable/enthusiastic they are about the day's topic. Our class was primarily composed of Chinese grad students, linguistics majors/concentrators, and Chinese engineering undergrads. \nThe second half of the course could be called \"Special Topics Regarding Chinese Language\". Basically, the class is turned over to the students, who present and lead discussion on a certain topic each day. Unfortunately, most of us are not nearly well enough versed in the subject to do it justice, so I ended up learning much less in the second half of the course. Most of the stuff I learned and retained came from my own textbook reading here. Note: the textbook, though fairly outdated, is very well written.\nThe homework is easy. Maybe 1 hour per week for reading and the questions you need to answer. The midterm is also easy, but just requires you to have your notes very well organized. There is a term paper in place of a final, and you can write about any subject as long as it has some type of linguistic connection to Chinese. It's 8-10 pages and it's a paper written in English for a Chinese class/professor, so the difficulty really depends on how much you want to put into it. Choose something you are interested in and enjoy the research as much as possible!\nWorkload:\nAttendance and Participation, 20%\nHomework, 30%\nMidterm, 25%\nFinal, 25%\n"
        },
        {
            "course_name": "History of the Chinese Language",
            "review_date": "May 17, 2011",
            "review_content": "\nThis is a great class.  Professor Wang is incredibly knowledgable about the specifics of Chinese linguistics, and she gives clear, focused \"lectures,\" although with about 10 people in the class, feel free to jump in and ask questions.  She's very open to participation, and her expectations are very reasonable.  If you're at all interested in the Chinese language, take this class.  I'm just learning Chinese, I'm by no means fluent, but it was fascinating to learn how the language and the writing evolved (and I think it helps reinforce what I'm learning in language class, too).  The ratio of what I learned to the toil I put in was very high - in other words - great class for not much headache!\nWorkload:\nWeekly homework assignments, which can be completed easily if you've been to class - and if you haven't, just look in the reading.  (<20 minutes per weekend).  An open-notes midterm (a lot of fun, kind of like a treasure-hunt / puzzle as you apply the methods that have been learned) and a term paper (8-10 pages, topic of your choice).  \n"
        },
        {
            "course_name": "Chinese 3",
            "review_date": "December 21, 2005",
            "review_content": "\nWang laoshi is amazing!  Sweet, funny, intelligent, and flexible when it comes to class conversations.  She wants you to enjoy chinese AND college.  And she most definately cares about you and your well-being.  At the end of the semester she took us all out to faculty house to eat together and talk.\nIn other words, she's the kind of teacher you'd stop by to see on your free time, just because you actually enjoy seeing her!\nFor those of you who \"came up\" learning chinese at columbia, congratulations.  This is what you have been waiting for, the gold ring of chinese teachers: highly educated, highly talented teacher, high expectations of her students, and great rewards for those who strive to meet those expectations.\nIf you're serious about chinese - she'll do EVERYTHING she can to get you where you need to be.  She has \"infinite\" office hours for her students.  And if you run into a work wall or strange disease, she'll be much more understanding than many who come from China's strict schooling environment.\nIf you're not serious...what are you doing there?  The language requirement is over!\nWorkload:\nIt's chinese class.  Of course it's hard.\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 07, 2003",
            "review_content": "\nShe is a gem of a language teacher.  She makes it almost impossible not to understand the concepts, and she brings cultural aspects to the language.  I would definitely recommend her to anyone who wants to take Chinese.\nWorkload:\nAverage for a Chinese class\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "March 12, 2003",
            "review_content": "\nWang Laoshi is great and her class is very organized.  You learn a lot in this class and she does not exaggerate the tones at all.  She is a very fair teacher and very friendly.  I took Chinese with her in the Fall and I'm in her class again this Spring.  I schedule my Spring Schedule just so I could have Wang laoshi.  If you are planning to take Chinese, Wang laoshi is definitely one of the best.  I highly recommend her.\nWorkload:\nStandard workload in a Chinese class.\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "July 26, 2001",
            "review_content": "\nAn extremely fair teacher, Wang Zhirong brings the syllabus to life. She offers much insight into Chinese literature and culture, making the class ten times more interesting than it could be. She speaks rather decent English, so one should not have problems understanding her translations. There is a quiz every day (but this applies to all Chinese W classes), which forces you to keep up with the work (and I have to admit it helps). And yes, she's very nice.\nWorkload:\nQuizzes on vocabulary almost every day, 2 or 3 essays per semester, a test every two to three weeks, occasional homeworks.\n"
        },
        {
            "course_name": "Intermediate Chinese I (N)",
            "review_date": "March 31, 2001",
            "review_content": "\nShe is a fair professor and she does follow the requirements to the T. If you do the work and participate in class you can do very well. She brings in cultural aspects and logically explains the reason for the \"look\" of the characters\nWorkload:\neveryday at least 1 hour and if you fall behind, it snowballs\n"
        },
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "December 31, 1999",
            "review_content": "\nWang is definitely a stickler to the rules. Expect to follow the established syllabus of the Columbia University Chinese department rigorously. The bottom line is if you do your work, you'll learn. And if you work hard at it, you'll get a fair grade. Can't complain too much and can't praise all that much either. She is a cutie though!\n"
        }
    ]
}