{
    "prof_info": [
        {
            "prof_name": "Alice Kessler-Harris",
            "prof_id": 249,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "August 14, 2011",
            "review_content": "\nI think Prof. Kessler-Harris is one the best professors I've ever had. Yes, it's a lot of reading and writing. Get over it. Why would you go to Columbia if you couldn't handle hard work? Honestly, I learned so much!\nAlso, it is clear that she loves the topic. She also know so much about it. She is not just rambing on about a bunch of facts. The title of the course does not come off with that tone most people assume is annoyingly feminist and male-bashing. But it's not like that. It's about giving recognition to women from all sorts of backgrounds (nationality, age, race, etc) by showing they do have a voice. It's amazing to see how much has changed/how little has changed over the years. \nAlso, keep in mind the course is called women and gender, so towards the end of the course you also talk about the difference between sex and gender. One of the things I found most interesting is how our laws are worded to carefully pick and choose who gets which rights... rights that should be human rights. \nEvery class I left, I left in awe as to what I had just heard. If you are ready for a challenging semester, but one that leaves you amazed time after time, definitely take her class. \nOn a final note, for all the guys out there, would you please also get interested in this course? Thanks. \nWorkload:\nLots of readings, short postings are acceptable, 3 short papers, and one final paper. \n"
        },
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "January 12, 2009",
            "review_content": "\nI disagree with the other review of Fall 2008's Intro to Women and Gender Studies. Perhaps because I did agree with many of the topics, I never felt pushed to adhere to a particular opinion. I felt that Professor Tadiar, Professor Kessler-Harris and the many TAs brought very different perspectives to the class. Both of these Professors are incredibly experienced in this field and offer great insight from very different background: Kessler-Harris from the history of the movement, and Tadiar about the more recent, international movement of Feminism. Despite their accomplishments, I found the lecture somewhat boring at times, but it was enhanced when I did the readings on time. My discussion section could be incredibly frustrating at times, but also enlightening because we did have a lot of debate. My TA (Minnie Chiu) was unbelievably available outside of class, and she talked me through my large essays. She also wrote back two pages typed responding to one of my essays. Although we did hop around to various topics, an Intro class on such a broad topic probably necessitates that. This class truly changed the way I see everything, and sparked a deep interest for me in Women's Studies and Feminism. \nWorkload:\nHeavy: 80-120 pages a week of reading, three 5-7 page essays and a take home final. \n"
        },
        {
            "course_name": "American Social Policy from the Progressive Era",
            "review_date": "January 03, 2009",
            "review_content": "\nOverall, the material is interesting. Each week, you discuss a different type of social policy, and the subjects are really topical (they include things like healthcare, workers' rights, public housing, and defining \"family\"). Kessler-Harris tries to use the readings to ground the discussion in real history, but discussions inevitably digressed into a debate on current events.\nSome things you should know before you take the class:\n1. Kessler-Harris is very liberal. Not just run-of-the-mill-Columbia liberal; more like borderline-socialist liberal. Which tends to attract equally liberal students. I'm pretty liberal myself, but even I got fed up with the strong bias that crept up in a lot of our discussions. If you're right of center, this class is either going to be a wonderful challenge or a major headache.\n2. Kessler-Harris has a strong background in gender studies, which clearly influences the way the class is conducted. I found that particular point of view interesting, but if you hate talking about gender, then you might want to steer clear.\n\nWorkload:\nYou have to hand in a draft of your seminar paper, which she grades. Then everybody in class reads your paper and workshops it before you hand in your final draft.\nYou also have to post on Courseworks every week, which gets a little inane.\n"
        },
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "December 14, 2008",
            "review_content": "\nI entered this class expecting to learn about the feminist movement... typical women's studies stuff.  Instead, we ended up with a jumble of different lessons on really random topics.  I'm not saying that I didn't learn anything useful, I just felt that the class had such potential and that the professors focused on the wrong things instead of teaching the basics.  The reading was HEAVY and, I felt, highly theoretical most of the time, which did more to obscure what we were talking about than to enlighten us, making whatever the topic was much less relateable, as if feminism is something only accessible to the hyper-intellectual.  In addition, I felt that the entire course worked under the assumption that everyone in the room held the same very liberal political beliefs-- there was very little room for dissension in that respect.  For me, this kind of defeated the whole point of being able to openly discuss/debate, etc.  I feel like there was a lot of capitalist bashing, etc, and if we wanted to get good grades on our papers, we had to pretend to adhere to more socialist ideas.  Overall, I left the class feeling more confused and frustrated than I was going in-- they could have done a MUCH better job.  It's a shame.\nAlso, Kessler-Harris was strict about laptop usage (even though we couldnt get wireless in the classroom), so we had to take all notes by hand.\nWorkload:\nThe class met two days a week, with lecture on one day, and discussion on the other.  We had to read 3 to 4 8-30 page articles a week and post a paragraph long question on the reading on a discussion board the night before sections.  There were three writing assignments, and we had to attend a Feminism conference, as well as one additional IRWAG or BCRW sponsored event, on which we had to write a 1-2 page written response.\n"
        },
        {
            "course_name": "Gender and American Citizenship",
            "review_date": "August 20, 2008",
            "review_content": "\nI'd just like to echo what the other reviewers have said. I looked forward to this seminar every week.  Prof. Kessler-Harris did a great job of getting everyone to participate in the class discussion, and she ran the discussions very well.  Almost every class ran a few minutes long just because no one wanted to stop talking.  The readings she selected were fascinating, and unlike most other history courses, her reading assignments were actually reasonable.  This was a great class taught by a great teacher. \nWorkload:\nA term paper with a required first draft; reasonable weekly reading assignments; weekly Courseworks post in response to reading assignments\n"
        },
        {
            "course_name": "Feminist Texts II",
            "review_date": "May 17, 2006",
            "review_content": "\nI found Professor Kessler-Harris' class incredibly interesting and engaging, as she could bring in personal experiences and insights of the earlier feminist movements that can't be found in or relayed from textbooks. Her exceptional command of the material made this one of my favorite courses I've taken so far at Columbia. She is also very approachable outside of class and I enjoyed talking with her in her office hours. I definitely recommend taking a course with her!\nWorkload:\nheavy weekly readings, 2 papers, 1 presentation...all very reasonable\n"
        },
        {
            "course_name": "Topics in Exploration--HIstory of Women and Gender in America",
            "review_date": "December 29, 2003",
            "review_content": "\nKessler-Harris has a mild accent and a very soporific voice, which tended to make me fall asleep, despite the fact that her lectures were fascinating, well-crafted and informative. She provides great arguments on a number of topics, and actually made me interested in labor history against my will. She does tend to focus in on very specific topics, however, and neglects other topics of importance. Still, she's worth taking, especially when she starts talking about her children.\nWorkload:\n2 papers, final, weekly reading response.\n"
        },
        {
            "course_name": "Topics in Exploration--HIstory of Women and Gender in America",
            "review_date": "December 25, 2002",
            "review_content": "\nReasonably interesting lecturer who obviously cares about the material. She gives a new perspective on the study of history.  But often tries too hard to fit everything into her agenda of focusing on women's studies (ie statements like the Spanish-American War was caused by gender anxiety are a bit over the top), making you wonder whether she really knows her history/literature. Also, don't get her on the subject of marxist feminism unless you want a lecture on the overthrow of the capitalist system. \nWorkload:\nresponse paper every week, so you actually need to do the reading, but its not an unreasonable amount. take-home midterm, 10-pg paper, and final. The questions on the first two are ridiculously vague and the paper subject is somewhat tangential to the class.\n"
        },
        {
            "course_name": "Gender and American Citizenship",
            "review_date": "August 06, 2001",
            "review_content": "\nThis seminar explored the many ways that the U.S. government has managed to institute policies (often discriminatory) specifically based on the concept of gender. The course focuses on women, and starts with the colonial era and goes all the way to the present day. We learned about anything and everything, studying Supreme Court decisions which barred women from becoming lawyers to an article on the implications of women wearing make-up as they served the country during World War II. Sounds like a lot, I know, but Professor Kessler-Harris manages to draw parallels which make a lot of sense. There is a needed focus on labor history, an area which Professor Kessler-Harris is an expert in (see her groundbreaking Out to Work). Your ideas of what it means to be a citizen will be turned upside down as you learn how the government has shaped citizenship, often to its advantage and to women's detriment. Professor Kessler-Harris is brilliant, and avoids lecturing (it's a seminar) but she opens each class and intelligently guides the always provocative discussions. She is a wonderful person and is keenly interested in her students, very generous, and she peppers the class with her own experiences, which are often very personal, and extremely relevant. She lent me her only copy of a brief I wanted to use for my research paper, a brief she was using for her own book. I know few professors who would do that. Very interested in her students' development, both as intellectuals and as individuals. I can't praise her enough! And she had us over to her gorgeous apartment at the end of the semester.\nWorkload:\nThis is a seminar, so the reading is pretty heavy: usually at least one book a week, plus a shorter article or two (you need to do it, though some of the labor stuff is a bit dry). There is a brief presentation, but the bulk of the work is the paper (18-20 pages) which she walks you through, requiring a bibliography, first draft and then final draft. Fair and intelligent grader.\n"
        },
        {
            "course_name": "Gender and American Citizenship",
            "review_date": "August 06, 2001",
            "review_content": "\nThis seminar explored the many ways that the U.S. government has managed to institute policies (often discriminatory) specifically based on the concept of gender. The course focuses on women, and starts with the colonial era and goes all the way to the present day. We learned about anything and everything, studying Supreme Court decisions which barred women from becoming lawyers to an article on the implications of women wearing make-up as they served the country during World War II. Sounds like a lot, I know, but Professor Kessler-Harris manages to draw parallels which make a lot of sense. There is a needed focus on labor history, an area which Professor Kessler-Harris is an expert in (see her groundbreaking Out to Work). Your ideas of what it means to be a citizen will be turned upside down as you learn how the government has shaped citizenship, often to its advantage and to women's detriment. Professor Kessler-Harris is brilliant, and avoids lecturing (it's a seminar) but she opens each class and intelligently guides the always provocative discussions. She is a wonderful person and is keenly interested in her students, very generous, and she peppers the class with her own experiences, which are often very personal, and extremely relevant. She lent me her only copy of a brief I wanted to use for my research paper, a brief she was using for her own book. I know few professors who would do that. Very interested in her students' development, both as intellectuals and as individuals. I can't praise her enough! And she had us over to her gorgeous apartment at the end of the semester.\nWorkload:\nThis is a seminar, so the reading is pretty heavy: usually at least one book a week, plus a shorter article or two (you need to do it, though some of the labor stuff is a bit dry). There is a brief presentation, but the bulk of the work is the paper (18-20 pages) which she walks you through, requiring a bibliography, first draft and then final draft. Fair and intelligent grader.\n"
        }
    ]
}