{
    "prof_info": [
        {
            "prof_name": "Jennie Kassanoff",
            "prof_id": 717,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "American Literature",
            "review_date": "December 08, 2016",
            "review_content": "\nJennie Kassanoff's American Literature class is mind blowing. She draw's connections form the texts that wouldn't conventionally be thought of, and she's brilliant at incorporating secondary reading analysis into her lectures. She's highly engaging, funny, and very open at office hours - she helped me restructure my final paper, and was always available. Her class is very well structured, and will please anyone who's looking for an engaging and exciting English class at Barnard. \nWorkload:\nVery manageable. Book a week (no longer than 200 pages) plus a secondary reading, in class midterm, in class late term and final paper. No final exam.\n"
        },
        {
            "course_name": "American Literature 1871-1945",
            "review_date": "January 10, 2009",
            "review_content": "\nThis class was a waste of my time.  Professor Kassanoff, though she may be affable and pleasant, was little more than a source of constant aggravation.  I'm an English major, and I've taken a lot of these classes and had a lot of terrible teachers, but never one that was terrible in quite the way she was.  She combines idiotic assignments with daft analysis, and the end result is that I can honestly say that I learned nothing in this class.  Her assignments were baffling: one paper, combining literary and historical analysis.  This on its own is a normal, conventional project.  Nothing new there.  Except she, for some reason, has taken into her head that because this is an \"American Studies\" class, that she is erecting some blossomy new paradigm with this \"hybrid\" paper.  She conceives that none of us have ever undertaken such a radical assignment, and accordingly, assigns a bewildering series of drafts, annotated bibliographies, prospectuses, drafts of annotated bibliographies and prospectuses, and meetings with Barnard writing fellows.  To a one, these satellite assignments were a waste of time, and contributed not in the slightest to my essay--mostly because half of them were to be handed in before we'd finished the third book.  We didn't know what the other texts held; how did she expect us to know what historical phenomenon we wanted to focus on?  In general, her methods are infantilizing and patronizing--we have done this many times before; we don't need you to hold our hands.  Oh, and lest I forget, her final exam is just unnecessarily cruel--a three-hour long slog through a gauntlet of ID's and essays.  English exams are a preposterous idea anyhow, but this was particularly galling--the woman makes us take an entire semester to write one piddling (10-12 page, which is no room at all) essay, and then expects us to write three more in the space of three hours?  Please.  \nAdditionally, her in-class teaching is nothing to write home about.  Her analysis is simply absurd sometimes--she lays the texts on the rack of theory and tortures confessions out of them, which, like most confessions given under torture, have little to do with reality.  She once described fetal development as the \"wordless condition\" or something, since the fetus needs no language to express its needs; she then said that upon birth, however, what is the baby's first impulse?  To vocalize!  To cry!  Aside from the irrelevance of this perversion of symbolism to Faulkner, this is just physiologically wrong.  It's just a stupid reading.  I invoke the example to describe the usual tone of her analysis: unconstructive, dull,  and unoriginal.  \nWorkload:\nExcessive.  We blew through 450-page texts in two to three classes.  She could have happily excised three or four of them and this would have been a much better class.  The final paper is an idiotic exercise in the pseudo-discipline of American studies, involving a series of pointless drafts and prospectuses and bibliographies, all of which we were compelled to discuss with a Barnard writing fellow.  For all the novelty she tries to insist is in it, the assignment is basically a shorter, less interesting and more simplistic version of the research paper from UW.\n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "April 06, 2007",
            "review_content": "\nI love Professor Kassenoff! She is one of the smartest, wittiest women I've met. Kassenoff is the kind of professor who makes you want to work hard. She's not the warmest person - meeting her in office hours is intimidating yet extremely helpful - but she really knows her stuff. She expects everyone to participate, but if you are a little shy about speaking/reading in class she is understanding and you can participate more on the online forum. Kassenoff has been my favorite professor so far. Take her class!!\nWorkload:\nA lot of reading (a novel a week, apart from Moby Dick, which we spend more time on) but it's doable, 2 papers, final exam. \n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "April 06, 2007",
            "review_content": "\nI love Professor Kassenoff! She is one of the smartest, wittiest women I've met. Kassenoff is the kind of professor who makes you want to work hard. She's not the warmest person - meeting her in office hours is intimidating yet extremely helpful - but she really knows her stuff. She expects everyone to participate, but if you are a little shy about speaking/reading in class she is understanding and you can participate more on the online forum. Kassenoff has been my favorite professor so far. Take her class!!\nWorkload:\nA lot of reading (a novel a week, apart from Moby Dick, which we spend more time on) but it's doable, 2 papers, final exam. \n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "April 13, 2005",
            "review_content": "\nKassanoff is one of those professors for whom a fan club has been formed, making it hard to figure out what kind of professor she actually is until you go to her class.  I was excited for this class because of the culpa reviews and because the reading list is good, but try as might, I still can't jump on the Kassanoff bandwagon.  She's obviously smart, but there is nothing interesting about the lectures.  I could rarely finish the books for class, which wasn't a problem because even though discussion is required for a grade, she'll never single you out thank god.  The only thing worse than sitting through lectures though are the obnoxious comments from the students who actually think they have some idea what Twain was thinking when he wrote Huck Finn.  Okay, maybe it comes down to English majors.  If you're a major, you may like the class.  Everyone else, sit through the first lecture and if you're not inspired, get out.\nWorkload:\na novel a week, discussion is required for a grade so either speak up or post online, one 2-3 page paper, one 5-7 page paper, a take home exam and a final.  a little much, but i guess do-able\n"
        },
        {
            "course_name": "House and Home in American Culture",
            "review_date": "January 07, 2005",
            "review_content": "\nI really enjoyed this class. The lectures were always very interesting and Kassanoff always brought in very insightful points into the readings.  The readings were also very fun to read.  I really didn't mind reading for this class at all. Plus, its very important to read so you can participate in class.  I really liked the format of the course too.  There were 2 short 3-5 page papers (you pick on which book you'll write about on the first week), 1 creative midterm, 1 out of the house 2-3 page paper, plus a final.  Since the papers were sort, it really gave me a chance to improve my writing more closely.  After the first paper, I found out what I need to improve on and what kind of a grader Kassanoff is.  She's a tough grader, but also fair and clear on explaining what she wants from you.  Also, the choice of paper topics is up to you, and the midterm and out of the house paper lets you be very creative.  I liked having so many choices and not having my whole grade focused on only 1 or 2 big papers.  Again, the class was hard but I ended up doing alright (not great, not bad) and I'm a science major and this was my first english course since first year english.  Take this class if you can. It's been my favorite class here. \nWorkload:\nTwo short 3-5 page papers (you pick on which book you'll write about on the first week), 1 creative \"make your own utopia\" midterm (where you can chose to make something and/or write something), 2 out of the house assignments (go to 2 places in the city-one requires a 2-3 page paper), 2 courseworks postings, and a in-class final.  It sounds like alot, but the writings are all short and the midterm and out of the house assignments I found to be actually really fun. \n"
        },
        {
            "course_name": "American Literature 1871-1945",
            "review_date": "January 02, 2005",
            "review_content": "\nWhen I entered this class, I was really excited about the syllabus (Cather, Eliot, Faulkner, Warton) and Prof. Kassanoff is very enthusiastic and engaging.  This is my first Barnard class (as a CC student) so maybe I didn't know what I was getting into but by the end, I was disappointed.  Her interpretations began to seem pretty superficial and entirely TOO GENDERED.  I felt like I was in a \"Gender and American Literature\" class by the end of the semester.  She extracted the idea of women and women's place in society out of every single novel in the class.  Gender was the single issue that we talked about in \"The Waste Land\".    While those interpretations were interesting, I felt like a lot of the most important implications of the text were being neglected and others were being superficially inserted in the their place.   Additionally, the interpretations were often based soley in historical context rather than close reading.  Also, a huge part of your grade is a RESEARCH paper that allows very little textual analysis as your research is strictly primary sources and focusing on historical conditions giving rise to a novel rather than what the novel says.  Also, you have to consult with writing fellows every step of the way which gets daunting and time-consuming and is generally unhelpful. While Professor Kassanoff warns you that she favors historical analysis at the beginning of the class, I didn't expect this to be the SUMMATION of the class.  Other than that, she's a very nice woman and easy to approach out of class.\nWorkload:\nLight but with BIG FINAL.  One 15 page research paper with several writing fellow meetings/ drafts and a huge final.\n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "April 20, 2004",
            "review_content": "\nProfessor Kassanoff is too amazing for words.  Not only is she brilliant, but she is also engaging, funny, and accessible.  I hate missing her lectures (which aren't really lectures since participation is so important to her) and her analyses of the texts are beyond brilliant.  She loves to talk after class and it never seems like there is enough time because there is just too much to say.  I couldn't reccomend any prof. more!\nWorkload:\n2 papers, one short (2-3 pages) and one longer (5-7) and a final, pretty heavy reading but you will want to do it.  She is a hard grader though\n"
        },
        {
            "course_name": "American Literature 1871-1945",
            "review_date": "March 31, 2004",
            "review_content": "\nJennie is the best english teacher i have ever had- she not only thoroughly examines each text, but also draws in other issues like the history and politics of the time.  She encourages participation but doesn't force it, and if you're shy like me you can just post on courseworks and still get a good grade in participation.  My class consisted of ten or so books + a course packet, which seems like a lot but she manages to give each text enough time.\nWorkload:\n3 pg prospectus+ annotated bibliography, 12-14 pg. paper based on one of the books and final\n"
        },
        {
            "course_name": "American Literature 1871-1945",
            "review_date": "January 11, 2004",
            "review_content": "\nThe first day of class I was blown away, totally impressed by Kassanoff's brilliant lecture and seriously excited about the class. As time went by though, my attention waned and not because of the quality of the novels on the syllabus.  The novels themselves are amazing and, to be fair, Kassanoff sometime had some truly interesting ideas (although some were difficult to swallow).  My main problem with this course was the lack of focus on the novel. In fact, some days were spent only discussing the historical articles in the coursepack, which I found to be ridiculous (and I am one of those people who actually likes examining the historical context during which the novel was written, but what went on in this course was just too much for me).  Moreover, the strange thing about this course is that it is both a literature course and the intro to American studies course at Barnard.  If you want a literature course, take something else.  If you want to sit around every day listening to historical theories with a minimal focus on the primary text, by all means sign up for this course. And for those of you who like prompt grading, don't expect it from Kassanoff.  It took her three weeks to turn in our final grades. \nWorkload:\nOccasionally difficult to keep up with the reading, especially because of some of the coursepack articles, but overall reasonable.  Class participation (either in class or through postings on Courseworks) is a must. A prospectus and annotated bibliography which lead up to the main assignment of the course, which is a 12-15 page research paper.  This assignment sounds reasonable, but  actually turns into a nightmare since all of your sources have to have been published either 15 years before or after the publication date of the book you're writing about. One mandatory meeting with Kassanoff, two mandatory meetings with writing fellows, and an extremely long final exam with ids from the coursepack and novels and two essays (one a comparison and the other a general essay using three texts).\n"
        },
        {
            "course_name": "American Lit",
            "review_date": "November 16, 2003",
            "review_content": "\nWhile I think it's irrefutable that Kassanoff is both intelligent and at times highly entertaining, I have to admit that I was less than satisfied with the direction of this class.  Close historical analysis of a text is all well and good, but beware of the overly analytical tactics of Kassanoff as well as the thirty five English majors falling all over themselves to impress her in class.  \nWorkload:\nA fair-sized amount of reading for each class (but not entirely unmanageable), one 12-15 page paper, and a final\n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "October 24, 2003",
            "review_content": "\nTime for the dissenting opinion.  I was really excited to take Kassonoff's class because everyone just raves about her, but I was seriously disappointed.  All of the kids that were serious about English and knew their theory found her pedagogical.  My other English prof from a different class may have a little boring at times, but at least she had intellectual self-respect.  Kassanoff is for people who want the prof to give them a definitive interpretation of a text and also for all of you who are too reliant on feminist theory because you feel that we are at Barnard and that is what  we do right?  Every text was first analyzed under a feminist lens, which was horrible because many texts didn't lend themselves to it so well...her interpretations could get ridiculous.  Beware of the students who constantly raise their hands only to say something completely meaningless...Kassanoff encourages their pseudo-intellectual comments.\nWorkload:\nMidterm, final, two papers \n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "July 04, 2003",
            "review_content": "\nKassanoff is a goddess. She is one of the most brilliant people I have ever met, and her literary analyses should be published. She is a gem in the English department crown. She does a thorough, in-depth analyses of well-chosen texts. She's an amazing lecturer, and is very witty. She manages to connect each book to several others, and shows how several themes pervade American literature. Only two complaints. One, she very obviously sidesteps any possible queer interpretation of literature, which leaves out a lot of good material for discussion. Also, for the exams she just wants you to tell her what she told you in lectures, with no room for individual creative development--but then, her analyses are better then anything you or I could come up with anyways, so that's OK.\nWorkload:\n2 papers, midterm, final. Lots'n'lots of reading.\n"
        },
        {
            "course_name": "House and Home in American Culture",
            "review_date": "December 05, 2002",
            "review_content": "\nDespite the fluffy name of the course, it is a critical anaysis of the role of home and family in American culture from colonial homes to suburbia. The syllabus includes Beecher, Bellamy, Gilman and Friedan. The readings are extremely interesting (this is the first class I have EVER done all the readings for, I am not a geek), you even get to watch American Beauty and the Matrix. You also get to take some cool field trips. Kassanoff is an amazing professor who keeps class fun but still makes you think. You will think faster and harder than you ever have in her class. The class is discussion based which is better than the other lit professor's who stand for an hour and lecture. She is the smartest women I have ever met. Everyone told me that she is extremely tough but fair. If you do a half ass job on an essay she will give you a half ass grade. If you work hard and provide a solid argument you will get a good grade. She is also available to meet after class. So far, the best class I have taken at Barnard. HIGHLY RECOMMENDED\nWorkload:\n2 3-5 page papers, you decide which books you want to write about and the due dates are based on when the readings are due. For example, you can hand in the first two papers and be done. Midterm is easy- you can devise your own utopia in any medium (you can even make a LEGO creation)a final and a 2-3 page paper on a trip you took. \n"
        },
        {
            "course_name": "Survey of American Lit.",
            "review_date": "October 06, 2002",
            "review_content": "\nOne of the worst classes i've ever taken. If you're a Columbia student my one piece of advice is to leave as soon as possible....She tries to make her class into a small classroom environment by taking attendance every day, forcing students to read aloud, making you bring a name tag to class, etc., but the end result is that you just feel like you're in bad high school class. But those aren't the only sophmoric things about this class. Her reading of the books was largely superficial; we spent more time trying to place the books in their hisorical setting than enjoying them as texts. I could have learned more reading the Cliff Notes. If you like english for english's sake, do not take this class. One last word of advice, she's fairly feminist which took me off gaurd. Be aware of this if you still choose to take the class.\n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "August 25, 2002",
            "review_content": "\nKassanoff is incredibly interesting and her classes are well-organized. She's not easy, but fair and always available to help outside of class. This is a great class for anyone looking for an overall taste of American Fiction.\nWorkload:\n1midterm, final, 2-3 papers\n"
        },
        {
            "course_name": "American Fiction",
            "review_date": "May 08, 2002",
            "review_content": "\nThis woman is sharp as a tack and she'll cut you if you don't read. Probably one of the two smartest women i've ever met, Professor Kassanoff assaults the books with intense and thorough discussion. Occasonally she digs too deep for a feminist perspective, but it's barnard so what do you expect? On the plus side, the class was 45 girls and 5 boys so i wasn't complaining. The book selections are good and her honest interest in class comments is refreshing. A professor that should not be missed by anyone who likes english.\nWorkload:\nTwo or three papers a semester, reading is a must if you want to survive passage ID's on the exams. Class attendence is a must, but the books are interesting and she is always availible for feedback. \n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "December 08, 2001",
            "review_content": "\nI could just slap the girls in my class who didn't spend more time on their course evaluations. Prof. Kassanoff is a fantastic, enthusiastic teacher who thrives on class discussion and makes every book seem exciting, whether beforehand or in retrospect. Her comments on papers are thorough and helpful, making rewrites both a learning and enjoyable experience.\nWorkload:\n2 papers (2-3 pages) with rewrites, final paper, group presentation, class participation\n"
        },
        {
            "course_name": "House & Home in American Culture",
            "review_date": "October 17, 2001",
            "review_content": "\nAlthough this course sounds like it should be a Home Ec class, it's actually a survey of the cultural implications of various American living spaces of the past and present. The course focuses not on the house itself, but how the home space acts within the context of the reading. Jennie is smart as a whip, and you'll find yourself articulating your thoughts intellectually in the discussions that account for most of the time spent in the classroom.\nWorkload:\nExtensive reading; three reaction papers on the texts of your choice; midterm project allows room for freedom of expression and creativity; final is author-quote-context matchup and short essay form.\n"
        }
    ]
}