{
    "prof_info": [
        {
            "prof_name": "Lucie Vagnerova",
            "prof_id": 11802,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 15, 2017",
            "review_content": "\nInauthentic.\nWorkload:\nStandard \"hum\" workload - quizzes and short research projects. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 11, 2013",
            "review_content": "\nLucy is phenomenal. End of story. That being said, you have to be willing to engage with her personal interpretation of music history from both a women's and/or subaltern perspective in order to actually get something out of the class. She's very willing to tie contemporary music and debates on power/class/society/race/politics into the construction of musical narratives and definitions of  \"high\" vs. \"low\" culture and \"virtuosic\" vs. \"non-virtuosic\" music. All in all, one couldn't ask for a more attentive and thought-provoking musichum instructor. \nAlso, Lucy is very hip. Seriously, sometimes she's too hip to handle. (but don't be intimidated)\nWorkload:\nVery reasonable. Then again, this is coming from someone with a strong humanities and social science background who was very interested in the questions posed in class. To a certain extent, she grades to your ability but do not be mistaken, Lucy definitely has high academic standards and will very quickly see through bullshit and hastily written papers. \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "July 30, 2012",
            "review_content": "\nIt's difficult to write a balanced review for this class, because most of the time I either really liked/disliked it depending on the topic or assignment. So here goes: \nLucie's class is not strictly organized or \"conventional\"; she does not define concepts and build on them in an orderly fashion. Rather, she jumps right into a topic and will go back and define concepts as students ask/she sees fit. For some minor things, this was not a problem. But a lot of concepts that related to musical theory itself were left undefined and a lot of students were confused. Likewise, there is no \"takeaway\" from any given topic... the class centers on the student's attitudes about the material, and I think Lucie wanted us each to develop our own attitude towards music, which was difficult to do if we didn't even know the basics. \nThat said, Lucie is understanding and a lenient grader. She has no problem spending time going over things the students don't understand very well, and she makes it clear that she will not test us on the technical aspects of music, so we shouldn't worry about them too much. She also uploads a list of important concepts for us to know, although she doesn't define them so you really need to pay attention in class.\nAll in all, I had a good experience but I would have liked the class to be more structured. I felt like I didn't come away with as much information about music as I did about feminist/racial reactions to certain types of music. \nWorkload:\nVery light. And as long as you are able to talk about the environment/social effects of the music, you'll do fine.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 02, 2012",
            "review_content": "\nProfessor Vagnerova is unapologetically fashionable. Far from being the only reason, but it kept my attention.\nMy Hum class was very international and the Prof. seized on this opportunity and let everybody participate and share their very different experiences of the world and music. The course was richer for it in the end. I will actually miss our weekly discussions.\nSome of the discussions did get a little messy but if I learned one thing in this class, it is the way music is connected to other parts of humanity, it doesn't just stand apart in the \"art\" sphere. That's why discussions could go off-topic sometimes. \nI recommend this class to everybody willing to question the ways they have been listening for years. \nWorkload:\nYou should show up to every class: she is generous with office hours but won't meet with you if you missed class without an excuse.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 30, 2012",
            "review_content": "\nI am sure most students in Lucie's class would really disagree with the above reviewer. Some students simply want to memorize a list of definitions, pass an exam, and get credit. Also, unlike said reviewer, I think Music Hum SHOULD be a conversation rather than a lecture. As Lucie said in the first class, her questions don't have right/wrong answers but are supposed to encourage discussion. I was actually glad to have a teacher who passionately shared her opinion and debated students like equals instead of acting like she is 'above it' and 'superior' like many professors at CU. Sometimes Lucie allowed the discussion to go off-topic as long as it's productive. Other times, she will shut down off-topic comments but I never felt like she held a grudge. As for students misbehaving, loudness, and some students' constant lateness, I believe that's their fault and not so much the instructor's. The teacher is the teacher, not the police.\nLucie's class taught me to think about music not just as an abstract source of pleasure, but as a place of national, class, ethnic, and gender contestation. I would say I enjoy my favorite music much more as a result. Also, I started listening to more types of music such as Jazz and the french composer Debussy. One of the most interesting returning discussions in Music Hum was about the concert experience -- how strange and ritualistic it is to dress up, sit in the dark without making a sound and clap at the end. In fact, students are expected to attend two concerts on their own (a classical music concert and a 20th century \"avant garde\" concert) and the class as a whole went to hear 20th century American music at Carnegie Hall. As a result of these assignments, I heard music and went to venues that I would never normally encounter: I am glad I got to do this before leaving New York. Some of the music was difficult to listen to at first but subsequent discussion in class helped a lot. I enjoyed the challenge though maybe some students did not.\n\nWorkload:\nwhat the above reviewer said...plus...Courseworks is a great resource: Lucie uploads not only readings and music but also a list of concepts students should be comfortable with after every session. She also holds out-of-class review sessions before exams, which prove very helpful. \n\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 28, 2012",
            "review_content": "\nProfessor's lectures are not very clear. I often cannot tell what the main point of the lecture is and what we are supposed to get out of it. Then, several lectures later when we are told we talked about this or that in class and that's when I find out what was important in the previous lecture. We seem to be expected to remember everything that was said in class. There is not an organized introduction of course materials. Instead, it's more of a conversation lecture with key words thrown in. I didn't feel like I learned much and classes are a blur of comments from a few of the students in class. It would help if aspects of the course like history, music history, changes in music, etc. were connected better instead of each lecture appearing to stand on its own.\nIt might be better if, after a discussion, the professor summarized what she wanted us to get out of the listening or that time period. Every once in a while, it felt like if I didn't go check on Courseworks what subject we were discussing that day, I would not have any idea what genre we were talking about and when and where it took place.\n\nOnly certain people talked in class. Partially, that was because only certain people are outspoken naturally, but some people who might have wanted to talk probably gave up after a few classes because of the professor's response. There are times when the professor seemed to shoot down what someone said. She played favoritism a lot. When some people said something, it was always accepted with little enthusiasm, while others' comments were treated like they were very intelligent and relevant. If someone talked too much, she would start ignoring them. \nIn general, I did not find this class interesting and I learned very little.\n\nWorkload:\n2 4-page concert reports\n2 3-4 page writing assignments based on a reading and a class discussion\nMidterm, Final\nThough assignments were relatively simple and thought provoking, the grading was basically the same for everything. In fact, I got the exact same grade on every paper. I would prefer going back and actually talking about the assignments a little more. Instead, it feels like the assignments only relate to a few classes and that's it.\n"
        }
    ]
}