{
    "prof_info": [
        {
            "prof_name": "John Szwed",
            "prof_id": 5671,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "The New Thing-Jazz 1955-1990",
            "review_date": "June 09, 2009",
            "review_content": "\nHaving never written a CULPA review prior to this one, I nevertheless feel obligated to say something about this class, which was undoubtedly the worst that I ever took during my undergraduate years.  This class was supposed to be a seminar focusing on \"the new thing,\" (alternately known as \"free jazz\" or \"free music\").  However, it soon became apparent that John Szwed was interested neither in conveying any meaningful information on this highly significant artistic movement, nor in provoking any sort of substantive discussion.  Instead, he used the class as a vehicle for his own narcissistic, incoherent, and irrelevant ramblings.\nBut I'd like to point out that Szwed is not like other blowhard professors who use academic jargon to obfuscate relatively straightforward material.  NOT AT ALL! Szwed is truly in a class of his own.  In my four undergraduate years at Columbia, I have never encountered a professor who was so groundlessly self-important and cared so little for teaching his subject.  \nConsidering my strong feelings on the subject of this class, you may be wondering why I stayed for the entire semester.  This is an excellent question, and I've been wondering about this myself.  I came into the class with quite a bit of prior exposure to the music, and I was really looking forward to increasing my knowledge on a subject that I was passionate about.  On the first day of class, Szwed presented us with a great syllabus, and even though the first few classes were not informative, I figured that he would eventually end up covering at least some of the topics he had initially outlined.\nBut Szwed didn't cover ANY of the topics on the syllabus!  Moreover, he didn't even go over a single reading that he assigned during the class, so none of the students (myself included after a short while) did any of them.  Even though the syllabus had a number of interested readings, it was impossible to motivate myself to do any of them when I knew Szwed would spend the whole class talking about Brazilian pop music, Aristotle, utopias in literature, Georges Perec, and Szwed's favorite topic of all--HIMSELF!\nFor those students who are interested in free jazz and are enticed by subject of this seminar, stay away from this class if Szwed is teaching it!  Despite having written the liner notes for Albert Ayler's \"New Grass,\" as well as the best Sun Ra biography, and a biography of Miles Davis, Szwed's knowledge of the music is incredibly limited.  (For example, he thought Ornette Coleman's classic composition \"Lonely Woman\" was \"Ramblin'\" and he referred to the seminal European group \"Globe Unity\" as \"World Unity.\")  This is not a matter of a professor having a few gaps in his knowledge.  Instead Szwed is woefully ignorant of his subject and tries to conceal his shortcomings by talking incessantly about completely unrelated topics.  Moreover, what limited knowledge he does possess, he is incapable of conveying in any sort of coherent way.  Not only does he not finish half of his sentences, he also couldn't say anything significant about his own specialty: Sun Ra.  Instead of telling us what was unique about Sun Ra's music, Szwed told us that he represented \"a utopian tradition dating back to Aristotle\" and then preceded to show video footage of George Clinton getting into a spaceship during a concerts.\nColumbia's Jazz courses frequently have the fatal flaw of not focusing on the music; instead of making students listen to important recordings, Jazz studies professors often have their students use Jazz studies as a lens through which to view societal phenomena.  As such, the music is reduced to being merely a vehicle for hermeneutics rather than something worth studying on its own.  While Szwed follows this pedagogic paradigm, he does more than not fill his students in on historical info.-- he does not even go into the kind of analytical questions that most Columbia Jazz studies professors overemphasize.  At no point in the class did Szwed raise the question of what \"the new thing\" was, and, consequently, some students who had no background of the music were completely lost.  This confusion was evident from the student presentations that were on unrelated topics.  Since Szwed never bothered to talk about his subject, by the end of the class some students thought that free jazz referred to any jazz made post-1955.  After all, that's the subtitle of the class.\nAs a concluding thought, I'd like to say that I sincerely hope that another professor, such as George Lewis, decides to teach this class.  Luckily, I already had exposure to free jazz, so I recognize the importance of this artistic movement.  As for the more more inexperienced students, I'm sure they now think this music is a joke, since that's the way Szwed treated it.  The only positive thing I can say about the man is that he fortunately had the honesty to admit on the last day of class that he had been a complete failure as a teacher throughout the semester.  Having conceded this, he basically told the class that everyone would get an \"A\" or \"A-.\"\nWorkload:\nnone\n"
        }
    ]
}