{
    "prof_info": [
        {
            "prof_name": "Ali Sadighian",
            "prof_id": 10313,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Industrial Economics",
            "review_date": "December 20, 2012",
            "review_content": "\nHe and the course deserve more praise than given below. Now the course is soley taught by Ali. \nIt starts with a review of accounting and various transformations. \nThe second part is more about finance and deterministic models.\nOverall, I think the course didn't cover as much material as I imagined and ended with a haste. However, Ali made this a very enjoyable experience reviewing what we learned in accounting and finance and mathematical programming.\nThe course is competitive, but he grades very generously. It is important not to make mistakes in the exams.\nWorkload:\n4 homeworks\n1 midterm\n1 non-cumulative final\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 09, 2011",
            "review_content": "\nThis course was co-taught by professors Kachani and Sadighian. Kachani was fast-paced and more interesting to listen to. Sadighian was much more textbook, much slower paced, and always (annoyingly) waited to hear a verbal \"yes\" from the students before moving on. The lecture slides were online, but incomplete; you have to go to class to fill in the gaps.\nThe course itself starts as a review of Accounting and Finance, and then moves into a broad array of other topics, like cash flow, beta valuation, and project valuation. The course as a whole didn't really have a coherent feel to it at all; the topics felt sort of medley. Some topics were heavily tested, otherwise were taught and never seen again, neither on homework nor on exams.\nBetween two professors teaching two sections (undergraduate and graduate), there were 13 TAs. There's a near constant office hour Monday through Thursday, which is pretty helpful. Also, TAs are required to respond to e-mails quickly.\nThe problem sets were mostly based on the material in the books, so having the books were most helpful in completing the problem sets. Students were allowed formula sheets during exams, which was a godsend. It's basically impossible to finish the exam in time, but they're designed such that the average is incredibly low (and weighted to an A-).\n10% of the exams are based on current events, so chances are you'll come out of this class with a heavily discounted subscription to the Wall Street Journal.\nWorkload:\n4 problem sets, given at least two weeks in advance\n1 3-hour midterm\n1 non-cumulative final\nParticipation points\n"
        },
        {
            "course_name": "Industrial Economics",
            "review_date": "January 08, 2011",
            "review_content": "\nThis is more a review of Industrial Economics more so than a review of Kachani. As many students know, this class was co-taught by Kachani and Sadighian, which was definitely for the worse. I can agree that Kachani comes off as arrogant and while he is successful in business, there are smarter, more capable, and humbler members of the IEOR faculty. However, Kachani has historically cared about the class, what students learn, how the TA's grade, and whether people cheat. (Whether he cared in 2010 is debatable given he barely taught)\nThe material in the class is mostly unnecessary. It's a review of Accounting and Finance for the first quarter, then cash flow analysis (to the point of being too quantitative to be useful), then project balances, and mathematical programming for budget allocation. Sadighian taught most of this material and is not a capable teacher. He butchered all the material he taught, which meant that most of the class had no idea what to do unless they struggled through the homework. The exams were long and difficult but with the curve were fairly easy. \nOverall, this class was a waste of time and I learned very little coming out. Kachani was definitely an entertaining lecturer who taught the material better so I hope that Sadighian either improves his teaching or steps aside. Regardless, it's a requirement in the IEOR department so this serves as a warning for non-IEOR students. This class was a waste of credits and time. It was a grade booster at the end of the day so I can't complain, but I wonder many times why I pay for this crap education.\nWorkload:\n1) 4-5 Problem Sets which take 6-12 hours. It teaches the material well but borders on impossible given the level of teaching.\n2) 1 three hour midterm. Curved well but difficult and long\n3) Final. Easier and much more straightforward than the midterm. This was due to the fact that Kachani realized no student understood the material.\n\n"
        }
    ]
}