{
    "prof_info": [
        {
            "prof_name": "Stephane Charitos",
            "prof_id": 4993,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 17, 2015",
            "review_content": "\nStephane is awesome. \nHe really encourages every student to throw in his/her opinion, no matter how contradictory/unconventional. Therefore, he pushes the discussion deeper because it is more lively, more controversial, more honest. Even though he does spend some time lecturing (which is good, because it gives you a basis for the reflection), he also emphasizes discussions, from which he almost disappears (until it is time to be put back on track).\nWhat is great about Stephane is that he is 100% honest: he'll tell you when he forgets his notes (which practically never happens), and he'll tell you when he doesn't like a book in particular. He understands that we are human and is therefore super chill about the reading (if you don't read a book in time, you're just hurting yourself by not being able to participate in class, but he won't make a fuss at all). \nThis honesty can be a little harsh in his grading: his comments are not tender (quite sassy actually), but his intentions are solely good. He really does want the students to progress and he does so by pointing out their flaws. He genuinely reads the students' papers and gives personal advice to each and every one of them. He's also really great about office hours and is overall a super approachable person. He is the kind of professor who will take time to talk to you , to joke around and to get some news even when the course is over. As a whole,the class was delightful: I felt like our opinions were valued, therefore the class was a breeze. Also, Stephane made an effort to relate every work to common concepts and phenomena. I think he did a great job in giving details for each book, even though Lithum is really a fast survey course. \nWorkload:\n- 1 midterm (same format as the final) and 1 final (for our final, he gave us extra IDs to pick from). \n- Before each class, he posted 3 prompts on Courseworks' Discussion Board: 3 students had to write a 500-word response and all the other students had to comment with 250 words. Even though it is  great way of engaging with other students and making sure that the readings are done in time, it became kind of sloppy towards the end of the semester, when people were posting responses after midnight, the day of class..\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 02, 2013",
            "review_content": "\nIf you have him, consider yourself lucky. He's super chill but at the same time really pushes you to produce your best work. During class he would spend a good amount of time lecturing so that you'd be able to take down some detailed notes but he also made time for students to participate. He's one of those professors that will go around class and have each person say something about certain questions (these things are often super simple questions so don't freak out). But I find this helpful because it gets your feet wet in terms of speaking in class which was really great for the quiet, shy students. We had to do weekly courseworks posts on a question that he'd ask about the reading. I found this helpful because it helped you prepare for something that you might want to discuss with the class. \nHis essay topics were great and he allowed us to come talk to him about our topics/ get critiques if we bring him drafts. We went really in depth with some books(like Pride and Prejudice) and others (like Faust) we kind of just went over the necessary points. Whereas most professors add books to the syllabus, Stephane actually added a movie trilogy (Three Colors Trilogy) which I thought was amazing. And he found a way to tie this movie back into things we've read this semester to gain even more insight into the texts. I can honestly say I enjoyed his section and again, if you have him you will really enjoy your Lit Hum experience!\nWorkload:\nTypical lit hum workload. Weekly courseworks post (approx. 250 words), 2 papers (the first one was about 3-4, second one 5-7; but he was very lenient with the page count), a midterm that he makes, and the standard lit hum final that everyone takes. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2011",
            "review_content": "\nIt is a goddamn travesty that Stephane Charitos won't be teaching LitHum next semester. On the off chance that he comes back to teach it next year and you have the opportunity to be in his section, TAKE IT. Based on what I've heard from other students talking about their professors, Chariots seems to be one of the few profs teaching LitHum who has a genuine interest in teaching the class as it's meant to be taught: as a collaborative exploration of the Western canon, not a content-based literature class that teaches towards a final.\nHe likes to hear student participation, but he also has a wealth of knowledge to impart. At the beginning of the semester, he would usually divide the class pretty evenly into an hour of lecture and an hour of discussion; as the semester went on, however, things tended more towards lecture. His lectures are great, though he's not a great lecturer; I don't remember him ever using an outline to lecture. Instead, he usually just jumps from topic to topic. That means that if you're taking notes, you need to pay close attention to keep up with what's going on. He shares tons of useful and interesting background information and context and I highly recommend that you pay close attention to what he says. It will probably never show up on a test, but it's good information to have.\nCharitos is clearly more interested in student learning and engagement than he is with assessment. He doesn't care about grades and will frequently rag on LitHum pedagogy that tends towards rigid expectations for mastery of content. He doesn't expect that everyone has read every word of all of the texts, but he expects that everyone will know enough about them and have read enough of them to grasp the main ideas of each. Class discussion usually focuses on distilling the main themes of a text rather than harping on about minutiae. Charitos would rather see that we have the skills to analyze a text rather than knowledge of the content without depth of understanding.\nHe is a very, very generous grader, especially if you follow his instructions exactly. He is also very open to having students drop in at office hours to talk about the course (or anything, really - as he says, it gets very lonely in the International Affairs Building). Future first-years, if you're preregistered for Chariots' LitHum section, thank your lucky stars.\nWorkload:\nLots of reading (obviously), but he doesn't check for content, just understanding of themes. It's okay to skim a few texts if you need to and revisit them before the final.\nTwo essays. Both of these had EXTREMELY broad topics and he is VERY flexible to suggestions for alternate paper topics. Don't hesitate to propose an alternate topic if you want to. \nHis midterm, which is modeled after the final (passage IDs and short essay).\nStandardized final, though he did give us a supplement with extra passages for IDs (so we could do 10 out of 19 instead of 10 out of 11) and an extra passage for the analysis if we didn't want to use the two on the standardized final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 23, 2011",
            "review_content": "\nGood teacher but...\nMy complaints:\n1) He would ramble. Once he got on a point, he'd go on and on about the same thing over and over again. Granted, you then knew what he wanted in papers and on tests, but it was pretty boring at times. It was hard to engage the class when he was just spouting out what sounded like a 20 page thesis to us.\n2) He didn't take grades seriously. Granted, a lot of people liked this. During the final he left the room and basically allowed us to figure out the quote IDs as a group. He grades the papers fairly, though, and treats his midterm with respect. When he's looking for a specific answer and you don't give it to him in the essays on the midterm, your grade is docked, which I found annoying.\n3) He is callous about working. He repeatedly admits that he doesn't actually expect us to read the amount that the Core has assigned. Hence leaving the room for the final. He doesn't really expect much from us, so it's hard to be motivated to actually read everything. Yes, it's cool that his expectations are low, but that doesn't mean that you're not going to be held accountable for your reading.\nThat said...\nIf you read everything and actively engage with the text, you can get a LOT out of his lectures. Sure, sometimes he pulls some background information that you know nothing about, but that enriches the text without making you read more. He constantly refers to the \"original language\" when he's analyzes, tweaking our translations, which can be both annoying and cool. He's a really nice guy, too. Super sweet, super intelligent. Seems a bit phased with the whole bureaucracy at Columbia, but he's a nice guy.\nWould I take this class again? Yes - but that's because I read everything and engaged with the text in a way that earned me a good grade. \nP.S. Although he seems like he wouldn't, he takes Virginia Woolfe seriously, so read it!\nWorkload:\nWiki posts every week\nTwo papers\nHis Midterm\nFinal\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 13, 2010",
            "review_content": "\nStephane is the homie.  \nPossessing an intimate knowledge of the books of Lit Hum, he leads the class ably in far-reaching discussions of theme and meaning.  He seems to have lived in nearly every place known to man, and his experience with other cultures and locations is a huge asset in our discourse.  Additionally, his extensive knowledge of film contributes to a continual exploration of narrative devices and structure.  One comes away from the class with a keen sense for the evolution of literature and storytelling, understanding well the way in which Virgil's work progressed into Woolfe's.  It is obvious that he wants students to leave his class having learned something both useful and meaningful.  \nEven beyond his role in leading the class through the western canon, he is the coolest guy.  His travels supply him with endless stories of adventure in far-off places, and his role as head of the Language Resource Center give him a unique perspective on language and learning.   He is exceptionally willing to meet outside of class, whether to discuss the material, give advice, or just hang out.  It is almost guaranteed that you will leave his office having learned something entirely unexpected.  His taste in music is on point, as well.\nWorkload:\nShort weekly postings, 2 six page papers, his own midterm, and the Lit Hum final.  Obviously one should also read the books, as they happen to be quite enjoyable.  Overall a crackin' class, very manageable, and he is always willing to help if you put in the work.  \n\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 03, 2010",
            "review_content": "\nThe first thing I should say about stephane is he is a great professor. He knows the course material well and is good at leading discussions. While he was only here for the 2nd semester he was a really funny teacher who realized the bullshit that the core wants lithum to be and basically teaches what he wants. That being said he was always well prepared for lectures and is very knowledgeable. He also is very nice about office hours and is willing to meet with anyone at any time. He is a fair grader and I think the main thing he wants to see is that you care about the class enough to attempt the reading. If you get him you're lucky and if you need to switch, switch into his section, seriously.\nWorkload:\n2 six page papers. 1 midterm he makes up and a final. Other than that postings every week on the book that is being read. Overall super chill.\n"
        }
    ]
}