{
    "prof_info": [
        {
            "prof_name": "Francesco De Angelis",
            "prof_id": 2923,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "June 02, 2014",
            "review_content": "\nProf. De Angelis is a knowledgeable and articulate lecturer.  He really tries to engage the students during each class, even though it only ends up being a few of the same people talking during class.  The class will be more meaningful if you come in with solid knowledge of the Roman history, which unfortunately I did not.  The class was typical of art history, so it wasn't particularly challenging to wrap your head around, but it was a lot of memorization for exams.\nAs a CS student, I have a feeling this class was a lot more valuable to Classics or Art History majors than it was to me.  I feel like I learned something, though maybe not as much as the professor would have hoped.  I would recommend Prof. De Angelis, but only take this particular class if you know you are interested in the topic.\nCLASS:\nThe course covers a lot of material, and much of the material in the lectures does not end up on the exams because there is just too much.  The lectures overall are not in chronological order; instead they are grouped by topic.  This was kind of confusing to me, but it was an organized and logical presentation of the behemoth that is Roman art/architecture.  All the powerpoints are uploaded to courseworks, but they're only images so it's not that helpful.  There were three consecutive lectures on imperial portraiture, which were rather dry, because you spend the entire class staring at marble busts of emperors and trying to differentiate between their hairstyles and beards.\nEXAMS:\nFor the exams, you are only required to know a selection of images, which he emails out the week before the exam.  He doesn't send this list out very far ahead of time because he doesn't want students to only focus on memorizing those pieces.  From this list, there still ends up being about 80-90 pieces that need to be shoved into your brain, and there are only 5 identifications on the exams.  Sometimes you'll go back to your notes and find that you only have half a sentence on several of these pieces, so find a friend in class and combine your notes.  The TAs held two review sessions before each exam.  I gave up on memorizing dates for the IDs, but hey, do what you need to do.\nREADINGS:\nThere are several different levels of reading requirements. (1) Textbooks: three books to read by the end of the semester, (2) Additional Readings: book chapters that go along with each lecture, choose 10 out of the 24 posted online (3) Special Reading: one book out of ten options which you write your midterm essay.  I did the special reading for the midterm, and I went through some of the \"additional readings\" for the final if I felt my notes were lacking.  Sorry to my textbooks, which never saw the light of day.\nATTENDANCE:\nAttendance is supposedly required, but he doesn't check every day.  There were only four lectures where he took attendance, and he announced that he would be doing so in the previous classes.\nWorkload:\nMidterm: 5 commented slide IDs and 1 essay on the \"special reading\nPaper: 8-10 double-spaced pages on a topic of your choice, due toward end of the semester\nFinal: 5 commented slide IDs and 1 essay on one of five topics given ahead of time, not cumulative\nOne class visit to the Met\n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "July 07, 2011",
            "review_content": "\nFantastic class, fantastic professor.  It's easy to get lost in the subject matter, however, as so much of it is myth, speculation, and so many different threads of Roman life over a very long period of time, tightly woven together at once and seeming to not even be of the same cloth at other times.  It was a great pleasure to be studying with one of the rock stars of the the field, and my only regret was not being able to study with him more.  The readings he chose for his class were incredible, of the highest in academic writing from some of the foremost authorities in the discipline, fascinating and illuminating.  I hope that I get to take another class with him again!\nWorkload:\nNot too much, but the midterm and finals are demanding.\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "December 31, 2010",
            "review_content": "\nWonderful class. I am a first year engineering student who was absolutely terrified of joining this class. Interested in the material, but worried about the difficulty of the class based on previous reviewers. But grading was extremely lenient, and I got an A. That is not to say, however, that the class was a breeze. We covered a large amount of literature over the semester, all of which had to be known for the exams. \nThe way that the class worked was that every lecture was split in half, covering a certain mythological character. For the first half, Professor Steiner would talk about the literary portrayals of the character/family, then Professor De Angelis would take over and speak about visual sources. Both professors were always well-prepared and gave very fascinating and accessible interpretations of the myths. For someone like me, with no previous knowledge of classical mythology, I was still able to grasp the lectures without a problem. \nI came out of the class feeling like I've learned so much about mythology, and still feeling like there is so much to be explored that I want to learn about classical mythology. I mean, what more is a class supposed to do?\nWorkload:\nMidterm (visual IDs, text IDs, analysis of a long passage with choice of one out of two), Paper (8-10 pages, I wrote it in one night and got an A/A-), Final (visual IDs, text IDs, essay that was prepared beforehand). for the final, we only had to study a selection of 75 visual works for the visual IDs out of 200 covered the entire semester. \n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "April 29, 2010",
            "review_content": "\nProfessor de Angelis is a kind and knowledgeable man but, ultimately, this class is not worth taking unless you absolutely have. He spends a lot of time discussing minute details that don't appear on the exams. The exams, by the way, are a lot of work for very little reward. We were given over 100 slides to memorize for the midterm and just 10 were used. I ended up just going through the list and throwing out about half because they were too muddled or intricate to possibly appear. In the end, I was right and the 10 slides that showed up were in the half that I chose.\nAgain, if you're not an Ancient Studies or Art History major, I would not recommend this class. de Angelis is helpful and encouraging but the lectures are boring, a bit disjointed, and repetitive with the readings. I imagine that he's a better professor with a smaller class where he's not just talking for an hour and twenty minutes straight.\nWorkload:\nMidterm, final, 8-10 pg paper, trip to the Met. Weekly readings and lectures that are not necessary.. pick one or the other.\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "May 22, 2008",
            "review_content": "\nProf. de Angelis is great. I wasn't super excited to take an ancient art class, because I didn't like studying antique art in high school. However, de Angelis made the subject material really interesting. I really enjoyed the course, and even liked writing my  term paper for it. \nWorkload:\nmidterm and final with lots of slides to memorize, 8-12 page paper\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "December 29, 2007",
            "review_content": "\nI love de Angelis.  He is unbelievably knowledgeable and funny as well.  There is not much work required of you, so you can really focus on learning things in the lectures rather than trying to get a good grade.  While there are regular readings for the lectures, they are mainly unnecessary, and just repetitive, so really you just need to study for the midterm and final, and put some effort in to the term paper.  The exams are not too difficult and as long as you pick a specific essay topic, he is a pretty generous grader.  Take this class if you are at all interested in the subject, or just like to learn about ancient greece, because sociological aspects are included with the study of the art.\nWorkload:\n8-10 page term paper due the last day of class, midterm, final\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "January 04, 2007",
            "review_content": "\nI thoroughly enjoyed this class and Professor De Angelis' instruction.  Yes, he does have an accent, but this in no way impaired my understanding of his lecture or the material; instead, it made me enjoy the lectures more.  He is obviously incredibly intelligent, and very knowledgable about the subject, which isn't even his specialty (Roman art is).  In addition, I was very impressed by his level of involvement with the students.  Although he had two TAs, he graded all of the midterm exam essays himself, and graded the term papers singlehandedly.  When I went to discuss my work on the midterm with him, he was familiar with my IDs and essay without me even showing him my exam to remind him.  Professor de Angelis is not a super easy grader, but is not too hard either.  I would say this is a good thing, as he will let you know what was good and what needs work.  I would not hesitate to recommend Professor de Angelis to anyone interested in this subject.\nWorkload:\nnightly readings (not totally necessary), midterm exam, 8-10 page paper, final exam.\n"
        },
        {
            "course_name": "Greek Art and Architecture",
            "review_date": "December 31, 2006",
            "review_content": "\nI was a little apprehensive going into this class based on other reviews of Professor de Angelis.  I had the impression that he was hard to understand, unorganized, and not helpful outside of class.  All of those assumptions were completely WRONG.  I might be slightly biased because I'm an Art History major, but this was certainly the most organized art history class I've taken.  Each lecture was illustrated with a power point with clearly labeled slides which was posted to courseworks immediately after the lecture.  A couple times I couldn't open the courseworks powerpoints for some reason and Professor de Angelis was very very very helpful  and even spent time splitting them into multiple files so that he could email them to me.  He was very friendly outside class time and always said hello when I saw him around campus. His accent might be difficult to understand for 5 minutes of the first class, but otherwise it's really not an issue.  If you cant understand a word, ask him and he is happy to annunciate.  He obviously really cares about teaching and is extremely knowledgeable about Greek art.  I highly recommend this class or any of his others.\nWorkload:\nLight-medium reading for each lecture.  A couple lectures had repeat readings, so if you did them the first time you were off the hook.  One visit to the Met (mandatory), one 10-page (not including images) reseach paper with 9 sources due on the last day of class, and a mid term and final with 10 slide ID's, 2 comparisons, and an essay.  About 90 slides to memorize for the midterm and 140 for the final.\n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "May 28, 2006",
            "review_content": "\nWhile de Angelis seemed to know his stuff and was visibly enthusiastic about the subject, his presentation of major Roman monuments was somewhat disorganized: what I mean by this is that he will show students very obscure pieces of art, and then not explain the historical significance of that slide. He has a bit of trouble with the language (which is understandable) but it gets annoying sometimes when he trails off in the middle of a sentence and ends it with a mumble (and this would happen many times each class.) He also stutters (which is again understandable) and it gets some time to get used to his delivery, but once you get past that language barrier you can tell that he really knows his stuff. Class can get boring sometimes because he will often ramble on about certain monuments for up to forty minutes without any direction, and often repeating the points that he had made previously.\nOther than that, Prof. de Angelis is a very approachable man, and he is willing to spend some time during office hours clarifying things that you did not understand in class.\nWorkload:\nMidterm, Final, and Paper.\nThe exams were a little bit ridiculous because he gave us 130 monuments for the midterm, and about 190 for the final. On top of that he expected us to memorize really particular details like who commissioned it (eg. Marcus Vergilius Eurysaces and similar three-part names) and exactly where it was found (eg. not just Rome, but near Rome, in the House of Livia)\nAnd then multiply that by 190.\nThe essay was not bad. Just work closely with him during office hours and you will do fine.\n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "May 12, 2006",
            "review_content": "\nThe class was interesting, the readings too but the professor made it not worth taking. His control of the English language makes the lectures painful and pointless to attend. He didn't give a list of the monuments and material that would be covered on the midterm which resulted in widespread confusion and bad grades. I guess the biggest problem with him is that he seems reasonable and lenient, he claims that the essays on the exams as well as the paper are up to the student to decide in which direction he/she want to take them but then it turns out that he had strict guidelines that he just forgot to share with the class. \nOverall the class was a disappointment. The grade does not reflect the amount of work you put into the class. If you really want to take the class do, otherwise I would suggest you wait until someone else teaches it. \nWorkload:\nThe readings are reasonable but the required factual memorization is beyond intense. \n"
        }
    ]
}