{
    "prof_info": [
        {
            "prof_name": "Mirela Ciperiani",
            "prof_id": 2780,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Linear Algebra",
            "review_date": "December 16, 2008",
            "review_content": "\nWorse teacher in the Math Department by far.\nI am a math major and I've seen a bunch of professors in the Math Department. This lady is the worse by far. Use itunes U; look up the MIT lectures if you really want to learn the material (at least that's what my friends and I did) since her lectures are a waste of time. There were 42 kids in the class. Less than 10 showed up to the lectures. \nMirela will waste all of class on a single proof that she will not even finish. She does not draw any maps of subspaces nor any proper graphs in 3-D space of the vectors she discusses. \nIt is crucial to have an answer manual to the textbook. This will teach you how to do the homework problems. There was never an occasion when she did any problems remotely similar to the homework in class. \nWorkload:\n2 Midterms and a Final. Lengthy busy-work problem sets due every Friday. These are nothing like what is taught in class so be ready to do a lot of work on your own. \nAverage on the final. 56.8 / 110\nJury still out on what the curve will be. \n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 09, 2008",
            "review_content": "\nMirela is neither a good teacher nor a particularly nice teacher. She refuses to move a midterm if you have a family emergency-- instead, she is \"willing\" to shift your grade to another midterm. That doesnt reall help. Teaches too long on the easy stuff and is forced to go really fast through all the easy things, often not teaching the stuff in class that is on the homework. The book is absolutely terrible so good luck learning anything from that either. While the first midterm may be easy, dont be fooled. The class gets hard and she just gets worse and worse. She is very hard grader and refuses to curve until the end of the class. I would suggest finding a different professor if you can.\nWorkload:\nWeekly problem sets, some really easy and some really long and difficult, 2 midterms (one easy, one hard) and a final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "December 09, 2008",
            "review_content": "\nMirela is neither a good teacher nor a particularly nice teacher. She refuses to move a midterm if you have a family emergency-- instead, she is \"willing\" to shift your grade to another midterm. That doesnt reall help. Teaches too long on the easy stuff and is forced to go really fast through all the easy things, often not teaching the stuff in class that is on the homework. The book is absolutely terrible so good luck learning anything from that either. While the first midterm may be easy, dont be fooled. The class gets hard and she just gets worse and worse. She is very hard grader and refuses to curve until the end of the class. I would suggest finding a different professor if you can.\nWorkload:\nWeekly problem sets, some really easy and some really long and difficult, 2 midterms (one easy, one hard) and a final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 11, 2007",
            "review_content": "\nMirela is a very nice lady. Sometimes this is hard to tell by just attending her class, which is why I would suggest going to her office hours. She tries really hard to explain things to you in person. Unfortunately, however, the same does not apply to her lectures. She teaches straight from the book, and doesn't explain what she teaches very well. I took calc in high school, and found her way of explaining things very confusing, especially to someone who has never taken calc before. As for her exams, they are not too difficult. Much easier than the HW. Yet, the grading of the exams is harsh. \nEven if you get the correct answer but forget to show one step, she'll take off 3 out of 4 points.  Good Luck! \nWorkload:\n2 midterms, 1 final, weekly homework due every friday afternoon, very long hw about 30+ problems usually\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "June 17, 2007",
            "review_content": "\nProf. Ciperiani doesn't know how to teach. People won't show up to class just because it's so useless. If you spend 3 hours a week studying on your own and teaching yourself, it would be better than attending a class that would put you to sleep.\nThe tests are easy. Just do the Homework problems and you will be fine.\nAs for the problem sets, take them serious and attend the TA sessions, you won't be able to do well otherwise.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 24, 2007",
            "review_content": "\nMirela is obsessed with cheating.  She thought people were stealing homeworks from her box, so she made them due a day earlier.  People got points taken off their homeworks for plagiarizing.  She made up two different versions of the tests and handed a different one to every other person.  And she even warned people during the final that she saw someone looking at another person's paper.\n  The class itself was good at the beginning and bad by the end.  I never really got a good complete picture of what we were trying to do.  I still don't understand what an orthogonal projection is and what inner products have to do with linear algebra.  And I went to class and did well in the course.\nNote: this course becomes proof based after the first midterm.  Between one third and a half of the second midterm and final consisted of proofs.  So if you don't know how to write a proof, you are screwed.  But you won't know it until it's too late to drop the class.     \nWorkload:\nWeekly homework sets which get significantly progressively harder after the first midterm.  Good luck.  Two midterms and a final with the first midterm being much easier than the other two.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "May 15, 2007",
            "review_content": "\n Honestly, if you spend the time in class to study on your own, you will be better off. You could do very well in this class since the midterms are easy and straight forward. The material is interesting. But I bet that you would NEVER use your class notes, so just study on your own and you'll be more than fine! \nWorkload:\nWeekly problem sets that might sometimes make you cry! 2 Easy midterms, and a final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 16, 2007",
            "review_content": "\nMirela Ciperiani is not a good professor.  She is generally a nice woman, except when you dare to breathe too loudly in her class (in which case you will get an evil glare and/or be asked  if you have a question).\nHer biggest downside is that she focuses on easy topics for far too long and is then forced to breeze through the tougher/more useful topics.  For example, she spent an entire class on matrix addition and simple multiplication...\nOn the other hand, her tests are very, very easy.  In fact, they are so easy that she has to curve the class down.  BEWARE, Ciperiani considers a straight (no curve) 90-95 an A-.\nWorkload:\nNot bad at all.  The end of the class got a little rough, when she had to cover two chapters in two weeks and we had three problem sets due in that two week period.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "January 08, 2007",
            "review_content": "\nShe is unbelievably nice and sweet. She is also the easiest teacher in the math department. I suck at math, but got an A+ in her class. Barely any work, and her tests come straight out of the homework/book. You will not only learn Linear Algebra in her class, but will have an easy and very unstressful time.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "November 11, 2006",
            "review_content": "\nMirela is great- I recommended her to all my friends.  If you are interested in higher mathematics or challenging yourself, this may not be the class for you, but if you want to do well congratulations because you just hit the jackpot!  Her accent is cute, she does not move too fast, and she genuinely wants to help.  Her tests are straitforward ( a little underchallenging actually) and she assigns a normal load of homework. This class will not stress you out and will not take an obscene amount of time.  All in all a pleasant experience.\nWorkload:\nHW every week- fair, more than you have to know for the tests.  2 midterms, 1 final.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "March 16, 2006",
            "review_content": "\nDr. Ciperiani is a lovely woman. Truly a lovely woman. Above all, you have the sense that she very much wants you to do well and to succeed in her course. She wants you to understand the material. She sticks to the book. I think this is nice. None of her lectures are covered as material on the exam. Pay very close attention to what it is that she says will be on the exam. Because when she says this is what will be on the exam, that is exactly it and only it that will be on the exam. The final was fiendishly difficult, unfortunately, but she rewarded us all with a very generous curve.\nI think it's important to go to the help-room. A lot of times, you have intricate questions about the material and this is the best way to have them thoroughly answered.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 17, 2006",
            "review_content": "\nProf. Ciperiani seems like a nice woman, but this doesn't mean she's a great teacher. She teaches almost exclusively from the textbook and doesn't go into any more detail than the textbook which makes completely understanding the topics difficult sometimes. The homeworks can get lengthy and the TA graded very harshly. She's a little difficult to understand in the beginning, but that's not a problem after the first week. I was semi-familiar with calculus before I took this class, but I doubt I could have made it through the class with no prior knowledge of calculus. \nWorkload:\n2 midterms, 1 final, weekly homework assignments (each problem is worth 5 points)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 16, 2006",
            "review_content": "\nThis class was very easy. She is not a very good teacher; however, she moves very slowly. If you have any experience with calculus, this is a good choice. Her homeworks are not so long but they are sometimes hard and the TAs grade harshly but I had a horrible homework grade and did well on the tests and got an A-. She doesn't make you do the webworks assignments. The tests are very easy. Much easier than the homeworks. On the final, she did not place anything harder than integrals. (just solving them - no volumes of shapes, etc.) As compared to other Calc I classes, there are fewer topics. She took the final straight from the midterms and the last couple homeworks. If you are not good at math or haven't taken any calculus before, she might not be good for you, as she is not very good at explaining things.\nWorkload:\nWeekly homeworkShe stopped assigning webworks after the first couple weeks.2 midterms and a final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 09, 2006",
            "review_content": "\nI am sure Prof. Ciperiani is nice, but her motto seems to be \"If you don't understand this , I cannot help you.\"  She teaches straight from the text book, so if you get the text book, there's no need to attend every lecture and if you don't understand the book you can go and hope that one of the examples will make things clearer, though that doesn't always happen.  She likes to have massive amounts of homework due the same days as midterms. I would   recommend her for people who have maybe a little background in Calc (even though it's calculus I) or for people who catch on quickly or else you may fall a bit  behind. Even so, there was a pretty nice curve at the end, which was a bit unexpected.\nWorkload:\n2 midterms, 1 Cumulative final  with mostly questions from the homework and previous midterms, but that doesn't mean it's easy. We had weekly webwork which stopped being mandatory after about 6 weeks and weekly homework due each Monday.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 05, 2006",
            "review_content": "\nCiperiani is not a good teacher.\nShe is absolutely incomprehensible. She assigns homework that is far more difficult than the problems she covers in class. She expects her students to inherently know concepts.  The workload is rather obscene.\nShe doesn't teach. In order to do well on the homework, visit the math help centers frequently.\n"
        }
    ]
}