{
    "prof_info": [
        {
            "prof_name": "Andre Burgstaller",
            "prof_id": 1124,
            "total_reviews": 29
        }
    ],
    "reviews": [
        {
            "course_name": "FYS: Economic Life and Human Character",
            "review_date": "December 08, 2016",
            "review_content": "\nAndre Burgstaller has said SO MANY inappropriate, unprofessional, ignorant, and bigoted things over the course of this semester (in FYS Economic Life and Human Character). He has recommended that a student see a therapist, lectured the class on (antiquated, incorrect, and hurtful) \"homosexual identities,\" and made inappropriate comments and assumptions about students' cultural, racial, and familial backgrounds. He spends an insane amount of class time lecturing about things that are often tangentially related to the content, so we rarely got through the content, including when students were presenting. There is an insane amount of reading that is often dense, but few essays with literally NO prompt - just \"write something related!\" He is a Marxist and brings back almost every single topic to Marxism and workers rights somehow, regardless of what the people in the class are centering as what they're interested in or see as important. I continually felt challenged in this class - but ideologically, not academically. He said so many things and argued so many points that conflicted with my worldview, and often responded to my disagreement in a way that felt minimizing and as though he was not listening or understanding what I said. But this class was incredibly amusing. We were never bored.\nWorkload:\ntons of reading (didn't do most of it), presentations on the reading to explain it to the class (a few times per student), two 2-3 page essays, one 6-8 page final essay, weekly journal of reflections on class discussion, \n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "October 12, 2016",
            "review_content": "\nThis is a joke of a class. Volunteer on the first day to write the lecture summary for that class, send it to the TA (who seems to really resent that he got stuck as a TA for this professor) and never return to class other than tests and to drop off homework.\nAll of his lectures are recorded, not that it matters because of his wild ramblings and nonsensical explanations for things, not to mention his immensely uncomfortable borderline, if not outright, racist comments at minority students.\nThe textbook has everything you need and is solid, but not great. The material is at least interesting if you are into international macroeconomics. (The material is largely focused on the interaction between exchange rates, interest rates and domestic output)\nVery low effort class for a relatively easy grade, especially for a Columbia Fin-E student who struggles to find some easy filler credits within the major.\nWorkload:\n\"Problem Sets\" that are just questions from the end of the textbook chapters\nMidterm and Final of which he posts old ones and solutions. They are arbitrary and annoying, but not hard.\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "August 20, 2016",
            "review_content": "\nIf reading/writing is your forte but mathematics is not, this is the Economics elective for you: it's arguably the most math-light course I've ever taken en route to my Econ major. There were a couple very simple formulas covered in class, but none of them were actually required knowledge for any assignments; they were simply used to illustrate concepts.\nThis course was honestly more akin to a literature course than an Economics course, focusing on critical analysis of foundational economic texts (Wealth of Nations, Das Kapital, etc). If you've read those texts in another literature or philosophy class before--like Contemporary Civilization, for those Columbia College students like myself--this course will seem mostly like a repetition.\nProf. Burgstaller is exceedingly friendly and accommodating; recordings of each lecture along with his personal lecture summaries and even pictures of the blackboard are posted on courseworks for every single lecture, so if you miss a day (or two, or nearly all of them), you can still follow along with the class on your own time. He can occasionally ramble or veer off into unrelated (if humorous) tangents, but in general his lectures are informative and insightful if you keep up.\nOverall, if you generally get good grades in your writing/literature courses, this course will likely feel very easy, and you can secure a good grade with minimal challenge. All three major assignments (90% of the course) are writing-based, with the remaining 10% based on \"participation,\" a category loose enough that you can stay pretty much silent, or even skip your presentation, and still get an A- in the course with high enough grades on your other assignments.\ntl;dr Are you a good reader/writer? Do you regularly get good grades on essays? This course is a cakewalk. Are you more into formulas and computation? You'll find practically none of it here.\nWorkload:\n- 1 midterm essay, 1 final essay (30% each)\n- final exam, which was all essay questions (30%)\n- participation, including a short, low-key in-class presentation (10%)\n"
        },
        {
            "course_name": "Historical Foundations of Modern Economics",
            "review_date": "May 23, 2016",
            "review_content": "\nAlright, so you basically don’t have to do anything the entire semester, until the last week. Then all you have to do is write a final paper (10-20 pages) that’s worth 100% of your grade. If you go to all the recitations and either give a short recitation presentation or write a short review paper, then the final paper is worth 70% of the grade. If you go to some recitations and your presentation/review paper is mediocre, the final paper is worth 85%.\nI figured that the final paper is pretty much going to decide your grade, so I didn’t go to class or recitation, and then wrote the paper during the last week. I spent a good amount of time on it (I mean, it’s the only assignment you have to do) and did well on it. The end. I don’t know if Professor Burgstaller is an easy or hard grader, but you can’t complain about the workload.\nFor those of you who do care about the material, Professor Burgstaller is a nice guy who sends lecture summaries and blackboard pictures every week. From the time I was in class, he was a little dry but very knowledgable. The class material is definitely interesting and a nice change of pace from the typical economics electives, but I was a second semester senior and didn’t really care about learning the material.\nWorkload:\nSee above\n"
        },
        {
            "course_name": "The Theoretical Foundations of Political Economics",
            "review_date": "April 28, 2016",
            "review_content": "\nI'm writing this review even though I have a presentation and phone calls to make because Andre is actually a genius. In summary, he loves theory and then using equations to get more precise. He's passionate about what he teaches and honestly I wish i paid more attention in each lecture. His knowledge spans across all disciplines. \nIf you take his seminar, the lectures are really interesting and engaging. He cares more about the idea behind your argument -- which is fundamental to academia. He will challenge your idea in the nicest way possible. He also very nice and very helpful. He is a valuable guy to have on your side. \nHis classes might not appeal to some students because its very unstructured but personally, I enjoyed them. Rare professor at Barnard.\n\nWorkload:\nTheoretical - 2 essays and a final\nSeminar - 3 essays\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "September 03, 2014",
            "review_content": "\nThis class was really painful... \nLike the person below said, Burgstaller has to be one of the the nicest professors at Barnard, but this class is just not very good. \nThe lectures are very boring, but more than that, VERY difficult to follow. I had read previous reviews before taking this class so I thought I could be prepared and just wrote down everything he said in class to review afterward. However, I think that he gets too into some of the topics and goes off on tangents which makes it impossible to follow any of the ideas. I also believe that Burgstaller knows that he lacks the ability to engage students which is why he records his lectures and uploads pictures, but I honestly tried listening to the lectures after class and it was equally as boring and difficult to grasp the concepts. I really did not learn anything in this class which was just so unfortunate. \nI bought all of the books, but only used them for random quotes to put in the essays. The recitations are okay, but only if you asked for specific help on the essays or with course material- otherwise the TA just sat there and asked us if we had any questions. How could anyone have questions if we didn't even know what the lecture had been on? \nThat being said, however, I would recommend this class if you want an easy B+ ( maybe an A- with a little more effort). The essays are ridiculously short (4 pgs) and easily graded. The final will probably screw you like it did me if you don't do the readings, but Burgstaller provides a  list of 12358393 review questions at the beginning of the semester so if you can answer most of them you can definitely get a B or above on the final and your grade will  probably end up being A- just because of the essays. \nWorkload:\n2 essays\n2 final \nif you're happy with a B+: take this class!\n but don't go to lecture, don't read, do well on the essays (very easy), review your \"notes\", and bomb the final \n"
        },
        {
            "course_name": "The Theoretical Foundations of Political Economics",
            "review_date": "August 01, 2014",
            "review_content": "\nMy sincerest apologies to any Barnard Econ majors. Everyone else--do yourself a favor and DO NOT take this class! I feel bad writing this review because Burgstaller really is a sweet old guy. However, he is not a good professor and the course is a literal waste of time. He is unable to engage his students. The course material (which should have been relatively simple; it's not difficult to identify and expand upon basic Marxist principles) was presented in a very complex and roundabout way. If you ask him a straightforward question, he will give you a very lengthy, in-depth response: a response so layered and deep, in fact, that you won't be able to find the answer. This class was such a headache--by the time I decided not to major in Econ, it was too late to drop it and I was stuck. Please, don't make my mistake. \nWorkload:\nBurgstaller tries to help his students--he records all of his lectures and takes pictures of what he writes on the blackboard. However, these would only have been helpful had his actual lectures been helpful. The course load may seem seem heavy, but you will discover that it is not. Trust me, you won't do the reading. There are also two papers (you will be required to meet with Writing Fellows for each) and a final. Despite all my complaining, I got a B+, which is probably what everyone else got too--the class is crazy curved!\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "January 16, 2013",
            "review_content": "\nHe does NOT take any responsibility for his student. \nFirst of all, his two classes--International Money and Finance and Intermediate macroeconomics cover almost the SAME materials!! I can say 95% of the materials are the same! Same handouts and same boring lectures. \nMost important thing I would like to say here is: do NOT believe his any promise to you!\nI asked him whether he could offer me a very important document for me 2 months before the deadline of submission. He replied me with his usual smile face that it was his pleasure to do this for me. And in the following days I discussed every details with him and told him the deadline. He still replied with his nice and polite words and said he would like to do this for me. Therefore I did not prepare for further alternatives. BUTï¼Œhe called me 4 HOURS BEFORE THE DEADLINE that HE CANNOT DO IT FOR ME. He just threw me into a very embarrassing situation that I cannot get any other documents from other professors at this last moment before deadline, and he totally knew this! His reasoning is that my writing skill is not perfect. He does not want to lose his face to help me with his name on the document. It is totally ridiculous!! I admit that  my writing skill needs to improve as an international student, but ruined his promise at the last moment based on this kind of reasoning is ridiculous and selfish! He chose not to lose his....face, maybe.... , but he loses all of his morality as a Professor!!  \n\nWorkload:\nnot so much\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "December 17, 2012",
            "review_content": "\nWorst class at Columbia! for sure. If you truly want to learn about interest rates and money markets, this is NOT the class for you.\nProfessor Burgstaller is nice and brilliant guy; however, the man does not know how to teach. His lectures are lightly based on the textbook and the classnotes that he posts on courseworks are hardly understandable. As past reviewers have stated, he is also extremely disorganized in his style of teaching.  He will scribble a bunch of equations on the board in no particular order and attempt to make sense of it to the class. He will fail at this. \nAlso, the TA was not very helpful at all.\nHis tests are also far more advanced than the material presented in the textbook and the class. The average grade on the midterm was around 50%. \n\nWorkload:\nA problem set every 1-2 weeks (graded on completion). Midterm. Final.\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "May 16, 2012",
            "review_content": "\nGod Almighty this was possibly one of the worst classes I've ever taken. Ever. Professor Burgstaller is brilliant to be sure, however his teaching style has much to be determined. TFPE should be a very reasonable course, after all it's just reviewing and understanding (mostly) early thoughts - Smith, Marx, Ricardo, etc. One would think that it's very structured: introduction to the person, possibly outline the philosophies/politics/economic environments of the time that would contribute to his theories, then delve into a concise but thorough review of his material. Not the case for Prof Burgstaller's class. He goes every which way, though he does go person by person thank God, he uses graphs and equations which are useful, but not important and not required for the final. Also his office hours are 1 day a week for 2 hours in the evening. Also he'll call you...which is a little awkward (he's called me at 10pm and 11pm). \nThe TAs (Maria Paula and Michelle) were completely and utterly useless. They hosted 1 recitation per week (combined) - now initially, before we were writing papers, these were useful in that they went over the material but once we started writing papers they used this single recitation period as time to meet with students (10-15 minutes each) and discuss papers. They had no office hours, they refused to meet outside of class hours, they refused to discuss their grading system [apparently they had a rubric which they refused to give out to us saying they're not useful because they're not specific to peoples' papers (well duh, we're not all writing the same paper are we?)], they refused to discuss individual papers in detail. So overall they were pretty awful TAs.\nWorkload:\nButtload of readings.\nPapers: 2 expository - one on Smith, one on Marx/Engels/some other people; he gives suggested essay topics but you can really chose whatever topic you like; 5-7 pages each, you turn in a rough draft that's sent to writing fellows (attached to the class) then 2 weeks later you turn in your final draft.\nNo midterm.\nFinal: he changed his mind a few times - initially he said all multiple choice but we ended up with a 2-hr, 10 true/false questions -- he'd pose a statement then we'd say whether it's true/false/neither/partly true/partly false/mostly true/mostly false etc and state why. \nMajority of the people in the class took it as part of major requirement; some took it as an elective. \nLaptops are good, but he also draws graphs which you may want to copy. \n"
        },
        {
            "course_name": "The Theoretical Foundations of Political Economics",
            "review_date": "May 23, 2010",
            "review_content": "\nIf I learned anything in this class, it was that lectures were an entire waste of time.  He is all over the place with philosophers and equations that you will never use.  If you're not taking this for the econ core, don't do it.  Also, it's not so much a political economics class as much as it is a philosophical economics class... I declare a misnomer.  I skipped two weeks of lecture and I was totally fine on the final. The only reason to go to class is to respond to emails and maybe get a gist of what he's talking about.  But from there, I learned all of the material through wikipedia or google searches and recitation.\nEverything Burgstaller takes three hours a week to teach, the TA (I had Jessamyn Blau) will teach in one.  Go to recitation!!  Not only will she clarify Burgstaller's rambling, she will tell you what is or is not important.  Also, she grades the papers, so get your drafts looked at.  She's a great resource for the class.  The course is additionally integrated with the Barnard Writing Fellows Program, so after you hand in a draft, you have to meet with a writing fellow (you schedule your meeting during class).\nFor the final, you get review questions for each philosopher-- study off them.  The entire exam is questions from that.  \nOverall, the class is not bad; only a lot of work before the papers and final. \nWorkload:\nTwo essays and a final\n"
        },
        {
            "course_name": "Historical Foundations of Modern Economics",
            "review_date": "May 03, 2010",
            "review_content": "\nLike a review below notes, Professor Burgstaller is a very nice person.\nHe kindly answers every question during and after class. He is very responsive to emails also. \nHe spent the earlier part of the semester in teaching the history of economics in general. The later part of the semester was spent for the classical model. \nHe goes pretty much in detail in explaining the classical model. I often found it hard to follow the bunch of equations he write on board. But if you really want to learn it throughly, you can ask him questions or look at the supplementary materials he posts on courseworks.\nThings you need to for the class are one 5-6 page review of a thinker of your choice (or a class presentation) and a 10-15 page final paper (topic, your choice also). That means it really would not affect your grade even if you skip lectures and readings.\nLectures and readings will be mostly valuable to you as an economics student, though. Listening to class presentation was a waste of time.\nRecommended for those who want to learn about the history of economics and those who want an elective with a relatively light workload. \n\n \n \n\nWorkload:\n5-6 page review of one of the thinkers or a 15 minute presentation \n10-15 page final paper\n"
        },
        {
            "course_name": "Intermediate Macroeconomic Theory",
            "review_date": "December 28, 2009",
            "review_content": "\nHe may be one of the NICEST people I have ever met. But, that does not change the fact that this class (and his individual lectures) is SO disorganized. We use a textbook, but he refutes it every chance he gets. There is a practice midterm which is pretty much identical to the actual midterm, but the wording is RIDICULOUS (so confusing), as is the subsequent curve (around 30-40 points for me). Plus, he goes off on tangents. As a result, we barely covered a small portion of the plan intended on the syllabus. I do not feel even remotely confident in my knowledge of economics, and I know that's a common sentiment in the class.\nHe is quite nice, though; I will give him that.\nWorkload:\nA few problem sets at the beginning of the year that the TA doesn't even look at, midterm, \"extra-credit\" presentations in groups of 3 that just wasted everybody's time, final\nMidterm worth 45%, final 45%, participation 10%\n"
        },
        {
            "course_name": "Historical Foundations of Modern Economics",
            "review_date": "May 23, 2009",
            "review_content": "\nProfessor Burgstaller is really sweet and nice. He is quirky and colorful, but in an endearing way. However, he teaches in equations and the occasional graph. I generally prefer graphical and mathematical interpretations, but there is a limit. He gets so caught up and writes new equations over the old ones anywhere on the board. If you come to class late, you can't even tell where the notes begin or end. There isn't much organization. You don't even have to know most of the stuff he writes on the board to do the assignments. \nThis class is very similiar to Theoretical, practically the same. The one thing that I admire about Burgstaller is his interest and passion. He teaches the same courses every semester, but he seems to enjoy the material evermore. He gets so in to it even when the rest of the class isn't. I really appreciated having a teacher who looks like they want to be in class. \nWorkload:\none presentation OR a 5-page paper on one of the economists we study and a 10-15 page paper on almost anything.  Lots of reading, a whole lot, but most of it doesn't have to be done. \n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "May 19, 2008",
            "review_content": "\nProfessor Burgstaller's personal interest in the subject matter and his knowledge of the history of economic theory made the lectures an absolute pleasure. He has the ability to make even the most complicated economic equations interesting and exciting and important, and he did not just give a brief overview of each economist we studied: he gave the technical explanations to each economist's theories. Sometimes he went a little overboard with complex equations, but we didn't need to understand them for either of the papers or the final. Overall, Burgstaller is a wonderful professor and a wonderful man, and thanks to him I now have a much more complete world view of economic history. I looked forward to his class every day.\nWorkload:\nA lot of reading, two papers and a final.\n"
        },
        {
            "course_name": "Historical Foundations of Modern Economics",
            "review_date": "April 22, 2008",
            "review_content": "\nProfessor Burgstaller is brilliant and devoted. He lectures with such enthusiasm and really works hard to interest you in the subject. I actually will miss this class.\nWorkload:\n1 short paper OR presentation. 1 long final paper. LOTS and lots and lots of reading.\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "January 08, 2007",
            "review_content": "\nThough a brilliant prof.  from the very first class you will be lost in the mire of equations that he writes on the board.  The class is not \"math-based\" and in truth you dont ahve to know any math to pass the course.  The problem is that his lectures become so unclear because he simply crosses things out and rewrites them.  The class wouldn't be so unbearable if the TA weren't so terrible.  She is unapproachable and chooses favorites early on...so if your not one of them, then forget it.  Also, I figured out (too late) that she likes straight regurgitation for her papers.  Ultimately, its a tough class and theres very little communication between TA and prof.  Hes a nice guy but not a good prof.  Don't take the class unless you have to.\nWorkload:\nA LOT of reading.  You can get away with not doing all of it.  2 papers, managable overall.  Tough class though.\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "October 31, 2006",
            "review_content": "\nInt'l money and finance is a highly recommended class for econ majors and there is no one better than professor burstaller to take it with. Burstaller is, to quote another review \"a genius\"! By far the most caring professor I came across in columbia.One of the most wonderful professors I had the pleasure of meeting and learning from in columbia. If you are interested in studying he will make sure that there is no question asked that will not be fully understood..if it takes, he will call you at home and explain it one on one. I dont know why he chose to stay and teach in columbia, but while he is here, take advantage! It's a privilege! He tries to make the material as understandable as it can be and he is a very generous grader. To sum, a great person and professor who makes the class a true experience. The TA was also great. \n\nWorkload:\nTwo exams not easy, but manageable. Problem sets are formality- as long as you hand it you earn full points.\n"
        },
        {
            "course_name": "Economic Life and Human Character (FYS)",
            "review_date": "May 07, 2006",
            "review_content": "\nThis professor is one of the nicest people on Earth! He is brilliant and wonderfully enthusiastic about his subject. He really cares about his students, and wants to help them get as much as possible out of his class. He is also extremely receptive to student ideas, and encourages questions and office hour chats. Especially in his First-Year Seminar (which was the most awesome class I took in my life!) Professor Burgstaller has been incredibly friendly and down-to-earth, with his bright orange vest and his one-of-a-kind laugh. People who don't know him and are daunted by his accent or the countless mathematical symbols he scratches onto his black board: have no fear! First of all, if you'll just approach the man you'll find how good-natured he is, and how willing and capable he is with explaining the most complicated concepts in the clearest, most concise way. Second of all, for the Theoretical Foundations of Political Economy class, all the lecture tapes are in the library! He also spends hours and hours on preparing intricate lecture notes on Courseworks. He is truly an awesome professor, and a champion of student thinking. \nWorkload:\nA lot of reading. Keep up, or you'll be missing out. Papers with drafts. If you're lucky enough to be in his small seminar class, he will personally devote hours of his time to giving you very detailed, extremely thoughtful comments on your paper.\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "May 01, 2006",
            "review_content": "\nHe is THE BEST!\nHe made this class my favorite class ever - and it's a class that could've easily been mt least favorite. Professors really DO make a difference and Prof. Burgstaller is a perfect example for this. He loves teaching this class and his enthusiasm to teach this course reflects on us - and makes us like the class more! He is very approachable, very helpful, and very very nice. It's also nice to be in a class with a professor who tries to get to know all the students' names - it just makes it a cozier atmosphere... \nI would definitely recommend this class to everyone - even if you're not econ or poli sci majors!\nIt is a very pleasant and enjoyable class - just sit back and listen to what Prof. burgstaller says - u don't even need to do all the readings because he goes through everything very thoroughly and gives the important page numbers!\nthe only bad thing about this course was that Prof. Burgstaller does NOT grade the papers - the TA does - and we all know how TAs are like! - for some reason - they feel like they are better TAs when they grade unfairly tought! and so is the case here...\nWorkload:\nThe workload is not too much - I mean - it is a lot of reading but it's no more than what we're used to from LitHum and CC... 2 papers (edited by the \"writing fellows\" assigned to us, NO MIDTERM!!!!!, and final.\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "June 12, 2005",
            "review_content": "\nBurgstaller is fabulous. He is genuinly a nice guy alongside being a genious. He expects alot from his students, not in workload but in knowledge and he teaches trying to challenge, really challenge his students.\nHe is super rigarous. In Int Money and Finance he expects students to follow on a graduate level of understanding, which seems really unfair sometimes. But since it is an elective, don't take the class unless you are ready to really work at understanding Burgstaller's way of explaining the shmoo-widget way of looking at exchange rates.\nTheoretical Foundations is a little different, I think because he understand that for alot of students it's a requirement, so he takes it a little easier. Having said that...it's still not easy. He definetely goes alot more in-depth than other professors who teach Theoretical Foundations. But you learn, really learn. \nHe is really approchable and will help you with an essay, a problem, a midterm...just ask.\nWorkload:\nNot heavy for either but the midterm and finals are tricky. Both are True and False for about 10 questions but it is the explanations that matter...International Money and Finance has impossible exams but the curve fair.\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "August 09, 2004",
            "review_content": "\nLISTEN TO THE TERRIBLE REVIEWS AND DO NOT TAKE THIS CLASS! I'd say this class is horrible only it's hard to say since I attended only 50% of the lectures, and the ones I managed to sit through usually involved a nap or a newspaper (these times often ended with Prof Burgstaller asked me if I was comfortable or feeling OK, he also once asked me why I never come to class but he seemed to accept my answer that I never go to any of my classes -- which is such a lie).  If you are going to take it anyway, study from the textbook - its pretty clear and actually somewhat intersting, and just reference the lecture notes to make sure you havent missed any major topics.  You can't pull an A without coming to class (unless you have previous knowledge of the material), but you won't fail either.\nI do have to say that Prof. Burgstaller is a nice guy, and fairly accomadating.  You may never see him outside class, but he will call you in response to an e-mail, and was really nice about extensions on problem sets for religious holidays etc.  He's also infurating though in that he's speaking english, but you cant understand a word that comes out of his mouth.\nIn 2003, there were 120 people in his class  . . . lessons were learned and in SP 2004 there were only 20 (in a HUGE lecture hall).  Don't make the same mistake I did.\nWorkload:\nproblem sets  - ungraded, just write something down\none midterm, one final, both will make you think you might know the answers, but dont worry you really dont.\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "January 02, 2004",
            "review_content": "\nAlthough the course was not very organized and the readings were long and tedious, the workload was very manageable and Professor Burgstaller was a very approachable professor. He certainly demonstrated a strong interest in and passion for what he lectured, and went out of his way to ensure that his students understood the material. In preparing us for the final, he wrote up a list of review questions for us to study and even called me the weekend before the final in response to an e-mail I had sent him with questions regarding the review.  But beware of his tendency to complicate simple concepts and over-use of equations that will confuse the hell out of you.  \nWorkload:\n3 five page essays and a final.\n"
        },
        {
            "course_name": "Theoretical Foundations of Political Economy",
            "review_date": "December 18, 2003",
            "review_content": "\nAfter he lied and said there was only 1 equation for the whole course, he used various symbols every class. He was in a constant English lesson with his TA Polly who corrected his English and prononunciation every class. The TA was a random grader. Technically you dont have to go to class though because every lecture is taped and put in the library for class use. Take this class only if interested.\nWorkload:\n3 5-page papers, 1 final\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "May 19, 2003",
            "review_content": "\nwow this is hands down the worst class I have ever taken. The material on its own actually interests me but the prof just makes a complete mess of it and of himself. This man cannot even explain simple concepts like depreciation and appreciation of exchange rates coherently. He is a really nice guy and does his best by trying to make numerous hand outs to clarify the materials but they are a pure waste of time. Like abt 20 percent of the class came since no one understood what he was talking about. The true and false mid term was easy but the final was an absolute killer. The only redeeming aspect of this class was the TA -- Antonio -- really helpful and much better than burgstaller.\nWorkload:\nSome ungraded psets which are a pure waste of time. Just do them in class while he rambles on. \n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "May 15, 2003",
            "review_content": "\nEverything said in all of the other reviews is true-- I just have a little more to add.  The class is large, so don't expect cozy conversations about the material.  In fact, don't expect to ever talk to Dr. Burgstaller.  EVER.  You have to sign up for his office hours, which are at odd times.  The book is actually very good, but he doesn't really teach from it.  Honestly, I went to class for the first half of the semester and could barely stay awake.   The entire time was spent on a few minor equations and correcting the errors he made in mathematically explaining said equations.  If you're interested in the subject, buy the book and read the only four chapters he covered.  You'll get more out of it.\nWorkload:\nFairly light.  The homework is easy and seldom.  It's only checked for existence, and not accuracy.\nThe tests are insane.  Wow.  True/False essays, where you need to read the question about ten times to make sure you took into account every stipulation in the statement.  The classes don't prepare you for the tests, but the recitation was pretty good.  \n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "May 05, 2003",
            "review_content": "\nDon't take this class. I don't know how anyone found this to be a great class..... He confuses himself in EVERY class, and someone or the other has to point out what he's done wrong, at which point he'll look back at the class and laugh inanely. The book itself is pretty good, but you have to know his notoation, which is INSANE. To his credit he seems like he's a really nice guy. He would probably do well at teaching at kindergarten. Antonio (the TA) is pretty good though, but not worth the trouble of the class.\nWorkload:\nLight. he only manages to cover 4 chapters, but you have to translate that to \"Wigets and schmoos\" first (don't ask...). The curve for the midterm (I ahven't taken the final as yet) wasn't that great. The mean was 59 and 75 was an A minus. Burgstaller himself would probably score a B minus. The problem sets are collected but not graded (I think I did the wrong questions once and I still got it back fine). Midterm was TOUGH.\n"
        },
        {
            "course_name": "Historical Foundations of Modern Economics",
            "review_date": "April 25, 2003",
            "review_content": "\nIf you liked International Money and Finance, youÂ’ll love Historical Foundations of Modern Economics.\nJust like the announcement for a hackneyed sequel of a really bad Hollywood movie, I solemnly hope it makes one even LESS inclined to take this course.\nDuring the first class, Burgstaller each student why he/she had decided to take Historical Foundations. Most people assented they liked economics, but most courses at Columbia had leaned toward too much mathematic exploration and not enough conceptual insight.\nAt first I was skeptical; after all I had seen his first flop of a class, International Money and Finance. However, I was temporarily won over; he had sounded a complaint that most economics students (including myself) had about the courses in the department.\n I was duped again.\nSuffice to say the course might as well be called Mathematical Foundations of Historical Economics. According to true form, Burgstaller loses himself at the blackboard in a maze of pretentious and unhelpful symbols. He drones on for what seems eternity, bouncing from one economic tangent to another, without covering the substance of what we were supposed to cover in class. If one could not get enough of his infamous schmoos and widgets example from International Money and Finance, he updates his example with something about deers and beavers. \n Apparently there was some sort of reading list, but we never got around to it. Apparently, if one actually got around to perusing the non-mandatory reading list, one would find it surprisingly engaging; IÂ’d highly suggest if one were actually interested in learning about economic history, read all the books on the reading list, show up only on those days you have to do make a presentation and hand in the final paper. \nBut like Levar BurtonÂ’s famous quip at the end of the PBS weekly childrenÂ’s literacy show, Reading Rainbow,Â” you donÂ’t have to take my word for it.\n\nWorkload:\nWorkload: 1 presentation (Burgstaller will talk through most of it, so it isnÂ’t necessary to be substantively prepared) or 5-page summary of one of the  weekly reading, AND one final 10-15 page paper due the last class.\n\n"
        },
        {
            "course_name": "International Money and Finance",
            "review_date": "May 18, 2002",
            "review_content": "\nOverall great class. Mends all the threads (or most of them) that Interm. Micro+Macro have left over and is thus indispensible for anyone who wants to grasp at least a little bit of the big picture in Economics (since, for all my Pan-American friends, yes, it does matter for all of us how other nations value the US currency and market and whether or not US should put up tariffs. And yes, you might have to know something about it in your Investment Banking interview...) Burgstaller is very accommodating when asked questions in class and, perhaps most importantly, curves on a A-C curve, which makes for a (very) good grade if you put some work into it. Also, probably has the best TA, Antonio Falato, that you'll every meet in your life. Can explain anything and is very understanding when it comes to missed HWs. And even though it's a Barnard class, expect at least half the students to be from Columbia.\nWorkload:\nProblemsets every 2 weeks, although I 'm not sure if they are actually graded. I think he just wants you to do them and checks them off. 1 Midterm, 1 Final. Both are fair and have no surprises.\n"
        }
    ]
}