{
    "prof_info": [
        {
            "prof_name": "Maria Gray",
            "prof_id": 1861,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Architectural Representation: Perception",
            "review_date": "January 19, 2009",
            "review_content": "\nIf you ever have to take a studio at Barnard, please avoid Maria, she is the worst professor ever, u just don't learn a thing in her class, she is a waste of time, and there is always a conflict of ideas between her and the T.A.  She gives confusing feedbacks, and worst of all, stab you in the back when times comes for crits, it almost seems like she forgets that she is the one who advised you to make such a design.\nI personally think she should not be teaching in this department, after taking perception with her, 6 out 16 in my classes dropped out of architecture.\nWorkload:\nA lot as every studio\n"
        },
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "January 15, 2006",
            "review_content": "\noverall she is a good teacher. she has a monotone way of speaking, which can get quite boring, but she usually is saying something of worth.  she doesn't seem to expect too much from the students, her demonstrations of drafting techniques for example was so slow and easy that she could have been talking to a first grader.  i know it must be hard for her to remember what every student's project is about because there are sixteen of us and she runs her own architecture firm, however, sometimes i feel she can do a better job keeping on top of these things.  like the reviewer before, i don't think she takes effort into a lot of consideration (or atleast as much as i would like her to).  she is approachable and friendly.\nWorkload:\na lot because its a studio course! but her class was surely easier than the other two intro courses\n"
        },
        {
            "course_name": "Architectural Representation: Abstraction",
            "review_date": "January 21, 2004",
            "review_content": "\nnot a good prof! she is laid back, but can get nasty. effort not taken into consideration, and she is not that helpful. she did not seem that interested and was not encouraging. \nWorkload:\nits a studio so expect to spend a lot of time there, not as much as some of the other studios, but defnitely was my most time-consuming class.\n"
        },
        {
            "course_name": "Perceptions of Architecture",
            "review_date": "December 16, 2003",
            "review_content": "\nMaria is an incredibly encouraging and friendly professor - if you can get into her studio, I definately would.  She likes innovation and creativity in your projects and gives you restraints on what you can use, but lets you go freely from there.  The class wasn't very structured - pretty much presenting the project, maybe a mini discussion on a packet of reading, and then pretty much desk crits all the way.  I just wish she were a little more critical - she would be incredibly positive about your projects during desk crits, but during the final reviews she would bring up criticisms that she hadn't mentioned before...  In general, though, a good professor who's more laid-back than most.\nWorkload:\n4 \"speculations,\" a bit of reading\n"
        }
    ]
}