{
    "prof_info": [
        {
            "prof_name": "Youssef Nouhi",
            "prof_id": 3210,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "arabic",
            "review_date": "December 19, 2016",
            "review_content": "\nI have no complaints about his teaching.  His number one goal is to make sure you learn.  He will try to make life as easy for his students as possible without going easy on us.  Before the final, he reviewed with us for three hours, taking time out of his day off. He also made us study guides that other teachers did not make.  He goes above and beyond everyday.\nWorkload:\nLike a part time job.  2-3 hours a night, including on weekends sometimes.  Bi-weekly quizzes, final exam, daily homework.\n"
        },
        {
            "course_name": "Arabic for Heritage Speakers I",
            "review_date": "April 15, 2015",
            "review_content": "\nThis man is an angel. \nHe is so intelligent, and knows so much about linguistics and Arabic and history--it's truly impressive. Asides from that, he's so sweet and really cares about his students. \nWorkload:\nDoable. Usually one assignment per class, sometimes writing or other times a grammar drill. \n"
        },
        {
            "course_name": "Arabic for Heritage Speakers I",
            "review_date": "April 15, 2015",
            "review_content": "\nThis man is an angel. \nHe is so intelligent, and knows so much about linguistics and Arabic and history--it's truly impressive. Asides from that, he's so sweet and really cares about his students. \nWorkload:\nDoable. Usually one assignment per class, sometimes writing or other times a grammar drill. \n"
        },
        {
            "course_name": "Arabic for Heritage Speakers I",
            "review_date": "October 26, 2010",
            "review_content": "\nYoussef Nouhi is an AMAZING teacher. He is so approachable and kind and understanding. He loves what he's doing and really cares about his students. The grade is not so important as whether or not you are learning the language, and he'll whatever he can to make it easier for you. I had Youssef for four consecutive semester, and only wish that I take his class again. \nArabic can be pretty intimidating at Columbia, but Youssef takes away the scary factor without compromising on how much you get out of the class. \nWorkload:\nIt's Arabic - lots of homework, a midterm, final, and a couple of papers. He's a very fair grader. \n"
        },
        {
            "course_name": "arabic",
            "review_date": "April 22, 2009",
            "review_content": "\nA most caring, fair, brilliant professor.  Professor Nouhi speaks several languages, and if he cannot make Arabic make sense in English, he'll use other languages to make his point - particularly helpful if you speak French (i.e. pronounciation tricks).  He works hard, and manages to teach you beyond the syllabus without you realizing it.  I have had few professor as stellar as Professor Nouhi, cannot believe there are not dozens of written reviews for him, and could not more highly recommend him (particularly after having other Arabic so-called instructors in the MEALAC department).  When all is said and done, you will be pronouncing your Arabic properly, writing well and feel comfortable walking in to his class.  Bottom line: he cares.  \nWorkload:\nStandard Arabic departmental Syllabus, quiz, final, homework. Get ready for lots of work, and add more to it yourself - it will only help.  Listen to those CDs, they actually do help.  Stop thinking in English or whatever language you speak natively.  Five or six quizzes (one every other week).  Painful finals that are totally do-able if you study.  \n"
        },
        {
            "course_name": "arabic",
            "review_date": "April 22, 2009",
            "review_content": "\nA most caring, fair, brilliant professor.  Professor Nouhi speaks several languages, and if he cannot make Arabic make sense in English, he'll use other languages to make his point - particularly helpful if you speak French (i.e. pronounciation tricks).  He works hard, and manages to teach you beyond the syllabus without you realizing it.  I have had few professor as stellar as Professor Nouhi, cannot believe there are not dozens of written reviews for him, and could not more highly recommend him (particularly after having other Arabic so-called instructors in the MEALAC department).  When all is said and done, you will be pronouncing your Arabic properly, writing well and feel comfortable walking in to his class.  Bottom line: he cares.  \nWorkload:\nStandard Arabic departmental Syllabus, quiz, final, homework. Get ready for lots of work, and add more to it yourself - it will only help.  Listen to those CDs, they actually do help.  Stop thinking in English or whatever language you speak natively.  Five or six quizzes (one every other week).  Painful finals that are totally do-able if you study.  \n"
        }
    ]
}