{
    "prof_info": [
        {
            "prof_name": "Peter Levin",
            "prof_id": 2163,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Sociology of U.S. Economic Life",
            "review_date": "January 01, 2010",
            "review_content": "\nPossibly the most interesting and applicable class I've taken here. The course covers market dynamics from a much more grounded and global standpoint than traditional econ classes, and the lectures on the recent crisis were very clear (without being simplistic). The readings and lectures have a bit of a leftist bent, which I appreciated (though others may not). Levin is intelligent, engaging, and passionate about the material, he takes pains to learn students' names, and he brought bagels the day after the midterm (I didn't realize competent professors did this). He's very available after class and during office hours.\nReadings were a bit much the second semester, but the lectures were informative enough that I learned a huge amount even after falling behind on the readings. The midterm and final are easy if you've kept up, and the 15 page final paper is pretty much an open topic.\nWorkload:\nabout 120 pages of reading each week, essay-based midterm and final, and a 12 to 15 page final paper. Substantial but not a problem.\n"
        },
        {
            "course_name": "Masculinity",
            "review_date": "December 18, 2009",
            "review_content": "\nThis class was one of the most enjoyable classes I've had so far in my college career. It's one of those classes where everyone has something to say, whether you do the readings or not. Levin is very charismatic and humorous and is more than willing to explain a concept if you're not quite understanding it. He loves class discussion and is serious about his participation grade so make an effort to speak up every once in a while. The only problem was that he was awful about responding to emails so it was very difficult to get him to look over any drafts you might have had. But, the concepts were never so difficult that you absolutely needed his input on a paper so it's very easy to do well in this class and not be in his office every week for office hours. \nWorkload:\n2 think papers and an in-class final. Weekly readings, some lengthy some not, but overall enjoyable. \n"
        },
        {
            "course_name": "Sociology of U.S. Economic Life",
            "review_date": "December 31, 2008",
            "review_content": "\ni really enjoyed this class. the material i found very interesting, and it wasn't hard not having any economic background. he has this policy that if you come to every class, in the end you get half a grade higher. while this was motivating, i still found myself going to every class (which was at 9am!) because i found the material so engaging.\nthat being said, however, the course load was VERY heavy. sometimes over 150 pages a week. and he sometimes expects you to know it for lecture. i was unable to read all of the books, which was unfortunate, because everything looked really interesting. the midterm was okay; a little challenging, but not too hard. and the final was pretty hard; the actual test wasn't so bad, but preparing for it was torture. there were three essays on the exam, but we had to prepare for 10 of them. then the one paper, which was 12-15 pages, on a topic of our choice, was fine. i enjoyed doing it although i left it to the last minute. \n\nWorkload:\npretty heavy.\n"
        },
        {
            "course_name": "Masculinity",
            "review_date": "May 12, 2007",
            "review_content": "\nsure, he's a nice guy, but he has no sense of classroom control.  this class was lecture-size, but he decided he wanted seminar-style participation.  as a result, classes became painful to sit through, listening to everyone try to get his/her opinion in.  he could not or did not know when to take control of the discussion to keep it from getting off track.  my notes became pointless because class time was spent talking about anecdotes and students' personal opinions - none of which were significant for the exams, of course.  only take this course if you are willing to waste your time in class and do the reading to teach yourself the topic.\nWorkload:\naverage reading load for a soc. class, but the weekly \"memos\" became annoying, especially when he decided it would be a good idea to have your classmates GRADE your weekly work.  exams are on the reading.\n"
        },
        {
            "course_name": "Sociology of U.S. Economic Life",
            "review_date": "August 29, 2005",
            "review_content": "\nHe is really down-to-earth and cares a great deal about his students. the information is interesting. He expects you to do all the reading, and will make you prove it on the exams. its a bit of work- papers and a final. the only negative is that i felt that he gives lower grades than neccessary on papers, just to prove that you have room for growth. But overall, easy going guy. cares a lot about attendence. the class was a pperfect mix between economics and sociology. recommended.\nWorkload:\nnormal\n"
        },
        {
            "course_name": "Sociology of U.S. Economic Life",
            "review_date": "January 17, 2005",
            "review_content": "\nThis was easily one of the best courses I've taken so far at Barnard or Columbia.  Levin may be fairly new, but he knows how to present material, and he's cute and geeky and loves what he teaches.  His youth is an asset - he hasn't forgotten what it's like to be a student.  He gets really excited about things, which is at least minorly infectious.  The material covered is fascinating and extremely relevant to, well, living in the world.  This class tears apart assumptions that are taught in Economics 1001-type classes.\nWorkload:\nAbout average for a sociology class - research paper, midterm, final.  The final was obnoxious, though: he gave a list of 11 or 13  (I forget which) questions and said he'd choose 3 of them, making it necessary to prepare all 11 or 13, just in case.  They all required specifics from the readings.  As for readings, there were 4 paperback books the semester I took the class, but I didn't need to shell out for an expensive course packet because he puts almost all the required articles on Courseworks.\n"
        },
        {
            "course_name": "Masculinity",
            "review_date": "September 08, 2004",
            "review_content": "\nProf. Levin is not only adorable in a geeky kinda of a way but he is also a very interesting lecturer.  Since it was his first semester teaching he still had some things to work on.  Otherwise, his readings are not busy work and are actually all very interesting.  Additionally, he gives out an evaluation for the class to fill out about him mid-year so if there is something that you do not like about his teaching style you can let him know.  Additionally, he is very open to meeting with students and very approachable.  He gives out extra credit for going to every class.  The material is fascinating and Levin does an excellent job of presenting it.     \nWorkload:\nNot bad at all.  Just do all the readings and then writing the essays will be much easier.  Only three papers and participation points.\n"
        }
    ]
}