{
    "prof_info": [
        {
            "prof_name": "Geoffrey Zubay",
            "prof_id": 1137,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 13, 2005",
            "review_content": "\nTong teaches the first half of the course.  I found the material to be extremely random (random memorization of different protein structures without really explaining why they're so important), but Tong did the best he could with decent powerpoints.  I thought he was a bad professor but realized that it's really hard to teach this random part of biochemistry.  Seriously, it seems like the course gives everything that makes sense and is organized to the second half to be taught by Zubay, and gives Tong everything else.\nZubay, on the other hand, was given the task of teaching fairly straightforward biochem pathways.  People who sat in the front row somehow thought he was smart and interesting.  For everyone else, the guy was hard to hear, rambling, disorganized, COULDN'T REMEMBER WHAT WAS IN THE TEXTBOOK THAT HE WROTE, and class was a complete waste of time.  The only reason to go was for the weekly quizzes and to pick up the handouts.  Everything I learned at that point was from the coursepack that he helped write (which is totally decent).  The guy is 74 year old though, and as a lecturer, he wastes your time.\nWorkload:\nWeekly True/False quizzes that you really should spend a small amount of time studying for (it adds up if you don't) , a multiple choice midterm, and a multiple choice open book final (final is easier than the midterm).\n"
        },
        {
            "course_name": "Biochemistry: Origins of Life",
            "review_date": "April 21, 2004",
            "review_content": "\nSeeing that professor Zubay was present at the origin of life he knows quite a bit about the topic.  The first half of the course is about the origin of the earth and the second half is mostly organic chemistry topics and some evolution.  Technically this is a graduate level course but there was only one graduate student in the class who was a spitting image of the comic book salesman from the Simpsons in appearance and demeanor.  Despite the fact that the midterm was open book the mean was pretty low.  \nWorkload:\nMidterm and a final, both open book\n"
        },
        {
            "course_name": "Seminar in Nucleic Acids: Microbiology/Control of Infectious Diseases",
            "review_date": "April 18, 2004",
            "review_content": "\nOn the first day of class, groups of students are assigned bio agents to research.  Each week, a group of students presents their bio agent to the class.  This class is totally worth it just for the time you get to spend with the Zubay.  The man is brilliant and is the sweetest professor.  \nWorkload:\nA group of 3 people give a powerpoint presentation.  Take home final.  \n"
        },
        {
            "course_name": "Biochemistry: Origins of Life",
            "review_date": "January 21, 2004",
            "review_content": "\nZubay rocks!  He's old and belligerent and hard of hearing and is the sweetest gem in the bio department.  He talk about Pauling and Kreb like they were his buddies, and hey, THEY WERE.  He's a legend in his own right, even if only for his quirky personality.  I love this guy.  He only gives open book exams (hello!); if you go to class and just figure out what's important in the book, which means what Zubay thinks is cool, you will get an A.  This is coming from the biggest slacker to make it through the Columbia pre-med courses, ever.\nWorkload:\nlight.\n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 20, 2004",
            "review_content": "\nHaving been present since approximately the birth of biochemistry  he tries to inject a little history of biochemistry into the course.  This was my favorite aspect of his teaching, although it wasn't very pronounced and was accompanied by ample name-dropping.   Aside from this, he mumbles through the material and is unnecessarily cranky.   The final is open book, but when a curve is involved all this means is that you have to spend energy memorizing where things are in the book rather than spending the same energy actually learning the material.   \nWorkload:\nNot bad, but really know where things are in the book before taking the final.   \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "January 07, 2004",
            "review_content": "\nThis was the worst class I've taken at Columbia. Prof Tong teaches the first semester, which is boring at best, and gives  a 45 multiple choice question midterm that tests you on completely obscure details from Gen Chem.  Then Prof. Zubay takes over and it goes even further downhill from there. He is cranky and condescending on a good day. He has no desire to help his students learn anything and only wishes to talk about how brilliant he thinks he is, how other people are idiots, and how many Biochem books he's written. I'm a Biochem major, so I love the material, and yet I still hated this class. It  was clearly impossible to demonstrate any  understanding of the material on the exams, as they were multiple choice, and consequently the standard deviation around the mean was about two.  I did well in the end, but that's because I studied the tiny details of the material like a madman. \nIn hindsight I learned quite a bit in this class, but it was from trying to decipher  Zubay's coursebooks a million times on my  own, which proved to be difficult given the nonsequitor page layout and the interesting grammer. \nSteer clear of this class if it's not  a requirement. Don't take as an elective if you're a Bio major. \nWorkload:\nWeekly quizzes (T or F), midterm (45 MC questions), final (75 MC questions).  Read the coursebook or lecture outlines before class and you'll have a better shot of taking something out of the incoherent lectures. \n"
        },
        {
            "course_name": "Biochemistry: Structure and Metabolism",
            "review_date": "May 22, 2002",
            "review_content": "\nHe wrote the book so he lectures from it.\nWorkload:\n1 midterm. 1 final. - open book. Multiple Choice 10 quizes - closed book. True/False Everyone will do pretty well so you need to study. \n"
        }
    ]
}