{
    "prof_info": [
        {
            "prof_name": "Andrew Kaye",
            "prof_id": 9463,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 08, 2013",
            "review_content": "\nI agree completely with the review below. \nKaye's lectures were fine, and he did try to make them interesting, but he offered little feedback, created an unpleasant classroom environment, and was almost impossible to communicate with.\nHe spent 15 minutes a class chastising us for not reading the book, telling us that he doesn't have enough time to teach us everything, and scolding us for taking notes because we shouldn't be \"memorizing\" the material. Same speech. Every class. He specifically kept the lights off--to make it easier to see the slides but also to prevent us from taking notes--even though it's IMPOSSIBLE TO STAY AWAKE in a dark room while listening to Mozart's variations on Twinkle, Twinkle, Little Star. \nThe midterm was ridiculously long and the final asked the MOST SPECIFIC QUESTIONS possible.\nOne midterm question was on the nickname of a composer that the book mentioned in passing. These are the kind of insanely specific, irrelevant questions that show up on the midterm and final. \nThe prompts for the papers were so vague and when we asked for feedback he would say things like, \"it's hard to explain what makes a good paper\" and \"you just have that special spark or you don't.\" OK. \nHe was so hot and cold in class--some days he was super friendly and other days he would snap at students for asking innocuous questions--and he also seemed to dislike random students for no particular reason. \nI think he really wanted us to learn about and appreciate the music--and would try to help--but this was hands down the worst class I've taken at Columbia.\nIf you're looking for an easy A OR just an enjoyable class from which you'll learn a lot about music, SWITCH OUT.\nWorkload:\nRidiculously long midterm (see above)\nRelatively long final with questions equally specific and ridiculous as those on the midterm\nThree six-page papers with vague prompts and zero feedback.\nYou're supposed to read the book, which is actually interesting and helpful, but even if you keep up with the reading you won't do well on the MC questions unless you memorize every composer's wife's name, favorite color, shoe size, etc.\n\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2012",
            "review_content": "\nI just finished my semester of Music Hum with Professor Kaye. I found it to be one of the most frustrating courses I have ever taken at Columbia. I feel as if the reason they don't let you choose your core professors ahead of time is so they can sneak in professors like this. To be fair, I will start with the pros: Professor Kaye was knowledgable about the subject and a relatively clear speaker. Meaning he said words and I understood what they meant. But he is also kind of a lunatic. For the first half of the semester, he did not lecture on any piece of music we would be tested on. He said that he wrote the lectures to be entertaining, and that we had to learn all the relevant information ourselves from the book. He spent anywhere from 10-15 minutes EVERY CLASS talking about how he didn't have time to cover everything we had to learn, and we had to pay close attention to the readings, because that's where the test questions would come from. Aside from being a waste of time, this seemed to illustrate that he is somehow aware that he is shirking his duties as a professor of a core class, which is to teach us about the Masterpieces of Western Music. Instead, he spends his time on pieces that he finds more interesting that may have some connection to the pieces we need to know, in detail, for the exam. He goes so far as to insist that his students don't take notes because they are there to \"think\" not just \"memorize\" and that none of the lecture is on the exam. (Despite the fact that none of the lectures were relevant, he still required attendance). After the midterm (which I think everyone did terribly on, but was curved) he started talking about the actual material. \nALSO: in giving us his general feedback on our performance of the midterm, he claimed that we \"didn't absorb anything\" from lecture and included nothing we learned in class in our midterm essays. When I tried to point out that he had directed us to not take notes, he just talked over me, saying that we should have understood these concepts and been familiar with these pieces of music to bring them into our analysis, even if they weren't in the book. Seriously: delusional.\nMy classmates expressed frustration over these antics, but no one was motivated to say anything in class. I raised my hand in class and asked if I could give feedback on the exam (the questions are extremely technical and specific, the exam extraordinarily long) and he responded that he \"couldn't make everyone happy\" and is \"always criticized for one thing or the other.\" \nAs a side note: he's a total colonial apologist. On the last day of class, he waved away my attempts to discuss the colonial implications of a video he showed, claiming that \"if it's not one person's colonialism, it'll be another.\" Offensive and incorrect. \nI expect I will get something around a B or a B+, which is fine, but he is not worth the trouble.\nWorkload:\nHe assigns three 6 page papers that are all in response to the same, extremely vague prompt. Midterm and Final are both technical, detail-oriented, and lengthy. The only reason why anyone does OK is that he curves it so much. \n"
        }
    ]
}