{
    "prof_info": [
        {
            "prof_name": "Uri Cohen",
            "prof_id": 2436,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 05, 2011",
            "review_content": "\nUri is the shit. And takes no one's bull shit. If you're like me and really despise students in your class who talk frequently and profusely while their contributions consist of nothing but hot air repeated in various permutations, then Uri is your man. If you get him as your LitHum professor, consider yourself lucky as he only teaches the fall semester. :'(\nHis discussions are very entertaining and interesting, and somehow he seemlessly and effectively integrates pop culture references into his lectures. His choice and interpretations of passages/topics to discuss within each work seemed unorthodox and unusual to me in the best possible way. I really recommend actually doing the reading because he knows if you didn't. The questions he asks of the class are generally very difficult and relatively bullshit proof.\nAlso, watch The Big Lebowski before you take his class. 1) Because it's one of the greatest movies ever and you should just watch it. 2) Because it seemed as though he mentioned it in about half of his lectures. You will come away from his class with the notion that this movie somehow captures the main themes from the some of the most important literature of Western civilization.\n\nWorkload:\nTwo 4-page papers, midterm (which was... difficult), and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 30, 2010",
            "review_content": "\nLet's put it this way: Uri Cohen expects a lot out of you. Lit Hum in and of itself is not terribly difficult, but the way he wants you to think about literature or analyze the text can be very challenging and at times frustrating. As the other reviewers have said, it might take time getting used to his unconventional teaching style--he never writes on the board [and when he does, it's illegible scrawl as he points out] and class consists of him asking provoking questions that everyone most often struggles to answer. Rarely does the class actually arrive at the core point he is trying to make, though, so by the end, he will give his own creative, thorough take on the work. His interesting insights on all the works on the syllabus that help you adopt a new mindset about literature and develop acuity and perspective in analysis.\nThis is also a class where BS will not cut it. As Uri says, our generation is one that \"can say a lot without saying anything.\" In this respect, your answers in class or in essays need to be original and creative--something that is simply correct but too on the surface or conventional will not do, and your grade will show it. Also, stay away from Sparknotes because he says the people who write those are \"stupid\" and \"miss all the good stuff.\" So yes, listening to him lecture on the Lit Hum syllabus can be insightful and interesting [he's a polyglot and started reading the Bible to us in Hebrew] but his brilliance also means that your 4.0 may suffer when your analyses may not be as developed as he expects. However, Uri is willing to make himself available during office hours or by email to help [he also invited the class to his house for a bagel brunch]. He also does not believe in grades but must give them so roughly it's just his perception on how you fared within the context of your class...so \"you get what you get and you don't get upset.\"\nThat being said, it is hard yet not necessarily a section to stay away from, but rather be prepared to work hard, analyzing literature on a new level and coming up with profound insights [which is the point of Lit Hum anyway, right?] All in all, probably one of those classes that I'm glad I went through but probably wouldn't want to do again.\nWorkload:\nStandard Lit Hum + Samuel I/II of the Bible. 2 four-page papers. 3 one-page close reading analysis that counts for participation. Fairly difficult midterm. Easier final. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 12, 2010",
            "review_content": "\nUri Cohen is brilliant, funny, and a great teacher.  That said, you will most likely be very intimidated the first class.  It takes a while to get used to how he teachers, but you will leave the class a better person than when you started.  He makes you think.  What is sufficient in other classes just won't cut it in his class.  He expects you to really understand the material and he will call you out if you don't.  \nUri is the kind of teacher that Columbia needs more off.  He finds ideas in the texts that will blow your mind.  The regular sparknote themes, ideas, etc. will not suffice.  He is looking for something much deeper, which is harder to find, but much more rewarding and interesting.  \nTake his class and you will come out a much better person.  I only wish I had an opportunity to take his class again.\nWorkload:\nAverage lit hum, he may ask for a little bit more reading than the already intensive syllabus, but it's worth the extra effort\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 11, 2008",
            "review_content": "\nHe channeled his military background (required of Israeli citizens I think) and seemed strict at the beginning of the semester, but that was obviously not his true nature, as the class progressed with a very relaxed atmosphere. A little intimidating at first, he isn't one of those professors who will half-heartedly agree with your wrong answers in class- if he disagrees, he'll say it. He is a cool, personable guy with a unique perspective on the works, had a lot of insight to offer. Seemed to care about students, required 1 office hours visit. Liked to make references to pop culture and jokes. (Watch \"The Big Lebowski\" and you'll get [proverbial] points with him and get a lot more of his references) Take home midterm!! Don't think you can get away with not doing the reading, though. Not an easy A by any means, but relatively fair grader. Emphasis on close reading and direct textual analysis.\nWorkload:\nStandard. 2 four page papers, 3 one page close readings.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 18, 2008",
            "review_content": "\nUri is light-hearted fellow who more often than not has a smile on his face and whose knowledge of trivia such as the Big Lebowski, can at times fascinate you, coming from him.\nBut let me warn you, it was not easy getting used to Uri's teaching style. He can be very demanding, often wanting you to locate obscure facts hidden in homework that spanned over 100 pages. (The transition was even more difficult because my first semester teacher was more about overall themes rather than specifics.)\nBut if you are someone who can dedicate time, and can do all of the readings, Uri will take notice. He can also tell who hasn't done the reading or (as sometimes happens in Lit Hum) who reads it but did not understand and dissect it all.\nIf you can get past all that, you will find a professor who has a lot to offer, and whom you will want to recieve praise from.\nDoesn't believe in grades so expect a B for good effort, an A if you truly do all the work, and a C if you really don't make an attempt.\nWorkload:\nTwo Papers, three 1page close reading assignements, and a lot of reading (rite of passage for Lit Hum).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2007",
            "review_content": "\nOkay, so I may not quite agree with my previous reviewer's glowing praise, but I certainly have a lot of good things to say about Professor Cohen.  He KNOWS things, man.  His lectures on the readings bring in allusions from Jean Baudrillard to The Big Lebowski to Beevis and Butthead.  ...And it's not just talk- it's pretty relevant.  Be warned, the class is discussion-based so don't expect him to give you any answers until forty minutes of heated discussion.  Don't worry, if your class still hasn't managed to reach THE EPIPHANY he'll give you all the interpretation you need.  \nHe's flexible about assignments almost to a fault.  I don't mind him cutting down the workload, but not so late that I've already completed the assignments by then. The grading is no piece of cake, but it's fair. Professor Cohen is also good about extensions and re-dos.  His comments on graded work are sparse and mostly illegible.  If you want feedback you need to get him during office hours, which is okay because he's pretty available.  His midterm is usually harder than the final, but it's good practice.  Don't expect in class worksheets, study sessions, or study materials.  Your notes are basically all you have.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2007",
            "review_content": "\nOkay, so I may not quite agree with my previous reviewer's glowing praise, but I certainly have a lot of good things to say about Professor Cohen.  He KNOWS things, man.  His lectures on the readings bring in allusions from Jean Baudrillard to The Big Lebowski to Beevis and Butthead.  ...And it's not just talk- it's pretty relevant.  Be warned, the class is discussion-based so don't expect him to give you any answers until forty minutes of heated discussion.  Don't worry, if your class still hasn't managed to reach THE EPIPHANY he'll give you all the interpretation you need.  \nHe's flexible about assignments almost to a fault.  I don't mind him cutting down the workload, but not so late that I've already completed the assignments by then. The grading is no piece of cake, but it's fair. Professor Cohen is also good about extensions and re-dos.  His comments on graded work are sparse and mostly illegible.  If you want feedback you need to get him during office hours, which is okay because he's pretty available.  His midterm is usually harder than the final, but it's good practice.  Don't expect in class worksheets, study sessions, or study materials.  Your notes are basically all you have.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 26, 2006",
            "review_content": "\nProfessor Cohen is hands down the best teacher I've studied with during my time at Columbia.  His passion for the material permeates every aspect of the course.  He is also one of the most brilliant professors at the university.  He sticks very closely to each text and favors careful, exploratory explications.  While Professor Cohen attempts to engage all students, you'll get out of the class what you're willing to put into it.  That said, he is never condescending nor arrogant - he considers the course a mutual adventure.  Grading is fair but difficult (an A- is certainly possible with excellent work, an A not likely).  Brilliant, passionate and a warm human being, consider yourself incredibly lucky if you land Uri Cohen's Lit Hum section.\n"
        },
        {
            "course_name": "Conflict-(non) Resolution",
            "review_date": "November 06, 2006",
            "review_content": "\nUri is really nice and laid-back and knows how to laugh at himself. At the same time, however, being really relaxed about things isn't always the best quality in a professor. The class seems to have no structure whatsoever, and he never seems to really care if you've done the readings or not. The worst is when his being laid-back is couple with you doing more work. For example, half way through the semester he decided that our 10-15 page paper should actually be 25-50 and though he gave some very, very open suggestions for topics, we were pretty much told to write on whatever we want. Which, in my opinion, is more because he's too lazy to organize it than because he genuinely wants us to have the freedom to do whatever we want. That said, the readings for the class, if you choose to do them, are actually really interesting and good, and in general, the discussions are also worthwhile. So, in conclusion, I wouldn't recommend him, but it's not the worst class either, I would just be sure you are really interested in the topic before you take a class with him, because otherwise you wont get much out of it.\nWorkload:\n25 page paper and light to moderate amount of readings every week\n"
        },
        {
            "course_name": "Postzioinism and Postmodernism in Hebrew Prose",
            "review_date": "January 20, 2005",
            "review_content": "\nThis class was really interesting and inspiring.  Uri is passionate about the material and genuinely wants to share his excitement and infuse appreciation of the literature into his class.  He responds respectfully to any comments made in class, but is good at emphasizing his points.  He is not big on the system, and not big on grades, so assignements have a lot of leeway and are generally fun and interesting to do.  I really recommend this course to anyone interested in literature.  Uri knows a ton and is good at communicating his knowledge in a way that students can easily relate to.\nWorkload:\nReadings every week, length varies, mostly manageable.  He is usually flexible about due dates if the class objects to a deadline.  There are 2 short papers assigned (3-5 pages) during the semester and a final paper (~10 p).\n"
        }
    ]
}