{
    "prof_info": [
        {
            "prof_name": "Anargyros Papageorgiou",
            "prof_id": 2762,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Quantum Computing",
            "review_date": "May 14, 2015",
            "review_content": "\nI feel kinda bad writing a harsh review because Papageorgiou is a really nice guy and cares a lot. He's the professor who looks over your shoulder while you're taking the midterm and tells you where you've made a mistake. (This boosted my score by at least 10 points.) He's the professor who absolutely glows when people do well on the homework. When he says his door is open, he _means_ it. Really means it.\nSo I'm not going to shit on him because I don't like him. Or because my grade will probably suck, because that's my fault for losing interest and not doing the work past March or so. I'm going to shit on him because despite what a wonderful person he is, his teaching has thoroughly earned it. Before I launch into that, though, here's my recommendation if you want to learn about quantum computing: read Scott Aaronson's book, \"Quantum Computing Since Democritus\". I bought it and chipped away at it half-heartedly for a few days in February and it taught me more and explained things better than Papageorgiou did in a whole semester.\nOk, now that we've got preliminaries out of the way:\nThe class really is as close to an out-and-out waste of time as I've had at Columbia. Each lecture starts with a 10-30 minute review of the previous lecture (generally closer to 10 minutes, but 30 happened a few times), so you're getting maybe 2/3 of a lecture. And then during that 2/3 of a lecture, the class covers very little material. For a sense of how little: it would be generous to say we covered 1.5 chapters of the textbook during the second half of the semester. And we only managed that by skipping all the tough material and glossing over the particulars of a lot of the easier material.\nJust to be clear, this isn't an \"easy\" class the way some with little content are. There's just a lot of time dedicated to intense study of trivia. A personal pet peeve: an inordinate amount of time was spent on how single qubit quantum gates can be decomposed into rotations. The textbook devotes maybe 10 lines to this, tucked away as a side note in the end-of-section exercises of an introductory chapter, but we dedicated many hours in class to example after example of this decomposition. One of the five questions on the final was decomposing a single qubit gate into rotations. And it came up during the final review. And on the quiz before the midterm. Papageorgiou kept coming back to it, guessing his way through the decomposition, explaining how he intuited every step, filling the whiteboard up top to bottom... all for a decomposition that can be solved quickly and directly by the algebraic substitution techniques you learned in middle school.\nWhile that's an extreme case, it's gives a sense of how the class worked and why we got almost nothing done. Papageorgiou can't seem to explain the \"big picture\" -- he drills down into particulars very quickly, and gets lost in them. There are professors who, at the beginning of a lecture, can tell you what you will learn today and what its place is in the course. Papageorgious can only do the former. As a result, at the end of the semester, the material you know is a fair  approximation to what you might know if you lifted 30 random paragraphs out of the first 4 chapters of the textbook and then studied each intensively for an hour. You'd know plenty of factoids but have little grasp of how they fit together. My working hypothesis: Papageorgiou never sat down and worked out a theory of what this class is supposed to be.\nAgain, an example, which I think is representative: a physics major in our class was confused by the proof that sets of quantum gates are universal. He objected that the proof didn't address the efficiency of constructing an arbitrary gate from the universal set. Flustered, Papageorgiou brushed this off, saying roughly \"In quantum computing, we don't care about efficiency!\" That might make sense if there weren't so much fuss about the efficiency of Shor's and Grover's algorithms. The \"big picture\" explanation that was never forthcoming: quantum computing, like the deterministic variety, happened as a progression from proofs of computability (in this case, universality of gates) to proofs of efficient algorithms for specific problems (e.g. Shor) to...\nAh. Another sore point. We never got the next step, \"proofs that quantum computing algorithms form families,\" the quantum complexity classes. The book, which is 15 years old, barely knows quantum complexity classes exist. But they do, and what I've read about them on my own (e.g. Aaronson's book, Wikipedia) is really really cool, and it was very disappointing and frustrating to go through a whole semester and not (as far as I can recall) hear BQP mentioned even once.\nOk, I'm going to stop now because you've probably gotten the point. :P\nWorkload:\n5 homeworks, not very hard but sometimes tedious. Make sure you know your linear algebra. Each has a programming component to be done in MATLAB. Again, not hard but usually tedious.\nTwo quizzes (one each before the midterm and final) that give you bonus points towards the exam grades. Midterm and final that are open everything -- no joke, you can use your iPhone if you want -- and are really just regurgitation for the most part. Like the gate decomposition thing, or \"derive an algorithm to do X,\" where X is almost verbatim the description of some algorithm we covered in lecture and because the exam is open book you can just copy it out of the book. It is advisable to go to the midterm and final review sessions because *hint hint* the actual questions MIGHT be used as review examples, or simply given away outright by Papageorgiou. (I learned this the hard way.)\n"
        },
        {
            "course_name": "Introduction to Quantum Computing",
            "review_date": "May 13, 2015",
            "review_content": "\nThis class was fairly easy; I definitely think it could have gone into more depth. But it was not a joke: it covered a reasonable amount of material in a reasonable amount of depth. Papageorgiou is just an effective teacher, and he doesn't assign cruel problem sets.\nThe class covers only the basics of quantum computing. It's a CS class but it would be reasonable for a physics major to take it, if they had some very rudimentary CS knowledge (logic circuits, and the general idea of big-O analysis of runtimes). The fact that it was targeted at two groups limited the material we could cover. We couldn't really talk about complexity theory to avoid alienating the physics majors. And we couldn't talk about any actual quantum mechanics or real-world implementations of quantum computers, because that would have terrified the CS majors.\nYou definitely need to know your linear algebra coming in. The first quarter of the class is basically linear algebra review, to familiarize students with the Dirac notation used in quantum mechanics, and help them get used to working with complex numbers. We then worked through how operations on quantum states can be equivalent to Boolean circuits (proving that quantum computers are at least as powerful as classical computers).\nThe rest of the class was going over the famous quantum algorithms that are better than any known classical algorithm. Shor's factoring algorithm, which is the cool thing that everyone wants to learn, didn't really come in until the last few weeks of class (although much of the groundwork was laid before that).\nLectures were basically the professor working through problems on a digital board and explaining as he went. It was important to take good notes, because for some reason he would not post copies of these digital notes online. His lectures were quite helpful; they followed the general structure of the textbook but made explicit some parts of the book left \"as an exercise to the reader\". Normally I think this format is terrible, but there was something mysterious going on and I actually remembered most of what I learned. Perhaps it was the professor's mellifluous accent.\nThe professor and TA were both helpful and available during office hours. They were also both responsive by email, and generally very friendly in all their interactions.\nOverall, this is a great class. I didn't have to work that hard and I still learned a ton. It's the best of all possible worlds.\nWorkload:\n5 problem sets.\nHomework was not too time-consuming. There were simple but helpful written problems. Most assignments also required us to write a \"simulation\" of some quantum algorithm in MATLAB. These were totally useless: often you would pass in the desired answers as an argument to the function. But it was surprising how helpful it was to my understanding to write them.\n2 completely open-book exams (which includes any notes you want and even a laptop, for those students who pirate their textbooks).\nThe exams had very high averages. If you asked a clarifying question during the exam, the professor was extremely generous with his answers; he wouldn't be coy if a mistake had led you astray.\n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "April 09, 2014",
            "review_content": "\nPretty bad class. Incredibly easy, but I walked out feeling like I wasted a semester. It's required for CS majors, so you'll probably take it anyways, but be warned: you will not learn as much linear algebra as you should. He repeats all the material at least three times, rather than moving forward. The homeworks are a waste of time. \nHe's an incredibly kind man, and will explain anything you want to you, anytime. Definitely worth talking to outside of class and gong to office hours. He'll also help you on exams, if you ask.\n\nWorkload:\nVery light. A few problem sets from the book, a few easy programming assignments, and a midterm and final that he gives you the answers to beforehand (so it's worth going to class the day before the exam). \n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "December 20, 2013",
            "review_content": "\nComputational Linear Algebra with Papageorgiou is a pretty decent class. He's definitely one of the nicest professors you will meet at Columbia and is a lenient grader to boot. Apart from the actual teaching, this class is great. Linear algebra is a super interesting subject and has applications in every single field. Homework assignments are reasonable - not insanely hard or long. Tests are graded generously and he will tell you if you are right or wrong during an exam.\nThe class is essentially Linear Algebra + algorithms for matrix operations. It follows the standard Linear Algebra book by Strang. Papageorgiou generally starts his class with a 20 minute recap of the previous lecture followed by whizzing through the current material.\nHe has a strong Greek accent which can make class hard sometimes. He is an above average teacher, but his abilities are nothing to brag about. He wants you to understand the material and not monotonously apply formulae you don't understand. However, between his accent and bad handwriting, you can occasionally get lost and fall behind (I got lost twice this class - once during RREFs and another time during eigenvalues and eigenvectors). He sometimes doesn't really explain stuff properly and just says \"Boom! Boom! You're done\" which causes endless frustration. It's important that you go to his office hours and clear up doubts because all the material builds up (which makes studying for the final very interesting because you see how stuff you learned in the beginning of the semester all ties together).\nPapageorgiou makes tests low stress by acting as a check-guard during exams. At any point, you can go up to him and ask him to look over our solution and he will tell you if it's right or wrong. As long as you know the material, you can easily get high grades on tests by making him check the harder problems. He obviously won't tell you the answer, but you will at least know that you're missing something. It's very possible to get perfect scores on every single test in this class as a result of his checks.\nProgramming assignments shouldn't take more than 2-4 hours. Problem sets consist of 5-6 questions from the textbook. If you know the material, they can be finished in 1-2 hours. More often than not, you will have to read the material to solve the problem sets which makes them take more time.\nHe has 4 quizzes which consist of 2-3 problems which keep you up to speed. They count toward your midterm and final scores.\nThe midterm was straight forward. 5 problems - he gave us one of the problems a week before the exam (but it was a hard one) and told us that another problem would be solving a general system of equations. Pay attention to his revision sessions - he reveals the tricks needed to solve some problems on the midterms then.\nFinal was harder than the midterm and he didn't tell us any of the questions before hand. However, it was completely doable, especially since he helped students out during the exam. It also had some cool problems that made you think and appreciate the subject better.\nOverall, this was a good class and Papageorgiou makes it as easy as it can be. If you pay attention, do the work and take advantage of Papageorgiou's help, there is no reason you shouldn't get a great grade and learn a lot in the process.\nWorkload:\n5 homeworks (6 problems from textbook + 1 programming assignment)\n5 problem sets (he asks you to prove something)\n1 midterm (easy)\n1 final (slightly hard but very manageable)\n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "January 06, 2012",
            "review_content": "\nGreatest professor EVER!!! AP is the nicest guy you'll ever meet. He really wants to give good grades to everyone in the class. As long as you go to class, this course is incredibly easy. AP doesn't mess around with tricks; he focuses on the core concepts and tests you on these same things. If you understand them, you don't have to worry about messing up on the tests.\nGetting near 100% is very doable, however AP reserves A+'s for those who also do the extra credits. Either way, if you go to class and make an effort, you should have no trouble getting a good grade.\nTAKE THIS CLASS.\nWorkload:\n5 homework assignments, written/programming sections in each. \nWritten = usually about 5-6 questions. Can be finished in 30 min - 1 hr.\nProgramming = any language, Ranged from 10 min - 1.5 hrs.\nMidterm and Final were straightforward and easy. \n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "December 27, 2011",
            "review_content": "\nProf. Papageorgiou teaches simply.  He'll review material covered in the previous class, then get on and whiz through the topics he planned for the current class.  And that's about it.  Especially since the material isn't the most exciting stuff, class can get pretty boring.\nHowever, he really tries to make computational linear algebra accessible to everybody, and he tries to give everybody good grades.  If you ask him to stop and repeat something, he'll do it.  If you're a little confused about something on a quiz or a test, go up and ask him about it.  He's very liberal with hints.\nThere are five homework sets, four quizzes, a midterm, and a final.  The homework sets are part theory (questions from the textbook) and part programming (often to implement algorithms he discusses in class).  None were particularly challenging, except for the one for finding the null space of a particular matrix, and only because there were so many places for hiding potential counting errors.  The quizzes and tests are really, really easy (he called one a \"morale booster\") and are meant to help your midterm/final grades.  The midterm and final are also ridiculously straightforward (he'll even give you two or three of the five questions beforehand).  Oh, and it doesn't hurt that you can ask Prof. Papageorgiou to check your answers for you.  He'll tell you if anything's wrong and the correct way to get the right answer.\nThis course covers a lot of topics, and if you're not interested in linear algebra, you'll find it incredibly tedious.  But at least Prof. Papageorgiou will be there to simplify everything and help you get a nice grade in return for sitting through class.\nThere is one side-effect of getting so much help from the professor, though.  If you want to get an A+ and not just an A, you have to do the four extra credit assignments.  But that's not really much of a side-effect because they're also unbelievably easy.  He even give hints for those, too.\nWorkload:\nA short homework set every two weeks (five total), four extra credit assignments, a midterm, and a final.  Nothing very challenging at all.\n"
        },
        {
            "course_name": "Introduction to Quantum Computing",
            "review_date": "May 12, 2011",
            "review_content": "\nThis is for the quantum computing class - take it with Papageorgiou if possible at all. He's a phenomenal teacher - clear, helpful, and it shows that he really cares about your learning experience. He starts off every lecture with a review of past lecture, and he'll go through plenty of examples in class to make sure you really understand the underlying theories and principles.\nThe class itself is no joke. You'll have to know your linear algebra (he'll do a quick review but you still need to have some background). Quantum computing comes down to matrix operators acting on vector qubits, so linear algebra is essential. Papageorgiou sometimes gets a little carried away and covers a large amount of material in a single lecture - make sure you go over your notes after to really understand it.\nAs a result of his clarity and superb teaching, the average of the class was crazy high. So you really can't afford to mess up since the curve will hurt you a lot if you do. But since it's taught by Papageorgiou, you really shouldn't have any difficulties. Go to class. Do your homework. If you have questions, ask him in class or go to his office hour (he's very very approachable, I occasionally dropped in his office not during OH and he was glad to help).\nWorkload:\n5 homeworks - mostly straightforward with a maybe a few less straightforward proof questions. Each homework has a programming component, which is very doable and it's cool to see how you can simulate a quantum algorithm on a classical computer.\nThere is one quiz before the midterm and before the final, whose grade gets factored into the midterm and final grades. He does this to make sure everyone is on track.\nMidterm and final were very straightforward and open-book and open-notes. He'll do plenty of review problems before the exam and even gave out at least 2 questions on the exam (without revealing the solutions). So if you go home and worked it out, you pretty much have already earned 50% on the exam before you even started it.\n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "January 18, 2011",
            "review_content": "\nA.P. IS THE BEST PROF EVER. He is so nice and really clear with lectures, and flexible if you need an extension (although he looked really sad when I asked for one, so don't do it too much). He obviously cares a lot about students, and is really enthusiastic about Linear Algebra.\nThere were a few 15-minute quizzes at the end of class, these were open-book and open-notes. He'd announce the topics the class beforehand. What's more, HE CAME AROUND AND HELPED after about 10 minutes. They weren't very hard, but due to his help I ended up getting 100 on all of them. Midterm and Final were similar, although not AS easy.\nOne tiny, tiny complaint: I got over 100% on the class, but I didn't get an A+. Maybe he doesn't give them, or maybe it was because of the curve. Whatever, it was still one of my most stress-free and worthwhile classes.\nBless him.\nWorkload:\nPsets every two weeks, with programming and written component. Not hard, although the programming takes a long time (but you should be used to that if you've taken CS classes before).\nMidterm, final. COPIOUS amounts of extra credit.\n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "December 23, 2010",
            "review_content": "\nGREATEST. PROF. EVER.\nTake this class with this man. I don't care what conflicts you have. I don't care if you aren't required to take this class. Just do it. It will change your view on professors forever. \nImagine if you will a prof who cares about his students. Who makes every attempt to give them good grades AND have them understand the material. Who before every tricky concept, takes the time to explain why the material isn't tricky at all. A prof who doesn't need office hours but takes the time to explain concepts to you any time you show up at his door. A prof who knows how to create the perfect balance of practical and theory without overworking the class. A prof who doesn't try to trick you on exams but rather tests the fundamental concepts that you will take out of the class. The prof I'm describing is Papageorgiou. \nHis lectures are clear and cover exactly what you need to know. His homeworks were fair (and even fun on some of the programming ones). He tests were incredibly straightforward. His review session goes over EXACTLY what you need to know. \nWorkload:\n5 fair problem sets. One was a Matrix Solver which was pretty cool to build. 4 Quizzes which he lets you know about at least a week in advance and tells you the questions that will be on it. Midterm and Final which were pretty easy if you paid attention in class or at least came to the review session.\n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "July 29, 2009",
            "review_content": "\nHands down the best comp sci teacher I have had so far. He is an excellent professor who actually cares for his students and their understanding of the material. Professor Papageorgiou comes well prepared to class and actually teaches. He goes step by step to make sure everyone logically understands the progression of the lecture. \nIf you go to the lectures and pay attention, the class will be enjoyable and rewarding. Everything on the midterms and quizzes was covered in depth, there were no surprise questions, and the extra credit is usually manageable. He emphasizes understanding not out-of-the-book memorization, so his tests are designed that way. Also, he will gladly take the time to help you out after class with any type of doubt or question on the homeworks. \nGoing in, I thought this course was going to be a pain and was pleasantly surprised by everything I had learned towards the end. The comp sci deptartment needs more people like him. \nWorkload:\nHW 30%, Midterm 30%, Final 40%, Extra credit 10%\nHomeworks arent too bad and they actually help you understand the material. If you attend the lectures, pay attention and ask questions, the tests are a breeze.\n"
        },
        {
            "course_name": "Scientific Computation I",
            "review_date": "February 03, 2008",
            "review_content": "\nAP is the best professor I've had at Columbia. His lectures are the only ones I've ever bothered to go to, as he actually teaches instead of preaches. He goes over what is important, tells you implicitly what is going to be on tests, and goes step by step so it's almost impossible to get lost. If you do, he'll stop and explain.\nHe doesn't believe in pointlessly long questions or tests. He's focused on the principles, the tricks, that are necessary, and on how these things are useful in applications; specifically finance, which is excellent for CS as many job opportunities will be finance related.\nWorkload:\nBi-weekly assignments usually consisting of 1-4 written problems that are as long as my review and a programming part that can be done in less than an hour in the worst cases.\nOccasional quizzes if he feels like it, though you'll know exactly when and on what, extra credit makes up a possible 10%.\n"
        },
        {
            "course_name": "Computational Linear Algebra",
            "review_date": "December 27, 2005",
            "review_content": "\nComputer Science majors at Columbia tend to dread the Scientific Computation and Computation Linear Algebra courses, and as few as ten (out of thirtysome) people have shown up to class.  I feel kind of bad that attendance was so bad, as the professor's a nice guy, but I'm not one to comment on why you should go to class, since I for the most part didn't.\nThere are 5 Homework Assignments.  In the first 4, there is a programming component that is worth 40%.  The amount of programming involved varies widely, and the most difficult programming assignment is actually nontrivial, which was a shock to the class.  The theory questions given are pretty easy, and it seems like we would learn so much more if we had less programming and more problems (For example, I don't think there was a question where we actually had to solve for the eigenvalue).  The professor doesn't assign a homework until all of the material on it is covered, and then you get two weeks to do it, which is generous.  You are not given as much time for extra credit (like a week), but extra credit problems are fairly easy proofs, so it is not too difficult to get all 10% of the extra credit, if you are not too afraid of proofs.\nThe midterm was very easy, and the final was significantly harder.  He is a pretty lenient grader, and doesn't plan to fail anyone.\nThe textbook is followed pretty closely, and packets are made covering a few algorithms not covered in the book.\nWhile nobody's crazy about his teaching abilities, he is a very nice guy who will help you out if you ask him.\nWorkload:\n5 HW Assignments (including programming), worth 30% of grade.  Midterm-30%, Final-40%, Extra Credit-10%.\n"
        }
    ]
}