{
    "prof_info": [
        {
            "prof_name": "Caroline Wamsler",
            "prof_id": 3564,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 26, 2016",
            "review_content": "\nTotally agree with the below review. I tried so hard for the class and clearly I didn't get an A. Why? Because she just doesn't give As. I approached her multiple times of the course of the semester, asking for more feedback and ways to improve and she said - hey, you are doing so fine!!! B+ is a great grade. LOL WHAT. Not in Art Hum. I have friends totally cruising through other sections of Art Hum and getting A/A+s. I put in so much work, always spoke multiple times in class, and she did say I'm a very good student but..... B+. OK Wamsler. OK.\nBE WARE. Do not take the class if you want a chill Art Hum experience. Don't expect an A. Expect B~A- with a ton of work. However, you will learn about art guaranteed. Why? Cuz you need to freaking memorize everything including the date of creation of artworks. \n\nWorkload:\nA LOT. 7 journal entries, mid term, final, 2 essays that are super harshly graded without any real reason. you can't improve your grade throughout the semester because she gives very little clarification. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "April 03, 2016",
            "review_content": "\nI originally signed up to take her class because of the reviews below. However, its been more than halfway through the semester, I've given her a chance, and I am WRONG.\nFirst of all, she often rude towards her students. All of us remember the one time a student asked a question, and Professor Wamsler said \"Okay....-insert smirk- now answer your own question\" with the most disrespectful and scornful look I have honestly seen any teacher give at my time in Columbia.\nGrading for the class: she graded harshly for the first paper and midterm as far as I'm concerned. Best part is, she gave some people two grades, yes TWO GRADES. For an Art Hum class that meets at 8:40 am and with students who pay attention and care, she sure grades tough. She gave like one line of comments for a 5-6 page paper and something like B-/B.....what does that even mean?!......but actually....do I get a B- or a B....?\nFinal thoughts--I don't hate the class don't get me wrong. She is clearly knowledgeable in what she teaches and the material is interesting. However, at least from what I've heard, Art Hum and Music Hum are supposed to be lighter courses that are enjoyable. I do not enjoy this class. Because of the fact that none of us have rarely had exposure to art, writing about it is difficult. I'm so concerned about getting a low semester grade in one of the easiest core classes that I can't enjoy the material she's actually teaching. Pity\nWorkload:\nMidterm and Final\n2 papers\none journal\nOverall workload is very doable, but for the lack in clarity of what she expects grading wise, this is pretty annoying there so little grade opportunities in the class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art",
            "review_date": "June 29, 2013",
            "review_content": "\nProfessor Wamsler is one of the best professors I have had the pleasure of interacting with. Her method of instruction keeps you engaged and interested in the subject. She's a warm and welcoming person, and her knowledge with Art History is impressive. Before this class I had not taken an art class for 8 years, nor did I find it interesting. I have to say my attitude did a 180. If you are lucky enough to find yourself in her class, stick with her, you will not regret it! I'm glad I took this class. Grade: A.\nWorkload:\nLight reading (2-8) pages of background reading per week. Midterm and Final - easy.  She will tell you what you need to pay attention to. Art journal due at the end of the semester - very easy. 3 short papers (5-7) pages on various topics that you have an option to choose from. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 31, 2008",
            "review_content": "\nDr. Wamsler is a very sweet woman who takes quite a while to warm up to, and who takes even longer to warm up to the class.  On the first day, she literally said \"um\" every other word.  She was very nervous and very cold.\nThe beginnings of the class were not great.  It took us until October to figure out what in the world she was actually looking for from us--\"analysis of visual language\".  Yeah, because that's not even slightly ambiguous.\nBy the end though, we all really loved her.  She had us over to her AMAZING penthouse apartment on the Upper-West Side for dinner at the end of the semester.  Incredible sweet, in the end.\nGo to the Met visit.  It's the best part of the course.\nWorkload:\nThree MAJOR papers, a midterm, and a final.  Plus two \"minor\" papers that are more trouble than they're worth.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 19, 2008",
            "review_content": "\nIt's almost kind of a shame that she's so nice, because if she was more of a bitch I would feel free to hate her. The workload is very light, and, in my opinion, the subject matter is pretty interesting. That being said, the class was enormously frustrating, and, if I had to do it over again, I would have tried to get another teacher. This was because of a few major issues with the class:\nThe first is that the discussions were appallingly, mind-bogglingly shallow. Perhaps this was a consequence of having a class almost entirely composed of freshmen, but I don't pay exorbitant amounts of money to go to Columbia so we can talk about completely obvious bullshit like how the David is a sculpture made of marble, or how Rembrandt sometimes painted with large brushstrokes and sometimes didn't. Hell, I'd never taken an art history class in my life, and I think I probably could have figured 75% of what we talked about just by going to a museum. This probably could have been avoided if Ms. Wamsler had encouraged deep, meaningful discussions, but instead, she actively encouraged the loud people who spewed obvious bullshit to keep talking. These douches had taken like, one art history class in high school and because of this, had convinced themselves that they were complete experts in art and that everyone should coo and ooh and ahh over their shiny, \"new\" revelations. This meant that the quieter people who might actually have had insightful things to say shut up and let the discussions derail into ego-stroking symposia of stupidity. One bright point about the lectures was that Ms. Wamsler occasionally made unintentionally hilarious language fuck-ups that I actually found really endearing.\nThe second thing that really bothered me was a seeming inconsistency behind her grading patterns. Her justifications behind assigning particular grades to my papers and tests seemed flimsy or nonexistent. Feedback on my papers amounted to checkmarks at certain points in the margins and a circled grade at the bottom. The difference between an A and a C paper was never really outlined. If the in-class discussions were so shallow, how was I supposed to figure out what to write in these essays, which had absurdly higher standards?\nShe also definitely played favorites. The more you blatantly sucked up to her, the better off you were in the class. My advice to you if you do have her as a professor: talk A LOT in class. Doesn't matter what you talk about, if it's relevant, or if it's insightful, just talk. This is interpreted as genuine interest in the subject matter and in her, which she rewards with better treatment and better grades.\nPerhaps I am being too harsh. After all, she's very nice, and what should I have expected from a class with so little homework and so many freshmen?\nAnyway, I would have rather had a different professor, but if you don't want very much work, don't mind being mystified by your grades, don't mind not learning much about art, and want a delicious end-of-semester lasagna dinner, then she might work for you.\nWorkload:\nNot heavy at all. Homework is pretty much non-existent. Ostensibly there are readings to be done for each unit, but you really don't have to read them--if anything, reading real art analysis might confuse you. Three short papers (3-5 pages) due intermittently throughout the semester, along with three short (1-2 page) ungraded essays. Midterm and final, for which you need to memorize dates, and frustrating for reasons mentioned above. Participation is weighted heavily so it's in your best interests to talk during class, even if you aren't saying anything of intellectual value.\n"
        }
    ]
}