{
    "prof_info": [
        {
            "prof_name": "Karthikeyan Muthuswamy",
            "prof_id": 10058,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry I",
            "review_date": "January 04, 2010",
            "review_content": "\nKarthik is an excellent TA whose knowledge in chemistry and passion for the sciences will absolutely dazzle you. He also answers promptly to emails and is great in clarifying/reviewing concepts that may still be a little fuzzy from lecture. He is sympathetic to and patient with helping those in need of assistance in a potentially hard subject if you are willing to put in all the hard work, especially during office hours, when he guides you through every little step slowly.\nRecitation quizzes are almost all multiple choice and entirely-based on homework from the previous week, but can get tough because they actually require one to really understand the concepts completely before applying them and performing mathematical computations. He understands very well that they could get somewhat difficult and had no problem applying somewhat of a \"curve\" in the end to compensate for the slightly lower scores. Given his gentle spirit, he is more concerned with us learning more, rather than fussing with grades, and does not want to demoralize the class in any way. He tries his very best (and succeeds) in showing us skills in qualitative analysis that can save us huge amounts of valuable time that might be unnecessarily wasted on the math. \nI thought that the quiz questions propelled me well in terms of preparing for the exams, since they tested for careful dimensional analysis (keep track of all the units throughout!!!) and had \"none-of-the-above\" choices -> similar in style to Valentini's midterms and final. Too bad that he doesn't TA for any other professor. Otherwise, he is definitely a good choice and a wonderful person to converse with and get to know. He is incredibly smart and a pleasure to learn from.\nWorkload:\nMake sure to do the homework (readings from the Zumdahl text and assigned end-of-the-chapter problems, which can occasionally become really heavy and long) to prepare for the weekly quiz. \n"
        }
    ]
}