{
    "prof_info": [
        {
            "prof_name": "Amber Medland",
            "prof_id": 12900,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 03, 2015",
            "review_content": "\nAmber is definitely a newer professor, but her own writing speaks for itself. She let us read her dissertation on philosophy one night as homework, and her comments on your essay (and she writes more for you the more interest you show in class) are definitely worth while.\nShe may not help you with MLA or finicky grammatical issues, but if you're an aspiring writers, she gives you flow. She cleaned up my sentences a lot and just made the whole writing process way more organic.\nThe work she gives can sometimes be irrelevant or repetitive, but some exercises are useful in that she is such a reductionist-- say your point in 3 sentences (for which you will write a 2,500 word essay on) is a common homework assignment.\nWorkload:\nHigh, but (if you speak with her) can prove worth it\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "July 11, 2014",
            "review_content": "\nI came into UW daunted by the horror stories I had heard from my friends who had taken the class first semester. You undoubtedly will have heard that UW is an awful class, so I won't argue that point and readily admit that there is a massive amount of work ahead of you. However, if you happen to get or choose Amber Medland, you are quite lucky. Amber is a teacher that truly cares about you, your writing, and making the class as good of an experience as possible.\nI did not expect to put as much work into this class as I ended up doing- the assignments took much longer than I anticipated and there was a huge amount of reading that you really have to do in order to write your essays. I naturally take forever to do anything, so I would consider myself somewhat of an exception, but do keep in mind that you need to plan out when you are going to do your assignment and DO NOT assume that you can complete the homework and turn in something of high quality in just an hour before class. Procrastination is also a problem because everything you do for one class is built upon for the next class, so putting off any work just makes the next night's homework even worse. Moral of the story, plan ahead for a consistently heavy load of UW homework.\nAgain, having Amber for UW was a blessing. Many of my friends have had terrible experiences with other UW teachers but I promise as long as you respect Amber and do what she says your semester in UW will be tolerable. I hesitate to say pleasant because there were many a night (or should I say morning) when I was sacrificing sleep to finish UW and cursing the class; however, office hours with Amber are invaluable, arguably the most helpful office hours I've had this year at Columbia. Also, comparing with my friends she gave the most consistent and helpful feedback among our teachers. Every class she would return our previous assignments with notes and helpful questions, something many of my friends did not get.\nAnd did I mention she's British?\nWorkload:\nMultiple hours per assignment, sometimes only a few and sometimes several depending on the assignment and your work ethic. Assignments often have more than one part including readings, writing parts or drafts of essays, and revision.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 08, 2014",
            "review_content": "\nI had some seriously mixed opinions on this class. While it's pretty rare to hear a glowing review of a UW class, I didn't particularly enjoy this one. It was a tremendous amount of work (but that was to be expected), but it felt kind of unrewarding. Amber was a decent instructor, but I think it was the first class she had ever taught, and she seemed a bit in over her head. It could definitely improve with time though. She was a very strict grader, and my grades seemed to have no correlation with the amount of work I put in to the essays (whether they were justified or not is kind of hard to determine in English classes). My grades also didn't match very well with those I received in LitHum--my professors preferred very different styles, and an essay which would have received an A in one would get a B in the other, and vice versa. Amber's comments were helpful, but she had a very particular notion of what she liked, and she would, in large part shape your essay towards that (though she would help you every step of the way). She was very accessible via email and in person, and I wish I'd taken advantage of that more than I did. In short, I wouldn't avoid this professor, especially in a few years. But it wasn't the best UW could have been.\nWorkload:\nPretty extreme, but not out of line with other UW classes\n"
        }
    ]
}