{
    "prof_info": [
        {
            "prof_name": "Robert Ferguson",
            "prof_id": 339,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Deep Sea Thought",
            "review_date": "September 04, 2008",
            "review_content": "\nFerguson is absolutely my favorite professor at Columbia. Obviously, he's absolutely brilliant (he has a super impressive resume), but he's also really interested in talking to and engaging undergrads. As everyone has said, he asks a lot, but I thought being called on in class forced everyone to stay on top of the material and made for really interesting discussions. Also, he clearly loves Moby Dick, and managed to inspire the same love in a lot of his students, which alone makes the class worthwhile.\nWorkload:\nLight reading, but you really have to do it, two papers (average length), and a tough final. Totally doable.\n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "September 16, 2007",
            "review_content": "\nProf. Ferguson is, without a doubt, the best professor I have had so far at Columbia.  He makes the material interesting and accesible, he makes a true effort to learn everyones name by the second week, he wants to meet with you during office hours, and is just a really nice and quite erudite individual.  However, I would not advise taking this course to just fill a requirement.  He asks a lot out of students- readings are not too bad but he will call on you randomly in class.  As well, he is a tough (but fair) grader. If you are a Literature major (especially with an interest in Melville) then you MUST take this class.\nWorkload:\nWeekly readings, HEAVY class participation, attendance required, 2 papers (as I said he is tought- but fair), and one killer of a final (but it counts for nothing)\n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "May 13, 2007",
            "review_content": "\nProfessor Ferguson is one of the most caring professors you will have.  He really has a passion for learning.  That's all he wants out of you; however, he is a tough grader on your papers.  I did rather well, but having had other classes with other English professors, I will say that Ferguson doesn't hold back punches.  You must stick to the text.  If you use secondary sources, it will work against you.  His final is tough.  You must come to class having read the material because he calls on people randomly--this must come from his law school days. I don't recommend this class for a lit requirement or as an easy grade.  The workload is light, but the grading is harsh.  Another note, the TAs are/were useless.\nWorkload:\nFive Works in total, Moby Dick for 9 weeks (both papers on the novel), no mid-term, one really tough final.\n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "September 02, 2004",
            "review_content": "\nProfessor Ferguson was my favorite professor from the Spring 2004 semester. Primarily a teacher at the law school, Ferguson rationalized his Monday / Wednesday mornings with the undergraduates as \"the happiest point in my day before I have to go yell at a bunch of idiots.\" How could you not love this man? The class is almost entirely on Moby Dick, so non-Melville fans be forewarned. Professor Ferguson is enrapturing as a lecturer, with carefully chosen selections from the book that tie what is essentially a mass of relatively interrelated information into neat little mini-philosophical digressions. With this class as first on my schedule, I never had a problem getting up--even on Monday morning. He is constantly looking for input from the class, which once received is integrated seamlessly with his lectures--making him a gem among professors for that alone. The man is muy le excellent: Take the class, visit the office hours, and you will never look at Keats the same. \nWorkload:\nNot bad. Two 4 page papers (no midterm) and a final that is relatively easy to prepare for. \n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "May 16, 2004",
            "review_content": "\nI don't know about brilliant, but Ferguson is very intelligent and a thoughtful reader. He enjoys 19th century American lit, though, so if you don't, this may not be the class for you. Most of the class is Moby-Dick. It is dense and technical (he notes that it was first classified by librarians under \"Whaling\" and not \"fiction\"), but it is interesting and very easy to get into all the technical aspects of the book. The adventure parts come later on and are not a huge portion of the book. I enjoyed _To the Lighthouse_ with Ferguson much more so than I did with my Lit Hum class, though it is still entirely unclear what _To the Lighthouse_ has to do with the deep sea. That is the only real question I have with the overarching themes of the course. They seem to be more about pensiveness, melancholy, equanimity, and other states of being rather than the deep sea.  This is the case also with Eliot's \"The Wasteland,\" which I had read before, but this course offered little insight into. Ferguson did, however, offer much insight into Keats' odes and applied them to Moby Dick, and i think the course was worth taking for that alone.\nWorkload:\nTempest, Keats' odes, Moby-Dick (2 1200-word papers on it), To the Lighthouse, \"The Wasteland\", 2 hour final\n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "April 15, 2004",
            "review_content": "\nProfessor Ferguson is amazing.  At Columbia I've had very few classes that are actually taught, rather than being led by class discussion.  He asks for our input every once and a while, but not often, which is good since he is brilliant.  He is very professional and has the class planned out to the last second.  He also makes a huge effort to get to know the students, going as far as to request photos and bios from us the first day of class. \n   The class itself is incredibly good.  We took about 7 weeks to read through Moby-Dick, concentrating more on the philosophical impact than anything else.  I've learned so much in this class and anyone interested in a class with an easy readin g workload and informative lectures should take this one.\nWorkload:\ntwo essays (4 pages, max), a final.  he grades kind of tough, but not so hard that a first year can't get an A if you try.\n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "March 31, 2004",
            "review_content": "\nThis man is brilliant. I am not saying this because I'm doing particularly well in the class. I'm not. He's a tough grader. But I promise that it will be one of the most worthwhile courses that you'll have taken at this school. He is a full time Columbia Law professor with a dual appointment in the undergraduate english department, and for that reason alone he's amazing. His lectures are peppered with discussions as well, which makes it easy and interesting to follow along. I definitely recommend this class: the workload is easy and the teaching is incredible.\nWorkload:\n2 papers, one easy/one hard (both 4 pages), and a final. NOT A BAD READING AMOUNT!\n"
        },
        {
            "course_name": "Deep Sea Thought",
            "review_date": "March 31, 2004",
            "review_content": "\nThis man is brilliant. I am not saying this because I'm doing particularly well in the class. I'm not. He's a tough grader. But I promise that it will be one of the most worthwhile courses that you'll have taken at this school. He is a full time Columbia Law professor with a dual appointment in the undergraduate english department, and for that reason alone he's amazing. His lectures are peppered with discussions as well, which makes it easy and interesting to follow along. I definitely recommend this class: the workload is easy and the teaching is incredible.\nWorkload:\n2 papers, one easy/one hard (both 4 pages), and a final. NOT A BAD READING AMOUNT!\n"
        }
    ]
}