{
    "prof_info": [
        {
            "prof_name": "Michael Hogan",
            "prof_id": 2526,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Stochastic Processes: Applications I",
            "review_date": "January 15, 2014",
            "review_content": "\nThis class was a breeze because of the TA Xuan Yang--he literally did every homework problem on the board during office hours. On top of that, there were no exams, so the class was a pretty easy A. However, I did not learn that much...\nHW was usually 3 or 4 questions, some with multiple parts. Lectures were alright--kinda boring but at least he's speaks english. He often lectures by writing on the board.\nThis class was a breeze because of the TA Xuan Yang--he literally did every homework problem on the board during office hours. On top of that, there were no exams, so the class was a pretty easy A. However, I did not learn that much...\nHW was usually 3 or 4 questions, some with multiple parts. Lectures were alright--kinda boring but at least he's speaks english. He often lectures by writing on the board.\nWorkload:\neasy but you might not learn that much\n"
        },
        {
            "course_name": "Probability",
            "review_date": "September 09, 2011",
            "review_content": "\nHe is a smart guy that knows his stuff. The explanations were fine but sometimes went over math that wasn't in the prereqs. Calc 3/4 and linear algebra would've been helpful here.\nAt the beginning of the course, he warned that the second half of the semester is different and usually harder than the first half, which I found to be true. He also included two or three lectures that discussed advanced topics that probably wasn't covered in the 3105 class.\nI didn't need R for the class, I got by with Excel just fine.\nWorkload:\nmidterm, final, weekly homeworks which were harder than the midterm and final.\n"
        },
        {
            "course_name": "Probability",
            "review_date": "September 06, 2010",
            "review_content": "\nThis class was pure misery. \nSome professors know the material well but struggle to explain it well. Professor Hogan is not one of those professors.\nI stopped counting the number of times he would make mistakes and then correct himself a few minutes later. Because the class moves so fast, this means that you might have to cross out two whole pages of notes because of a mistake that he corrected a few pages earlier. My favorite was the time that he started to derive one theorem and then accidentally switched to another mid-proof.\nThese mistakes are made worse by the fact that he has invented his own psuedo-notation. It's really just a shorthand, but he never explains it, so you have to pick it up as you go along. Between this made-up notation and the incessant mistakes, my notes were essentially useless. \nThe textbook isn't much better. The examples in the textbook are oftentimes special cases which don't apply to any of the homework problems, so you're left to stumble around on your own.\nAlso, he never mentions this, but you should know how to use R for the class. I can't imagine doing some of the problem sets with Excel. (I'm not even sure if some of them CAN be done with Excel). Since most of the students in the class are graduate students, \nGrading: Hogan explained the curve on the first day of class. About 49% get an A- or above, and about 49% get a B or B+. Don't be fooled, though. Most of the students are graduate students who are taking only one or two classes, so you'll have to work extremely hard to be in the top half of the class.\nWorkload:\nOne problem set every week, varying difficulty. The midterm and final were easier than you might expect, but they were still very difficult. \n"
        },
        {
            "course_name": "Probability",
            "review_date": "June 06, 2010",
            "review_content": "\nHogan is Brilliant with the material.\nIt is a pretty challenging course, though, especially for people taking probability for the first time. The course is heavy on breadth and includes things, such as, copulas, simulation, and so on.\nThe class is fast-paced. The exams are average in terms of difficulty. However, an A still requires a significant amount of effort, as being in the top 20 percent will mean to compete with people who have taken probability before and are probably very good at it. I was struck dumb not to make it up there, even though I have taken probability before.\n\nWorkload:\nMid-term, Final, Weekly Problem Sets\n"
        },
        {
            "course_name": "Probability and Statistics IEOR 4150",
            "review_date": "May 13, 2006",
            "review_content": "\nVery nice man, and he makes some funny jokes in class.  However, this class is incredibly difficult.  There are students of all ages, including graduate students.  Every test I would walk out feeling like I've never bombed a test so badly.  Nonetheless, he gives nothing lower than a B unless you do absolutely nothing.  Going to class is a waste because it makes no sense.  Might as well teach yourself from the textbook.  This class is a requirement for a lot of people, but don't be prepared for a walk in the park.  Very difficult material.  All the tests are open-book though.  Don't do what I did and not study because it's open-book.  That will bite you in the ass.  The first test is easiest so take advantage of it to raise you average.  If I had studied the whole semester, I might not have had such a problem, but I only studied for the last midterm and final.\nWorkload:\nWeekly Problem Sets (40%), two midterms and final (20% each, open book)\n"
        },
        {
            "course_name": "Probability",
            "review_date": "August 17, 2005",
            "review_content": "\nI think the material is difficult no matter how you slice and dice it (no pun intended), but he is really sincere and patient in explaining the concepts if you go up to him after class or go to his office hours.   I do agree though that the grading system seems somewhat arbitrary, and the take-home midterm was more than difficult (the no -help/work independently rule is complete bull).   Since he's teaching the course again next semester, I would suggest padding the homeworks much more so people can follow along better over the course of the semester.  \n"
        },
        {
            "course_name": "Probability",
            "review_date": "July 30, 2005",
            "review_content": "\nok, so the previous reveiwer is rather accurate.  Hogan does tend to confuse people in class.  But, to be fair, during office hours he is more than ready to explain things over.  He even gives out his phone number to people who cant come to his office and he explains the problems over the phone.  When i went to office hours he explained the concepts thoroughly.  So, he does care, but is still learning the ropes.  Last semester (spring of 05) was his first time teaching, so cut the guy some slack.   He looks to the class for suggestions, and actually LISTENS.  Also for any of you interested in finance jobs, he worked at morgan stanley in fixed income research before he came back to teach.  He was more than ready to talk about it with me although dont expect anything more than information (ie dont take the class to get contacts at morgan stanley)\nWorkload:\nmultiple guess final with a funky sat-like grading system  (less points if you get it wrong than if you leave it blank) and two midterms, one take home\n"
        },
        {
            "course_name": "SIEO 4150",
            "review_date": "May 10, 2005",
            "review_content": "\nOne of the worst teachers I've had at Columbia.\nThe course isn't too hard though.  You can learn it mostly out of the book.  All exams are open book.  One of them is take home.  He curves very nicely.  But, like I said, he can't really teach, and usually just confuses people when he talks.  I didn't go to class the second half of the semester, because I simply couldn't stand his lectures.   The solutions that he posts for homeworks are horrible.  They don't give any inkling as to what's going on in the problem.  He also communicates very poorly about when the tests are, when the homework is due, etc.  And, he's kind of incometent with courseworks, so some handouts he gives in class get posted but others do not.  If you want to enjoy probability, don't take this course.  But if you're looking more to slack off and just get through it, this is probably the one to take.  \nWorkload:\n2 Midterms, 1 take home and both open book.  Final.\nHomeworks every other week that can help you only.\n"
        }
    ]
}