{
    "prof_info": [
        {
            "prof_name": "Saskia Ziolkowski",
            "prof_id": 1873,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 29, 2007",
            "review_content": "\nAbsolutely one of the greatest profs at Columbia. She is patient, funny, engaging, and a very good dresser. Her discussions would always be laid back and casual. She also schedules the most amazing class trips, one of them including a class outing to the IMAX to see 300. Though her grading can be a bit rough at times, she is ultimately fair, especially when you take time to speak to her at office hours. In contrast to other Lit Hum sections, Saskia does add some added works of her choice such as the Golden Ass, but I have to say that her choices are also the most entertaining out of the literature we read throughout the semester.\nWorkload:\nSame reading as every lit hum class. 2-3 papers : ususally 1 comparison, 1 creative, and 1 close reading (4-6 pgs each). \n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "June 28, 2005",
            "review_content": "\nSaskia was absolutely amazing. She was very clear, thorough, easy to understand, and made learning italian so easy I felt I was practically learning by osmosis rather than hard work and sweat. She was always very inclusive of everyone, and showed interest in every single student. My only question is....why has culpa yet to give her a big gold star??\nWorkload:\ntypical. weekly writing assignments of ~150 words. lots of labs and workbook assignments which are tedious, but department-wide. Tests were fair. If you know your stuff, you can definitely earn excellent grades.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "May 15, 2005",
            "review_content": "\nAll the reviews are right on - Saskia is incredible! I've never had a teacher who was so nice and yet such a good teacher. Excellent sense of humor, really kind grader, and really teaches Italian. She speaks only Italian, and very very rarely and reluctantly uses English if necessary (like 3 sentences a week) and then switches immediately back to italian. Plus, she's utterly adorable and has a very good sense of style. \nWorkload:\nSame as described by the other reviews.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 11, 2005",
            "review_content": "\nSaskia is without a doubt the greatest human being on Earth, and if not Earth, then the Columbia Italian department. She is sweet, sympathetic, doesn't hate you if you are incredibly stupid, and doesn't hate you if you speak in sentences that contain 8 English words and 1 Italian one. She is super lenient about compositions and homeworks, and will ALWAYS understand if you are way too busy and couldn't do lab.  Class is almost NEVER boring, because Saskia plays songs and has us make up excersizes to write on the board.  It's basically like playtime and Italian all in one. I love her class, everyone should have Saskia once in their lives.\nWorkload:\nTypical language workload--Very time consuming. Saskia has no control over it, it is the usual departmental endless cycle of workbook, composition, lab, quiz, workbook, composition, lab, quiz.  There is a midterm, final, and oral exam, all which she grades generously.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 12, 2005",
            "review_content": "\nIf I were you, I would take Saskia's class in a heartbeat!  She is an incredibly gifted professor with the warmest smile, amazing organization, a knack for language, the coolest boots, and an apparent passion for life and for teaching.  The last day I left class I said \"ti amo\" -- \"I love you\" in Italian -- because the truth is that I do love Saskia, along with the rest of our class.  I looked forward to her class everyday and was often shocked when the class was over because it seemed so short!  She held our attention from beginning to end, filling the 50 minutes with her interactive teaching, music, fun etc... The truth is that, until Saskia, I did not realize that I could form so many honest smiles while simultaneously learning so much!  At the end of the semester, I went from a bland and boring Latin scholar who could not hear or speak any modern language to an enthused and qualified Italian student!  GRAZIE SASKIA!  You work wonders and make me contemplate whether I should be a teacher too!\nWorkload:\nNot too strenuous... just right for an introductory course.  Lots of bookwork, a quiz once a week, 5 short compositions, a weekly lab (which replaces Friday class!)\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "November 26, 2004",
            "review_content": "\nI looooooooove Saskia!!!  Her class is great:  fun, fast-paced, and enlightening.  She is always moving around, trying her best to make sure you understand what she is trying to explain.  She speaks only Italian from day 1, but it's extremely helpful in regards to pronunciation and comprehension.  I know that I speak on behalf of my entire class when I say that we enjoyed coming to see her Monday through Thursday AND that we actually established a good foundation in the language.  And to prove it - most of us are signed up to take Elementary Italian II with her again!  I myself arrived at L course sign-up 3 hours in advance just to make sure that I would be in her section next semester.  If you are truly looking to learn but also want to have a good time, visit Saskia!\nWorkload:\nWeekly workbook, listening lab, and quiz.  Occassionally short 100-150 word compositions.  Midterm: cummulative, same length as weekly quizzes.  Final: 4 minute oral and cummulative exam.  She is very lenient and understanding - we're usually very good about doing everything on time because we feel so bad taking advantage of her kindness!\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "September 06, 2004",
            "review_content": "\nI definitely agree with the other review.  Everyone in our class adored Saskia, so much so that we bought her a gift certificate at the end of the year to show our appreciation!  She is very personable,and explains italian grammar and vocab in an extremely clear way.  Her class is relaxing (not intimidating, like some language classes), yet we all received a very strong foundation in italian.   If you can take her section, don't pass it up\nWorkload:\nSmall assignments throughout the week (workbook, lab, short essays). Nothing too time consuming or painful (try not get behind though).\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 19, 2003",
            "review_content": "\nsaskia is absolutely the best.  her classes never drag and she has a terrific sense of humor, not to mention a terrific style of teaching!  if you can figure out which section of italian she's teaching, sign up immediately--you won't be disappointed!  she's extremely fair in grading and understanding about deadlines and you'll actually come out of classes having learned something\nWorkload:\nstandard intro language stuff--workbook, labs, weekly quizzes\n"
        }
    ]
}