{
    "prof_info": [
        {
            "prof_name": "Thomas Campbell",
            "prof_id": 10156,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 22, 2015",
            "review_content": "\nTom was such an awesome, engaging, interesting, and chill professor. I have very little experience with art/art history but Tom made me so interested in what we were learning about, and his class was my favorite course of the semester. He is an extremely fair grader and has a great sense of humor. \nThe reviews below literally sound like they are written about a totally different person--Tom is great. I enjoyed his class so much and I'm so glad I didn't listen to the other (completely wrong) reviews he's gotten on CULPA. Take his class!!\nWorkload:\nMidterm, final, a few papers, and standard art hum readings.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 06, 2012",
            "review_content": "\nWhile the review below may seem over dramatic, I have to agree with its overall message. Tom Campbell was indeed a bit of a diva.\nAt first I thought I was going to really like the class. It was discussion based and he did a good job of encouraging most people to speak. It seemed really laid back and chill--exactly what I wanted from an Art Hum class.\nBut then it took a turn for the worse. Campbell missed probably 6 sessions in the semester. This meant not rushing but skipping many important artists. This almost defeats the purpose of Art Hum altogether, a class that is based on seeing how artists work off each other. Campbell, in a noble attempt to promote discussion, would agree with anything anyone said. Sexual themes in the Renaissance work? Sure! Why not? Disgust for commercialism in Monet? Of course that's valid! I felt as if we were getting away from what the artists actually wanted to convey because of his interest in everyone speaking. Soon people were thinking depictions of David and Goliath were supposed to be charged with sexual connotations. \nThen there was the grading. Campbell's feedback on the papers was confusing. I spoke to my classmates to try to decipher what he meant but none of us could see how to improve. After seeing him during office hours, I did exactly what he suggested in my next essay but to no avail. Look. When a student goes into see you during office hours and you give a suggestion and she does it, you are supposed to bump her grade up at least a little bit.\nPerhaps most telling, when I went to talk to him about preparing for the midterm he mostly rushed me and seemed like he wanted to get the hell out of there. Finally, frustrated, he told me \"it's just Art Hum okay. You're taking it way too seriously.\" Disinterested, and confusing. A class by Tom Campbell\nWorkload:\nLots of readings, but nothing terrible. A few essays, an in class midterm and a take home final.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 05, 2011",
            "review_content": "\nGet me out of this section!!!!!\nWhat a diva! And z-lister! HORRIBLE LECTURER, does not post powerpoints, makes you read wayyyyy too much for class about random background about artists (which he will not touch upon/explain) and expects you to know random knowledge to regurgitate for class/midterm in class. 10 minutes for dual visual analyses? Parthenon versus Amiens? Really? I'm not an idiot, but I think that's pointless and a waste of time to dedicate 10 minutes to compare the two. Kept on resending PPT of images to know for midterm \"image carousel\" and really not on top of his little effort needed to put into the class. Didn't even show up to administer his midterm, or explain why he didnt't! (Another doctoral student came to give it.)\nPaper grading/responses is ridiculous. The first one was on the Elgin Marble Debates -- should Greece retain the statues or not? Ummm...that's not what the goal of Art Hum is about...and he basically wanted us to regurgitate the Jannette article back to him. \nSeriously, if you are a PhD student here at Columbia, learn to post basic stuff on courseworks, and show up for exams. And don't ask your section to meet AT THE MET for the class fieldtrip..instead of meeting on campus and leave from there. Everyone definitely will teleport there at the same exact time...WHAT ARE YOU THINKING?\nWorkload:\nStupid readings. \nMidterm -- regurgitate everything you know in an hour?\nShort papers -- horrible grading/reasonings for criticism.\n\n"
        }
    ]
}