{
    "prof_info": [
        {
            "prof_name": "Daniel Walsh",
            "prof_id": 2345,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Waste Management",
            "review_date": "March 11, 2005",
            "review_content": "\nProfessor Walsh is very kind and always well prepared for class.   I got much more out of the lectures than the last reviewer.  First, many of the assigned tasks did require you to apply the course material.  The lectures were useful as they gave a great deal of perspective on (solid) waste management methods and crises.  Who knew that the newest landfills don't even last 30 years?  The last lectures, after the practical modules were the most useful.  The failed Brooklyn Navy Yard mega-incinerator, superfunds and brownfields lectures gave a great deal of insight into environmental politics and New York's politics and redevelopment.   As the Chief of Superfunds (and maybe Brownfields) for New York, along with some other positions, Professor Walsh has a lot of practical lessons to give, much more I find than a career academic, less familiar with the industry/field.  Professor Walsh sanitizes any potentially complicated science, so no background is necessary, only interest.  This class is worth it.\nWorkload:\nsee last review\n"
        },
        {
            "course_name": "Waste Management",
            "review_date": "December 29, 2004",
            "review_content": "\nWalsh's class presented an interesting look at waste management through the lens of NYC (since he is the head of the Dept. of Environmental Conservation for the City).  He is knowledgeable in his field and eager to share it with the students.  The course organization is interrupted by a 4-5 week series of group projects which are fun but tedious because it is so hard to get a group of 3-5 students together to work on them.\nWalsh's powerpoints are detailed, but he offers to email them (although most were received on the last day of class) to students so notetaking becomes obsolete and interaction is minimal.  Furthermore, they are only of importance if you choose to write your final paper on one of the topics discussed, and even then he wants the research to be done through the NY Times database.\nAlthough I enjoyed class, I felt as though I didn't get enough out of the material because there was limited opportunity to apply it.  Walsh's class is interesting, pretty easy (especially for a 4 point seminar), and won't occupy too much of your time.\nWorkload:\n4 or 5 projects w/ 10 minute presentations, only one of which you will be held accountable for as the GROUP LEADER.\n7-10 page final paper based on NY Times database research and a 5-8 minute presentation on the paper.\n"
        }
    ]
}