{
    "prof_info": [
        {
            "prof_name": "Tamar Ben-Vered",
            "prof_id": 128,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "September 05, 2005",
            "review_content": "\nReally a sweet woman--impossible to get to through e-mail, but an easy grader who honestly wants every student to learn to love the language. an easy 4 points, and i really feel like i have a grasp of the language conversationally.\nWorkload:\ndaily homework (usually takes under 5 or 10 minutes), a few quizzes and an easy midterm and final that were more like tests themselves--no memorizing vocab--really only grammar is tested\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "February 21, 2005",
            "review_content": "\nTamar takes a bit of getting used to - mostly the students getting used to her very specific, old-school ways of doing things - but once trained well, this can be a very enjoyable class.  The size (small) combined with the fact that there's only one section (so you end up with the same people for up to two years) creates a very warm, amiable atmosphere in the classroom, and Tamar facilitates this with her unexpected bouts of humor, interrogation (in hebrew) about random aspects of your personal life, and mild-mannered teasing.  She's a good and caring person who teaches wonderfully without pushing the students too hard.  Just try to be on time for class, do your homework, and resign yourself to her quirky and not always totally efficient style, and you'll do great.\nWorkload:\nPretty light - about half an hour of easy homework every night, and a few tests and quizzes per semester.  Not a whole lot of work for 4 credits, although you are expected to know (or learn on your own) the Hebrew alphabet (just print) within the first week of class.\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "January 02, 2005",
            "review_content": "\nTamar is adorably irritating; she's got her way of doing things and nothing else will suffice. Also seems to have some sort of hearing impediment, but she's definitely got a good sense of humor. The class is early (9AM M-F) and you get an evil-eye chastising if you're late or miss class: that is, she might ignore you or not answer your question or something. Regardless, she is truly one of the \"old stock\"- you can't email her or any of that technological nonsense. She truly cares about her students and wants you to do well. Tamar isn't out to get anyone... she's just got her way of doing things and you'd better [want to] go along for the ride.\nWorkload:\nAlmost always nightly homework (which is duly collected and corrected), no midterm, a few quizzes and a final, and one not-even-five-minute oral reading session thing. very reasonable, and she is generous with days off for the jewish holidays.\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "December 08, 2004",
            "review_content": "\nThe pace of the course is pretty slow, sometimes maybe a bit too slow.  It's way too early in the morning, but if you can get over that, then it's not so bad.  She can be very annoying, especially when she totally ignores the fact that you just asked a question.  Overall, the course is pretty easy, nothing challenging.  Try to pay semi-attention in class, otherwise she'll start bothering you.  Really, it may be annoying, but it's pretty easy.  \nWorkload:\nnightly homework, but always short.  a couple of random quizzes that she won't tell you about until a day or two before.  no midterm. final.\n"
        },
        {
            "course_name": "Upper Intermediate Hebrew II",
            "review_date": "November 15, 2004",
            "review_content": "\nTamar is hilarious. The event that best describes her occured when a student was late to class (it was slated for 10-10:50 and he arrived at 10:07) and she congratulated him on his progress, as he had arrived at 10:10 the day before, she said at this rate, he'd be on time in a few more days. She is very cute, and always chipper, an Israeli of the old school.\nClass is mercifully short (only 50 minutes) but she fills it with LOTS of grammar, and not as much vocab as one would hope. The class had a broad cross-section of experience and ability, which added to the challenge of teaching us, but Tamar seemed to do well, and cared about your individual progress, requesting private meetings when she felt that there was a concept that needed to be explained, but she didn't want to waste the classes' time.\nWorkload:\nOccasional homework, which are graded hilariously as \"tov-, tov, tov+ and tov me'od\" a few tests which are graded easily and a final.\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "February 21, 2003",
            "review_content": "\nReviewer who had such a problem with Tamar probably was just a student who didn't do any of the work or never came to class.  Slow pace of class actually helped us learn something without having to be overwhelmed by anything.  Sure, getting to class at 9 is tough, but that's not Tamar's fault, and she's not a stickler for attendance, as long as you're mostly there and paying attention.  She knows, however, when you're learning or when you're totally slacking.  Don't screw around with her.\nWorkload:\nHomework, always collected, nightly.  Periodic quizzes and tests, but nothing hard or unexpected if you came to class and did the work.  Easy final.\n"
        },
        {
            "course_name": "Elementary Modern Hebrew I",
            "review_date": "November 30, 2002",
            "review_content": "\nCharming? Tamar is really annoying and of course, the time of the class does not help (MON-FRI 9:00-9:50). This class was plain and simple torture and goes at a very slow pace. Tamar gives these annoying quizzes on Friday mornings because she knows that no one would normally show up. If you make a habit out of showing up late, expect her to poke fun of you somehow. If you dont take it personal, it's quite humorous.\nWorkload:\nSeveral annoying hw's and periodic tests and a final.\n"
        },
        {
            "course_name": "Intermediate Hebrew: Intensive Grammer review_content",
            "review_date": "December 31, 1999",
            "review_content": "\nA charming old Jerusalemite, Ben-Vered gets the job done.\nWorkload:\nHomework every now and then; Final, no Midterm.\n"
        }
    ]
}