{
    "prof_info": [
        {
            "prof_name": "Paul Anderer",
            "prof_id": 746,
            "total_reviews": 12
        }
    ],
    "reviews": [
        {
            "course_name": "Kurosawa ",
            "review_date": "December 14, 2011",
            "review_content": "\nFantastic professor, fantastic class. This was the best run and most challenging seminar I've taken at Columbia. Anderer is one of the few professors I've experienced (as a senior!) who actually treats his students like peers. Our class was a genuinely collaborative effort to understand Kurosawa, Japanese film, and the Japanese postwar experience. Anderer was extremely thoughtful and caring about our work and basically kept track of the progression of our ideas throughout the semester.\nThis is definitely a professor you should take a class with before you graduate. He cares more about students than 99% of the professors you'll ever have, and he's truly brilliant, kind and funny. He'll take you and your thoughts seriously. When he's standing (sitting, really) in front of a classroom, it's clearly where he wants to be. \nWorkload:\nVery fair. Interesting but brief readings with a 300 word Courseworks response every week. One of the least annoying Courseworks posts I've ever had to do -- it was a genuine discussion board and Anderer printed out our responses every week so we could talk about them as a class. One 10-20 page paper at due at the end of the semester. \n"
        },
        {
            "course_name": "The Supernatural in Japanese Literature",
            "review_date": "January 18, 2011",
            "review_content": "\nProfessor Anderer is intimidating, but I'm so glad I took this class. The readings chosen were WONDERFUL and opened my eyes to some amazing works of Japanese literature -- Akutagawa, Kawabata, Abe, Oe, Murakami, among others.\nProf. Anderer threw around phrases like \"liminal spaces\" often (perhaps all literature classes have a lot of this? I wouldn't know, being in SEAS.), and his lectures were a little hard to follow. Every so often he'd pause for a smirk. Everyone, including me, was scribbling down notes on his rambling lectures, but I barely glanced at them when writing the paper. It's probably best to take down a few key ideas only.\nClass met once a week for two hours, and we had weekly Courseworks postings of a page in length. The only grade was the final paper, which was 10-15 pages.\nAll-in-all, a quite rewarding class.\nWorkload:\nDecent amount of reading; a few novels.\nCourseworks every week, final paper of 10-15 pages. Doable.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "January 07, 2011",
            "review_content": "\nProfessor Anderer is a nice guy and he's extremely helpful, but sometimes disucssion dragged on a bit. Each class we discussed one book/text and at times, it felt like the students needed more context but he just wanted to discuss for two hours straight. That being said you cover a lot and it's really important to know this stuff if you're going to understand East Asian cultural references, so take the class. \nI found his grading to be fair although a little on the tough side. He's the kind of professor who gives out a lot of B+s but not so many As. \nI recommend the class, although the students are in large part responsible for how the class goes, if people are talkative it'll be great, if not, it can be a little dry. \nWorkload:\n1 book a week. 1 midterm paper, 1 final paper, 1 final oral. Not too bad, stay on top of readings. \n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "January 20, 2010",
            "review_content": "\nMr. Anderer truly cares about his students, and it's hard to say anything bad about a teacher like that. This being said...his classes can sometimes be boring, but I think it all depends upon the students in the class and their contributions to the discussions. The readings are all enjoyable and varied enough so that you don't get too bored by Asian literature. He does tend to talk past the end of class...which is more funny than annoying.\nAbout grading--I think Mr. Anderer is a tough grader but it's more like tough love. He will give you the grade he thinks you deserve, and if you have a problem with that, you can take it up with him and he'll certainly guide you in the right direction. He is not too stringent on quantifying your final grade by scores, but rather in the cumulative quality of your work (so if you don't get a good first essay grade, you have time to redeem yourself).\nHe also hosted a dinner at his house during my semester, which was very very nice. His wife is a lovely person and they both truly care about Columbia students and what we gain through our educations.\nWorkload:\nWeekly postings, LOTS of reading, and an oral final. Very nice courseload, and good credits!\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "October 17, 2009",
            "review_content": "\nOne of the best courses and professors I've ever had. The material is very good and Anderer's discussion flows pretty fast. Sometimes delves into a more lecturing style for the denser texts, thereby preventing a lot of  confused discussion. Try to take him if you can. \nWorkload:\nReading is fun and doesn't seem like a burden. Only gets somewhat lengthy a couple of times in the semester, but Anderer is good about spacing the longest stuff out over breaks and long weekends.\n"
        },
        {
            "course_name": "Japanese Literature and Film",
            "review_date": "September 02, 2004",
            "review_content": "\nAh. This class was truly a joy to have for my Major Cultures requirement. Professor Anderer's syllabus choices are excellent, with truly interesting individual selections in books and movies that also work together nicely for overarching themes in modern Japanese culture. When taking this class, note the tricksy necessary Thursday night movie viewing session that takes place roughly from 6:30-8:30 pm. While at first appearing to be a major drag, the movie nights were actually enjoyable and a really nice way to kick off my weekend--so swallow your pride, nothing worthwhile on Thursday is *really* going on at 8:30 anyways, you may as well be watching an interesting Japanese movie on a big screen for a class. Although Professor Anderer has a tendency to dwell on the inane--I recall entire class lectures that gently wander off into the  abyss of his consciousness, dwelling on one sentence or minor scene of a novel for ungodly amounts of time. Also, while welcoming class commentary, his lecturing style isn't really that receptive to incorporating new theories. The continuous lecture dives into inanity made it clear that Professor Anderer is simply waxing on books and movies that he genuinely finds fascinating--which makes for such an interesting class, it's worth taking that slightly trippy mental road into the recesses of his mind. The style could spell potential doom for less interesting professors, but with Professor Anderer, it's never a problem.\nWorkload:\nWorth every drop of effort. 1 novel per class (usually fairly slim, always interesting). Mandatory movie screenings on Thursday nights with similarly mandatory coursework postings regarding your deepest intellectual thoughts regarding the movie due every Monday at noon. The midterm and final were both take-home essays, which is priceless. Anderer is a fair grader who awards deep thinking, but awards directly transcribing his own tangential stream of thought more. If you build the A, it will come.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "December 15, 2002",
            "review_content": "\nAnderer is absolutely the most kind, wise, understanding, and motivating teacher. Though previous reviewers have managed it, I cannot think of one aspect of his teaching with which I found fault; take this course if you love learning, sharing your ideas, and East Asia - in fact, take this course regardless - his passion for the subject matter, and for teaching would inspire any student.\nWorkload:\nTwo papers and a take-home final. Directed in their focus, but very reasonably graded. Readings (magnificent) and online postings. All worth your while.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 22, 2002",
            "review_content": "\nHe was nice enough, and certainly smart, but I couldn't get past his blank stare or his 10-minute rambling monologues. He was unresponsive to student input, opting rather to just talk and talk...and talk. His grading was a little too severe. I felt that he graded my papers a little too harshly (sure, I'll admit to writing some B papers, but they definitely did not deserve C's), and wasn't helpful when I went to him for guidance. He certainly wasn't the worst teacher I've had; he was overall a mediocre teacher.\n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "March 02, 2002",
            "review_content": "\nPaul Anderer was one of the best professors I've had at Columbia. I think he was a bit too lenient on students who quite obviously didn't do the readings and made nonsense comments nonetheless. But he is a master in leading seminar discussions. He listens and considers students' points very carefully and works very hard to generate a good discussion. One problem I've had with this class (and this is not necessarily attributed to Anderer) is that I don't feel like I've taken anything really substantial out of the class. It was more like a whirlwind tour of various texts and ideas in Asian history, but it was done so carelessly by lumping so many different historical and cultural traditions under the title \"Asian\" that the course kind of contradicted its main purpose. Moreover, writing now about one year after I took the course, I feel that I've forgotten many of the ideas in these texts. But despite this, Anderer is an excellent person to work with, and I highly recommend him.\nWorkload:\nThree short papers. Voluntary short presentation on texts (like 5 mins, really short).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 14, 2002",
            "review_content": "\nI've heard lit hum horror stories, but thank god for Paul Anderer! At the beginning, I would slack and not do the readings (who had time to read Thucydidies???). But because the class is so heavily focused on discussion and discourse, I would feel uncomfortable not having anything to say. Plus class participation is big in this class. Paul Anderer has that influence on you. He's supremely intelligent, and obviously knows quite a lot about the subject (he only teaches the fall semesters), yet he'll allow students to discover things for themselves. He's great at starting discussions, pulling the right comments and forging them into great discussions, and he won't ever make you feel bad. He's very open to differing opinions. He's timely in getting the papers/midterms/finals back and he also knows everyone's name by the second class. He's also very accessible during office hours. I would say if you get this man as a teacher, thank your lucky stars you've just been offered a blessing. \nWorkload:\nDo the readings, midterm (much like the final but easier), standard final. He requires four 3-4 page papers. \n"
        },
        {
            "course_name": "Colloquium on Major Texts",
            "review_date": "November 23, 2001",
            "review_content": "\n\"How to put it?\" Anderer may seem a nice enough guy, but something about his blank stare and unending (perhaps related to the subject at hand??) babble-ogue leaves me wondering about his pedagogy. The man can talk, but can his students follow? If he isn't sounding like a regurgitation of the foremost synoptic analysis of any of the East Asian Classics you read, he is leading- always leading- the discussion to a dead end. Anderer's expectations of your writing ability are high (grades reflect this), so if you feel pangs of torment reminiscent of L&R;, don't be too surprised. If you can, take it from someone who encourages more student participation, letting the interesting works lead the class; like Wei Shang from what I hear.\nWorkload:\nOne time presentation of a work; 3 essays; take-home final. It's a colloq.- of course there is a lot of reading.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 11, 2001",
            "review_content": "\nI've heard about other Lit Hum teachers, but I like Anderer so much that I don't care about the others. While his lectures are somewhat orchestrated, he cares alot about what you have to say. He had all our names memorized by day 2, even the kids that don't talk. Very understanding about the work, he tries to help you if you wrote a bad paper. I can bet his Japanese lit and film class is just as great.\nWorkload:\n4 papers, midterm, final. CLASS PARTICIPATION.\n"
        }
    ]
}