{
    "prof_info": [
        {
            "prof_name": "Jennifer Punt",
            "prof_id": 12941,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular Biology",
            "review_date": "June 12, 2015",
            "review_content": "\nIf you've worked in a research lab before and want to understand the basis behind a lot of the techniques you've been doing (DNA extraction, ChIP, PCR), you should definitely take this course. \nJenni Punt is a fabulous lecturer, also one of my favorite's in the Bio Department. She's genuinely interested in having her students come to understand the material and her approach to learning isn't just stuffing you with textbook facts from Alberts but also includes placing certain scientific advancements in their historical context and discussing experimental applications of these techniques. \nUnfortunately for Jim Manley, he has to teach the second half of a class already bedazzled by the wonders of Jenni; that's probably why I think many of us find him to be *a tad* more uninteresting. While Jenni covers DNA, Jim's work is on RNA, and his lectures mainly involve copying/pasting figures from Albert's (and occasionally from other sources) onto the powerpoint. I found his lecture slides to be entirely incomprehensible without attending lecture, so be sure to do that. His pacing can be erratic, as some topics take unnecessarily long for him to unpack, and he breezes through other things (like rRNA processing) which did end up becoming an exam question. \nBoth Jim and Jenni also love asking those \"pondering\" questions that involve class contribution...I found them to be quite enlightening, as they helped me see many different approaches to a particular problem, even though they oftentimes may have been looking for a particular answer.\nBottom line—this class is definitely worth taking, and I believe it was curved quite well. No reason to not succeed if one keeps up with the material, as is the case with any other upper level bio elective. \nAlso, Darpan and Leila were both fantastic TAs and deserve a shoutout. \n\nWorkload:\nJenni's section: 2 exams worth 35% each. 3 challenge questions that amounted to 10% total. PowerPoint presentation worth 10%. Short paper worth 10%.\nJimbo's section: 1 exam worth 33%, plus a cumulative exam worth 67%. Don't fuck up the cumulative exam. \n"
        },
        {
            "course_name": "Molecular Biology",
            "review_date": "May 29, 2014",
            "review_content": "\nMol bio had new professors this year, and I felt it to be really different compared to what I'd heard about from students last year taking it with Profs. Prywes and Jia. First off, Jenni is a STAR. It's clear that she cares a lot about actually teaching and making sure that we are learning material that not only encompasses substantive information but is also of utility. The way she taught incorporated new research and experimental problem solving paradigms that were challenging but also potentially useful beyond just the classroom. It made the class that much more engaging and really helped in digesting the material, which I imagine might otherwise have been quite dry. She also was very responsive to student feedback and willing to help where she could -- all around great.\nThe second half of the semester is taught by Jim, and focused primarily on RNA biology, which is his area of research. Jim's lecturing itself was pretty clear (although the organization of the material between lectures was sometimes a bit confusing), and he did a pretty good job of covering a broad array of topics rather than focusing on just his research interests. However, the focus of the second semester was largely on the details of RNA rather than thinking through research problems or extended analysis. The tests basically just asked for regurgitation of specific details and never looked at integration or the big picture. In his defense, he tried to correct for this a bit in the final, where there were some more research design-type questions, but I think the way he teaches the course doesn't necessarily lend itself to encouraging that style of thinking.\nIn general, I thought this was actually a pretty good course as far as the bio dept goes. I feel like I learned a decent amount, especially with regards to thinking about bio research and keeping up to date with what's going on. If they're teaching it again next year, I'd definitely recommend.\n--tl;dr--\n9/10 would take again\nWorkload:\nFor Jenni's half: 5 pop quizzes, 2 paper questions, 2 midterms (equally weighted). For Jim's half: one midterm (1/3), and one final (2/3). None of the exams were cumulative over more than the material covered between the last exam and the current one. Reading, etc. wasn't anything out of the ordinary for a bio class here.\n"
        }
    ]
}