{
    "prof_info": [
        {
            "prof_name": "Maxwell Uphaus",
            "prof_id": 11650,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 07, 2015",
            "review_content": "\nI took Lit Hum with Max and had an average experience. Max welcomes open discussion and allows students to steer the focus. He encourages dialogue amongst students for long periods of time before interjecting with his own interpretation. Unfortunately, his insight into the text was uninspiring and fairly banal- often not easy to follow either. He is pretty easy going and welcomes a sense of humor but he also forces the academic persona, which can lead to aforementioned pontifications. Pleasant to meet with one-on-one. Fairly chill dude but not going to inspire most.\nWorkload:\nThree 4-page papers, two reading quizzes, weekly blog write up (200 words), Midterm, Final. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "June 27, 2012",
            "review_content": "\nA terrible teacher. Didn't learn anything in his class. He's boring and has no passion for anything in the class. Uwriting isn't supposed to be the most exciting class ever, but there are some interesting conversations that can be had, about the essays, or writing in general, or whatever... But we didn't have any with him. If we did, nobody in the class realized because they were first put to sleep by his dull voice and slow-paced monologuing. Sometimes, it almost felt like he was writing out what he spoke, and was so worried about misspeaking or about not saying the perfect word, that he would take FOREVER to finish one sentence. \nNot to mention, he says \"umm\" every three seconds. I usually don't mind this. I say umm, everybody says umm. But once I noticed how often he said it it was impossible not to be annoyed by it. I once tried to count how many times he said it in a class. I got tired of counting after 5 minutes, but I had counted 27 umms. You do the math for a 75 minute class.\nHowever, this would all be fine if he were a nice guy. If he were someone who, ok, weren't the best teacher, or were just a little nervous, fine. What could he do? But that's not it. He's also an ass. He assigns a TON of homework that he doesn't ever comment on or get back to you. And he's a harsh and inconsistent grader. \nTo put it plainly, he's one of those typical insecure grad students who, to make up for their ineptitude as teachers, blame their students when the class isn't going well.\nHe sucks. His class sucks. Change your uwriting section.\nWorkload:\n4 essays, 25%, 25%, 30% and 10%, with a 5 percent boost on the best of the first three and (supposedly but it's bullshit) a 5 percent boost if there's \"outstanding\" participation.\nAlso, I forget the absence policy, but I know that every time you come late it counts as half an absence. And it's a core class so you can't have many absences to pass the course...\n"
        }
    ]
}