{
    "prof_info": [
        {
            "prof_name": "Latha Venkataraman",
            "prof_id": 3737,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Electromagnetism",
            "review_date": "May 07, 2012",
            "review_content": "\nThe course uses a great text by Griffiths, \"Introduction to Electrodynamics\"\nLatha is well known for being a GPA killer, but I wouldn't say she's all bad. She's more than willing to help you if you put in the effort and respect, i.e. show up to class, ask questions and pay attention. She won't fail you if she can see you've done your homework and have made a serious attempt to understand the material. That being said, she also has a historical curve for the courses she teaches. That means if you are below the curve in a \"smart\" year you might not be doing so bad but if you are on the curve in a \"dumb\" year, you're screwed (as is the rest of the class). Supposedly she failed two students last year and handed out 5 C's.\nThe workload is hard, mostly reworded problems from the book. You can go to the solutions manual if you want easy answers but you're going to eat shit on the exams. Since HW is not such a big part of the course grade, doing well isn't important. In fact, if you are not doing great on the HW it's probably a sign you're actually doing it yourself and it will show in your exam grade. This is a great course; lots of material to cover but all very interesting and it will often times leave you pondering the world around you.\nThe last few weeks this year were very rushed and we covered a little more than 3 whole chapters (4 partial chapters) in about two weeks. Keep up with the reading and examples in the book; it will do you good. If you're a good student already, then you know the drill. If you've been pissing away your time here at Columbia by taking 1400 and getting wasted every weekend as an an Applied Physics major, then you're in for a world of hurt come this course.\nWorkload:\n1 Problem set/week. Some speciality topics related to Professor Venkataraman's research.\n11 HWs worth 15% of your grade. 2 Midterms worth 20% each. Final exam worth 40% of your grade and 5% freebie points for putting in effort and being respectful.\n"
        },
        {
            "course_name": "Quantum Physics of Matter ",
            "review_date": "January 04, 2011",
            "review_content": "\nBeware of the GPA killer.\nUnfortunately, this class required for all applied physics majors. So most of us have no choice in the matter. There have been some clever chaps who managed to take Prof. Green's course in the college but the app physics department frowns upon this. Still, I would suggest looking for any alternatives to the course.\nFirst, let me get the positives out of the way, she is an ok teacher. She knows her stuff and follows the textbook. She has a tendency to speed through her lectures but with a bit of extra reading before and after each class, you can keep up. The course itself is interesting (from a physics student's perspective) and covers much of Griffiths has in his book. I should also mention that Griffiths is perhaps the best physics author you'll ever come across. That's about it for the positives.\nThe negatives... well just about everything else. Her problem sets are ridiculous and most are a huge waste of time. She loves to choose questions that are algebraically tedious that don't add anything to the understanding of the material. You'll look at a question, take 10 minutes to think of a way to get the solution, work through the problem then encounter an integral that takes you 2 hours to solve. When you are done, you will have amassed a stack of paper so huge that you will need an industrial stapler to fasten them together. The class probably accounted for a several trees in the Amazon. She gets most of her questions from the textbook, so most people end up just using the solutions. I for one am against this but I had to drop this stance when I realize that a lot of these questions had no educational value. \nHer exams are doubly ridiculous. Typically, an exam mostly covers what was covered in the course thus testing how well you grasp the material. There might be a curve ball question or two that stretches our minds but that's fair and it gives the grades a good spread. Latha doesn't believe in this. Her exams tend to be all curve balls, which seek to test what you don't know. She might throw the class a freebie so that people actually get above single digits. The exams are also long and the questions can be confusing. The two midterms had averages in the 40s and mind you, this was a class filled with first year grad students who were mostly taking this class as a refresher for their qualifiers. Seriously, how can you give an exam and have the class, on average, not being able to get half the questions right??? I wonder how she sleeps at night. But wait, it gets better. She doesn't curve.\nGot that? To be honest, I am really not 100% sure how she assigns her grades but I was about a half a deviation about the mean for her two midterms (~50s), got roughly 90s on the problem sets and I was pretty confident about how I did in the finals. In the end, she gave me a glorious C+. So that means she either doesn't curve and uses a fixed scale based on percentages to award letter grades or she curves but to something like C. Either way, I am positive a few Ds were dished out.\nI took Applied Em with her the semester before and about 10 people were in the class. I spoke to about 5 people and the highest grade was a C+. Go figure.\nIn the end, I can say this class forced me to master QM. I am pretty confident about my grasp of the subject but I have absolutely nothing to show for it. Thank you Lantha for ruining my GPA.\nWorkload:\nproblem set every week. Long, very long. (15%)\ntwo midterms hard (20% each) avg. ~40%\nfinal difficulty on par with midterms (40%)\nClass participation (5%) I have no idea what this is about.\n"
        }
    ]
}