{
    "prof_info": [
        {
            "prof_name": "Kay Shimizu",
            "prof_id": 3500,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Chinese Politics",
            "review_date": "December 26, 2008",
            "review_content": "\nI second the review below this one. Although Kay Shimizu is a kind woman, through her teaching it is evident that she is the newest addition to the political science department, and this means dis-organization and ambiguity. She posted slides for each lecture, but the words on the slides were so few that copying them was essentially meaningless. Her explanations of the slides were also incoherent, rendering lectures completely confusing. The only chance you will have to truly understand the material is in the discussion sections, where the TA will pose questions presumably crafted by Shimizu, as all sections answered the same questions throughout the semester. Regardless of her future growth as a professor, now is NOT the time to take Shimizu. I guarantee you that her ambiguous and ever-changing syllabus, combined with the bizarrely specific and random answers for the midterm (which were IDs), you will feel overhwelmingly frustrated. DO NOT TAKE Shimizu.\nWorkload:\nA TON of reading. Form reading groups and enforce clean and clear note-taking, these notes will be necessary for the exams and papers of the class. Grading varies for grads and undergrads. Discussion section for undergrads only (15%). Midterm (25%), very harshly graded (but then curved SLIGHTLY), 10-15 page analytical paper on almost any subject for undergrads/15-20 pg for grad students (25%), and final (35%)\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "December 22, 2008",
            "review_content": "\nKay Shimizu is nice woman but not a terribly exciting lecturer. She is new to the department and recently got her Phd so she is a bit nervous in front of the class, and disorganized when it comes to assignments. The midterm was open book, open notes and open laptop, but then was graded very harshly, all of which was rather confusing. The paper topic was vague and the final was take-home. I ended up learning a decent amount from the class, but that was more because the material was pounded into my head so many times (it got repetitive after a while), rather than because it was enormously intellectually stimulating. All in all, the class was a success in that it taught me about china and fulfilled major cultures, but I was bummed that Bernstein stopped teaching this year.\n"
        },
        {
            "course_name": "Chinese Politics",
            "review_date": "December 09, 2008",
            "review_content": "\nShe's not great, not bad. She's very organized, but her lectures are extremely repetitive, in that she repeats the same concept over and over throughout the lecture and seems to have the same lecture several classes in a row. Every lecture in the first half of the semester, and many in the second half, were about Chinese political economy- the switch from a socialist economic system to a capitalist one. Very important, but this is a class about Chinese politics, not just economy. I would have liked to learn more about the inner workings of the CCP, about the PLA, and especially about Taiwan/Hong Kong/Macao issues. The last two were not covered at all; the CCP internal structure was only covered briefly. However, she did a good job covering the succession from Mao to Hua to Deng, and the beginnings of capitalism in China. \nWorkload:\nA LOT of reading, none of which really needs to be done. Discussion section for undergrads only (15%). Midterm (25%), very harshly graded (but then curved), 10-15 page analytical paper on almost any subject for undergrads/15-20 pg for grad students (25%), and final (35%).\n"
        }
    ]
}