{
    "prof_info": [
        {
            "prof_name": "Xuedong He",
            "prof_id": 10316,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Financial Engineering",
            "review_date": "May 02, 2012",
            "review_content": "\nYou would expect that since Intro to FE is the most important class you will take as a Financial Engineering major and the IEOR department here is supposedly good, this would be a quality course. However, you leave this course with virtually no added knowledge of the subject matter and only knowledge of how to mechanically solve various problems on the homeworks and tests.\nXuedong He is the worst professor I've ever had here at Columbia. Lectures consist of nothing more than him reading directly from the lecture slides in hard-to-understand English. There is absolutely no conceptual reinforcement by him and you are better off trying to read the lecture/book yourself than going to class.\nTo all prospective FE majors, be warned.\nHW 20%\nMT 40%\nFinal 40%\nWorkload:\nWeekly hw\n"
        },
        {
            "course_name": "Introduction to Financial Engineering",
            "review_date": "May 15, 2011",
            "review_content": "\nI shall, henceforth, use 'He' and 'he' interchangeably.\nThis class, combined with this instructor, makes for a complete disaster.\nXuedong He is a nice man, and can be moderately helpful in his office hours. However, it is APPALLING, that an introductory class, to such a specialized field in a department that is apparently reputed for Financial Engineering, is taught by someone who has such DISMAL lecturing skills. He is nervous in front of the class, checks his watch every three minutes, and does nothing in class than mumble for an hour and fifteen twice a week. I would imagine he knows his material, but he does NOTHING to effectively convey it to the class. I may sound bitter; I am. I was excited about studying FE, but this class was a HUGE turn off. I might even switch out of the program.\nBecause of the manner in which the material the presented, it seemed utterly boring and uninteresting. It was only while preparing for the exams that I actually started to enjoy some of it. His lecture notes are good, and so studying for exams or doing assignments can be done entirely by referring to them.\nIf he ever happens to teach this class again, DO NOTtake it with him. If you are forced to, don't bother going to class. \nWorkload:\nTen assignments. Moderately long. Seem more confusing than they are if you haven't been keeping up with class material.\nTwo part midterm which is a combined 40% of grade. Final is 40%.\nExams are fair and straightforward.\n"
        },
        {
            "course_name": "Introduction to Financial Engineering",
            "review_date": "May 15, 2011",
            "review_content": "\nThis guy is an absolute robot in class. His lectures are reading off the slides and occasionally providing very confusing proofs for simple concepts in his broken English. His slides are very logical and he is competent at not having too many typos in his slides/assignments/tests. His homeworks and exams are actually pretty enjoyable.\nIn retrospect, I would've understood the material a lot more efficiently if I didn't attend lecture. Seriously. There is nothing to be gleamed from listening to him lecture that is not in the slides. The class figures this out about 1 week into class.\nWorkload:\n40% Midterm and 40% non-cumulative final both pretty fair with the final being harder. 10 homeworks 20%\n"
        }
    ]
}