{
    "prof_info": [
        {
            "prof_name": "Mark Anderson",
            "prof_id": 282,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "The Idea of Music in German Literature",
            "review_date": "May 12, 2004",
            "review_content": "\nAnderson is an excellent professor.  He knows the material well, knows how to present it well, and (though sometimes he makes it clear that he really doesn't agree) is interested in what the students have to say.\nThe texts we read (from the Magic Flute to Sebald) are uniformly good reads.  This is one of the few heavy reading (relatively heavy, often a novel a week, though sometimes just some poetry) classes I had in which I've done all the reading and wanted to do it.\nDon't expect too much music though.  Anderson is a literature prof.  He seems to be a big music fan, but it's not his area.  With some of the works the connection to music is pretty much abandoned.  That said, some of the connections were really insightful.\nIf you'd like to have the opportunity to read a lot of the highlights of German Literature, have intelligent discussions about them, and get some credit, take this class.\nWorkload:\nReading for the week ranged from all of Faust and the Birth of Tragedy to a few poems by Celan.\nWeekly response papers of at least one page - half way through the semester he decided to start grading these and knock one of the papers off the syllabus.\nMidterm - essay style.\nOne final paper (5-7 pages) on one of several topics he suggests or your choice.\n"
        },
        {
            "course_name": "Problems of the Gothic",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Anderson has a gift as special as being a great lecturer - he knows how to lead interesting and intelligent discussions and how to make all the students comfortable enough to participate. While he is always well-prepared with his own ideas and questions, he's flexible and curious enough to let the discussion flow from Dracula to AIDS to Scooby-Doo and back. One novel a week, generally short and exciting gothic stories, and occasional films. Bi-weekly 3 page max papers, on any topic, which he grades fairly and which help generate thoughts for discussion before class. A genuinely enthusiastic teacher.\n"
        }
    ]
}